[
    {
        "query": "Arthur A. Smith Covered Bridge was modestly damaged by a hurricane in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television show did a star of Imaginary Friend gained prominence in for her role as Claudia Salinger?",
        "response": "\"Party of Five\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Haruo Nakajima, was a Japanese actor, best known for portraying who, in twelve consecutive films, starting from the original \"Godzilla\" (1954) until \"Godzilla vs. Gigan\" (1972)?",
        "response": "Godzilla",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the boxer whose technical knockout caused Carlos Morocho Hernández to end his career born?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the British award that was won by both Paul Rodgers and Gary Barlow ?",
        "response": "Ivor Novello Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Encore Las Vegas, is a luxury resort, casino and hotel located on the Las Vegas Strip in Paradise, Nevada, the resort is connected to its sister resort, Wynn Las Vegas; both are owned by which publicly traded corporation based on the Las Vegas Strip, Nevada that is a developer and operator of high end hotels and casinos?",
        "response": "Wynn Resorts",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2008 documentary film produced and directed by Tia Lessin and Carl Deal, is included in an American independent film distributors library who's films are strongly auteur-driven?",
        "response": "Trouble the Water",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the coach who led the 2007 South Carolina Gamecocks football team in his third season as USC head coach born?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Mark L. Lester or Peter Cattaneo?",
        "response": "Mark L. Lester",
        "source": "hotpot_qa"
    },
    {
        "query": "To what areas did the new Class 185 diesel trains regularly run from the York Leeman Road depot?",
        "response": "Northern England as well as Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Exile was a game that was in the demoware series created by whom?",
        "response": "Jeff Vogel",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed Irreplaceable You starring British stage and film actress Gugu Mbatha-Raw?",
        "response": "Stephanie Laing",
        "source": "hotpot_qa"
    },
    {
        "query": "Sleigh Ride is a piece of music written by composer described by whom as \"one of the great American masters of light orchestral music\"?",
        "response": "John Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Which second governor was the territory, split into Mississippi and Alabama in 1819, named after? ",
        "response": "William Claiborne",
        "source": "hotpot_qa"
    },
    {
        "query": "The northern English anglian Kingdom in the Humber estuary spoke what dialect of english?",
        "response": "Northumbrian",
        "source": "hotpot_qa"
    },
    {
        "query": "Randal Cornell Teague is the former chief of staff and legislative counsel to a U.S. Representative that died in what year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the clubhouse of the Danish football club that lost in the 2010-11 Danish Superliga?",
        "response": "Ådalen",
        "source": "hotpot_qa"
    },
    {
        "query": "Michelle Mitchenor appeared on what Shane Black-created show?",
        "response": "Lethal Weapon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the singer with which Castor McCord played with in the 1920s?",
        "response": "Satchmo",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Sam Wanamaker and James Broughton who was an early bard of the Radical Faeries?",
        "response": "James Broughton",
        "source": "hotpot_qa"
    },
    {
        "query": "Susanna Thompson appeared in the courtroom drama film Ghosts of Mississippi, directed by who?",
        "response": "Rob Reiner",
        "source": "hotpot_qa"
    },
    {
        "query": "Chase & Status, an English drum and bass production band composed of Saul Milton (Chase) and Will Kennard (Status), collaborated with what artist, who rose to fame with the release of her debut studio album \"Music of the Sun\" and its follow-up \"A Girl like Me\"?",
        "response": "Rihanna",
        "source": "hotpot_qa"
    },
    {
        "query": "How are elephants connected to Gajabrishta?",
        "response": "Sanskrit",
        "source": "hotpot_qa"
    },
    {
        "query": "When would be the album release in which \"Too Much to Ask\" is the third single song?",
        "response": "October 20, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Tim Webber is an English visual effects supervisor, he is known for his work on The Dark Knight, a 2008 superhero film directed, co-produced, and co-written by who?",
        "response": "Christopher Nolan",
        "source": "hotpot_qa"
    },
    {
        "query": "Edith Birkhead wrote a Gothic work at the University of Bristol which is located where?",
        "response": "Bristol, United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the person for whom The Mevlana Mosque in Rotterdam was named for?",
        "response": "30 September 1207",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the actor who stared in Tracers and The Twilight Saga?",
        "response": "February 11, 1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Among the prominent members of the Walla Walla expeditions was member of tribe whose reservation is how many square miles in total?",
        "response": "237",
        "source": "hotpot_qa"
    },
    {
        "query": "Are European astronauts Pedro Duque and Franco Malerba both from Italy?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Double Jeopardy is a 1999 film starring an American political activist best known for an ongoing acting career spanning how long?",
        "response": "more than two decades",
        "source": "hotpot_qa"
    },
    {
        "query": " Dave Franco had a roll in what 2013 American heist thriller?",
        "response": "Now You See Me",
        "source": "hotpot_qa"
    },
    {
        "query": "John Sawyer was born in  what small city in Lincoln County, Mississippi that is the county seat of Lincoln County?",
        "response": "Brookhaven",
        "source": "hotpot_qa"
    },
    {
        "query": "Laura, is a Peruvian talk show, hosted by which Peruvian talk show hostess, and lawyer, best known for her Spanish-language talk show?",
        "response": "Laura Bozzo",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Alek Keshishian and Kirk Kerkorian both Armenian-American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Sheila Hutchins was Cookery Editor of a tabloid newspaper that as of December 2016 had an average daily circulation of what?",
        "response": "391,626",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has been making music long Eric Gaffney or Pearl Jam?",
        "response": "Eric Gaffney",
        "source": "hotpot_qa"
    },
    {
        "query": "What is is a French language monthly general interest and women's magazine published in Paris, France, Jane or Pleine Vie?",
        "response": "Pleine Vie",
        "source": "hotpot_qa"
    },
    {
        "query": "What supporter of the Formula Kart Stars was also the only driver to have won at least one Grand Prix in every season he has competed in?",
        "response": "Lewis Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which formed first, Fireflight or Dirty Three?",
        "response": "Dirty Three",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Smyrnium and Nymania both types of plant?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What network  aired the sitcom that starred John Amos as the father of Lisa Wilkes?",
        "response": "NBC",
        "source": "hotpot_qa"
    },
    {
        "query": "Markus Löw is the brother of the head coach of what team?",
        "response": "Germany national team",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the brother of the #2 contender in the UFC Middleweight  division born in?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chevrolet Bruin was assembled by the division of GM that focuses on what type of vehicles?",
        "response": "trucks and utility vehicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Madly Madagascar, released on which date, is a direct-to-DVD Valentine's Day short film starring the characters from the \"Madagascar\" film series, David Schwimmer, an American actor, director, and producer, returned to voice a main character?",
        "response": "January 29, 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Peace Palace Library located?",
        "response": "It is located in The Hague, Netherlands, and was established to support the Permanent Court of Justice",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the bank that filed a lawsuit against WikiLeaks located in?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a brief but violent period of civil unrest in response to the Maine law, who's opponents of an American Prohibition advocate and politician Nicknamed the \"Napoleon of Temperance\" rioted ?",
        "response": "Portland Rum Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "What science fiction thriller starred Nicholas Cage and was directed by Alex Proyas?",
        "response": "Knowing",
        "source": "hotpot_qa"
    },
    {
        "query": "British Men Only Magazine featured Debbie Ashby in 1967, what year was it founded?",
        "response": "1935",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Lobo\" and \"Jonas Glim\" are both characters published by which comic book company?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town at the intersection of Interstate Highways 77 and  the longest Interstate highway within the borders of Virginia?",
        "response": "8,211 at the 2010 census",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2001, Hampton Pirates men's basketball beat a 2nd Seed team coached by who ?",
        "response": "Larry Eustachy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the sixth British and eighth American studio album by the Rolling Stones, that was parodied by a series of humorous compilations of critically lambasted cover versions of songs, performed mostly either by celebrities known for something other than musical talent?",
        "response": "Satanic Majesties Request",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Farrell reported on the most destructive hurricane of what season, when it hit the northeastern United States?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Mimi Ferzt Gallery was a space that exhibited which Russian painter and sculptor?",
        "response": "Mihail Mikhailovich Chemiakin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the costar of a movie with the star of Scott McCall and was directed by the director of Supernatural?",
        "response": "Dylan O'Brien",
        "source": "hotpot_qa"
    },
    {
        "query": "TKB-408 was a precursor to which heavily-modified Kalashnikov rifle as selected by the Red Army?",
        "response": "AK-47",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is played on a wooden board, GridIron Master or Twister?\\",
        "response": "GridIron Master",
        "source": "hotpot_qa"
    },
    {
        "query": "Willis & Geiger Outfitters outfitted which female aviation pioneer who helped form the WAAC?",
        "response": "Jacqueline Cochran",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  English ice dancer born who toured with Garanina, Zavozin and Christopher Dean, and also won a gold medal at the 1984 Winter Olympics?",
        "response": "7 October 1957",
        "source": "hotpot_qa"
    },
    {
        "query": "The Carnival Ecstasy was christened by an American television host that was born in what year?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "What platinum selling track was included on the album \"The Warrior's Code\" with lyrics by Woody Guthrie?",
        "response": "I'm Shipping Up to Boston",
        "source": "hotpot_qa"
    },
    {
        "query": "Artesia, is a city in southeast Los Angeles County, California, and the home of the East West Ice Palace, an ice rink which is co-owned, by which retired figure skater ?",
        "response": "Michelle Kwan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country covers more than one-eighth of the Earth's inhabited land area, and is home to ethnomusicologist Izaly Zemtsovsky?",
        "response": "Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Romeo and Juliet and Madama Butterfly operas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer with real name of Jane was a guest on Sarkodie's live album?",
        "response": "Jane Awindor (born 10 April 1987), better known by her stage name Efya,",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Indian female singer born who does the song \"Meri Chunar Udd Udd Jaye\"?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Toy Story 3 and Mary Poppins both Walt Disney movies?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the upcoming debut studio album by English singer and songwriter Liam Gallagher featuring the solo single Wall Of Glass?",
        "response": "As You Were",
        "source": "hotpot_qa"
    },
    {
        "query": "Until what year did the political party of which Benjamin Tallmadge was elected to the United States House of Representatives as a member control the federal government?",
        "response": "1801",
        "source": "hotpot_qa"
    },
    {
        "query": "Cabine C (Portuguese for \"Cabin C\") was a short-lived Brazilian post-punk band from São Paulo, vocalist Ciro Pessoa's lyrics influenced by Romantic and Symbolist poets such as Edgar Allan Poe, ( born Edgar Poe; January 19, 1809) an American writer, editor, and literary critic, death date?",
        "response": "October 7, 1849",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 Cotton Bowl was played at the stadium that was the home of which NFL team?",
        "response": "Dallas Cowboys",
        "source": "hotpot_qa"
    },
    {
        "query": "Polar Bears International (PBI) is the world's leading polar bear conservation organization, another major sponsor include which Canadian manufacturer of winter clothing?",
        "response": "Canada Goose Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which had a bigger population in the 2016 census: Queens or Staten Island?",
        "response": "Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "The M2 Hyde was superior to what American firearm, invented in 1918?",
        "response": "Thompson submachine gun",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American astronomer who made a research work on Holmdel Horn Antenna born? ",
        "response": "January 10, 1936",
        "source": "hotpot_qa"
    },
    {
        "query": "What district is the Warner Bros. Studios located in?",
        "response": "the Three Rivers district.",
        "source": "hotpot_qa"
    },
    {
        "query": "Erica Carroll had an acting role in the American-Canadian sci-fi horror film from 2011 directed by whom?",
        "response": "Gonzalo López-Gallego",
        "source": "hotpot_qa"
    },
    {
        "query": "Iru Mugan stars the actress who has won which two awards for her work?",
        "response": "Filmfare Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Derrickson and Umberto Lenzi, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of nuclear chemistry published an important series of lectures in what year?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Chicago Rockford International Airport or McClellan–Palomar Airport closer to their nearest cities?",
        "response": "McClellan–Palomar Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album featuring Darlene Love peaked at number 13 on \"Billboard\" magazine's special, year-end, weekly Christmas Albums sales chart in December 1963?",
        "response": "A Christmas Gift for You from Phil Spector",
        "source": "hotpot_qa"
    },
    {
        "query": "Castra of Izbășești was made in this province that was the largest territorial and administrative unit of the empire's territorial possessions outside of Italy until what year",
        "response": "293 AD",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Matty Mullins and Wayne Coyne from the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "how is The Writer and Official Xbox Magazine connected?",
        "response": "published",
        "source": "hotpot_qa"
    },
    {
        "query": "Wyckoff Company and Pacific Creosoting Company have been located on what Washington island?",
        "response": "Bainbridge Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Psychiatric Institute of Washington and MedStar National Rehabilitation Hospital both located in Washington D.C.?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Nigerian-born singer sang backup for a band named Pride?",
        "response": "Sade",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the conductor with whom Philip Powers has worked, whom has also received five Grammy awards?",
        "response": "Vladimir Ashkenazy",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the man who allegedly shot Mark Moran?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the English Bishop of London sometimes known as Lupus who wrote the recensions collectively known as \"Recensions B\"?",
        "response": "Wulfstan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Barbara Windsor in the film \"Cor, Blimey!\"? ",
        "response": "Samantha Spiro",
        "source": "hotpot_qa"
    },
    {
        "query": "Swiss music duo Double released their best known single \"The Captain of Her Heart\" in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": " Alice in Wonderland features the Queen of Hearts' voice by which American actress who was best known for providing many voices in numerous Disney animated films?",
        "response": "Verna Felton",
        "source": "hotpot_qa"
    },
    {
        "query": " The San Francisco Fire Department provides services to a small island that was used as a what from 1934 until 1963?",
        "response": "federal prison",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Buried Country and South of the Border both films turned into stage performances?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Church Age is the fourth album by Mr. Del, as a play on which traditional logo that adorns many hip hop albums, the cover of this album features which warning label first introduced by the Recording Industry Association of America (RIAA) in 1986  logo that says \"Spiritual Advisory Gospel Content\", ",
        "response": "Parental Advisory",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Abu Sakara Foster is the candidate from the party based on the ideas of which first President of Ghana?",
        "response": "Kwame Nkrumah",
        "source": "hotpot_qa"
    },
    {
        "query": " Chad A. Lupinacci is an Assembly member whose districts include one with a population of what as of the 2010 census?",
        "response": "11,177",
        "source": "hotpot_qa"
    },
    {
        "query": "Turn Coat is the 11th book in a series from which the first novel was published in which year ?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the the origin of the player that the Bull's traded with 76ers during the 1999-2000 midseason?",
        "response": "Croatian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Jared Kushner's father-in-law?",
        "response": "Donald Trump",
        "source": "hotpot_qa"
    },
    {
        "query": "Lex Luger, who handled production in Brake Lights, is also a retired what?",
        "response": "professional wrestler",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University did the gymnastics coach, who recruited a two time gold medal winner in the 1984 Summer Olympics, attend?",
        "response": "University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Lewinella xylanilytica is a bacterium that was found near which natural World Heritage Site?",
        "response": "Jeju Volcanic Island and Lava Tubes",
        "source": "hotpot_qa"
    },
    {
        "query": "What part did the star of The Michael J. Fox Show have on Spin City?",
        "response": "Mike Flaherty",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Dutch football manager and former midfielder managed Urby Vitorrio Diego Emanuelson?",
        "response": "Maarten Cornelis \"Martin\" Jol",
        "source": "hotpot_qa"
    },
    {
        "query": "The Best of: '94-'99 is an ablum by British rock band Bush and contains their performance at the second large-scale music festival that attempted to emulate the original festival held in what year?    ",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Cedric Moodie, is an American professional basketball player who last played for the Brampton A's of the National Basketball League of Canada (NBL), Moodie has experience playing in multiple countries across the world outside of Canada, primarily which top-tier level of the Argentine basketball league system? ",
        "response": "Liga Nacional de Básquet",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the affiliated television stations of WWDP?",
        "response": "Eden Prairie, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "What company is the company which uses jrMan renderer a subsidiary of?",
        "response": "The Walt Disney Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the HBO miniseries in which Scott Richard Grimes starred as Technical Sergeant Donald Malarkey?",
        "response": "Scott Grimes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French novelist was defended by Antoine Marie Jules Sénard  a French lawyer and Politician in an action against his debut novel \"Madame Bovary\" ?",
        "response": "Gustave Flaubert",
        "source": "hotpot_qa"
    },
    {
        "query": "At 2006 Dubai Tennis Championships – Men's Singles, Rafael Nadal defeated the defending champion who has won how many Grand Slam singles titles?",
        "response": "19",
        "source": "hotpot_qa"
    },
    {
        "query": "Love Drunk included the single that features which American singer?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "Perquenco was declared the capital of a kingdom by which lawyer?",
        "response": "Orélie-Antoine de Tounens",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did the host of the Miss Teen USA 1998 pageant play in the TV series Saved by the Bell ?  ",
        "response": "A.C. Slater",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the subject of The Flying Irishman born?",
        "response": "Galveston, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the writer of \"I'll Try Something New\" born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case dealt with same-sex relations, Stenberg v. Carhart or Lawrence v. Texas?",
        "response": "Lawrence v. Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Holingol and Yicheng, Hubei cities in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Philips Videopac + G7400 and Acorn Electron both computer-based systems?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the number one hit released by the rapper also known for his The Streets Made Me album?",
        "response": "Slow Motion",
        "source": "hotpot_qa"
    },
    {
        "query": "The Last Rites of Ransom Pride is a 2010 American action-western film starring Lizzy Caplan and Scott Speedman, a British-Canadian film and television actor known for playing what character in the coming-of-age drama television series \"Felicity\"?",
        "response": "Ben Covington",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Steyr SSG 04 and Steyr SSG 08 both developed?",
        "response": "Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was directed by Harold Ramis and stars Bill  Murray?",
        "response": "Groundhog Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer is from France, André Gide or Mongo Beti?",
        "response": "André Paul Guillaume Gide",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to starring Mel Blanc's voice, the cartoon Cat-Tails for Two features music by which musician?",
        "response": "Carl Stalling",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tony Hadley and Ian Ball of the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The game engine Decima was used to develop which game where the main character is a hunter and archer?",
        "response": "Horizon Zero Dawn",
        "source": "hotpot_qa"
    },
    {
        "query": "The Anna Louise Inn is a contributing building to which Cincinnati historic district?",
        "response": "Lytle Park Historic District",
        "source": "hotpot_qa"
    },
    {
        "query": "N J Nandini won an award named after what Carnatic music singer from Palakkad?",
        "response": "Chembai Vaidyanatha Bhagavatar",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known for featuring exclusive interviews with a Spanish professional footballer who plays as a central midfielder for Qatari club Al Sadd SC?",
        "response": "Ash Hashim",
        "source": "hotpot_qa"
    },
    {
        "query": "Ana Mulvoy-Ten plays the character Amber Millington on a tv series developed for what network?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Hendry is a special assistant to the GM who has served in such capacity since what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is fictional, Rabo Karabekian or Karnig Sarkissian, or both?",
        "response": "Rabo Karabekian",
        "source": "hotpot_qa"
    },
    {
        "query": "How many seats the central campus of the church founded by John Hillery Osteen have?",
        "response": "16,800-seat",
        "source": "hotpot_qa"
    },
    {
        "query": "From Here to Eternity is a 1953 drama film directed by Fred Zinnemann, Deborah Kerr portrayed one of the women in their lives, Kerr was a film, theatre and television actress, of which nationality?",
        "response": "Scottish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which host of American Top 40 referred to Jon Peter Lewis as JPL?",
        "response": "Ryan Seacrest",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator and writer of all the movies in the Chucky and Child's Play horror franchise?",
        "response": "Don Mancini",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the premiere date of the TV show that has an episode called \"Waldorf Stories\"?",
        "response": "July 19, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the album that was the first for this artist since 2004 and also resulted in this artist's follow-on album being renamed since it contained different music?",
        "response": "Relapse",
        "source": "hotpot_qa"
    },
    {
        "query": "In which American space drama film did Clint Eastwood star with the actor who played Bret Maverick in the 1950s western comedy series \"Maverick\"?",
        "response": "Space Cowboys",
        "source": "hotpot_qa"
    },
    {
        "query": "We (Don't) Care is the first release by an American rock band that was formed in what year?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Which child actress began her career in 2006 and also stared in the television series The Emperor: Owner of the Mask?",
        "response": "Kim So-hyun",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Serguei Kouchnerov and Arvid E. Gillstrom both in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this private liberal arts college where Robert S. McElvaine is a professor at founded?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": " Sentimiento Latino is a 2006 album of Latin American popular and classical songs by Juan Diego Flórez, particularly known for his roles in what?",
        "response": "bel canto operas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Georgia city has State Route 317 running through it?",
        "response": "Suwanee",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian actress born in 1973 starred in the film Feast of Love?",
        "response": "Radha Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "How many novels are there in series of novels which were adapted for a 2015 BBC TV  series in which Ruby Bentall plays a character called Verity ?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of animal are both Sakhalin Husky and Neapolitan Mastiff?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which  Lee Min-ho has his first leading role? ",
        "response": "Yoo Ha",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul McEuen received his B.S. in engineering physics at a university offering how many master's programs?",
        "response": "160",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is closer in proximity to Richmond County, Georgia, Augusta Regional Airport, or Wichita Dwight D. Eisenhower National Airport?",
        "response": "Augusta Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  Indian businessman who was the managing director of Escorts Group born",
        "response": "18 March 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Which record producer helped produce the album \"I Brought You My Bullets, You Brought Me Your Love?\"",
        "response": "Kato Khandwala",
        "source": "hotpot_qa"
    },
    {
        "query": "Bastian Pagez devised part of the entertainment at the baptism of Prince James at what location that sits atop Castle Hill, and is one of the largest and ost important castles in Scotland?",
        "response": "Stirling Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Russian pop girl group from in which Sataney Setgalievna Kazanova was one of the three vocalists until 2010?",
        "response": "Moscow",
        "source": "hotpot_qa"
    },
    {
        "query": "Nikita Mikhalkov and Taylor Hackford, are Russian?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Gandharva Mahavidyalaya, New Delhi came into being to memorialize which Hindustani musician?",
        "response": "Pandit Vishnu Digambar Paluskar",
        "source": "hotpot_qa"
    },
    {
        "query": "Save Me is a song by the group that was part of the genre that evolved from disco in what timeframe?",
        "response": "later 1970s",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Battle of the Heroes\" is a musical theme from a movie, that was written by which American composer, conductor, and pianist, with a career spanning over six decades?",
        "response": "John Towner Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Forever and Ever was co-written by the record producer who earned what British Academy of Songwriters honor in 2009?",
        "response": "Gold Badge",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the  American global donut company which Mason Reese appeared in its television commercials based in ",
        "response": "Canton, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the featured in the documentary,  Imagine the Sound, and is known for his passionately Afrocentric music of the late 1960s?",
        "response": "Archie Shepp",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan Drake,  the protagonist of the \"Uncharted\" video game series, who was the voice and motion capture artist, that played him? ",
        "response": "Nolan Ramsey North",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist was also a short story writer, João Guimarães Rosa or Philip Pullman?",
        "response": "João Guimarães Rosa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band from East London had Steve Marriott as a band member?",
        "response": "Small Faces",
        "source": "hotpot_qa"
    },
    {
        "query": "David Graham was born in a metropolitan area than includes which lake ?",
        "response": "Lake Macquarie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked out of Pristina's administrative center in 2008?",
        "response": "Designate Ambassador Naim Mala",
        "source": "hotpot_qa"
    },
    {
        "query": "Finna Get Loose is a song by Puff Daddy and what American rapper who is also a record and film producer?",
        "response": "Pharrell Lanscilo Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian city was the venue for the Tokers Bowl from 2002 until a police raid in 2006?",
        "response": "Vancouver",
        "source": "hotpot_qa"
    },
    {
        "query": "MTV1987 was written by the rapper from what Texas city?",
        "response": "Corpus Christi",
        "source": "hotpot_qa"
    },
    {
        "query": "The book The Tale of Jemima Puddle-Duck was written at which famous house?",
        "response": "Hill Top",
        "source": "hotpot_qa"
    },
    {
        "query": "The Family Jams featured members of the commune based in what state?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Who started directing films first Hal Ashby or Oscar Apfel ?",
        "response": "Oscar C. Apfel",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Kurt Sohn and Huntington High School have in common?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "For what was one of the people who accepted It's Raining Men known?",
        "response": "distinctive and powerful voice",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Rentals and Kula Shaker both English bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor that starred in the South Korean drama \"Shopping King Louie\" was born on September 17, 1995?",
        "response": "Nam Ji-hyun",
        "source": "hotpot_qa"
    },
    {
        "query": "Marina Raquel Riofrío, is an Argentine Justicialist Party politician, and was born in San Juan, the capital city of the Argentine province of San Juan in which region?",
        "response": "Cuyo",
        "source": "hotpot_qa"
    },
    {
        "query": "What British show is a Jewish comedian created Russian sketch show based on?",
        "response": "Little Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1990 Hawthorn Football Club began the season after winning the championship game against what club?",
        "response": "Geelong Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What state is the stadium originally named Baylor Stadium and home to the Baylor Bears in?",
        "response": "Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of cargo does Union Pacific Railroad that Iowa State Representative Matt W. Windschitl worked for haul?",
        "response": "a freight hauling railroad that operates 8,500 locomotives",
        "source": "hotpot_qa"
    },
    {
        "query": "Magical girl is a subgenre found in which American animated television series first shown by Disney in 2015?",
        "response": "Star vs. the Forces of Evil",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of content is LaIsha and Allure?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Kilzone 3's voice actress La'Myia Good appeared in a television show starring which twins?",
        "response": "Tia and Tamera Mowry",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1985 NCAA Division I-A football season ended with the team led by the coach who went on to helm what NFL team as champions?",
        "response": "Dallas Cowboys",
        "source": "hotpot_qa"
    },
    {
        "query": "Were The Bravery and For Against both from the same city? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state is the public university whose football team won the 1957 NAIA championship?",
        "response": "Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which official state flag is used by the stadium handlers of Alph Phi Omega?",
        "response": "The flag of Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "What do The Tea Party and Train have in common? ",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Anna Howard Shaw Day starred the actor, director, and producer who was best known for playing what character on Mad Men?",
        "response": "Don Draper",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2009 Chinese television series starred a singer and actor who gained his fame through Super Boy, a televised singing competition?",
        "response": "Meteor Shower",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Francese works with many non-profit organizations and major American corporations, such as one of  the largest global providers of insurance, annuities, and employee benefit programs with how many customers?",
        "response": "90 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Joshua Cushman, was a U.S. Representative from Massachusetts and from Maine, he was pastor of the Congregational Church for nearly twenty years, in Winslow, a town and census-designated place in Kennebec County, Maine, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "what does 1977–78 UCLA Bruins men's basketball team and John Wooden have in common?",
        "response": "University of California",
        "source": "hotpot_qa"
    },
    {
        "query": "What city shares a Cadastral Division with a village that had only 89 people at the 2006 census?",
        "response": "Broken Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Ignatius, located on Flathead Indian Reservation, is listed in what register?",
        "response": "National Register of Historic Places",
        "source": "hotpot_qa"
    },
    {
        "query": "University of North Georgia includes a campus location in which city that is the sole incorporated area in the county of Forsyth?",
        "response": "Cumming",
        "source": "hotpot_qa"
    },
    {
        "query": "The Supreme Court Justice who delivered the majority opinion in the Lewis v. Clarke case is the first Supreme Court justice of what heritage?",
        "response": "Hispanic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary film was released first, Man with a Movie Camera or The Devil and Daniel Johnston?",
        "response": "Man with a Movie Camera",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Let Yourself Go\"is written which member ,and songwriter of Green Day ?",
        "response": "Billie Joe Armstrong",
        "source": "hotpot_qa"
    },
    {
        "query": "What country's embassy is located in the neighbourhood of Washington D.C. names after Rear Admiral Samuel Francis Du Pont?",
        "response": "Jamaica",
        "source": "hotpot_qa"
    },
    {
        "query": "Spanish Fly was a film that had a cast including the operatic actor who received what honor in 1993?",
        "response": "National Medal of Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the composer of Invention die?",
        "response": "12 June 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of the 2012 Alabama Republican primary represented what state as United States Senator?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "\"GTO\" is a song by Sinitta, the song is about a girl whose boyfriend cares more about his car, than her, a GT car produced by Ferrari from 1962 to 1964 for homologation into the FIA's Group 3 Grand Touring Car category?",
        "response": "Ferrari 250 GTO",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Georges Bizet or Hans Pfitzner?",
        "response": "Georges Bizet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which countries are assembled on the committee of which the first female Danish Prime Minister is president?",
        "response": "the Nordic countries",
        "source": "hotpot_qa"
    },
    {
        "query": "What two sitcoms included appearances from an English actress and comedian who also acted in Rush Hour?",
        "response": "\"Hyperdrive\" and \"Not Going Out\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Geoff Knorr worked on several video game titles, including what turn-based 4X video game that was developed by Firaxis Games?",
        "response": "Civilization VI",
        "source": "hotpot_qa"
    },
    {
        "query": "El Chavo is a video game published by Slang Publishing, that was based on what Mexican animated series that was based on another TV series created by Roberto Gomez Bolanos?",
        "response": "El Chavo Animado",
        "source": "hotpot_qa"
    },
    {
        "query": "What Shakespeare play did Madoline Thomas played a role in?",
        "response": "The Comedy of Errors",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Marc Rosset and Guillermo Vilas both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What 15th century castle is owned by a British Businessman and former Member of the European Parliament from 1979 to 1999?",
        "response": "Dundas Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are Mike Shinoda and Jean Terrell?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "John Alfred \"Johnny\" Lewis, is an Australian boxing trainer who is best known for working with six World Champions, most notably Jeff Fenech and which Soviet-born Australian former professional boxer who competed from 1992 to 2005?",
        "response": "Kostya Tszyu",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Moving On\" is the sixteenth episode of the ninth season of the American comedy television series \"The Office\" and the 192nd episode overall, the episode guest stars Bob Odenkirk, an American actor, comedian, writer, director and producer, best known for his role as dubious smooth-talking lawyer Saul Goodman/Jimmy McGill on which organization's crime drama series \"Breaking Bad\" and its spin-off \"Better Call Saul\"?",
        "response": "AMC",
        "source": "hotpot_qa"
    },
    {
        "query": "Which multinational aerospace and transportation company based in Montreal, Quebec, Canada jointly developed the Class 430 EMU with Alstom?",
        "response": "Bombardier Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain has a higher peak and is located in the Nepalese Himalayas: Himalchuli or Chogolisa? ",
        "response": "Himalchuli",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the creator of a fictional town setting for the program Prairie Home Companion created in 1974?",
        "response": "Garrison Keillor",
        "source": "hotpot_qa"
    },
    {
        "query": "Prasad's dance choreographer is what Indian choreographer, who was noted as one of the first to bring contemporary jazz and western forms of dance to India?",
        "response": "Shiamak Davar",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to Aled Jones, Jamie Cullum, Clare Teal and the English tenor born in September 1973, who else have the City of Bath Male Choir sung with?",
        "response": "Rhiannon Lambert",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Waiʻ aleʻ ale and Kauaʻ i are examples of place names that employ what unicameral consonant letter?",
        "response": "ʻ okina",
        "source": "hotpot_qa"
    },
    {
        "query": "John King is the producer for Paul's Boutique, by the beastie Boys.  When was this album released?",
        "response": "July 25, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Toots Shor's Restaurant was often frequented by a baseball player who played for what team?",
        "response": "New York Yankees",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Roger Christian and Joe D'Amato make films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a magazine about technology, Lumpen or Linux Journal?",
        "response": "Linux Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the religion of the man that Fort Carroll is named after?",
        "response": "Catholic",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city of Pennsylvania can you find Veterans Stadium with a seating capacity of 56,371 for baseball and where the 1996 Major League Baseball All-Star Game, a midsummer classic was played? ",
        "response": "Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was Jamie Lee Curtis awarded a BAFTA Award in a supporting role which starred Dan Aykroyd and Eddie Murphy?",
        "response": "Trading Places",
        "source": "hotpot_qa"
    },
    {
        "query": "Socialist conferences were held with what countries that opposed the Central Powers in the First World War?",
        "response": "The Allies of World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "What county was Tom Hewitt born in?",
        "response": "Ravalli County, Montana",
        "source": "hotpot_qa"
    },
    {
        "query": "Museum of Illumination and Heating Appliances and Vasat Atik Ali Pasha Mosque,  are located in Istanbul, in which country?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a film that starred Ryan Kelley?",
        "response": "Jacob Aaron Estes",
        "source": "hotpot_qa"
    },
    {
        "query": "Religion in Greenland and Church of Denmark are what religion by orientation?",
        "response": "Lutheran",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor appeared in the movies “Man Of A Thousand Faces” and \"Angels with Dirty Faces?\"",
        "response": "James Cagney",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Magee won a bronze medal at which Kuala Lumpur 1998 competition?",
        "response": "1998 Commonwealth Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie featuring Sara Lindsey is based on an expose published by \"GQ\" magazine?",
        "response": "Concussion",
        "source": "hotpot_qa"
    },
    {
        "query": "Kuzhal pattu is a form of traditional temple music practised in which state of India, with a  long and rich history?",
        "response": "Kerala",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Soviet revolutionary and political leader created the Order of Maternal Glory?",
        "response": "Joseph Stalin",
        "source": "hotpot_qa"
    },
    {
        "query": "The band Felix Haug was the drummer and keyboardist for was best known for what hit single?",
        "response": "\"The Captain of Her Heart\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the two-person Omnimover dark ride in Tomorrowland replaced by Delta Dreamflight?",
        "response": "If You Had Wings",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of the essay collection Maps and Legends was born in what year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Which public high school did Jim Beattie star in?",
        "response": "South Portland High School",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area of the town that Church of St. Anne is located in (in Acres)?",
        "response": "887",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first member to die on a team of animators Milt Kahl belonged to?",
        "response": "John Lounsbery",
        "source": "hotpot_qa"
    },
    {
        "query": "Tritonia and Phyteuma are both names for a what of plants?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "Teddy Riley has done production work with which R&B singer and actor?",
        "response": "Keith Douglas Sweat",
        "source": "hotpot_qa"
    },
    {
        "query": "What competition held in Kathmandu, Nepal did Julian Bolling compete in 1984?",
        "response": "1984 South Asian Games",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Belgium racer Stoffel Vandoorne win the Monaco GP2 Series round?",
        "response": "22 and 23 May 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Maria von Weber and Friederike Grün were both what nationality?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "The History of Ranching is a mural that was originally located at an American brewery that in 1999 began trasfering its production to who?",
        "response": "Miller Brewing",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Spanish football team that plays in Segunda División B – Group 4 and features Francisco Javier Pérez Páez in central midfield founded?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Racing with the Moon starred an American actress born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Which nationality is shared between George Adomian and Aram Avakian? ",
        "response": "Armenian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "If Serissa is a genus of a flowering plant, what is Westringia a genus of?",
        "response": "Westringia is a genus of Australian shrubs.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was a Nobel Laureate, Ryūnosuke Akutagawa or Claude Simon?",
        "response": "Claude Simon",
        "source": "hotpot_qa"
    },
    {
        "query": "Tinker Owens was the younger brother of which NFL running back?",
        "response": "Loren Everett \"Steve\" Owens",
        "source": "hotpot_qa"
    },
    {
        "query": "The Von Bondies and Yo La Tengo,  are which genre of a musical group?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ivan Dodig and Marcelo Melo both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "ACF Fiorentina returned to Serie A, following a two-year absence after the bankruptcy of the previous incarnation of the club, which Spanish retired footballer who played as a forward, were among the highly rated players to sign up for Fiorentina, either permanently or on loan?",
        "response": "Javier García Portillo",
        "source": "hotpot_qa"
    },
    {
        "query": "Walt Zeboski photographed which 40th President during his campaign in 1980?",
        "response": "Ronald Wilson Reagan",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Mala Mala or Train Life come first?",
        "response": "Train Life",
        "source": "hotpot_qa"
    },
    {
        "query": "Both North Rock and Machias Seal Island are nearest to which U.S. State?",
        "response": "Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Finest Worksong is a single from an R.E.M. album released in what year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "What are country are both John Wayne Airport and Brainerd Lakes Regional Airport located in?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people are currently employed by the national public broadcasting company of Lithuania which organised the Eurovision Song Contest 2013?",
        "response": "650",
        "source": "hotpot_qa"
    },
    {
        "query": "After whom was the area, where  The Phillips Collection is located, named ?",
        "response": "Samuel Francis Du Pont.",
        "source": "hotpot_qa"
    },
    {
        "query": "What American comedy-drama television series set in Chicago did Danika Yarosh appear in?",
        "response": "Shameless",
        "source": "hotpot_qa"
    },
    {
        "query": "What state was the dissenter in Kessler v. Treat from?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "what year was the cover artist of Multiverse: Exploring Poul Anderson's Worlds born ?",
        "response": "September 13, 1960",
        "source": "hotpot_qa"
    },
    {
        "query": "State the birth date of one of Dil-e-Beqara's stars ?",
        "response": "24 December 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "How many songs did the star of 2009s Bride Wars perform on the Ella Enchanted original soundtrack?",
        "response": "performs three songs on this album",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was the queen for whom Robert Keate served as Serjeant-Surgeon also Empress of?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Korda and Spencer Gordon Bennet, have which mutual occupations?",
        "response": "film producer and director",
        "source": "hotpot_qa"
    },
    {
        "query": "Marco de la O stars in the title role of El Chapo which premiered on which network in April 2017?",
        "response": "Univision",
        "source": "hotpot_qa"
    },
    {
        "query": "Ranulf I, was the count of Caiazzo in the Principality of Capua from about 1078, he also brought the formerly Lombard counties of Alife, Telese and Sant'Agata dei Goti and the castles of Airola and Tocco Caudio under his control, dominating the region between Capua and which city and \"comune\" of Campania, Italy, capital of the province of Benevento, 50 km northeast of Naples?",
        "response": "Benevento",
        "source": "hotpot_qa"
    },
    {
        "query": "Mitchellville, Maryland's Freeway Airport has a collection of planes that includes what type of single-engine plane built by Piper Aircraft?",
        "response": "Piper PA-28 Cherokee",
        "source": "hotpot_qa"
    },
    {
        "query": "From which country is Helen George's partner from when they finished in sixth place?",
        "response": "Slovenian",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 2003 Grammy Awards, which singer won the category that \"honors artistic achievement, technical proficiency and overall excellence in the recording industry, without regard to sales or chart position?",
        "response": "Norah Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members; Broken Bells or Redd Kross?",
        "response": "Redd Kross",
        "source": "hotpot_qa"
    },
    {
        "query": "Where both William S. Hart and Blake Edwards film screenwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who discovered Alicia Witt?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Andira and Gardenia genus of?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": " Palpopleura deceptor is a species of dragonfly found in a country which was formerly what?",
        "response": "the British protectorate of Bechuanaland",
        "source": "hotpot_qa"
    },
    {
        "query": "What school did the man featured on European cover of Madden NFL 99 play collegge football for?",
        "response": "University of Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "How many teams did Deleon Richards former husband play for in Major League Baseball",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "How old was the artist that performed the EP 'Beautiful Eyes' when she released her debut studio album?",
        "response": "16",
        "source": "hotpot_qa"
    },
    {
        "query": "What group did the choreographer for the dances in Dark Red Roses co-found?",
        "response": "New York City Ballet",
        "source": "hotpot_qa"
    },
    {
        "query": "Connaught Square is just north of a park that is divided by what?",
        "response": "Serpentine and the Long Water",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the crime drama television series \"Fargo\" played Bilbo Baggins in Peter Jackson's \"The Hobbit\"?",
        "response": "Martin Freeman",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company's headquarters that Helmut Oswald Maucher was a CEO at?",
        "response": "Vevey, Vaud, Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "The film Navakoti Narayana was based on the life of Purandara Dasa who was born in what year?",
        "response": "1484",
        "source": "hotpot_qa"
    },
    {
        "query": "Class Action is a 1991 American drama thriller film starring an actresss who made her Broadway debut in the 1980 revival of what?",
        "response": "West Side Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Which territory in the Comoro Islands did French politician Thani Mohamed Soilihi represent?",
        "response": "Mayotte",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the choreographer of The Gang's All Here die?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Cristina Scabbia or Mariqueen Maandig?",
        "response": "Cristina Adriana Chiara Scabbia",
        "source": "hotpot_qa"
    },
    {
        "query": "What town has an island with a community building built in 1911-12?",
        "response": "Harpswell",
        "source": "hotpot_qa"
    },
    {
        "query": "What NCAA Division is the football team in which Mario Cristobal coaches?",
        "response": "Division I",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Kerry Kennedy related to that is the only child of President John F. Kennedy?",
        "response": "Caroline Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What place did the driver demoted by Manor after round 12 od the 2016 Formula One season finish in the 2015 Bahrain GP2 Series round?",
        "response": "second",
        "source": "hotpot_qa"
    },
    {
        "query": "Which war is considered the deadliest and most controversial in world history? ",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Emmanuelle Seigner's 1999 film premier?",
        "response": "San Sebastián, Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the first Irish professional mixed martial artist to hold two UFC championship titles in two different divisions?",
        "response": "Conor McGregor",
        "source": "hotpot_qa"
    },
    {
        "query": "Jocelyn Moorhouse directed the 1997 drama film starring which actor?",
        "response": "Jason Robards",
        "source": "hotpot_qa"
    },
    {
        "query": "Schoolcraft Township, Kalamazoo County, Michigan is named after what American geographer, geologist, and ethnologist noted for his early studies of Native American cultures?",
        "response": "Henry Schoolcraft",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case had the potential to affect more people, Presser v. Illinois or Hernandez v. Texas?",
        "response": "Presser v. Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a rotation of the body about the vertical axis that is known to be executed while completing a 360 Crescent kick?",
        "response": "In dance and gymnastics, a turn is a rotation of the body about the vertical axis.",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Erskine Caldwell and Arthur Miller have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Enmund v. Florida and Kelo v. City of New London United States Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Narinder Kumar Gupta is Professor of Mechanics at a public institution that was declared to be Institute of National Importance by Government of India under what?",
        "response": "Institutes of Technology Act",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the film winning the most awards at the 36th Annual Annie Awards?",
        "response": "DreamWorks Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "The George Washington University Hospital and Sibley Memorial Hospital are both in which major U.S. city?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what current country was the state of the soldiers who killed Priya Ramrakha located?",
        "response": "Nigeria",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was coach for a longer time at Southern Methodist University, Phil Bennett or Mike Cavan?",
        "response": "Phil Bennett",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the town that Claudia Testoni was born in located?",
        "response": "Northern Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Australian actor, best known for playing Kim Hyde, fictional character on Home and Away, was born on what day?",
        "response": "11 August 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miss Chinese International Pageant 1993 ended in a winner who is now an actress who is of what other profession?",
        "response": "restaurateur",
        "source": "hotpot_qa"
    },
    {
        "query": "What history based comedy series stars the creator of the show Community?",
        "response": "Great Minds with Dan Harmon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band Zvuki Mu or Quietdrive was formed first?",
        "response": "Zvuki Mu",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed at an earlier date, Unwritten Law or Jon Spencer Blues Explosion?",
        "response": "Unwritten Law",
        "source": "hotpot_qa"
    },
    {
        "query": "Who among nine individuals secured enough popular signatures or support of parliamentarians to become official candidates for the Czech presidential election, 2013 and serves as a Member of Parliament for Prague and as Chairman of the Foreign Affairs Committee in the Chamber of Deputies?",
        "response": "Karel Schwarzenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Does InStyle or Love it! come out more times per year?",
        "response": "love it!",
        "source": "hotpot_qa"
    },
    {
        "query": "Alectinib developed by Hoffmann-La Roche is used to treat which type of cancer?",
        "response": "non-small-cell lung cancer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Kenai Municipal Airport and North Central West Virginia Airport joint-use public and military airports?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Dheepan was partly inspired by the literary work written in what year?",
        "response": "1721",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a landmark case regarding the practice of zoning and property rights, Arizona v. United States or Dolan v. City of Tigard ?",
        "response": "Dolan v. City of Tigard",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 census of the city where Pearl High School was located? ",
        "response": "25,092",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Microsoft co-founder was involved in the SpaceShipOne space program?",
        "response": "Paul Allen",
        "source": "hotpot_qa"
    },
    {
        "query": "What TV show did Stephen Glover write that was renewed for a second season?",
        "response": "Atlanta",
        "source": "hotpot_qa"
    },
    {
        "query": "What coastal town in Australia did army personnel Robin Reid and Paul Luckman kidnap and bring teenage boys to beat, torture, and sexually assault them?",
        "response": "Kingscliff, New South Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "Kuleli Military High School and Endem TV Tower, are located in which country?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "The medieval barony of Braidwood included a 16th-century tower house 1.5km east of what?",
        "response": "Crossford",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous football who played won the FIFA world cup in 1974 and 1978 with Sweden played in the Kopparvallen stadium?",
        "response": "Conny Torstensson",
        "source": "hotpot_qa"
    },
    {
        "query": "What book written by Maria von Trapp inspired a famous musical that was performed live on ITV in 2015?",
        "response": "The Story of the Trapp Family Singers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a Brazilian Jiu-Jitsu academy and mixed martial arts team located in Rio de Janeiro, Brazil, that was the academy that trained the student of Ailson \"Jucão\" Brites?",
        "response": "Nova União",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does Noël Wells play on \"Master of None\"? ",
        "response": "Rachel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American Singer and songwriter that has been recognized for several awards sings \"Better When I'm Dancin'\"?",
        "response": "Meghan Trainor",
        "source": "hotpot_qa"
    },
    {
        "query": "Fantasies starred the actress who had a breakthrough role in what film?",
        "response": "10",
        "source": "hotpot_qa"
    },
    {
        "query": "Technicolor Specials were short films produced by what U.S. Major film studio?",
        "response": "Hollywood studio",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the character, paired with Clarabelle Cow in the Super Goof comic book series, created?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is in a district among the new districts and municipalities created in 2008 by the then President, John Kufuorof the Greater Accra Region of Ghana?",
        "response": "Adjen Kotoku",
        "source": "hotpot_qa"
    },
    {
        "query": " What was the Team that Robert Wilson played for that was based in Rotherham, South Yorkshire?",
        "response": "Rotherham United Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was one of Sergei Prokofiev's most well-known operas first performed in 1921?",
        "response": "Chicago, Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television color encoding system was first used in France?",
        "response": "SECAM",
        "source": "hotpot_qa"
    },
    {
        "query": "Backgammon and Hare and Tortoise, are which type of entertainment?",
        "response": "board games",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the economist that worked alongside physicists Eugene Wigner and John Archibald Wheeler as part of the Princeton Three?",
        "response": "Oskar Morgenstern",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Carex or Bloomeria?",
        "response": "Carex",
        "source": "hotpot_qa"
    },
    {
        "query": "which American artist sings \"Nobody's perfect\"?",
        "response": "Miley Cyrus",
        "source": "hotpot_qa"
    },
    {
        "query": "What air craft ended production in 1992 and was derived from the same aircraft as the Boeing C-137 Stratoliner?",
        "response": "Boeing E-3 Sentry",
        "source": "hotpot_qa"
    },
    {
        "query": " Bless Its Pointed Little Head is a live album by a band that was based in which US state ?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Manaslu and Siguang Ri both located in Tibet?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this 2008 American superhero film based on the Marvel Comics character of the same name, in which Jeff Bridges earned an Academy Award nomination for his role in the film?",
        "response": "Iron Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Stomp the Yard: Homecoming is a 2010 drama film whose cast members include a rapper known for his roll as Ricky in what 2011 film?",
        "response": "Jumping the Broom",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfred W. Blomfield was the in-house architect from 1919 to 1940 for a brewer who produced what beer brand?",
        "response": "Watney's Red Barrel",
        "source": "hotpot_qa"
    },
    {
        "query": "Ivano Bonetti (born 1 August 1964 in Brescia) is an Italian football manager and former midfielder, he appeared for the English club, Grimsby Town Football Club is a professional football club based in the town of Cleethorpes, Lincolnshire, England, that competes in what?",
        "response": "League Two",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published Paranoid by Kanye West?",
        "response": "Roc-A-Fella Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera premiered first, Julietta or La favorite?",
        "response": "La Favorite",
        "source": "hotpot_qa"
    },
    {
        "query": "Davy Crockett and his son John Crockett are from which US state?",
        "response": "Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "The monoplane called Pucara, was used  by what?",
        "response": "Argentine Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Battle of Mindanao or the Lorraine Campaign happen first?",
        "response": "Lorraine Campaign",
        "source": "hotpot_qa"
    },
    {
        "query": "William McEwan, was a Scottish politician and brewer, he founded the Fountain Brewery in which year, which distributes McEwan's is a brand of beer that originated in Edinburgh, Scotland?",
        "response": "1856",
        "source": "hotpot_qa"
    },
    {
        "query": "Jobe Bells made a parody to what song published in England, 1780?",
        "response": "The Twelve Days of Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Actor James D'Arcy and director Christopher Nolan share what common heritage?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What monthly magazine focuses on science and technology?",
        "response": "BBC Focus",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017–18 Southampton F.C. season is the club's 19th season in which organization, and 41st in the top division of English football, the season is the club's first with manager Mauricio Pellegrino, a retired Argentinian footballer who played as a central defender, and is the current manager of English club Southampton? ",
        "response": "Premier League",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the director of \"The Day of the Dolphin\" born?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "Tagarata was a city in an empire characterized by what ?",
        "response": "by government headed by emperors and large territorial holdings around the Mediterranean Sea in Europe, Africa and Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British-American comedy-drama film did Goh Nakamura features in",
        "response": "A Good Year",
        "source": "hotpot_qa"
    },
    {
        "query": "The Other Side was released by the band founded in what year?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Bath School of Art and Design is an art college in Bath, England, it forms part of the Bath Spa University, a public university in Bath, England, with its main campus based at Newton Park on which location?",
        "response": "Duchy of Cornwall land",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the hockey league in which Christoffer Forsberg is now playing founded ? ",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1965 Soviet drama film and produced by a unit of the central state directory body of the Soviet Cinematography?",
        "response": "Time, Forward!",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director is younger, Manoel de Oliveira or Alfonso Cuarón?",
        "response": "Alfonso Cuarón",
        "source": "hotpot_qa"
    },
    {
        "query": "In regards to Value premium an expert argued that no value premium exisits, what did this expert found?",
        "response": "The Vanguard Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor starred in Cabin Pressure ",
        "response": "Roger William Allam",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the production company for a film starring  Lance Bass, Joey Fatone and Emmanuelle Chriqui?",
        "response": "Bacon & Eggs",
        "source": "hotpot_qa"
    },
    {
        "query": "What soft drink was produced by Benjamin \"Tyndle\" Fooks, RC Cola or Grapette?",
        "response": "Grapette",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Geissorhiza or Stenocarpus?",
        "response": "Geissorhiza",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sandy Mayer and Billy Martin both more successful at doubles than singles, in terms of tournament wins?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "This pair of GP2 Series motor races supported a Formula One motor race won by what driver?",
        "response": "Nico Rosberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Which postcolonial literature academic specializes in Victorian and Modern English literature?",
        "response": "Ankhi Mukherjee is an academic specialising in Victorian and Modern English literature,",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the character that inspired The Gomers in choosing their band name?",
        "response": "Jim Nabors",
        "source": "hotpot_qa"
    },
    {
        "query": "Which road linking London and Birkenhead is situated close to Bletchley?",
        "response": "A41 Roman road",
        "source": "hotpot_qa"
    },
    {
        "query": "Renée Montagne succeeded which American broadcast journalist, a Peabody Award-winning member of the National Radio Hall of Fame?",
        "response": "Bob Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city where the Franklin Road Campus of Moore Norman Technology Center is located?",
        "response": "110,925",
        "source": "hotpot_qa"
    },
    {
        "query": "David Whitaker was born in a village immediately south of where?",
        "response": "Stevenage",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chicago Maroons play their home games at a stadium that was named a Chicago Landmark in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "On which 2012 American military science fiction action film, directed by Peter Berg, did Jason Snell work? ",
        "response": "Battleship",
        "source": "hotpot_qa"
    },
    {
        "query": "Allen Gregory was created by an actor who received what Academy Award nomination for \"The Wolf of Wall Street\"?",
        "response": "Best Supporting Actor",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the new name of South Korean singer-songwriter Jung Joon-young's new rock band, previously known as JJY Band?",
        "response": "Drug Restaurant",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Danish footballer performed a brace in the 1996 Scottish Cup Final?",
        "response": "Brian Laudrup",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the city near Powell Butte which the transmitter  was located?",
        "response": "Deschutes County, Oregon, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "As of which earthly date do the Jehovah's Witnesses believe that Jesus Christ has been ruling in heaven as king, a date they believe was prophesied in Scripture, resulting in God's selection of Bible Students associated with the early 20th century Christian restorationist minister from Pittsburgh and founder?",
        "response": "1914",
        "source": "hotpot_qa"
    },
    {
        "query": "The Compleat Beatles is a reference to a book by what author?",
        "response": "Izaak Walton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who acted in Unearthed as well as Secondhand Lions?",
        "response": "Emmanuelle Vaugier",
        "source": "hotpot_qa"
    },
    {
        "query": "The Schumann–Runge bands are named for at least one German what?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "What football club, known a Spurs, featured English player Paul Miller?",
        "response": "Tottenham Hotspur Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the poker player that has a WSOP bracelet?",
        "response": "The Magician",
        "source": "hotpot_qa"
    },
    {
        "query": "\"A Swingin' Safari\" was a song written originally by German songwriter Bert Kaempfert but made popular by who?",
        "response": "Billy Vaughn",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer was inducted into the Rock and Roll Hall of Fame in April 2014 and did guest vocals on the Old Train album?",
        "response": "Linda Ronstadt",
        "source": "hotpot_qa"
    },
    {
        "query": " Leonard S. Coleman Jr. is part of the board of directors of which parent company of a well-known racetrack in Louisville, Kentucky?",
        "response": "Churchill Downs Incorporated",
        "source": "hotpot_qa"
    },
    {
        "query": "How many more singles titles did Kim Warwick win than Jorge Lozano?",
        "response": "three singles titles",
        "source": "hotpot_qa"
    },
    {
        "query": "In which musical-romantic comedy did Julie Andrews and Mary Tyler Moore co-star?",
        "response": "Thoroughly Modern Millie",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Kevin Ullyett and Frederik Nielsen play in men's singles?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who played captain hook in Peter Pan Live! won the academy award for which film ?",
        "response": "The Deer Hunter",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Norris is a British visual effects supervisor, best known for his works in the 2004, Harry Potter and the Prisoner of Azkaban is a British-American fantasy film, directed by Alfonso Cuarón, and distributed by who?",
        "response": "Warner Bros. Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "What bill did Patsy Matsu Takemoto Mink of Hawaii sponsor that was signed in by President Gerald Ford in 1977?",
        "response": "HR 9924",
        "source": "hotpot_qa"
    },
    {
        "query": "Ths amerocan born actor most noted for his long running role of homer simpson guest starred on the sith season of what animated sitcom playing the voice of the red devil? ",
        "response": "\"Futurama\",",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward C. Droste  is a co-founder of an american restaurant chain that has a logo of which bird ?",
        "response": "owl logo",
        "source": "hotpot_qa"
    },
    {
        "query": "American Wedding is a 2003 American sex comedy film and a sequel to \"American Pie\" and \"American Pie 2\", another sequel, released nine years later, American Reunion is a ensemble sex comedy film, released in what year, written and directed by Jon Hurwitz and Hayden Schlossberg?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was published first, All You or The People's Friend",
        "response": "The People's Friend",
        "source": "hotpot_qa"
    },
    {
        "query": " The Ordnance QF Hotchkiss 6 pounder gun were introduced to defend against watercraft capable of independent operation underwater usually referred to as \"boats\" rather than what?",
        "response": "ships",
        "source": "hotpot_qa"
    },
    {
        "query": "Wild and Woolly starred the American actor who was also a professional in what other discipline?",
        "response": "dog breeder",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area of the college campus in which Joseph Appel played basketball?",
        "response": "420 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed of dog is used for hunting in packs, the King Shepherd or the Chien Français Blanc et Orange?",
        "response": "Chien Français Blanc et Orange",
        "source": "hotpot_qa"
    },
    {
        "query": "Jason Staehler Hill is an American record producer, songwriter, film score composer, audio engineer, mixer and multi-instrumentalist, he has worked with such artists as which American singer, songwriter and multi-instrumentalist, best known as the lead singer, keyboardist and occasional bass guitarist of the Las Vegas-based rock band The Killers?",
        "response": "Brandon Richard Flowers",
        "source": "hotpot_qa"
    },
    {
        "query": "The cover art for the album caintain \"White Shadows\" was a representation of what?",
        "response": "Baudot code",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of movie are Wishing Stairs and Voice?",
        "response": "South Korean horror film",
        "source": "hotpot_qa"
    },
    {
        "query": "Scuderia Toro Rosso, commonly known as Toro Rosso or by its abbreviation STR, is an Italian Formula One racing team, and is one of two F1 teams owned by which Austrian beverage company, which sells the Red Bull energy drink?",
        "response": "Red Bull GmbH",
        "source": "hotpot_qa"
    },
    {
        "query": "Veer Towers are located within an urban complex that occupies how many acres?",
        "response": "76",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor and political activist played a role in the film Tea and Sympathy?",
        "response": "Tom Laughlin",
        "source": "hotpot_qa"
    },
    {
        "query": "Shorpy Higginbotham was the subject of a series of photographs by an American sociologist and photographer who used his camera as a tool for what?",
        "response": "social reform",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization owns the stadium where the 2008 Motor City Bowl was played?",
        "response": "Detroit/Wayne County Stadium Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the town just south of Portsmouth Gaseous Diffusion Plant in 2010?",
        "response": "2,181",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Huangzhou District and Wanzhou District are located in what country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "The film directed by Todd Phillips between the first and second installments of the Hangover Trilogy was released on what date?",
        "response": "November 5, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "What term describes the countries England, Scotland, Wales, and Northern Ireland and held the British Home Championship in 1959-60. ",
        "response": "Home Nations",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is extinct, the Russian tracker or Norfolk Terrier.?",
        "response": "Russian Tracker",
        "source": "hotpot_qa"
    },
    {
        "query": "What song on the fifth full-length album of the band Voodoo Glow Skulls was originally released in 1973 by The Wailers?",
        "response": "I Shot the Sheriff",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of the 1962 film based on the wartime activities of the man who wrote a letter that, together with the Faisal-Weizmann Agreement, was used by the Zionist delegation at the Paris Peace Conference to argue that the Zionist plans for Palestine had prior approval of Arabs?",
        "response": "Lawrence of Arabia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine covers B movies, Herald, or Castle of Frankenstein?",
        "response": "Castle of Frankenstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is a professional wrestler and actor: Dennis Agajanian or Seth Rollins?",
        "response": "Seth Rollins",
        "source": "hotpot_qa"
    },
    {
        "query": "The sixth season of the \"Tyler Perry's House of Payne\" began airing on November 4, 2009, and concluded on January 19, 2011, it stars which American actress, as Miranda Payne?",
        "response": "Keshia Knight Pulliam",
        "source": "hotpot_qa"
    },
    {
        "query": " Joseph Edmund Zdeb played with a baseball team founded as what in 1969?",
        "response": "an expansion franchise",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the cartoon mouse, who was created by author Katherine Holabird and illustrator Helen Craig, born in August 1934, who is featured in a series of children's books set in Chipping Cheddar, a place similar to 1920s London?",
        "response": "Angelina Ballerina",
        "source": "hotpot_qa"
    },
    {
        "query": "Multekrem is commonly served with a confection that is of what heritage?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "What was won in 1992 by a one-time member of the Portland Trail Blazers?",
        "response": "an Olympic gold medal",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the band who did \"How Far We've Come\" form?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a pop band, Nerf Herder or Voxtrot?",
        "response": "Voxtrot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed, out of the Old Croatian Sighthound and the Trigg Hound, was originally bred by a colonel in Kentucky?",
        "response": "Trigg Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "The head coach of the 2009 Texas Tech Red Raiders football is currently the head coach of what college team?",
        "response": "Washington State Cougars",
        "source": "hotpot_qa"
    },
    {
        "query": "What company has Hannes Mór Smárason worked for that is headquartered at Keflavík International Airport ? ",
        "response": "Icelandair",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the release date of the American fantasy comedy family film that was directed and wrote by Sven Davison and David Dobkin",
        "response": "The film was released on November 9, 2007 in the US",
        "source": "hotpot_qa"
    },
    {
        "query": "AP2 was a sequel of sorts to a band which consisted of a musican who formerly lived in what city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county was The Battle of Little Muddy Creek fought?",
        "response": "Rosebud County",
        "source": "hotpot_qa"
    },
    {
        "query": "100 indviduals with the surname 'Preradovic' died at which concentration camp that straddled the southern border of the Hasburg Monarchy?",
        "response": "the Jasenovac concentration camp",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sparaxis and Cotula both a genus of the same family?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Zebra in the Kitchen  stars Martin Milner and Andy Devine, with co-stars Joyce Meadows and Jim Davis, an American actor, best known for what role in the CBS prime-time soap opera, \"Dallas\"?",
        "response": "Jock Ewing",
        "source": "hotpot_qa"
    },
    {
        "query": "What Richie Valen cover did Selena sing?",
        "response": "\"La Bamba\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Kenneth Leith Halliwell's boyfriend born?",
        "response": "1 January 1933",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Daviesia and Iresine, both a genus of flowering plants, in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album was produced by Tony Sheridan for Polydor Records?",
        "response": "My Bonnie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older Dave Evans or Sonya Scarlet?",
        "response": "Dave Evans",
        "source": "hotpot_qa"
    },
    {
        "query": "WildLike starres an actor born 17 September 1996, who also starred in which movie in 2010?",
        "response": "Never Let Me Go",
        "source": "hotpot_qa"
    },
    {
        "query": "The producer of the Eric Church album \"The Outsiders\" was a member of what band in the 1980's?",
        "response": "In Pursuit",
        "source": "hotpot_qa"
    },
    {
        "query": "How many fountains where present \"World of Color\" which includes lights,fire,laser and fog which has anthology television series and created by Steve Davison, who is Lead Creative Executive of Parades for Walt Disney and author such a shows as \"Believe..There's Magic in the Start\", \"Disney Dreams!\"?",
        "response": "1,200 musical water fountains",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarter of the Coop Extra?",
        "response": "Oslo",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrzej Zebrzydowski served as chaplain for which powerful member of the house that ruled the Duchy of Milan?",
        "response": "Bona Sforza",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jean-Luc Godard and Alan Mak Siu-fai from Hong Kong?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Oxalis and Lithophragma both found in South Africa?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Secrets and Sins included the song Let it Go, which was featured on the soundtrack for the 1986 film directed by whom?",
        "response": "Adrian Lyne",
        "source": "hotpot_qa"
    },
    {
        "query": "Jaguar is the luxury vehicle brand of an automotive company that is a subsidiary of what Indian auto maker?",
        "response": "Tata Motors",
        "source": "hotpot_qa"
    },
    {
        "query": "The term phrase structure grammar was originally introduced by a linguist that is a laureate professor at what university?",
        "response": "University of Arizona",
        "source": "hotpot_qa"
    },
    {
        "query": "Vladmir Filatov was able to save the eyesight of sniper Vasily Zaytsev during what battle?",
        "response": "Battle of Stalingrad",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeanine Mason appeared in which procedural series starring Mary McDonnell?",
        "response": "Major Crimes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fountain stars the actress of what nationality?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Cleveland Burke Lakefront Airport is on the shores of which fourth-largest Great Lake?",
        "response": "Lake Erie",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the two largest cities in the congressional district represented by Minnesota congressman John Kline?",
        "response": "Burnsville and Eagan",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Robinson, Jr. was the eight mayor of a town laid out in 1629 by what engineer?",
        "response": "Thomas Graves",
        "source": "hotpot_qa"
    },
    {
        "query": "What metal group released their  second album  in 1999 by Season of Mist, who has had a Norwegian black metal band formed in 1984 in Oslo on their roster?",
        "response": "Cultus Sanguine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Oera Linda Book is a manuscript written in a language spoken between what centuries?",
        "response": "8th and 16th centuries",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ethnicity of the author of \"The Dragon\"?",
        "response": "Soviet",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrea Marko's cousin became Albanian's most ever capped player, which how many caps from 1990 to 2005?",
        "response": "73",
        "source": "hotpot_qa"
    },
    {
        "query": "Texas Country Weekend is a syndicated radio program that plays which rapidly growing subgenre of American country music?",
        "response": "Texas country music",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did grocery store giants founded in 1854 and 1939 get their start?",
        "response": "St. Louis",
        "source": "hotpot_qa"
    },
    {
        "query": "Jiangyan District and Fuxin, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Smith Creek is a 35.5 mi tributary stream of the North Fork of a river that passes through which US states?",
        "response": "Virginia and West Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Maryland's biggest employer is named after a general from which war?",
        "response": "U.S. Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the baseball park located in the historic warehouse distric of downtown Minneapolis and is home of the Minnesota Twins?",
        "response": "Target Field",
        "source": "hotpot_qa"
    },
    {
        "query": "Since 2010, Sándor Pintér has served as Minister of Interior in the cabinet of a politician born in which year ?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir (Ernest) Llewellyn Woodward (1890–1971) was a British historian, and was educated at which British independent private day school for boys, originally located in the City of London, and since 1933 it has been located on 285 acre of grounds at Sandy Lodge in the Three Rivers district of Hertfordshire?",
        "response": "Merchant Taylors' School (MTS)",
        "source": "hotpot_qa"
    },
    {
        "query": "Mis'ry's Comin' Aroun is by an American librettist that won how many Tony Awards? ",
        "response": "eight Tony Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Which river was close to the city in which Johann Paul Auer born?",
        "response": "Pegnitz",
        "source": "hotpot_qa"
    },
    {
        "query": "The person Kevin O'Connor drafted in 2005 was an NBA All-Star how many times?",
        "response": "three-time",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Johnny Lujack or Jim Kelly?",
        "response": "Jim Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of \"Where Rainbows End\" was born in what city?",
        "response": "Dublin",
        "source": "hotpot_qa"
    },
    {
        "query": "Mick Carter is the landlord of a public house located at what address?",
        "response": "46 Albert Square, Walford, London E20",
        "source": "hotpot_qa"
    },
    {
        "query": "Monte Kiffin's son is currently the head football coach at what university?",
        "response": "Florida Atlantic University",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeff Schwartz (born February 24, 1964, in New Haven, Connecticut) is President and Founder of Excel Sports Management, a full-service sports management and marketing agency, he represents a number of NBA superstars, including Kevin Wesley Love (born September 7, 1988) is an American professional basketball player for the Cleveland Cavaliers of which organization?",
        "response": "National Basketball Association (NBA)",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist released a free red 7\" vinyl with \"NME\" magazine and released an album in June 2017?",
        "response": "The White Stripes",
        "source": "hotpot_qa"
    },
    {
        "query": "What vegetables are Pasternak closely related to?",
        "response": "carrot and parsley",
        "source": "hotpot_qa"
    },
    {
        "query": "The Exchange performed as the opening act for the vocal group founded in 1993 in what city?",
        "response": "Orlando, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "In the year 2016, how many passengers used the airport adjacent to the Kansas City Overhaul Base?",
        "response": "11.04 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What psychiatrist both served as a chair of the department of psychiatry and wrote a book about reincarnation research studies?",
        "response": "Ian Stevenson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  German professional racing driver won  2007 Masters of Formula 3 ",
        "response": "Nicolas Hülkenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What is similar about Ann-Marie MacDonald and Anthony Powell? ",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "who was born first Ric Viers or Gene Kelly?",
        "response": "Eugene Curran Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "What album, featuring song recorded by American rapper Vince Staples \"Big Fish\", was released on June 23, 2017?",
        "response": "Big Fish Theory",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the president who signed the The Tax Reduction and Simplification Act of 1977 a Republican or Democrat?",
        "response": "James Earl Carter Jr. (born October 1, 1924) is an American politician who served as the 39th President of the United States from 1977 to 1981. A member of the Democratic Party,",
        "source": "hotpot_qa"
    },
    {
        "query": "Rory Elizabeth Katherine Kennedy, is an American documentary filmmaker and youngest child of which U.S. Senator, and Ethel Kennedy, an American human-rights campaigner and widow? ",
        "response": "Robert Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What country were both Mark Optiz and Kym Gyngell from?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1996 Houston Oilers season was the 37th season overall and 27th with the National Football League (NFL) and their final season in Houston, Houston fans would get a tease at Eddie George, the American football player who won the Offensive Rookie of the Year, with how many yards rushing?",
        "response": "1,368",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owned the electrified railway line which Newark Liberty International Airport Station (also known as Newark International Airport Station) is a railroad station on ",
        "response": "Amtrak",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of The Smoking Guns also wrestled in Japan?",
        "response": "Michael Polchlopek",
        "source": "hotpot_qa"
    },
    {
        "query": "The University of Notre Dame was founded on which date, by Father Edward Sorin, otre Dame rose to national prominence in the early 1900s for its Fighting Irish football team, especially under the guidance of the legendary coach Knute Rockne?",
        "response": "November 26, 1842",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do the club Odds Ballklubb and the coach Dag-Eilev Akerhaugen Fagermo have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "Sam Wood and Juan Escobedo are bother what profession?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Greater Manchester football club did Delory Facey play for?",
        "response": "Bolton Wanderers Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game came out first Ōkami or The Wonderful 101 ?",
        "response": "Ōkami",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Infinite Dreams\" is a live single released by a band formed in which year ?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Sándor Wolf was born in what state in Austria? ",
        "response": "Burgenland",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2009 United States Open Championship was held in what county?",
        "response": "Nassau",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American singer/songwriter and actress, who was included in 2012's VH1's list of \"100 Greatest Women in Music,\" appeared in the film \"Saved!?\"",
        "response": "Mandy Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "Rhodanthemum was formerly a genus included in the plants of which family?",
        "response": "Asteraceae",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Muto is a former employee of a news channel that broadcasts primarily from studios in what state?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Curve and The Sisters of Mercy have in common?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Coyote Sister member is related to singer in the Mamas & the Papas?",
        "response": "Leah Kunkel",
        "source": "hotpot_qa"
    },
    {
        "query": "What Professor Emeritus at San Francisco University co-wrote Of Pandas and People: The Central Question of Biological Origins",
        "response": "Dean H. Kenyon",
        "source": "hotpot_qa"
    },
    {
        "query": "Shakespeare's character Macbeth is based on a historical figure that became King in what year?",
        "response": "1040",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian actor/filmmaker played a former FBI agent convicted of murder charges stemming from his relationship with the Winter Hill Gang?",
        "response": "Joel Edgerton",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the society, which released the songbook in which \"Carol of the Old Ones\" was published, founded in Colorado?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Donnie Little played for the team that was in what conference?",
        "response": "Big 12",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was published most recently, Pirate's Cove or Catan?",
        "response": "Pirate's Cove",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the motorsport circuit in Sao Paulo that hosted the twelfth round of the 1996 International Car Championship?",
        "response": "Autódromo José Carlos Pace.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the airline that AmericanConnection served as a flight connection service brand name for headquartered?",
        "response": "Fort Worth, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the arena that hosted the 2015 Audi quattro Cup officially opened ?",
        "response": "March 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hamilton Mixtape is a 2016 mixtape album featuring assorted songs from the 2015 Broadway musical \"Hamilton\" performed by various artists, \"Wrote My Way Out\" is on which basketball simulation video game, developed by Visual Concepts, and published by 2K Sports?",
        "response": "NBA 2K18",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the author of the book series which had the character Opal Koboi born?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of musician does Neil Hannon and Stephen Malkmus have in common?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Spencer List, is an American teen actor, and he made a guest appearance on Bunk'd, an American sitcom that premiered on the Disney Channel, on which date?",
        "response": "July 31, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Marco de la O is an actor from which crime series co-produced by Netflix?",
        "response": "El Chapo",
        "source": "hotpot_qa"
    },
    {
        "query": "Estcourt Station - Pohénégamook Border Crossing connects the villages of Estcourt Station, a village in Big Twenty Township, Aroostook County, Maine, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Fire and Ice was a song from which fifth Within Temptation studio album?",
        "response": "The Unforgiving",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Francis \"Frank\" Keeney Jr. was a union organizer during a war between which two factions ?",
        "response": "between coal companies and miners",
        "source": "hotpot_qa"
    },
    {
        "query": "Does The Border Surrender or Unsane have more members?",
        "response": "The Border Surrender",
        "source": "hotpot_qa"
    },
    {
        "query": "which American singer-songwriter and guitarist did  Up 'til Now mixed with his solo ",
        "response": "James Vernon Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "How many residents were in the resort town in which Nida Lighthouse was located? ",
        "response": "1,650 residents",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2017 historical drama made from a Deborah Moggach novel?",
        "response": "Justin Chadwick",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lead vocalist wrote songs for Black Sabbath?",
        "response": "Ronnie James Dio",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Arizona v. United States and Reynolds v. United States Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is known for his work on the film \"Red Gold\": Lowell Sherman or Michael Keller?",
        "response": "Michael Keller",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are Brett Hestla nd Paul Cotton?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the other developer with Hawk Ostby who developed the American science fiction television series in which Kevin Hanchard had his role as Inspector Sematimba?",
        "response": "Mark Fergus",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first comic book written by the writer who had a series developed into a 2010 film with Bruce Willis and Morgan Freeman?",
        "response": "Transmetropolitan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stanley Park Aerodrome is now used as a zoo owned by who?",
        "response": "Parques Reunidos",
        "source": "hotpot_qa"
    },
    {
        "query": "The Packers ended the 1962 season by defeating a team that currently plays its home games at what stadium?",
        "response": "MetLife Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Lomax is an author who wrote about the innocence of a British man who was wrongly convicted of the murder of who?",
        "response": "Jill Dando",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's horror fiction has received numerous literary honors such as the Bram Stoker Award, World Fantasy Award, and International Horror Guild Award,Nathanael West or Peter Straub?",
        "response": "Peter Francis Straub",
        "source": "hotpot_qa"
    },
    {
        "query": "Which profession do Stephen Huss and Jack Sock have in common?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "WHich unincorporated community and census-designated place in Baltimore County, Maryland hosts a social insurance program consisting of retirement, disability, and survivors' benefits",
        "response": "Woodlawn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author of several books written aimed at young people also produces a talk show spin-off?",
        "response": "Jay McGraw",
        "source": "hotpot_qa"
    },
    {
        "query": "Harry Shearer  show called the Itchy & Scratch Show, aired on what program?",
        "response": "The Krusty the Clown Show",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1993 film starring John Lone playing a female opera performer?",
        "response": "David Cronenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Joy Division and SafetySuit both based in Manchester?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Julia McNamara in the series \"Nip/Tuck\" also appears with Laurence Fishburne in a 1997 horror film directed by who?",
        "response": "Paul W. S. Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American country music and rockailly singer and musician, best known for a song winning a 1960 Grammy who was produced by Don Law?",
        "response": "April 30, 1925",
        "source": "hotpot_qa"
    },
    {
        "query": "The South Park Episode before Ass Burgers first aired on which date ?",
        "response": "June 8, 2011",
        "source": "hotpot_qa"
    },
    {
        "query": "What politician worked with Vidar Helgesen and was the Leader of the Conservative Party?",
        "response": "Erna Solberg",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 1977 European Cup Winners' Cup Final, what team played against the only team that has played in every season of the Bundesliga?",
        "response": "Anderlecht of Belgium",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Phil Rosen or Edward Sloman?",
        "response": "Edward Sloman",
        "source": "hotpot_qa"
    },
    {
        "query": "What area of study does Eddington number and Arthur Eddington have in common?",
        "response": "astrophysics",
        "source": "hotpot_qa"
    },
    {
        "query": "Louis, Arthur and Gaston Chevrolet's business, the Frontenac Motor Corporation, made racing parts for which car?",
        "response": "Ford Model T",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the band that  released an album named 'A Different Beat' and also had as a member a 1976 Irish born singer-songwriter who has taken up auto racing?",
        "response": "Boyzone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football agent represents the Italian professional footballer who plays as a central midfielder for Ligue 1 club Paris Saint-Germain and the Italian national team?",
        "response": "Carmine \"Mino\" Raiola",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born in an earlier year - David Draiman or Charlie Wilson?",
        "response": "Charles Kent \"Charlie\" Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who set Nietzche's philosophical novel to music? ",
        "response": "Richard Strauss",
        "source": "hotpot_qa"
    },
    {
        "query": "The Maine Women's Hall of Fame was created in 1990 to honor the achievements of women associated with the U.S. state of Maine, which organization displays the hall of fame in its Bennett D. Katz Library, and also hosts the hall of fame online at its website?",
        "response": "University of Maine at Augusta (UMA)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who established the film distribution label of the first feature film Julie Anne Robinson worked on?",
        "response": "Ron W. Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the sports film that starred the 1930-1932 heavy weight champion of the world?",
        "response": "Reinhold Schünzel",
        "source": "hotpot_qa"
    },
    {
        "query": "Robin Hahnel worked with the editor of Z Magazine that was born in what year?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the highway that intersects with State Route 116 near a ghost town in Churchill County?",
        "response": "The Loneliest Road",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the author of \"Paths of Glory\" born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Which WWF wrestler was the longest running Doink the Clown and was a second generation wrestler?",
        "response": "Matt Osborne",
        "source": "hotpot_qa"
    },
    {
        "query": "Cupsogue Beach County Park is a 296 acre park at the east end of Fire Island and the west end of Westhampton Island by  Moriches Inlet, an inlet connecting Moriches Bay and what ocean?",
        "response": "Atlantic Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Herbert James Haddockwas captain of British transatlantic ocean liner which gained what nickname?",
        "response": "Old Reliable",
        "source": "hotpot_qa"
    },
    {
        "query": "Thorpe Camp was a barracks 2.5 mi south-east from a former Royal Air Force station located where?",
        "response": "2 mi north of Coningsby",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian Electoral Division contains the City of Onkaparinga?",
        "response": "Division of Kingston",
        "source": "hotpot_qa"
    },
    {
        "query": "\"We've Only Just Begun\" is a hit single by Carpenters written by Roger Nichols (music), and Paul Williams, an American composer, singer, songwriter and actor, wrote which part of the single?",
        "response": "lyrics",
        "source": "hotpot_qa"
    },
    {
        "query": "which district of Chūō, Tokyo, did Tokyo Expressway runs in a semicircular loop around",
        "response": "Ginza",
        "source": "hotpot_qa"
    },
    {
        "query": "Carlos Salazar Lomelín is the CEO of which Mexican multinational beverage retailer?",
        "response": "Fomento Económico Mexicano",
        "source": "hotpot_qa"
    },
    {
        "query": "Ariel Rechtshaid has worked for a rock band from New York City that is signed to what label?",
        "response": "XL Recordings",
        "source": "hotpot_qa"
    },
    {
        "query": " What was the address of the building on U.S. Route 3 that was the tallest building in New Hampshire when completed in 1972?",
        "response": "1000 Elm Street",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dodos and Doves, are a group that have which mutual genre as well?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the Honda CD200 RoadMaster is used to charge the battery while the engine is running?",
        "response": "Alternators",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Philip Larkin and T. R. Pearson have the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " 2014 IGLFA World Championship was a part of what  international multi-sport event and cultural gathering ",
        "response": "2014 Gay Games",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chandler Store is a historic formerly commercial building, built in 1838 in a village with what population at the 2010 census?",
        "response": "3,189",
        "source": "hotpot_qa"
    },
    {
        "query": "Thundershorts is a short-form comedy website featuring what comedian who serves as the co-anchor on \"Weekend Update\"?",
        "response": "Michael Che",
        "source": "hotpot_qa"
    },
    {
        "query": "Kaya (rock, in Turkish) is designed and developed by Otokar as a mine-protected vehicle (MRAP), it is based on the proven Unimog 500 chassis for high level cross country mobility, Unimog is a range of multi-purpose all-wheel drive medium trucks, produced by which organization?",
        "response": "Daimler",
        "source": "hotpot_qa"
    },
    {
        "query": "John Frusciante returned after 6 years to the Red Hot Chili Peppers on their 7th album, released in 1999 on Warner Bros. Records. Who did he replace on guitar?",
        "response": "Dave Navarro",
        "source": "hotpot_qa"
    },
    {
        "query": "What film produced by Ivan Reitman included the song \"For You I will\" ?",
        "response": "Space Jam",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the narrator on Poko?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Papa John's Pizza and Papa Gino's specialized in Pizza?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more species, Hedysarum or Hyophorbe?",
        "response": "Hedysarum",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the actor who played Arthur Banks in \"Desert Saints\" also portray in the series \"24\"?",
        "response": "Jack Bauer",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir Peter Thomas Blake, is an English pop artist, best known for co-creating the sleeve design for the Beatles' album \"Sgt. Pepper's Lonely Hearts Club Band\", his other best known works include the cover of which Band Aid single, a song written in 1984 by Bob Geldof and Midge Ure in reaction to television reports of the 1983–85 famine in Ethiopia?",
        "response": "Do They Know It's Christmas?",
        "source": "hotpot_qa"
    },
    {
        "query": "Which president of the United States first appointed a graduate of UC Berkeley School of Law as Secretary of State of the United States ?",
        "response": "John F. Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2001 Davis Cup, France defeated Australia, at which location in Melbourne, Australia?",
        "response": "Rod Laver Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musical artist is in a duo with the American rapper who released the single \"Rock City?\"",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "Aleksandr Lyapunov and Israel Gelfand, share which mutual occupation?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the band that released nowhere form?",
        "response": "Oxford, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the parent company of the record label on which Beck's album Guero was released?",
        "response": "Universal Music Group",
        "source": "hotpot_qa"
    },
    {
        "query": "The story that won the Hugo Award in 1974 depicts what kind of festival?",
        "response": "summer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain summit is the world's 71st hightes mountain, Shispare or Rimo I?",
        "response": "Rimo I",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was created by Reiner Knizia, Junta or Medici?",
        "response": "Medici",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was filmed first, Chicken Ranch or Grizzly Man?",
        "response": "Chicken Ranch",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Welke Airport and Valdosta Regional Airport both located in the US?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kennebunk, is a town in York County, Maine,Kennebunk is home to several beaches, the Rachel Carson National Wildlife Refuge,in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Civil Twilight or 3OH!3?",
        "response": "Civil Twilight",
        "source": "hotpot_qa"
    },
    {
        "query": "What prolific English engineer, who died on 15 December 1857, contributed to the advent of the hot air engine by way of their open cycle devices?",
        "response": "George Cayley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was related to the \"Grand Vizier\" (Prime minister) of the fifth Mughal emperor Shah Jahan, that was Empress consort of the Mughal Empire from 25 May 1611 to 28 October 1627?",
        "response": "Nur Jahan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the US Olympian and Christian evangelist did the 2010 non-fiction book by Laura Hillenbrand focus on?  ",
        "response": "Louis \"Louie\" Zamperini",
        "source": "hotpot_qa"
    },
    {
        "query": "What year's presidential election involved a campaign to elect Ted Kaczynski as a write-in candidate?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Damon Allen and Marcus Allen have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who presented Mary Queen of Shops television series was appointed by who to lead a review into the future of Britain's high streets?",
        "response": "David Cameron",
        "source": "hotpot_qa"
    },
    {
        "query": "Deutsche Physik, was a nationalist movement in the German physics community in the early 1930s, the term was taken from the title of a 4-volume physics textbook, in the 1930s by who, which was a German physicist and the winner of the Nobel Prize for Physics in 1905 for his research on cathode rays and the discovery of many of their properties?",
        "response": "Philipp Lenard",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Bad John is a 1990 film directed by Burt Kennedy, it stars who, which American actor?",
        "response": "Ned Beatty",
        "source": "hotpot_qa"
    },
    {
        "query": "Reginald Dewayne Grimes (born November 7, 1976) is a former American football defensive lineman, he briefly played for the New England Patriots during the 2000 New England Patriots season was during which season for the team in the National Football League?",
        "response": "31st",
        "source": "hotpot_qa"
    },
    {
        "query": "he Central Harbourfront is a waterfront site it is the result of Central and Wan Chai Reclamation, and it sits to the east of the International Finance Centre (IFC), a skyscraper and an integrated commercial development on the waterfront of the Central District, of which territory?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "BLIZZARD! The Storm That Changed America is a book about the storm that was referred to by what name?",
        "response": "Great White Hurricane",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Winston Churchill and Philip Larkin write?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a former name for the river on which Guntersville, Alabama was founded?",
        "response": "Cherokee River",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Brassocattleya and Buckinghamia orchids?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the husband of the the English novelist whose work provided the basis for a series of films which includes Frankenstein Meets the Wolf Man?",
        "response": "Percy Bysshe Shelley",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the cartonist and publisher who drew story entitled \"Allah Had No Son\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Jagadeesh Kumar was nominated for Edison Award 2015 as Best Male Playback Singer for a song from a horror comedy film that is the third installment of what series?",
        "response": "Muni",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game studio developed the video game in which the fictional substance Tiberium  is used to purchase units and buildings?",
        "response": "Westwood Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American media and content company based in New York City has signed Nas, the American hip hop artist?",
        "response": "Mass Appeal",
        "source": "hotpot_qa"
    },
    {
        "query": "Canberra Outlet Centre is a type of which manufacturer-branded store that sells stock directly to customers?",
        "response": "outlet store",
        "source": "hotpot_qa"
    },
    {
        "query": "What country hosts the mountain in Kosciuszko National Park that sits next to the Rosenberg Glacier?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 1990's which corporation owned the company which published the novels of Judith Duncan ?",
        "response": "the Torstar Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Marcel Proust and Thomas Sigismund Stribling a writer?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Courtney Kennedy, is an American ice hockey player, she won a bronze medal at the 2006 Winter Olympics, commonly known as Turin 2006 or Torino 2006, was a winter multi-sport event which was held in Turin, Piedmont, Italy during which time span?",
        "response": "February 10 to 26, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the film stars in the Australian comedy film \"Now Add Honey\", is recognized for playing Elle Woods in the Australian production of which film?",
        "response": "\"Legally Blonde: The Musical\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ethnic background of this American educator and politician from the Democratic Party who was re-elected as a US senator representing Hawaii in 1994?",
        "response": "Native Hawaiian",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the bands, Gumball and Kings of Convenience, come from two different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1994 Asian Games also known as XII Asiad were held from October 2 to October 16, 1994 in which capital of Hiroshima Prefecture and the largest city in the Chūgoku region of western Honshu - the largest island of Japan?",
        "response": "Hiroshima",
        "source": "hotpot_qa"
    },
    {
        "query": "Which citizen was man who believes discontinuity and continuity reflect the flow of history?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Bruce Fairbairn produced what album by Bon Jovi?",
        "response": "Slippery When Wet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ended on an earlier date in May of its corresponding year, 2010–11 La Liga or 2009–10 La Liga?",
        "response": "2009–10 La Liga",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2 records companies released the U2 album that includes the song \"Miracle Drug\"?",
        "response": "Island Records and Interscope Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Július Satinský was born in a city that has a current population of what?",
        "response": "about 450,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Kurt Bills ran against a Democratic incumbent who was born in what yea?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Leo McKern was in what epic romantic drama film directed by David Lean?",
        "response": "Ryan's Daughter",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Sleep Room and The Wombats bands from Liverpool?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "This bar founded by Mickey Gilley the hangout in the 1980 film \"Urban Cowboy\".",
        "response": "Gilley's Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bocconia and Bellevalia both flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2015, Matt Stone listed this episode of South Park as his third favorite that used a screen-capturing program for what operating system?",
        "response": "macOS",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Museum, located in the Bloomsbury area of London was Richard B. Parkinson a curator in the Department of Ancient Egypt and Sudan",
        "response": "British Museum",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the broad expanse of flat land in the western United States and western Canada  where the species of plant called the Polygonum sawatchense of the buckwheat family be found?",
        "response": "The Great Plains",
        "source": "hotpot_qa"
    },
    {
        "query": "Asahi Point Zero  is a non-alcoholic (0.00% ABV) beer sold in Japan by a brewery based in which city ?",
        "response": "Tokyo",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the town in which the Joseph Braman House is located?",
        "response": "6,122",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  former Major League Baseball outfielder which DeWayne Wise robbed of a home run to preserve Mark Buehrle's perfect game in 2009 born? ",
        "response": "July 31, 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Due to company problems Mudial de Futbol was released after what date?",
        "response": "8 July 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Lawrence Turchin was a Major League Baseball infielder, who played for one season, he played 11 games for which American professional baseball team, based in Cleveland, Ohio?",
        "response": "Cleveland Indians",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state did Free-Staters settle?",
        "response": "Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Karel Reisz or Jorge Fons Perez born first?",
        "response": "Karel Reisz",
        "source": "hotpot_qa"
    },
    {
        "query": "What band position does the member of Guns N' Roses that a member of Buffalo Springfield and Crosby, Stills & Nash worked with have?",
        "response": "drummer",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the Philadelphia, Pennsylvania-based promotion that Damien Kane is best known for close?",
        "response": "April 2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2015 film starring an American professional poker player?",
        "response": "Steven C. Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rucellai Sepulchre was built by an Italian humanist author who epitomised what?",
        "response": "the Renaissance Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the official portrait of the 38th President of the United States?",
        "response": "Everett Raymond Kinstler",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationwide personal injury law firm was founded by the man who created and built Alcatraz East?",
        "response": "Morgan & Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the romantic comedy film featuring Evan and Jaron's song The Distance?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "How many nominations for Academy Awards has the star of the 2004 remake of Alfie gotten?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Rihanna album hosted the song c-written by Starrah?",
        "response": "Anti",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Fit but You Know It was recorded by a group from what city in England?",
        "response": "Birmingham",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the theatre at which the Children of the Queen's Revels performed The Dutch Courtesan close?",
        "response": "1642",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical profession does Peter Wilhousky and Shchedryk have in common?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "George Palmer Putnam, was an American publisher, author and explorer, known for his marriage to who, which American aviation pioneer and author, and was the first female aviator to fly solo across the Atlantic Ocean?",
        "response": "Amelia Earhart",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the electoral division that James Tully  represented in 1928 named after?",
        "response": "Sir Edmund Barton",
        "source": "hotpot_qa"
    },
    {
        "query": "Sky and Sand is a song by German electronic music producers Paul Kalkbrenner and Fritz Kalkbrenner, the song was originally produced as the title song of which 2008 German tragicomedy directed by Hannes Stöhr?",
        "response": "Berlin Calling",
        "source": "hotpot_qa"
    },
    {
        "query": "What reality show did the co-hosts of the 2014 Much Music Video Awards star in?",
        "response": "Keeping Up with the Kardashians",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital city of the US state where Lonnie Lee VanZand was professor of physics?",
        "response": "Indianapolis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog is from South America the Schipperke or the Mucuchies?",
        "response": "Mucuchí",
        "source": "hotpot_qa"
    },
    {
        "query": "Which jury member for Deutschland sucht den Superstar was an American model and choreographer born in 1957?",
        "response": "Bruce Darnell",
        "source": "hotpot_qa"
    },
    {
        "query": "Horror Business was released on the label that was run by the singer from what New Jersey city?",
        "response": "Lodi",
        "source": "hotpot_qa"
    },
    {
        "query": "Bender \"Ben\" Johnson Jr. was the chairman of the Makah during the first successful hunt of Eschrichtius robustus which is commonly known as what?",
        "response": "The gray whale",
        "source": "hotpot_qa"
    },
    {
        "query": "Including the automotive retailer founded in 1996, Wayne Huizenga is responsible for how many New York Stock exchange listed companies?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "How many caps for England did Lee Devonshire's son win ?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "How many miles away from Dallas is the village that the species depicted in the Pictish stone at Golspie originated from?",
        "response": "three miles",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the debut single of the singer of \"3am (Pull Up)\"?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Lutz-Michael Harder, is a German lyric tenor known mostly for his interpretation of opera roles of Wolfgang Amadeus Mozart, baptised as Johannes Chrysostomus Wolfgangus Theophilus Mozart, was a prolific and influential composer, of which time period?",
        "response": "Classical era",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the name of the fantasy film starring Sarah Bolger, featuring a New England family who discover magical creatures around their estate?",
        "response": "The Spiderwick Chronicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Camille Saint-Saëns and Samuel Barber both French composers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Chantal Claret and Tommy Karevik a singer?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Fahad Mustafa is a film and television actor that hosted a tv show, launching on May 18th of what year?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What distinction does the representative who drew national media attention to the death of Aiyana Jones hold?",
        "response": "Dean of the House of Representatives",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brother of Francisco Rodríguez Araya is known for his ability to deliver pinpoint crosses?",
        "response": "Roberto Rodríguez",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiwassee Dam is the third highest dam in the TVA system, behind Watauga and a hydroelectric dam on what river?",
        "response": "Little Tennessee River",
        "source": "hotpot_qa"
    },
    {
        "query": "The New York City Board of Transportation was commission and operating of what complex infrastructural system?",
        "response": "transportation system of New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Sergio Mimica-Gezzan directed which television show that took place in the 12th century?",
        "response": "He directed six episodes of the reimagined \"Battlestar Galactica\", two episodes of \"Heroes\", and \"The Pillars of the Earth\", the television adaptation of Ken Follett's novel of the same name.",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pastel Journal and Rolling Stone, are which form of publication?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the philosopher who worked on  An Essay Concerning Human Understanding born? ",
        "response": "29 August 1632",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was younger, Arthur Rankin Jr. or Jules Bass?",
        "response": "Jules Bass",
        "source": "hotpot_qa"
    },
    {
        "query": "A British writer, host, model, and fashion designer hosted this series starting in 2008 on Channel 4?",
        "response": "Vanity Lair",
        "source": "hotpot_qa"
    },
    {
        "query": "Erich Johann Albert Raeder, was a naval leader in Germany before and during World War II, Raeder is also well known for dismissing Reinhard Tristan Eugen Heydrich, from the Reichsmarine in April of what year, for \"conduct unbecoming to an officer and a gentleman\", Heydrich  was a high-ranking German Nazi official during World War II, and a main architect of the Holocaust?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "A statue of Edward Snowden was placed in what 30.2 acre park that was formerly called Fort Putnam?",
        "response": "Fort Greene Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the genuses Coniogramme and Merremia belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the captain of the Australian team that won the 1930 Ashes series?",
        "response": "William Maldon \"Bill\" Woodfull",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician co-founded Throwing Muses with her stepsister Kristin Hersh: Tanya Donelly or Kai Hansen?",
        "response": "Tanya Donelly",
        "source": "hotpot_qa"
    },
    {
        "query": "who is a Malian film director and politician,  Cheick Oumar Sissoko or Abigail Child?",
        "response": "Cheick Oumar Sissoko",
        "source": "hotpot_qa"
    },
    {
        "query": "Powell Observatory is an astronomical observatory located near Louisburg in Miami County, Kansas, near Kansas City, as of the 2010 census, the city population was 4,315, in which country is it located?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series did the writer of \"Business School\" write for first, The Office or The Simpsons?",
        "response": "The Simpsons",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of the film \"Oscar and Lucinda\"?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the wife of the author whose work inspired the chamber opera \"Through the Looking Glass\"?",
        "response": "Cate Blanchett",
        "source": "hotpot_qa"
    },
    {
        "query": "What Zoological Garden was opened two years before the Manchester Zoological Gardens opened in 1838?",
        "response": "Belle Vue Zoological Gardens",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality were both Richard Llewellyn and Saki? ",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "In the miniseries \"The New Edition Story\" Bryshere Y. Gray played a rapper born in what year?",
        "response": "1968",
        "source": "hotpot_qa"
    },
    {
        "query": "Recess is the debut studio album by American music producer Skrillex, released on which date, he's an American electronic dance music producer, DJ, singer, songwriter and multi-instrumentalist?",
        "response": "March 18, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What high school did the First Lady of Kentucky from 1979 to 1983 graduate from?",
        "response": "Denton High School",
        "source": "hotpot_qa"
    },
    {
        "query": "How many series, of documentary series, of which Fossil Detectives was a spin off, have been broadcast ?",
        "response": "ten",
        "source": "hotpot_qa"
    },
    {
        "query": "Who stared alongside Bela Lugosi in a 1934 horror film but was missing from the 1941 remake?",
        "response": "Boris Karloff",
        "source": "hotpot_qa"
    },
    {
        "query": "Dominic West won a 2012 British Academy Television Award for portraying a serial killer that was born in what year?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What team featured the player nicknamed Jose by the Japanese Marlins player?",
        "response": "Orix Buffaloes",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Tampa Bay Buccaneers draft history and Lee Roy Selmon connected?",
        "response": "Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Rampage had a musical score by which American composer?",
        "response": "Elmer Bernstein",
        "source": "hotpot_qa"
    },
    {
        "query": "The Village Voice was co-founded by which author of \"The Executioner's Song\"?",
        "response": "Norman Kingsley Mailer",
        "source": "hotpot_qa"
    },
    {
        "query": "The country where Orchestre Stukas was based is in what part of Africa?",
        "response": "Central Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the former name of the company which operates Hunterston Terminal?",
        "response": "Peel Holdings",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeffrey Archer and Thomas Wolfe both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In First Daughter, Samantha McKenzie develops a relationship with a character played by an actor known for what role in \"Buffy the Vampire Slayer\"?",
        "response": "Riley Finn",
        "source": "hotpot_qa"
    },
    {
        "query": "What platform was the Mercedes-Benz GLK's 2008 debut competitor based on?",
        "response": "the Audi MLB platform",
        "source": "hotpot_qa"
    },
    {
        "query": "What show that Tom Warburton worked on aired from September 3, 2010 to April 4, 2014?",
        "response": "Fish Hooks",
        "source": "hotpot_qa"
    },
    {
        "query": "What weapon, designed by Aimo Lahti, was a descendant of the M-22 prototype and the KP/-26 production model?",
        "response": "Suomi KP/-31",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1995 hurricane formed 4 days after Hurricane Connie in the Atlantic Ocean?",
        "response": "Hurricane Diane",
        "source": "hotpot_qa"
    },
    {
        "query": "The show that Tony Dovolani was involved in has been renewed for season number what?",
        "response": "twenty six",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus includes more plants that produces flowers, Zanthoxylum or Legousia?",
        "response": "Legousia",
        "source": "hotpot_qa"
    },
    {
        "query": "Tonya Suzanne Holly and Ivan Passer, are both a type of director?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "It Was Written features a supergroup that included the rapper raised in what New York borough?",
        "response": "Brooklyn",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both  Slaughter-House Cases and United States v. Darby Lumber Co. involve civil rights law?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Of which irrigation complex is the area where Ken Darby set the water speed record ?",
        "response": "Snowy Mountains Scheme",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is Canadian, Marianas Trench or Tapes 'n Tapes?",
        "response": "Marianas Trench",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ferrari Ascari is a Ferrari concept car that won the \"Ferrari: New Concepts for the Myth\" car design competition in 2005, the judges of the competition included the second and only living son of who, was an Italian motor racing driver and entrepreneur, the founder of the Scuderia Ferrari Grand Prix motor racing team, and subsequently of the Ferrari automobile marque?",
        "response": "Enzo Ferrari",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known for his voice role of the DC comics character \"Cyborg\" of the animated television series based on the DC comics series created by Bob Haney and Bruno Premiani?",
        "response": "Khary Payton",
        "source": "hotpot_qa"
    },
    {
        "query": "What film starring Varun Sandesh was produced by a company called Matinee Entertainments?",
        "response": "Maro Charitra",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous composer was born in the town that hosts a festival of music and drama has featured Lilian Sukis?",
        "response": "Wolfgang Amadeus Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the longest river in Italy that carried Romulus and Remus on its current?",
        "response": "Tiber",
        "source": "hotpot_qa"
    },
    {
        "query": "What style of music closely relates to Sonny Moorman and Eric Clapton?",
        "response": "blues",
        "source": "hotpot_qa"
    },
    {
        "query": "The town where Richard Sohl died in located in which New York county?",
        "response": "Suffolk County",
        "source": "hotpot_qa"
    },
    {
        "query": "Between David Vincent and Eddie Vedder, who had a more diverse musical career?",
        "response": "Eddie Vedder",
        "source": "hotpot_qa"
    },
    {
        "query": "Paddy Wallace was a member of the Ireland U19 team that included the future outside centre for which Irish provincial team?",
        "response": "Leinster",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Geoff Masters and Jimmy Connors both former tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is more intellectual, The American Prospect or Paper?",
        "response": "The American Prospect",
        "source": "hotpot_qa"
    },
    {
        "query": "Darlene Love was one of the artists on the Christmas album originally released in what year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean Southern appeared as the lady who operates the trolley in a movie directed by who ?",
        "response": "Chris Columbus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut few on the 2006 \"Discovery\" mission? Patrick Baudry or Nicholas Patrick? ",
        "response": "Nicholas James MacDonald Patrick",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is further south, Aniak Airport or Jackson Hole Airport?",
        "response": "Jackson Hole Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor starred in both \"The Best Years of Our Lives\" in 1946 and \"The Crowded Sky\" in 1960?",
        "response": "Carver Dana Andrews",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian conductor, born in 1929, has conducted Jean-Pierre Canihac?",
        "response": "Nikolaus Harnoncourt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school has more enrolled students, Indiana University or Saint Louis University?",
        "response": "Indiana University",
        "source": "hotpot_qa"
    },
    {
        "query": "What UK water company is listed among the big-name customers of the Polyhedra database management system?",
        "response": "United Utilities Group PLC",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does The Judge and the General and Gimme Shelter have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  English poet and children's writer died who prepared  Crossing the Water for publication?",
        "response": "28 October 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first Russian King of Poland, whose Adjutant General was Pavel Alexandrovich Stroganov?",
        "response": "Alexander I of Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the father of the racer who died in an accident similar to Markus Hottinger?",
        "response": "John Surtees",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sapsali and Kunming wolfdog both dog breeds originating in the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the scorer of the last minute goal in the 2002 Scottish Cup Final ?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Who defeated the team coached by Urban Meyer in 2006?",
        "response": "Auburn Tigers",
        "source": "hotpot_qa"
    },
    {
        "query": "The Carnot wall takes its name from a man who died in what year?",
        "response": "1823",
        "source": "hotpot_qa"
    },
    {
        "query": "What holiday features the song composed by the man known for doing \"Virtual Choir\" projects, known as \"Light and Gold\"?",
        "response": "Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Andres Barreto launched several startups, including Grooveshark and what other?",
        "response": "PulsoSocial",
        "source": "hotpot_qa"
    },
    {
        "query": " In France in 1852, voters were asked whether they approved of the re-establishment of the Empire in the person of Louis Napoléon Bonaparte,  the only president of what republic?",
        "response": "French Second Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of a collegiate athletic conference comprising sports teams from eight private institutions of higher education in the Northeastern United States played their home games at Robert K. Kraft Field at Lawrence A. Wien Stadium?",
        "response": "The 2011 Columbia Lions",
        "source": "hotpot_qa"
    },
    {
        "query": "A Woman's Revenge is a 1921 German silent drama film directed by Robert Wiene and starring Vera Karalli,, who was an actress and what kind of dancer during the early years of the 20th century?",
        "response": "ballet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French-born composer formed The International Composers’ Guild?",
        "response": "Edgard Varèse",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Roger Federer and Natasha Zvereva have in common?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the album released that The Red Tour supported?",
        "response": "October 22, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which disciplined service, the first police agency to operate with a modern policing system in Asia, is lead by a person who reports to the Secretary for Security?",
        "response": "Hong Kong Police Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeff A. Schwartz, is President and Founder of Excel Sports Management, a full-service sports management and marketing agency, he represents a number of NBA superstars, including which American professional basketball player for the Charlotte Hornets of the National Basketball Association (NBA)?",
        "response": "Kemba Hudley Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "Lakshminath Bezbaroa, (1864–1938) was a great Assamese personality and celebrated pioneer of modern Assamese literature, he was one of the literary stalwarts of the era, named after which Assamese language magazine published from Calcutta in 1889?",
        "response": "Jonaki",
        "source": "hotpot_qa"
    },
    {
        "query": "What system designed by N. Robin Crossby features at Fandemonium?",
        "response": "HârnMaster",
        "source": "hotpot_qa"
    },
    {
        "query": "Ladislas de Hoyos was the first journalist to interview with the SS member known as what?",
        "response": "Butcher of Lyon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2016 population of the city on the Bay Fundy which had an office of the Bank of British North America?",
        "response": "67,575",
        "source": "hotpot_qa"
    },
    {
        "query": "While Grover Cleveland was the 22nd and 24th president, in 1888 he lost to the 23rd president, who served from when to when?",
        "response": "1889 to 1893",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Bhatha Jana star was married to producer P. Pullaiah ?",
        "response": "Santha Kumari",
        "source": "hotpot_qa"
    },
    {
        "query": "Claude-Auguste Lamy discovered the element thallium independently from this English chemist who died in what year?",
        "response": "1919",
        "source": "hotpot_qa"
    },
    {
        "query": "What percentage of the part time work force for this group make up from whose group's name Mitsouko was derived?",
        "response": "77%",
        "source": "hotpot_qa"
    },
    {
        "query": "The season in which \"The Death Camp of Tolerance\" was an episode in began airing on what date?",
        "response": "March 6, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "which American historian, edited Voices of a People's History of the United States",
        "response": "Howard Zinn",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the title character role in the 1984 film version of the action-adventure video game published by Lucas Arts in 2003?",
        "response": "Harrison Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger Paul Scholes or Legimin Raharjo ?",
        "response": "Legimin Raharjo",
        "source": "hotpot_qa"
    },
    {
        "query": "The John Downing Jr. House is a historic house in downtown Middleport, a village located on the banks of the Ohio River in the southeastern part of the U.S. state of Ohio, notably, his work with the young Samuel Clemens led to a literary appearance years later: writing under the name of \"Mark Twain\", Clemens portrayed him in which book, released in 1883, is a memoir by Mark Twain of his days as a steamboat pilot on the Mississippi River before the American Civil War, and also a travel book, recounting his trip along the Mississippi River from St. Louis to New Orleans many years after the War?",
        "response": "Life on the Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which series based on a Japanese manga did Claudio Moneta star in? ",
        "response": "Naruto",
        "source": "hotpot_qa"
    },
    {
        "query": "When nationalism developed as a concept what was it the aim to end?",
        "response": "East India Company rule",
        "source": "hotpot_qa"
    },
    {
        "query": "What animal does Pudelpointer and Rottweiler have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Raoul Peck and Dziga Vertov make the same type of films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Crown Books was a bookseller headquartered in Lake Arbor, an unincorporated community in Prince George's County, Maryland, near Largo and which town's official name, and is the seat of Prince George's County, Maryland in the United States?",
        "response": "Town of Upper Marlboro",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the Sparaxis and Campanula come from the same family genus?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What area is the species of Spruce which can be found in Rensselaer Plateau native to?",
        "response": "eastern North America",
        "source": "hotpot_qa"
    },
    {
        "query": "Erna Solberg and Thorstein Diesen were both members of the Conservative Party of what country?",
        "response": "Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the short-lived rap group this American hip hop recording artist formed who has worked with American hip hop record producer Sap and signed with Maybach Music Group in 2011?",
        "response": "The Bloodhoundz",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does  the club that Gonçalo Guedes played for on loan play?",
        "response": "La Liga",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actor who played the role of the person who is Keeper of Keys and Grounds of Hogwarts in \"Harry Potter\" films? ",
        "response": "Robbie Coltrane",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Extraterrestrial Highway\" runs parallel to what military base?",
        "response": "Nellis Air Force Range",
        "source": "hotpot_qa"
    },
    {
        "query": "Mario Cimarro, a Cuban actor, starred in which 1997 film from Mexico? ",
        "response": "The Cuban Connection",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Denzel Washington and David Hewlett both actors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the author of The True Meaning of Smekday live?",
        "response": "Tucson, Arizona",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine focuse on battlefield strategy and tactics, Civil War Times or Infinite Energy?",
        "response": "Civil War Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Bedroom at Arles is a painting based on which Van Gogh series of three works?",
        "response": "Bedroom in Arles",
        "source": "hotpot_qa"
    },
    {
        "query": "ABC Wide World Of Sports Boxing is a boxing computer game featuring a former American what?",
        "response": "football offensive lineman",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Damon Stoudamire related to Terrence Jones?",
        "response": "cousin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jackson Hole Airport and Coastal Carolina Regional Airport located in North Carolina?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrea Harrison struggles to escape The Governor's torture chamber in the final episode of what season of \"The Walking Dead\"?",
        "response": "third season",
        "source": "hotpot_qa"
    },
    {
        "query": "The builder of the Tudor Barn married the daughter of a noted what?",
        "response": "Renaissance humanist",
        "source": "hotpot_qa"
    },
    {
        "query": "What town's geographic feature is the battle James Swan was twice wounded at named for?",
        "response": "Charlestown, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the new female trainer on The Biggest Loser born?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress portrayed Rachel Green on the sitcom \"Friends\" and starred in the movie \"She's Funny That Way\"?",
        "response": "Jennifer Aniston",
        "source": "hotpot_qa"
    },
    {
        "query": "What town in the Sor-varanger Municipality of Norway was the BarentsObserver based in?",
        "response": "Kirkenes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Dubai-based airline operates to 141 destinations?",
        "response": "Emirates",
        "source": "hotpot_qa"
    },
    {
        "query": "Dance and Laugh Amongst the Rotten is a studio Album by a band from which country ?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "John Meillon played the part of Walter Reilly in the films set in which two locations?",
        "response": "Australian Outback and in New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "George E. Hyde wrote about which Indian tribe that was also known as Dakota?",
        "response": "Sioux",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did Gong Ji-chul that took place at the Gwangju Inhwa School for the hearing-impaired?",
        "response": "The Crucible",
        "source": "hotpot_qa"
    },
    {
        "query": "Enrique Berruga presented his credentials to a united nations secertary-general from which country ?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "XHamster is the third most popular pornography site after what other site registered to WGCZ Holding?",
        "response": "XVideos",
        "source": "hotpot_qa"
    },
    {
        "query": "Black Hours is the debut solo studio album, of singer Hamilton Leithauser, from which indie rock band,?",
        "response": "The Walkmen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which poet is known for his war poetry on the horrors of trench and gas warfare: Wilfred Owen or Daniil Kharms?",
        "response": "Wilfred Edward Salter Owen",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the Min Kyu-dong romantic comedy starring a July 11, 1979-born actress released?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the television producer who created the animated parody talk show Space Ghost Coast to Coast?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1961 book was written by one of the founders of the Creation Research Society?",
        "response": "The Genesis Flood: The Biblical Record and its Scientific Implications",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the destination of the United Airlines flight hijacked by Ahmed al-Haznawi and three others on September 11?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cesky Terrier and Black Mouth Cur both dogs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is the company that Les Wexner chaired based?",
        "response": "Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "A Massacre Foretold is based on a real massacre of ho many people?",
        "response": "45",
        "source": "hotpot_qa"
    },
    {
        "query": "Who originally voiced Honey Bunny's ex-boyfriend ?",
        "response": "Mel Blanc",
        "source": "hotpot_qa"
    },
    {
        "query": "On what peninsula is the Macao Cultural Centre located?",
        "response": "Macau Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "Former Arena Football QB Justin Roper played two colleges one of which is Known as the Duck and fielded its first team in what year?",
        "response": "1894",
        "source": "hotpot_qa"
    },
    {
        "query": "Gemini is a 2017 American mystery thriller film staring which Canadian actress?",
        "response": "Jessica Parker Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American dancer, who worked at Grace's Little Belmont, where Wild Bill Davis was a featured summer performer?",
        "response": "September 1, 1905",
        "source": "hotpot_qa"
    },
    {
        "query": "\"There Goes Another Love Song\" was written by an American singer best known as a guitarist for who?",
        "response": "Lynyrd Skynyrd",
        "source": "hotpot_qa"
    },
    {
        "query": "George A. Schilling, was a prominent American union leader and Georgist in the late nineteenth century, he made his mark in the Chicago labor movement as a member of the cooper's union and a leader of which was the largest and one of the most important American labor organizations of the 1880s?",
        "response": "Knights of Labor (K of L)",
        "source": "hotpot_qa"
    },
    {
        "query": "The park in which Naval Medical Center San Diego is located consists of how many acres?",
        "response": "1200",
        "source": "hotpot_qa"
    },
    {
        "query": " K.C. Cole wrote a memoir about which American particle physicist?",
        "response": "Frank Friedman Oppenheimer",
        "source": "hotpot_qa"
    },
    {
        "query": "Yu Rongguang is best known for his work in the title role of the Hong Kong martial arts film written and produced by Tsui Hark from what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "If \"Crying\" is the second episode of \"Beavis and Butthead\" season 8 then \"Wherewolves of Highland\" must be the what?",
        "response": "the first episode",
        "source": "hotpot_qa"
    },
    {
        "query": "Move Your Domain Day is a domain name transferring initiative, initially in response to GoDaddy's support of the United States Stop Online Piracy Act (SOPA), first held on 29 December 2011, originating from a post on which American social news aggregation, web content rating, and discussion website?",
        "response": "Reddit",
        "source": "hotpot_qa"
    },
    {
        "query": "What district is the arena where the The Starboy: Legend of the Fall Tour started?",
        "response": "Johanneshov",
        "source": "hotpot_qa"
    },
    {
        "query": "What county does the  Delphus Kill flows into the Mohawk River?",
        "response": "Albany County",
        "source": "hotpot_qa"
    },
    {
        "query": "James Robertson helped established the association that is in what modern-day town?",
        "response": "Elizabethton, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American former professional baseball relief pitcher was on a television show on FOX Sports that mostly consisted of interviews with pro baseball players at home via Skype?",
        "response": "Brian Patrick Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hotel, host of the 12th AVN Awards ceremony, is located in Paradise, Nevada?",
        "response": "Bally's Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink is made traditionally with tequilla the Margarita or the Redheaded slut?",
        "response": "A margarita",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of publications are Saveur and Drum!?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the 2nd year head coach of the team who played against Florida State in the 101st Rose Bowl?",
        "response": "Mark Helfrich",
        "source": "hotpot_qa"
    },
    {
        "query": "What America physicist was a spokesperson at the LIGO Scientific Collaboration?",
        "response": "Rainer \"Rai\" Weiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Who composed the score for the film Pudhukottaiyilirundhu Saravanan?",
        "response": "Yuvan Shankar Raja",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian science fiction thriller was based on the short story \"All You Zombies\" and starred an actress from \"Steve Jobs\"?",
        "response": "Predestination",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the game, in which TeamTNT created the \"TNT:Evolution\" episode for, released?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "The 26th Annual GMA Dove Awards were hosted by the songwriter of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The album Kick Out the Jams was recorded during Halloween and the night before which is known as?",
        "response": "Devil's Night",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the singer behind The Revolution Starts Now release his first EP?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city where Michael Williams was born?",
        "response": "11,307",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Leonid Khachiyan and Alan Hovhaness of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed and co wrote the film also written by Marshall Brickman, featuring work by Gordon Willis?",
        "response": "Woody Allen",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the initiative of Stanford University started by one of the co-founders of Coursera?",
        "response": "Stanford Engineering Everywhere",
        "source": "hotpot_qa"
    },
    {
        "query": "The Light in the Forest and The Lion King, were both influenced by other written works?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the member of the Spurs' who played center and retired before the 2003-04 NBA season?",
        "response": "August 6, 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the magazine that listed \"Jump Around\" by House of Pain at 325 out of \"500 greatest songs since you were born\", known for?",
        "response": "steamy pictorials of celebrities",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Michael Alford serve as, as part of the ISAF force against a known Taliban stronghold and center of opium production?",
        "response": "official War Artist",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the former CEO and co-founder of the company that makes the phone that Phoebe Ruguru shot her film \"Saidia\"?",
        "response": "Steve Jobs",
        "source": "hotpot_qa"
    },
    {
        "query": "Has New Found Glory or Idlewild released more studio albums?",
        "response": "New Found Glory",
        "source": "hotpot_qa"
    },
    {
        "query": "What show did Vincent Chalvon-Demersay create that premiered in 2009?",
        "response": "The Amazing Spiez!",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the track used in the 2011 24 Hours of Le Mans race?",
        "response": "13.629 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Producer and DJ Ali B was in residence at which legendary London club which closed in 2016?",
        "response": "Fabric",
        "source": "hotpot_qa"
    },
    {
        "query": "Slobodan Princip, nicknamed Seljo (Сељо), was a Yugoslav Partisan fighter and the district staff chief of Partisan Sarajevo Oblast during World War II, he was the nephew of Gavrilo Princip, was a Bosnian Serb member of Young Bosnia, a Yugoslavist organization seeking an end to Austro-Hungarian rule in Bosnia and which location?",
        "response": "Herzegovina",
        "source": "hotpot_qa"
    },
    {
        "query": "What honor did the man for whom the USS \"Kauffman\" was named after receive?",
        "response": "the Navy Cross",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the 2011 American nature documentary short film by David Lickley",
        "response": "Drew Fellman.",
        "source": "hotpot_qa"
    },
    {
        "query": "Justin Paul Theroux, is an American actor and screenwriter, he is best known for his work with film director David Lynch in Mulholland Drive, released in which year, a neo-noir mystery film written and directed by David Lynch and starring Naomi Watts?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Who sings for UB40, Duncan Campbell or Park So-yeon?",
        "response": "Duncan Campbell",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the actress who has featured in NBC sitcom \"Parks and Recreation\" as well as the American comedy web series \"Keith Broke His Leg\" born in?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the eighteenth episode of the seventh season of \"Pretty Little Liars\", featuring Shay Mitchell as Emily?",
        "response": "Charlie Craig",
        "source": "hotpot_qa"
    },
    {
        "query": "Ambrose Godfrey-Hanckwitz FRS (1660 – 15 January 1741), or Ambrose Godfrey as he preferred to be known, was a German-born British phosphorus manufacturer and apothecary, was a member of which organization with the acronym FRS, an award granted to individuals that the Royal Society judges to have made a \"substantial contribution to the improvement of natural knowledge, including mathematics, engineering science and medical science\"?",
        "response": "Fellowship of the Royal Society",
        "source": "hotpot_qa"
    },
    {
        "query": "In which region of the US did Marie Weaver earn her B.A.?",
        "response": "New England",
        "source": "hotpot_qa"
    },
    {
        "query": "The son of Police Chief Wiggum is chosen by a music producer to record songs containing subliminal messages about what? ",
        "response": "joining the Navy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Beryl Bainbridge and John Dos Passos both nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Ethan Hardy has had a romantic storyline alonside the character played by which star of Waterloo Road and Hollyoaks?",
        "response": "Chelsea \"Chelsee\" Jade Healey",
        "source": "hotpot_qa"
    },
    {
        "query": "Hich University was founded first, Cairo University or the University of Wyoming",
        "response": "University of Wyoming",
        "source": "hotpot_qa"
    },
    {
        "query": "What campaign did Courtney Young's replacement launch?",
        "response": "the Libraries Transform public awareness campaign",
        "source": "hotpot_qa"
    },
    {
        "query": "What NBC president created \"The Steven Banks Show\"?",
        "response": "Brandon Tartikoff",
        "source": "hotpot_qa"
    },
    {
        "query": "Which riffle on which SIG SG 550 is based is a 5.56×45mm NATO assault rifle developed in the early 1970s by Schweizerische Industrie Gesellschaft?",
        "response": "The SG 540",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Champions League Final was played on 22 May 2010 ",
        "response": "2010 UEFA Champions League Final",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"From Paris with Love\" was in an advertisement campaign for which fragrance brand?",
        "response": "Hugo Boss",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country are Doñana National Park and Atlantic Islands of Galicia National Park located?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "What frontman for Dead by Sunrise hurt his leg during the The Hunting Party Tour?",
        "response": "Chester Charles Bennington",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Portland International Airport and Gerald R. Ford International Airport both located in Oregon?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1983, Kevin McAlea wrote English-language lyrics to a hit by what German singer?",
        "response": "Nena",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older Chris Barfoot or Géza von Cziffra?",
        "response": "Géza von Cziffra",
        "source": "hotpot_qa"
    },
    {
        "query": "Annette Bryn Parri is a Welsh pianist, best known as an accompanist to opera stars such as which Welsh bass-baritone opera and concert singer?",
        "response": "Sir Bryn Terfel Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "What other game is comparable to Theatrix but uses playing cards as its randomiser?",
        "response": "Castle Falkenstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Pride & Prejudice, released in which year, is a British-American romantic drama directed by Joe Wright and based on Jane Austen's 1813 novel of the same name, produced by Working Title Films in association with Studiocanal?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Luis Lopez play for that is based in Montreal, Quebec? ",
        "response": "Montreal Expos",
        "source": "hotpot_qa"
    },
    {
        "query": "What relation was Samuel P. Bush to the 41st President of the USA, George H. W. Bush?",
        "response": "grandfather",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Sacha Baron Cohen's role in Ali G Indahouse?",
        "response": "written and performed by comedian",
        "source": "hotpot_qa"
    },
    {
        "query": "Matthew Perry's co-star in the film \"Almost Heroes\" appeared in what NBC comedy show?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Devil Came on Horseback and The California Reich both documentary?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "50 Lekë (50 L) have a value of 50 Albanian lek, the lek is the official currency of Albania, and is subdivided into how many \"qindarka\" (singular \"qindarkë\"), although qindarka are no longer issued?",
        "response": "100",
        "source": "hotpot_qa"
    },
    {
        "query": "Gordon Howe Park is named after Gordon Howe who was a Canadian professional ice hockey player from 1946 to what year?",
        "response": "1980",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Indiana Colts first draft and first ever selection pick win the Heisman Trophy?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Yani Gellman had a role in the 2003 comedy film released by whom?",
        "response": "Walt Disney Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Keith Raniere's company encourages what?",
        "response": "a path of personal and professional development.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what capacity did the author of the book,  An Inconvenient Truth,  serve in the United States government ? ",
        "response": "Vice President",
        "source": "hotpot_qa"
    },
    {
        "query": "Prof Andrew Ure FRS was a part of a heterogeneous group of writers described by Paul Wood as what?",
        "response": "mostly Anglican evangelicals",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie directed by Nicholas Ray starred the actress ranked 10th on the 1999 list of the greatest female stars of Classic Hollywood Cinema?",
        "response": "Johnny Guitar",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the stadium in West Cumbria that Darren Carter played in?",
        "response": "Derwent Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the man Wendell Tucker was traded to the Cowboys for play college football?",
        "response": "the University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Urby Emanuelson's manager at Ajax Youth Academy born?",
        "response": "1956",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who wrote \"The Two Trees\"?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which nine-time Grammy Award-winning gospel group helped found the National Quartet Convention?",
        "response": "The Blackwood Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the same of the city that  is the second largest city municipality in Italy and appeared in The 2010 Giro d'Italia?",
        "response": "Verona",
        "source": "hotpot_qa"
    },
    {
        "query": "Approximately how far is St Cyrpian's Church from London?",
        "response": "128 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "What network does a reality television show run on that one time featured the singer of the song \"My Neck, My Back (Lick It)?\"",
        "response": "BET",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both genera Silphium and Heliotropium, genera of flowering plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What medieval fortress in Dirleton was owned by Henry Maule's grandfather who served as a Lord?",
        "response": "Dirleton Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Ekaterina Alexeyevna Davydova skated with which 2006 Olympic champion, two-time World champion, three-time Grand Prix Final champion, and three-time European champion?",
        "response": "Roman Kostomarov",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company owns the hotel on whose premises the Cotal Arena is located ?",
        "response": "Las Vegas Sands company.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1993 psychological romantic thriller starring a man who began his career playing a soldier in the Doordarshan series \"Fauji\"?",
        "response": "Yash Chopra",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of Vladimir Mayakovsky and Czesław Miłosz?",
        "response": "Vladimir Vladimirovich Mayakovsky",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the band that released the album Build a Rocket Boys!   adopt their present band name ?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film does \"Naked Weapon\" follow in the \"Naked\" series?",
        "response": "\"Naked Killer\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the writer of \"Songs of Love\"?",
        "response": "Northern Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years was the woman in the story first covered in English by Stefanie Marsh held captive?",
        "response": "24",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Empire of the Sun and Billy Talent have the same number of band members ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American actor, director, and producer, who starred in Not Another B Movie?",
        "response": "February 13, 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Colin O'Meara voiced a character in which French-Canadian animated television series?",
        "response": "The Adventures of Tintin",
        "source": "hotpot_qa"
    },
    {
        "query": "Lou Lung Pai was CEO of what American energy, commodities, and services company based in Houston, Texas?",
        "response": "Enron",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Killing Joke founded in the same place as Evans Blue?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital located in Washington D.C. specializes in treating persons with physical disabilities,George Washington University Hospital or MedStar National Rehabilitation Hospital?",
        "response": "MedStar National Rehabilitation Network",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the prince who attended NHH Symposium with The Norwegian king, Harald V  born? ",
        "response": "20 July 1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote a story recalling his adventures crossing the St. Lawrence Atlantic Railroad  with fellow students during the American Civil War?",
        "response": "C. A. Stephens",
        "source": "hotpot_qa"
    },
    {
        "query": "Glow is a song from what 2017 Drake album?",
        "response": "More Life",
        "source": "hotpot_qa"
    },
    {
        "query": "What was James Chilton fleeing from?",
        "response": "religious persecution",
        "source": "hotpot_qa"
    },
    {
        "query": "What sitcom did Angela McEwan appear in which premiered on Fox?",
        "response": "New Girl",
        "source": "hotpot_qa"
    },
    {
        "query": "Kara Ross, is an American jewelry designer, she is the wife of American billionaire Stephen M. Ross, Ross is the chairman and majority owner, of which organization?",
        "response": "The Related Companies",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeff Bhasker has won a grammy for a Kanye West song that also appeared on his 2010 album by what name?",
        "response": "My Beautiful Dark Twisted Fantasy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Robert Pollard and Nic Offer both American musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Giorgio Ferroni and Gary Sherman who is the director of \"Death Line, Dead & Buried\"?",
        "response": "Gary Sherman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who of Anne Cochran's duet partners is best known for the song \"Vincerò, Perderò\"?",
        "response": "Mario Frangoulis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which TV series did the sound recordist of the film that Ronald Colman won an Academy Award for Best Actor work on?",
        "response": "Peter Gunn",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the main setting for the Steven Seagal film Under Siege?",
        "response": "battleship",
        "source": "hotpot_qa"
    },
    {
        "query": "What series set in San Francisco, California was written by the author of Alex Cross? ",
        "response": "Women's Murder Club",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Mugby Junction\" was first published in a Christmas edition of a magazine published in what country?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "What  attorney and an American politician of the Democratic Party in Montana was was challenged in the Democratic primary by Leif Erickson in an  election in Montana ?",
        "response": "Burton Kendall Wheeler",
        "source": "hotpot_qa"
    },
    {
        "query": "I Let The Music Speak, is a compilation album by which Swedish mezzo-soprano?",
        "response": "Anne Sofie von Otter",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this German philosopher, sociologist, and composer known for who was one of the few well-known Marxist intellectuals in post-war Germany alongside Leo Kofler, Max Horkheimer and Wolfgang Abendroth?",
        "response": "critical theory of society",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was the draft, in which Nemanja Dangubić was selected by the Philadelphia 76ers, held? ",
        "response": "June 26, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Multekrem and Kransekake are both traditional Norwegian desserts commonly eaten together during what winter holiday?",
        "response": "Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of Our Father's House portrays a woman with what profession?",
        "response": "schoolteacher and dressmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Who currently represents the Minnesota congressional district where Patty Wetterling was a candidate?",
        "response": "Tom Emmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Yuhui Choe is with which London classical ballet company?",
        "response": "The Royal Ballet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which global media and lifestyle company was founded by Hugh Hefner and sponsers the annual even called Playboy Jazz Festival?",
        "response": "Playboy Enterprises",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the hotel and casino located in which Bill Cosby's third album was recorded?",
        "response": "Las Vegas Strip in Paradise",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the party Bernard Rudolf \"Ben\" Bot  is in formed?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucy Hannah is the third-oldest verified person behind the supercentenarian who was of what nationality, the second-oldest in the world's history?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "This town with a population of 2,833 at the 2010 census is home to liberal arts college whose curriculum is based on the study of what?",
        "response": "the Great Books",
        "source": "hotpot_qa"
    },
    {
        "query": "What was name of the premiere performance in the Italian opera house where Jussi Bjorling sometimes performed?",
        "response": "Antonio Salieri's \"Europa riconosciuta\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the writer of the 1968 novel \"The Iron Man\" become Poet Laurete?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Heaven Beside You can be found on a 1995 album by Alice in Chains that was a follow up to which highly successful album?",
        "response": "Dirt",
        "source": "hotpot_qa"
    },
    {
        "query": "Ewa Aulin is remembered for playing the title character in a cult film directed by who?",
        "response": "Christian Marquand",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did The Chronicle of Philanthropy's publishing overlap with Antic?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "What former captain of the Iran national football team has Mani Djazmi interviewed?",
        "response": "Ali Daei",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Norwegian actress and model, starring in Bortreist på ubestemt tid?",
        "response": "12 November 1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the romantic comedy film that stars an actor that played Peter Waters and was born September 8, 1975?",
        "response": "Matty Rich",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American sportscaster was produced by WAER, and now is employed by ESPN?",
        "response": "Sean McDonough",
        "source": "hotpot_qa"
    },
    {
        "query": "How many BMI awards has the composer of the music score for the film Greedy received?",
        "response": "twelve",
        "source": "hotpot_qa"
    },
    {
        "query": "\\When was the Scottish-born scientist, inventor and engineer died who formed \"Silver Dart\"?",
        "response": "August 2, 1922",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the series who's first season was released on Netflix on September 22, 2016 and stars actor pronounced as John-a-kite?",
        "response": "Netflix",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two New York buildings, Time Warner Center and the Empire State Building, which one is taller?",
        "response": "Empire State Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was released earlier, Diplomacy or Torres?",
        "response": "Diplomacy",
        "source": "hotpot_qa"
    },
    {
        "query": "The proposed Armenian Genocide resolution was introduced by a U.S. Representative who has served in Congress since what year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Fort Crailo is located in a city with a population of what? ",
        "response": "9,392",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the company that, in partnership with Giochi Preziosi, made the Italian cartoon \"Dinofroz\"?",
        "response": "Orlando Corradi",
        "source": "hotpot_qa"
    },
    {
        "query": "Gândul Mâței and KMFDM, are what type of musical organization?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known as the lead singer of the 1980s new wave music group Altered Images, Clare Grogan or Chris Daughtry?",
        "response": "Claire Patricia Grogan",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Rowe, elevation 1680 ft , is a mountain located north of Gunstock Mountain, Gunstock Mountain is the second highest peak in the Belknap Mountains of central New Hampshire with an elevation greater than how many feet ?",
        "response": "2240",
        "source": "hotpot_qa"
    },
    {
        "query": "What Kim Dae-seung directed film featured former child actor Yoo Seung-ho?",
        "response": "The Magician",
        "source": "hotpot_qa"
    },
    {
        "query": "Sequoia is the son of which fictional character, a superheroine appearing in American comic books published by Marvel Comics?",
        "response": "Mantis",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2001 Scott Or was name on a list of \"gamemaking gods\" by a magazine headquartered in what city?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "What film in the HTTYD franchise was written and directed by Dean DeBlois?",
        "response": "How to Train Your Dragon 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is known for long dialogue and violence, Quentin Tarantino or Seth Holt?",
        "response": "Quentin Jerome Tarantino",
        "source": "hotpot_qa"
    },
    {
        "query": "What else was Baghdad known as during the Abbasid Caliphate?",
        "response": "the City of Peace",
        "source": "hotpot_qa"
    },
    {
        "query": "Walter Mart is home to which leader of the largest healthcare and beauty store chain in Asia?",
        "response": "Watsons",
        "source": "hotpot_qa"
    },
    {
        "query": "Brigette Lundy-Paine is known for her roles in \"The Glass Castle\" and another Netflix series which was released in what year?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Un ballo in maschera or Der Zwerg have more acts?",
        "response": "Un ballo in maschera",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created an American police procedural television series that starred the American actor Archie Kao as a regular?",
        "response": "Dick Wolf and Matt Olmstead",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in the 2010 census of the town that owns Dexter Regional Airport ? ",
        "response": "3,895",
        "source": "hotpot_qa"
    },
    {
        "query": "What league did the former aggressive player and AFL Premiership 2006 commentator with Dennis Cometti and Christi Malthouse play in?",
        "response": "Australian Football League",
        "source": "hotpot_qa"
    },
    {
        "query": "Which league used to include the club that plays in Stadio Comunale Riva IV?",
        "response": "Italian first league",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Treanor starred in a 1995 American martial arts comedy film directed by who?",
        "response": "Shin Sang-ok",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Reinhold Niebuhr write \"Moral Man and Immoral Society\" and argue Christian Realism?",
        "response": "the twentieth century",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998–99 Los Angeles Lakers season included the signing of the rebounding specialist who had what nickname?",
        "response": "The Worm",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark of the Gorilla is 1950 film starring a man that won how many Olympic gol medals?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Hollywood Wax Museum location is in the Ozark Mountains ?",
        "response": "Branson",
        "source": "hotpot_qa"
    },
    {
        "query": "Before Playing It My Way was launched, Walter Isaacson, who wrote biographies on people such as Benjamin Franklin and Albert Einstein, wrote a biography on this man, which held the record in India for most preordered book?",
        "response": "Steve Jobs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera  Pelléas et Mélisande and Die schweigsame Frau has fewer acts ?",
        "response": "Die schweigsame Frau",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose birthday falls closer to the beginning of the calendar year, Frank Borzage or David Attwood?",
        "response": "Frank Borzage",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2008 British-American-German fantasy adventure film directed by Iain Softley , starred a British-American actor, known for his roles in the romantic-drama film \"Breaking and Entering\"?",
        "response": "Inkheart",
        "source": "hotpot_qa"
    },
    {
        "query": "To what group of plants do both Dieffenbachia and Carlina belong?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British literary editor was given a dedication in the book first published by Andre Deutsch in 1967?",
        "response": "Diana Athill",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of The Devil's Delusion: born?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 71st annual Venice International Film Festival, the Silver Lion Grand Jury Prize was won by a 2014 international co-produced documentary that is a companion piece to what?",
        "response": "The Act of Killing",
        "source": "hotpot_qa"
    },
    {
        "query": "What Filmmaker is perhaps best known internationally for his performance as the lead villain in Bond film \"Quantum of Solace\", Ron Clements or Mathieu Amalric?",
        "response": "Mathieu Amalric",
        "source": "hotpot_qa"
    },
    {
        "query": "The Promise starred the Hong Kong actress who is considered what?",
        "response": "Sing girl",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died first, Jim Henson or Kurt Gerron?",
        "response": "Kurt Gerron",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Robert Kenner direct Traceroute or Food, Inc.?",
        "response": "Food, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bears and I and Treasure of Matecumbe, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What do The Man Who Skied Down Everest and Innocence have in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "What 13 book series of children's novels was authored by Lemony Snicket which was the pen name for Daniel Handler?",
        "response": "A Series of Unfortunate Events",
        "source": "hotpot_qa"
    },
    {
        "query": "200 Press is an EP by which singer, songwriter, and record producer?",
        "response": "James Blake Litherland",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stonewall Charity is named after a tavern in which part of New York City ?",
        "response": "Lower Manhattan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the city where Jeremiah Pearson Hardy spent most of his career in?",
        "response": "the \"Queen City\" of Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following has a father as an executive in the baking industry: Gary T. Smith or Kenneth Branagh?",
        "response": "Gary T. Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a breed of gun dog, English Cocker Spaniel or Villano de las Encartaciones",
        "response": "English Cocker Spaniel",
        "source": "hotpot_qa"
    },
    {
        "query": "Lonesome Lake is located south of a 4080 ft peak that was home to what?",
        "response": "the Old Man of the Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "\" A Night Out in London\" is the fourth episode in which British coming of age sitcom starring Simon Bird?",
        "response": "\"The Inbetweeners\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has managed both Chelsea F.C. and Manchester United?",
        "response": "José Mourinho",
        "source": "hotpot_qa"
    },
    {
        "query": "Namie Amuro's eleventh studio album includes a genre of music that first appeared amongst what UK movement in the late 1980's?",
        "response": "\"acid\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album released on September 22, 2017, by the Killers, features the song 'Some Kind of Love'?",
        "response": "Wonderful Wonderful",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the village and civil parish which includes Thurlby?",
        "response": "Witham St Hughs",
        "source": "hotpot_qa"
    },
    {
        "query": "What area does WOAD and Ridgeland, Mississippi have in common?",
        "response": "Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which eatery sell more variety of food, Gino's East or Bearno's?",
        "response": "Gino's East",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Vancouver artist founded the annual event from which Buy Nothing Christmas got it's name?",
        "response": "Ted Dave",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drug store chain with approximately 40 stores in Hawaii is located in Lahaina Cannery Mall? ",
        "response": "Longs Drugs",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the head coach of the 2016 Penn State Nittany Lions football team previously serve as head coach?",
        "response": "Vanderbilt University",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian beer is a British style pale ale whose label features a character conceived in 1926? ",
        "response": "Ballarat Bitter is a 4.9% (abv) Australian beer",
        "source": "hotpot_qa"
    },
    {
        "query": "The client of Roman Grill who is also a television pundit for BT Sport was born in which Canadian city?",
        "response": "Calgary, Alberta",
        "source": "hotpot_qa"
    },
    {
        "query": "What is both Grimaldi's Pizzeria and Papa Gino's primary menu item?",
        "response": "pizzas",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the manager of both Billy J. Kramer and an English rock  band formed in Liverpool in 1960?",
        "response": "Brian Epstein",
        "source": "hotpot_qa"
    },
    {
        "query": "The John F. Kennedy Memorial is located on Ocean Street in Hyannis, Massachusetts, it overlooks which location, where President Kennedy often sailed throughout his life while in Hyannis Port (or Hyannisport) is a small residential village located in Barnstable, Massachusetts, United States?",
        "response": "Lewis Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Fulk FitzWarin rebelled against what King, who lost the Ducy of Normandy to King Phillip II of France?",
        "response": "John",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Rémi Lange or Max Reinhardt?",
        "response": "Max Reinhardt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which flowering plant is native to Central America, Helictotrichon or Odontonema?",
        "response": "Odontonema",
        "source": "hotpot_qa"
    },
    {
        "query": "Derailed starred a South Korean singer who debuted as a member of the South Korean boy group Shinee in what year?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the recent films Chasing Coral and Sharkwater both concerned with marine conservation?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Robert Bunsen or Gustav Kirchhoff?",
        "response": "Robert Wilhelm Eberhard Bunsen",
        "source": "hotpot_qa"
    },
    {
        "query": "564 Dudu was named after a novel published between 1883 and 1891, what is the name of the novel?",
        "response": "Thus Spoke Zarathustra",
        "source": "hotpot_qa"
    },
    {
        "query": "Cloudburst is a famous composition by what American composer?",
        "response": "Eric Whitacre",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of group does Go Radio and Mayday Parade have in common?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Virtù was a concept theorized by which Italian diplomat?",
        "response": "Niccolò di Bernardo dei Machiavelli",
        "source": "hotpot_qa"
    },
    {
        "query": "Adrian Schiller appeared in a 2015 romantic drama film directed by who?",
        "response": "Tom Hooper",
        "source": "hotpot_qa"
    },
    {
        "query": "Karl Kraus wrote The Last Days of Mankind to direct satire at what?",
        "response": "the press, German culture, and German and Austrian politics.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed- Akita, Alaunt or both originated from Japan?",
        "response": "Akita",
        "source": "hotpot_qa"
    },
    {
        "query": "What popular Hollywood star of the 1950s was featured in the movie adaption of the short story \"Babylon Revisited\"?",
        "response": "Elizabeth Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music does the radio station WWJD owned by Alice Lloyd College play?",
        "response": "Contemporary Christian music",
        "source": "hotpot_qa"
    },
    {
        "query": "K'ak'upakal was ruler at a pre-columbian city that is located in Tinum Municipality, in what Mexican state?",
        "response": "Yucatán State",
        "source": "hotpot_qa"
    },
    {
        "query": "What company owns Nevada's second-largest paper?",
        "response": "Gannett Company",
        "source": "hotpot_qa"
    },
    {
        "query": "what year was the writer of the blog Preposterous Universe born?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Are University of Minnesota and University of California, Irvine both public universities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What private home on Altamount Road is owned by the Chairmen of Reliance Industries?",
        "response": "Antilia",
        "source": "hotpot_qa"
    },
    {
        "query": "Iosefo Verevou, is a Fijian footballer who plays as a forward, are the players on an association football team who play nearest to the opposing team's goal, and are therefore most responsible for scoring goals, for which organization, in the Fiji National Football League?",
        "response": "Rewa",
        "source": "hotpot_qa"
    },
    {
        "query": "An english lawyer had Christopher Mont as an agent and was awarded denization where?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed Revolver, the 2005 crime thriller starring the English actor Jason Statham?",
        "response": "Guy Ritchie",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is  unincorporated area and census-designated place which , Takoma Langley Crossroads Transit Center is in located ",
        "response": "Prince George's County, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the Saab 38 and the Saab JAS 39 Gripen have a single-engine or multiple engines?",
        "response": "single-engine",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the fastest time (in seconds) that racers complete the race that Gary Scelzi won three times? ",
        "response": "3.64",
        "source": "hotpot_qa"
    },
    {
        "query": "What title have both Iveta Benešová and Heather Watson won?",
        "response": "Wimbledon Mixed Doubles Champion",
        "source": "hotpot_qa"
    },
    {
        "query": "The fictional character Tracey Kibre is played by an actress that played what role on the tv sitcom \"Cheers\"?",
        "response": "Dr. Lilith Sternin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the distance between the city where the Goulburn Herald is published and Sydney?",
        "response": "195 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company is developing this higher-speed rail system that will be served by the new station in the Orlando International Airport Intermodal Terminal partially being funded by the Florida Department of Transportation?",
        "response": "All Aboard Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Who distributed for an American media franchise with an installment starring Vera Farmiga?",
        "response": "Warner Bros.",
        "source": "hotpot_qa"
    },
    {
        "query": "Samuel Hsieh is currenly competing in a compact car that was launched in which Auto show ?",
        "response": "2012 Paris Auto Show",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 90's movies Heavyweights and That Darn Cat dot ehy have any of the same actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What medal did the new namesake of the campus of the Patchogue-Medford High School receive",
        "response": "the Medal of Honor",
        "source": "hotpot_qa"
    },
    {
        "query": "The Deadly Tower, also known as Sniper, is a 1975 television film, it stars which American actor?",
        "response": "Kurt Vogel Russell",
        "source": "hotpot_qa"
    },
    {
        "query": "Egon Bondy's Happy Hearts Club Banned is a parody of which 1967 Beatles album?",
        "response": "Sgt. Pepper's Lonely Hearts Club Band",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the man who described Richard Paul Ashcroft as \"the best singer in the world\" born?",
        "response": "Whitestone",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2002, Jump5 released covers of \"Strange Way To Save The World\" and another Christmas carol written by whom?",
        "response": "Isaac Watts",
        "source": "hotpot_qa"
    },
    {
        "query": "Precious TV is owned and operated by a church founded by whom?",
        "response": "Charles Agyinasare",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian poet co-authored a song later given new English lyrics to its tune?",
        "response": "Konstantin Nikolayevich Podrevsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Which national forest on Roan Mountain was created in 1920?",
        "response": "Cherokee National Forest",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Hustler and Giant Robot pornographic magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Martins Motorsports team's part-time No. 42 truck is driven by a racer that drives what vehicle for Faith Motorsports?",
        "response": "Chevrolet Silverado",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Maynard became Rail Minister after the entrance of the Prime Minister who took office in what year?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Verneuil included a Scottish army led by which warlord who is sometimes given the epithet of \"loser\"?",
        "response": "Archibald Douglas",
        "source": "hotpot_qa"
    },
    {
        "query": "Choi Min-sik starred alongside Scarlett Johansson in the 2014 film written and directed by whom?",
        "response": "Luc Besson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the fourth novel in the cycle of books focused  on the adventures of a teenage boy named Eragon?",
        "response": "Inheritance",
        "source": "hotpot_qa"
    },
    {
        "query": " George Joseph Maloof Jr is the minority owner of a hotel and casino with how many rooms and suites?",
        "response": "703",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the Indian rock band Musafir from?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did the AMIA bombing and Alberto Nisman share?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Margaret Storm Jameson and Joseph Conrad both known for their reviews?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Canadian-Hong Kong actress and singer, who starred in Treasure Inn?",
        "response": "22 November 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the rival school, located in Summerlin, to Durango High School open?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname given to the player at the University of Notre Dame where he played wide receiver on the school's 1988 national champion team, by  A six-time honoree of the National Sports Media Association's \"National Sportscaster of the Year\" award?",
        "response": "Ricky \"Running\" Watters",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person won the Nobel Prize in Literature in 1961, Ivo Andrić or Nicholas Pileggi?",
        "response": "Ivo Andrić",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is Stewart Nozette imprisoned?",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Drentse Patrijshond and Weimaraner are both breeds of what animal?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian singer participated in Indian Idol and also sung a duet with Arijit Singh?",
        "response": "Asees Kaur",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in the Calendar Girl Murders was born in March?",
        "response": "Sharon Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the original location of The History of Ranching mural eventually close?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was more active in the theater community George Bernard Shaw or Katherine Kurtz?",
        "response": "George Bernard Shaw",
        "source": "hotpot_qa"
    },
    {
        "query": "How far southeast of Xalapa is the city at the east end of Mexican Federal Highway 150?",
        "response": "90 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Panama Deception and Spellbound both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What song from the Beatles ninth studio album was written by George Harrison?",
        "response": "\"Piggies\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from a country closer to Canada, Local H or Bodyjar?",
        "response": "Local H",
        "source": "hotpot_qa"
    },
    {
        "query": "Life in Mono is the third studio album by an English singer best known as a member of what girl group?",
        "response": "the Spice Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the highest peak, that rises to 2753 ft, located on the mountain range next to Booneville, Arkansas?",
        "response": "Mount Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Domestic Violence Offender Gun Ban, is an amendment to the Omnibus Consolidated Appropriations Act of 1997, the act is often referred to as \"the Lautenberg Amendment\" after its sponsor, Senator Frank Lautenberg, was a United States Senator, and member of the Democratic Party, from which state?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "The Montana National Guard consists of the Montana Air National Guard, and the Montana Army National Guard is a component of the United States Army, and which organization?",
        "response": "United States National Guard",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the Korean movie Scandal Makers?",
        "response": "Kang Hyeong-cheol",
        "source": "hotpot_qa"
    },
    {
        "query": "In the early years of \"Saturday Night Live\" an archetypal samurai was portrayed by an American comedian best known for what?",
        "response": "intense energy and raucous attitude",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the family relationship between the two writers of \"Woman in Love\"?",
        "response": "brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Manchester City beat on the day that Swansea City beat Liverpool 1-0 in the 2011-12 season ?",
        "response": "Queens Park Rangers",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jang Joon-hwan and Rudolf Schwarzkogler both from the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Little (1773-1849) was an attorney and philanthropist who donated 9 acre and considerable money to the academy, which was named in his honor, Edward Little High School, first established as Lewiston Falls Academy in which year?",
        "response": "1835",
        "source": "hotpot_qa"
    },
    {
        "query": "On what street that was once home to the Royal Geographical Society, could you one find the Burlington Fine Arts Club?",
        "response": "Savile Row",
        "source": "hotpot_qa"
    },
    {
        "query": "Which governor of New Hampshire attempted to reappoint Michael Delaney?",
        "response": "Maggie Hassan",
        "source": "hotpot_qa"
    },
    {
        "query": "Christopher Chase-Dunn was born in the same city as what University?",
        "response": "Oregon State University",
        "source": "hotpot_qa"
    },
    {
        "query": "What was William T. Anderson the leader of in the Centralia Massacre?",
        "response": "pro-Confederate guerrilla leaders",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Dramatic School was the first actor to win more than one Academy Award?  ",
        "response": "Luise Rainer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the Admiral who authorized the First Yale Unit claim to have reached?",
        "response": "North Pole",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did Alex Saxon play in an American family drama television series created by Peter Paige and Bradley Bredeweg which first premiered in the United States on June 3, 2013?",
        "response": "Wyatt",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the most common predator of the animal that is susceptible to the parasite Parelaphostrongylus tenuis and typically inhabit boreal forests and temperate broadleaf and mixed forests of the Northern Hemisphere in temperate to subarctic climates?",
        "response": "the gray wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the zip code that includes the metropolitan area of Jacksonville, Florida?",
        "response": "32073",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of engineer worked with K.F Cheung in establishing the Cheung-Marks theorem?",
        "response": "polymath electrical engineer",
        "source": "hotpot_qa"
    },
    {
        "query": "In what two decades did an  electronic, digital or computer device that outputs a video signal or visual image to display a video game that one or more people can play, become popular?",
        "response": "1970s and 1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "As of the 2010 census, what was the population of the community in which private golf club TPC at Summerlin is located?",
        "response": "nearly 100,000",
        "source": "hotpot_qa"
    },
    {
        "query": "When was this NHL goaltender who had a species of wasp named after him born?",
        "response": "10 March 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Pittsfield Colonials was priorly known under a name, and were based where?",
        "response": "Nashua, New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": " Adam Carroll currently races for a previously Formula One constructor that competed in the FIA Formula One what?",
        "response": "World Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "Olivia Luccardi stars along Hugh Grant in what romantic comedy?",
        "response": "The Rewrite",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the film director who directed \"The Secret Tournament\" global advertising campaign ?",
        "response": "American-born British",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boeing Boeing 737-300 traveling from Belize to New Orleans was operated by an airline that has been in operation for how long?",
        "response": "75 years",
        "source": "hotpot_qa"
    },
    {
        "query": "What duet performed Peace on Earth/Little Drummer Boy",
        "response": "Crosby and Bowie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town located in the county seat of Oktobbeha County Mississippi is the Cotton District located?",
        "response": "Starkville",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the arena, at which the first Summadayze festival was held, officially opened ?",
        "response": "12 February 1959,",
        "source": "hotpot_qa"
    },
    {
        "query": "Glencliff is an unincorporated community within the White Mountain National Forest in the town of Warren, Warren is a town in Grafton County, New Hampshire, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Peniocereus and Anthericum both found in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Dziura is an American film director, cinematographer, and editor, in 2001, Jim directed a feature-length documentary about Swedish musician Moneybrother for Red Bull, an energy drink sold by Austrian company Red Bull GmbH, created in which year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "The Emperor Waltz was directed by which Austrian-American filmmaker?",
        "response": "Samuel \"Billy\" Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a band from Texas, Gnarls Barkley or Residual Kid?",
        "response": "Residual Kid",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the American healthy lifestyle magazine, in which Georgia Rickard contributed, started?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Who ordered Jewish people to be sent to Nazi concentration camps as described in the book The Lost Childhood, in March 1933?",
        "response": "Hitler",
        "source": "hotpot_qa"
    },
    {
        "query": "William Desmond Taylor was famous for his work in this type of film, including Big Timber.",
        "response": "silent films",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio is responsible for the release of the 2010 country pop song 'Fearless' which was performed by an American singer-songwriter whose debut studio album was released when she was just 16 years old?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach in the 1965–66 Kentucky Wildcats men's basketball team was enshrined in the Naismith Memorial Basketball Hall of Fame in what year?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "DS Arena, home of Hobro IK football club, is located in which region of Denmark that was established in 2007?",
        "response": "North Denmark Region",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current world record holder in high jump and uncle of Lorenzo Sotomayor Collazo? ",
        "response": "Javier Sotomayor",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the R&B group founded that released a single contains a sample of the DeBarge song \"A Dream\"?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Superleague Greece is ranked 14th in the ranking system that was introduced in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the national team of which Maxwell Konadu was caretaker coach ?",
        "response": "the Black Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the CEO of the company that produces the LG Tab-Book?",
        "response": "Bon-joon Koo",
        "source": "hotpot_qa"
    },
    {
        "query": "John Ida is best known for the vocalist and guitarist in which band?",
        "response": "Yardbirds",
        "source": "hotpot_qa"
    },
    {
        "query": "Which meet selection from a meat and three restaurant consists of a piece of steak coated with seasoned flour and pan-fried?",
        "response": "Chicken fried steak",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Emeishan City and Chaoyang, Liaoning both located in China ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When was one of the stars of the English voice-cast of  Kung Fu Magoo born? ",
        "response": "May 19, 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred with German-American actress and former fashion model in \"Anything for Her?\"",
        "response": "Vincent Lindon",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Len Williams II  is best known for producing trap beats for several Southern hip hop artists as well as for producing several singles, such as which song by Barbadian recording artist Rihanna from her seventh studio album, \"Unapologetic\" (2012)?",
        "response": "Pour It Up",
        "source": "hotpot_qa"
    },
    {
        "query": "Johnetta \"Netta\" Elzie is an American civil rights activist, she is one of the leaders in the activist group We The Protesters and co-edits the Ferguson protest newsletter \"This Is the Movement\" with fellow activist DeRay Mckesson, an American civil rights activist and former school administrator, and supporter of which movement?",
        "response": "Black Lives Matter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more known species, Ageratum or Lavandula?",
        "response": "Ageratum",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Kit Kat brand the top-selling confection in Japan while Nestle was the largest food company in the world?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Cartman's Mom Is a Dirty Slut\" is the first season finale of the American animated television series \"South Park\", it is part one of a two-episode story arc, which concluded with \"Cartman's Mom Is Still a Dirty Slut\", the episode concludes the storyline of the season one finale \"Cartman's Mom Is a Dirty Slut\"; who is suddenly shot, just as he is about to reveal the identity of Cartman's father?",
        "response": "Mephesto",
        "source": "hotpot_qa"
    },
    {
        "query": "Luis Llosa and John Ince shared what job?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What host of the Saturday Disney morning show in London starred in a J.K. Rowling film?",
        "response": "Carmen Ejogo",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer, born Inga DeCarlo Fung Marchand, performs Come Fly with Me?",
        "response": "Foxy Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Stephen Huss and Xavier Malisse, who is more closely associated with David Goffin?",
        "response": "Xavier Malisse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the co-founder of \"General Magic\" was born in 1951?",
        "response": "Bill Atkinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Akatsi North District and its capital Ave-Dakpa are located in which African country?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "The catch-all term \"The Obama Doctrine\" outlines the foreign policy of which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1924  E. C. Rhodes became Reader at a university founded in what year?",
        "response": "1895",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Yibin and Cangzhou both located in the Sichuan province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the singer of the song that held the record for most weeks spent at number one by a female country artist until it was surpassed by the the one named second best song of 2012 by \"Rolling Stone Magazine\"?",
        "response": "Connie Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010–11 season was Birmingham City Football Club' s seventh season in the Premier League and their 57th in the top tier of English football,  won the League Cup, their first major trophy since 1963, by beating favourites Arsenal 2–1 in the final with goals from Nikola Žigić and Obafemi Akinwunmi Martins (born 28 October 1984) is a Nigerian footballer who plays as a forward for which team? ",
        "response": "Shanghai Greenland Shenhua",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series features episode \"The Original\" and is created in part by a Burn Notice writer?",
        "response": "Westworld",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1975 NCAA Division I Basketball Tournament involved 32 schools playing in single-elimination play to determine the national champion of men's NCAA Division I college basketball, it ended with the championship game on March 31 at the San Diego Sports Arena, now known as what, which indoor arena located at Sports Arena Blvd in Point Loma, San Diego, California? ",
        "response": "Valley View Casino Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Pitt & Kantrop is a children's television programme produced by the Eurovision Network and was shown on BBC One and CBBC in the United Kingdom, it is from the creators of which French animated series about an intelligent talking dog, Corneil, and his \"dog-sitter\", Bernie Barges?",
        "response": "Watch My Chops",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played John Kelly on \"NYPD Blue\" also stars with Nicholas Cage in a 1995 crime thriller film directed by who?",
        "response": "Barbet Schroeder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Todd Strauss-Schulson movie stars Taissa Farmiga?",
        "response": "The Final Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Photograph\" is a song by Ringo Star released on his album that reached what number on the \"Billboard\" 200?",
        "response": "number 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hewitt and Peng Shuai, are professional ?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"black spider\" memos are letters and memos, to British government ministers and politicians over the years, written by Charles, Prince of Wales, the eldest child and heir apparent of who?",
        "response": "Queen Elizabeth II",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Brian Robinson and NFL Scouting Combine have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": " Colin Pickthall was Labour Member of Parliament for a constituency currently represented by who?",
        "response": "Rosie Cooper",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Fahrenheit 9/11 and Hip-Hop: Beyond Beats and Rhymes both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the voice actor who was born August 18, 1978 and starred in the movie \"Hotel Transylvania\"?",
        "response": "Andy Samberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Dihanaam uses type of hand instrument that could be considered what?",
        "response": "clash cymbals",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mine was a gold producer at Yellowknife, Negus Mine or McIntyre Mines?",
        "response": "Negus Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did a Battleship actor starred in with Robert De Niro?",
        "response": "The Mission",
        "source": "hotpot_qa"
    },
    {
        "query": "What American soft drink company, based in Plano, Texas and is competition to Cott Corporation?",
        "response": "Dr Pepper Snapple Group",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people lived in the country occupying the land where Solomon Baruch Komaiko was born in 2017",
        "response": "2.8 million",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the original drummer for the Who inducted into the Modern Drummer Hall of Fame?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Doug Basham was an American wrestler who worked with?",
        "response": "Danny Basham",
        "source": "hotpot_qa"
    },
    {
        "query": "Van Dick 73 is known for its role in the telenovela staring an actress who is dubbed with what two ancestries?",
        "response": "French-Mexican",
        "source": "hotpot_qa"
    },
    {
        "query": "Srikanth Balachandran is the Global CHRO of what Indian global telecommunications service company based in New Delhi, India?",
        "response": "Bharti Airtel",
        "source": "hotpot_qa"
    },
    {
        "query": "What British intelligence officer worked as a double agent for the Soviet Union and was recruited by Arnold Deutsch?",
        "response": "Kim Philby",
        "source": "hotpot_qa"
    },
    {
        "query": "What other team did the head coach of the University of Houston coach for?",
        "response": "Purdue Boilermakers",
        "source": "hotpot_qa"
    },
    {
        "query": "The site that was the operating base for FMA IA Pucara was attacked in 1982 by which segment of the British Army?",
        "response": "British Special Forces",
        "source": "hotpot_qa"
    },
    {
        "query": "Which guitarist is older, Miles Hunt or Paul Cotton?",
        "response": "Paul Cotton",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Elizabeth McGlynn, a voice actress and singer-songwriter, has contributed to what 2006 horror film which is adapted off of Konami's popular game series?",
        "response": "Silent Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "which is the eldest, Blackjack Pizza or Papa Murphy's?",
        "response": "Papa Murphy's",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the younger brother of Farshid Karimi born ?",
        "response": "8 November 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Paul Hindemith and Maurice Ravel both violinists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hoboken, New Jersey is located in which county?",
        "response": "Hudson County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won an Academy Award for cinematography for the 1999 American drama film directed by Sam Mendes and written by Alan Ball?",
        "response": "Conrad Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie that stars the owner of Plan B Entertainment is based on a 1979 novella by Jim Harrison?",
        "response": "Legends of the Fall",
        "source": "hotpot_qa"
    },
    {
        "query": "What level of the Argentine football system does the club based in the leafy, northern neighborhood of Buenos Aires play?",
        "response": "Primera B Metropolitana",
        "source": "hotpot_qa"
    },
    {
        "query": "Perri and Fantasia 2000, have which film parent company in common?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the successor to the Mercedes-Benz W25?",
        "response": "Rudolf Uhlenhaut",
        "source": "hotpot_qa"
    },
    {
        "query": "What fungus, which is widely distributed across the Northern Hemisphere is related to the fungus Bloetus austroedulis?",
        "response": "Boletus edulis",
        "source": "hotpot_qa"
    },
    {
        "query": "Régional Compagnie Aérienne Européenne is a subsidiary of an airline carrier that has its corporate headquarters at what location?",
        "response": "Charles de Gaulle Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean Terrell and Forrest Kline, have which mutual occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Renaissance dramatist co-wrote Anything for a Quiet Life with John Webster?",
        "response": "Thomas Middleton",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the 1984 Olympic gold medalist who was married to the fastest woman of all time born?",
        "response": "East St. Louis, Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Dick Crealy and Javier Frana are former players of what sport?",
        "response": "former tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "The first Korean student movement begun in 1919, when students took part in the Sam-il Movement of 1 March to call for the end of Japanese colonization, after the Gwangju massacre in May 1980, the student movement got a clear vision, partly based on which form of socioeconomic analysis that explores class relations and societal conflict using a materialist interpretation of historical development and a dialectical view of social transformation – it originates from the mid-to-late 19th century works of the German philosopher Karl Marx?",
        "response": "Marxism",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has recorded more albums, Dennis Agajanian or Mike Connors?",
        "response": "Dennis Agajanian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Y-wing is a fictional Galactic Republic, Rebel Alliance and New Republic starfighter in the \"Star Wars\" franchise, they appear in Rogue One, released in which year, an American epic space opera film? ",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Icehouse pieces and El Grande come from the same game?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer, best known for his recording of the song \"Raindrops Keep Fallin' on My Head\", had his single \"Most of All\" reach #2 on the \"Billboard\" Adult Contemporary singles chart in 1970?",
        "response": "B. J. Thomas",
        "source": "hotpot_qa"
    },
    {
        "query": "How many albums have been sold by the singer who released the 2002 single \"Sk8er Boi\"?  ",
        "response": "40 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What Austro-Hungarian composer helped produce \"Princess Flavia\" and \"New Moon\"?",
        "response": "Sigmund Romberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession,  PJ Harvey or Salt?",
        "response": "Polly Jean Harvey",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ashanti Medal was created for those troops that were engaged in a war that took place in which part of Africa ?",
        "response": "West Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Roman was the band directer of what marching band that was founded in 1908 by a group of 14 students?",
        "response": "The Georgia Tech Yellow Jacket Marching Band",
        "source": "hotpot_qa"
    },
    {
        "query": "Raghuvamsha Sudha has been rendered by the first Vice Chancellor of what?",
        "response": "Tamil Nadu Music and Fine Arts University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the running back that U.S Route 34 in Illinois is named after?",
        "response": "July 25, 1954",
        "source": "hotpot_qa"
    }
]