[
    {
        "query": "Robert Earl Holding was an American businessman who owned Sinclair Oil Corporation whose logo features the silhouette of what?",
        "response": "a large green dinosaur",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in due \"Due South\" did the star of \"Slings and Arrows\" play?",
        "response": "Constable Benton Fraser",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul McCartney released the song \"Ebony and Ivory\" on his third solo studio album, which was released when?",
        "response": "released in April 1982",
        "source": "hotpot_qa"
    },
    {
        "query": " The Badge is a 2002 mystery-thriller film starring an American actress whose notible films include what 1999 Martin Scorsese film?",
        "response": "Bringing Out the Dead",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the place where a Vegas strip show featuring Olivia Newton John in 2014 and scheduled to end in 2015 called ",
        "response": "Flamingo Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "The SERC Reliability Corporation was formed by the merger of four reliability entities, one of which has an executive office located in Birmingham and its headquarters in what city? ",
        "response": "Atlanta",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the venture capital firm where Emmett Shear is a part-time partner start?",
        "response": "March 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "What line of Competitive swimwear did speedo manufacturer  that is composed of woven elastane-nylon and polyurethane",
        "response": "LZR Racer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Max Carl and Tairrie B. both American singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is native to more continents, Bursaria or Melissa?",
        "response": "Melissa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which club located in Stratford, East London has the 2009 Upton Park riot?",
        "response": "West Ham United Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joey Tempest and Aaron Lewis both considered American musicians?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the movie whose trailer featured a Lykan HyperSport?",
        "response": "F. Gary Gray",
        "source": "hotpot_qa"
    },
    {
        "query": " Which film was made first Portrait of Gina or Crazy Love?",
        "response": "Portrait of Gina",
        "source": "hotpot_qa"
    },
    {
        "query": "Myron F. Diduryk, was described by Hal Moore in which book?",
        "response": "We Were Soldiers Once and Young",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine was started in 1925 and features the work of Barry Werth?",
        "response": "The New Yorker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is from India, David Twohy or Padmarajan?",
        "response": "Padmarajan",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Truth\" originally served as the finale of the ninth season of which American science fiction television series that aired its tenth season on January 24, 2016?",
        "response": "The X-Files",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Brackman is represented by a sports agent born in which year ?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the shortest-lived Nickelodeon series that included the character Angelica Pickles?",
        "response": "Rugrats Pre-School Daze",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Dutch-English person was a person involved with the Heineken Prizes for Arts and Sciences",
        "response": "Charlene de Carvalho-Heineken",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the college founded that released Mildred H. McAfee to become first director of WAVES",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Poznan and Zlotnki Wielkie performed in what country? ",
        "response": "west-central Poland",
        "source": "hotpot_qa"
    },
    {
        "query": "Untitled 2 is a jazz rap song by American rapper Kendrick Lamar featured on a compilation album that was released on?",
        "response": "March 4, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "The tennis player who partnered with Peter Flemin in 1979 Wimbledon Championships was born in which year?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the father of Hyrbyair Marri from?",
        "response": "Balochistan",
        "source": "hotpot_qa"
    },
    {
        "query": "Bodil Rasmussen was born in which Danish town?",
        "response": "Fredericia",
        "source": "hotpot_qa"
    },
    {
        "query": "For which car bombing in Northern Ireland did Tim Hegarty and Ross Graham release a support album?",
        "response": "Omagh bombing",
        "source": "hotpot_qa"
    },
    {
        "query": "George Madison was taken prisoner following a battle that had the highest number of fatalities of any battle during the war, and took place on what date?",
        "response": "January 22",
        "source": "hotpot_qa"
    },
    {
        "query": "What High Middle Ages institution did the archbishop of Tyre attend for twenty years?",
        "response": "A medieval university",
        "source": "hotpot_qa"
    },
    {
        "query": "How many combat missions did the pilot on whom the book The Blond Knight of Germany is based ",
        "response": "1,404",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the seventh King of the Belgians?",
        "response": "Fulco VIII",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote comic opera, Gianni Schicchi, which features the soprano aria sung by Lauretta?",
        "response": "Giacomo Puccini",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant was been adopted into the traditional medicine of countries far-removed from its original home, Nicandra or Sternbergia?",
        "response": "Nicandra",
        "source": "hotpot_qa"
    },
    {
        "query": "What award was given to the Norwegian-born American physical chemist which Bruria Kaufman used applied spinor analysis to rederive the result of on the partition function of the two-dimensional Ising Model",
        "response": "Nobel Prize in Chemistry",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ohr-O'Keefe Museum Of Art is a non-profit art museum located in Biloxi, Mississippi, dedicated to the ceramics of which self-proclaimed \"Mad Potter of Biloxi\", an American ceramic artist?",
        "response": "George Edgar Ohr",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mikhail Kalatozov and Pierre Chenal both film directors ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Henriëtte Elisabeth de Swart linguist of a Germanic ethnic group native to where?",
        "response": "Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Petrovich Nikolayev received the title Hero of the Soviet Union and the Order of Lenin for his actions during the   the final major offensive of the European theatre of what war?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog is known as French White and Black Hound, the Grand Griffon Vendéen or the Chien Français Blanc et Noir?",
        "response": "Chien Français Blanc et Noir",
        "source": "hotpot_qa"
    },
    {
        "query": "United Spirits Limited is a sibsidiary of a company headquartered where?",
        "response": "London, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Forbes College was a gift to honor a man born in what year",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Heartbeat produced Dragon Quest which was know as what in North America?",
        "response": "Dragon Warrior",
        "source": "hotpot_qa"
    },
    {
        "query": "Are \"Shore Things\" and \"Licensed to Kill\" both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, the Chalk FarM band or Beck Hansen, released two albums in the late 1990s?",
        "response": "Chalk FarM",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a previous unoffical name for the high performance variant of Audi's compact executive car?",
        "response": "Audi Ur-S4",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has had more members, Ubiquitous Synergy Seeker or Super Furry Animals?",
        "response": "Super Furry Animals",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Dawn Denbo on \"The L Word\" also stars with Amanda Peet and Oliver Platt in a 2010 film directed by who?",
        "response": "Nicole Holofcener",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university is older, Brown University or University of Southern California?",
        "response": "Brown University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the Japanese clothing brand which was one of the brands distributed by  I.T?",
        "response": "Nigo in Ura-Harajuku",
        "source": "hotpot_qa"
    },
    {
        "query": "Which, Cadia or Colvillea,is a genus of legume in the Fabaceae family?",
        "response": "Colvillea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occurred first, the Battle of the Ch'ongch'on River or the Second Battle of the Marne?",
        "response": "Second Battle of the Marne",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the coach of the Port Qasim Authority cricket team born?",
        "response": "14 October 1968",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country was the actor Chris Hemsworth, one of the stars in the motion picture Thor: The Dark World, born?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Lautaro Fausto Grillo is an Argentine footballer, who plays for which Argentine sports club, based in Liniers, Buenos Aires?",
        "response": "Club Atlético Vélez Sarsfield",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent has the Kogyae Strict Nature Reserve?",
        "response": "Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the state located where Taddeo Manfredi served as commander?",
        "response": "Tuscany",
        "source": "hotpot_qa"
    },
    {
        "query": "Cecil Randolph Dudgeon (7 November 1885 – 4 November 1970) was a Scottish Liberal Member of Parliament (MP) who joined which British politician who rose to fame in the 1920s as a Member of Parliament, and later in the 1930s, became leader of the British Union of Fascists (BUF), New Party?",
        "response": "Oswald Ernald Mosley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1995 film starring a man born 15 August 1962 as Srinivasa Sarja?",
        "response": "C. Sivakumar",
        "source": "hotpot_qa"
    },
    {
        "query": "In what 2005 dystopian political thriller film does John Hurt play the main antagonist, Adam Sutler?",
        "response": "V for Vendetta",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the man that defeated Walid Sedik Mohamed on round 32 of the 2016 Summer Olympics in the men's welterweight event?",
        "response": "Josh Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of August Wagenmann's city of death, as of 2015?",
        "response": "156,257",
        "source": "hotpot_qa"
    },
    {
        "query": "The Red and Blue Chair represents one of the first explorations by an atristic movement also known as what?",
        "response": "neoplasticism",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the  American romantic comedy-drama which Mackenzie Davis  made her film debut in ",
        "response": "Tom Gormican",
        "source": "hotpot_qa"
    },
    {
        "query": "Andre Tricoteux is known for playing the Orc War Captain in the film directed by whom?",
        "response": "Duncan Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professional footballer played for Kadji Sports Academy as a youth and went on to be the most decorated African player of all time?",
        "response": "Samuel Eto'o Fils",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Clausius of the Clausius-Mossotti relation die?",
        "response": "1888",
        "source": "hotpot_qa"
    },
    {
        "query": "Artist Juanita McNeely has prompted comparisons to an artist born in what year?",
        "response": "1907",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname for this United States drag racer who drove Brutus?",
        "response": "Jungle Jim",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Louis Stevens in the Disney Channel series \"Even Stevens\" stars in what European two-part film?",
        "response": "Shia LaBeouf",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian singer sang a wedding-themed Punjabi dance song based on the classic folk song \"Chitta Kukkad Banere Te\" and also featured on the reality show, Indian Idol?",
        "response": "Neha Kakkar",
        "source": "hotpot_qa"
    },
    {
        "query": "WLOO is a MyNetworkTV-affiliated television station serving Jackson, Mississippi, a state in the southern region of the United States, with part of its southern border formed by what body of water?",
        "response": "Gulf of Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "The 24th Hong Kong Film Awards ceremony was a positive for the 2004 Hong Kong romantic drama written and directed by whom?",
        "response": "Wong Kar-wai",
        "source": "hotpot_qa"
    },
    {
        "query": "Illusion was a song that was played at the Eurovision contest held in what most populous city in Russia?",
        "response": "Moscow",
        "source": "hotpot_qa"
    },
    {
        "query": "The horse-collar tackle is an American football maneuver most closely associated with an American football player drafted by the Dallas Cowboys in what year? ",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "What student television station operates out of the building named after the director of back to the future?",
        "response": "Trojan Vision",
        "source": "hotpot_qa"
    },
    {
        "query": "Will Dockery built a plantation that was how many acres?",
        "response": "25600",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the rapper who made the album \"The X-Filez, Vol. 1\"?",
        "response": "Anarae Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Chang-bok, is a North Korean football coach who managed the North Korea national football team from 2015 to 2016, Kim was replaced a year later by who, a Norwegian football manager and former player, and the current manager of North Korea's national football team?",
        "response": "Jørn Andersen",
        "source": "hotpot_qa"
    },
    {
        "query": "Béal na Bláth was the site of the assassination of which leading figure in the Irish independence movement?",
        "response": "Michael Collins",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the English clergyman and Archbishop of Trier Otto von Ziegenhain that led the Battle of Tachov?",
        "response": "Henry Beaufort",
        "source": "hotpot_qa"
    },
    {
        "query": "What Division was the college footbal team that fired their head coach on November 24, 2006?",
        "response": "NCAA Division I FBS football",
        "source": "hotpot_qa"
    },
    {
        "query": "What group heard both Hamdan v. Rumsfeld and Gonzales v. Raich?",
        "response": "United States Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is older, Klaus Meine or John McCrea?",
        "response": "Klaus Meine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor starred in Big Bug Man, that is widely credited with bringing realism to film acting?",
        "response": "Marlon Brando Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film for which the single \"Find You\" was written?",
        "response": "Neil Burger",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker, Hobart Henley or Budd Boetticher, is most famous for the series of low-budget Westerns he made in the late 1950s starring Randolph Scott?",
        "response": "Budd Boetticher",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the county in which the city of Greenwood is located ?",
        "response": "1,152,425",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Space Spiral and Disaster Transport appear in what Ohio-based theme park?",
        "response": "Cedar Point",
        "source": "hotpot_qa"
    },
    {
        "query": "Micah Ohlman earned a spot on the 1992 team that plays in what Nevada city?",
        "response": "Paradise",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jimmy Yeary and Ian Gillan both songwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the company that owns Klaipėda railway station private or state-owned?",
        "response": "state-owned",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed more TV shows, Joseph M. Newman or Howard Higgin?",
        "response": "Joseph M. Newman",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Japanese remake \"Lucky Key\" directed after Lee Gae-byok'S 10 year break?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "When was studio, at which 'The 50 Greatest Pieces of Classical Music' was recorded, established?",
        "response": "November 1931",
        "source": "hotpot_qa"
    },
    {
        "query": "A Brazilian Jiu-Jitsu practitioner is affiliated with a martial arts school located where?",
        "response": "Lenox, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Renamed in 2014, what was the vehicle offered as a prize to contestants on the first season of The Amazing Race Canada?",
        "response": "Chevrolet Corvette Stingrays",
        "source": "hotpot_qa"
    },
    {
        "query": "Some of Jane Hamilton-Merritt's work has focused on breeding and raising llamas and another animal of what origin?",
        "response": "South American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor featured in Stage Left: A Story of Theater in San Francisco passed away on August 11, 2014 ?",
        "response": "Robin Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Museum with connections to the daughter of Jacques d'Arc and Isabelle Romée?",
        "response": "Living Heritage Tree Museum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Air Force Base is located in Biloxi, Mississippi, and isthe home of the 403d Wing?",
        "response": "Keesler Air Force Base",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the book that Jiminy Cricket is based off of published?",
        "response": "1883",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team won the Super Bowl on Sam Ball's second appearance in the event ?",
        "response": "Baltimore Colts",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the debut studio album of the rapper of Slim Shady EP released?",
        "response": "November 12, 1996",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American audio engineer and clandestine chemist, who was a key figure in the San Francisco Bay Area hippie movement during the 1960s recorded the album \"Old and in the Way?\"",
        "response": "Owsley Stanley",
        "source": "hotpot_qa"
    },
    {
        "query": "Zach Galifianakis starred in which 2010 comedy film directed by Todd Phillips?",
        "response": "Due Date",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine covers wider topics, The American Spectator or In Touch Weekly?",
        "response": "In Touch Weekly",
        "source": "hotpot_qa"
    },
    {
        "query": "EuroMillions is a transnational lottery, launched on which date, by the Camelot Group, are the operators of the UK National Lottery?",
        "response": "7 February 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the organization whose boat Fernando Pereira drowned on founded?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Gushmore is an artificial hill in a water theme park located in which resort ?",
        "response": "the Walt Disney World Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth date of the second leader of La Familia Michoacana?",
        "response": "8 March 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "How many movies did the \"Comic Book Villains\" star born on march 20,1970 apprear in since the early 1990s?",
        "response": "over sixty films",
        "source": "hotpot_qa"
    },
    {
        "query": "Landon T. Clay (born Landon Thomas Clay) was an American businessman and founder of the Clay Mathematics Institute (CMI),  a private, non-profit foundation, based in Peterborough, New Hampshire, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Sam Mercer worked with director M. Night Shyamalan in which project that stars Bruce Willis and Samuel L. Jackson?",
        "response": "Unbreakable",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Doug Barrault play his home games in 1990?",
        "response": "Met Center in Bloomington",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of language morphology was the language of the Chatot tribe?",
        "response": "agglutinative",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the star in the South Korean horror romantic comedy film of Hwang In-ho?",
        "response": "Son Ye-jin",
        "source": "hotpot_qa"
    },
    {
        "query": "Universal Press Syndicate merged with what company featuring a writer born December 8, 1961",
        "response": "Uclick",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born on May 20, 1968 and portrays Givens on Justified?",
        "response": "Timothy Olyphant",
        "source": "hotpot_qa"
    },
    {
        "query": "High School and Michael Jackson's This Is It, have which mutual genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the journal that has an editor that is from a university that is part of PASSHE?",
        "response": "The Prison Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the formal football player win the Pro Bowl that John Herbert Adler lost to in a congressional election?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the composer of the operetta Sweethearts born?",
        "response": "1859",
        "source": "hotpot_qa"
    },
    {
        "query": "Toño plays in goal for which Madrid football team?",
        "response": "Rayo Vallecano",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the American actor who appears alongside Martin Short and Annie Golden in the soundtrack for The Pebble and the Penguin born?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jon Krakauer and M. P. Shiel both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kris Norris was a guitarist for the band formed in which city in 1995?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the documentaries \"The Pixar Story\" and \"Born in China\" directed by the same person?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "After David Stern retired from being commissioner of the NBA, this american lawyer and businessman succeed him and is now the current commissioner who is he?",
        "response": "Adam Silver",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the Financial Training Center limited (FTC) known for? what is a example of processing, and communication of Financial Information?",
        "response": "Accounting",
        "source": "hotpot_qa"
    },
    {
        "query": " Claes Olle Ruben Östlund received \"Palme d'Or\" for a movie shot in which cities ?",
        "response": "Gothenburg, Stockholm and Berlin",
        "source": "hotpot_qa"
    },
    {
        "query": "What NCAA Division II conference featured former NFL and CFL star SHadrick McAfee?",
        "response": "Gulf South Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "What football position did the actor playing Carl King in Crown Heights play?",
        "response": "cornerback",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Deepa Mehta and Patrice Leconte both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country did the author of \"The Naming of Cats\" move to? ",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the users' group of students and faculty from California's third-largest enrollment in the UC System?",
        "response": "Linux Users' Group of Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Rogues are a group of enemies led by which DC Comics supervillain?",
        "response": "Captain Cold",
        "source": "hotpot_qa"
    },
    {
        "query": "What moment did Michael Eisen have based off of a 1997 American dram film staring Matt Damon and Ben Affleck while at Harvard University?",
        "response": "Good Will Hunting",
        "source": "hotpot_qa"
    },
    {
        "query": "Zuffa was founded in 2001 by Lorenzo Ferlitta and another American entrepreneur who is the current CEO of what?",
        "response": "Station Casinos",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the main topic that both William L. Shirer and Noam Chomsky write about?",
        "response": "War",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Jameel McCline or Samuel Peter?",
        "response": "Samuel Peter",
        "source": "hotpot_qa"
    },
    {
        "query": "Two Black Cadillacs is a song from an album released on what date?",
        "response": "May 1, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation light house was an experiment by Wernher von Braun and another man born in what year?",
        "response": "1895",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Pesci played a character based on the nephew of what man known for being a crime Boss?",
        "response": "Frank DeSimone",
        "source": "hotpot_qa"
    },
    {
        "query": "\"This Is What You Came For\" is a song by Scottish DJ and record producer Calvin Harris, Rihanna and Harris had previously collaborated on her sixth studio album, called what, which included the international chart-topper \"We Found Love\"?",
        "response": "Talk That Talk",
        "source": "hotpot_qa"
    },
    {
        "query": "Veronica \"Vera\" Duckworth (also Burton) was a fictional character from the British ITV soap opera, \"Coronation Street\", played by Liz Dawn, she reappeared posthumously for a single appearance, in which her ficitional husband Jack died, which English actor, singer and author, played Jack Duckworth ?",
        "response": "Bill Tarmey",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the given name of the actor who established One Race Films ?",
        "response": "Mark Sinclair",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the microgenre of electronic music that is featured, along with Ambient, Post Rock, Metal, and Jazz, on Radio K from the studios KUOM?",
        "response": "Vaporwave",
        "source": "hotpot_qa"
    },
    {
        "query": "The Irton Cross lies chronologically between the Gosforth cross and an Anglo-Saxon cross which probably dates from the 7th or early 8th century, featuring reliefs and inscriptions in what alphabet?",
        "response": "runic alphabet",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does De Kroonduif and KLM have in common?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Keller is a microprocessor engineer most well known for his work at AMD and Apple, he was involved in designing which 32-bit package on package (PoP) system-on-a-chip (SoC) designed by Apple Inc. and manufactured by Samsung? ",
        "response": "Apple A4",
        "source": "hotpot_qa"
    },
    {
        "query": "Alvin Ailey and Virgil Thomson both worked in what American metropolis?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Il prigioniero and La buona figliuola based on the same short story?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What theatrical film did Fairuza Balk play as Dorothy Gale?",
        "response": "Return to Oz",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the fourth oldest college of the University of Oxford, where Kenneth Carey received his third class honours Bachelor of Arts degree from, located?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What country do both Marston, Cheshire and Anderton Boat Lift reside?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "In which modern country is the capital city of the civilization that had several generals named Hanno?",
        "response": "=\"Tunisia\">Tunisia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both University of California, Berkeley and University of Rochester located in New York?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the NFL team that plays in the same stadium as the Golden Gophers join the NFL?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What era did the husband of Dorothea of Brandenburg reign?",
        "response": "Kalmar Union",
        "source": "hotpot_qa"
    },
    {
        "query": "What did a broadcast reporter, and eventual 10,000-hour commercial pilot create that noteworthy reporting included finding the crashsite of a British Aerospace 146-200A, registration N350PS, on a scheduled flight from Los Angeles, California to San Francisco ?",
        "response": "Los Angeles News Service",
        "source": "hotpot_qa"
    },
    {
        "query": "Seneca Meadows Landfill Sends this Chemical compound with the chemical formula CH to  a nearby independent facility for producing electricity",
        "response": "Methane",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American author, daughter of film star Bette Davis?",
        "response": "B. D. Hyman",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was released as the lead single from Baltimora's debut album \"Living in the Background\" and interpolated in Nasty Girl?",
        "response": "Tarzan Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "Get Blake!(formerly Blake and the Aliens) is a American children's animated television series, it first premiered on March 2, 2015 on Nicktoons, a British/Irish digital television channel, that launched on which date?",
        "response": "22 July 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the profession of a former football referee from a country that is part of the United Kingdom that shares land borders with Scotland to the north and Wales to the west?",
        "response": "a teacher",
        "source": "hotpot_qa"
    },
    {
        "query": "Eclipse is the third novel in the \"Twilight\" Saga by who, it continues the story of Bella Swan, a character and the protagonist of the \"Twilight\" series?",
        "response": "Stephenie Meyer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the third stadium used by the football team for the Portuguese sports club in Porto demolished?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "whats the famous bavagheet by arun date?",
        "response": "Shukratara",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of The String Quartet No. 3 in E-flat minor was awarded a lifetime pension by what emperor?",
        "response": "Emperor Alexander III",
        "source": "hotpot_qa"
    },
    {
        "query": "What two countries headquarter the clothing company that the photographer \"Facehunter\" contributed to?",
        "response": "Kowloon, Hong Kong, and Ratingen (near Düsseldorf), Germany.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1968 Beatles' song, which is written by Paul McCartney but credited to the song partnership Lennon-McCarney, opens the double-disc album \"The Beatles\" and then seques into \"Dear Prudence\"?",
        "response": "Back in the U.S.S.R.",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1977 Green Bay Packers season included the quarterback who previously played for what other team?",
        "response": "Houston Oilers",
        "source": "hotpot_qa"
    },
    {
        "query": "Was \"Honesty\" released before or after the Country Throwdown Tour?",
        "response": "2003's \"Honesty",
        "source": "hotpot_qa"
    },
    {
        "query": "Mexico: One Plate at a Time is a television series starring which American chef who specializes in traditional Mexican cuisine with modern interpretations?",
        "response": "Rick Bayless",
        "source": "hotpot_qa"
    },
    {
        "query": "How did Henry Dangar participate in the European exploration of Australia?",
        "response": "surveyor and explorer",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the singer who was paired with Kim Ye-won on the fourth season of We Got Married?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the sister company of the airline which serves Sauce Viejo Airport?",
        "response": "Aerolíneas Argentinas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which games, Strange Synergy or Qwirkle,  is a card game published by Steve Jackson Games?",
        "response": "Strange Synergy",
        "source": "hotpot_qa"
    },
    {
        "query": "Manuel Roman was scheduled to fight the Mexican professional boxer in which weight class on February 27, 2015?",
        "response": "Super Bantamweight",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did Luke Nell make his first debut on Saturday Night Live?",
        "response": "September 30, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "New intellectual properties include what third-person shooter video game developed by Remedy Entertainment?",
        "response": "Max Payne",
        "source": "hotpot_qa"
    },
    {
        "query": "Struan Rodger and Four Weddings and a Funeral are both what kind of actor and film?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "KGVA serves residents of an Indian reservation with how many enrolled members in 2010",
        "response": "2,851",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school located at Korle Bu Teaching Hospital employed Charles Odamtten Easmon?",
        "response": "University of Ghana Medical School",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was held out for a contract dispute while University of Alabama graduate starting running back for the same team was rising to be known?",
        "response": "Emmitt Smith",
        "source": "hotpot_qa"
    },
    {
        "query": " III - Odyssey of the Mind is the sixth album by a German band formed in what city?",
        "response": "Düsseldorf",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffrey C. Trinkle is Professor and former Chair of Computer Science at Rensselaer Polytechnic Institute in Troy, New York, he has bachelor's degrees in physics (1979), and engineering (1979) from Ursinus College , a private, independent, coeducational, liberal arts college located in Collegeville, in which state?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "For which police department did James David Rodriguez consult with in \"Psych\"?",
        "response": "Santa Barbara",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Fictionary and Splendor games?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the Moscow theatre where the original production of Swan Lake was kept in the active repertoire?",
        "response": "Joseph Bové",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was built first Woolworth Building or 1 New York Plaza?",
        "response": "Woolworth Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Ellis Boynton worked at which Asheville, North Carolina tourist attraction?",
        "response": "Biltmore Estate",
        "source": "hotpot_qa"
    },
    {
        "query": "Woodland, Cumbria is west of the third largest lake in what area?",
        "response": "English Lake District",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the father of Sarah Coburn born?",
        "response": "March 14, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did this American actor and political activist pass away who portrayed adventurer Harry Steele in the 1954 adventure film Secret of the Incas?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Leslie Feist  is a Canadian indie pop singer-songwriter and guitarist and was a client of  Noble Street Studios is a recording studio located in what country?",
        "response": "Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American sketch comedy television series starring John C. Reilly was produced by Abso Lutely Productions?",
        "response": "Check It Out!",
        "source": "hotpot_qa"
    },
    {
        "query": "Shepherd Gate Clock was probably the first to display the solar time at which location in London?",
        "response": "Royal Observatory",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the CEO of the Charlotte, North Carolina-headquartered company that makes Bubble Wrap?",
        "response": "Jerome Peribere",
        "source": "hotpot_qa"
    },
    {
        "query": "What album did Marshall Bruce Mathers work on together with American rapper Cashis?",
        "response": "second studio album by American rapper Cashis",
        "source": "hotpot_qa"
    },
    {
        "query": " Anjulie has written songs for a singer who rose to fame in what year?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "The Civil Rights Heritage Center is housed in the former public swimming pool in what city?",
        "response": "South Bend, Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "The head office of Stagecoach Merseyside & South Lancashire was formed following a merger containing the regional bus operator based in which Northwest England town?",
        "response": "Preston",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician was a co-frontman with Pete Doherty, Dave Mustaine or Carl Barât (please answer with full name)?",
        "response": "Carlos Ashley Raphael Barât",
        "source": "hotpot_qa"
    },
    {
        "query": "The Star Wars Launch Bay interactive walkthrough attraction replaced The Magic of Disney Animation at which Disney park in 2015?",
        "response": "Disney's Hollywood Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Königskinder and The Knot Garden exist in multiple versions?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor did Werner Daehn work with in \"XXX\"?",
        "response": "Vin Diesel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Shogun and Conspiracy boardgames? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the computers Tiki 100 and MicroBee manufactured by the same company?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which military officer hailed from Koboko?",
        "response": "Idi Amin",
        "source": "hotpot_qa"
    },
    {
        "query": "The inventor of the Graphophone also founded what company in 1885?",
        "response": "American Telephone and Telegraph Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Mr Hudson and Makethisrelate have in common?",
        "response": "music",
        "source": "hotpot_qa"
    },
    {
        "query": "Marino Girolami and Adim Williams, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The wildlife of Mauritius is composed of its flora and fauna, some have already become extinct, most famously The Dodo, an extinct flightless bird that was endemic to the island of Mauritius, east of Madagascar in which water location?",
        "response": "Indian Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former name of Jatto Ceesay's birth place?",
        "response": "Bathurst",
        "source": "hotpot_qa"
    },
    {
        "query": "What category of music instrument is Vidushi Shashikala Dani the only All India Radio an exponent of?",
        "response": "percussion",
        "source": "hotpot_qa"
    },
    {
        "query": "Kansas Joe McCoy co-recorded what song about the same event as Bob Dylan's High Water?",
        "response": "When the Levee Breaks",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both magazines Essence and Soccer America devoted to the same topic ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The boxer who faced Gennady Golovkin at Madison Square Garden on October 17, 2015 was born in what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Numenera is an award-winning science fantasy tabletop role-playing game (RPG) set in the far distant future, written by Monte Cook, an American professional table-top role-playing game designer and writer, best known for his work on what?",
        "response": "Dungeons & Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "Who s a Slovenian football coach and former international player who managed a Slovenian football club from the town of Črnuče in their golden years?",
        "response": "Branko Oblak",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the company that makes India Kings headquartered?",
        "response": "Kolkata, West Bengal.",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the first publication the The Ulster-Scot, a monthly publication published in Northern Ireland?",
        "response": "November 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006-07 New Orleans/Oklahoma City Hornets season was the team's 5th in the NBA, the Hornets split their games between the New Orleans Arena and the Ford Center, which multi-purpose indoor arena, located in the city's Central Business District, in New Orleans, Louisiana?",
        "response": "Smoothie King Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Have both Gordon Wiles and Scott Hicks been nominated for Academy Awards?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "John Benedict Hillerman, is an American actor, known for his starring role as the a fictional character, Jonathan Quayle Higgins III, Hillerman won an Emmy, for the role in which year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed is a true terrier, Pumi or Kaikadi?",
        "response": "Kaikadi",
        "source": "hotpot_qa"
    },
    {
        "query": "What hip hop trio from East Orange, New Jersey had a special appearance in the Meteor Man?",
        "response": "Naughty by Nature",
        "source": "hotpot_qa"
    },
    {
        "query": " Season six of \"South Park\" was created by the actor and animator of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Amos Oz and Terry Goodkind, are in a similar occupation industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean reality-documentary show was Oh Jong-hyuk a former cast member of?",
        "response": "Law of the Jungle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is founded by a president, University of Washington or University of Virginia?",
        "response": "University of Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "The short story from The Wind’s Twelve Quarters that won the Hugo Award in 1974 was published in what year?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of \"Benaam\" was also in \"Zanjeer\"?",
        "response": "Amitabh Bachchan",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the nations after 1722 that composed a culture that was extensively studied by William N. Fenton?",
        "response": "Mohawk, Onondaga, Oneida, Cayuga, Seneca, and Tuscarora",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Jeffrey Steele and Frank Iero both become Nashville songwriters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film industry would have films in which Ilya Khrzhanovsky would be the director?",
        "response": "The cinema of Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Jimmy Thomson or Jimmy Nicholl?",
        "response": "Jimmy Thomson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the theater where the London Philharmonic Orchestra plays? ",
        "response": "theatrical architect Frank Matcham",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize did the author win, in 1979, who first used the term recursive acronym in print ?",
        "response": "the Pulitzer Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Steven Randall \"Randy\" Jackson's sister has been a prominent figure in popular culture for over how many years?",
        "response": "30",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of author of the manga which inspired a 2014 television series starring the same actress who rose to popularity in \"Boys Over Flowers\"?",
        "response": "Shinobu Kaitani",
        "source": "hotpot_qa"
    },
    {
        "query": "Tomás Méndez released a song that was played in what 1997 Hong Kong romance film?",
        "response": "Happy Together",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was older, Martha Reeves or Rob Hyman?",
        "response": "Martha Reeves",
        "source": "hotpot_qa"
    },
    {
        "query": "What British tomb will have a locomotive named after it?",
        "response": "The Unknown Warrior",
        "source": "hotpot_qa"
    },
    {
        "query": " Fort Inge was named in honor of an officer killed in the war that lasted through what time period?",
        "response": "1846 to 1848",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Pornographic film collected at the Kinsey Institute for research in Sex, Gender and Reproduction that includes possibly the first use of extreme close-ups of genitalia?",
        "response": "El Satario",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the date of birth of the jockey that rode Mine That Bird to victory?",
        "response": "November 7, 1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French- and Arabic-speaking country was the first in Africa to air its own version of the TV show \"Deal or No Deal\"?",
        "response": "Tunisia",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"Jane the Virgin\" is also known for her role as what character on \"Deepwater Horizon\"?",
        "response": "Andrea Fleytas",
        "source": "hotpot_qa"
    },
    {
        "query": "What television network are both Mia Michaels and So You Think You Can Dance on?",
        "response": "Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book recounts the story of a woman who had a sexual encounter with Bill Clinton after posing nude for Penthouse magazine?",
        "response": "Their Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "The Greatest Event in Television History aired on the channel that was founded by whom?",
        "response": "Betty Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the monument of an American five-star general and Field Marshal of the Philippine Army located?",
        "response": "United States Military Academy at West Point",
        "source": "hotpot_qa"
    },
    {
        "query": "What is located adjacent to the theme parks best known for attractions and lands based on famous classic and modern pop culture properties?",
        "response": "Universal CityWalk",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a film of 2007 by Russian-Ukrainian director Kira Muratova starring a Russian actress, director, and screenwriter?",
        "response": "Two in One",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Beyond the Call and King Gimp both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What band did an American electronic dance music producer, DJ, singer, songwriter and multi-instrumentalist join  in 2004 who has employed an American film director and photographer from Southern California known for his technical achievements in visual effects and winner of a MTV Video Music Award?",
        "response": "From First to Last",
        "source": "hotpot_qa"
    },
    {
        "query": "The U.S. Navy battleship featured in \"Under Siege\" had what two nicknames?",
        "response": "\"Mighty Mo\" or \"Big Mo\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a stage name, Harry Kizirian or Colton Ford?",
        "response": "Colton Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "Which editor created by Allan Odgaard does the standlaone code editor, Ace, is aimed at improving upon?",
        "response": "TextMate",
        "source": "hotpot_qa"
    },
    {
        "query": "What song on the album \"Science & Nature\" covered a song that also appeared on the album \"Beggars Banquet\"?",
        "response": "Sympathy for the Devil",
        "source": "hotpot_qa"
    },
    {
        "query": "Neve Adrianne Campbell (born October 3, 1973) is a Canadian actress, she has starred in films such as which 2003 drama film directed by Robert Altman and starring Neve Campbell, who co-wrote and co-produced the film?",
        "response": "The Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Nexon who was composed by Adam Gubman located at?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the purpose of the society founded in a city also familiarly known as Thessalonica or Salonica?",
        "response": "research on History and Folklore of Macedonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Boothill Foot Tappers were a British folk/skiffle/bluegrass band, The Pogues were a punk band of what nationality?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two bands Kill Hannah and Warpaint is from California?",
        "response": "Warpaint",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the oldest Prime Minister to pay homage at the funeral of Margaret Thatcher?",
        "response": "Sir John Major",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dr Manmohan Singh Scholarships are named after a former chief advisor to the President of India and head of the Council of Ministers, that is also called what?",
        "response": "Prime Minister of India",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Walsh starred in a 2014 disaster movie about tornadoes striking which city ?",
        "response": "Silverton, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, \"Best Friend Forgotten\" or \"This Film Is Not Yet Rated\" premiered first?",
        "response": "Best Friend Forgotten",
        "source": "hotpot_qa"
    },
    {
        "query": "The founder of Truemors is known for popularising which word in his marketing of the Macintosh?",
        "response": "evangelist",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boxmasters are a band that included which singer and musician on bass?",
        "response": "Stuart Daniel Baker",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the person who broke Dario Hübner record as the oldest Serie A Top-scorer work as a sporting director for?",
        "response": "Verona",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retired Australian rules football player and administrator for the Richmond Football Club was a pre-count favourite for the 1995 Brownlow Medal?",
        "response": "Wayne Campbell",
        "source": "hotpot_qa"
    },
    {
        "query": "Christ Church Lutheran is located in a borough that locally is often referred to as what?",
        "response": "The City",
        "source": "hotpot_qa"
    },
    {
        "query": "What French company is the namesake of Stadio Friuli a subsidiary of?",
        "response": "Renault",
        "source": "hotpot_qa"
    },
    {
        "query": "What is presented every four years to the most \"outstanding boxer\" at the Olympic Games and won by a retired Scottish amateur boxer in 1995?",
        "response": "Val Barker Trophy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Blink-182 song \"Ghost on the Dance Floor\" was speculated to be inspired by the death of a DJ that died in what year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the musical which has \"The Rain in Spain\" based on?",
        "response": "Pygmalion",
        "source": "hotpot_qa"
    },
    {
        "query": "What colorless fammable gas does Dedar Bayou manufacture?",
        "response": "Ethylene",
        "source": "hotpot_qa"
    },
    {
        "query": "Who also provided lyrics along with Howard Ashman on his first Disney duo movie with Alan Menken?",
        "response": "Glenn Slater",
        "source": "hotpot_qa"
    },
    {
        "query": "What series that Shayna Fox was a voice actress in was created by Arlene Klasky and Gábor Csupó?",
        "response": "Rocket Power",
        "source": "hotpot_qa"
    },
    {
        "query": "Which group originally formed first, Archers of Loaf or Tomahawk?",
        "response": "Archers of Loaf",
        "source": "hotpot_qa"
    },
    {
        "query": "What certification from the Recording Industry Association of Japan was received in 1999 by the American girl group which released \"Girl Talk\" in 2002?",
        "response": "Million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Million Dollar Arm or Wings of Life? ",
        "response": "Wings of Life",
        "source": "hotpot_qa"
    },
    {
        "query": "True Link Financial, Inc. is a San Francisco, California based financial services firm that offers investment accounts and debit cards customized for seniors, Notable investors includes Alexis Kerry Ohanian, an American Internet entrepreneur and investor, who is co-founder and executive chairman of which social news website ?",
        "response": "Reddit",
        "source": "hotpot_qa"
    },
    {
        "query": " Men who have sex with men and sexual behavior between members of the same sex or gender is know as?",
        "response": "Homosexuality",
        "source": "hotpot_qa"
    },
    {
        "query": "Which news host and former baseball player is currently on virtual channel 5 in Atlanta?",
        "response": "Ronald Edwin \"Ron\" Gant",
        "source": "hotpot_qa"
    },
    {
        "query": "What English actor starred in Where DAnger Lives?",
        "response": "Claude Rains",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the executive office of the company of which Young & Rubicam is a member?",
        "response": "Dublin, Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Australian organized crime figure was on the infamous Melbourne-based criminal family of Irish ancestry, notable for their involvement in the Melbourne gangland killings?",
        "response": "Mark Anthony John Moran",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1985 World Snooker Championship final was contested between Steve Davis and which Northern Irish professional snooker player?",
        "response": "Dennis Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "Bianca's Smut Shack became a popular theme camp at annual gathering held at which city ?",
        "response": "Black Rock City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Zhucheng and Pingquan has more people?",
        "response": "Zhucheng",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tengchong and Lengshuitan District in the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "the third round the 2004 FIA GT Championship season took place at a motor racing circuit with has a capacity of what?",
        "response": "90,000",
        "source": "hotpot_qa"
    },
    {
        "query": "What song recorded by Barbadian recording artist Rihanna was written by Corey Chorus?",
        "response": "\"Cheers (Drink to That)\"",
        "source": "hotpot_qa"
    },
    {
        "query": " Où est la maison de fromage is the debut album by which English performance poet who first became famous during the punk rock era of the late 1970s when he became known as a \"punk poet\", and originally released in 1978?",
        "response": "John Cooper Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1982 British rock band influenced Pale Saints?",
        "response": "Primal Scream",
        "source": "hotpot_qa"
    },
    {
        "query": "The film \"Redwood Highway\" starsTom Skerritt and an actress born in what year?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the first season winner of the US version of the UK series \"Strictly Come Dancing\"?",
        "response": "Kelly Marie Monaco",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lindsay Davenport and Wayne Black nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Stand by Me\" is a song by the English rock band Oasis from an album released on which day ?",
        "response": "21 August 1997",
        "source": "hotpot_qa"
    },
    {
        "query": "What book provided the foundation for Masters and Johnson's research team?",
        "response": "Patterns of Sexual Behavior",
        "source": "hotpot_qa"
    },
    {
        "query": "Brooklyn Nine-Nine features the actress and comedian who is of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by Joni Mitchell was peaked at No. 8 on the \"Billboard\" singles chart?",
        "response": "Both Sides, Now",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American is also a dancer, Don Manoukian or Adam G. Sevani?",
        "response": "Adam G. Sevani",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the draft hosted ,consisting of seven rounds with rounds two through seven taking place on June 23, 2007, that a Canadian professional ice hockey defenceman was selected in the 6th round, 162nd overall, by the Hurricanes?",
        "response": "Nationwide Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the second-named star of the film Hunter Killer? ",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthdate of the composer who worked on A Bayou Legend with William Grant Still?",
        "response": "February 16, 1910",
        "source": "hotpot_qa"
    },
    {
        "query": "The MVP of the 2015 Diamond Head Classic was Bahamian professional basketball player that was with the sixth overall pick in the 2016 NBA draft by who?",
        "response": "New Orleans Pelicans",
        "source": "hotpot_qa"
    },
    {
        "query": "Me and the Colonel was a film based on the play by the novelist of what nationality?",
        "response": "Austrian-Bohemian",
        "source": "hotpot_qa"
    },
    {
        "query": "Chimpanzee and Johnny Tremain, are both media of what type?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Tay Walker and Mac Miller have in common?",
        "response": "is an American singer",
        "source": "hotpot_qa"
    },
    {
        "query": "What club was the Archbishop, who refused two gay men communion, involved in?",
        "response": "Richmond Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did Baek Bong-ki appear in the South Korean drama film set in a high school?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Shin Hye-sun, is a South Korean actress, she acted her first protagonist role in My Golden Life, a South Korean television series starring Park Si-hoo, Shin Hye-sun, Lee Tae-hwan, and Seo Eun-soo, released in what year?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Larenz Tate was in the film written and directed by whom?",
        "response": "Theodore Witcher",
        "source": "hotpot_qa"
    },
    {
        "query": " Lapine is a fictional language created for a novel published by who?",
        "response": "Rex Collings Ltd of London",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Italian restaurant is based in Tennessee, Gino's Pizza and Spaghetti or Pizzeria Venti?",
        "response": "Pizzeria Venti",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pago Pago International Airport and Hoonah Airport both on American territory?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the album that Don Was helped the Highwaymen produce rereleased? ",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "An effective anti-infiltration barrier, running across South Vietnam deep into Laos, was a grand vision of the US Secretary of Defence who was born in which year ?",
        "response": "1916",
        "source": "hotpot_qa"
    },
    {
        "query": " What city was the birthplace of the German physicist for which Hund's coupling cases in the spectroscopy of diatomic molecules are name for?",
        "response": "Karlsruhe",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the City that Maria Limanskaya stationed at during the Brandenburg Gate?",
        "response": "Berlin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the home stadium where Dai Xianrong predominantly played?",
        "response": "Tianhe Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by Milenge Milenge was featured in \"When We Met\"?",
        "response": "Jab We Met",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Selman co-wrote the video game that was developed and distributed by which gaming company?",
        "response": "Electronic Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more Grand Slams, Michaël Llodra or Rick Leach?",
        "response": "Rick Leach",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional football player was involved in an alleged sex part on October 6, 2005 and played college for Mississippi State University?",
        "response": "Fred Smoot",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song sung by the frontwoman of The Pretty Reckless in \"How The Grinch Stole Christmas?\"",
        "response": "James Horner and Will Jennings",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of political party was nicknamed Tory Action and had a British army officer, barrister, and politician as a member?",
        "response": "British Conservative Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What class was 6029,a four-cylinder, simple, non-condensing, coal-fired superheated, 4-8-4+4-8-4 heavy goods steam locomotives built by Beyer, Peacock and Company for the New South Wales Government Railways in Australia, used in?",
        "response": "The AD60 class",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the play written that Shylock is based on?",
        "response": "between 1596 and 1599",
        "source": "hotpot_qa"
    },
    {
        "query": "Kerry Remsen is the daughter of an actor with what ethnicity?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Was The Stuff of Legend an American comedy like The Boatniks?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Belushi known for besides his energy and attitude?",
        "response": "Not Ready For Prime Time Players",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Ford manufacture, that BIagi-DenBest Racing uses?",
        "response": "Ford Mustang",
        "source": "hotpot_qa"
    },
    {
        "query": "Disney's The Kid co-starred which actress who began her career in stand-up?",
        "response": "Mary Jean \"Lily\" Tomlin",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Amen\" is a song featuring vocals by a duo consisting of who?",
        "response": "Tom Higham and Ben Fletcher",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the writer of the short stories collection influenced by the surrealist painter that was a founding member of the Mexican Women's Liberation Movement? ",
        "response": "Jen George",
        "source": "hotpot_qa"
    },
    {
        "query": "William H. Mumler made a photograph of the wife of which 16th President?",
        "response": "Abraham Lincoln",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenn Scott is a Toronto-based screenwriter noted for his work in children's programming and animation, included amongst the many shows he has written for includes Captain Flamingo, a Canadian-Filipino animated television series, which chronicles the adventures of who, whose alter-ego is \"Captain Flamingo\"?",
        "response": "Milo Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "La Valentina starred the actress who was the second wife of which actor?",
        "response": "John Wayne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following operas was written by Gioachino Rossini: Il turco in Italia or La Calisto?",
        "response": "Il turco in Italia",
        "source": "hotpot_qa"
    },
    {
        "query": "What Russian ballet choreographer restaged a play based on a Spanish novel by Miguel de Cervantes Saavedra? ",
        "response": "Alexander Gorsky",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this musician born who belongs to the subgroup of Exo along with Suho, Chanyeol, D.O., Kai, and Sehun?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the free jazz drummer on the album \"Center of the World\"?",
        "response": "Raymond Patterson",
        "source": "hotpot_qa"
    },
    {
        "query": "Anna Carlsson, is a German voice actress from where, she voices in the German-language dubs of a number of animation and anime productions including, The Little Mermaid, where she voices in the German-language dubs of a number of animation and anime productions including which movie, based upon a a fairy tale written by the Danish author Hans Christian Andersen about a young mermaid who is willing to give up her life in the sea and her identity as a mermaid to gain a human soul?",
        "response": "Frankfurt am Main",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Corriston has worked with an English singer-songwriter who gained fame as the lead singer of what band? ",
        "response": "Rolling Stones",
        "source": "hotpot_qa"
    },
    {
        "query": "The Haleakala Trail is located in the national park located on the island of Maui that covers how big of an area?",
        "response": "33,265 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Henri de Dreux commemorated by a window in a catherdral that replaced an older church destroyed by fire in what year?",
        "response": "1211",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is the company that funds Tekzilla based in?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor starred with Virginia Katherine McMath in Star of Midnight?  ",
        "response": "William Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more students, Brigham Young University or York College of Pennsylvania?",
        "response": "Brigham Young University",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Washington and Lee University and Massachusetts Institute of Technology both private colleges?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the rapper featured on BOATS II: Me Time who has a birthday on October 24, 1986?",
        "response": "Aubrey Drake Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "What battle had the code name Operation Iceberg, Battle of Okinawa or Second Battle of Bull Run?",
        "response": "Battle of Okinawa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Dashiell Hammett or Louis Bromfield?",
        "response": "Samuel Dashiell Hammett",
        "source": "hotpot_qa"
    },
    {
        "query": "Who besides Robert Novak was involved in the Plame affair?",
        "response": "members of the George W. Bush administration",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the North Woodmere's hamlet section?",
        "response": "5,962",
        "source": "hotpot_qa"
    },
    {
        "query": "Jens Risom introduced what type of design, characterized by minimalism and functionality?",
        "response": "Scandinavian design",
        "source": "hotpot_qa"
    },
    {
        "query": "A Bellanca CH-300 Pacemaker airplane had funds raised by the Chicago newspaper that was known in English as?",
        "response": "The Lithuanian Daily News",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-starred with Héctor Jiménez in the movie \"Nacho Libre\"?",
        "response": "Jack Black and Peter Stormare",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the University founded, at which Raymond F. Schinazi is employed ?",
        "response": "1836",
        "source": "hotpot_qa"
    },
    {
        "query": "The first season of Jane the Virgin, premiered in 2014, it consisted of 22 episodes and stars which American actress, of Puerto Rican descent?",
        "response": "Gina Alexis Rodriguez",
        "source": "hotpot_qa"
    },
    {
        "query": "How many passengers did the airport near Poyle handle in 2016?",
        "response": "75.7 million",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1995 Wake Forest Demon Deacons football team was an American football team that represented Wake Forest University during the 1995 NCAA Division I-A football season, in their third season under American head coach Jim Caldwell, who serves in which club, and the Demon Deacons compiled a 1–10 record and finished in last place in the Atlantic Coast Conference?",
        "response": "National Football League (NFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Executive Order 11850 was signed by which 38th President of the United States?",
        "response": "Gerald Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "What NFL team drafted the Oregon defensive tackle voted Pat Tillman Pac-10 Co-Defensive Player of the Year in the 2005 season?",
        "response": "Baltimore Ravens",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Lorman, Mississippi university where Joseph T. Owens played college football founded?",
        "response": "1871",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the birth year of the athlete that Niels do Vos used as an example for why athletes should be banned for using banned substances?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "The U.S. ambassador to Spain from 1842 to 1846 wrote a book while living in what town in England?",
        "response": "Birmingham",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the judges of The X Factor is an Irish entertainment manager?",
        "response": "Louis Walsh",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the 2015 MSA Formula Championship, a multi-event, Formula 4 open-wheel single seater motor racing championship held?",
        "response": "England and Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the man who won Irish Presidency and also led the introduction of the Constitution of Ireland?",
        "response": "Éamon de Valera",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who plays Alec Gilroy's wife in \"Coronation Street\" was born in what year?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "Rohit Shetty's previously nominated for Filmfare Award for Bet Director, had his \"Golmaal 3\" premier shown with the trailer for which Farah Khan movie?",
        "response": "Tees Maar Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "What American romantic comedy television series created by Darren Star and produced by HBO, made a small, compact handbag designed by Fendi in 1997 popular?",
        "response": "Sex and the City",
        "source": "hotpot_qa"
    },
    {
        "query": "What pre-university college is located in the capital of the Indian state of Karnataka?",
        "response": "Surana PU College",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a comedian, Ash Lieb or Vladimir Mayakovsky?",
        "response": "Ash Lieb",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American law firm headquartered in Little Rock, Arkansas, which was co-founded by Robert Crittenden?",
        "response": "Rose Law Firm",
        "source": "hotpot_qa"
    },
    {
        "query": "What album took over two years to create and contained a song written with the help of Julia Michaels?",
        "response": "Purpose",
        "source": "hotpot_qa"
    },
    {
        "query": "What British-American actor born in 1952 starred in The Last Castle?",
        "response": "Delroy Lindo",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Tony Awards have been received by the actor who co-starred in Dean with Demetri Martin and Gillian Jacobs?  ",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other name for a subastance , when bound to various radionuclides, is used in the treatment and diagnosis of certain types of cancer, and  is one of the 20 standard amino acids that are used by cells to synthesize proteins?",
        "response": "Tyrosine",
        "source": "hotpot_qa"
    },
    {
        "query": "How many acts are in the opera based on an 1820 poem by Alexander Pushkinhave, in which Mariya Matveyevna Stepanova created the lead soprano role?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1998 American science fiction horror thriller film did Natasha Henstridge have a role in?",
        "response": "Species II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the official UFC announcer as well as the ring announcer who trademarked \"Let's get ready to rumble\"?",
        "response": "Johnny Buff",
        "source": "hotpot_qa"
    },
    {
        "query": "Malcolm Darling (born 4 July 1947 in Arbroath) was a professional footballer, he was a winger who played for Norwich City Football Club (also known as The Canaries or City) is an English professional football club based in Norwich, Norfolk, the club has never won the top flight, but finished third in which year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Suqian and Shulan cities in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Frank Fertitta III and Zuffa have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is 5 miles south west of the town where the Winterton and Thealby railway station is built?",
        "response": "Scunthorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "What university, founded in 1865 by John Bryan Bowman, houses a library that holds the record amongst public universities in the nation for the largest book endowment?",
        "response": "The William T. Young Library, located on the campus of the University of Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "what college footaball team played at soldier field for their home games and still went 9-0 for one season",
        "response": "University of Notre Dame",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor Hawkins and Kim Nekroman, are in which industry?",
        "response": "music",
        "source": "hotpot_qa"
    },
    {
        "query": "What EP was released in 2016 by a girl group, of which one member was also known for playing the main character in the drama \"School 2017'?",
        "response": "Chrysalis",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joe Orton and Bernard-Marie Koltès both playwrights ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What seniūnija was formally incorporated into Kaunas in 1931?",
        "response": "Panemunė",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1972 Stanford Cardinals football team represented Stanford University in the 1972 college football season, which American football player and defensive coordinator, became Stanford's new head coach?",
        "response": "Jack Christiansen",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill Nelson flew as a Payload Specialist on a Space Shuttle launched for the first time in what year?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie did received the 2005 4th most attend Korean film of the year and starred a South Korean actor?",
        "response": "Marathon",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the Cryptotaenia or Barbarea genus have more species?",
        "response": "Barbarea",
        "source": "hotpot_qa"
    },
    {
        "query": "A man who co-wrote \"What A Feeling\" with Mike Needle, Jamie Scott, Dan Bryer and Liam Payne became a member of One Direction after being eliminated from what British music competition series? ",
        "response": "\"The X Factor\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the band who released \"Page Avenue\" formed?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What Eon Productions film featured a theme song performed by the band Wings?",
        "response": "Live and Let Die",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was formed first, Concrete Blonde or Wolf Alice?",
        "response": "Concrete Blonde",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the mountain in Geogia from which the Appalachian National Scenic Trail started and extended up to Mount Katahdin in Maine?",
        "response": "Chattahoochee National Forest",
        "source": "hotpot_qa"
    },
    {
        "query": "Chow Chow and German Wirehaired Pointer are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which screenwriter is French, Roger Vadim or Robert Z. Leonard?",
        "response": "Roger Vadim Plemiannikov",
        "source": "hotpot_qa"
    },
    {
        "query": "Thirukkalacherry is a village in which Indian town?",
        "response": "Tharangambadi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which swiss watch company was forced to merge by the swiss banks in 1983?",
        "response": "The Swatch Group",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ivey league was a poker training website founded by Phil Ivey, who has won ten World Series of Poker bracelets and one World Poker Tour title, that had launched in January of what year?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Édouard Roger-Vasselin and Kimberly Po do what for a profession?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "What city of origin does Ermine Street and Lindum Colonia have in common?",
        "response": "Roman",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Rudolf Clausius introduce the second law of thermodynamics?",
        "response": "1850",
        "source": "hotpot_qa"
    },
    {
        "query": "This concert tour  began on 16 September 2005 in Miami, Florida and returning as the background band was an American guitarist that has worked with an extensive list of artists in addition to his own what?",
        "response": "solo career",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Muslim scholar was born first, Kamāl al-Dīn al-Fārisī or M. A. Muqtedar Khan?",
        "response": "Kamal al-Din Hasan ibn Ali ibn Hasan al-Farisi",
        "source": "hotpot_qa"
    },
    {
        "query": "What company released the Minion Hunter board game in 1992 in conjunction with a near-future horror role-playing game (RPG) in 1991?",
        "response": "Game Designers' Workshop",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor who appeared in Nouvelle-France also appeared as Colonel William Tavington in \"The Patriot\"?",
        "response": "Jason Isaacs",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the MIT Technology Review and National Geographic Traveler both magazines? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of Kim Jung-eun’s film that was an instant hit and beat out films like “Jail Breakers” and “The Way Home?”",
        "response": "Marrying the Mafia",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Mike McColgan and Les Claypool have in common?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band plays christain based music, Deas Vail or Everclear?",
        "response": "Deas Vail",
        "source": "hotpot_qa"
    },
    {
        "query": "What canadian author hit the New York Times Best Seller list in 2017, with a book published 10 year prior?",
        "response": "William P. Young",
        "source": "hotpot_qa"
    },
    {
        "query": "The Shockley diode was named after an American physicist who was the manager of a research group where?",
        "response": "Bell Labs",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Alan Alda and Denys Arcand have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who portrayed Scott \"Scotty\" Thomas in the 2004 movie \"EuroTrip\" born?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "The British television sitcom Spaced starred which English actor who was born in 1970?",
        "response": "Simon Pegg",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016–17 season is the 96th season in the history of CA Osasuna, during the 2016–17 season the club will be competing in which league, where the season began on 19 August 2016 and concluded on 21 May 2017?",
        "response": "2016–17 La Liga",
        "source": "hotpot_qa"
    },
    {
        "query": "What 4 time Golden Globe winner stars in the film Holes?",
        "response": "Jon Voight",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actress, director, singer and dancer who was a cast member in \"Stomp the Yard: Homecoming\" born? ",
        "response": "March 10, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport did Jeremy Howe play?",
        "response": "Football",
        "source": "hotpot_qa"
    },
    {
        "query": "Pennington is a small village and civil parish in Furness, an area of Cumbria in which country's northwestern region?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Wang Xiaoshuai and Justin Reardon producers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Smurfs: The Lost Village stars which actor who played Flash Thompson in Spider-Man?",
        "response": "Joseph Michael Manganiello",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of land vehicle is associated with the brands Field Marshall of Gainsborough, Lincolnshire and Track Marshall who produce earthmoving equipment and were active during WWII building tanks?",
        "response": "tractor",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which John Boyega played Moses?",
        "response": "Joe Cornish",
        "source": "hotpot_qa"
    },
    {
        "query": " The Granite Range is a mountain range southwest of a census-designated place with a population of what?",
        "response": "1,234",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is published in France, Avantages or InStyle?",
        "response": "Avantages",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the director who has directed The Simpsons for wich Marcia Wallace got the Emmy Award in1992 ?",
        "response": "David Silverman",
        "source": "hotpot_qa"
    },
    {
        "query": "Songs of the Season is the second Christmas album by an American singer who, since 1985, has recorded 20 studio albums, and charted more than how many singles on the Billboard Hot Country Songs charts?",
        "response": "50",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2003 American horror film in which Desmond Harrington appeared?",
        "response": "Rob Schmidt",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of which gym did Angela Rivera-Parr's husband fight?",
        "response": "Boonchu Gym in Gold Coast, Queensland",
        "source": "hotpot_qa"
    },
    {
        "query": "The 9mm German designed submachine gun used by OMEGA was developed in what decade?",
        "response": "1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "Notes on a Scandal was directed by the man who is of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the coach who  previously held coaching positions at Portland State, Miami, become the head coach for the athletic teams that represent Texas Tech University?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "UFC 200 was help at what multi-use indoor arena on the Las Vegas Strip that Opened on April 6, 2016",
        "response": "T-Mobile Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "A Norwegian composer who received numerous awards, lived in what residence that is located in the capital of Norway?",
        "response": "Grotten",
        "source": "hotpot_qa"
    },
    {
        "query": "Terrence \"Terry\" Dodson is a comic book artist best known for his work on a fictional supervillain and occasionally antihero created by who?",
        "response": "Paul Dini and Bruce Timm",
        "source": "hotpot_qa"
    },
    {
        "query": "Keith David Primeau, is a Canadian former professional ice hockey centre who played 15 seasons in the National Hockey League (NHL),  he is currently the special assistant to the general manager and director of player development of which sports team, of the ECHL?",
        "response": "Las Vegas Wranglers",
        "source": "hotpot_qa"
    },
    {
        "query": "Molamenqing and Siguang Ri, are the name of mountains?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Peterson appeared as which character in a Shakespeare comedy written for the close of the Christmas season?",
        "response": "Aguecheek",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Wayne Wang or Mickey Rooney work as a vaudevillian actor?",
        "response": "Mickey Rooney",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname given in retrospective accounts to the man for whom Captain Donald MacDonald fought for in Scotland?",
        "response": "Bonnie Prince Charlie",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Nikos Nikolaidis and Sam Wood have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant, Chionodoxa or Eriosyce, is native to more countries?",
        "response": "Chionodoxa",
        "source": "hotpot_qa"
    },
    {
        "query": "Dina Vinhofvers became famous because of her involvement in an alleged conspiracy against a king that died in what year?",
        "response": "1670",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of publication is Popular Mechanics and Sojourners?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Gone with the Wind\" is set during what era?",
        "response": "American Civil War and Reconstruction Era",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of the film I Love Lee Tae-ri made his television debut in which Korean television drama?",
        "response": "April Kiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Maravan teaches a technique that is an approach to acting that was developed by what American theatre practitioner?",
        "response": "Sanford Meisner",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Marjo and Kathleen Hanna have the same profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "William Sharp McKechnie, was a Scottish scholar, historian, lecturer in Constitutional Law and History, and author of which charter commonly known as, and agreed to by King John of England at Runnymede, near Windsor, on 15 June 1215?",
        "response": "Magna Charta",
        "source": "hotpot_qa"
    },
    {
        "query": "According to a 2007 Tearfund survey, the most religious part of the UK practices what form of Christianity?",
        "response": "Protestantism",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the first live DVD by the black metal band for which Abbath Doom Occulta is the bassist?",
        "response": "The Seventh Date of Blashyrkh",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Himbs and Michael Dolan, are American, and have which mutual occupation?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members The Fatima Mansions or  3OH!3 ?",
        "response": "The Fatima Mansions",
        "source": "hotpot_qa"
    },
    {
        "query": "Park Dietz consulted or testified in many of the highest profile US criminal cases, including a killer who died in 1994, and was also known by what nickname?",
        "response": "Milwaukee Cannibal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 242-acre waterfront casino did Vic and Anthony's 4th location schedule to open in?",
        "response": "Golden Nugget Lake Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Detroit-based record label album was released in November 1996?",
        "response": "Infinite",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Gerhard Klopfer or Martin Bormann?",
        "response": "Martin Bormann",
        "source": "hotpot_qa"
    },
    {
        "query": "In regards to the Lithuanian-born French actor who died on July 3, 2015, what was the film that he starred in in 1966?",
        "response": "Balearic Caper",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters for the service broadcaster the show Tenko is on?",
        "response": "Broadcasting House in London",
        "source": "hotpot_qa"
    },
    {
        "query": "Vice Versa and Mothering were both what?",
        "response": "Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Secretary of the Navy who announced the naming of the 4th US Navy vessel for the state of Iowa also served as governor of what state?",
        "response": "Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the fashion line by the singer of the song \"Lollipop Luxury\"?",
        "response": "Beauty Forever",
        "source": "hotpot_qa"
    },
    {
        "query": "Stanislav Binički, was a Serbian composer, conductor, and pedagogue, he composed one of his most famous works, \"March on the Drina\", following the Serbian victory at which fight between Austria-Hungary and Serbia in August 1914 during the early stages of the Serbian Campaign of the First World War?",
        "response": "Battle of Cer",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Korean boy band was formed by CJ E&M and has Park Ji-hoon as one of its 11 members?",
        "response": "Wanna One",
        "source": "hotpot_qa"
    },
    {
        "query": "Pavitra Punia started her career on which Indian reality show?",
        "response": "MTV Splitsvilla",
        "source": "hotpot_qa"
    },
    {
        "query": "Are I Lombardi alla prima crociata and Giasone both operas?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How many recorded singles does the artist whose song shares the same name as the twenty-second studio album by country singer Willie Nelson have?",
        "response": "35",
        "source": "hotpot_qa"
    },
    {
        "query": " Lindsey Islands is named for the professor of forest ecology at what university?",
        "response": "Purdue University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor acted in Drive ",
        "response": "Bryan Lee Cranston",
        "source": "hotpot_qa"
    },
    {
        "query": "In what town, located in Washington County, Maine, is Gallison Memorial Library located?",
        "response": "Harrington",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2016 of the city that houses the Mtual Musicians' Foundation Building? ",
        "response": "481,420",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series in 1991 starred the actor currently portraying Joe O'Toole in the Hallmark Channel film \"Signed, Sealed, and Delivered\"?",
        "response": "Bare Essentials",
        "source": "hotpot_qa"
    },
    {
        "query": "What current Kanal 5 and 6'eren analyst is the son of Finn Laudrup?",
        "response": "Brian Laudrup",
        "source": "hotpot_qa"
    },
    {
        "query": " Donna Edna Shalala currently serves as the president of a non-profit organization with offices located where?",
        "response": "New York City and Little Rock, Arkansas",
        "source": "hotpot_qa"
    },
    {
        "query": "In Norway, Pinnekjøtt, Stick Meat, is a main course dinner dish of lamb or mutton, this dish is largely associated with the celebration of Christmas, served with puréed swede and potatoes, beer and Akvavit, is a flavoured spirit, that has been produced since the 15th century, principally produced in which country?",
        "response": "Scandinavia",
        "source": "hotpot_qa"
    },
    {
        "query": "What one-off special of \"Robot Chicken\" with twenty episodes aired on Adult swim in 2012?",
        "response": "Robot Chicken DC Comics Special",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Prince of Bismarcks EMS dispatch incited France to declare the Franco-Prussian War in July 1870",
        "response": "Otto Eduard Leopold",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ceanothus and Eulophia both types of plant?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film starring Ansel Elgort contains music by Beck?",
        "response": "Baby Driver",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Julia Alvarez or Meyer Schapiro?",
        "response": "Meyer Schapiro",
        "source": "hotpot_qa"
    },
    {
        "query": "ZeniMax Media Inc. is an American media company, The company is known for owning Arkane Studios, developer of Prey is a first-person shooter video game, published by which organization?",
        "response": "Bethesda Softworks",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical, directed by the recipient of the 2015 Laurence Olivier Award for Best Theatre Choreographer, is about a White Supremacy rock duo making their way to the top of the music charts?",
        "response": "White Noise",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the headquaters in Florida of the company that distributes the application \"Tone This\"?",
        "response": "Miami",
        "source": "hotpot_qa"
    },
    {
        "query": "Moro Islamic Liberation Front has a presence in which proposed region in the Philippines?",
        "response": "Bangsamoro",
        "source": "hotpot_qa"
    },
    {
        "query": " Were both James W. Horne and Larisa Shepitko screenwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the lead singer of the band with debut album \"Bad Blood\"?",
        "response": "Daniel Campbell \"Dan\" Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country the Dinosaur Jr. was formed and M83 music rockband currently based in?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the track from which a sample was featured in \"Take Me to the Clouds Above\" released? ",
        "response": "16 March 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the actress who costarred with Tom Hiddleston, Hugh Laurie, David Harewood, Tom Hollander, and Elizabeth Debicki in \"The Night Manager\"?",
        "response": "30 January 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Circa Survive and The Auteurs share what in common?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the number of students in 2016 that had enrolled at the university where Bud Sanders coached from 1923-1926?",
        "response": "18,599",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the series creator of the American legal comedy-drama, in which the actress who played Amy Jessup in \"Fringe\"/",
        "response": "Aaron Korsh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dhanush is a 155 mm towed howitzer used by which land-based branch and the largest component of the Indian Armed Forces?",
        "response": "Indian Army",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the father of Gloria Stivic on All in the Family described as?",
        "response": "lovable bigot",
        "source": "hotpot_qa"
    },
    {
        "query": " Whitetop is the southern terminus of the Virginia Creeper Trail, a 35 mi multi-purpose rail trail located where?",
        "response": "southwestern Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Hal Fishman was the inspiration of a character in The Simpsons voiced by who?",
        "response": "Harry Shearer",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Giles Lamb work on that is a 2011 open world survival horror action role-playing video game developed by Polish developer Techland?",
        "response": "Dead Island",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 2015 civil rights case that caused Kimberly Jean Davis to be jailed after denying same-sex marriage?",
        "response": "Obergefell v. Hodges",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Tim Armstrong and Robin Wilson have the same nationality ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Bulmer was a contributor to a magazine published by what British games manufacturer?",
        "response": "Games Workshop",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event which occured first, Crystal Waters was released, or Dennis Rodman was born?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the university that Tim Tadlock coaches baseball for located in?",
        "response": "Lubbock, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish priest and author was the father of Maria Brontë?",
        "response": "Patrick Brontë",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county in Delaware can one find a historic district that includes a number of homes where the rooms are arranged one behind the other with doors at each end?",
        "response": "Sussex County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Bugsy Siegel's friend and fellow gangster whose employee was murdered by Siegel in 1939?",
        "response": "Meyer Lansky",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the anthology, in which fisrt pages of The Incal\" were released, created?",
        "response": "December 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ben Okri and Nicholas Evans both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are PNC Financial Services Group, Inc. and Pioneer Natural Resources Company both American-based companies?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, André Cayatte or Götz Spielmann?",
        "response": "André Cayatte",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band had a song called Devil's Food and Must've Been High?",
        "response": "Supersuckers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the boyfriend of the animated female duck voiced by Clarence Nash?",
        "response": "Donald Duck",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Nerds 2.0.1 and Robert X. Cringely have in common?",
        "response": "writers",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the globe that succeeded the Globe of Peace as the world's largest rotating globe located?",
        "response": "Yarmouth, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Atlas Shrugged was a film based on the books by a proponent of what philosophy?",
        "response": "Objectivism",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Indigo and Thurn and Taxis related?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "When did The Pacific, produced by HBO, Playtone, and Dreamworks premier in the United States that feature Joseph Francis Mazzello III, an American actor, director, and screenwriter?",
        "response": "March 14, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Aurelio's Pizza and Cottage Inn Pizza, are which type restaurant?",
        "response": "pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "The automobile Hammer built in Detroit, Michigan came with which type of transmission that uses a driver-operated clutch?",
        "response": "manual transmission",
        "source": "hotpot_qa"
    },
    {
        "query": "Plop! and Texas Monthly, are which form of publication?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the stadium where The 2005 Minnesota Golden Gophers football team played their home games open?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Nick Heyward a better guitarist than Yeo Hoon-min?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Fox game show is hosted by a featured singer from Kanye West's number one hit \"Gold Digger\"?",
        "response": "Beat Shazam",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American basketball coach of the Washington Capitols died who was surpassed on January 6 by Lenny Wilkens?",
        "response": "October 28, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The shooting of Freddie Gray in Boston prompted what incident?",
        "response": "2015 Baltimore protests",
        "source": "hotpot_qa"
    },
    {
        "query": "Britain's Secret Treasures is a British documentary hosted by Michael Buerk and another historian specialized in what ?",
        "response": "classical history",
        "source": "hotpot_qa"
    },
    {
        "query": "The popular song recorded by Bertie Higgins in 1981 referenced a movie starring which actor?",
        "response": "Humphrey Bogart",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the rapper featured on the mixtape Crenshaw who goes by the name 9thmatic?",
        "response": "January 15, 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor born in 1915 starred in How to Steal a Million?",
        "response": "Eli Herschel Wallach",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: When was the school that Lionel Chok Ko Hon completed the Intensive Directing Workshop founded?",
        "response": "1831",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occurred first, The Korean War or The Battle of the Bulge?",
        "response": "Battle of the Bulge",
        "source": "hotpot_qa"
    },
    {
        "query": "Which featured artist on the Little Steven solo album \"Born Again Savage\" has lived in County Dublin?",
        "response": "Adam Clayton",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the publisher for the medical journal Child and Adolescent Mental Health merged?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are the opera singers Ronald Naldi and Samuel Ramey?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Donna Chartier played in the league that was founded by which person?",
        "response": "Philip K. Wrigley",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the person who was born first, Jessie Fauset or Claude McKay?",
        "response": "1882",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of films are both Streetwise and Palio?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Which had more acts/ scenes, The Snow Maiden or Sadko?",
        "response": "Sadko",
        "source": "hotpot_qa"
    },
    {
        "query": "What criminal organization did James Marcello and Joseph Lombardo work for? ",
        "response": "Chicago Outfit",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a line of compact cars produced by Prince Motor Company in 1980 and discontinued in 1999?",
        "response": "Nissan Skyline",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the dates of the campaign that eventually led to the Treaty of Roskilde?",
        "response": "between 30 January and 8 February 1658",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Moore found success with the 1997 drama film directed by whom?",
        "response": "Gus Van Sant",
        "source": "hotpot_qa"
    },
    {
        "query": "What do the New Hampshire State Police patrol that is approximately 17029 miles in length?",
        "response": "New Hampshire Highway System",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the former United States Air Force member turned martial artist, actor, film producer, and screenwriter who started in Karate Kommandos?",
        "response": "Chuck Norris",
        "source": "hotpot_qa"
    },
    {
        "query": "What position is currently held by the husband of Brigitte Macron?",
        "response": "President of France",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of product is the sponsor of the Premiership Rugby Sevens SeriesSeries ? ",
        "response": "pale lager",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 1979 American comedy crime film produced by Walt Disney Productions,Bon Voyage! or The North Avenue Irregulars?",
        "response": "The North Avenue Irregulars",
        "source": "hotpot_qa"
    },
    {
        "query": "Maggie Sajak (born January 5, 1995) is an American country singer, the daughter of \"Wheel of Fortune\" host and former WSM-TV Nashville news reporter Pat Sajak, an American television personality, former weatherman, and talk show host, best known as the host of which American television game show ?",
        "response": "Wheel of Fortune",
        "source": "hotpot_qa"
    },
    {
        "query": "Which highway is 840 km in length where the town Wandong can be found?",
        "response": "Hume Highway",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2000 Belmont Stakes was the 132nd running of the Belmont Stakes and the 96th time the event took place at Belmont Park is a major Thoroughbred horse-racing facility located in Elmont, New York, just outside which city limits?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released more recently, Baghdad ER, or Encounters at the End of the World?",
        "response": "Encounters at the End of the World",
        "source": "hotpot_qa"
    },
    {
        "query": "What Kentucky Governor adhered to states rights during the Civil War? ",
        "response": "Beriah Magoffin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university is Switzerland's oldest university and has Jean Pieters as a professor?",
        "response": "The University of Basel",
        "source": "hotpot_qa"
    },
    {
        "query": "Elias Huth (born 10 February 1997) is a German footballer who plays as a centre-forward for Rot-Weiß Erfurt, on loan from which German association football club based in the city of Hanover, Lower Saxony?",
        "response": "Hannover 96",
        "source": "hotpot_qa"
    },
    {
        "query": "which is larger, Hunchun or Shijiazhuang?",
        "response": "Shijiazhuang",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the interior of the location of the 1997 MTV Video Music Awards declared a city landmark?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American statesman and one of the Founding Fathers of the United States chose William Coleman to be the first editor of \"The New York Evening Post\" (today known as the \"New York Post\")",
        "response": "Alexander Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the filmmaker based who wrote and directed the 2013 drama film Black Box ?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "What lieutenant colonel of the Soviet Air Defence Forces correctly identified a false alarm on 26 September 1983",
        "response": "Stanislav Yevgrafovich Petrov",
        "source": "hotpot_qa"
    },
    {
        "query": "What SUV is based on a previous model from Dodge which won the North American Truck of the Year award in 2000?",
        "response": "Dodge Durango",
        "source": "hotpot_qa"
    },
    {
        "query": "Robinson Canó was a guest on which sports talk radio show?",
        "response": "Back of the Shop",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the winner of the first series of Back to Reality?",
        "response": "30 April 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the zip code of the location of the historic museum Custer House?  ",
        "response": "66442",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2002 post-apocalyptic fantasy film which Reign of Fire game is based on  ",
        "response": "Rob Bowman",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the group from Ben Mezrich's book, Brining Down the House: The Inside Story of Six MIT Students Who Took Vegas for Millions, begin to operate successfully?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the American musician, Tim Commerford, help form Audioslave?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Mimi Lockhart's actress from September 1999 til March 2007 also portrayed what character in ABC's \"One Life to Live\" from October 2007 until January 2012?",
        "response": "Gigi Morasco",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, the British response to magazines such as \"Playboy\" and \"Penthouse\" did horror author Graham Masterton edit?",
        "response": "Mayfair",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryan Greenberg was in the 2011 comedy film directed by whom?",
        "response": "Will Gluck",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the most recent movie that Ben Whishaw participated in?",
        "response": "Paddington 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a real-estate based board game, Skirrid or Solarquest?",
        "response": "SolarQuest",
        "source": "hotpot_qa"
    },
    {
        "query": "Interpersonal Reactivity Index was developed by Mark H. Davis, a professor at a school with a campus that is how large?",
        "response": "188 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "The cave that contained the mummified remains of the Si-Te-Cah tribe was placced on the National Register of Historic Places in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the World War II cruiser, whose captain was an American naval and commanding officer when it was lost in action in 1945, resulting in a massive loss of life, and for which he was subjected to court-martial, but was later exonerated through efforts by William Joseph Toti, the final captain of the Los Angeles class submarine of the same name?",
        "response": "USS Indianapolis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the best known name of the voice in an American animated superhero film produced by Warner Bros in 2017?",
        "response": "Edward Kenway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which unfinished film by Orson wells is based on the film that he claims was the best he had ever made ?  ",
        "response": "Filming 'The Trial'",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy Dalton acted in which 2007 comedy film directed by Edgar Wright and written by Wright and Simon Pegg?",
        "response": "Hot Fuzz",
        "source": "hotpot_qa"
    },
    {
        "query": "New York State Department of Transportation",
        "response": "New York State Department of Transportation",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry Jeff McMurtry, is an American novelist, essayist, bookseller, and screenwriter whose work is predominantly set in either the old West or in contemporary Texas, McMurtry and cowriter Diana Ossana adapted the screenplay for which 2005 American neo-western romantic drama film directed by Ang Lee and produced by Diana Ossana and James Schamus?",
        "response": "Brokeback Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Ramón Antonio García Fortunato played during 1996 for which American professional baseball team and are based in Milwaukee, Wisconsin?",
        "response": "Milwaukee Brewers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two following vehicles has two motors, the Porsche 918 Spyder, or the Bugatti Veyron Super Sport?",
        "response": "The Porsche 918 Spyder",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Entertainment and Sports Programming Network, or ESPN Zone and Lake Buena Vista, Florida have in common?",
        "response": "Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Nick Brennan is a British cartoonist who works mainly for D. C. Thomson & Co. Ltd, he started drawing for the company in 1993, drawing a revival of which English-language nursery rhyme and well-known alliteration tongue-twister, from \"The Dandy\"?",
        "response": "Peter Piper",
        "source": "hotpot_qa"
    },
    {
        "query": "Kavana is the debut studio album by British singer-songwriter Kavana, she was discovered by Take That's, Manchester-based English musical band manager, named what?",
        "response": "Nigel Martin-Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Benjamin Ucuahamba, better known as Benjamin Avô, is a former Angolan basketball player, was born in Luanda, the capital and largest city in which country, and the country's most populous and important city, primary port and major industrial, cultural and urban centre?",
        "response": "Angola",
        "source": "hotpot_qa"
    },
    {
        "query": "American Atheists is a non-profit activist organization in the United States, the organization was founded by Madalyn Murray O'Hair, in which year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "270 Park Avenue and The Spiral, are located in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": " The 2008 Hall of Fame Tennis Championships, (also known as the \"Campbell's Hall of Fame Tennis Championships\" for sponsorship reasons), was a men's tennis tournament played on outdoor grass courts, the Campbell Soup Company, also known as Campbell's, is an American producer of canned soups and related products, it is headquartered in Camden, in which US state?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "\"European Song\" is a football song released in 1983 to mark Aberdeen's participation in which football match contested between Aberdeen of Scotland and Real Madrid of Spain?",
        "response": "1983 European Cup Winners' Cup Final",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the first significant composers of the Romantic school, William Walton or Carl Maria von Weber?",
        "response": "Carl Maria Friedrich Ernst von Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "The Nemean lion was killed by the son of which Greek gods?",
        "response": "Zeus and Alcmene",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county was Duffy Jackson born?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Order of Saint Michael the Archangel and Maria Vladimirovna, Grand Duchess of Russia have both been involved with which house?",
        "response": "Imperial",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first editor of the magazine in which \"The Gingerbread Man\" was published?",
        "response": "Mary Mapes Dodge",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university graduates more number of students in a year, California Institute of Technology or Boston College?",
        "response": "Boston College",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Brad Pickett or Dana White?",
        "response": "Dana White",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lloyd Bacon and Stuart Baird from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Hutchison and William K. Howard were simultaneously active in the film industry between what years?",
        "response": "1921 to 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the film which stars the Jared Leto and his older brother?",
        "response": "Sol Goode",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jordanian jihadist who was also known as the \"Shaykh of the slaughterers\" was blamed for the deaths of how many during the 2004 Iraq churches attack in 2004?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed more films, Guy Hamilton or Ulli Lommel?",
        "response": "Ulli Lommel",
        "source": "hotpot_qa"
    },
    {
        "query": "Farce of the Penguins was a parody of the documentary directed by whom?",
        "response": "Luc Jacquet",
        "source": "hotpot_qa"
    },
    {
        "query": "Heinkel HD 23 was a type of plane that was held on the craft that were first developed when?",
        "response": "early twentieth century",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Japanese manga series written and illustrated by Naoki Urasawa, when turned into an anima, did Mami Koyama  have a voice acting part in?",
        "response": "Monster",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed earlier, Navarone or The Vines?",
        "response": "The Vines",
        "source": "hotpot_qa"
    },
    {
        "query": "Barry Orton, is an American actor, musician, and former professional wrestler who has a son Bob Orton who plays in what sport?",
        "response": "professional wrestler",
        "source": "hotpot_qa"
    },
    {
        "query": "Cottonwood Creek is known for the runs of what genus of Pacific salmon?",
        "response": "Oncorhynchus",
        "source": "hotpot_qa"
    },
    {
        "query": "The Heart of Nebula is located in what constellation that is opposite of the Big Dipper?",
        "response": "Cassiopeia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Ferdi Taygan or Mahesh Bhupathi?",
        "response": "Ferdi Taygan",
        "source": "hotpot_qa"
    },
    {
        "query": "For which film did the Director team with NASA scientists, Aliens of the Deep or Poetry in Motion?",
        "response": "Aliens of the Deep",
        "source": "hotpot_qa"
    },
    {
        "query": "Cyrilla and Azorella are genus flowers native to what continent?",
        "response": "South America",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city has the Ukrainian former discus thrower Larisa Mikhalchenko ever been that has a population of around 700,000 as of 2016?",
        "response": "Lviv",
        "source": "hotpot_qa"
    },
    {
        "query": "What time did a Fox News show formally hosted by the author of \"The Swamp: Washington's Murky Pool of Corruption and Cronyism and How Trump Can Drain It\" air?",
        "response": "Saturdays at 11:30 am ET",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character does the star of Doctor Who: The First Doctor Adventures play in the Harry Potter series?",
        "response": "Argus Filch",
        "source": "hotpot_qa"
    },
    {
        "query": "The Aurora Encounter is a film based on an incident that occurred on what date?",
        "response": "April 17, 1897",
        "source": "hotpot_qa"
    },
    {
        "query": "What airline flies to the Sultan Ismail Petra Airport and is headquartered in Petaling Jaya, Selangor, Malaysia?",
        "response": "Malindo Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Which publisher released the adventure game What Remains of Edith Finch?",
        "response": "Annapurna",
        "source": "hotpot_qa"
    },
    {
        "query": "John Price Buchanan, was an American politician and farmers' advocate, Buchanan's lone term as governor was largely marred by the Coal Creek War, was an early 1890s armed labor uprising in the southeastern United States that took place primarily in Anderson County, in which US state?",
        "response": "Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a well known song Sir George Ivan \"Van\" Morrison took part in creating with his Northern Irish band?",
        "response": "Gloria",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the game which held three times in  in East Asia first held ",
        "response": "in 1896",
        "source": "hotpot_qa"
    },
    {
        "query": "John Stewart Kennedy was a member of the Jekyll Island Club alongside what Standard Oil co-founder?",
        "response": "William Rockefeller",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the video for the single released on February 19, 2007 by Taylor Swift?",
        "response": "Trey Fanjoy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut was born first, Ulf Merbold or Vladimír Remek?",
        "response": "Ulf Dietrich Merbold",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the reigning champion of The Champions League of Darts move to in 1993?",
        "response": "Vienna",
        "source": "hotpot_qa"
    },
    {
        "query": "What do both Hanchuan and Tongcheng, Anhui have in common?",
        "response": "county-level city",
        "source": "hotpot_qa"
    },
    {
        "query": "To what county does The Ball Park of Old Orchard Beach belong to?",
        "response": "York County",
        "source": "hotpot_qa"
    },
    {
        "query": "Joy Golden is well known for creating the radio spots for a brand of processed cheese products that have been made by Fromageries Bel since what year?",
        "response": "1865",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: Who wrote both Bride of Chucky and Child's Play 3? A: Don Mancini",
        "response": "Don Mancini",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team was older when it had it's worst season, The Cleveland Browns or the Detroit Lions",
        "response": "Detroit Lions",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian film actress starred in Newness?",
        "response": "Courtney Eaton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the original surname for the actor who sang \"It's a De-Lovely\" in the 1962 revival of \"Anything Goes\"?",
        "response": "Lipshitz",
        "source": "hotpot_qa"
    },
    {
        "query": "Drew Willy has been a member of which United Football League team based in Nevada?",
        "response": "Las Vegas Locomotives",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernice Bowles \"Fitz\" Fitz-Gibbon worked for what large department store that closed in 1987?",
        "response": "Gimbels",
        "source": "hotpot_qa"
    },
    {
        "query": "Karen Carpenter and Matt Berninger were both critically acclaimed for their contralto vocals?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the person who set up the Howletts Wild Animal Park born?",
        "response": "Delhi",
        "source": "hotpot_qa"
    },
    {
        "query": "What Author published works under the pen names of Rachel Ryan, Laura Jordan, and Erin St. Claire, published a romance novel in 1992, and made the New York Times bestseller list?",
        "response": "Sandra Lynn Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the airline which has Gimhae International Airport  as the main hub based? ",
        "response": "Busanjin-gu, Busan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the head coaches of the 2016 Auburn Tigers football team and 2016 Oklahoma Sooners football team have been in post longer ?",
        "response": "Bob Stoops",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has released more studio albums Sum 41 or Nude?",
        "response": "Nude",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character, who first appeared in \"Fantastic Four\" #45, does Inhumans: The First Chapter revolve around?",
        "response": "Black Bolt",
        "source": "hotpot_qa"
    },
    {
        "query": "HMS \"Barham\" was a \"Queen Elizabeth\"-class battleship built for the Royal Navy during the early 1910s, The \"Queen Elizabeth\"-class battleships were a class of how many super-dreadnoughts of the Royal Navy commissioned in 1915–16?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Iresine, a genus of plants in the amaranth family, and Tolpis in the dandelion tribe flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Fuller presided over the case of the governor who was the last of what faith to hold the post in Alabama?",
        "response": "Roman Catholic",
        "source": "hotpot_qa"
    },
    {
        "query": "The Centennial Flame was lit in the presence of Canada's acting Prime Minister who was born in what year?",
        "response": "1897",
        "source": "hotpot_qa"
    },
    {
        "query": "Caesars Palace is located between Bellagio and a casino built by what developer?",
        "response": "Steve Wynn",
        "source": "hotpot_qa"
    },
    {
        "query": "In what season of the 2017 year is the Netflix German language series that Anatole Taubman will appear in, scheduled to be released?",
        "response": "winter",
        "source": "hotpot_qa"
    },
    {
        "query": "The 3rd book by Dan Brown that features character Robert Langdon is set in what city?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Rocket Rods opened on the infrastructure of what Disneyland attraction that operated from 1967 to 1995?",
        "response": "PeopleMover",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kids of Catan and Glasnost The Game are both what kind of game?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "The Runge-Kutta methods were developed by M.W. Kutta and a German mathematician, physicist, and Spectroscopist that was born in what year?",
        "response": "1856",
        "source": "hotpot_qa"
    },
    {
        "query": "Rick Stone was a character created by which creator of Static Shock?",
        "response": "Dwayne Glenn McDuffie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English conductor worked for both the Halle Orchestra and Sergie Diaghilev's ballet company?",
        "response": "Adrian Boult",
        "source": "hotpot_qa"
    },
    {
        "query": "Which R&B singer released a video for their 2003 single, which co-starred the American film and television actor best known for his roles as Peter Waters in \"Crash\" and as O-Dog in the 1993 hood film, \"Menace II Society\"?",
        "response": "Ashanti",
        "source": "hotpot_qa"
    },
    {
        "query": "are David Donato and Cedric Bixler-Zavala in the same band",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Evian Christ worked on the album Yeezus for which famous American rapper?",
        "response": "Kanye West",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2011 census population of this village and civil parish in Lincolnshire, England, where High Dyke road runs between it and Colsterworth?",
        "response": "1,647",
        "source": "hotpot_qa"
    },
    {
        "query": "What Harry Bates story inspired the screenplay writer of \"The Last Caste\" to write a 2008 remake?",
        "response": "Farewell to the Master",
        "source": "hotpot_qa"
    },
    {
        "query": "Tritrichomonas is a genus of single celled flagellated parasitic excavates, some of whose species are known to be pathogens of the bovine reproductive tract as well as the intestinal tract of felines, which biological family has a lineage of carnivorans that includes the cats?",
        "response": "Felidae",
        "source": "hotpot_qa"
    },
    {
        "query": " The Siege of Tyre was an assault by the founder of what?",
        "response": "Ayyubid dynasty",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed in Europe, Finger Eleven or Fatherson?",
        "response": "Fatherson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actor who has played a role in both \"For Your Consideration\" and \"the Simpsons\"?",
        "response": "Harry Shearer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Stabbing Westward or Beastie Boys?",
        "response": "Beastie Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "James Fleet plays the character Tom in s 1994 romantic comedy fil directed by who?",
        "response": "Mike Newell",
        "source": "hotpot_qa"
    },
    {
        "query": "Angelo Henna masterminded the murder of an American mobster born in what year?",
        "response": "1892",
        "source": "hotpot_qa"
    },
    {
        "query": "Which institution in Singapore that was founded in 1905 appointed this researcher who was the James McGill Professor in the Department of East Asian Studies of McGill University?",
        "response": "National University of Singapore",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stockholm International Film Festival has been host to which actress and UNICEF Goodwill Ambassador?",
        "response": "Susan Abigail Sarandon",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of Experiments in Ethics born?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Colbert Super PAC joked that funds raised would be used to purchase mementos from which luxury department store?",
        "response": "Saks Fifth Avenue",
        "source": "hotpot_qa"
    },
    {
        "query": "The sea whose port is The Port of Reggio is sometimes considered as a part of which ocean?",
        "response": "Atlantic Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Johnette Napolitano and Andi Deris both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Hndrxx features a guest appearance by what Canadian singer?",
        "response": "The Weeknd",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was the composer of \"Prima la musica e poi le parole\" born?",
        "response": "Legnago",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Knot Garden and Ariadne auf Naxos both operas?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the founder of 'the Chess Player's Chronicle' born?",
        "response": "1810",
        "source": "hotpot_qa"
    },
    {
        "query": "Who captained the Pakistani cricket team during May 2011 when they visited Ireland to play 2 One Day Internationals, where Paul Stirling scored the maximum number of runs in the series and Pakistans right arm off-spin bowler took 7 wickets?",
        "response": "Misbah-ul-Haq",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the person who named the 1st Battle of Kharkov hold during World War II?",
        "response": "Chief of the Armed Forces High Command",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band did this American businessman, music publisher, writers' representative, filmmaker and record label executive manage while simultaneously managing this group of the album \"More Hot Rocks?\"",
        "response": "the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song was released on September 12, along with a music video in 2008? ",
        "response": "Love Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mattel and Commodore 128 both involved in electronics?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Spanish Superclub provided residencies to the British producer Steve Lawler?",
        "response": "Space",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sembene! and Seoul Train both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which debut novel by Native American novelist James Welch was produced by another Native American author Sherman Alexie?",
        "response": "Winter in the Blood",
        "source": "hotpot_qa"
    },
    {
        "query": "Johnny Hallyday is a French singer and actor once married for 15 years to popular Bulgarian-French singer Sylvie Vartan whose performances often featured what type of choreography? ",
        "response": "show-dance",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Real Slim Shady\" is a song taken from the eighth studio album \"The Marshall Mathers LP 2\" (2013)  of what hip hop recording artist?",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "Kimber Aegis is a series of which single-action pistols?",
        "response": "M1911",
        "source": "hotpot_qa"
    },
    {
        "query": "The Annapolis Police Department serves the people of what county?",
        "response": "Anne Arundel County",
        "source": "hotpot_qa"
    },
    {
        "query": "Buck Ram wrote, produced, and arranged for what African-American jazz singer who is often referred to as the first lady of song?",
        "response": "Ella Jane Fitzgerald",
        "source": "hotpot_qa"
    },
    {
        "query": "The Austrian border barriers at facilities like South Tyrol was designed to designed to manage what?",
        "response": "people arrived in the European Union",
        "source": "hotpot_qa"
    },
    {
        "query": "World for Ransom was directed by the producer notable for which 1974 film?",
        "response": "The Longest Yard",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Emmy Awards has the actress starring in Journey to the Unknown won for her role in The Member of the Wedding?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Aśvaghoṣa is considered one of the greatest Indian poets before the time of which Sanskrit writer and dramatist?",
        "response": "Kālidāsa",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this region of Italy, referring to the medieval March of Ancona and nearby marches of Camerino and Fermo, where the comune Pollenza is located?",
        "response": "Marche",
        "source": "hotpot_qa"
    },
    {
        "query": "At what age was the supermodel who Enrique Palacios is known for having a relationship with recruited?",
        "response": "15",
        "source": "hotpot_qa"
    },
    {
        "query": "The Osceola Parkway, signed as County Road 522 (CR 522) since around which year, is a 12.4 mi , partially tolled arterial road extending east–west across the northern boundary of Osceola County, Florida, roughly paralleling the border with Orange County, it connects Walt Disney World with Interstate 4 and Florida's Turnpike, designated as State Road 91 (SR 91) and the Ronald Reagan Turnpike, is a toll road in Florida?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Emer has had songs performed by the singer known for which Christmas novelty hit?",
        "response": "Santa Baby",
        "source": "hotpot_qa"
    },
    {
        "query": "What Italian former professional footballer and manager scored the winning shot in the 1999-2000 FA Cup?",
        "response": "Roberto Di Matteo",
        "source": "hotpot_qa"
    },
    {
        "query": "The team Kevin Goldthwaite last played for play their home games at Providence Park since what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre does The Heatmakerz and The Diplomats have in common?",
        "response": "hip hop",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published a supplemental sourcebook to the core rules of the second edition of the \"Advanced Dungeons & Dragons\" designed by an American game designer at a company where he was employed for over fifteen years?",
        "response": "TSR, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lenophyllum and Manglietia flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the writer of the 2011 sci-fi thriller starring Warren Christie?",
        "response": "Brian Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Jerry Bingham produced Batman: Son of the Demon for which comicbook publisher in 1987?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the artist who worked with Max Martin and a Swedish songwriter to make her second greatest hits album?",
        "response": "Britney Spears",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who was signed to compose the score and soundtrack of \"Dhobi Ghat\"?",
        "response": "Argentine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2002 television drama film directed by Oz Scott starred the actor best known for his role as Stanley on \"The Cosby Show\"?",
        "response": "Play'd: A Hip Hop Story",
        "source": "hotpot_qa"
    },
    {
        "query": "What Golden Globe Award actor starred in the film Little Fugitive? ",
        "response": "Peter Dinklage",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Calochone and Adlumia both plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the company in Independent Hill, Virginia that is also headquartered in Houston Texas?",
        "response": "Citgo",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarasota Grammar School was founded in what county of Florida?",
        "response": "Sarasota County",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who plays hotelier Paul Rusesabagina in Hotel Rwanda was born in what year?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Dianne Jackson is best known for an animation film based on a book by what author?",
        "response": "Raymond Briggs",
        "source": "hotpot_qa"
    },
    {
        "query": "Francis Ford Coppola was the director for which trilogy in which the family name is Corleone?",
        "response": "The Godfather",
        "source": "hotpot_qa"
    },
    {
        "query": "Frieth is a village is located in a chalk escarpment that was designated as an Area of Outstanding Natural Beauty in what year? ",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Glamour, a 1931 British drama film, directed by Seymour Hicks starred which English actress known as 'Lady Hicks' and best known for her performances in Edwardian musical comedies?",
        "response": "Ellaline Terriss",
        "source": "hotpot_qa"
    },
    {
        "query": "Groote Schuur Hospital is a large, government-funded, teaching hospital situated on the slopes of Devil's Peak in the city of Cape Town, South Africa, it's famous for being the institution where the first human-to-human heart transplant took place, conducted by University of Cape Town-educated surgeon Christiaan Barnard on the patient Louis Washkansky, he was a South African man who was the recipient of the world's first human-to-human heart transplant, and the first patient to regain consciousness following the operation, and lived for how many days?",
        "response": "18",
        "source": "hotpot_qa"
    },
    {
        "query": "Dum Maaro Dum is a film that has a hit song in which Asha Bhosle and chorus track?",
        "response": "Dum Maro Dum",
        "source": "hotpot_qa"
    },
    {
        "query": "Conan Triumphant was published by what company?",
        "response": "TSR, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor who was born and raised in London to Indian parents played Sonny in The Best Exotic Marigold Hotel?",
        "response": "Dev Patel",
        "source": "hotpot_qa"
    },
    {
        "query": "The suburb east of Christie Downs has what land area?",
        "response": "12.76 km²",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathalie Marie Andrée Baye's films include a French thriller based on a novel by who?",
        "response": "Harlan Coben",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the occupations of both Billy Chapin and Charles Laughton?",
        "response": "actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band originated in Bradford, West Yorkshire in 1980, Superdrag or New Model Army?",
        "response": "New Model Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Rhapis and Lantana, which genus has the most number of species?",
        "response": "Lantana",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jimmie Ross and Jang Hyun-seung Americans?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album did Queen Latifah put out first, Black Reign or All Hail the Queen?",
        "response": "All Hail the Queen",
        "source": "hotpot_qa"
    },
    {
        "query": "Broken Sun is partly based on what attempted escape from a POW camp?",
        "response": "Cowra breakout",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Ignatius' College has a senior campus located in which suburb of Adelaide?",
        "response": "Athelstone",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the penciler who worked on New Man comic books win twice?",
        "response": "Eisner Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has had more positions in the film industry, Walter Lang orMiguel Contreras Torres?",
        "response": "Miguel Contreras Torres",
        "source": "hotpot_qa"
    },
    {
        "query": "Sierra was co-written by the duo signed to what label?",
        "response": "Dot Records",
        "source": "hotpot_qa"
    },
    {
        "query": "How close to Louisville was Randal Malone born?",
        "response": "107 mi southwest of Louisville",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city are the headquarters of the American research and scientific development company where Ravi Sethi worked as computer scientist located?",
        "response": "Murray Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Max Imdahl was born in a city that is located in what part of Germany?",
        "response": "North Rhine-Westphalia",
        "source": "hotpot_qa"
    },
    {
        "query": "At what age did the mathematician, who studied engineering in the department headed by a prominent innovator in the understanding of fluid dynamics, enter the University of Manchester in 1904?",
        "response": "16",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie that Christa Campbell was in that starred Nicolas Cage and Amber Heard?",
        "response": "Patrick Lussier",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is in the commercial for a rum that uses the slogan \"To Life, Love, and Loot.\"",
        "response": "Shaun Weiss",
        "source": "hotpot_qa"
    },
    {
        "query": "The album Spontaneous Combustion is a reference to what film directed by Pete Hewitt?",
        "response": "Bill & Ted's Bogus Journey",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Andrew Stanton or William Malone do more voice acting work?",
        "response": "Andrew Stanton",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Crazy Magazine and American Nature Association both magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Malcolm St. Clair and Nicolas Roeg both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Bernard Dhéran was the French dub of the English actor who won how many Laurence Olivier Awards?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Oblivion\" is a single by a French band formed in what city?",
        "response": "Antibes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country are the actors in that stole a car that is a three-door hatchback?",
        "response": "New Zealand",
        "source": "hotpot_qa"
    },
    {
        "query": "Rhonda Vincent, who appeared on the album \"That's why I Sing this Way\" has been called the \"new queen of\" what, by the Wall Street Journal",
        "response": "Bluegrass",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian Mathematician would have studied modern mathematics, Boris Delaunay or Vladimir Voevodsky?",
        "response": "Vladimir Alexandrovich Voevodsky ( ; Russian: Влади́мир Алекса́ндрович Воево́дский , 4 June 1966 - 30 September 2017)",
        "source": "hotpot_qa"
    },
    {
        "query": "Piper Kerman served her sentence at FCI Danbury for what crime?",
        "response": "money-laundering",
        "source": "hotpot_qa"
    },
    {
        "query": "North Montgomery High School is a part of what Indiana school district?",
        "response": "North Montgomery School Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both  Ferula and Watercress a species of flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bourbon Barrel played between the Hoosiers and the Wildcats was similiar to what games played between the Kentucky Wildcats and the Tennessee Volunteers?",
        "response": "Kentucky–Tennessee rivalry",
        "source": "hotpot_qa"
    },
    {
        "query": "Home on the Range was an album recorded by the country music singer who was the opening act for which rocker in the 1950s?",
        "response": "Elvis Presley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which careers did both Terence Young and Miklós Jancsó have in common?",
        "response": "film director and screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "An American professional basketball player for the New York Knicks, who was born in 1983,  attended a college preparatory, non-denominational, co-educational day school in what North Carolina city?",
        "response": "Durham",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was the actor born on May 4, 1946 involved in in 1972?",
        "response": "Five Summer Stories",
        "source": "hotpot_qa"
    },
    {
        "query": "Ju-Ni takes it's name from writing entirely based on what?",
        "response": "Chinese numerals",
        "source": "hotpot_qa"
    },
    {
        "query": "What British romantic comedy written and directed by Kenneth Branagh included Ann Cuerton Davies as an actor?",
        "response": "In the Bleak Midwinter",
        "source": "hotpot_qa"
    },
    {
        "query": "The Super Bowl XLVI Final was played in the home stadium of which team ?",
        "response": "Indianapolis Colts",
        "source": "hotpot_qa"
    },
    {
        "query": "In That's So Raven, what spin off did Kyle Massey (Cory Baxter) star in?",
        "response": "Cory in the House",
        "source": "hotpot_qa"
    },
    {
        "query": "Cave-In-Rock, Illinois was a stronghold for serial killer/bandit brothers who operated in which century?",
        "response": "who operated in Tennessee, Kentucky, Illinois, and Mississippi, in the late eighteenth century.",
        "source": "hotpot_qa"
    },
    {
        "query": "What American physicist discovered the positron which explained Chinese physicist Chung-Yao Chao's earlier experiments with gamma rays?",
        "response": "Carl David Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "How many cards can a player choose from to be part of their hand in the card game that was the culmination game of the United States Poker Championship?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor starred in both the drama series \"The Killing\" and the Danish movie \"April 9th\"?",
        "response": "Lars Mikkelsen",
        "source": "hotpot_qa"
    },
    {
        "query": "The Brat had previously been made in 1919 starring which Russian actress?",
        "response": "Alla Nazimova",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was developed first, Dick Smith Super-80 Computer or Pecom 32?",
        "response": "Dick Smith Super-80",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress appeared on Dr. Alien and Little House on the Prairie?",
        "response": "Olivia Barash",
        "source": "hotpot_qa"
    },
    {
        "query": "Are James Norman Hall and Amiri Baraka from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English philosopher did Henry Seymour believe authored plays under the pseudonym of William Shakespeare?",
        "response": "Sir Francis Bacon",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that Corexit is an indirect subsidiary of is headquartered in what city?",
        "response": "St. Paul, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Marvel Comics character with severe mental illnesses appear in the pilot episode of the American cable television series named after the character?",
        "response": "Legion",
        "source": "hotpot_qa"
    },
    {
        "query": "What other famous novel did the author of the book with protagonist Wade Watts write?",
        "response": "\"Armada\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Canadian American actress and activist who starred in a horror film?",
        "response": "Margot Kidder",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Donald Driver a champion in season 14 of a show in 2012?",
        "response": "Driver (born February 2, 1975) is a former American football wide receiver, a \"New York Times\" bestselling author, and the season 14 \"Dancing with the Stars\" champion.",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county is the Air Force base, at which the 402d Maintenance Wing is based, located?",
        "response": "Houston County",
        "source": "hotpot_qa"
    },
    {
        "query": "Juan Carlos Ferrero and Stan Wawrinka, are both what?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was funded in part by a loan from the owner's mother, Airliners or Playboy?",
        "response": "Playboy",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1989 Batman film was produced by Jon Peters and a man that is the CEO of what company?",
        "response": "Mandalay Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Suqian and Hejin in the People's Republic of China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant genus is native to South America,  Myrteola or Hoheria?",
        "response": "Myrteola",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a movie in 1985 that starred Paul Reubens and had a support actor who also portrayed Chubby in the \"Teen Wolf\" film series?",
        "response": "Tim Burton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Latin phrase that describes Pope Julius II's efforts to remove Pope Alexander VI's name from the records?",
        "response": "Damnatio memoriae",
        "source": "hotpot_qa"
    },
    {
        "query": "Drew Goddard directed a film produced by who? ",
        "response": "Joss Whedon",
        "source": "hotpot_qa"
    },
    {
        "query": "What FIFA World Cup did the referee of the 28 May 2011 football match at Wembley Stadium participate in? ",
        "response": "2010 FIFA World Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "Alessia Cara collaborated with Logic to release a son on what day?",
        "response": "April 28, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university is a public university, King Mongkut's Institute of Technology Ladkrabang or University at Buffalo?",
        "response": "University of Buffalo",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of movie is it which starring the danish actor who played a policeman in movie \"pusher\" ?",
        "response": "romantic action adventure film",
        "source": "hotpot_qa"
    },
    {
        "query": "The Coleman Medal is named after Australian rules football player, who was born on what day?",
        "response": "23 November 1928",
        "source": "hotpot_qa"
    },
    {
        "query": "What president was married to a film actress and was reputed to be advised by someone known as the gregarious Aquarius?",
        "response": "Ronald Reagan",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the documentary film \"Meru\" released in the same year as \"All Aboard! Rosie's Family Cruise\"?",
        "response": "the film debuted on April 6, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What awards did the novel which precedes Count Zero win?",
        "response": "Nebula Award, the Philip K. Dick Award, and the Hugo Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Siege took place in 1961 where The wife of Albert Verbrugghe and a female passenger where killed by Indian UN troops ?",
        "response": "Siege of Jadotville",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the electric racing series British race car driver Alex Lynn drives for and is owned by Virgin Group?",
        "response": "DS Virgin Racing Formula E Team",
        "source": "hotpot_qa"
    },
    {
        "query": "Full Circle is an American soap opera that starred Dyan Cannon and Jean Byron, who portrayed Patty Lane's mother in what show?",
        "response": "\"The Patty Duke Show\"",
        "source": "hotpot_qa"
    },
    {
        "query": "North Shore Animal League America is the largest example of what kind of animal shelter and protection organization?",
        "response": "no-kill shelter",
        "source": "hotpot_qa"
    },
    {
        "query": "Ford World Headquarters is located near a large indoor and outdoor history museum complex that is the largest in the US and visited by how many people each year",
        "response": "1.6 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Chihiro Noda and Paulo Dybala play together?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Who distributed the short film \"Turbo Charged Prelude\"?",
        "response": "Universal Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper sings Runnin' From tha Police, a 1995 song, which was one of very few compostions done jointly due to a feud between artists and fans of the East Coast hip hop and West Coast hip hop scenes in the United States?",
        "response": "Tupac Shakur",
        "source": "hotpot_qa"
    },
    {
        "query": "Lynyrd Skynyrd lost three members in a crash of a plane that was chartered from which company?",
        "response": "L&J Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the Broken Bow Records country music artist who released Where It's At on September 9, 2014?",
        "response": "Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which war as well as the Seven Years' Warwas this decisive battle part of that resulted in the The Miracle of the House of Brandenburg?",
        "response": "Third Silesian War",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the HBO series that Alice Wetterlund star in premier?",
        "response": "April 6, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "The politician who is the U.S. Representative for Virginia's 9th congressional district and is a member of what is also known as the House Freedom Caucas is a member of which political party?",
        "response": "Republican Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Rod Sterling narrated a series based on a book by what German author?",
        "response": "Erich von Däniken",
        "source": "hotpot_qa"
    },
    {
        "query": "Which institution has more beds out of the Psychiatric Institute of Washington and the MedStar Washington Hospital Center?",
        "response": "MedStar Washington Hospital Center",
        "source": "hotpot_qa"
    },
    {
        "query": "What disease was Kyle Broflovski infected with by one of his three friends?",
        "response": "HIV",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the Hart wrestling family wrestled under the name The Blue Blazer?",
        "response": "Owen Hart",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 New York Jets season began with the team being coached by which former player who spent 8 years in the NFL as a safety?",
        "response": "Todd Robert Bowles",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Peace of Kiel negotiated and signed by Edmund Bourke?",
        "response": "14 January 1814",
        "source": "hotpot_qa"
    },
    {
        "query": "La Muerte en las calles is an Argentine film set during a series of unsuccessful British attempts to seize control of areas in the Spanish colonial Viceroyalty of the Río de la Plata, as part of which larger wars?",
        "response": "the Napoleonic Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was made depicting the life of the ballplayer nicknamed \"Gander\"?",
        "response": "\"The Stratton Story\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What Swiss football club based in Basel did Thomas Häberli join in July 2000?",
        "response": "FC Basel",
        "source": "hotpot_qa"
    },
    {
        "query": "What Ever Happened to Aunt Alice?, is a 1969 American thriller film directed by Lee H. Katzin with Bernard Girard, and starring Mildred Dorothy Dunnock, was an American theater, film and television actress, and passed away on which date?",
        "response": "July 5, 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Steve Lukather and Andy Biersack both members of a band?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Corey Snide graduated from a high school located in what state?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Childe Byron is a 1977 play about a poet born in what year?",
        "response": "1788",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress who played Julie Kotter in \"Welcome Back, Kotter\" starred with Rick Moranis in Honey, I Blew Up the Kid?",
        "response": "Marcia Strassman",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the person who had a sidekick who the hosted nationally televised talent competition?",
        "response": "Johnny Carson",
        "source": "hotpot_qa"
    },
    {
        "query": " What is the latest album of Tim Hecker, the Canadian electronic music maker?",
        "response": "Love Streams",
        "source": "hotpot_qa"
    },
    {
        "query": "What patriarch of the Jackson family was a client of lawyer Debra Opri?",
        "response": "Joseph Walter Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "The 69 Squadron of the Israeli Air Force saw extensive action in which war between the Arab and Israeli fighters in 1973?",
        "response": "The Yom Kippur War",
        "source": "hotpot_qa"
    },
    {
        "query": "Arthur W. Rice focused on creating large residences in which officially-recognized Boston neighborhood?",
        "response": "Back Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of albums has Arjen Anthony Lucassen produced that would be considered \"concept albums\"?",
        "response": "Rock operas",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Ruggero Deodato and Barry Sonnenfeld of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The King and Queen of America was co-written by the singer and activist of which heritage?",
        "response": "Scottish",
        "source": "hotpot_qa"
    },
    {
        "query": "Marilyn Puder-York was a former staff psychologist for what bank founded in 1812 as the \"City Bank of New York\"?",
        "response": "Citibank",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Charles de Gaulle and Georges Pompidou, what year was the longer lived born?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenji Yano, is a Japanese professional baseball outfielder for which Japanese professional baseball team based in Sapporo, Hokkaidō?",
        "response": "Hokkaido Nippon-Ham Fighters",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Ilie Năstase or Peter Fleming?",
        "response": "Ilie \"Nasty\" Năstase",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the budget of the film in which Kodi Smit-McPhee voiced Norman Babcock?",
        "response": "$60 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Woman's Weekly is a British women's magazine published by Time Inc.UK, formerly known as what publishing corporation?",
        "response": "International",
        "source": "hotpot_qa"
    },
    {
        "query": "How many power generating dams are operated along the river that is accessed through the Hiwassee/Ocoee Scenic River State Park?",
        "response": "Three",
        "source": "hotpot_qa"
    },
    {
        "query": "What band is widely credited as one of the pioneers of visual kei, and released a compilation box set containing two CDs, a VHS tape and a T-shirt from the \"Violence and Jealousy Tour\"?",
        "response": "X Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Mother Mother was the last song by a female solo artist to top the Billboard Modern Rock chart until the 2013 song by the singer from what country?",
        "response": "New Zealand",
        "source": "hotpot_qa"
    },
    {
        "query": "What public radio network in New York has allowed Eric Plakun to dis his psychiatric work?",
        "response": "WAMC",
        "source": "hotpot_qa"
    },
    {
        "query": "Abel Makkonen Tesfaye, a Canadian singer, featured on \"Comin Out Strong,\"  a song by American rapper Future, is better known by what name?",
        "response": "The Weeknd",
        "source": "hotpot_qa"
    },
    {
        "query": "Broth of a Boy is a 1959 Irish comedy film directed by George Pollock and starring who, he was an Irish stage, film and television actor?",
        "response": "Barry Fitzgerald",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the man after whom the collection of documents pertaining to the reformation prompted initially by Huldrych Zwingli?  ",
        "response": "Johann Jakob Wick",
        "source": "hotpot_qa"
    },
    {
        "query": "who is older Paul Haarhuis or Mary Pierce",
        "response": "Paul Vincent Nicholas Haarhuis",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the buiding built that housed the first pay-per-view promoted by Ring of Honor?",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a American actress, dancer, and singer, which introduced the song \"They all Laughed\"?",
        "response": "Ginger Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the united states was the Interstate highway which has Valley District along it?",
        "response": "eastern part",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Lewis Allen or Danny DeVito play Louie De Palma?",
        "response": "Daniel Michael DeVito, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2011 census population of the town that Paul William Harragon was born in?",
        "response": "5,772",
        "source": "hotpot_qa"
    },
    {
        "query": "The stained glass windows in St. Patrick's Parish and Buildings were destroyed in what explosion that was an act of sabotage by German agents?",
        "response": "Black Tom explosion",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the newspaper, of which David Dinsmore is a former editor, become a tabloid ?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Music from whose debut film \"Strictly Ballroom\" is featured on the album Something for Everybody?",
        "response": "Baz Luhrmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Aranyaka starred the film actress of what dual nationality?",
        "response": "British and Indian",
        "source": "hotpot_qa"
    },
    {
        "query": "Sonia Petrovna, is a French dancer and actress (film, television and theatre), her most famous early acting roles were as who, in \"Ludwig\" alongside leading actors Helmut Berger?",
        "response": "Princess Sofia",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes were there of the sitcom in which Jordan Masterson co-starred as Ryan Vogelson ? ",
        "response": "130",
        "source": "hotpot_qa"
    },
    {
        "query": "The Messerschmitt Me 263 \"Scholle\" (plaice) was a rocket-powered fighter aircraft developed from the Me 163 \"Komet\" towards the end of, which historic event?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "In molecular biology, the Cofactor transferase family is a family of protein domains that includes biotin protein ligases, etc, The metabolism of the cofactors lipoic acid and which water-soluble B-vitamin, also called vitamin B, and formerly known as vitamin H, or coenzyme R, share this family?",
        "response": "Biotin",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the band the releaser of Drive was in with Sam Bush founded?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Dante primarily play during the 2012-13 FC Bayern Munich season?",
        "response": "a central defender",
        "source": "hotpot_qa"
    },
    {
        "query": "This museum is dedicated to the study of the arts and cultures of ancient Greece, Rome, and Etruria, as well as known for housing the Lansdowne Heracles marble.",
        "response": "Getty Villa",
        "source": "hotpot_qa"
    },
    {
        "query": "What college did Trent Jordan Watt and his older brother play college football?",
        "response": "University of Wisconsin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film maker was hired by Walk Disney, Serguei Kouchnerov or Raúl Ruiz?",
        "response": "Serguei Kouchnerov",
        "source": "hotpot_qa"
    },
    {
        "query": "What date did the American actress and singer-songwriter, known for her role as Peggy Bundy, release her first album?",
        "response": "April 19, 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes were aired from the show starring the Canadian-American actor born March 27, 1971?",
        "response": "Four",
        "source": "hotpot_qa"
    },
    {
        "query": "What American professional Hawaiian surfer born 18 October 1992 won the Rip Curl Pro Portugal?",
        "response": "John John Florence",
        "source": "hotpot_qa"
    },
    {
        "query": "What Italian painter is best known for a 19th-century art movement characterized by relatively small, thin, yet visible brush strokes, open composition, emphasis on accurate depiction of light in its changing qualities,ordinary subject matter, inclusion of \"movement\" as a crucial element of human perception and experience, and unusual visual angles?",
        "response": "Carlo Balestrini",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a form of gambling in Texas?",
        "response": "Texas Lottery",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company which is split into three major industry areas, is headquartered in Wattens? ",
        "response": "Swarovski",
        "source": "hotpot_qa"
    },
    {
        "query": "What film series did Hillary Wolf and Macaulay Culkin both feature in?",
        "response": "\"Home Alone\" series",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country did this Australian who was detained in Guantanamo Bay detention camp and published \"Guantanamo: My Journey\" receive para-military training?",
        "response": "Afghanistan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American writer and filmmaker best known for the book \"Miss Peregrine's Home for Peculiar Children\", Paul Bogart or Ransom Riggs?",
        "response": "Ransom Riggs",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Argentine Brewery founded in 1888 that the Quilmes Rock music festival is named after?",
        "response": "Cerveza Quilmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the founder of the British Army Unit which undertakes a number of roles including covert reconnaissance, counter-terrorism, direct action and hostage rescue?",
        "response": "Paddy Mayne",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Burnett's co-host for Gamestop TV provided the voice for what character in \"One Piece\"?",
        "response": "Tony Tony Chopper",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the actor who starred in \"Hello Ghost\" and a 2012 South Korean historical comedy film about a gang of 11 thieves from?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": " Ermal Cleon \"Ernie\" Fraze assembled novelties for an American snack brand whose slogan was what?",
        "response": "The More You Eat The More You Want",
        "source": "hotpot_qa"
    },
    {
        "query": "Hagbard and Signe was based on characters from a work by which Danish historian?",
        "response": "Saxo Grammaticus",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the TV station in Hudson County, New Jersey, where Van Hackett worked?",
        "response": "WWOR-TV",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American singer, songwriter, actress and LGBT rights activist born who won Grammy and Emmy award?",
        "response": "June 22, 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed of dog originated farther east of the United States, the Hawaiian Poi Dog or the Cesky Terrier?",
        "response": "Cesky Terrier",
        "source": "hotpot_qa"
    },
    {
        "query": "What country do both Burscough and Iain Coyle have in common?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Distributed cognition is an approach to cognitive science research that deploys models of the extended mind, see the paper, titled what, by Andy Clark and David Chalmers, (1998) is a seminal work in the field of extended cognition?",
        "response": "The Extended Mind",
        "source": "hotpot_qa"
    },
    {
        "query": "Warsaw was the planned debut album by which English post-punk band, formed in 1976 in Salford, Greater Manchester?",
        "response": "Joy Division",
        "source": "hotpot_qa"
    },
    {
        "query": "The Old Post Office Block is situated between the stage production venue at 76-96 Hanover Street and which other building?",
        "response": "Harrington-Smith Block",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jeep Cherokee was originally sold as a variant of the first what?",
        "response": "luxury 4x4",
        "source": "hotpot_qa"
    },
    {
        "query": "O'Sheas Casino is a casino located within which 2,640-room hotel, casino and shopping promenade on the Las Vegas Strip in Paradise, Nevada?",
        "response": "The Linq",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current British monarch in which the Fixated Threat Assessment Centre was set up to assess and manage the risk to?",
        "response": "Elizabeth II",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Jennings, was a Canadian journalist for the CBC and the father of which TV station news anchor, Peter Jennings?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "Leslie Pearce and John Ince, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is Martinair based out of?",
        "response": "Amsterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor, who starred in \"Elizabethtown\" (2005), was in The Good Doctor, in 2011?",
        "response": "Orlando Bloom",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Point Pleasant Canal and Sturgeon Bay Ship Canal in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formedfirst Hüsker Dü or Polvo ?",
        "response": "Hüsker Dü",
        "source": "hotpot_qa"
    },
    {
        "query": "Vince Phillips held a junior welterweight title by an organization recognized by what larger Hall of Fame?",
        "response": "International Boxing Hall of Fame",
        "source": "hotpot_qa"
    },
    {
        "query": "The first statue by Benjamin Victor was of a Paiute activist who was born with what name?",
        "response": "Thocmentony",
        "source": "hotpot_qa"
    },
    {
        "query": "What action role-playing video game directed by Hidetaka Miyazaki and published by Bandai Namco Entertainment for PlayStation 4, Xbox One, and Microsoft Windows?",
        "response": "Dark Souls III",
        "source": "hotpot_qa"
    },
    {
        "query": "This drama film directed by Andrey Zvyagintsev starred a Russian actor also known for \"Bimmer\" which was made in what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the novels on which a mecha anime series by Studio Fantasia is loosely based on, and whose writings were serialized in St Nicholas Magazine from December 1887?",
        "response": "Frances Hodgson Burnett's",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the author of \"The Beauty Myth: How Images of Beauty Are Used Against Women\" born?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Missin U has a sample of which song by an American jazz rock band founded by Walter Becker and Donald Fagen?",
        "response": "\"Third World Man\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What divisions play in the Pro Bowl?",
        "response": "American Football Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "What Eastern Orthodox Ukrainian Church Martyr arranged a Ukranian schedrivka in 1916?",
        "response": "Mykola Leontovych",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: Cathair Mór, son of Feidhlimidh Fiorurghlas, a descendant of Conchobar Abradruad, was, according to Lebor Gabála Érenn, a High King of Ireland, he ruled for three years, at the end of which he was killed by the Luaigne of which location, near the River Boyne, is an archaeological complex that runs between Navan and Dunshaughlin in County Meath, Ireland?",
        "response": "Hill of Tara",
        "source": "hotpot_qa"
    },
    {
        "query": "Maha Kali is an EP by what band from Stromstad that was formed in 1989?",
        "response": "Dissection",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 1977 debut album of the singer who named her tour the \"Hide Your Heart Tour?\"",
        "response": "The World Starts Tonight",
        "source": "hotpot_qa"
    },
    {
        "query": "What military transport aircraft was developed from an airliner which crashed on March 27, 1951?",
        "response": "Douglas C-47 Skytrain",
        "source": "hotpot_qa"
    },
    {
        "query": "Myles Kennedy and Robert Palmer, share which mutual occupations?",
        "response": "musician, singer, and songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Liberty Heights (also known as Wakefield Street Tower, or 17 New Wakefield Street) is a skyscraper apartment building in Manchester, England, and is the third tallest building in Manchester after the Beetham Tower and CIS Tower, Beetham Tower, also known as the Hilton Tower, is a landmark 47-storey mixed use skyscraper in Manchester, in which country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "The U.S. state of Arizona is the home of which Senator, an American politician and member of the Republican Party who since 2013 has served as the Junior United States Senator from Arizona, alongside former 2008 presidential nominee John McCain?",
        "response": "Jeffry Lane Flake",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose real-life story was the inspiration of the film which included the song \"We All Die Young\"?",
        "response": "Tim \"Ripper\" Owens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was founded in the 21st century, Foo Fighters or Goon Moon?",
        "response": "Goon Moon",
        "source": "hotpot_qa"
    },
    {
        "query": "Manmohini Zutshi Sahgal was a member of a family that has traditionally led what republic?",
        "response": "Republic of India",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the total land area of the airport at which the Continental Airlines Flight 1404 crash happened?",
        "response": "33,531 acres",
        "source": "hotpot_qa"
    },
    {
        "query": "Which student of Tamara Novichenko now resides in both Vienna, Austria, and New York City?",
        "response": "Anna Netrebko",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Andrew Adamson and Risto Jarva both based in the US?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ministry is in charge of the service that owns the oceanographic research vessel \"Dr. Bernardo A. Houssay\"?",
        "response": "the Argentine Security Ministry",
        "source": "hotpot_qa"
    },
    {
        "query": "What man is credited with helping Dan Emmett write the song which has become a toponym for the Southern United States?",
        "response": "Thomas Snowden",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Tiersten plays Ricky Thomas in a 1983 film written by who?",
        "response": "Robert Hiltzik",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Piers Dutton and Norton Priory connected?",
        "response": "Monasteries",
        "source": "hotpot_qa"
    },
    {
        "query": "Gaëtan Varenne is seen as similar to which French professional footballer from Arsenal?",
        "response": "Olivier Giroud",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dorothy Arzner and Justin David Swibel directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Panda's Thumb is a weblog, on the creation-evolution controversy from a mainstream scientific perspective, it is written by multiple contributors, including Mark Perakh, a professor emeritus of Mathematics and statistical mechanics at which organization, Fullerton in Fullerton, California?",
        "response": "California State University",
        "source": "hotpot_qa"
    },
    {
        "query": "How to Irritate People was a broadcast written by an English actor who got his start on what television program?",
        "response": "The Frost Report",
        "source": "hotpot_qa"
    },
    {
        "query": "Wilber Moore Stilwell, was an American depression era artist, a honoree of the White House, the official residence and workplace of which titled government position?",
        "response": "President of the United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Jordan Brand Classic alum attended Towson Catholic High School?",
        "response": "Carmelo Anthony",
        "source": "hotpot_qa"
    },
    {
        "query": "Who choreographed one who is said to be the last muse for the choreographer and starred in the Nutcracker?",
        "response": "George Balanchine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known as one of the frontmen in the seminal country rock and Americana band Poco, Rusty Young or Naser Mestarihi ?",
        "response": "Norman Russell \"Rusty\" Young",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the singer who released the single \"I Never Made Love (Till I Made It with You)\" originally from ?",
        "response": "Lubbock, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "KFAN and its rebroadcasted sister station KFXN-FM broadcast what format?",
        "response": "sports talk",
        "source": "hotpot_qa"
    },
    {
        "query": "Boris Groysberg is the Richard P. Chapman Professor of Business Administration at Harvard business school in which state?",
        "response": "Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American beach is the location of the race track where the first American rider to finish on the podium in a Grand Prix event placed?",
        "response": "Daytona Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the school that  Raoul Alexander Mulder is based in founded?",
        "response": "1853",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people were killed in the collapse of the bridge featured in the drama film, The Public Domain ?",
        "response": "13 people",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English singer from the 1960s has an album entitled Dangerous Acquaintances released in 1981?",
        "response": "Marianne Evelyn Gabriel Faithfull",
        "source": "hotpot_qa"
    },
    {
        "query": "What 3D film attraction located at Disney's Hollywood Studios was used to give guests of ElecTRONica a sneak preview of the 2010 film \"\"?",
        "response": "Muppet*Vision 3D",
        "source": "hotpot_qa"
    },
    {
        "query": "This America actress, best known for \"Parks and Recreation\" was what character?",
        "response": "Ann Perkins",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahmad Kola is in a country with how many inhabitants?",
        "response": "79.92 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: Who as collaborated musically with both Leo Abrahams and Art Garfunkel?",
        "response": "Paul Simon",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor from the TV actor from the series \"Harry and the Hendersons\"  starred in a movie with Arnold Schwarzenegger?",
        "response": "Kevin Peter Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "which Magazine was founded first, First for Women or Hennes ?",
        "response": "Hennes",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie features interviews with the founder of the Isha Foundation?",
        "response": "ONE: The Movie",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Meru and Outfoxed in the same genre of film?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Es ist ein Ros entsprungen was covered by Manheim Steamroller on what album that was released in 1988, and was the last album to feature Eric Hansen as a member of the band?",
        "response": "A Fresh Aire Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog is from Europe, the Polish Tatra Sheepdog or Cimarrón Uruguayo?",
        "response": "Polish Tatra Sheepdog",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the writer of the movie that starred Daniel Radcliffe as Igor?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What record was taken from Makes Me Wonder by an American Idol winner 2002?",
        "response": "biggest jump to number-one in the history",
        "source": "hotpot_qa"
    },
    {
        "query": "The Collection at RiverPark is anchored by Target and an American supermarket chain that features foods without what type of fat?",
        "response": "hydrogenated",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Dutch football manager and former footballer  who was among the key players in 2004–05 FC Bayern Munich season born? ",
        "response": "9 March 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian actress, born July 28, 1969, starred in the film \"Moscow Does Not Believe in Tears\"?",
        "response": "Yuliya Menshova",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's record did an Atlanta Falcons running back break for Indiana University's most yards rushed in a single season?",
        "response": "Vaughn Dunbar",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the real name of the jester of the last French monarch of the House of Valois?",
        "response": "Jean-Antoine d'Anglerais",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Syagrus and Dillwynia which one is more widely spread?",
        "response": "Syagrus",
        "source": "hotpot_qa"
    },
    {
        "query": "Statistician Walter Francis Willcox received three degrees from a local college in Massachusetts. Which college?",
        "response": "Amherst College",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Carludovica and Beech native to the same continents?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two was most viewed Zeitgeist or The Civil War?",
        "response": "The Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of Williamson County Regional Airport and Dothan Regional Airport, which airport is more north on the map?",
        "response": "Williamson County Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2016 of the borough in which Allan R. Bomhard was born ?",
        "response": "2,629,150",
        "source": "hotpot_qa"
    },
    {
        "query": "Remi Eriksen is the current Group President and Chief Executive Officer in a company of how many people?",
        "response": "13,550 employees",
        "source": "hotpot_qa"
    },
    {
        "query": "The film Trouble Every Day which feature the soundtrack Trouble Every Day is direct by who?",
        "response": "Claire Denis",
        "source": "hotpot_qa"
    },
    {
        "query": "Heike Makatsch played Dr. Lisa Addison in what film?",
        "response": "Resident Evil",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a vegetarian dish well known in Chinese and Buddhist cuisine made from Tremella frondosa?",
        "response": "Buddha's delight",
        "source": "hotpot_qa"
    },
    {
        "query": "Between what years was the son of Yuk Young-soo president of South Korea?",
        "response": "2013 to 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Phlebodium and Pieris both species of ferns?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " WDAL is a country music radio station licensed to a city in what Georgia county?",
        "response": "Whitfield County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the car company founded by Xia Heng that uses an energy storage device that can be recharged by plugging it in to an external source of electric power to power the vehicles?",
        "response": "Xiaopeng Motor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2009 film is the second in a series by Luc Besson, after \"Arthur and the Invisibles\"?",
        "response": "Arthur and the Revenge of Maltazard",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the psychological horror film \"The Others\", which featured James Bentley as Nicholas Stewart?",
        "response": "Alejandro Amenábar.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian-born Australian politician filled the vacancy left by the retirement of the Australian former politician who served as a member of the New South Wales Legislative Council between 1991 and 2011?",
        "response": "Walter \"Walt\" Secord",
        "source": "hotpot_qa"
    },
    {
        "query": "The character Samantha Jones from \"Sex and the City\" was escorted by whom at the 2nd Genie Awards?",
        "response": "Prime Minister Pierre Trudeau",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book inspired the film that contains Rob Thomas's 2007 single \"Little Wonders?\"",
        "response": "A Day with Wilbur Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an English poet: Philip Larkin or Lincoln Steffens?",
        "response": "Philip Arthur Larkin",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the movement took place which spread beyond the United States through the writings of Steve Biko in South Africa?",
        "response": "mid-1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "What city's suburbs was Julia Margaret Guerin Halloran Lavende born in?",
        "response": "Melbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "The representative of the Texas district that includes Montgomery County and Walker County was born in what year?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the island at the center of the area overseen by the Port Authority of New York and New Jersey?",
        "response": "Liberty Island",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city in which Staffan Scheja was the awardee at the international Ferruccio Busoni International Piano Competition in 1975?",
        "response": "105,713",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Your Highness and Justin Theroux have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Hip Hop Connection was considered the best magazine in the world by which rapper and author?",
        "response": "Carlton Douglas Ridenhour",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song from Journey's album \"Escape\" charted on the United Kingdom Top 40 when it was re-released in 2009?",
        "response": "Don't Stop Believin'",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the 9th FINA Swimming World Championships (25 m) held in an indoor or outdoor arena?",
        "response": "an indoor arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of this 1977 American musical drama film starring Adrienne King and John Travolta?",
        "response": "John Badham",
        "source": "hotpot_qa"
    },
    {
        "query": "Who resides inside the haunted manor that has the theme song \"Grim Grinning Ghosts\"?",
        "response": "\"999 happy haunts\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the softcore pornography Marika Green was in?",
        "response": "Just Jaeckin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is from a country closer to Canada, Alessandro Blasetti or Frank Tashlin?",
        "response": "Frank Tashlin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occasional home of Minnesota Golden Gophers baseball, has a commuter rail route that runs to it?",
        "response": "a baseball park",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the New Zealand actor starred in Dirty Deeds born? ",
        "response": "14 September 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Which multi-touch, slate-format smartphone has a S Voice intelligent personnal assistant and knowledge navigator that was launched in 2012?",
        "response": "Samsung Galaxy S III",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film with LaVita Raynor  played Kionna?",
        "response": "Hype Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who played Jamie Rellis in the 2011 American romantic comedy also played Solara in what movie?",
        "response": "The Book of Eli",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the FIFA World Cup winner known as Big Phil that Flávio Murtosa works as an assistant coach for?",
        "response": "Luiz Felipe Scolari",
        "source": "hotpot_qa"
    },
    {
        "query": "Gray, Kentucky is a community 4.9 miles west of a city with a city population of what, as of the 2010 census?",
        "response": "7,304",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the altitude of the castle that sits atop of a hill in the city where the history of rail transport in Austria began?",
        "response": "506 m.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who translated into Italian the opera mentioned in the final story of a 1914 collection? ",
        "response": "Giuseppe Zaffira",
        "source": "hotpot_qa"
    },
    {
        "query": "What university did Bill Daly graduate that Gary Bettman also graduated from?",
        "response": "New York University School of Law",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American engineer and former astronaut travelled to the moon alongside Neil Armstrong, Michael Collins, and Edwin E. Aldrin, Jr. as a member of Apollo 11?",
        "response": "Buzz Aldrin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player is older, Heinz Günthardt or Renáta Tomanová?",
        "response": "Renáta Tomanová",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the NASDAQ ticker code for Spirit Airlines, based at Detroit Metro Airport among others and an ultra low cost carrier?",
        "response": "SAVE",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is the ski resort owned by American Skiing Company in Western Maine ?",
        "response": "Carrabassett Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "What viliage in the North Kesteven district of Lincolnshire, England hosts the title Ferrers Baronetcy created in 1628?",
        "response": "Skellingthorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "The Oracle is a character in a movie created by two directors who made their directing debut when? ",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "Which running bank was drafted by the 1983 Los Angeles Rams and later was inducted into the Hall of Fame?",
        "response": "Eric Demetric Dickerson",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the singer-songwriter who released \"Metals\" in 2011 born? ",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Tachu Naito was the father of earthquake-proof design, and built many broadcasting and observation towers, including what communications and observation tower in the Shiba-koen district of Minato, Tokyo, Japan?",
        "response": "Tokyo Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "From what animated movie did a cast member from \"Saturday Night Live\" do the voice of a character named Donkey?",
        "response": "\"Shrek\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The current U.S. Representative of the Texas district that includes Walker County was born in what year? ",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played a lead role in the television series based on Sir Arthur Conan Doyle's detective stories?",
        "response": "Kang Soo-jin",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Cuthbert's Co-operative Society followed the set of ideals first set out in what year?",
        "response": "1844",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mount Everest and Masherbrum both mountains?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Buddy Murphy and Wesley Blake are both professional what?",
        "response": "professional wrestler",
        "source": "hotpot_qa"
    },
    {
        "query": "Maurice Hines and his brother were famous for what?",
        "response": "dancer Gregory Hines",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the player that was selected first by the Portland Blazers in the 1984 draft?",
        "response": "7 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Russell Springs is a home rule-class city in Russell County, Kentucky, in the United States, the city is the gateway to which one of the largest man-made lakes in the region, a reservoir in Kentucky?",
        "response": "Lake Cumberland",
        "source": "hotpot_qa"
    },
    {
        "query": "Jessica Boone, is an American actress with extensive experience in Shakespeare and musical theatre, Boone is also an accomplished voice actress known throughout the anime world for her work voicing hundreds of characters in Japanese animated series such as who, in Highschool of the Dead?",
        "response": "Rei Miyamoto",
        "source": "hotpot_qa"
    },
    {
        "query": "In what war did the man who narrated The Great American West fight?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed A Guide for the Married Man and what is their full name?",
        "response": "Eugene Curran Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer also enjoyed boxing, Amy Tan or Norman Lindsay?",
        "response": "Norman Alfred William Lindsay",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of directors George Cukor and John Greyson?",
        "response": "George Dewey Cukor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country, that neighbors Chile, aired the comedy television show \"Lalola\"  from August 2007 to April 2008?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name ofthe head coach Dick Parsons' worked under as assistant coach for the Kentucky Wildcats men's basketball team?",
        "response": "Beasman",
        "source": "hotpot_qa"
    },
    {
        "query": "which global hospitality and entertainment company is opening their new location in National Harbor, Maryland?",
        "response": "MGM Resorts International",
        "source": "hotpot_qa"
    },
    {
        "query": "What position is played by the football player who was reportedly healed by Mariana Kovacevic during the 2012 African Cup of Nations?",
        "response": "striker",
        "source": "hotpot_qa"
    },
    {
        "query": "The Herford East branch line is part of a collection of London consumer routes called the Lea Valley lines that run along which river?",
        "response": "River Lea",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the record company that released the Strokes' debut studio album?",
        "response": "Gordon Raphael and Paul Harrison",
        "source": "hotpot_qa"
    },
    {
        "query": "What coach of the Miami Hurricanes in 2002, lead the team to victory in the Rose Bowl over Nebraska?",
        "response": "Larry Coker",
        "source": "hotpot_qa"
    },
    {
        "query": "What episode was directed by Jim Reardon and also inspired the sixteenth episode of another animated series?",
        "response": "22 Short Films About Springfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Apple store coupon and credit card feature announced, that came with the eighth major iOS mobile update?",
        "response": "2012 Apple Worldwide Developers Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "The City of Onkaparinga has a council that has area offices situated in the suburb approximately how far from the city center?",
        "response": "20 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Mana's favorite drummers played in the band Deep Purple?",
        "response": "Ian Paice",
        "source": "hotpot_qa"
    },
    {
        "query": "What band played a song called \"Pink Turns to Blue\", which was written by an American musician and drummer?",
        "response": "Hüsker Dü",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the screenplay that Lee Towndrow worked as a visual effects artist on and directed by Todd Haynes?",
        "response": "Phyllis Nagy",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the actor born that starred in both Duel at Diablo and Space Cowboys?",
        "response": "1928",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the role of Nettie Harris in the 1985 film directed by Steven Spielberg?",
        "response": "Akosua Gyamama Busia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was founded first, Spider or Multinational Monitor?",
        "response": "Multinational Monitor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Armenian was also American, Konstantin Orbelyan or Haig P. Manoogian?",
        "response": "Haig Manoogian",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of Tars and Spars, an American romantic comedy, portrayed Daniel Pontipee in \"Seven Brides for Seven Brothers\"?",
        "response": "Marc Platt",
        "source": "hotpot_qa"
    },
    {
        "query": "What award was Australian entrepreneur that founded the company Dickheads awarded in 2015?",
        "response": "Companion of the Order of Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which non profit practice and medical research group based in Rochester, Minnesota was founded by William Worrall Mayo?",
        "response": "The Mayo Clinic",
        "source": "hotpot_qa"
    },
    {
        "query": "What's Golden was included in an open world racing video game that was developed by Playground Games and published by who?",
        "response": "Microsoft Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "In which Florida county is El Rio del Tiempo located?",
        "response": "Orange County",
        "source": "hotpot_qa"
    },
    {
        "query": "Jerry and the Lion was a short based on which animated series?",
        "response": "Tom and Jerry",
        "source": "hotpot_qa"
    },
    {
        "query": "From where was the Swedish heavy metal band which was compared to Methods to End It All?",
        "response": "Stockholm",
        "source": "hotpot_qa"
    },
    {
        "query": "How many acres does Luna Park cover?",
        "response": "3.1 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Meet the Robinsons is Different from Herbie Goes to Monte Carlo how?",
        "response": "computer-animated science fiction comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the American comedy-drama television series which its consisted of 12 episodes premiered ",
        "response": "March 31, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American film and theatre producer and writer who was best known for producing Jaws and produced A Few Good Men on Broadway?",
        "response": "David Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Coddingtown Mall is owned by the company that also owns what enclosed shopping mall?",
        "response": "Santa Rosa Plaza",
        "source": "hotpot_qa"
    },
    {
        "query": "Who runs the park where King Arthur Carrousel is located?",
        "response": "The Walt Disney Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie, based on a cartoon character by Seymour Reit and Joe Oriolo, did Deanna Oliver and Sherri Stoner work on?",
        "response": "\"Casper\" (1995)",
        "source": "hotpot_qa"
    },
    {
        "query": "What group owns the hotel that is set to be demolished in 2020?",
        "response": "Jardine Matheson Group",
        "source": "hotpot_qa"
    },
    {
        "query": "What century was Konstantin Somov born into a family of a Hermitage Museum curator?",
        "response": "18th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "Since 2015 Rohrmoos-Untertal is a part of a former mining town that is now a popular what?",
        "response": "tourist destination",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the eleventh episode of the 4th season of this Pendleton Ward Show in 2012?",
        "response": "Ako Castuera and Jesse Moynihan",
        "source": "hotpot_qa"
    },
    {
        "query": "Monaco national basketball team has always represented in this multi-sport event launched by who",
        "response": "Republic of San Marino",
        "source": "hotpot_qa"
    },
    {
        "query": "What Lindsey Stirling song's video received 1.3 million views on YouTube after one day?",
        "response": "Shatter Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died later: William Saroyan or Fred Agabashian?",
        "response": "Levon \"Fred\" Agabashian",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Thomas is best known for his work on an MGM owned and operated resort built on the site of what demolished hotel and casino?",
        "response": "Dunes",
        "source": "hotpot_qa"
    },
    {
        "query": "Werewolves of Highland and Crying were both aired on which cable television network?",
        "response": "MTV",
        "source": "hotpot_qa"
    },
    {
        "query": "Professor George W. Bernard typically debates with an English constitutional historian about which historical event?",
        "response": "reign of King Henry VIII",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the mission, piloted by the seventh man in space, occur?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Jenny Lewis discography is the lead singer of what American indie rock band based in Los Angeles",
        "response": "Rilo Kiley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  British politician from Northern Ireland who is a Democratic Unionist Party Member of Parliament for East Antrim represents the constituency known as East Antrim?",
        "response": "Sammy Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American beauty pageant titleholder is from a city in Mississippi with a current population of over 25,000?",
        "response": "Sarah Beth James",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did a television broadcaster replace as head coach of the Seattle SuperSonics?",
        "response": "Bob Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the top three scoring flying aces of all time died on 8 January 1983? ",
        "response": "Gerhard Barkhorn",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the son of Manning M. Kimmel removed from command?",
        "response": "December 1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was this debut single by this rapper who also released \"Congratulations\" released?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrongfully convicted boxer did Bob Dylan write a song about?",
        "response": "Rubin \"Hurricane\" Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the biographer and one-time student of this British physicist and mathematician who discovered the Taylor–Proudman theorem along with Joseph Proudman?",
        "response": "George Batchelor",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor born in 1938 starred in the 1972 film Deliverance?",
        "response": "Jon Voight",
        "source": "hotpot_qa"
    },
    {
        "query": "What book did the writer of the song \"Palisades Park\" write?",
        "response": "Confessions of a Dangerous Mind",
        "source": "hotpot_qa"
    },
    {
        "query": "What brewery formed in 1909 is the is the oldest independent brewery in Texas?",
        "response": "Spoetzl Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both dog breeds, Istrian Shorthaired Hound and Cretan Hound, originating from Europe ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chinese compendium that contains the \"Neiye\" is traditionally attributed to what statesman?",
        "response": "Guan Zhong",
        "source": "hotpot_qa"
    },
    {
        "query": "Between William Saroyan and Hampar Kelikian, who won more prestigious awards in their fields?",
        "response": "William Saroyan",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Oz, who worked closely with American theatre and film director Jack Smight, was known for being the puppeteer and voice of which Star Wars character?",
        "response": "Yoda",
        "source": "hotpot_qa"
    },
    {
        "query": "Salah \"Entertainer\" Benlemqawanssa (born June 28, 1979), also known as Spider Salah, is an award-winning competitive hip-hop dancer from France who won the inaugural season of \"La France a un incroyable talent\", he calls his personal dance style P.A.B.E., P stands for which original  street dance and one of the original funk styles that came from Fresno, California during the late 1960s–1970s?",
        "response": "Popping",
        "source": "hotpot_qa"
    },
    {
        "query": " Are both The Caribbean Pioneer and Time published at the same frequency?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What order is the wizard in  Lord of the Rings: Journey to Rivendell part of?",
        "response": "Istari",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Jan Baptist van Renseelaer's father's profession?",
        "response": "diamond and pearl merchant",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth year of the son of Charles Frederick Menninger who died in 1990?",
        "response": "1893",
        "source": "hotpot_qa"
    },
    {
        "query": "Sid Owen appeared in the tenth series of a show that launched in what year?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the bank which currently majority owns Euroinvestor founded?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Syosset Central School District and Jericho Union Free School District are both located in what county?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Unix Programming Environment was published by a company that is owned by who?",
        "response": "Pearson PLC",
        "source": "hotpot_qa"
    },
    {
        "query": "The UN Campus, Bonn was opened by Secretary-General that served when?",
        "response": "January 1997 to December 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Danielle Ryan (born 1983) is an Irish heiress, being the daughter of Capt. Cathal Ryan and granddaughter of Tony Ryan,  co-founder of Ryanair with Christy Ryan and Liam Lonergan, and founder of GPA, which is an acronym for ?",
        "response": "Guinness Peat Aviation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Les McKeown and Lauren Laverne both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Full Bloom is the fourth Korean studio album by a band whose name comes from what greek word?",
        "response": "\"chara\"",
        "source": "hotpot_qa"
    },
    {
        "query": "An upcoming untitled American space Western film centered on Han Solo, a character from the \"Star Wars\" franchise, is in production and being produced by Lucasfilm, the film stars includes Joonas Viljami Suotamo, a Finnish basketball player and actor, born on which date?",
        "response": "October 3, 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "The film directed by Dan Attias and produced by Dino De Laurentiis was inspired by which ancient folklore?",
        "response": "Werewolf Priest",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Olympic ski jumper is a stunt jumping world record holder for jumping over 6 buses and demonstrated the ski jump on a British television series?",
        "response": "Eddie \"The Eagle\" Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "Speedpass was originally created by a corporation headquartered in what California city?",
        "response": "San Jose",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Commissioner and former Governor of South Australia born who was also chancellor of the University of Adelaide?",
        "response": "4 May 1952)",
        "source": "hotpot_qa"
    },
    {
        "query": "What held on June 26, 2002, at The Theater at Madison Square Garden, was a Czech professional basketball player with ČEZ Nymburk drafted by the Philadelphia 76ers?",
        "response": "2002 NBA draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Stockdale and Andy Childs, have which occupations in common?",
        "response": "singer and songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "What town did Sean Robert Francis play in as part of the most successful club in the Republic of Ireland?",
        "response": "Tallaght, South Dublin",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Wikstroemia or Witch-hazel have more species?",
        "response": "Wikstroemia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American martial arts/buddy action comedy film  was  Less Than an Hour  first heard in the final credits of ",
        "response": "Rush Hour 3",
        "source": "hotpot_qa"
    },
    {
        "query": "Barry Allen Drew is a part of which professional wrestling tag team?",
        "response": "Demolition",
        "source": "hotpot_qa"
    },
    {
        "query": "Davey Moore (9 June 1959 – 3 June 1988) was an American world junior middleweight champion boxer, the second of two professional champions who shared the name in the second half of the 20th century, the first Davey Moore (born 1933) as a result of punishment in a fight, the second in an accident at his home, David S. \"Davey\" Moore (November 1, 1933 – March 25, 1963) was an American featherweight world champion boxer who fought professionally, during which time period?",
        "response": "1953–63",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kevin Woo and Róisín Murphy both record producers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Underfist: Halloween Bash was going to be the setup for a new series spin-off but the contract expired with a cable and television station that was launched on October 1, 19962 by whom?",
        "response": "Betty Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "The title of Gordon Kuhrt at St John the Baptist Shenstone and Emmanuel is a representative, deputy or substitute, which also appears in a number of Christian ecclesiastical contexts, but also as an administrative title, or title modifier in which regime?",
        "response": "Roman Empire",
        "source": "hotpot_qa"
    },
    {
        "query": "Toni Lopopolo is a literary agent whose book publishing career began in 1970 in the publicity department of Bantam Books, where she helped publicize authors such as which English author of romance novels, one of the best-selling authors as well as one of the most prolific and commercially successful worldwide of the twentieth century, with her 723 novels were translated into 38 languages and she continues to be referenced in the \"Guinness World Records\" for the most novels published in a single year in 1976?",
        "response": "Barbara Cartland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog, the West Siberian Laika or the Sussex Spaniel, can be slow-paced, but can have a clownish and energetic temperament?",
        "response": "The Sussex Spaniel",
        "source": "hotpot_qa"
    },
    {
        "query": "Van Andel Institute was founded in part by what American businessman, who was best known as co-founder of the Amway Corporation?",
        "response": "Jay Van Andel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are High School and 16 Days in Afghanistan both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released the song \"With or Without You\" first, Jai McDowall or U2?",
        "response": "U2",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Lin-Manuel Miranda and Million Dollar Arm have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "what the real name of the welsh electronic music producer DJ who have been visited the night club called Flex in vienna hundreds of times?",
        "response": "Lincoln Barrett",
        "source": "hotpot_qa"
    },
    {
        "query": "What company released the album containing Taylor Swift's song Innocent?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Salvadoran beauty queen lost to Ximena Navarrete in the 2010 Miss Universe pageant?",
        "response": "Sonia Yesenia Cruz Ayala",
        "source": "hotpot_qa"
    },
    {
        "query": "In which place does this house of the Parliaments of United Kingdom meet of which Dunfermline was a county constituency of from 1974 until 1983?",
        "response": "Palace of Westminster",
        "source": "hotpot_qa"
    },
    {
        "query": "Which famous TV studio did Brian Sheesley work out of with Peter Browngardt?",
        "response": "Cartoon Network Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the sequel, 1313 Dead End Drive or Mastermind?",
        "response": "1313 Dead End Drive is a murder-themed board game from Parker Brothers.",
        "source": "hotpot_qa"
    },
    {
        "query": "The 59th Berlin International Film Festival had an opening film of which 2009 political thriller?",
        "response": "The International",
        "source": "hotpot_qa"
    },
    {
        "query": "Fantasy Zone II: The Tears of Opa-Opa was released for the NES in what year?",
        "response": "2008.",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Frank Pierson and István Szabó have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the novel written which the 1931 film Huckleberry Finn was based upon?",
        "response": "1884",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the On Giants' Shoulders author born?",
        "response": "6 October 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Canada Dry and Aquafina both carbonated beverages?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "who is Léonce Perret and Alexander Payne connected?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Marcin Gortat was a second-round draft choice of the Phoenix Suns in in draft that where how many players had filed as early-entry candidates?",
        "response": "11",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company has more direct relationships to end-users of their product, American Electric Power or Chesapeake Energy?",
        "response": "American Electric Power",
        "source": "hotpot_qa"
    },
    {
        "query": " Sheila Mullen is a Scottish painter whose works are in the permanents collection of the senior patrilineal descendant of who?",
        "response": "James, Duke of Monmouth",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this mall with 90 stores and anchored by Boscov's, Lord & Taylor and Sears located near East Gate Square?",
        "response": "Moorestown Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "What country rock band is headed by guitarist Steve Ripley?",
        "response": "The Tractors",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Disney Infinity 3.0\", was released on August 30, 2015, and introduced support for a digital media player sold by which company ?",
        "response": "Apple Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the 2012 sales of the company for which Hubert Joly was a former president, CEO, and director?",
        "response": "$37.6 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Farley was the grandson of the man who worked at the Ford plant located in what city?",
        "response": "Dearborn, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Curious George was a TV series that led to a film directed by whom?",
        "response": "Matthew O'Callaghan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the managers for the Chinese actor who appears in The Three-Body Problem alongside Zhang Jingchu?",
        "response": "Huayi Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "which star of The Caine Mutiny was born on August 25, 1916 ?",
        "response": "Van Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine comes out most often, Contempo Magazine or Árran?",
        "response": "Contempo Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the parents of the goddess the title of the final novel of the \"Percy Jackson & the Olympians\" series refers to?",
        "response": "Cronus and Rhea",
        "source": "hotpot_qa"
    },
    {
        "query": "What did one member of the third set of co-anchors for \"American Morning'\" specialize in? ",
        "response": "science, technology, and aerospace.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name Myddle Class' lead singer who co-wrote several Billboard songs?",
        "response": "Carole King",
        "source": "hotpot_qa"
    },
    {
        "query": "What rock band was formed in 1983 and sang \"Snow ((Hey Oh))\"?",
        "response": "Red Hot Chili Peppers",
        "source": "hotpot_qa"
    },
    {
        "query": "What awards did the creator of a musical based on the 1957 movie of the same name, become only one of two people to win along with Emmy, Grammy, Oscar and Tony awards?",
        "response": "Pulitzer Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph E. \"Jeb\" Bradley (born October 20, 1952) is an American politician and member of the Republican Party who currently serves as the Majority Leader of the New Hampshire Senate, the New Hampshire Senate has been meeting since when?",
        "response": "1784",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a drink named celebrating a train which ran between New York City and Chicago: Sundowner or 20th Century?",
        "response": "20th Century",
        "source": "hotpot_qa"
    },
    {
        "query": "What state is both the Freeport Station and the Portland Transportation Center located?",
        "response": "Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Philip Solomon work with which well-known medium who best known for his work on \"Most Haunted\"?",
        "response": "Derek Acorah",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the cast of the television series \"Blue Bloods\" on CBS has also voiced Ernest Hemingway in a 2013 documentary called Cooper & Hemingway: The True Gen?",
        "response": "Len Cariou",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the studio for the record label who released Snoop Doggy Dogg's \"Doggystyle\" located?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What cartridge, also known as 9 mm Luger by the C.I.P. or 9 mm NATO by NATO, is used in the submachine gun the MP 40?",
        "response": "9×19mm Parabellum",
        "source": "hotpot_qa"
    },
    {
        "query": "Jane Marie Andrée Rhodes sang Renata in the first recorded performance of an opera that could be  considered one of the composer’s what?",
        "response": "largest challenges",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is younger, Shirley Manson or Jim Kerr?",
        "response": "Shirley Ann Manson",
        "source": "hotpot_qa"
    },
    {
        "query": "George B. Fitch inspired the 1993 comedy sports film directed by whom?",
        "response": "Jon Turteltaub",
        "source": "hotpot_qa"
    },
    {
        "query": "The Carraresi (or da Carrara) were an important family of northern Italy in the 12th to 15th centuries, Francesco il Vecchio, son of Giacomo, a close friend of Petrarch in his early years, was a noted patron of Petrarch himself, his retirement years were spent at Arquà, a Carrara fief, and he bequeathed to Francesco his picture of the Virgin by which Italian painter and architect from Florence during the Late Middle Ages?",
        "response": "Giotto di Bondone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is also a Disney film, Condorman or Rob Roy, the Highland Rogue?",
        "response": "Rob Roy, the Highland Rogue",
        "source": "hotpot_qa"
    },
    {
        "query": "The polymath who described the Rufus snake-eel in 1810 was self-educated in what country?",
        "response": "France",
        "source": "hotpot_qa"
    },
    {
        "query": "The last Republic serial made about a superhero stars what actor in the title role?",
        "response": "Richard Gerald \"Dick\" Purcell Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Tutu Jones (born September 9, 1966) is an American electric blues and soul blues guitarist, singer and songwriter, she has cited  Freddie King (September 3, 1934 – December 28, 1976), as an influence on his playing style, he was an American blues guitarist and singer, he has been described as one of the \"   \" of electric blues guitar?",
        "response": "Three Kings",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the profession of JC Chasez and Annie Lennox?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "James West trialled with a football team now known as what?",
        "response": "Arizona Cardinals",
        "source": "hotpot_qa"
    },
    {
        "query": "After departing the boy band One Direction, who debuted a studio album with its lead single \"Pillowtalk\"?",
        "response": "Zayn Malik",
        "source": "hotpot_qa"
    },
    {
        "query": "J. Searle Dawley and Genndy Tartakovsky, have which mutual occupations?",
        "response": "director and screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which motorway is close to St Lawrence's Church that is 18.9 mile long?",
        "response": "M53 motorway",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport does 1957 FA Charity Shield and Old Trafford have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "What German sport club based in Hamburg is associated with Ole Bjørnmose?",
        "response": "Hamburger SV",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the Barack Obama \"Joker\" poster based on the Australian actor and director Heath Ledger's portrayal in \"The Dark Knight\"?",
        "response": "Firas Alkhateeb",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the album released on April 10, 2006 featuring Dwane Husbands?",
        "response": "A Girl like Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Which episode follows Southpark's November 13, 2013 episode?",
        "response": "\"A Song of Ass and Fire\"",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Self Banished\" is a poem written by a poet born in what year ?",
        "response": "1606",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the only high school in the school district that has a student-to-teacher ratio of 13 to 1 ?",
        "response": "Schenectady High School",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the player that is featured on the cover of the German version of the video game \"NBA 2K16\"?",
        "response": "6 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "What province of Australia is The Hoddle Bridge located in?",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Upper Crust Pizzeria and Eatza Pizza restaurants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Have both Mahesh Bhupathi and Jamie Murray won Grand Slam tournaments?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What American composer wrote \"Come to the Sunshine\"",
        "response": "Van Dyke Parks",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the VTech Laser 200 and the ABC 80 both made in sweden? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who provides the voice for \"Chef\" in the Comedy Central series \"South Park\" on the \"Starvin Marvin\" episode where Chef tries to get residents to fight back in a parody of the movie Braveheart?",
        "response": "soul singer Isaac Hayes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a director and a screenwriter, Chris Menges or Howard Hawks?",
        "response": "Howard Winchester Hawks",
        "source": "hotpot_qa"
    },
    {
        "query": " Which physicist is associated with Photography in Luxembourg and developed a method to reproduce colors photographically based on the phenomenon of interference?",
        "response": "Gabriel Lippmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Nadège du Bospertus was the muse of an Italian fashion designer who was born when?",
        "response": "2 December 194615",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Stuart Woolhouse is a biographer of a philosopher commonly known as what ?",
        "response": "Father of Liberalism",
        "source": "hotpot_qa"
    },
    {
        "query": " Hong Kong first competed at a Deaflympics that was held in what US city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has received more critical acclaim, Conrad Aiken or Paul Heyse?",
        "response": "Paul Johann Ludwig von Heyse",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the son of the winner of the Royal Medal of the Royal Society in 1971?",
        "response": "Robin Perutz",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the Master of Ceremonies of the 1971 Logie Awards?",
        "response": "23 July 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of films were the films The Devil Came on Horseback and Comic Book Confidential?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kontek HVDC is a 170 km long,high-voltage direct current cable between Germany and the Danish island Zealand, its name comes from \"continent\" and the name of the former Danish power transmission company \"Elkraft\", which operated the power grid on the Danish islands, including Lolland island that is the which largest island of Denmark?",
        "response": "fourth",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2008 San Francisco Giants included the Cy Young-winning player with what nickname?",
        "response": "The Freak",
        "source": "hotpot_qa"
    },
    {
        "query": "What play written by Tennessee Williams did Viola Keats star in?",
        "response": "A Streetcar Named Desire",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Mary Edna González sexuality? ",
        "response": "omnisexuality",
        "source": "hotpot_qa"
    },
    {
        "query": "Grace Kennedy starred in this 2005 UK production which was directed by whom?",
        "response": "George Roy Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "How many stores are contained in the shopping center in West Lakes, South Australia?",
        "response": "260",
        "source": "hotpot_qa"
    },
    {
        "query": "Claude Simon and Paul Valéry, are in which mutual industry?",
        "response": "Literature",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in Nova Scotia overtook the home community of Mildred Dixons' parents?",
        "response": "Halifax",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Wisteria and Helictotrichon both in the legume family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American actor that provided the voice for a character with the name of T'Challa?",
        "response": "James C. Mathis III",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both James Iha and Motion City Soundtrack part of the rock music industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Save the Tiger starred an American actor born July 25, 1908 who was nominated for what?",
        "response": "Academy Award for Best Supporting Actor",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the date of death of a racially charged entertainment performer",
        "response": "June 12, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Who edited the 1990 American romantic comedy film directed by Garry Marshall?",
        "response": "Raja Raymond Gosnell",
        "source": "hotpot_qa"
    },
    {
        "query": " Botanic Park, Adelaide abuts the zoo that is administered by what group?",
        "response": "Royal Zoological Society of South Australia Incorporated",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Austrian composer who composed The String Quartet No. 5 (D 68) in B-flat major born ",
        "response": "31 January 179719",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre does Standing in the Shadows of Motown and 911: In Plane Site have in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitney Avalon released her first parody as the send-up of the CeeLo Green song that was released on what date?",
        "response": "August 19, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress had roles in the movies \"Janie Jones\" and \"Signs\"?",
        "response": "Abigail Breslin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Victor Hugo Halperin or Aleksander Ford?",
        "response": "Victor Hugo Halperin",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the weapon used by Tori M. Nonaka manufactured?",
        "response": "Deutsch-Wagram, Austria.",
        "source": "hotpot_qa"
    },
    {
        "query": "New Faces of 1952 is a musical revue with songs and comedy skits, it helped jump start the career of which young performer, and American actress?",
        "response": "Carol Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": "\"In Another Land\" is the third track on an album that was released by which label ?",
        "response": "Decca Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie directed by James Gunn portrayed the fictional character, Ego the Living Planet?",
        "response": "Guardians of the Galaxy Vol. 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant has more species, Zigadenus or Fallopia? ",
        "response": "Fallopia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the only trainer killed by an animal, in the United States chain of marine mammal parks, oceanariums, animal theme parks, and rehabilitation centers?",
        "response": "Dawn Therese Brancheau",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 1972 Gator Bowl the Auburn Tigers defeated a team that plays its home games at what field?",
        "response": "Folsom Field",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was released first, YINSH or DVONN?",
        "response": "DVONN",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song had the most rappers rapping on it, Changed It or No Frauds?",
        "response": "No Frauds",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Erle Stanley Gardner and Michael Moorcock both authors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2015 Australian Open, the defending champion had reached a career high ranking of what?",
        "response": "world No. 3",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cleveland Thyagaraja Festival is a type of festival that honors a type of music in what language?",
        "response": "Telugu",
        "source": "hotpot_qa"
    }
]