[
    {
        "query": "Who played in The Hunchback of Notre Dame and born 1936?",
        "response": "Charles Kimbrough",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the most costly home in the world, Antila?",
        "response": "Mukesh Ambani",
        "source": "hotpot_qa"
    },
    {
        "query": "The Russell Subdivision is a railroad line owned by a railroad headquartered in what state?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Baltic tribe duke known as King Vester?",
        "response": "Viestards",
        "source": "hotpot_qa"
    },
    {
        "query": "The TT pistol was developed as a replacement for the gas-seal revolver produced by whom?",
        "response": "Léon Nagant",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the founder of Famous Amos from?",
        "response": "Tallahassee, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Were John Bush and Annie Haslam both lead singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1970 Lynn Anderson signed with a record label founded in what year?",
        "response": "1887",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Marguerite Duras and Maheen Zia both of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the animation studio which produces the television series that takes place at a school dubbed the \"Worst College in America\"?",
        "response": "Titmouse, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do Jan Kodeš and Pablo Cuevas play?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "SM City Xiamen is a shopping centre owned by a company that went public on what date?",
        "response": "July 5, 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Wing warping, a system for lateral aircraft control, was pioneered by the Wright brothers during their first controlled, sustained flight near which now-famous location?",
        "response": "Kitty Hawk, North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "What rock band formed in New York in 1981 worked with Martin Bisi?",
        "response": "Sonic Youth",
        "source": "hotpot_qa"
    },
    {
        "query": "The second studio album by American death metal band The Faceless, was inspired by a book by an author of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What party nominated, for President of the United States, the man who appointed Gay Kernan to the New Mexico Senate in 2002?",
        "response": "Libertarian Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathy Berberian and Marco Khan are both actors, correct?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish comedy hip-hop duo from Limerick city did Series two  introduced as reporters, bizarre weathermen and agony aunts",
        "response": "The Rubberbandits",
        "source": "hotpot_qa"
    },
    {
        "query": "Cole Williams has a 2005 American drama film called?",
        "response": "North Country",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football club does this English professional footballer born in 1997 who endorses Nike Hypervenom play for?",
        "response": "Manchester United",
        "source": "hotpot_qa"
    },
    {
        "query": "ConnectU was founded by Cameron Winklevoss, Divya Narendra, and this professional rower?",
        "response": "Tyler Winklevoss",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series aired first, Big Hero 6 or Kim Possible?",
        "response": "Kim Possible",
        "source": "hotpot_qa"
    },
    {
        "query": "Which floor leader sponsored the Tarrif Act?",
        "response": "Oscar Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Cute Poison are words on the tattoo by which British-American actor and star of Prison Break?",
        "response": "Wentworth Earl Miller III",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Selman created an action platformer video game based on the animated television series which was released in October of what year? ",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the author of the book in which Eeyore is a character?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Pushing Hands\", the green-card romantic comedy \"The Wedding Banquet\" and \"Eat Drink Man Woman\" were the first three features by which film director?",
        "response": "Ang Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: Kevin D. Williamson is the theater critic for which magazine founded in 1982?",
        "response": "The New Criterion",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicola Dickson \"Niki\" Sauvage Tsongas is an American politician whose husband lost the 1992 Democratic presidential primary to who?",
        "response": "Bill Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional wrestler is also known as Triple H?",
        "response": "Hunter Hearst Helmsley",
        "source": "hotpot_qa"
    },
    {
        "query": "The 8x8 wheeled amphibious armoured personnel carrier provided by the Sri Lanka Armoured Corps replaced which two vehicles",
        "response": "BTR-60 and BTR-70",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Petra Kvitová and Oliver Marach of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "How many kilometers of coastline does the land that the Malacoctenus hubbsi is native to have?",
        "response": "approximately 4000",
        "source": "hotpot_qa"
    },
    {
        "query": "Who of Karen Carpenter and Alexi Laiho is from farther west?",
        "response": "Karen Anne Carpenter",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is the company headquartered where Walter van de Vijver was the head of exploration and production until 2004?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American animated television series produced by Disney Television Animation whose 18th episode premiered in June, 2013?",
        "response": "Gravity Falls",
        "source": "hotpot_qa"
    },
    {
        "query": "What song sung by Rihanna was written and produced by the Jugganauts?",
        "response": "Man Down",
        "source": "hotpot_qa"
    },
    {
        "query": "When a Man Falls in Love, is a 2013 South Korean television series, starring Song Seung-heon, Shin Se-kyung, Chae Jung-an, and which South Korean actor, born on ? ",
        "response": "July 5, 1984",
        "source": "hotpot_qa"
    },
    {
        "query": "How long did the career span of the actor who starred with Mickey Rooney and Marilyn Maxwell in Off Limits?",
        "response": "nearly 80 years",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Gasland and Staten Island Catapult released in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American band produced the album 'Hot Streets' and whose founding member is praised for his Ray Charles-influenced vocal style?  ",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Quantum Hoops and The Corporation both documentaries ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Davy Crockett, King of the Wild Frontier:and Herbie Rides Again were both by which company?",
        "response": "Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Colossians 2 is in what number book of the New Testament?",
        "response": "twelfth",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released an album named 'Warrior' and has co-written 11 released songs with her own mother?",
        "response": "Kesha",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera was performed first, Thaïs or Euryanthe?",
        "response": "Euryanthe",
        "source": "hotpot_qa"
    },
    {
        "query": "Founder, Chairman and CEO of SBE Entertainment group, Sam Nazarian is involved in a partnership with what organizer of major dance music festivals?",
        "response": "Insomniac Events",
        "source": "hotpot_qa"
    },
    {
        "query": "Camelots du Roi was a youth organization of which far-right movement and journal?",
        "response": "Action Française",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the base where the 413th Flight Test Group is stationed named after?",
        "response": "Brig Gen Augustine Warner Robins",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Brewer is a former American football player, He played quarterback for the University of Texas Longhorns during the 1981 and 1982 season, The University of Texas at Austin (UT, UT Austin, or Texas) is a public research university, and the flagship institution of which organization?",
        "response": "University of Texas System",
        "source": "hotpot_qa"
    },
    {
        "query": "What beauty pageant was held in Las Vegas in 2010 with Lady Mina as one of the contestants?",
        "response": "Miss Universe 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the group behind Jerry Kasenetz's 1977 hit formed?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the physician and chemist, who was the first to recognize the distinction between heat and temperature, hold at the University of Glasgow?",
        "response": "Professor of Anatomy and Chemistry",
        "source": "hotpot_qa"
    },
    {
        "query": "The court in which the most important decisions of the \"Black Book of the Admiralty\" where established under a monarch who was also known as the what of Scots?",
        "response": "Hammer",
        "source": "hotpot_qa"
    },
    {
        "query": "Montgomery Regional Airport and Dane County Regional Airport, are which type of airport?",
        "response": "civil-military",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the operating years of this British train operating company that was the last operator of King's Cross Thameslink railway station?",
        "response": "April 2006 to September 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Which type of flowering plant is commonly used as a spice in Middle Eastern cuisine, Sumac or Gentianopsis?",
        "response": "Sumac",
        "source": "hotpot_qa"
    },
    {
        "query": "What show featuring Homer, Bart and Lisa lampoons American culture by going on vacation in Itchy & Scratchy Land?",
        "response": "The Simpsons",
        "source": "hotpot_qa"
    },
    {
        "query": "What modern Japanese martial art was developed by Morihei Ueshiba, often referred to as\"the founder\" \"Kaiso\" or \"Ōsensei\"?",
        "response": "Aikido",
        "source": "hotpot_qa"
    },
    {
        "query": "Greg Monroe was the last last Pistons player to wear the #10 jersey, after the Pistons retired the number fora player known by what nickname?",
        "response": "\"The Worm\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting for the television drama in which the man playing Sir Richard Carlisle in \"Downton Abbey\" played the title role?",
        "response": "Galway",
        "source": "hotpot_qa"
    },
    {
        "query": "What film other than the 2007 American computer-animated science fiction comedy film produced by Walt Disney Animation Studios was produced during Stainton's tenure?",
        "response": "\"Chicken Little\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of aircraft can be used in congested or isolated areas and is used at Langley Regional Airport?",
        "response": "Helicopter",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Trivor and Rakaposhi in Pakistan?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Vinko Brešan and Robert Greenwald, share which industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which village in New South Wales, Australia has a larger population, Mogriguy or Dubbo?",
        "response": "Dubbo",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Watertown International Airport and Alexandria International Airport both airports in the same state ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the author of The Mummy's Foot die?",
        "response": "1872",
        "source": "hotpot_qa"
    },
    {
        "query": "The 249th episode of \"The Simpsons\" was aired on what date?",
        "response": "November 1, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Thomas Schlamme and Hobart Henley share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Conquest is a 1937 Metro-Goldwyn-Mayer film staring a British character actor for his many roles in British and American films and later in what?",
        "response": "television programmes",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did this series premier that is an American animated superhero action-comedy television series and stars a fictional character named Blisstina Utonium?",
        "response": "April 4, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "South Korean actor Kim Yool-ho starred in what 2016 movie directed by Yeon Sang-ho Yeon Sang-ho and starring actors Gong Yoo, Jung Yu-mi, and Ma Dong-seok?",
        "response": "Train to Busan",
        "source": "hotpot_qa"
    },
    {
        "query": "James Patrick Aylward, was a Missouri attorney, Democratic party leader, and a political associate of Harry S. Truman, he was the 33rd President of the United States (1945–53), assuming that office upon the death of Franklin D. Roosevelt during the waning months, of which historic event?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What american actress and singer born in 1910 stars in Love, Honor, and Goodbye?",
        "response": "Virginia Bruce",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football player coached by Paul Boudreau is a member of the Pro Football Hall of Fame?",
        "response": "Curtis Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "What American heist thriller film directed by Louis Leterrier and written by Ed Solomon, Boaz Yakin and Edward Ricourt did Brian Tyler compose music for?",
        "response": "Now You See Me",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the  historic market town  in which East Hertfordshire council has offices in located ",
        "response": "Hertfordshire, England.",
        "source": "hotpot_qa"
    },
    {
        "query": "Hollywood Vice Squad is a 1986 film directed by Penelope Spheeris with an early screen appearance by Robin Wright, who stars as what character in the Netflix political drama \"House of Cards\"?",
        "response": "Claire Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "The single  \"Dangerous Game\" was produced by a man that has sold approximately how many singles in the United Kingdom?",
        "response": "21 million",
        "source": "hotpot_qa"
    },
    {
        "query": " Zafir Premčević participated in a war that lasted from 28 July 1914 to when?",
        "response": "11 November 1918",
        "source": "hotpot_qa"
    },
    {
        "query": "What host of Mind of a Man is also the older brother of R&B singer Steph Jones?",
        "response": "DeRay Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "International Street is a themed area at Canada's Wonderland theme park in Vaughan, Ontario, the street ends at Wonder Mountain, a visual landmark for navigating through much of the park, a similar format is used in Kings Island theme park, albeit with a replica of the Eiffel Tower at the end of the park, it opened in which year at Kings Island?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "The year 2004 in film included major releases of sequels including the third installment based on a novel by what author?",
        "response": "J. K. Rowling",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Kissinger currently plays for an outdoor socker team that plays in which region?",
        "response": "Midwest Region",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people died in the famine that inspired the U.S. Commission on the Ukraine Famine?",
        "response": "7 million to 10 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American bass singer and actor was married to Eslanda Goode Robeson?",
        "response": "Paul Robeson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the host for which \"Winner Take All\" is best known?",
        "response": "\"Dean of Game Show Hosts\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress nicknamed \"love goddess\" starred in the 1957 musical film Pal Joey?",
        "response": "Rita Hayworth",
        "source": "hotpot_qa"
    },
    {
        "query": "Vice-Admiral Frederick Spencer, 4th Earl Spencer was made a Knight of the Garter, an order of chivalry founded by whom?",
        "response": "Edward III",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Pier Paolo Pasolini and Franco Rossi of the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film starring Patrick Tatten is based on a book written by Steve Lopez?",
        "response": "The Soloist",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Robert Plant and Brandon Flowers have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the theme of the resort where Nouvelle Expérience's tour ended in the parking lot of?",
        "response": "Polynesian-themed",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Robert Rossen or Lamont Johnson?",
        "response": "Robert Rossen",
        "source": "hotpot_qa"
    },
    {
        "query": "Christian Gertartsreiter, the subject of the film, Clark Rockefeller was how old when he moved to the United States?",
        "response": "In his late teens",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Gina Montana in \"Scarface\" stars with George Clooney and Mark Wahlberg in a 2000 film based on a book by what author?",
        "response": "Sebastian Junger",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Indian Removals in Indiana, what is the name of the tribe whose name means \"Stand here and there\"?",
        "response": "The Kickapoo people",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more occupations in the cinema industry, George Stevens or Claire Denis?",
        "response": "George Cooper Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "Strandloper was based on the story about an English convict who was transported to what country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "The front-woman for the band The Rebirth is a currently co-lead vocalist and percussionist for what band?",
        "response": "Fitz and The Tantrums",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the British television period drama which has Joanna Horton included in one of its episode began airing? ",
        "response": "14 January 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Les Patterson Saves the World was a comedy film starring the author of which autobiography?",
        "response": "My Gorgeous Life",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played a part in both Give My Regards to Broad Street and Rupert and the Frog Song?",
        "response": "Paul McCartney",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the actor playing Melody in The Little Mermaid II: Return to the Sea win an award from?",
        "response": "the Academy of Interactive Arts & Sciences",
        "source": "hotpot_qa"
    },
    {
        "query": "Band-e-Amir Dragons is named after the lakes in which Afghan national park?",
        "response": "Band-e Amir National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the fictional character in the Transfer of Power book from 1999 and in the film adaptation of \"American Assassin\"?",
        "response": "Mitch Rapp",
        "source": "hotpot_qa"
    },
    {
        "query": "Roenberg directed a movie named Bandidas starring which two actresses?",
        "response": "Salma Hayek and Penélope Cruz",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the cinnamon used in Bukkumi originate?",
        "response": "southern China",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"All the Boys Love Mandy Lane\" appeared in a superhero film directed by this director.",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "Guster on Ice was recorded at the theatre located at what address in Portland, Maine?",
        "response": "609 Congress Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the countries that competed in the  2017 Asian Quidditch Cup is abbreviated ROK?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "On which stock exchange is listed the global business process management, services and IT corporation Genpact, with 77,000 employees in 20 countries and have a campus close to the Singapore Township in India?",
        "response": "New York Stock Exchange",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 film about a serial killer who drew smiley faces on his letters to the media premiered on what network?",
        "response": "Lifetime",
        "source": "hotpot_qa"
    },
    {
        "query": "Ruth, Caldwell County, Kentucky is located near a national forest established in which year ?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Helen Fielding and Anita Loos, have which occupation in common?",
        "response": "screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the tour that accompanied the album released on November 11, 2008 by Big Machine Records?",
        "response": "The Fearless Tour",
        "source": "hotpot_qa"
    },
    {
        "query": "Bet That features, on the remix, the rapper who hails from what city?",
        "response": "Queens, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the band of the singer who released the album Going Where the Lonely Go ?",
        "response": "the Strangers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which type of accordion was played by Vladislav Zolotaryov?",
        "response": "bayan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 census of the city which has Fountain Hill, Pennsylvania as a suburb? ",
        "response": "74,982",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the channel that produces adult-oriented shows that target a 12-34 audience?",
        "response": "Corus Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the luxury hotel and casino where Caesars Palace is located between located ",
        "response": "Paradise, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "The Harrogate Bus Company is a bus operator based in Harrogate, North Yorkshire, it's a subsidiary of which bus group in England, and owns six bus companies in the Lancashire and Yorkshire regions?",
        "response": "Transdev Blazefield",
        "source": "hotpot_qa"
    },
    {
        "query": "Teresa Palmer is starred by which Swedish film director who is best known for his collective no-budget horror short films under the online pseudonym \"ponysmasher\"?",
        "response": "David F. Sandberg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Politician: An Insider's Account of John Edwards's Pursuit of the Presidency and the Scandal That Brought Him Down is a 2010 tell-all book, chronicling over a decade working behind the scenes with former North Carolina senator and presidential candidate John Edwards, which American actress and film producer, did he have an extramarital affair with?",
        "response": "Rielle Hunter",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person who discovered Palomar 4 in 1949 born?",
        "response": "November 20, 1889",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a backing vocalist on \"It Hurts to Be in Love\" , by Gene Pitney, an American singer-songwriter, musician, and sound engineer?",
        "response": "Toni Wine",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Harold C. Case serve as president before being named acting president of a private liberal arts college in California?",
        "response": "Boston University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed Reefer Madness (1936), Louis J. Gasnier or Joseph Henabery?",
        "response": "Louis Joseph Gasnier",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine has a wider distribution, Discovery Girls or GO?",
        "response": "Discovery Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the current star of Belarusian football born?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill Richardson pardoned Eliadah McCord after being convicted of what?",
        "response": "smuggling heroin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who grew up in the Caribbean island of Dominica, Nicholas Evans or Jean Rhys?",
        "response": "Jean Rhys",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the fighter jet flown by the subject of John Barron's 1980 biography?",
        "response": "Foxbat",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who starred in films like \"Splash\" and \"Forrest Gump\" produced which film that also stars Colin Hanks?",
        "response": "The Great Buck Howard",
        "source": "hotpot_qa"
    },
    {
        "query": "U.S. Route 136 in Nebraska is a spur route of the US Route that has an eastern terminus in what Ohio city?",
        "response": "Uhrichsville",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American astronaut that was part of Project Mercury who carried an 8-note Hohner harmonica and a handful of small bells aboard a Gemini 6A rocket ship?",
        "response": "Wally Schirra",
        "source": "hotpot_qa"
    },
    {
        "query": "Princess Cheonmyeong, was a princess of Silla, one of the Three Kingdoms of Korea, and is notable as the sister of Queen Seondeok of Silla, and reigned as Silla's which number ruler?",
        "response": "twenty-seventh",
        "source": "hotpot_qa"
    },
    {
        "query": "The British sitcom starring Sharon Horgan and Rob Delaney is produced by a man known for his collaborations with who?",
        "response": "Armando Iannucci",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the UC Berkeley Physics professor for whom the Born-Oppenheimer approximation is named born?",
        "response": "April 22, 1904",
        "source": "hotpot_qa"
    },
    {
        "query": "WHO WAS EMINEMS MANAGER WHEN HE RELEASED THE ALBUM THAT WAS GOING TO BE CALLED \"RELAPSE 2\"? ",
        "response": "According to Eminem's manager Paul Rosenberg and music critics, \"Not Afraid\" carries a positive message and depicts Eminem's change in direction from drugs and violence.",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Léonce Perret and Larry Cohen have in common in the film industry?",
        "response": "producer, director",
        "source": "hotpot_qa"
    },
    {
        "query": "According to the 2010 census what was the population of the town which Free Jim Mine is located?",
        "response": "5,242",
        "source": "hotpot_qa"
    },
    {
        "query": "What Christmas-themed entertainment program has existed since 1955 and is rival to Google Santa Tracker?",
        "response": "NORAD Tracks Santa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress debuted in \"The River Rat\" and also starred in \"I'm Not Rapport\"?",
        "response": "Martha Plimpton",
        "source": "hotpot_qa"
    },
    {
        "query": "What tragedy hit the singer, in 1954, who had a hit with the song Shelter of Your Arms written by Jerry Samuels ?",
        "response": "he lost his left eye in a car accident,",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Dill and Collomia endemic to the same continent ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the 1979 born guest who appeared on the album \"Twelve Reasons to Die II\" residing?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Evil controllers was featured on Game informer who was published by which monthly video magazine corporation?",
        "response": "GameStop Corp.",
        "source": "hotpot_qa"
    },
    {
        "query": "Fun and Galt Aureus both make what kind of music?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the anchor store of the GVK One mall open?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard \"Dick\" Miller, is an American character actor, who has appeared in over 100 films, Miller's main roles have been in films such as The Terminator, a 1984 American science-fiction action film directed by who?",
        "response": "James Cameron",
        "source": "hotpot_qa"
    },
    {
        "query": "Why I Love You was a song from the album collaborated on by which two American rappers?",
        "response": "Jay-Z and Kanye West",
        "source": "hotpot_qa"
    },
    {
        "query": "What band does the rhythm guitarists of the band that won the New Orleans regional polls' wife who plays bass currently play for?",
        "response": "Star & Dagger",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a 2007 South Korean crime thriller by the director of \"The Wig?\"",
        "response": "Yunjin Kim and Park Hee-soon",
        "source": "hotpot_qa"
    },
    {
        "query": "Close At Hand is the second EP by James McCartney, son of Paul and Linda McCartney, a British musician and songwriter living in London, born on which date?",
        "response": "12 September 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Illicium and Lithophragma, are native to which mutual continent?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike DuBose came to the University of Memphis after being the head coach at which college, located in Jackson, Mississippi?",
        "response": "Millsaps College",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kumi Lizard is similar to what moniter lizard that was part of a megafaunal assemblage that inhabited southern Australia during the Pleistocene?",
        "response": "Megalania",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the musician known for his work as frontman and lyricist of the progressive rock band The Mars Volta, who featured in an American rock band from Los Angeles, California, formed in 2013 ?",
        "response": "Grammy Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is something associated with Formula 5000",
        "response": "cars",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the for-profit university adjacent to Fort New Salem, and founded by Seventh Day Adventists, founded?",
        "response": "1888",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the leading actor of the Christmas movie that Rebecca Forstadt did background voices for?",
        "response": "Tim Allen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Air Force Base is based in Harrison County and stations the 403d Operations Group?",
        "response": "Keesler Air Force Base",
        "source": "hotpot_qa"
    },
    {
        "query": "Nihito Arakawa He made his mark in the twelve-round lightweight slugfest against this man who held the WBC lightweight title in what year",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were home games played for the 2003 Missouri Tigers football team who lost the Independence Bowl to Arkansas?",
        "response": "Faurot Field in Columbia, Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "Which playlist was released by OVO Sound with a song co-written with Adam Feeney? ",
        "response": "More Life",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Democratic Party politician from South Dakota was re-elected to the Senate in 1974 over a colonel in the United States Air Force who received the Medal of Honor for his actions in the Vietnam War?",
        "response": "George McGovern",
        "source": "hotpot_qa"
    },
    {
        "query": " In what sovereign states with a capital city that was named after Guadalupe Victoria, is there a species of salamander in the family Plethodontidae?",
        "response": "Tamaulipas",
        "source": "hotpot_qa"
    },
    {
        "query": "What network did Rebecca Sugars best known work air on?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event which occurred first, Michael Mantenuto was born, or Miracle was produced?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "The origin of the genre of music that Jaime Enrique Amara primarily signs was in which country?",
        "response": "Dominican Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "who initiated  a program for the upgrades of the military avionics and electronics system of its aging family of single-seat, single-engine, fighter aircraft developed and manufactured by French aircraft company Dassault Aviation?",
        "response": "Pakistan Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Italian-American composer and librettist wrote the English language opera, Maria Golovin?",
        "response": "Gian Carlo Menotti",
        "source": "hotpot_qa"
    },
    {
        "query": "The former chairman of the 2016 Hillary Clinton presidential campaign worked on what team for Barack Obama?",
        "response": "State Department Transition Team",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink contains strictly alcohol, a Bronx Cocktail or a Boilermaker?",
        "response": "boilermaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star from The Ghazi Attack won the State Nandi Award for Best Special Effects in 2006?",
        "response": "Ramanaidu Daggubati",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company, founded in 1908 has a role in picking the 1946 College Basketball All-American team?",
        "response": "Converse",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Leshan and Pizhou belong to the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the book used as the lead text formalised as the Seven Military Classics?",
        "response": "Sun Tzu",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the traditional Japanese materials for wrapping gifts?",
        "response": "Furoshiki",
        "source": "hotpot_qa"
    },
    {
        "query": "Carroll, New York, is named after which wealthy Maryland planter?",
        "response": "Charles Carroll of Carrollton",
        "source": "hotpot_qa"
    },
    {
        "query": "What was created first, Zorro or Frank and Ollie?",
        "response": "Zorro",
        "source": "hotpot_qa"
    },
    {
        "query": "What Byrds member served as a guest musician on Rock Salt & Nails",
        "response": "Gene Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jacob Hoggard and Lee Sung-min singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The top draft pick of the 1999-2000 Los Angeles Clippers season what born in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "In what province is the airport that includes a hub for a low-cost alternative Candian Airline founded in 1996 located?",
        "response": "British Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "What two models of a gaming laptop, manufactured by a company that originally purchased this line of computers from IBM in 2005, were missing a feature known as a TrackPoint?",
        "response": "Y710 and Y510",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nearest town to Echo Point and the rock formation known as the Three Sisters?",
        "response": "Katoomba",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Italian bolt-action, magazine-fed, repeating military rifle that Lee Harvey Oswald used to assassinate U.S. President John F. Kennedy?",
        "response": "Carcano",
        "source": "hotpot_qa"
    },
    {
        "query": "Which newspaper is located in the city known as the \"nest of snakes\"?",
        "response": "Novedades",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book was written by an atheist salon owner and explicitly denies the existence of God?",
        "response": "The System of Nature",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won an Academy award, Angelina Jolie Pitt, or Genndy Tartakovsky ?",
        "response": "Angelina Jolie Pitt",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did the cover athlete of the NFL Quarterback Club 96 play 13 years of his career for?",
        "response": "San Francisco 49ers",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward G. Pitka Sr. Airport and Lynchburg Regional Airport, are in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a musical based on a book by Marc Acito, Kuo, and Lorzenso Thione, in which actor Greg Watanabe played in?",
        "response": "Allegiance",
        "source": "hotpot_qa"
    },
    {
        "query": "Utterby is situated on the road that is in what English region?",
        "response": "East Midlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What president did the chairman of the Commission on Protecting and Reducing Government Secrecy serve as an advisor to?",
        "response": "Richard Nixon",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor born on January 13, 1996 played in the movie The Heist?",
        "response": "Campbell Cooley",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Weimaraner and Old Time Farm Shepherd types of dogs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the debut album for the artist that rapped one verse of Nigga What, Nigga Who?",
        "response": "Word to the Jaz",
        "source": "hotpot_qa"
    },
    {
        "query": "A Place in England is a novel by Melvyn Bragg, first published in which year?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Hingley and Michael Jackson are both what?",
        "response": "singer, songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the number two pick in the 1992 draft play most of his career for?",
        "response": "the Miami Heat",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was not running in 1895, The American Jewess or First for Women?",
        "response": "First for Women",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator of the Netflix series that stars Jeremy Northam as the character Anthony Eden?",
        "response": "Peter Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Elijah Rock\" is a genre of music created by what group of people?",
        "response": "African slaves",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Lewis Milestone and All Quiet on the Western Front have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "In between J Puttanna Kanagal and John Cassavetes, who acted in many Hollywood films, notably \"Rosemary's Baby\"?",
        "response": "John Nicholas Cassavetes",
        "source": "hotpot_qa"
    },
    {
        "query": "What's this Maxey Flat facility about that inspired the documentary film American Threnody ? ",
        "response": "Low Level Radioactive Waste",
        "source": "hotpot_qa"
    },
    {
        "query": "Heinz Engl specialized in which Humanities are at the University of Vienna?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Yangra and Labuche Kang part of the same mountain range , and if so what range?",
        "response": "Himalayas",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Gates v. Collier and Boumediene v. Bush both cases in the federal court ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in the park was the 3D science fiction film starring Michael Jackson located?",
        "response": "Disneyland Space Stage",
        "source": "hotpot_qa"
    },
    {
        "query": "What name did Dennis Cole go by in the 718 studio album by Theodore Unit?",
        "response": "Ghostface Killah",
        "source": "hotpot_qa"
    },
    {
        "query": "Runaway Scrape events of the Texas Revolution, culminating in this Battle, was a fight that lasted how long?",
        "response": "18 minutes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state did Walter Goad work in?",
        "response": "New Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "Derrick Green and Pete Stewart are both what?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Bobby Cox, born in 1941, lead the Atlanta Braves 44th season but how many season did the team have overall?",
        "response": "139th",
        "source": "hotpot_qa"
    },
    {
        "query": "Osteospermum and Calluna are both types of what kind of plants?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the star of Battle at Bloody Beach that died on 28 May 1971 born in?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2011, what is the population of the parish that lies to the west of Temple Bruer with Temple High Grange?",
        "response": "356",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry were both the Llama Company and L.F. Rothschild involved in?",
        "response": "investment banking",
        "source": "hotpot_qa"
    },
    {
        "query": "What NFL team does 2009 St. Petersburg Bowl mvp Mohamed Sanu play for?",
        "response": "the Atlanta Falcons",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the John Lennon album released in 1973, containg the hit song I know, called?",
        "response": "Mind Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Between the two film makers Fabián Bielinsky and Murdock MacQuarrie, who was born earlier?",
        "response": "Murdock MacQuarrie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was loaned out by the \"Les Blues?\"",
        "response": "Kurt Happy Zouma",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Associate of the Supreme Court of the United States who ruled that a defendant cannot prospectively waive the protections of the Speedy trial Act born?",
        "response": "March 11, 1936",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Mimetes and Shortia a genus of subshrubs or perennial herbs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the show that Indira Varma plays DS Nina Suresh start broadcasting?",
        "response": "22 September 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Tell Me Why on the album Maya is recorded by what English artist?",
        "response": "M.I.A.",
        "source": "hotpot_qa"
    },
    {
        "query": "Along with the specialty retailer based in Baldwyn, Mississippi, what store was an anchor store for the Gateway Fashion Mall in Bismarck, North Dakota?",
        "response": "Sears",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the advertisement salesperson who represented ICan Benefit until his death born? ",
        "response": "July 20, 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Robert Caro and Dino Buzzati both short story authors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeremy Mortimer is a British director and producer of radio dramas, for which organization, and is the son of Sir John Clifford, and Penelope Mortimer and the half-brother of Emily Mortimer?",
        "response": "BBC Radio",
        "source": "hotpot_qa"
    },
    {
        "query": "OU812 was the second album to feature a vocalist that also played what instrument in \"Finish What Ya Started\"?",
        "response": "rhythm guitar",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the a Japanese convenience store franchise chain in south korea that has a store accessible inside in Damuqiao Road Station?",
        "response": "CU",
        "source": "hotpot_qa"
    },
    {
        "query": "Which correspondent of Frederick Goddard Tuckerman was an American essayist, lecturer, and poet who led the transcendentalist movement of the mid-19th century?",
        "response": "Ralph Waldo Emerson",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Robbie Keane play for after Inter Milan?",
        "response": "Republic of Ireland national team",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1965 500cc United States Grand Prix was held at a racetrack opened in what year?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "When I Was Born for the 7th Time features the hit single that was remixed by whom?",
        "response": "Norman Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which graphic novel was illustrated by Bruce Jensen and is a story of a washed-up computer hacker?",
        "response": "Neuromancer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company produced the 2017 film in which Chanon Santinatornkul starred ?",
        "response": "Jor Kwang Films",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sukhoi/HAL Fifth Generation Fighter Aircraft is a derivative of another Russian plane thats international name is what?",
        "response": "T-50",
        "source": "hotpot_qa"
    },
    {
        "query": "Edit referenced the Paul and Linda McCartney hit that came from which album?",
        "response": "Ram",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph L. Lewis (June 11, 1889 – November 4, 1968) was an American freethinker and atheist activist, publisher, and litigator, he later credited Paine's \"The Age of Reason\" with helping him leave theism, the Age of Reason; Being an Investigation of True and Fabulous Theology is a work by English and American political activist Thomas Paine, arguing for the philosophical position of what?",
        "response": "Deism",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airline based out of Ouagadougou Airport is part of the Celestair alliance ? ",
        "response": "Air Burkina",
        "source": "hotpot_qa"
    },
    {
        "query": "Karl Camillo Schmidt-Hellerau, was a German carpenter, furniture manufacturer and social reformer, and is notable as the founder of Hellerau, Germany, by which method of urban planning in which self-contained communities are surrounded by \"greenbelts\", containing proportionate areas of residences, industry, and agriculture?",
        "response": "garden city movement",
        "source": "hotpot_qa"
    },
    {
        "query": "What title does this American white supremacist who promoted the term \"Alt-right\" in 2010 prefer to go by?",
        "response": "identitarian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Stiv Bators, or Suggs? ",
        "response": "Stiv Bators",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted both of the shows whose sets were used by Nickelodeon Launch Box?",
        "response": "Marc Summers",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Hebi and Qingyang located in eastern Gansu province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played for Romania at the FIFA World Cup and also previously played for A.C. Milan, Brescia Calcia and West Ham United?",
        "response": "Florin Răducioiu",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band has a song title that refers to the nickname of the Paul Brown Stadium?",
        "response": "Guns N' Roses",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Fred C. Newmeyer and Diminas Dagogo, who has more diverse film-making experiences?",
        "response": "Fred C. Newmeyer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor, director, producer, radio host, and political activist who starred in \"Enemies, A Love Story\" born? ",
        "response": "July 2, 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What types of music strongly influenced the composer of Concerto Grosso?",
        "response": "Tudor music and English folk-song",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is this person born who is currently a Principal and Vice President of a privately held company that invests in real estate, and was instrumental in the formulation and growth of the Live! brand?",
        "response": "Baltimore, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Ray McKinnon, who wrote, and produced the film Chrystal, born?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What British tv show's holiday program  soundtrack features classical music star Katherine Jenkins singing “Abigail’s Song”?",
        "response": "Doctor Who",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 World RX of Canada was the eight round of a season that started at what location?",
        "response": "Circuit de Barcelona-Catalunya",
        "source": "hotpot_qa"
    },
    {
        "query": "What literary style describes the 1968 book that features a 1939 international Harvester school bus?",
        "response": "the growing literary style called New Journalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Brazilian actress starred in the independent film directed by Eric Eason, Journey to the End of the Night?",
        "response": "Alice Braga",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Die Kreuzen and Odds from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Heathcliff Andrew Ledger was an Australian actor whose work included a fantasy film directed by who?",
        "response": "Terry Gilliam",
        "source": "hotpot_qa"
    },
    {
        "query": "The professional ice hockey league that the Peoria Rivermen are part of is based in what state?",
        "response": "North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which female film director's career spanned more than one film era, Dorothy Arzner or Gurinder Chadha?",
        "response": "Dorothy Emma Arzner (January 3, 1897 – October 1, 1979)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city has a larger population, Ningbo or Huainan?",
        "response": "Ningbo",
        "source": "hotpot_qa"
    },
    {
        "query": "Albert Anthony Iafrate and Zdeno Chára both set a record for? ",
        "response": "velocity",
        "source": "hotpot_qa"
    },
    {
        "query": "For which team does the older brother of Jonas Hummels play ? ",
        "response": "Bayern Munich",
        "source": "hotpot_qa"
    },
    {
        "query": "Who appointed the author of DIRECTV, Inc. v. Imburgia to the Supreme Court?",
        "response": "Bill Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress starred with Alan Alda in the 1963 film Gone Are the Days?",
        "response": "Ruby Dee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which number overall pick was the Lithuanian player who debuted with the Toronto Raptors in the 2012-13 season?",
        "response": "fifth",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Isaac Slade and Elizabeth Fraser shared song writing and what other position in their respective bands or solo acts?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Bent Hamer and Luchino Visconti from the same continent?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Chisholm v. Georgia and Edwards v. Aguillard , which seminal Supreme Court case in US history found that the first amendment law was specifically intended to advance a particular religion when it was written?",
        "response": "Edwards v. Aguillard",
        "source": "hotpot_qa"
    },
    {
        "query": "Allan Reginald McEvey was  the Curator of Ornithology at which cultural history museum?",
        "response": "Melbourne Museum",
        "source": "hotpot_qa"
    },
    {
        "query": "Jayson Tatum, who played in the 2017-18 Philadelphia 76ers season, played for which college before declaring himself eligible for the 2017 NBA draft?",
        "response": "Duke Blue Devils",
        "source": "hotpot_qa"
    },
    {
        "query": "Linda Ham chaired the mission management team for which shuttle that disintegrated during re-entry on February 1, 2003?",
        "response": "Space Shuttle \"Columbia\"",
        "source": "hotpot_qa"
    },
    {
        "query": "A member of the girl group \"miss A\" also stars in a South Korean tv drama that airs on what days?",
        "response": "Wednesday and Thursday",
        "source": "hotpot_qa"
    },
    {
        "query": "Who selected the quarterback in the 1999 NFL draft, two spots after All American Tim Couch?",
        "response": "Cincinnati Bengals",
        "source": "hotpot_qa"
    },
    {
        "query": "What Italian politician who has been a member of the European Parliament ran in the 2001 Rome municipal elections?",
        "response": "Antonio Tajani",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Suits connected with Gabriel Macht? ",
        "response": "USA Network series \"Suits\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Sunderland Association Football Club is an English professional football club that plays in a championship referred to as the Sky Bet Championship for what reasons?",
        "response": "sponsorship reasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of the Darkness was a film about a serial killer known as what?",
        "response": "Son of Sam and the .44 Caliber Killer",
        "source": "hotpot_qa"
    },
    {
        "query": "What upcoming American sci-fi thriller television series created by Justin Marks is one of the shows Amy Berg is best known for working on?",
        "response": "Counterpart",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer has sold over 3 million albums and 5 million singles worldwide released his second studio album on May 15, 2012?",
        "response": "Adam Mitchel Lambert",
        "source": "hotpot_qa"
    },
    {
        "query": "Which corporation produces this brand that first appeared in 1928 in the United States and whose concept car released in 1995 could fit two passengers and had a space for a laptop on a small table?",
        "response": "Chrysler Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which political ideology was the premise of The National Action Party?",
        "response": "Nationalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Cat's Eye is a Japanese pop group, MAX's 32nd single is a cover of Anri's 1983 which Japan musical genre classic of the same name?",
        "response": "J-pop",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Japanese entertainment company released the game International Superstar Soccer 2?",
        "response": "Konami",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is the corporate headquarters for the low-cost airline which offers numerous flights out of Punta Gorda Airport?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Artist FYÜTCH changed his stage name from Future to avoid confusion with a rapper from which state?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the filmmaker that wrote and directed The Sinister Urge?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "How did the subject of the 2015 Austrian thriller film \"Jack\" die?",
        "response": "He committed suicide",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Iron Will or The Vanishing Prairie?",
        "response": "The Vanishing Prairie",
        "source": "hotpot_qa"
    },
    {
        "query": "Where do the team that Bill Newton represented in the NBA play their home games ?",
        "response": "Bankers Life Fieldhouse.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Dave Grohl or Steve Winwood?",
        "response": "Stephen Lawrence \"Steve\" Winwood",
        "source": "hotpot_qa"
    },
    {
        "query": "What United States Marine Corps air station which is the home to multiple squadrons of AV-8B Harrier IIs is located at the Yuma National Airport? ",
        "response": "Marine Corps Air Station Yuma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which black comedy sequel to \"Forgetting Sarah Marshall\" starred an Australian actress?",
        "response": "Rose Byrne",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voices Chef Mung Daal in the American animated television series created by C. H. Greenblatt?",
        "response": "William Dwight Schultz",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the home games held of the team that the #1 Ohio State Buckeyes lost to during the 2007 BCS National Championship Game?",
        "response": "Ben Hill Griffin Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What British columnist and restaurant critic for \"The Times\" newspaper presented The Supersizers Go... and The Supersizers Eat?",
        "response": "Giles Coren",
        "source": "hotpot_qa"
    },
    {
        "query": "ishop Gorman High School (also commonly referred to as Gorman High School or BGHS) is a Roman Catholic, private, preparatory school located in Summerlin, Nevada, Summerlin is an affluent planned community in which location of Nevada?",
        "response": "Las Vegas Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "What team was led to victory in 1939 by a two-time All-American basketball player nicknamed \"Scat\"?",
        "response": "Oklahoma Sooners",
        "source": "hotpot_qa"
    },
    {
        "query": "The soundtrack to 'Dancer in the Dark' is by what Icelandic singer, songwriter, actress, record producer, and DJ?",
        "response": "Björk Guðmundsdóttir",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the cousin of the man called \"The Great Commoner\"?",
        "response": "Lewis Bryan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie distributed by Walt Disney Pictures starred Jussie Smollett as a child actor?",
        "response": "The Mighty Ducks",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the opening ceremony flag bearer for the Czech Republic at the 2010 Winter Olympics born?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bowling Green massacre was alluded to by a government official born in what year?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Chicken Cha Cha Cha or RoboRally receive more awards?",
        "response": "RoboRally",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts, Trial by Jury or Luisa Miller?",
        "response": "Luisa Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a five-act musical mystery play on the subject of Saint Sebastian, with a text written in 1911 by the Italian author who occupied a prominent place in Italian literature from 1889 to 1910 ?",
        "response": "Le Martyre de saint Sébastien",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Louis L'Amour or D. H. Lawrence?",
        "response": "David Herbert Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": " Hwange National Park lies in the west on the main road between Bulawayo and the a waterfall on the Zambezi Riber which as been described by CNN as one of the what?",
        "response": "Seven Natural Wonders of the world",
        "source": "hotpot_qa"
    },
    {
        "query": "James Francis \"Jimmy\" Cagney Jr. starred in White Heat, written by what writer?",
        "response": "Ivan Goff and Ben Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Weak and Powerless\" is the first single by the alternative rock band A Perfect Circle, from their second album Thirteenth Step, released on which date?",
        "response": "September 16, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The university that houses the American Museum of Asmat Art was founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "Which two professional hock teams did both Ray Ferraro and Pat Verbeek play for?",
        "response": "Hartford Whalers, New York Rangers",
        "source": "hotpot_qa"
    },
    {
        "query": "Dusky v. United States and Zelman v. Simmons-Harris are both what cases?",
        "response": "Court",
        "source": "hotpot_qa"
    },
    {
        "query": "The Colts' first ever draft pick was a halfback who won the Heisman Trophy in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "What Republican governor was once stationed 15 miles from his state capital of Phoenix, Arizona?",
        "response": "John Fife Symington III",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose novel deals with an artist who committed suicide time in Belgium?",
        "response": "Nellie Hermann",
        "source": "hotpot_qa"
    },
    {
        "query": "Sigma Films co-produced which Danish film that stars Nikolaj Lie Kaas, Connie Nielsen and Ulrich Thomsen?",
        "response": "Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Finnick Odair in \"The Hunger Games\" series also starred in a 2014 Juliette Towhidi film based on what 2004 novel?",
        "response": "\"Where Rainbows End\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 American action comedy film for which James Lew did a choreography?",
        "response": "Robert Luketic",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress from the early 1990s starred in the American comedy-drama film Roommates?",
        "response": "Julianne Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Köstritz is a town in the district of Greiz, in Thuringia, Germany, which brewery, founded in 1543, is one of the oldest producers of Schwarzbier (black lager)?",
        "response": "Köstritzer",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Christophe Dupont is a French film director whose notable works include a French-German fantasy drama film that competed for what at the 2012 Cannes Film Festival?",
        "response": "Palme d'Or",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional football player, selected in the second round of the 2001 NFL Draft by the Washington Redskins was also involved in the Minnesota Vikings boat party scandal?",
        "response": "Fred Smoot",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the artist who released the album Gene Italiano born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian composer wrote Symphony No. 35 dated December 10, 1767?",
        "response": "Joseph Haydn",
        "source": "hotpot_qa"
    },
    {
        "query": "Who used to coach for the university that ranked 27th in the nation in 2016?",
        "response": "Sharon Dawley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist featured in \"Cloud Nine\" is from South Gate, California?",
        "response": "Cypress Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the company Continental Automotive Systems is a division of founded?",
        "response": "1871",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Bill Ford's football team nicknamed?",
        "response": "Tigers",
        "source": "hotpot_qa"
    },
    {
        "query": "Matthew Casey is a fictional character portrayed by actor Jesse Spencer on which American drama tv show that debuted in 2012?",
        "response": "\"Chicago Fire\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by Usher was released as the lead single on his fourth album, pushing back his originally planned lead single, Burn?",
        "response": "Yeah!",
        "source": "hotpot_qa"
    },
    {
        "query": "Sherman Adams headed New Hampshire's state government before serving President Dwight D. Eisenhower is which office?",
        "response": "White House Chief of Staff",
        "source": "hotpot_qa"
    },
    {
        "query": "This 1998 American supernatural comedy slasher film is a sequel to a film directed by who?",
        "response": "Jack Bender",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film producer also worked as a cinematographer, George Sidney or Jan de Bont?",
        "response": "Jan de Bont",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the University Samford Bulldogs basketball team represents now?",
        "response": "Howard College",
        "source": "hotpot_qa"
    },
    {
        "query": "What fictional character created by Tom Clancy was turned into a film in 2002?",
        "response": "Jack Ryan",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Robert Graves and Edith Wharton both write novels?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The World Boardgaming Championships replaced the convention run from 1991 to 1998 by which game company?",
        "response": "Avalon Hill Games, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town that Feura Bush is along it's town line?",
        "response": "33,656",
        "source": "hotpot_qa"
    },
    {
        "query": "Léontine de Maësen (15 July 1835 – 1906) was a Belgian coloratura soprano active on the opera stages of France from 1858 to 1868, most remembered today for having created the role of Leïla in Bizet's 1863 opera in three acts, titled what?",
        "response": "Les pêcheurs de perles",
        "source": "hotpot_qa"
    },
    {
        "query": "Al-Sharki was born and raised in Sana'a, a town in old Sanaa, Sana'a, also spelled Sanaa or Sana, is the largest city in which country, and the centre of Sana'a Governorate?",
        "response": "Yemen",
        "source": "hotpot_qa"
    },
    {
        "query": "The person that the Lindsey Islands were named for was born in what year?",
        "response": "1907",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first position of the Chief Justice who wrote the opinion for Dalton v Specter?",
        "response": "Associate Justice",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the city where Steven L. Abrams was mayor?",
        "response": "1,320,134",
        "source": "hotpot_qa"
    },
    {
        "query": "What highest civilian award was the actress that starred in Yaraana, along side Rishi Kapooy, Raj Babbar, Kader Khan, and Shakti Kapoor, awarded by the Government of India in 2008?",
        "response": "Padma Shri",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American magazine is published more often, Watercolor Artist or Hot Rod?",
        "response": "Hot Rod",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former member of Spooky Tooth produced the album Mr. Moonlight?",
        "response": "Mick Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Christopher Buckley related to the founder of \"National Review\" magazine?",
        "response": "son",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city was the 310th Expeditionary Air Refeuling Flight assigned in 1994?",
        "response": "Plattsburgh, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What was another title published by the owner of the pseudonym Frank Talk?",
        "response": "I Write What I Like",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the media company that described Kim Swift as one of the most recognized women in the industry?",
        "response": "Dennis Publishing",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Rob Cavallo produced My Chemical Romance album, which included the song \"I Don't Lovee You\"?",
        "response": "The Black Parade",
        "source": "hotpot_qa"
    },
    {
        "query": "I Saw the Devil starred the actor who was in what critically-acclaimed 2015 film?",
        "response": "Inside Men",
        "source": "hotpot_qa"
    },
    {
        "query": " Are Phil Mogg and Dave Peters musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is in the northeastern province, Jinhua or Tieling?",
        "response": "Tieling",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the nuclear war drama where Rita May played Jimmy Kemp's mother?",
        "response": "Mick Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "What cultural, social and artistic explosion taking place in Harlem, New York is Madame E. Toussaint Welcome associated with?",
        "response": "The Harlem Renaissance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state was  the Army Airfield which  headquartered the 117th Air Control Squadron?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Robert Tree Cody's adopted father's most prominent PSA role?",
        "response": "Keep America Beautiful",
        "source": "hotpot_qa"
    },
    {
        "query": "What municipality host the John Paul Johns House in the Seacoast Region",
        "response": "Portsmouth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus contains more species, Berkheya or Rajania?",
        "response": "Berkheya",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Crispian Mills and Billy Gibbons considered singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Polish professional footballer and captain of the Poland national team endorses the Nike Hypervenom football boot?",
        "response": "Robert Lewandowski",
        "source": "hotpot_qa"
    },
    {
        "query": "Which place, Wall Street Tower or The Collegiate Reformed Protestant Dutch Church has had a variety of church buildings?",
        "response": "The Collegiate Reformed Protestant Dutch Church",
        "source": "hotpot_qa"
    },
    {
        "query": "What pageant did Marika Savsek represent the country of slovenia?",
        "response": "Miss Universe 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Owen Wilson, who played in the movie \"Father Figures\" earned a nomination for the Academy Award for Best Original Scrrenplay for what movie?",
        "response": "The Royal Tenenbaums",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the choreographer of \"Salome, Where She Danced\" born?",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": " John Fowler & Co produced a tracked version of a brand of what?",
        "response": "farm tractor",
        "source": "hotpot_qa"
    },
    {
        "query": "Donker Mag is an album by what African hip hop group?",
        "response": "Die Antwoord",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the technical device made by the british aeronautical engineer during the second world war do? ",
        "response": "counter engine cut-out",
        "source": "hotpot_qa"
    },
    {
        "query": "Grodon Willis worked as a cinematographer for which romantic film that stars Woody Allen and Diane Keaton and was produced by Charles Joffe?",
        "response": "Annie Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the biographical film that was directed by Joe Johnston and starred Chad Lindberg in an acting role?",
        "response": "October Sky",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle of the Hundred Years' War is the subject of Leslie Barringer's historical novel?",
        "response": "The Battle of Agincourt",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is the National Park, which includes the burial place for British General Simon Fraser, located?",
        "response": "Stillwater",
        "source": "hotpot_qa"
    },
    {
        "query": "Jordan-Carmichael Subban, is a Canadian professional ice hockey defenceman for the Utica Comets of the American Hockey League (AHL), and is one of the three Subban brothers to be drafted into the NHL, the other two being Malcolm Subban and who?",
        "response": "P. K. Subban",
        "source": "hotpot_qa"
    },
    {
        "query": "What do both Aealo and Rotting Christ have in common?",
        "response": "Greek extreme metal band",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first military aviation unit to use an unpowered precision guided munition in a war that involved more than 100 million people from over 30 countries?",
        "response": "Luftwaffe",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the employee of an American company that manufactures footwear, sports, and casual apparel given by Bill Parcells because of his fondess for technology? ",
        "response": "Received the nickname \"Laptop\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthplace of the composer of Griselda?",
        "response": "Venice",
        "source": "hotpot_qa"
    },
    {
        "query": "Actor Larry Bishop's famous father was an entertainer and member of which showbiz collective?",
        "response": "Rat Pack",
        "source": "hotpot_qa"
    },
    {
        "query": "which  southern region of Asia did  Indian whiting inhabits its  east and west coasts",
        "response": "The Indian subcontinent",
        "source": "hotpot_qa"
    },
    {
        "query": "Which corporation which has headquartered in Seoul manufactured KV6 in Korea under license",
        "response": "Kia Motor Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Classic Blue was a solo album by a member of the band that was formed in what English city?",
        "response": "Birmingham",
        "source": "hotpot_qa"
    },
    {
        "query": "What Actor whose birth name was Charles Dennis Buchinsky, was part of the Leslie Nielsen comedy?",
        "response": "Charles Bronson",
        "source": "hotpot_qa"
    },
    {
        "query": "Persona Non Grata depicted the life of a diplomat who served in Lithuania for what country?",
        "response": "Japanese Empire",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsey Oil Refinery lies to the north of a British oil refinery in South Killingholme, that is situated south of the railway line next to what?",
        "response": "the A160",
        "source": "hotpot_qa"
    },
    {
        "query": "What record company released the third album by the woman, who was featured as a topless model for \"The Sun\" in 1983?",
        "response": "Jive Records",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1991 American comedy film Soapdish stars which American actress, writer, presenter and singer born in 1964 who appeared in \"Tomorrow Never Dies?\"",
        "response": "Teri Hatcher",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the county seat for the county that Barclay, the unincorporated community, is in?",
        "response": "Lyndon",
        "source": "hotpot_qa"
    },
    {
        "query": "Kurt Julian Weillwas a German composer, active from the 1920s in his native country, and in his later years in the United States, with Brecht, he developed productions such as his best-known work, the Threepenny Opera is a \"play with music\" by Bertolt Brecht and who, adapted from John Gay's 18th-century English ballad opera, \"The Beggar's Opera\"?",
        "response": "Elisabeth Hauptmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Æthelwulf of Berkshire lost his life at a battle in what year?",
        "response": "871",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Lifted by Love was included in the soundtrack of a film directed by who ?",
        "response": "Gus Van Sant",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Xinji and Liyang located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "For which team does the player who performs rap parts on the single We are Ajax play ? ",
        "response": "Beşiktaş",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was the group, in which James Iha and Taylor Hanson are members, founded in?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the soundtrack CD was released on July 19, 2005 for the film baed on the Marvel Comics' character \"The Punisher\"?",
        "response": "The Punisher",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the highest point of the roller coaster at Paradise Pier?",
        "response": "120 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "12th & Midtown is in Midtown Atlanta along what street",
        "response": "Peachtree Street",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the Sissala East District in the Upper West region of north Ghana?",
        "response": "Tumu",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city did Clayster win a gold medal during the 2014 X Games with the winning team OpTic Gaming?",
        "response": "Austin, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "The R.E.M. song \"The Great Beyond\" was written specifically for a movie about what late American entertainer?",
        "response": "Andy Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current Group Chief Executive & Editor-in-Chief of the newspaper for which Ibrahim Jalees wrote the column \"Waghaira Wghaira\"?",
        "response": "Mir Shakil-ur-Rahman",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the team that has Stomper the Maverick as a mascot begin competition?",
        "response": "2008-09",
        "source": "hotpot_qa"
    },
    {
        "query": "What author of Isaac Asimov's Robot City : Cyborg was inspired by Hugo award winner Isaac Asimov's Robot nad Foundation novels?",
        "response": "William F. Wu.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2014 population of the city where Lake Wales Medical Center is located?",
        "response": "15,140",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Schomburgkia and Cynoglossum belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the former Secretary of Transportation at the state government organization in charge of maintaining public roadways of the U.S. state of Kansas?",
        "response": "Deborah Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Like the Roman: The Life of Enoch Powell is a book whose title is taken from when British Member of Parliament Enoch Powell addressed a meeting of the Conservative Political Centre where?",
        "response": "Birmingham, UK",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera piece has more acts, Daphne or La Gioconda?",
        "response": "La Gioconda",
        "source": "hotpot_qa"
    }
]