[
    {
        "query": "Are Northampton Cathedral and Birmingham Orthodox Cathedral both English churches?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "which one of the three patriarchs of the Israelites was offered in Jehovah-jireh?",
        "response": "Isaac",
        "source": "hotpot_qa"
    },
    {
        "query": "who is older, Susan Hill or Kaye Gibbons ?",
        "response": "Susan Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "What sign did Ted Rogich request for an American visual artist and graphic designer who was born in Nevada to design?",
        "response": "Welcome to Fabulous Las Vegas sign",
        "source": "hotpot_qa"
    },
    {
        "query": "The tv series \"My Only Love Song\" stars Gong Seung-yeon and the lead guitarist of what band?",
        "response": "CNBLUE",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Robin Wilson and Adrienne Bailon of the same nationality? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Candy Flip and Loop names of bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Karen van der Beek on \"Californication\" plays what role on the series \"Believe\"?",
        "response": "Erica Gallagher",
        "source": "hotpot_qa"
    },
    {
        "query": "India's first Sanskrit band is named after what set of hymns?",
        "response": "Vedic Sanskrit hymns",
        "source": "hotpot_qa"
    },
    {
        "query": "Letters from a Porcupne is a 1996 documentary film that was made from footage of an American rock band that was best known for what 1993 single?",
        "response": "No Rain",
        "source": "hotpot_qa"
    },
    {
        "query": "Symphony No. 3 was written by a musician who was proficient on what instrument?",
        "response": "violinist",
        "source": "hotpot_qa"
    },
    {
        "query": "How many matches did the husband of Magdalena Graaf play for Sweden ?",
        "response": "58 matches",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more ingredients Derby or Salmiakki Koskenkorva?",
        "response": "Derby",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Grand Canyon West Airport and Bishop International Airport both located in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Zachary Brendan \"Zach\" McGowan is known for his role as Jody in a television series which airs on what network?",
        "response": "Showtime",
        "source": "hotpot_qa"
    },
    {
        "query": "A foam weapon, a padded mock weapon used for simulated handheld combat, is used in a North American medieval combat sport, begun in 1977 with the creation of what?",
        "response": "Dagorhir",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the artificial island surrounded by a river at the Magic kingdom?",
        "response": "Tom Sawyer Island",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach for the 1993 Nebraska Cornhuskers football team was born in what year?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to the individual born in April 1963, what other artist did critics compare The Advent's energetic update of original techno to?",
        "response": "Kevin Saunderson",
        "source": "hotpot_qa"
    },
    {
        "query": "Terlingua Creek is a stream in the U.S. state of Texas, it is a tributary of which one of the principal rivers in the southwest United States and northern Mexico (the other being the Colorado River), and begins in south-central Colorado in the United States and flows to the Gulf of Mexico?",
        "response": "Rio Grande",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the older sister of Debbie Allen born?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Joey Ramone and Miles Hunt have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the main topic of the United States Congressional hearing where Brian McNamee appeared to speak about this retired American baseball pitcher nicknamed \"Rocket?\"",
        "response": "George J. Mitchell Report",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Froch vs. Jermain Taylor was a boxing super-middleweight fight held at a hotel and casino complex on what reservation?",
        "response": "Mashantucket Pequot Indian Reservation",
        "source": "hotpot_qa"
    },
    {
        "query": "The Legion of Doom was a forward line for the Philadelphia Flyers that included a Canadian player who played junior hockey in the Ontario hockey league for what team?",
        "response": "Oshawa Generals",
        "source": "hotpot_qa"
    },
    {
        "query": "The musical numbers for \"Promises, Promises\" based on the 1960 film \"The Apartment\" were choreographed by this American musical theatre director, writer, choreographer, and dancer who won how many Tony Awards?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person that Roger Manvell made a biography of had the middle name of Luitpold? ",
        "response": "Heinrich Himmler",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie staring Mikkel Boe Folsgaard is set in the 18th century, at the court of the mentally ill King Christian VII of Denmark?",
        "response": "A Royal Affair",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tom Smith and Chris Martin both keyboardists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which John Abraham made his film debut?",
        "response": "Amit Saxena",
        "source": "hotpot_qa"
    },
    {
        "query": "What  company did the actor, sing and songwriter who did a cover of \"Baby It's Cold Outside\" for the Glee Christmas Album co-find?",
        "response": "StarKid Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "What company formed the South Korean boy group of which Lee Jin-Ki is a part?",
        "response": "S.M. Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress composed two Vaishnava devotional albums namely \"\"Azhagu\"\" and \"\"Thirupathi Thirukudai Thiruvizha and acted in (Tamil: சக்கரை தேவன்) in 1993 ?",
        "response": "Sukanya",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the Italian Poet of the Late Middle Ages on whose work IIya Golenishcev-Kutuzov the Russian Philologist, poet and translator authored ?",
        "response": "Dante Alighieri",
        "source": "hotpot_qa"
    },
    {
        "query": "How many books has the author of The  Ealdwood Stories written ?",
        "response": "more than 60 books",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was created first, Chapayev or Senet?",
        "response": "Senet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Psychomania  is an English actor who enjoyed a long career in the theatre, film and television?",
        "response": "Robert Hardy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Millionaires' Unit is a documentary that was narrated by which actor?",
        "response": "Bruce MacLeish Dern",
        "source": "hotpot_qa"
    },
    {
        "query": "Wat is the modern name for Latium, where Ferentina was the patron goddess?",
        "response": "Rome",
        "source": "hotpot_qa"
    },
    {
        "query": "The 43d Air Mobility Operations Group is stationed at which largest military installation?",
        "response": "Fort Bragg",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that opened the 2017 Cannes Film Festival?",
        "response": "Arnaud Desplechin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of Lucette Diana Kensack's lover?",
        "response": "lumberjack",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2017-18 season, the Denver Nuggets appointed which former player to general manager?",
        "response": "Artūras Karnišovas",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county the Nashua High School is situated?",
        "response": "Hillsborough County",
        "source": "hotpot_qa"
    },
    {
        "query": "What National League East Division baseball team had a pitcher that grew up in RIalto, California?",
        "response": "Montreal Expos",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had a longer hiatus, Juliette and the Licks or The Last Shadow Puppets?",
        "response": "The Last Shadow Puppets",
        "source": "hotpot_qa"
    },
    {
        "query": "What FOX show has starred the actor who played Kelby in the 2002 film \"Brown Sugar\"",
        "response": "The Last Man on Earth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1994 comedy film did this American filmmaker, actor, comic book writer, author, and podcaster, who ran the short film festival Movies Askew, write, direct, co-produce, and act in?",
        "response": "Clerks",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Milium or Cucumis have plants that are tendril-bearing?",
        "response": "Cucumis",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the scientific name for the animal that the Naybandan Wildlife Sanctuary hold the highest population of?",
        "response": "Acinonyx jubatus venaticus",
        "source": "hotpot_qa"
    },
    {
        "query": "What American patent attorney visited John Shaw Crout in 1944?",
        "response": "Chester Carlson",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the indoor sports arena opened which is the home arena of the Vancouver Canucks of the National Hockey League team?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor had a role in The Legend of Frosty the Snowman and also in \"How I Met Your Mother\"",
        "response": "Bill Fagerbakke",
        "source": "hotpot_qa"
    },
    {
        "query": "A television show originaly aired on December 29, 1996 was written by a graduate of what University?",
        "response": "Harvard University",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Stanley Beeston FCMA is chairman of Taylor Wimpey plc and Equiniti Group plc, Senior Independent Director of Severn Trent plc, Non-Executive Director of which British brewery and pub operator, that it operates over 1,700 pubs in the UK, and is the world's largest brewer of cask ale?",
        "response": "Marston Group Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "John Michael Montgomery has had more than 30 singles on the \"Billboard\" country music charts, but what single from his fourth studio album What I Do the Best never reached the top ten on the Hot Country Songs charts?",
        "response": "\"Ain't Got Nothin' on Us\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian professional ice hockey left winger was featured on the cover of NHL 2K9?",
        "response": "Rick Nash",
        "source": "hotpot_qa"
    },
    {
        "query": "What are a Uruguayan professional footballer and Luz Pfannenstiel are best known as?",
        "response": "the best known globetrotters",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of station is Fort Lauderdale, currently under construction in Florida and part of a wider network connecting Miami to the second busiest airport in the state of Florida?",
        "response": "train",
        "source": "hotpot_qa"
    },
    {
        "query": "The musician resposible for the the song \"Please Please Let Me Get What I Want\" also holds a career an English what?",
        "response": "actress",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Aur Devdas was also in Gangs of Wasseypur?",
        "response": "Richa Chadda",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by U2 was featured in a movie directed by Martin Scorsese?",
        "response": "\"The Hands That Built America\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the writer of \"Mind of My Mind\" die?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Which series was Richard Armitage in that was originally planned as a film with a script written by Warren Ellis in 2007?",
        "response": "Castlevania",
        "source": "hotpot_qa"
    },
    {
        "query": "Fonzi Thornton has provided vocal accompaniment for which guitarist known for the song \"Poetry Man\"?",
        "response": "Phoebe Snow",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 census population of the county in which Dry Valley, Nevada is located?",
        "response": "5,345",
        "source": "hotpot_qa"
    },
    {
        "query": "Known as \"The Bible of Baseball,\" which covered the end of Steve Dalkowski's Career?",
        "response": "Sporting News",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenneth Bruce Gorelick is a saxophonist who appeared in what move in 1999?",
        "response": "\"Life\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Missouri gubernatorial election of 2008, Matt Blunt beat what American politician who is a member of the democratic party, and serves as the senior United State Senator from missouri?",
        "response": "Claire Conner McCaskill",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Chizhou and Xingtai which has  a total area of 12486 km2?",
        "response": "Xingtai",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another television show that the 1947 born actor of Family Pictures star in?",
        "response": "Peaky Blinders",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the wrestling promotion based in that was formed by John Benson Williams?",
        "response": "Louisville",
        "source": "hotpot_qa"
    },
    {
        "query": "Over what time period did the representative who defeated Jim Wilson in the July 27, 2004 Democratic primary for Oklahoma's 2nd Congressional District serve?",
        "response": "from 2005 to 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Luke Bryan's fifth studio album which features the song \"Strip it Down\"?",
        "response": "Kill the Lights",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American short silent film shot on May 20, 1891 in collaboration with \"The Wizard of Menlo Park\"?",
        "response": "William K. L. Dickson",
        "source": "hotpot_qa"
    },
    {
        "query": "James Mark Cornette ran a professional wrestling promotion based in what town?",
        "response": "Knoxville, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tampa International Airport and King Salmon Airport both located in the U?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2017 horror-thriller film in which Barry Keoghan, Nicole Kidman, Colin Farrell, and Alicia Silverstone appeared?",
        "response": "Yorgos Lanthimos",
        "source": "hotpot_qa"
    },
    {
        "query": "A German professional footballer who plays as an attacking midfielder for German Bundesliga club Borussia Dortmund and the Germany national team shot a winning goal in the 2014 FIFA World Cup Final that was attributed to his years of practicing with Footbonaut, who described this football player as \"one of the best talents Germany has ever had.\" In 2010?",
        "response": "Matthias Sammer",
        "source": "hotpot_qa"
    },
    {
        "query": "Nikolajs Štelbaums was forced to move to Siberia because of which mass deportation that took place in March 1949?",
        "response": "Operation Priboi",
        "source": "hotpot_qa"
    },
    {
        "query": "A Chinese Ghost Story starred the actress widely known as what for her delicate image?",
        "response": "Fairy Sister",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is the third largest ski area in Maine located?",
        "response": "Franklin County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the host of Nickelodeon's 1st Annual Kids' Choice Sports Awards play in the NFL for?",
        "response": "the New York Giants",
        "source": "hotpot_qa"
    },
    {
        "query": "Who helped more to define literary journalism, Buckminster Fuller or Gay Talese?",
        "response": "Gay Talese",
        "source": "hotpot_qa"
    },
    {
        "query": "Virginia Coigney is the mother of what singer who was part of a group with Peter Yarrow?",
        "response": "Mary Allin Travers",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of \"Year of the Dog\" was also in \"Other People\"?",
        "response": "Molly Shannon",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Byte and The American Prospect both political magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hüsker Dü and Joy Division are both what?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Bombay Time is set at 4 hours and 51 minutes ahead of the mean solar time at what observatory?",
        "response": "Royal Observatory",
        "source": "hotpot_qa"
    },
    {
        "query": " \"I Will Not Say Goodbye\" is a song written in part by a music artist who first gained national attention as a winner of what talent competition?",
        "response": "You Can Be a Star",
        "source": "hotpot_qa"
    },
    {
        "query": "Manfred Moch was the featured solo trumpet player of the orchestra named after which German orchestra leader, music producer, and songwriter who died on June 21, 1980?",
        "response": "Bert Kaempfert",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music does the artist who recorded \"God Bless the U.S.A.\" specialize in?",
        "response": "country",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rubber company bought Crosley Motors, Incorporated?",
        "response": "General Tire",
        "source": "hotpot_qa"
    },
    {
        "query": "Shane Drake was a director of a video for an American rock band from what Tennessee city?",
        "response": "Franklin",
        "source": "hotpot_qa"
    },
    {
        "query": "Brad Elterman is a professional photographer who addressed the rock 'n' roll lifestyle of a band that became noted for what?",
        "response": "its eclectic mix of musical styles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mayor of a Denmark town that sits on the peninsula of Northern Europe that forms the continental portion of Denmark and part of northern German?",
        "response": "Laurids Rudebeck",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the call sign of the airline that operates the flight with United Express Flight 3411 incident?",
        "response": "Brickyard",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Caesars and Primus both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What role over the Hellenic Army did the person who had a dispute with Eleftherios Venizelos have?",
        "response": "commander-in-chief",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cierva C.8 was built by Juan de la Cierva in association with a company founded in what year?",
        "response": "1910",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the general who led a branch of the Mexican army in a historic battle that took place at what is currently the Fannin Battleground State Historic Site in Texas?",
        "response": "General José de Urrea",
        "source": "hotpot_qa"
    },
    {
        "query": "This outdoor second-hand sale is held annually along a north–south U.S. Highway that is how long?",
        "response": "758 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born Earlier, Jon Amiel or Michael Ritchie?",
        "response": "Michael Brunswick Ritchie",
        "source": "hotpot_qa"
    },
    {
        "query": " Sophie Grégoire is married to what Canadian politician?",
        "response": "Justin Trudeau",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the Crown Princess of Norway who was born in 1973 officially reside?",
        "response": "Skaugum",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the film Zokkomon or the novel The Wind in the Willows published or produced earliest?",
        "response": "The Wind in the Willows",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country is the belief championed by William Eglinton mainly focuses on reincarnation?",
        "response": "Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known for the role of Yelena in the action film \"xXx\", the first installment in the \"xXx\" franchise, Val Guest or Asia Argento ?",
        "response": "Asia Argento",
        "source": "hotpot_qa"
    },
    {
        "query": "Time magazine's best novel of 2005 had it's screenplay written by what person?",
        "response": "Alex Garland",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dayton International Airport and Westchester County Airport both in the same county?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Lee Eun-woo both star in the intially banned film Mobius and get nominate for Best New Actress at the 34th Blue Dragon Film Awards?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Voivodeship with the capital in Wilno,was created in 1926 and is a part of theKresy region?",
        "response": "The Wilno Voivodeship",
        "source": "hotpot_qa"
    },
    {
        "query": "What Emperor is the establisher of the Order of Saint Anastasia the great-great-granddaughter of?",
        "response": "Alexander II",
        "source": "hotpot_qa"
    },
    {
        "query": "What sibling of John D. Rockefeller III was the chairman of Chase Manhattan Corporation?",
        "response": "David Rockefeller",
        "source": "hotpot_qa"
    },
    {
        "query": "What years did Jose Gonzalo Rodriguez Gacha and other leaders of fthe Medallin Cartel operate in Boliva, Colombia, Central America, Peru, the United States, Canada, and Europe?",
        "response": "1970s and 1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed is used for hunting, Finnish Spitz or Appenzeller Sennenhund",
        "response": "Finnish Spitz",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2003 steampunk-dieselpunk film  Robert Vahey appeared in?",
        "response": "Stephen Norrington",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Love in the Natural Way\" is the fifth and final single from \"Close\", the best-selling album by Kim Wilde, whose debut single \"Kids in America\", which reached number two where?",
        "response": "in the UK",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American producer, Russell Edson or Sidney Sheldon?",
        "response": "Sidney Sheldon",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Adolfo Bioy Casares and James Norman Hall Argentinian authors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor starred in the films 'Student of the Year' and 'A Gentleman'?",
        "response": "Sidharth Malhotra",
        "source": "hotpot_qa"
    },
    {
        "query": "Genie Energy and which other oil and gas company, considered one of the seven 'Supermajor' oil companies, owns American Shale Oil, the developers of in-situ shale oil extraction technology in Rifle, Colorado?",
        "response": "Total S.A.",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the best-known works of the American cartoonist inspired by Alberto Magno Romero Rivera?",
        "response": "Chick tracts",
        "source": "hotpot_qa"
    },
    {
        "query": "George Ho Ho-chi's father was known as what?",
        "response": "the grand old man of Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band had more members, Our Last Night or Morning Parade?",
        "response": "Morning Parade",
        "source": "hotpot_qa"
    },
    {
        "query": "what english actor was best known for his role as Giles French and a detective series Checkmate?",
        "response": "Sebastian Cabot",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 Texas Tech Red Raiders baseball team represents Texas Tech University in the 2014 college baseball season, The Red Raiders play home games at which home stadium of the Texas Tech Red Raiders baseball team in Lubbock, Texas, nicknamed \"The Law\"?",
        "response": "Dan Law Field at Rip Griffin Park",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the historical event promoted by Richard Hakluyt's works begin?",
        "response": "1607",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1979 drama film directed by John Schlesinger did Lisa Eichhorn make her film debut and win two Golden globe nominations for?",
        "response": "Yanks",
        "source": "hotpot_qa"
    },
    {
        "query": "The Director of Red Dust attended what University?",
        "response": "Oxford University",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry Goodenough was a member of which ice hockey team who's home games are played at Rogers Arena?",
        "response": "Vancouver Canucks",
        "source": "hotpot_qa"
    },
    {
        "query": "JailbreakMe is a series of jailbreaks for Apple's iOS mobile operating system that take advantage of flaws in the Safari browser on the device, providing an immediate one-step jailbreak unlike more common jailbreaks, it automatically includes which package manager mobile app for iOS that enables a user to find and install software packages on jailbroken iPhones, iPads and iPods?",
        "response": "Cydia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manages the conservation area that is near the planned community in Las Vegas called \"The Lakes\"?",
        "response": "the Bureau of Land Management",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the singer of \"Get Thy Bearings\" born?",
        "response": "10 May 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former footballer born in Eccles, Greater Manchester is currently first team coach at Wigan Athletic? ",
        "response": "Joseph \"Joe\" Parkinson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the author of Progress in Optics?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2004 single \"Boom, Like That\" was written by a man who was born in what city?",
        "response": "Glasgow",
        "source": "hotpot_qa"
    },
    {
        "query": " Jagdgeschwader 52 included the fighter ace who joined the Luftwaffe in what year?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Fictional supervillain Steppenwolf is the uncle of Darkseid, who appears in comic books published by what company?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third film based on one of Cohen's characters from \"Da Ali G Show\" that had a pastor  and former mayoral candidate for Birmingham, Alabama make an appearance?",
        "response": "Brüno",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1906 Florida football team played in what city during it's inaugural season?",
        "response": "Gainesville",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor that has performed as Inspector Javert in a Les Misérables production Has won the Laurence Olivier Award for Best Actor in a musical three times?",
        "response": "Philip Quast",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Hazen Street and Bullet for My Valentine form in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the most recent movie based on a book, Charley and the Angel or Shipwrecked?",
        "response": "\"Haakon Haakonsen\" ) is a 1990 family action-adventure film",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the miniseries released that saw Peter O'Meara play 1st Lt Norman Dike?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther west, Makethisrelate or Saosin?",
        "response": "Saosin",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the IBM PS/1 or the Compucolor II introduced first?",
        "response": "Compucolor",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the shape of Hershey's Kissables?",
        "response": "flat-bottomed teardrops",
        "source": "hotpot_qa"
    },
    {
        "query": "Arthur Saint-Léon was the \"Maître de Ballet\" of the ballet company now known as?",
        "response": "The Mariinsky Ballet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is the state park, which is named after the network of trails used by Native Americans to navigate through the Great Appalachian Valley, located?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Svend Borbeng was the father of Claus von Bülow, who faced trial and retrial in the 1970s for what crime against his own wife?",
        "response": "attempted murder",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was the person who toured with J.P. Doherty on Cyndi Lauper's True Colors tour belong to?",
        "response": "Blondie",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 1994 American animated musical film The Lion King, Jonathan Taylor Thomas was featured as the voice of what character?",
        "response": "Simba",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the memoir written by the co-founder of the black nationalism and social change organizaion US?",
        "response": "From the Dead Level",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the manager for both the English professional football club based at the King Power Stadium in Leicester and the Football League for Bolton Wanderers? ",
        "response": "Thomas \"Tom\" Mather",
        "source": "hotpot_qa"
    },
    {
        "query": "Johan Mjällby and Neil Lennon were both born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "American Eagle Outfitters established what other company to present a different take on the company or brand's main idea?",
        "response": "Aerie",
        "source": "hotpot_qa"
    },
    {
        "query": "Laura Don's son wrote a libretto for an operetta composed by which conductor?",
        "response": "Victor Herbert",
        "source": "hotpot_qa"
    },
    {
        "query": "Were The Neighbourhood and Pierce the Veil formed in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What National Geographic Channel social science TV series did the author of \"Free Agent Nation\" host?",
        "response": "\"Crowd Control\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Did The Threepenny Opera and Macbeth have the same writers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "21st AVN Awards  was co-hosted by what American enterpreneur who has been called \"The Queen of Porn\"",
        "response": "Jenna Jameson",
        "source": "hotpot_qa"
    },
    {
        "query": "John Alexander is the uncle of an English professional footballer who made his senior debut in what year?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Toby Rand and Holly Johnson both nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these artists is older, Warrel Dane or Roy Khan?",
        "response": "Warrel Dane",
        "source": "hotpot_qa"
    },
    {
        "query": "Martha Alma Wall was born in what Kansas county?",
        "response": "Marion County",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that created Doravirine ( from?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Undead Nation in the Warhammer Fantasy universe which is home of the Tomb King? ",
        "response": "Khemri",
        "source": "hotpot_qa"
    },
    {
        "query": "what Newark NHL team selected a Canadian professional ice hockey player in 2008?",
        "response": "New Jersey Devils",
        "source": "hotpot_qa"
    },
    {
        "query": "Wagnney Silva Fabiano-Santos practiced martial arts with the company that was founded in what location?",
        "response": "Las Vegas, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "George Edmond Manley (born September 17, 1965 in Sacramento, California) is an American voice artist, novelist and screenplay writer, he attended which comprehensive public university, located in San Jose, California, United States, majoring in theatre arts, University of Nevada, Reno, majoring in journalism and holds his associate of science degree in Computer Information Systems? ",
        "response": "San Jose State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Avie Tevanian and Tanya Seghatchian were both vice presidents of what company?",
        "response": "Apple",
        "source": "hotpot_qa"
    },
    {
        "query": "First airing in 1999, this show features the fictitiius place \"rock bottom\".",
        "response": "\"SpongeBob SquarePants\", created by former marine biologist and animator Stephen Hillenburg",
        "source": "hotpot_qa"
    },
    {
        "query": "What song does Ozzy refer to in his song \"Dreamer\"  that was written by John Lennon, that encourages a world at peace?",
        "response": "Imagine",
        "source": "hotpot_qa"
    },
    {
        "query": "Ryan Northcott played an American musician who co-founded what?",
        "response": "the Beach Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack Taylor officiated a match that was contested by what teams? ",
        "response": "Netherlands and West Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "What director is slated to direct the story of punk musician Brian Theodore Deneke?",
        "response": "Jamie Ryan Scott Brooks",
        "source": "hotpot_qa"
    },
    {
        "query": "How many doors did the first car to run Integrated Motor Assist have?",
        "response": "three-door",
        "source": "hotpot_qa"
    },
    {
        "query": " Liam Aiken played Klaus Baudelaire in a 2004 film directed by who?",
        "response": "Brad Silberling",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Wilhousky arranged which song written by Julia Word Howe?",
        "response": "Battle Hymn of the Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Historicallly-based documentary was released first, The Silent Historian by Dutch filmmaker Simonka de Jong, or Restrepo, directed by American journalist Sebastian Junger?",
        "response": "Restrepo",
        "source": "hotpot_qa"
    },
    {
        "query": " Emmanuelle Seigner is a French actress known for her roll in a mystery thriller film compared unfavorably to what supernatural film?",
        "response": "Rosemary's Baby",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Queen of Shops was presented by a lady that was born in what year?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Jacob stared in Danny Roane: First Time Director but is also in a band which formed in what year?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What action-adventure video game for the PlayStation Portable is a continuation of a game developed by Ubisoft?",
        "response": "Assassin's Creed: Bloodlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean Singer is also an actress: Park Bom or Hahm Eun-jung?",
        "response": "Hahm Eun-jung",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the song writer who wrote \"I Pretend\" that was born in Stepney?",
        "response": "Des O'Connor",
        "source": "hotpot_qa"
    },
    {
        "query": "A water dragon in England known as a peg powler is similar to a water spirit connected to the monster in 'Beowul' called what?",
        "response": "Grindylow",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the international committee that supervises the SEA Games based?",
        "response": "Lausanne, Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Claims that its bladeless fans produce a more constant airflow than traditional fans were made by a company that employs more than how many people worldwide?",
        "response": "7,000",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2003, the Lambeth Commission on Communion was appointed by the Anglican Communion to study problems stemming from the consecration of Gene Robinson, the first noncelibate self-identifying gay priest to be ordained as an Anglican bishop, in the Episcopal Church, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexey Yurevich Zhukanenko is a basketball player for a professional basketball club from Pasvalys, Lithuania, that currently plays in what league?",
        "response": "LKL league",
        "source": "hotpot_qa"
    },
    {
        "query": "In what romantic comedy-drama directed by Ted Demme did Matt Dillon star in?",
        "response": "Beautiful Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress and singer, played roles in the films \"Trixie\" and \"Clueless\"?",
        "response": "Brittany Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "Suzanne Simone Baptiste Louverture is the wife of the leader of which revolution?",
        "response": "the Haitian Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "What Smiths band member has been cited as an influence on artist Lil Tuffy?",
        "response": "Morrissey",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jamaica Kincaid and Stephen Dixon writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "To whom did this WBA heavyweight champion, that Joe Hipp challenged the championship for in 1995 as the first Native American, lose via knockout?",
        "response": "Mike Tyson",
        "source": "hotpot_qa"
    },
    {
        "query": "Vishwavir Ahuja is the CEO of what scheduled commercial bank that is headquartered in Maharashtra, India?",
        "response": "RBL Bank Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Sri Lankan cricketer established a record with Sanath Jayasuriya while on the Indian cricket team in Sri Lanka in 1997?",
        "response": "Roshan Mahanama",
        "source": "hotpot_qa"
    },
    {
        "query": " Tangier, Virginia and Star-Spangled Banner National Historic Trail are located where?",
        "response": "Chesapeake Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "The Red Paintings album Feed the Wolf included \"Sing\" a cover song that was originally sang by a band who discribed their style as what?",
        "response": "Brechtian punk cabaret",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsey McDonald is portrayed by an American actor and singer-songwriter who is known for movies including Just Married, Taxi, and what else?",
        "response": "Secondhand Lions",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the compser of In My Time born and raised?",
        "response": "Kalamata, Greece",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Gotta Get to You\" released in which year, is a song written Blaine Larsen, Jim Lauderdale and Jimmy Ritchey, and recorded by American country music artist George Strait, an American country music singer, songwriter, actor, and music producer?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rutles 2 is a modern re-telling of a 1978 mockumentary which satirizes which band?",
        "response": "The Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American sitcom television series broadcast on Fox did Sofia Black-D'Elia appear on in 2017?",
        "response": "The Mick",
        "source": "hotpot_qa"
    },
    {
        "query": "What car was manufactured alongside The Silver Wraith at the Bentley Motors Limited plant in Cheshire, England?",
        "response": "Bentley Mark VI",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor who starred in The Finest Hours born?",
        "response": "1980",
        "source": "hotpot_qa"
    },
    {
        "query": "The Spice Girls were an English pop girl group formed in 1994, the group originally consisted of Geri Halliwell (\"Ginger Spice\"),  Geraldine Estelle \"Geri\" Horner is an English pop singer-songwriter, clothes designer, author and actress, born when?",
        "response": "6 August 1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retired American football player played defense for the 1983 Dallas Cowboys, and briefly left football in 1979 to pursue a career in boxing?",
        "response": "Ed \"Too Tall\" Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Jagmo designed posters for which Nigerian multi-instrumentalist, musician, composer, pioneer of the Afrobeat music genre, human rights activist, and political maverick?",
        "response": "Fela Kuti",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicole Mitchell Murphy was married to the comedian who was a regular cast member on what show?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "What came into existence first, Cage9 or the singer Christian Burns?",
        "response": "Christian Anthony Burns",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: Sir Partha Sarathi Dasgupta was he Frank Ramsey Professor Emeritus of Economics at St. John's College, which is a constituent college of?",
        "response": "University of Cambridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was drafted by the Pittsburgh Steelers in the fourth round of the first draft presided over by new NFL Commissioner Roger Goodell?",
        "response": "Ryan McBean",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Clarence Brown and Peter Glenville of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town that Manfred Linzmaier was born in?",
        "response": "18,400",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1974 television special was a prequel to a 1978 television animated special, in which the 1978 special used the vocal talents of one of the members of \"The Blues Brothers\"",
        "response": "The Gift of Winter",
        "source": "hotpot_qa"
    },
    {
        "query": "How many school districts are in the region where the second Peter Luger Steak House is located?",
        "response": "one school district",
        "source": "hotpot_qa"
    },
    {
        "query": "Brandywine Avenue School was a historic school located at Schenectady in Schenectady County, New York, from 1975 to 1996, it housed Schenectady City School District administrative offices and records storage, the Schenectady City School District is a public city school district in the city of Schenectady in central Schenectady County, in which state?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one has the most species, Titanopsis or Spathiphyllum?",
        "response": "Spathiphyllum",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of works were written by James Hanley and Mario Puzo?",
        "response": "novel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two plants, Macropidia or Hippophae, is the sole species of its kind?",
        "response": "Macropidia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the owner of the production company best known for titles including a 2007 film adaptation of a 1999 Neil Gaiman novel. ",
        "response": "Matthew Vaughn",
        "source": "hotpot_qa"
    },
    {
        "query": "The Voyage that Shook the World was commissioned by what non-profit organisation that has locations in Australia, Canada, New Zealand, South Africa, the United Kingdom, and the United States?",
        "response": "Creation Ministries International",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the real name of Alex Andreas's potrayal on satge of The Big Bopper?",
        "response": "Perry \"J. P.\" Richardson Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "For which instrument did this German composer write a textbook, whose portrait was painted by Pietro Lorenzoni in 1765?",
        "response": "violin",
        "source": "hotpot_qa"
    },
    {
        "query": "Following a season in which the Sacramento Kings won three of their first four games before proceeding to lose 12 of their next 13 games, who signed for the Phoenix Suns?",
        "response": "Wayman Tisdale",
        "source": "hotpot_qa"
    },
    {
        "query": "The Forerunner was a monthly magazine produced by Charlotte Perkins Gilman (best known as the writer of \"The Yellow Wallpaper\"), a 6,000-word short story by American writer Charlotte Perkins Gilman, first published in The New England Magazine, in what year?",
        "response": "1892",
        "source": "hotpot_qa"
    },
    {
        "query": "Grupo Modelo, a financial backer of the AAA Lucha Libre World Cup professional wrestling tournament, shares what percentage of the Mexican beer market?",
        "response": "63%",
        "source": "hotpot_qa"
    },
    {
        "query": "Moon Hee-joon and Jesse Michaels, share which occupations?",
        "response": "singer-songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sports agent represents the player who was the first overall pick of the 2010 NBA draft?",
        "response": "Rich Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the given name of the Jackson, Mississippi mayor succeeded by Tony Yarber?",
        "response": "Edwin Finley Taliaferro",
        "source": "hotpot_qa"
    },
    {
        "query": "Giuseppe Motta was a member of a council that has how many members ?",
        "response": "seven-member",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the The Free Socialist Party/Marxist-Leninists party developed?",
        "response": "1950s",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the city that has the license to the Christian station KGCR?",
        "response": "4,489",
        "source": "hotpot_qa"
    },
    {
        "query": "Which theatre is in the London Borough of Hackney and had a performance of The Birth of Merlin in the 1600s?",
        "response": "Curtain Theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Grand Theft Auto: The Ballad of Gay Tony was an expansion for the game published by which company?",
        "response": "Rockstar Games",
        "source": "hotpot_qa"
    },
    {
        "query": "From which 19th centurey acts does Tennesee State University receive benefits?",
        "response": "Morrill Acts",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the actress who worked on both \"Alvin and the Chipmunks: The Squeakquel\" and the first four \"Scary Movie\" films raised?",
        "response": "north of Seattle in Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the majority owner of the NFL team that drafted Alex Brink in 2008?",
        "response": "Bob McNair",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Peter Cattaneo and Seth Grahame-Smith, who has had a more diverse career?",
        "response": "Seth Grahame-Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "What relates to the traditions of Northern Ireland particularly for the Protestant/unionist community, and one of the region's most prominent types of folk art ?",
        "response": "Culture of Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the location of this recently retired domed stadium in the southeastern United States, which was developed by the same authority that developed the Georgia World Congress Center?",
        "response": "Atlanta, Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Nana\" Kimati Dinzulu performed live with which professor emerita at Princeton University?",
        "response": "Toni Morrison",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NFL team drafted the senior quarterback of the 2002 Texas Longhorns?",
        "response": "Tampa Bay Buccaneers",
        "source": "hotpot_qa"
    },
    {
        "query": "The river adjacent to Pelican Point is located to the north of what district?",
        "response": "Adelaide central business district",
        "source": "hotpot_qa"
    },
    {
        "query": "John Marshall was the fourth Chief Justice of the Supreme Court of the United States and served as Secretary of State under what American patriot who served as the second President of the United States?",
        "response": "John Adams",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Broaddus, was Mayor of Louisville, Kentucky from December 1953 to December 1957, after serving in the Navy during World War I he attended Centre College, a private liberal arts college located in Danville, Kentucky, a community of approximately 16,000 in Boyle County, about 35 miles (55 km) south of Lexington, in which state?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "What album not only released in 2017 but also had a tour dedicated to it?",
        "response": "Synthesis",
        "source": "hotpot_qa"
    },
    {
        "query": "What Filipino playright wrote a zarzuela about the archipelago that Ferdinand Magellan claimed for the king of Spain on Easter Sunday, 32 March, 1521?",
        "response": "Severino Reyes",
        "source": "hotpot_qa"
    },
    {
        "query": "Georg Unger played the role of Siegfried in which cycle of four Wagner dramas?",
        "response": "Der Ring des Nibelungen",
        "source": "hotpot_qa"
    },
    {
        "query": "Rivers and Tides is a soundtrack to the film about the sculptor who lives in what country?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first, \"The Book of Masters\" or \"A Tiger Walks\"?",
        "response": "A Tiger Walks",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote about Jonathan Luther?",
        "response": "Freeman H. Hubbard",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wife stars the actress of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What horror film did Heather Langenkamp star in during 2016?",
        "response": "Home is a 2016 American horror film directed by Frank Lin and starring Heather Langenkamp",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English military leader was the father of  Elizabeth Capell, Countess of Essex",
        "response": "Algernon Percy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bamboko are a Bantu ethnic group of the Republic of Cameroon, Bantu peoples is used as a general label for the 300–600 ethnic groups in which continent, who speak Bantu languages?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What business founded in 1998 and have sports holdings include: the National Football League's New England Patriots, major League Soccer's New England Revolution and the stadium in which both tems play, Gillette Stadium?",
        "response": "Kraft Group",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the English actor from the film The System die?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "Bridgewater Trustees major source of income came from a canal that was commissioned by whom/",
        "response": "Francis Egerton",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 Tampa Bay Buccaneers season was the club's 35th season as a franchise in the NFL, in the 2010 NFL Draft, the Buccaneers had the third overall pick in which they selected Gerald Keith McCoy Jr. (born February 25, 1988) is an American football defensive tackle for the Tampa Bay Buccaneers of which organization?",
        "response": "National Football League (NFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Tate Taylor directed the movie The Girl On The Train that was based on who's bestselling book?",
        "response": "Paula Hawkins",
        "source": "hotpot_qa"
    },
    {
        "query": "In the \"Star Trek\" franchise, DeForest Kelley portrayed a character aboard which starship? ",
        "response": "USS \"Enterprise\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Power Grid and Vanished Planet both cooperative board games?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fault in Our Stars is a romantic drama film that stars what American actress and activist that was born in San Bernardino County, California, and was raised in the Simi Valley?",
        "response": "Shailene Diann Woodley",
        "source": "hotpot_qa"
    },
    {
        "query": "Since when has the incumbent challenged by R.J. Harris in 2010 served in Congress?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Taedonggang beer is the leading brand produced by a state-owned brewery in which Asian city?",
        "response": "Pyongyang",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1939 film Gunga Din with actor Cary Grant?",
        "response": "George Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "Josh Aubrey played college football at a school in what city?",
        "response": "Nacogdoches, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "The Royal Hop Pole is now part of a pub chain founded by what man?",
        "response": "Tim Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the character played by Peter Sellers in the movie that inspired Mastermind?",
        "response": "Inspector Jacques Clouseau",
        "source": "hotpot_qa"
    },
    {
        "query": "Knockout song was from which album of Lil Wayne on Cash Money Records ?",
        "response": "Rebirth",
        "source": "hotpot_qa"
    },
    {
        "query": "What Arabian stallion born in 1971 starred in the 1983 film adaptation of a book of the same name by Walter Farley?",
        "response": "El Mokhtar",
        "source": "hotpot_qa"
    },
    {
        "query": "Heeb and Who Put the Bomp, are media of what type?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the fighter in Battle of Gavinana was created in 1422, and came to an end when the Holy Roman Empire was wound up in 1806, as the result of the Napoleonic Wars?",
        "response": "Army of the Holy Roman",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who starred as Keith/Flash in the Odyssey was born on which day ?",
        "response": "July 26, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "The convention where Star Wars: X-Wing Miniatures Game was released had how many unique attendees in 2015?",
        "response": "61,423",
        "source": "hotpot_qa"
    },
    {
        "query": "Park Jung-woo, is a South Korean film director and screenwriter, his third feature is which 2012 South Korean science fiction thriller film starring Kim Myung-min, Kim Dong-wan, Moon Jung-hee and Lee Ha-nui?",
        "response": "Deranged",
        "source": "hotpot_qa"
    },
    {
        "query": "What Arab absolute monarchy country can you find the sooty gull?",
        "response": "Oman",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the retired Indian track and field athlete coached by O. M. Nambiar born? ",
        "response": "27 June 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the video games in which Troy Baker has his voice was developed by Atlus for PlayStation 3 and Xbox 360? ",
        "response": "Catherine",
        "source": "hotpot_qa"
    },
    {
        "query": "How did Hugh Lane die?",
        "response": "Hugh Lane died on board the RMS Lusitania.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country did the commercial television broadcaster which airs Monday Monday become the first indigenous broadcaster? ",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose defeat ended the anti-Polish campaign that began with the idea to unify all the German and possibly also Germanic-speaking peoples in a single nation-state known as \"Großdeutschland\".?",
        "response": "Nazi Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 Oklahoma Sooners football team represented the University of Oklahoma in the 2015 NCAA Division I FBS football season, the 121st season of Sooner football, the team was led by which two-time Walter Camp Coach of the Year Award winner, who?",
        "response": "Bob Stoops",
        "source": "hotpot_qa"
    },
    {
        "query": "A licensed clinical social worker who currently writes the column \"Divorce Busting: Busings From an Unabashed Marriage Save\" in a magazine published every two months in the United States, is often quoted in the media regarding what?  ",
        "response": "divorce prevention",
        "source": "hotpot_qa"
    },
    {
        "query": "Who began the colonization of the area that Jesuit missionary Claude Aveneau resided?",
        "response": "Jacques Cartier",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Almond and the Clianthus both plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What years did the baseball player for whose name is used in the alternate name for the Estadio Nacional de Panama play for the Minnesota Twins and the California Angels?  ",
        "response": "1967 to 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Hollywood Babble-On is a weekly podcast featuring filmmaker Kevin Smith and which American radio personality/actor/voice over artist, and radio host best known as the host of \"The Joe Schmo Show\", for his voice work on the Fox animated series \"Family Guy\"? ",
        "response": "Ralph Garman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle ended first, Battle of the Bulge or Battle of Anzio?",
        "response": "Battle of Anzio",
        "source": "hotpot_qa"
    },
    {
        "query": "Silent Night, Deadly Night is a 1984 American slasher film directed by Charles E. Sellier, Jr., and starring which American actress and singer best known for her performance in the stage and film versions of \"Godspell\" in the early 1970s?",
        "response": "Gilmer McCormick",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the election took place in 2012 in which Ovide Marc Lamontagnewas his party's nominee for Governor of New Hampshire?",
        "response": "November 6, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Popoitto Station Hebereke was a video game developed for a gaming brand created and owned by who since December 3, 1994?",
        "response": "Sony Interactive Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Enkyo Pat O'Hara is a former professor of interactive media at a school founded in what year?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the group with the song \"Commonwealth\", released only on bootleg, dispand?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed, produced, and wrote a Thomas and Friends film that incorporated elements from Shining Time Station?",
        "response": "Britt Allcroft",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1962 Miami Redskins football team represented Miami University in a conference with how many full member schools?",
        "response": "twelve",
        "source": "hotpot_qa"
    },
    {
        "query": "Plattsburgh International Airport and Vero Beach Regional Airport, are which type of airport?",
        "response": "public",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Guanghan and Huiyang District both in the Guangdong province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is home to both Vytenis Jasikevičius and the National Basketball League?",
        "response": "Lithuania",
        "source": "hotpot_qa"
    },
    {
        "query": "St. George Maronite Cathedral, Beirut, was inspired by the Basilica di Santa Maria Maggiore, are both from which religion?",
        "response": "Catholic",
        "source": "hotpot_qa"
    },
    {
        "query": "What college basketball team did the color commentator of NBA Jam 99 play for?",
        "response": "UCLA Bruins",
        "source": "hotpot_qa"
    },
    {
        "query": "The film \"Open Range\" was dedicated to the memory of the parents of one of the actors; who was the actor? ",
        "response": "Kevin Costner",
        "source": "hotpot_qa"
    },
    {
        "query": "Jay Rifkin partnered with Hans Zimmer to score what movie about an abrasive, selfish young wheeler-dealer who has an autistic brother?",
        "response": "Rain Man",
        "source": "hotpot_qa"
    },
    {
        "query": "What electro-pop musician was born on September 11th 1971?",
        "response": "Alessandra Rosaldo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a medium-lift helicopter used in military and civilian applications, and which is used by the Canadian forces as an air-sea rescue vehicle?",
        "response": "AgustaWestland AW101",
        "source": "hotpot_qa"
    },
    {
        "query": "The Guangdong Pumped Storage Power Station or Guangzhou Pumped Storage Power Station, is a pumped-storage hydroelectric power station near Guangzhou, traditionally romanised as Canton, is the capital and most populous city of the province of Guangdong, in which southern region of the country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Aden Robleh Awaleh is a politician of what country located in the Horn of Africa?",
        "response": "Djibouti",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert I carried out a raid in 1322 that resulted in which battle?",
        "response": "Battle of Old Byland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is critically acclaimed, Danny Leiner or Todd Solondz?",
        "response": "Todd Solondz",
        "source": "hotpot_qa"
    },
    {
        "query": "The Commission to Investigate Alleged Police Corruption (known informally as the Knapp Commission) became informed of Frank Serpico's police corruption by him doing what?",
        "response": "whistleblowing",
        "source": "hotpot_qa"
    },
    {
        "query": "What university has the largest enrollment at a single campus and has the JOhn Euliano Park stadium?",
        "response": "University of Central Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Morten Hansen portrayed the character of Finn in a Norwegian dark fantasy film directed by who?",
        "response": "André Øvredal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which deity, who is often depicted carrying a sword and sitting on a buffalo, has a temple dedicated to them in Dombivli near Mumbai?",
        "response": "Shani",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release year of this American comedy drama film directed by an Iranian born Swiss film director and producer, born August 26, 1941, and starring Mickey Rourke and Faye Dunaway?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "bTV is the first private national-wide broadcasting television channel in Bulgaria, it was previously owned by Balkan News Corporation, part of which American multinational mass media corporation headquartered in New York City?",
        "response": "News Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "\"No One Gonna Love You\" is a song recorded by American singer Jennifer Hudson, the song has also been sampled by J. Cole in the single \"Crooked Smile\" off his second studio album, titled what?",
        "response": "Born Sinner",
        "source": "hotpot_qa"
    },
    {
        "query": "The album Éxitos y Recuredos spotlights which American singer known as the Queen of Tejano music?",
        "response": "Selena",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian government tag was given to the handicraft known for making simple loose clothing worn over the shoulders?",
        "response": "Geographical Indication tag",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the author of \"The Book of All Flesh\" born?",
        "response": "Quincy, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "South Hadley High School became known for the suicide of a girl on what day?",
        "response": "January 14, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Draba and Corylopsis in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the dean of an international business school located in Paris, France that is widely considered to be one of the most prestigious and selective graduate schools in the world, between 1996 and 2015?",
        "response": "Bernard Ramanantsoa",
        "source": "hotpot_qa"
    },
    {
        "query": "Anne Frank Remembered and The Root of All Evil? are both what?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "What song included in Megamix was originally written and recorded by The Melodians?",
        "response": "Rivers of Babylon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of Luc Besson and Pan Anzi?",
        "response": "Director",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Harry Keller and Marc Webb both ffilm directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What American scientist was the De Broglie–Bohm theory named after?",
        "response": "David Bohm",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the band, whose seventh studio album is Drones, formed ?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American writer who published her first book in 1963 and has since published novels such as My Sister, My Love?",
        "response": "Joyce Carol Oates",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the upcoming American comedy-drama film starring the actress who played the role of Spencer Hastings in Freeform's \"Pretty Little Liars\"?",
        "response": "Richard Linklater",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the developer behind the hill resort located 80 km northeast of Kuala Lumpur?",
        "response": "Genting Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hijacked a flight taking off in San Francisco using Boeing's only model of trijet aircraft?",
        "response": "Clay Thomas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band's song was used as the theme at the Pepsi Arena on January 8, 2006?",
        "response": "Disturbed",
        "source": "hotpot_qa"
    },
    {
        "query": "The Artists and Writers Ball was founded in the late 1970s as an alternative to which festival which is held every year in Tampa and hosted by Ye Mystic Krewe of Gasparilla?",
        "response": "Gasparilla Pirate Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "Garden of Shadows explains the origin of the grandmother from the first book in which V. C. Andrews series?",
        "response": "Dollanganger Series",
        "source": "hotpot_qa"
    },
    {
        "query": "An example of a hidden asset is a frequent flier program that was chosen for a combined airline in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the father of the Colorado beauty pageant queen murdered in 1996 born?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the author of \"Treatise on Tolerance\"?",
        "response": "François-Marie Arouet",
        "source": "hotpot_qa"
    },
    {
        "query": "The Delegates were a novelty song group who scored a hit in the United States in 1972, Bob and the two record men made a record, with reporters asking questions of current politicians, involved in that year's presidential election, such as Thomas Francis \"Tom\" Eagleton, was a United States Senator from Missouri, serving from 1968 to what year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Saving the Wildlife is an album by a music group that sold how many albums ?",
        "response": "28 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which United States Army on which The Conscientious Objector was based was born on February 7, 1919?",
        "response": "Desmond Doss",
        "source": "hotpot_qa"
    },
    {
        "query": "Screenwriter Eric Roth co-wrote the Oscar-nominated film \"Munich\", which was based on what real-life event?",
        "response": "Operation Wrath of God",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country were the second Summer Olympics at which Hanna Titimets represented Ukraine celebrated?",
        "response": "Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American singer-songwriter lip-synched lyrics for Elton John?",
        "response": "Justin Timberlake",
        "source": "hotpot_qa"
    },
    {
        "query": "The Age of Innocence starred the English actor who was born and raised in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1966 crime film that starred the actress who played Myrna Gibbons on \"The Doris Day Show\"?",
        "response": "Bernard Girard",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lacey Sturm and Third Day from the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the pogrom during which Schiffschul was destroyed?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the football program Chris Chamberlain played in while going to college?",
        "response": "Tulsa Golden Hurricane football",
        "source": "hotpot_qa"
    },
    {
        "query": "What the name of the the owner of the newspaper which was housed in the Journal Building?",
        "response": "MaineToday Media",
        "source": "hotpot_qa"
    },
    {
        "query": "Third Hawkins decided to disband at which music hall and begin a career in production?",
        "response": "Apollo Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "How many miles is the running event held every Saturday morning in fifteen countries across five continents?",
        "response": "3.1 miles",
        "source": "hotpot_qa"
    },
    {
        "query": " Gina Cerminara published a book based on her years of research of an American Christian mystic who was given what nickname?",
        "response": "The Sleeping Prophet",
        "source": "hotpot_qa"
    },
    {
        "query": "The words to \"One Morning in May\" were written by an American lyricist born in what year?",
        "response": "1900",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player on the 1979-80 Manchester United team has also been a football coach and manager with Queens Park Rangers?",
        "response": "Ray Wilkins",
        "source": "hotpot_qa"
    },
    {
        "query": "What Icelandic singer recorded the song \"Alarm Call\" from the album \"Homogenic\" that was produced in London and recorded in Spain?",
        "response": "Icelandic singer Björk",
        "source": "hotpot_qa"
    },
    {
        "query": "How did the bass guitar player for Sing a Simple Song refer to his technique?",
        "response": "thumpin' and pluckin'",
        "source": "hotpot_qa"
    },
    {
        "query": "The commerce of Zuber, Florida is supported by its proximity to an interstate that has what speed limit for its entire length in Florida?",
        "response": "70 mph",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2006 German-American political war thriller film for which James Newton Howard made the film score?",
        "response": "Edward Zwick",
        "source": "hotpot_qa"
    },
    {
        "query": "What recorder of I Saw Mommy Kissing Santa Claus starred in The Two Little Bears?",
        "response": "Jimmy Boyd",
        "source": "hotpot_qa"
    },
    {
        "query": " Jessie Willcox Smith illustrated stories and articles for clients such as a and news magazine founded in what year?",
        "response": "1855",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did Veda Hlubinka-Cook have in the making of this 1997 video game that takes place on the Orient Express, days before the start of World War I?",
        "response": "technical director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Japanese fighter was the predecessor of the \"Reisen?\"",
        "response": "The Mitsubishi A5M",
        "source": "hotpot_qa"
    },
    {
        "query": "A. P. Møller School is named after the Danish shipping magnate who founded what company in 1904?",
        "response": "A.P. Moller-Maersk Group",
        "source": "hotpot_qa"
    },
    {
        "query": "The Reunion, released in which year, an American action film, starring Boyd Holbrook, an American actor and fashion model?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of the child who's death inspired \"Tears in Heaven\" was named number five in what magazine's \"The 10 Best Electric Guitar Players\"? ",
        "response": "Time",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Conservative predecessor of current Macclesfield representative David Rutley resigned causing a 1939 by election?",
        "response": "John Remer",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the nuclear physicist responsible for the book \"Concepts of Physics\"?",
        "response": "Indian",
        "source": "hotpot_qa"
    },
    {
        "query": "A 1978 thriller film based on a book by Edward N. Luttwak stars David Hemmmings and a Shakespearean actor that performed at what theater?",
        "response": "Bristol Old Vic",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Charles Palliser or David Eddings?",
        "response": "David Eddings",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Lord of the Rings or Blokus win more awards?",
        "response": "Blokus",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Florida Canal and Ohio and Erie Canal both river canals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine has been published in more media formats, Twist or Inside Sports?",
        "response": "Twist",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin is Electronic Arts and it's former CEO, John Riccitiello?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the director of the British joint-stock company founded in 1711?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What Jerymn Street selective school founded a multi-Academy trust with Carre's Grammar School?",
        "response": "Kesteven and Sleaford High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the college attended by Max Finstein founded?",
        "response": "Black Mountain, North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which label released the album whose song was debuted during Metallica's appearance on the Howard Stern Show in 2016?",
        "response": "Blackened Recordings",
        "source": "hotpot_qa"
    },
    {
        "query": "Before Dennis Wayne joined Dennis Wayne's Dancers, what city was his ballet company based in?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat Olympic gymnast who was on the 1984 team with Tim Daggett owns a gymnastics academy? ",
        "response": "Bart Conner",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the film \"Home on the Range\" released before the comic book \"Ruse\"?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did funny animal cartoon character, Minnie Mouse, appear in  Mickey's Orphans?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known for nonlinear storylines, Richard Donner or Quentin Tarantino?",
        "response": "Quentin Jerome Tarantino",
        "source": "hotpot_qa"
    },
    {
        "query": "Decommissioning in Northern Ireland was a process in the Belfast Agreement as part of the Northern Ireland peace process, the Northern Ireland peace process is often considered to cover the events leading up to which year, Provisional Irish Republican Army (IRA) ceasefire, the end of most of the violence of the Troubles, the Good Friday (or Belfast) Agreement of 1998, and subsequent political developments?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mine creased production first, Colomac Mine and Con Mine?",
        "response": "Colomac Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Game 1 of the 2014 National League Championship Series was simulcast and hosted by a former Major League Baseball what?",
        "response": "outfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink required fewer ingredients to make at a bar, a shot of Amaretto or a glass of Orange Tundra?",
        "response": "Amaretto",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Anthony Green and Serj Tankian have in common?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "The North American Boxing Association (NABA) is a boxing governing body, affiliated with the World Boxing Association (WBA), recognizes how many weight classes?",
        "response": "17",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the the seventh studio album, and the Quincy Jones produced second single, from Michael Jackson? ",
        "response": "Bad",
        "source": "hotpot_qa"
    },
    {
        "query": "What cable and digital satellite TV network dedicated to kids broadcasts in Malta, Romania, Hungary, the Czech Republic, and Croatia?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": " Honour Me and Sacred Planet are both what?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the person who created the Wicked Awesome Records label currently most highly sought after for work?",
        "response": "Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "12 Golden Country Greats is Ween's fifth album, and third on Elektra Records, Ween is an American alternative rock band formed in New Hope, Pennsylvania, in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former Italian footballer born in 1961 scored a goal against FC Barcelona in the final of the UEFA Champions League?",
        "response": "Daniele Massaro",
        "source": "hotpot_qa"
    },
    {
        "query": "Pileostegia and Billbergia, are native to Asia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In This World includes a song that has a sample from the film director of what nationality?",
        "response": "French-Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Alberto \"The Shadow\" in \"Scarface\" also starred with Jason Patrick in a 2015 horror film written by who?",
        "response": "Ido Fluk",
        "source": "hotpot_qa"
    },
    {
        "query": "Snow White and the Seven Dwarfs was a ballet rising from the success of the ballet composed by whom?",
        "response": "Sergei Prokofiev",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist was educated in London, C. S. Forester or Helen Zahavi?",
        "response": "Helen Zahavi",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward J. Nately III is a character in a Joseph Heller novel that was first published in what year? ",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Which symbiotic characters were introduced in the two-part episode of Spider-Man? ",
        "response": "Venom and Carnage",
        "source": "hotpot_qa"
    },
    {
        "query": "The Patchogue-Medford High School campus was renamed after a US Navy SEAL that died in what year?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "SpongeBob's Truth or Square was released on the date that the video game was released as the second in the line for which game console?",
        "response": "PlayStation Portable",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mike Ness and Marc Bolan both guitarists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was found first, Beanland Mine or Burwash Mine?",
        "response": "Beanland Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Raoulia and Commidendrum belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Friede was designed by a physicist of what nationality?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the team who won the 2003 Hungarian Grand Prix begin to be associated with Formula One?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lake Koocanusa Scenic Byway begins in what county?",
        "response": "Lincoln County",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American attorney and businessman died who gained national recognition as O. J. Simpson's friend and was a member of Dream Team?",
        "response": "September 30, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "What German association football club does Konrad Laimer play for?",
        "response": "RB Leipzig",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Carnegie Hall Tower located in the same city as Staten Island?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Rafe Hernandez is a fictional character who played with Chrishell Stause's charachter on Days of our live?",
        "response": "Jordan Ridgeway",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Serra was one of four fighters to win both the Ultimate Fighter and UFC welterweight classifications, along with the police officer from what state?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of film does Burden of Dreams and The Judge and the General fall under?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the character on Grey's Anatomy, played by the same actor who portrayed Rev James Lawson in \"Lee Daniel's The Butler\", debut?",
        "response": "season six, episode 5, \"Invasion\"",
        "source": "hotpot_qa"
    },
    {
        "query": "This Old Cub includes an interview with an NFL player who played what position and was the son of a coal miner?",
        "response": "linebacker",
        "source": "hotpot_qa"
    },
    {
        "query": "What law enacted in 1976 has the EPA delegated to the Oregon Department of Environmental Quality the authority to administer in within the state of Oregon?",
        "response": "Resource Conservation and Recovery Act",
        "source": "hotpot_qa"
    },
    {
        "query": "In what show does Frederick G. Nolan seek the treasure of historical artifacts on an island of the coast of Nova Scotia, Canada?",
        "response": "The Curse of Oak Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Wal-Mart: The High Cost of Low Price and Sweet Crude both documentary films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  Dutch film director who directed \"Soldier of Orange\", born",
        "response": "18 July 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the teams Tom Miller played for dates back to 1919 ?",
        "response": "Green Bay Packers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NFL football team that plays its home games in New York did Nevil McCaskill play for?",
        "response": "Buffalo Bills",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the man who wrote the lyrics of \"Last Night When We Were Young\" an ardent critic of?",
        "response": "religion",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kentucky–Vanderbilt football rivalry is an American college football rivalry between the Kentucky Wildcats football team of the University of Kentucky and Vanderbilt Commodores football team of Vanderbilt University, this rivalry is Kentucky's second longest behind which college sports rivalry between the University of Kentucky Wildcats and the University of Tennessee Volunteers?",
        "response": "Kentucky–Tennessee rivalry",
        "source": "hotpot_qa"
    },
    {
        "query": "Dangerous is a book by which political commentator?",
        "response": "Milo Yiannopoulos",
        "source": "hotpot_qa"
    },
    {
        "query": "Is The Hub taller than 56 Leonard Street?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the village where Jonnie Boer was born usually referred to?",
        "response": "Little Venice",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music group released The Pulse EPs?",
        "response": "electronic",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two fighters in the \"Rumble in the Jungle\" which one is also an ordained minister?",
        "response": "George Foreman",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both Gerald Green and Allen Drury?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Hires Root Beer and Vernors have in common?",
        "response": "soft drink",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ginger and Paul Carrack English singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Castle Rock Mountain is in a wilderness created from existing National Forest lands in 1978 and is composed of how many acre?",
        "response": "944,000",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 Libyan Super Cup took place in the capital that projects into what body of water?",
        "response": "Mediterranean",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1973 American Western film that  adapted from a 1969 novel by Milton R. Bass, that starred an actor known as the voice of The Beast in the Disney animated film \"Beauty and the Beast\" ?",
        "response": "Jorge Fons",
        "source": "hotpot_qa"
    },
    {
        "query": "What state does 2008 McDonald's All-American Girls Game and Bradley Center have in common?",
        "response": "Wisconsin",
        "source": "hotpot_qa"
    },
    {
        "query": "The longest running hacker conference in the US was run by an ezine first published on what date?",
        "response": "November 17, 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of show hosted by Fern Britton which aired on Channel 4, had a guest who began writing material for the Edinburgh Fringe Festival and making small appearances in various British sitcoms including \"Hyperdrive\" and \"Not Going Out\"?",
        "response": "a British chat show",
        "source": "hotpot_qa"
    },
    {
        "query": "Eobard Thawne was a fictional supervillain in comic books by which company?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2007 Harry Potter film, which is the fifth installment in the \"Harry Potter\" film series, is one of the movies in which Lego Harry Potter: Years 5–7 is based on? ",
        "response": "Harry Potter and the Order of the Phoenix",
        "source": "hotpot_qa"
    },
    {
        "query": "The Magic Labyrinth and Near and Far, have which mutual attributes?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": " Ruud Janssen is a Dutch Fluxus and mail artist currently living in Breda in the Netherlands, also known informally as what?",
        "response": "Holland",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the stage partner of the director of \"Tim's Vermeer\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Rodrigo y Gabriela contributed to a soundtrack for a \"Shrek\" prequel distributed by what company?",
        "response": "Paramount Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did the actress known for her role as Petunia Dursley star in with Daniel Day-Lewis and Ray McAnally?",
        "response": "My Left Foot",
        "source": "hotpot_qa"
    },
    {
        "query": "Eartha is located within the headquarters of a producer of personal satellite tracking, messaging, and navigation technology, whose main product is what?",
        "response": "inReach",
        "source": "hotpot_qa"
    },
    {
        "query": "What private university in Virginia did Jamal Benjamin Brooks play college football at?",
        "response": "Hampton University",
        "source": "hotpot_qa"
    },
    {
        "query": "On which album did Dan Fogelberg's best know song, which had been released as a single 1980, appear?",
        "response": "\"The Innocent Age\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2006 documentary film tells the stories of three Jehovah's witnesses who, amongst other Witness teachings, claim the right to refuse to perform military service on the grounds of freedom of religion?",
        "response": "Knocking",
        "source": "hotpot_qa"
    },
    {
        "query": "Metroshuttle 1 opperated from Mancehster Piccadilly station through what large shopping centre built in the 1970s?",
        "response": "Manchester Arndale",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the family of fruit species in which the Gomugomuwa village is known for cultivating?",
        "response": "Arecaceae",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the position of the person in The Journey?",
        "response": "deputy First Minister of Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played the role of Michael Stivic on \"All in the Family\" and also starred in The Wolf of Wall Street?",
        "response": "Robert Reiner",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the board games Ghosts and Enchanted Forest have a common creator?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Asian Kung-Fu Generation and The Gaslight Anthem rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1994 Jay McInerney wrote a seven-page article for \"The New Yorker\" about an actress that stars with Jena Malone in a 2006 film directed by who?",
        "response": "M. Blash",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Terrel Fitzgerald is best known through his visibility on the Animal Planet an American basic cable and satellite television channel owned by what company?",
        "response": "Discovery Communications",
        "source": "hotpot_qa"
    },
    {
        "query": "What City was English cricketer Chorlton-cum-Hardy born in? ",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Stewart O'Nan or Terry Southern?",
        "response": "Terry Southern",
        "source": "hotpot_qa"
    },
    {
        "query": "William Kong co-produced a Hong Kong/Chinese historical drama war film in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the debut album of the singer whose song \"What I Am\" was sampled in \"Slow Down\" by Brand Nubian?",
        "response": "\"Shooting Rubberbands at the Stars\"",
        "source": "hotpot_qa"
    },
    {
        "query": "How many rooms does the Tropicana Hotel have where the 7th annual Adult Video News awards ceremony were held in 1980?",
        "response": "1,467 rooms",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2009–10 La Liga season was Xerex's first season as well which overall season for La Liga since it's establishment?",
        "response": "79th",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1980 American musical crime comedy film set in Chicago, Illinois, starring John Belushi and Dan Aykroyd was directed by this American film director, screenwriter, actor, and producer who was born in which year?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "What Cuban preisdent overthrew Mary Tarrero-Serrano?",
        "response": "Fulgencio Batista y Zaldívar",
        "source": "hotpot_qa"
    },
    {
        "query": "Nikolay Mitrofanovich Krylov and Anatoly Fomenko both held what academic title?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the country in which Songo - La Maya is located?",
        "response": "Havana",
        "source": "hotpot_qa"
    },
    {
        "query": "This Japanese producer of role-playing games founded in 1986 has has several anime adaptations based on their products, such as Legand of Crystania, Rune Soldier, and another series based on what trading card game?",
        "response": "Monster Collection",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the mixed martial artist in Den of Thieves from?",
        "response": "Waianae, Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "The music of the \"Harry Potter\" film series was recorded and released in conjunction with the post-production and releases of each of how many corresponding films, Jeremy Soule helped write for the \"Harry Potter\" video games, he's an American composer of soundtracks for film, television and video games?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the film directed prior to The Gentle Sex?",
        "response": "\"The First of the Few\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Suicide's 1977 released album features a song based on what brand's comic character?",
        "response": "Marvel",
        "source": "hotpot_qa"
    },
    {
        "query": "Irene is the leader of the girl group formed by which company?",
        "response": "S.M. Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "McKenzie is an unincorporated community in Allegany County, Maryland, it is directly across from which diverse industrial complex, located in Rocket Center, West Virginia?",
        "response": "Allegany Ballistics Laboratory",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was this group formed that has the musician Patrick Keeler whose unreleased tracks were included in Acoustic Recordings 1998–2016?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "The band famous for the single Waterfalls, had a singer with the nickname Left Eye, who was born on what day?",
        "response": "May 27, 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Grzesiek (born June 2, 1994), better known by his in-game name Shroud, is a Canadian professional \"\" and \"PlayerUnknown's Battlegrounds\" player, PlayerUnknown's Battlegrounds (PUBG) is a multiplayer online battle royale video game developed and published by PUBG Corp., a subsidary of which Korean publisher ?",
        "response": "Bluehole",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a Community centre such as Tacoma School used for?",
        "response": "community tend to gather for group activities, social support, public information, and other purposes.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which aired first, Life After People or Werner Herzog Eats His Shoe?",
        "response": "Werner Herzog Eats His Shoe",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the illustrator who Warren Hinckle paired with Hunter S. Thompson in the first Gonzo journalism?",
        "response": "Welsh",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Amesiella and Rhaphidophora both found in the western Pacific?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game has been around for longer Torres or Daldøs?",
        "response": "Daldøs",
        "source": "hotpot_qa"
    },
    {
        "query": "Tanedra Howard, who played Simone Bethson in the 2009 American horror film \"Saw VI\", was the winner of which reality show?",
        "response": "Scream Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "“Suicide Solution” is a song from an album released on which date ?",
        "response": "20 September 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Chance of a Lunchtime\" is an episode of a BBC sitcom writtem by who?",
        "response": "John Sullivan",
        "source": "hotpot_qa"
    },
    {
        "query": "Jared Zabransky played college football at Boise State and was named Offensive Player of the Game which was played in what stadium? ",
        "response": "University of Phoenix Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Romeo Brown was a British comic strip published from 1954 to 1962, on which British national daily tabloid newspaper founded in 1903?",
        "response": "Daily Mirror",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2017 Jo Platt replaced Andy Burnham as Labour MP for Leigh after he left to take which office?",
        "response": "Mayor of Greater Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both the Ariegeois and the German Longhaired Pointer dogs that are breed in Europe?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did Rick Carter work on that depicts a FedEx employee stranded on an uninhabited island?",
        "response": "Cast Away",
        "source": "hotpot_qa"
    },
    {
        "query": "Ruthless Records wasa name used by Chicago and Minneapolis punk bands from 1981 to 1990 including Big Black, an American punk rock band from Evanston, Illinois, active from 1981 to 1987, and founded by singer and guitarist Steve Albini, the band's initial lineup also included guitarist Santiago Durango and bassist Jeff Pezzati, both of which band?",
        "response": "Naked Raygun",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Film, Pete's Dragon or Frozen, is a 3D computer animated musical?",
        "response": "Frozen",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the Socialist People's Party and Astrid Krag, it's Minister of Health and Prevention 2011-2014 from?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "What former World Hockey Association team that Paul Terbenche played were based in Winnipeg, Manitoba?",
        "response": "Winnipeg Jets",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of Rhode Island",
        "response": "Providence",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the actor who starred with Trevor Howard, Sally Gray and Rosamund John in the film Green for Danger ? ",
        "response": "Scottish",
        "source": "hotpot_qa"
    },
    {
        "query": "In what political role did the politican who Alistair Beaton worked as a speechwriter for, serve in the Blair Government? ",
        "response": "Chancellor of the Exchequer",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonna Doolittle Hoppes is an American author whose works include oral histories and biographies,  granddaughter of aviation pioneer and United States Air Force General James Harold Doolittle (December 14, 1896 – September 27, 1993) was an American aviation pioneer, active duty during which event?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the division of Bombardier Inc that owns Downsview Airport?",
        "response": "Dorval, Quebec, Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "The No.8 rifle is what version of the main firearm used by the military forces of the British Empire and Commonwealth during the first half of the 20th century?",
        "response": ".22 calibre",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played in more bands, Marty Raybon or Signe Toly Anderson?",
        "response": "Marty Raybon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the second husband of the sister of Ulf Tostesson?",
        "response": "Sweyn Forkbeard",
        "source": "hotpot_qa"
    },
    {
        "query": "When was \"Differences\" first conducted by a French composer and conductor? ",
        "response": "March 1959",
        "source": "hotpot_qa"
    },
    {
        "query": " Angela Franziska Johanna Hammitzsch, was the elder half-sister of Adolf Hitler, by her first husband, Leo Raubal, Sr., she was the mother of Geli Raubal, was Adolf Hitler's half-niece, and born in Linz, in which regional location?",
        "response": "Austria-Hungary",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was founded earlier, Uniklubi or Soundgarden?",
        "response": "Soundgarden",
        "source": "hotpot_qa"
    },
    {
        "query": "Chumlee and Corey Harrison star together in what History TV series?",
        "response": "Pawn Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the film at who end a versions of the son \"Please, Please, Please, Let Me Get What I Want\" could be heard?",
        "response": "Shane Meadows",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian reservation that was established in 1868 is located near the Pryor Mountains in Montana?",
        "response": "The Crow Indian Reservation",
        "source": "hotpot_qa"
    },
    {
        "query": "Lynx Casino has what game in it that make wagers on the outcome of the roll of a pair of dice?",
        "response": "Craps",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was known for his research in managerial accounting, Alex Sevanian or Raffi Indjejikian?",
        "response": "Raffi Indjejikian",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the first season of the show featuring Eric \"Doc\" Hammer as a voice actor?",
        "response": "August 7, 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat is a global gold mining company that was formed in 2004 by the merger with Ashanti Goldfields Corporation, that jointly owns the project located 330 km northeast of Kalgoorlie, Western Australia?",
        "response": "AngloGold Ashanti Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "This 18-story industrial building faces the entrance to a tunnel under what river?",
        "response": "Hudson River",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the writer of the \"Beati quorum via\" educated?",
        "response": "Stanford was educated at the University of Cambridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Juan Mascaró created a book that was inspiration for which George Harrison-penned Beatles song?",
        "response": "The Inner Light",
        "source": "hotpot_qa"
    },
    {
        "query": "Wayne Newton, who performed Shirl Girl which reached #58 on the \"Billboard\" Hot 100 in 1963, had his signature song used in a score for which movie?",
        "response": "\"Ferris Bueller's Day Off\" (1986)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"The Playboy Club\" star is best  known for his performance in the romantic drama \"Latter Days\" ?",
        "response": "Wes Ramsey",
        "source": "hotpot_qa"
    },
    {
        "query": "Radimlja is a stećak necropolis located near which  town and municipality in Bosnia and Herzegovina, located in Herzegovina?",
        "response": "Stolac",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former professional footballer became manager of Watford F.C. in July 2011?",
        "response": "Sean Dyche",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 1950s, Carl Cohen became a manager of a resort with a sign how high?",
        "response": "56 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Ohe the two classic Walt Disney films, Amy and The Jungle Book, which was written by Noreen Stone",
        "response": "Amy",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the Sunda clouded leopard classified as a separate species than its mainland relative, the clouded leopard?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the specialty of the woman who presented \"The Spartans\" in 2003?",
        "response": "classical history",
        "source": "hotpot_qa"
    },
    {
        "query": "What species of plant are Morning glory and Gunnera? ",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "How many different groves lie in the national forest that is loacted between the Central Valley of California and the Basin and Range Province.",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Lucena and Fabio Fognini, have which mutual occupation?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "Last Flag Flying starred which actor from \"The Office\"?",
        "response": "Steven John Carell",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1996 New Hampshire gubernatorial election took place on November 5, 1996, who won the election for Senator?",
        "response": "Jeanne Shaheen",
        "source": "hotpot_qa"
    },
    {
        "query": " Grease trucks on the College Avenue campus of Rutgers University are known for serving a sandwhich with no standardized what?",
        "response": "name",
        "source": "hotpot_qa"
    },
    {
        "query": " Alina Azapocznikow was imprisoned in Auschwitz, and what Nazi concentration camp in what is today Lower Saxony in northern Germany, southwest of the town of Bergen near Celle?",
        "response": "Bergen-Belsen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was published first, Oceans or Don Quixote?",
        "response": "Don Quixote",
        "source": "hotpot_qa"
    },
    {
        "query": "How many editions did the magazine Sarra Manning was the editor of have?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Campbell is a New York–based American artist and tattoo artist whose clients include, among others, Orlando Bloom,  made his professional stage debut in West End's \"In Celebration\" at the Duke of York's Theatre in London in what year?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What network will televise the Super Bowl game that will be played in the same city as the Super Bowl game at which the Washington Redskins defeated the Buffalo Bills by the score of 37-24?",
        "response": "NBC",
        "source": "hotpot_qa"
    },
    {
        "query": "Maxi is a Serbian supermarket chain that is part of what international food group that consists of 21 local brands and employs more than 375,000 associates?",
        "response": "Ahold Delhaize",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dictator co-starred the actor who played what role in the film \"Gandhi\"?",
        "response": "Mohandas Gandhi",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport did both Scott Watters and Ross Lyon play?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person who scored a goal in the 1979 European Cup Winners' Cup Final was born in Vienna?",
        "response": "Hans Krankl",
        "source": "hotpot_qa"
    },
    {
        "query": "Debuting in the 2004 American teen musical comedy film Confessions of a Teenage Drama Queen, Megan Fox went on to co-star in what 2007 blockbuster action film?",
        "response": "Transformers",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the release date of the CD compilation which was a follow-up to a 2005 compilation of the same name, featuring the American actress and singer who played the title character of the Disney Channel comedy series \"Lizzie McGuire\"?",
        "response": "September 9, 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "David Coles and Sam Allardyce held top positions in what popular european sport?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the series inspired by the appreciation of manual laborers that Wheat Field with Cypresses is a part of?",
        "response": "Wheat Fields",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British theatrical producer that appeared on the BBC's The Sound of Musicals, was considered  \"the most successful, influential and powerful theatrical producer in the world\" by the \"New York Times?",
        "response": "Cameron Mackintosh",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2013 Zach Minter was signed as an undrafted free agent by an NFL team that has won how many Super Bowls?",
        "response": "one",
        "source": "hotpot_qa"
    },
    {
        "query": "Happy Birthday is a mixtape  that features a rapper who earned what in 2010?",
        "response": "$7 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release year of this song by American rock band Third Eye Blind that was a recurring element of the album Mouth Silence?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "The Maxies are considered the bad guy version of the band that was founded in what year?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1999 movie, directed by Joe Johnston, is based onthe memoirs of a veitnam veteran and formaer NASA engineer?",
        "response": "October Sky",
        "source": "hotpot_qa"
    },
    {
        "query": "What hormone produced by both the adrenal glands and certain neurons is released by chromaffin cells?",
        "response": "Epinephrine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the subsidiary of Frito lay (who is a subsidiary of PepsiCo) that owns cheetos?",
        "response": "Matutano",
        "source": "hotpot_qa"
    },
    {
        "query": "What shared background do the names \"Kardashian\" and \"Kay Armen\" have in common?",
        "response": "Armenian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was also a screenwriter, Ivan Reitman or Harry Beaumont?",
        "response": "Harry Beaumont",
        "source": "hotpot_qa"
    },
    {
        "query": "What position was played by the player-coach of the 2016 Mumbai City FC?",
        "response": "forward",
        "source": "hotpot_qa"
    },
    {
        "query": "House of Anubis is based on a show that first aired where?",
        "response": "Netherlands and Flanders",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the personal vision developed by the founder of The Fourth International Posadist?",
        "response": "Posadism.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from Berkeley, California, White Zombie or Counting Crows?",
        "response": "Counting Crows",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Andrey Smolyakov and Viy have in common?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "Vittorio Amuso is currently incarcerated at what medium security US federal prison for male inmates?",
        "response": "Federal Correctional Institution, Cumberland",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor born as James Bateman performed his final role in Big Stan, a 2007 film directed by whom?",
        "response": "Rob Schneider",
        "source": "hotpot_qa"
    },
    {
        "query": "At Home with the Noonans follows the lives of what English gangster whose brother was Desmond \"Dessie\" Noonan?",
        "response": "Dominic Noonan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state is the University that Robert Agnew received his B.A. at located?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "The mosque located in Delhi built is 1505 has an architectural element resembling the hollow upper half of a sphere, what is the element called?",
        "response": "A dome",
        "source": "hotpot_qa"
    },
    {
        "query": "Rakekniven was climbed in 1996 by a mountaineer that holds which nationality ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2006–07 Spanish football season, Valencia CF competed in La Liga, the 2006–07 La Liga season, the 76th since its establishment, started on 27 August 2006, and finished on which date?",
        "response": "17 June 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of town Richard J. Wood graduated college from?",
        "response": "Hamilton, Ontario, Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress is known for portraying a countess in British television as well as an American chorus girl?",
        "response": "Elizabeth Lee McGovern",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint-Paul-Saint-Louis Church was constructed on the orders of a monarch of the House of Bourban who ruled as King of France from 1610 until what year?",
        "response": "1643",
        "source": "hotpot_qa"
    },
    {
        "query": "how is In Good Company and Scarlett Johansson connected?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucy Gordon's first film was \"Perfume\" in 2001 before going on to have a small role in \"Spider-Man 3\", an American superhero film based on the fictional Marvel Comics comic book series \"The Amazing Spider-Man\" from what year?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is founding year of the university that Abraham Rotstein is a professor of economics at? ",
        "response": "1827",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a member of the North Melbourne Football Club, whose brother Rob has starred in Bridgetowns Cricket Clubs Premiership in 2016/7?",
        "response": "Mark Andrew Brayshaw",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the club other than Norwich City and Chester who Gerard Patrick Mannion played for founded?",
        "response": "1877",
        "source": "hotpot_qa"
    },
    {
        "query": "The single that DVLP produced in 2013 premiered on what Internet platform?",
        "response": "YouTube",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a genus to more species, Bauhinia or Cephalaria?",
        "response": "Bauhinia",
        "source": "hotpot_qa"
    },
    {
        "query": " Arthur Machen was a Welsh author and mystic of the 1890s and early 20th century well known for his leading role in creating the legend of the Angels of Mons, a popular legend about a group of angels who supposedly protected members of what army?",
        "response": "the British Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is considered the greatest sprinter of all time and the 2016 Hollywood biographical sports film \"I Am Bolt\" based on?",
        "response": "Usain Bolt",
        "source": "hotpot_qa"
    },
    {
        "query": "Fernilee Reservoir is owned and operated by a company founded in what year?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the co-founder of a doughnut chain named after a Canadian ice hockey player?",
        "response": "Vaughan",
        "source": "hotpot_qa"
    },
    {
        "query": "Park Jae-hong, is a South Korean outfielder who currently plays for SK Wyverns in the KBO League, he actually did 30-30 in his debut season(1996), the only person to do so until 2012, when who did it, an American professional baseball center fielder for the Los Angeles Angels of Major League Baseball (MLB), and is a six-time MLB All-Star, and received the American League (AL) Most Valuable Player (MVP) award in 2014 and 2016 (finishing second in the 2012, 2013 and 2015 votes)?",
        "response": "Mike Trout",
        "source": "hotpot_qa"
    },
    {
        "query": "This Hong Kong turn-based tactical role-playing video game was developed and published by individuals who had previously crowd funded a game through what?",
        "response": "Kickstarter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted the ITV show Celebrities Under Pressure and All Star Family Fortunes?",
        "response": "Vernon Kay",
        "source": "hotpot_qa"
    },
    {
        "query": "Enterprise Car Sales was established in 1962 by founder Jack Taylor, which American car rental company headquartered in Clayton, Missouri, United States in Greater St. Louis?",
        "response": "Enterprise Rent-A-Car",
        "source": "hotpot_qa"
    },
    {
        "query": "The role Zina Goldstein had in \"Groys teater\" is a term in what language?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Unique archaea bacteria were found by Brett Baker's lab at the University of California Berkely at a mine which has been geologically classified as what?",
        "response": "\"massive sulfide ore deposit\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the restaurant in Harmon Corner that is owned by Landry's, Inc. ",
        "response": "Steven Schussler",
        "source": "hotpot_qa"
    },
    {
        "query": "Melvin Booker played college basketball for a university that plays its home games at what arena?",
        "response": "Mizzou Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which conservative MP was known as Viscount Cranborne from 1903 to 1947 ",
        "response": "Robert Gascoyne-Cecil",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a member in more bands, Dave Williams or Gary Cherone? ",
        "response": "Gary Francis Caine Cherone",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 Tour of Oman was the sixth edition of the Tour of Oman cycling stage race, Chris Froome, the defending champion from 2013 and 2014, a British road racing cyclist for which organization?",
        "response": "UCI ProTeam Team Sky",
        "source": "hotpot_qa"
    },
    {
        "query": "Iron Maiden's only constant member since their inception was credited for a song on what album?",
        "response": "The Number of the Beast",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Belizean rapper, also known as Shyne, is famous for the song \"Bad Boyz\"",
        "response": "Moses Michael Levi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian-based company originated both the Aurora Engine and went on to create successful franchises such as Baldur's Gate, Mass Effect, and Dragon Age?",
        "response": "BioWare",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Sydney Freeland and Genndy Tartakovsky work in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What record company released the album that is a collaboration between Daniel Dumile and Bishop Nehru?",
        "response": "Lex Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays Dr. Hannibal Lecter in the television series that Richard Armitage plays Francis Dolarhyde in? ",
        "response": "Mads Mikkelsen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which jet fighter is currently in service in the United States and is to replace the United States navy's F/A-18E/F Super Hornet?",
        "response": "sixth-generation jet fighter",
        "source": "hotpot_qa"
    },
    {
        "query": "Sibley Memorial Hospital and Providence Hospital are located in which Disctrict",
        "response": "the District of Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Der Hund von Baskerville is an adaptation of a crime novel featuring what detective?",
        "response": "Sherlock Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Since when has Clive Schlee been CEO of an  international sandwich shop chain?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member of \"It Happened on Fifth Avenue\" was also a major Broadway star in the 1920's?",
        "response": "Victor Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was available first the No Card or the Octopus card?",
        "response": "Octopus card",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is an American alcoholic beverage producer founded in 1896 that makes a highly effervescent beer made by fermenting lager yeasts at warmer ale yeast fermentation temperatures located?",
        "response": "San Francisco, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the lyrics to the theme song that was used by the Western film series Range Busters?",
        "response": "Dr. Brewster M. Higley",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Democracy and Latin Trade have in common?",
        "response": "editors",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor played the American retired airline captain in the movie celebrating a water landing of a US Airways flight? ",
        "response": "Tom Hanks",
        "source": "hotpot_qa"
    },
    {
        "query": "Temes-class river monitor was a type of warship that was first used in what decade?",
        "response": "1860s",
        "source": "hotpot_qa"
    },
    {
        "query": "Bertha von Suttner, the second woman to win the Nobel Peace, was awarded after which other female scientist who won in 1903?",
        "response": "Marie Curie",
        "source": "hotpot_qa"
    },
    {
        "query": "Still in the Basement is the second EP by Soul Intent, and featured what American rapper, record producer, and actor?",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was the 2016 Pakistan Super League cricket Final played?",
        "response": "United Arab Emirates",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was born first Robert Ellis Miller or Trey Parker?",
        "response": "Robert Ellis Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "The Melaka Wonderland is a water theme park and resort in Ayer Keroh, Melaka, in which country, a water park or waterpark is an amusement park that features water play areas, such as swimming pools, water slides, splash pads, spraygrounds (water playgrounds), lazy rivers, or other recreational bathing, swimming, and barefooting environments?",
        "response": "Malaysia",
        "source": "hotpot_qa"
    },
    {
        "query": "What band with a rotating ensemble of musicians influenced Crazyhead?",
        "response": "Captain Beefheart",
        "source": "hotpot_qa"
    },
    {
        "query": "Schützenpanzer Lang HS.30 was designed by which Spanish auto company?",
        "response": "Hispano-Suiza",
        "source": "hotpot_qa"
    },
    {
        "query": "Taobao is a Chinese online shopping website similar to eBay, Amazon and Rakuten, Inc., a Japanese electronic commerce and Internet company based in Tokyo, and founded in 1997 by who?",
        "response": "Hiroshi Mikitani",
        "source": "hotpot_qa"
    },
    {
        "query": "Kentucky Truck Assembly is one of two plants operated by Ford in Louisville, the other being the plant that opened on 180 acres in what year?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of this Tyrolean mountaineer, agricultural scientist, geographer, and cartographer who played the husband of Lhak[a Tsamchoe in Seven Years in TIbet?",
        "response": "2 November 1899",
        "source": "hotpot_qa"
    },
    {
        "query": "Iwan Rheon portrayed Ramsay Bolton on the television program based on the books by whom?",
        "response": "George R. R. Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the television station that shows Judge Judy? ",
        "response": "Upstate New York's North Country.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more doubles titles, Conchita Martínez or Lucie Šafářová?",
        "response": "Lucie Šafářová",
        "source": "hotpot_qa"
    },
    {
        "query": "The Oklahoma Sooners was formerly a member of what conference formed in January 1907?",
        "response": "The Big Eight Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Ivanhoé is an 1826 pastiche opera in three acts with music by Gioachino Rossini, the  music was adapted, with the composer's permission, by the music-publisher Antonio Pacini from Rossini's operas, namely La gazza ladra, is a \"melodramma\" or opera semiseria in two acts by Gioachino Rossini, with a libretto by who?",
        "response": "Giovanni Gherardini",
        "source": "hotpot_qa"
    },
    {
        "query": "Which soda company has a higher command of their market share, Thums Up or IBC Root Beer?",
        "response": "Thums Up",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Hey Bulldog\" appeared on an album that was produced by who?",
        "response": "George Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "The Armée d'Orient fought on the front that was created as an aid to what country?",
        "response": "Serbia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mitsubishi Diamante was designed by the company that has headquarters in what part of Tokyo?",
        "response": "Minato",
        "source": "hotpot_qa"
    },
    {
        "query": "Under which administration is this American banker, film producer, and former hedge fund manager who is currently married to Louise Linton U. S. Secretary of the Treasury?",
        "response": "Trump administration",
        "source": "hotpot_qa"
    },
    {
        "query": "Manchester City Football Club is a football club in Manchester, England, the club moved to the City of Manchester Stadium, in Manchester, England, also known as the Etihad Stadium for sponsorship reasons, in what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Teenage Mutant Ninja Turtles featured characters in comic book form created by the comic book writer and artist of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "San Francisco Bay Area is known for which cross-disciplinary artist born on January 29, 1924 ?",
        "response": "Peter Voulkos",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Lawson co-created the series Planet Racers with an American comic book writer and artis who is best known for co-creating what with Kevin Eastman?",
        "response": "Teenage Mutant Ninja Turtles",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony David Miles, best known as A. D. Miles, is an American actor, writer and comedian, he also appeared in a recurring role on which American sketch comedy series created by and starring Tim Heidecker and Eric Wareheim, which premiered February 11, 2007 on Adult Swim?",
        "response": "Tim and Eric Awesome Show, Great Job!",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of show is widely heralded as both a parody and a pastiche of heavy metal culture, and  was developed by Titmouse ,Inc?",
        "response": "American adult animated television series",
        "source": "hotpot_qa"
    },
    {
        "query": "Effiduase is the capital of Sekyere East District located in what region?",
        "response": "the Ashanti Region of Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "Jure Leskovec is the chief scientist of the site founded by whom?",
        "response": "Ben Silbermann, Paul Sciarra and Evan Sharp",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of audience are Cosmopolitan and Bella both aimed at?",
        "response": "women",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does WGBL and Biloxi, Mississippi have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the MTV series developed by Jeff Davis where Holland Roden played as Lydia Martin?",
        "response": "Teen Wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Broderick, served as the Bishop of what church that covers all or part of 14 counties in Eastern New Year?",
        "response": "Roman Catholic Diocese of Albany",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who played Charlie Swan in \"Twilight\" also played the character Cesaire in a film directed by who?",
        "response": "Catherine Hardwicke",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the population of the city russian actor Aleksei Maklakov is from?",
        "response": "1,473,754",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the Canadian alternative rock band, Sandbox, is best known for his portrayal of \"Bubbles\" and for being the co-writer of the ongoing cult classic \"Trailer Park Boys?\"",
        "response": "Mike Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of Chris Weddle is a managing partner for a firm headquartered in what state?",
        "response": "Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the alternate slang name for the World War I era grenade that the egg grenade was less awkward than to handle?",
        "response": "potato masher",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the album that precedes the 2017 album that was released through Fueled by Ramen and contained the song \"Told You So?\"",
        "response": "Paramore",
        "source": "hotpot_qa"
    },
    {
        "query": "The Indonesian-Dutch actress who starred in The Bushido Blade was born in what year?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "What publicly traded corporation based on the Las Vegas Strip, Nevada owns Wynn Macau?",
        "response": "Wynn Resorts",
        "source": "hotpot_qa"
    },
    {
        "query": "What book illustrated by an illustrator and author who has written and illustrated a children's book about marijuana: \"It's Just a Plant\", reached No. 1 on Amazon.com's bestseller list a month before its release?",
        "response": "Go the Fuck to Sleep",
        "source": "hotpot_qa"
    },
    {
        "query": "What British gardening expert wrote a supporting foreword for a publication by Marion Evans?",
        "response": "Sir Roderic Victor \"Roddy\" Llewellyn",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the country in which Marja-Liisa Olthuis resides?",
        "response": "Amsterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Christian Albrecht Bluhme during the second military conflict as a result of the Schleswig-Holstein Question?",
        "response": "Prime Minister of Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occupation did Gareth Evans and Michael Winner have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the supporting actor in Running Man?",
        "response": "Oh Jung-se",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the date of birth of the magician who has an association with Metamorphosis?",
        "response": "March 24, 1874",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie poster, other than \"My Name Is Nobody\", did Renato Casaro work on?",
        "response": "Quadrophenia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, Jack Off Jill or Foals, formed first?",
        "response": "Jack Off Jill",
        "source": "hotpot_qa"
    },
    {
        "query": "The drug Nateglinide was developed by a company that has what percentage of the global market share?",
        "response": "40%",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Round Eyes in the Middle Kingdom and In the Shadow of the Moon have in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the restaurant at Epcot located between the Moroccan and British pavilions that opened in 1982?",
        "response": "Les Chefs de France",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canal was constructed during World War II, Middlesex Canal or Cape May Canal?",
        "response": "Cape May Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plants contains a larger variety of species, Paulownia or Dendromecon?",
        "response": "Paulownia",
        "source": "hotpot_qa"
    },
    {
        "query": "Kintore is a great example of what colloquial term?",
        "response": "ghost town",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the building hosting England’s national museum of football?",
        "response": "Ian Simpson",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the house, in which the 1912 and 1924 candidate for president of the United States stayed, declared a National Historic Landmark?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2010 how many residents in the town of Watervliet were relying on the Normans Kill Creek to supply the Watervliet Reservior?",
        "response": "10,254",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city in Kansas where racecar driver Louis Durant grew up? ",
        "response": "2,526",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Savage Arms known for making? ",
        "response": "rifles",
        "source": "hotpot_qa"
    },
    {
        "query": " Eldest is the second novel in the \"Inheritance Cycle\" by Christopher Paolini and the sequel to \"Eragon\", the first novel in what series?",
        "response": "Inheritance Cycle",
        "source": "hotpot_qa"
    },
    {
        "query": "The person named NBA Finals MVP for the second time in the 1986 NBA Playoffs retired as a player for what team?",
        "response": "Boston Celtics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which war lasted 13 days and contained the Battle of Hilli?",
        "response": "Indo-Pakistani War of 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pistol was replaced by a pistol manufactured by Spreewerk?",
        "response": "Luger P08",
        "source": "hotpot_qa"
    },
    {
        "query": " Harold Stuart was born in a city in what region?",
        "response": "North Yorkshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the sole constant member of Electric Light Orchestra who collaborated with Del Shannon with on the Rock On! album?",
        "response": "Jeff Lynne",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does the Doñana National Park and Caldera de Taburiente National Park have in common?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "The Japanese action role-playing game, Rise of Mana, was developed for Sony Interactive Entertainment's PlayStation Vita and what other devices?",
        "response": "iOS, Android",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Perry has created items for the actress who played whom in \"The Secret Circle\"?",
        "response": "Faye Chamberlain",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the full name of the Shropshire businessman who made his name as a shirt retailer?",
        "response": "Nicholas Charles Tyrwhitt Wheeler",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Sragow edited film essays for the journalist whose autobiographical novel won what posthumous award?",
        "response": "1958 Pulitzer Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "The print magazine that provides television program listings information as well as television-related news, celebrity interviews and gossip, film reviews, crossword puzzles, and, in some issues, horoscopes, and ranked Lucy Does a Tv Commercial as #2 on their list of the \"100 Greatest Episodes of All Time\" is owned by who?",
        "response": "NTVB Media",
        "source": "hotpot_qa"
    },
    {
        "query": "Force India VJM01 was the only car constructed by a team that was created after of buyout of what team?",
        "response": "Midland F1",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the owner of the Wet'n'Wild brand sell The Sydney Attractions Group Pty Ltd.",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published a video game based on characters from a movie that Sigourney Weaver was in? ",
        "response": "Sierra Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country is the Staverns Fortress located in the county of Vestfold?",
        "response": "Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "What talk show was the host of the 2010 MTV Video Music Awards famous for?",
        "response": "Chelsea Lately",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team does the player named 2015 Diamond Head Classic's MVP play for?",
        "response": "Sacramento Kings",
        "source": "hotpot_qa"
    },
    {
        "query": "David G. Mugar is a businessman from the town in what Massachusetts county?",
        "response": "Middlesex",
        "source": "hotpot_qa"
    },
    {
        "query": "Sabah Homasi made his debut with the Ultimate Fighting Championship on August 20th, 2016 against a fighter born in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tim O'Brien and Colin Wilson both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What river is the weapons manufacturer that developed the M15 pistol located on?",
        "response": "Mississippi River",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality and profession of the person responsible for the concept of a dimensionless number in physics and engineering?",
        "response": "French mathematician and physicist",
        "source": "hotpot_qa"
    },
    {
        "query": "Verity Marshall played the role of Amy during the Christmas episode of what TV show?",
        "response": "Black Mirror",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Curt Doussett and The Walt Disney Company originate from which US state?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Svetlana Novak, is a Paris-based film producer, her credits include The City of Lost Children, released in which year, a science fantasy drama film directed by Marc Caro and Jean-Pierre Jeunet, written by Jeunet and Gilles Adrien?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was from a geographically smaller country, Éric Rohmer or Robert Stevenson?",
        "response": "Robert Stevenson",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Florida Board of Regents and State University System of Florida have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "In what financial district did the Japanese American artist and landscape architect who designed various Martha Graham productions, build a 51-story office building?",
        "response": "Manhattan's",
        "source": "hotpot_qa"
    },
    {
        "query": "What place is connected to its sister resort Wynn Las Vegas and was worked on by Roger Thomas?",
        "response": "Encore Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person who Miguel Pro attempted to assassinate born? ",
        "response": "February 19, 1880",
        "source": "hotpot_qa"
    },
    {
        "query": "Author and businessman Rolf Dobelli created a non-profit foundation in his native city to connect science, business and cultural figures. In which country?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ryan Harrison and John Peers American professional tennis players?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"The Call of the Wintermoon\" is by what black metal band from Bergen, Norway?",
        "response": "Immortal",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the political party, located in a country with the official name Democratic Republic of Timor-Leste and favored integration with Indonesia, started?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "What nonprofit did a Korean-American who, in 2003, moved to the China-North Korea border become the founder of , that is being developed into a film starring an actor known for his roles as Jin-Soo Kwon in \"Lost\" ?  ",
        "response": "Crossing Borders",
        "source": "hotpot_qa"
    },
    {
        "query": "Who formed the American independent professional wrestling promotion based in Louisville that featured appearances by Bull Pain?",
        "response": "Ian Rotten",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the singer of The Age of Miracles born?",
        "response": "February 21, 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the permanent seating capacity of the stadium in which the 2006 USC Trojans football team played its home games?",
        "response": "93,607",
        "source": "hotpot_qa"
    },
    {
        "query": " David O. Russell and Sydney Pollack both work in which profession?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Maple Hill in Sussex County, N.J. lies on which interstate hiking trail?",
        "response": "Appalachian Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1995 film starring the actor born as Shou Wan Por as Gobei, based loosely of the video game series \"Mortal Kombat\"?",
        "response": "Kevin Droney",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Thomas James \"Tom\" Hamilton coach and is a four-year coeducational federal service academy in Annapolis, Maryland?",
        "response": "The United States Naval Academy",
        "source": "hotpot_qa"
    },
    {
        "query": "Along with Travis Oates, who was the other original Winnie the Pooh voice actor to return to the 2011 movie?",
        "response": "Jim Cummings",
        "source": "hotpot_qa"
    },
    {
        "query": "Allarodu, a 1994 Telugu, comedy film, featured music composed by Vidyasagar, who made his debut as a film composer in what 1989 Tamil film?",
        "response": "Poomanam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Christmas special, directed by Bill Melendez, featured an aluminum Christmas tree?",
        "response": "A Charlie Brown Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fantasia Gardens Miniature Golf complex is located across from the Swan and another resort designed by what architect?",
        "response": "Michael Graves",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this infantry regiment of the United States Army, whose captain was John McCunn?",
        "response": "69th Infantry Regiment",
        "source": "hotpot_qa"
    },
    {
        "query": "Deals is owned by an American chain of discount variety stores headquartered in what city?",
        "response": "Chesapeake, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "How many awards did the company win that took over the campus of a New Hampshire company who went from 300 employees at its height to only 30 employees in 2006?",
        "response": "46",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked with a company founded on October 16, 1923 and was involved with the animated series \"2 Stupid Dogs\"?",
        "response": "Donovan R. Cook III",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the opening year for the stadium in which the WCCW Cotton Bowl Extravaganza was held every year from 1984 through 1988?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Secure input and output handling is a type of what, which protects computers from theft or damage?",
        "response": "Computer security",
        "source": "hotpot_qa"
    },
    {
        "query": "Koestler was sentenced to death under the regime of which Spanish military dictator?",
        "response": "Francisco Franco Bahamonde",
        "source": "hotpot_qa"
    },
    {
        "query": "What can be found in the Northwest Montana Wetland Management District? ",
        "response": "National Bison Range",
        "source": "hotpot_qa"
    },
    {
        "query": "What American biochemist is famous for writing \"The Edge of Evolution\"?",
        "response": "Michael Behe",
        "source": "hotpot_qa"
    },
    {
        "query": "The political party Gerry Mullan belonged to currently has how many MLAs in the Northern Ireland Assembly?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "Sextet was by the Polish composer who has completed how many operas?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "What company with the Virgin Group will use the VSS Unity?",
        "response": "Virgin Galactic",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the singer of the song \"Flying By\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize did John R. Fischetti receive for his two-dimensional animated illustrations?",
        "response": "Pulitzer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where We Land is the first studio album by Australian Idol 2006 winner Damien Leith, Leith included two cover songs in the album, Fleetwood Mac's \"Songbird\" from the eleventh studio album by British-American rock band Fleetwood Mac, titled?",
        "response": "Rumours",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the long name of the Government of Ireland Act 1920 that relates to Islam in Northern Ireland?",
        "response": "An Act to provide for the better government of Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the writer of music and lyrics for the album \"A Very StarKid Album\" born?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "What music genre formed during the 1980's and early 1990's  and was crucially incluenced by a band founded in 1981 by Beate Bartel and Chrislo Haas?",
        "response": "Detroit techno",
        "source": "hotpot_qa"
    },
    {
        "query": "The Irish-American businessman and philanthropist who founded the Atlantic Philanthropies also assisted in the establishing of the QBI in what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote an investment guide published by Orion in 1992 who named his approach to investment when he observed that after reading a short article on the Zulu people in the an American general-interest family magazine, published ten times a year his wife was better informed on the subject than he himself was ?",
        "response": "Jim Slater",
        "source": "hotpot_qa"
    },
    {
        "query": "Uralla-Walcha was a former electoral district of the Legislative Assembly in the Australian state of New South Wales, created in 1894 from part of New England and including Walcha and which town on the Northern Tablelands, New South Wales, Australia?",
        "response": "Uralla",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine based on the book written by Rosita Sweetman, was the first women-run erotica magazine to feature erotica for a lesbian audience in the United States, and shared the same publisher as the woman's magazine \"Girlfriends\".",
        "response": "On Our Backs",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was Terry Hicks's son born?",
        "response": "7 August 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "At which world recognized festival did Stephen Ouimette perform on stage?",
        "response": "Stratford Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Sébastien Lareau or Iván Molina?",
        "response": "Iván Molina",
        "source": "hotpot_qa"
    },
    {
        "query": "Las Vegas Uncork'd has had a partnership over the years with which luxury hotel and resort located in Paradise, Nevada?",
        "response": "The Palazzo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who composed Symphony No. 9 that was performed by Rita Orlandi-Malaspina?",
        "response": "Ludwig van Beethoven",
        "source": "hotpot_qa"
    },
    {
        "query": "Manny Perry has performed in the 1992 sports comedy-drama film directed by whom?",
        "response": "Stephen Herek",
        "source": "hotpot_qa"
    },
    {
        "query": "Are McIntyre Mines and Copperfields Mine in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is a documentary about \"Beowulf & Grendel\", between My Kid Could Paint That and Wrath of Gods?",
        "response": "Wrath of Gods",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of The Finkler Question born?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Thomas S. Allen perform?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the dates of the Pan American Games in which Roman Gastaldi competed two years prior to competing in the World Championships in Moscow?",
        "response": "October 23 to October 30",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was formed first, The Telescopes or Saving Abel?",
        "response": "The Telescopes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this band that released the song \"Sitting by the Riverside\" banned from touring in the United States?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the flowering plants, Holly or Melianthus, has the common name of honey flower?",
        "response": "Melianthus",
        "source": "hotpot_qa"
    },
    {
        "query": "What local council is located in Adelaide, South Australia",
        "response": "City of Tea Tree Gully",
        "source": "hotpot_qa"
    },
    {
        "query": "What Chancellor of the Exchequer and former Prime Minister was verbally attacked by H.H. Asquith?",
        "response": "David Lloyd George",
        "source": "hotpot_qa"
    },
    {
        "query": "How many seasons did the show ehre Taylor Danielle Spreitler  played Lennox Scanlon air?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "The murderer in The Journalist and the Murderer was convicted in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of the movie Veer-Zaara has won seven Filmfare Awards?",
        "response": "Rani Mukerji",
        "source": "hotpot_qa"
    },
    {
        "query": "The song by English indie rock band Florence and the Machine written by Florence Welch and Francis \"Eg\" White and released in 2011 is named after the painting which was completed in which year?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a television actor Ben Bagdikian or David Hedison?",
        "response": "David Hedison",
        "source": "hotpot_qa"
    },
    {
        "query": "The raid of the Po Valley in 203 BC was the culmination of a major war, carried out by the Carthaginian commander Mago, son of Hamilcar Barca, at the end of the Second Punic war between Rome and which location, that was a Phoenician city-state, during the 7th to 3rd centuries BC?",
        "response": "Carthage",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of \"On the Basis of Morality\" born?",
        "response": "1788",
        "source": "hotpot_qa"
    },
    {
        "query": "Isuzu Philippines Corporation is a subsidiary of a Japanese commercial vehicle manufacturer headquartered where?",
        "response": "Tokyo",
        "source": "hotpot_qa"
    },
    {
        "query": "While True West Magazine is an American magazine relating to Old West history, what is Games magazine about?",
        "response": "United States magazine devoted to games and puzzles",
        "source": "hotpot_qa"
    },
    {
        "query": "In which United States Supreme Court case concerning the constitutionality of teaching creationism stated that Creationism is an inherently religious concept and that advocating it as correct or accurate in public-school curricula violates the Establishment Clause of the First Amendment",
        "response": "Edwards v. Aguillard",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that Mads Mikkelsen won the award for Best Actor for his performance in at the 58th Bodil Awards?",
        "response": "Nicolas Winding Refn",
        "source": "hotpot_qa"
    },
    {
        "query": "What state in East Asia is the city Taitung located?",
        "response": "Taiwan",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the highway that runs from the top of the highest mountain in Kentucky?",
        "response": "8.02 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that is developing Ipatasertib headquarters located?",
        "response": "Basel",
        "source": "hotpot_qa"
    },
    {
        "query": "What was ended by the rebel force commanded by the man elected President of Rwanda in the Rwandan presidential election of 2017?",
        "response": "1994 Rwandan Genocide",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both \"Cooking Light\" and \"Vibe\" magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The chorus of \"On the Radio\" contains references to the song \"November Rain\" whose band's lead singer is?",
        "response": "Axl Rose",
        "source": "hotpot_qa"
    },
    {
        "query": "Cress Williams, is an American film and television actor, best known for playing the hitman Wyatt Mathewson in \"Prison Break\", he was cast to play on which upcoming American television series that will air on The CW, based on the DC Comics character of the same name?",
        "response": "Black Lightning",
        "source": "hotpot_qa"
    },
    {
        "query": "While Lin-Manuel Miranda is an actor, best known for starring in Broadway musicals, what is A Goofy Movie?",
        "response": "musical road comedy-drama film",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more credits in the film, Mohsen Makhmalbaf or Murdock MacQuarrie?",
        "response": "Mohsen Makhmalbaf",
        "source": "hotpot_qa"
    },
    {
        "query": "What beer led ot the creation of Cream ale?",
        "response": "Beer in Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the author born that wrote about  the former succubus Jezebel, now the mortal Jesse Harris, as she tries to avoid her Hellish past and learn how to be truly human?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Pepperland Laid Waste was part of a soundtrack album to a film that premiered in what month and year?",
        "response": "July 1968",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does The Incredible Hulk and Jack Colvin have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The Congress of Tucumán initially met in a city founded in what year?",
        "response": "1565",
        "source": "hotpot_qa"
    },
    {
        "query": " Arthur \"Art\" Paul is a graphic designer and was the founding Art Director of a magazine that was founded in which city ?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player from the Sacramento Kings had 9,014 career points?",
        "response": "Rodney McCray",
        "source": "hotpot_qa"
    },
    {
        "query": "The city where Willis S. Blatchley House is located had a population of what at the 2010 census?",
        "response": "35,321",
        "source": "hotpot_qa"
    },
    {
        "query": "What extinct lion preyed on the North African Boar?",
        "response": "Barbary lion",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Tillandsia or Polystichum have more species?",
        "response": "Tillandsia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which route runs through Marcellus and a town in Onondaga County, New York with a population of 7,209?",
        "response": "County Route 41",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the American mixed martial arts organization at which Marlon Moraes competes with bantamweight division based? ",
        "response": "Las Vegas, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Ginger and Chris Jericho both musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tree has the highest number of specie Albizia or  Embothrium",
        "response": "Albizia",
        "source": "hotpot_qa"
    },
    {
        "query": "What language identified with the site of  an archaeological layer of Troy that chronologically spans from c. 1300 to c. 950 BC?",
        "response": "Homeric Greek",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is this historic east–west, large-wheeled wagon route and emigrant trail in the United States on whch Barlow Pass is on?",
        "response": "2170 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Burton became involved in a mayoral campaign for a politician that previously served as the Mayor of Baltimore during what time period?",
        "response": "1999 to 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American pilot involved in U-2 incident on May 1?",
        "response": "Francis Gary Powers",
        "source": "hotpot_qa"
    },
    {
        "query": "Dulux brand of paint is produced by a company heaquartered in what city?",
        "response": "Amsterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "Demelaz Reveley is an Australian model who won the fourth cycle of a show that premiered in what year?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional baseball player was nicknamed after an American Major League Baseball pitcher who was elected to the National Baseball Hall of Fame in 1937?",
        "response": "Henry Bert Vorhees",
        "source": "hotpot_qa"
    },
    {
        "query": "How much additional funding will Los Angles receive to host the Olympic Games in 2028?",
        "response": "$1.8 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Lost Horizons is the first Abney Park album that is in which sci-fi genre that is inspired by 19th-century industrial machinery?",
        "response": "Steampunk",
        "source": "hotpot_qa"
    },
    {
        "query": "Tampa International Airport and John F. Kennedy International Airport, are national airports?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Erdoitza Goikoetxea was from which largest city in the Biscay province?",
        "response": "Bilbao",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is Montpellier, where Lucien Tesnière taught located?",
        "response": "France",
        "source": "hotpot_qa"
    },
    {
        "query": "What documentary about the Gilgo Beach Killer debuted on November, 2016 on A&E?",
        "response": "The Killing Season",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Richard Wright or Thomas Friedman win more Pulitzer prizes?",
        "response": "Thomas Loren Friedman",
        "source": "hotpot_qa"
    },
    {
        "query": "who is older Matt Barlow or Ty Tabor ?",
        "response": "Ty Tabor",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Georges Bataille and Edward Abbey both writing about political views?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Haplopappus and Malvaviscus fall into the same family of flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What overall number is the episode \"Go Fund Yourself\" of South Park?",
        "response": "248th",
        "source": "hotpot_qa"
    },
    {
        "query": "Hae Min Lee's body was found in a park that covers how many acres ?",
        "response": "1216 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Lincolnshire Fire and Rescue (LFR) is the statutory fire and rescue service serving the non-metropolitan county of Lincolnshire, North Lincolnshire and North East Lincolnshire, which are covered by Humberside Fire and Rescue Service, is the statutory fire and rescue service covering the area of what was the county of Humberside (1974–1996), but now consists of the unitary authorities of East Riding of Yorkshire, Kingston upon Hull, North Lincolnshire and North East Lincolnshire in which location?",
        "response": "northern England",
        "source": "hotpot_qa"
    },
    {
        "query": "Seinsheim is known for its connection to the family that is extinct save for which Czech family?",
        "response": "House of Schwarzenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the Majorca Ratter and the Bluetick Coonhound both originate from the same continent ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was established first, Vanderbilt University or Bowdoin College?",
        "response": "Bowdoin College",
        "source": "hotpot_qa"
    },
    {
        "query": "Which group Coleman v. Miller or Berghuis v. Thompkins has to do with the child labor act of of 1924?",
        "response": "Coleman v. Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "The person Phil Keating covered the death of died on what date? ",
        "response": "February 8, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was directed first, The Fearless Freaks or Flying Padre?",
        "response": "Flying Padre",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Eystein Orre and Battle of Stamford Bridge have in common?",
        "response": "Norwegian",
        "source": "hotpot_qa"
    },
    {
        "query": "What Nationality/country of origin do the film Splice and Steven Hoban share?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the brewery who owns The Princess Louise founded?",
        "response": "1758",
        "source": "hotpot_qa"
    },
    {
        "query": "Q Who is the Iranian former footballer, born in 1969, that was the first to react to Ataullah Behmanesh death alongside Mehdi Taj?",
        "response": "Ali Daei",
        "source": "hotpot_qa"
    },
    {
        "query": "What board game came out first, Personal Preference or Qin?",
        "response": "Personal Preference",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Warrendale\" and \"In the Shadow of the Moon\" are both which kind of film?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is this ranch located where Old Sorrel was its foundation linebreeding program for Quarter Horses?",
        "response": "South Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Victoria Azarenka or Tony Roche?",
        "response": "Anthony Dalton Roche",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the coach of the NFL team that plays their home games at MetLife Stadium born?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Academia Deportiva Cantolao, a Peruvian football club based in the city of Callao, Peru, graduated what former Bayern Munich striker for Bundesliga club 1?",
        "response": "Claudio Pizarro",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the  genre of rock music which compiled \"Sweet and Innocent\" largely developed? ",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Lovertits\" is a song by a musician and performance artist of what nationality?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Killers and Nightmare and the Cat, have which mutual nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hong Kong company listed on what, cooperates with the operator of Guangzhou-Shenzhen Railway?",
        "response": "Hong Kong Exchange",
        "source": "hotpot_qa"
    },
    {
        "query": "What neighborhood was the 2004 Emerald Bowl played in?",
        "response": "South Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film won more Academy Awards, The Thin Blue Line or Target for Tonight?",
        "response": "Target for Tonight",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Darden Restaurants and Cooper Industries both involved with food products?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film, of which the upcoming film Nun is a spin-off ?",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "the original, Australia-only Astra of 1984 was a derivative of a locally produced car that was produced between what years ?",
        "response": "1978 until 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which open-air retail, office, entertainment, and residential complex located on the South Side of the city of Pittsburgh is adjacent to South Shore Riverfront Park?",
        "response": "SouthSide Works",
        "source": "hotpot_qa"
    },
    {
        "query": "What shock site hosted a video of a man murdering Lin Jun, a Chineses international student.",
        "response": "Bestgore.com",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor who is famous for his role in the series Taxi, played Arnold Schwarzenegger's tiwn in the movie Twins?",
        "response": "Danny DeVito",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more locations, Fox's Pizza Den or Snappy Tomato Pizza?",
        "response": "Fox's Pizza Den",
        "source": "hotpot_qa"
    },
    {
        "query": "Mehrdad Raissi Ardali was a voice actor along with who in the Bee Movie?",
        "response": "Jerry Seinfeld",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the composer of \"Music for Electric Metronomes\" study with?",
        "response": "Tomojiro Ikenouchi, Kishio Hirao, and John Cage",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Alfred E. Green or Chris Eyre?",
        "response": "Alfred E. Green",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Mount Gannett and Henry Gannett have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Laleli Mosque and Esma Sultan Mansion located in the same neighborhood?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "A 1998 slasher film directed by Jamie Blanks that focuses on murders at a private New England university stars a former Noxzema model born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the driver who was replaced by Jenson Button and Kevin Magnussen?",
        "response": "\"Checo\" Pérez",
        "source": "hotpot_qa"
    },
    {
        "query": "In Star Wars: A New Hope, what planet is the leader of the rebel alliance from?",
        "response": "Alderaan",
        "source": "hotpot_qa"
    },
    {
        "query": "Tepeyac or the Hill of Tepeyac,is located inside Gustavo A. Madero, the northernmost \"delegación\" or borough of the Mexican Federal District, which Roman Catholic church, basilica and National shrine of Mexico, is located in that district?",
        "response": "Basilica of Our Lady of Guadalupe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which restaurant has more locations, Snappy Tomato Pizza or Shakey's Pizza?",
        "response": "Shakey's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "Francis Farewell Starlite is an American musician, producer, songwriter, and is the frontman of which American musical group project?",
        "response": "Francis and the Lights",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Howard Norman and Hart Crane write modernist poetry?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the chief executive officer of the second largest US car rental company by sales?",
        "response": "Robert L. Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Suresh Bhardwaj and David Gordon Green which director is based out of Dehli?",
        "response": "Suresh Bhardwaj",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the shared country of ancestry between Art Laboe and Scout Tufankjian?",
        "response": "Armenian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French film was spoofed in My Big Fat Independent Movie?",
        "response": "Amélie",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Smith is a retired American professional baseball player that graduated from this Roman Catholic, private preparatory school in Summerlin, Nevada?",
        "response": "Bishop Gorman High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Secretary of State was also the president of the company that owns 8% stake in Aston Martin of the United Kingdom?",
        "response": "Robert McNamara",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress has roles in both The King of Blaze, The Warring States, and The Great Wall?",
        "response": "Jing Tian",
        "source": "hotpot_qa"
    },
    {
        "query": "What legislation created the organization that works to improve quality in the program formerly known as SCHIP?",
        "response": "the Patient Protection and Affordable Care Act",
        "source": "hotpot_qa"
    },
    {
        "query": "Inequality for All was a film presented by a man who served as Secretary of Labor under which President?",
        "response": "Bill Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Camp was born in 1932?",
        "response": "Jack Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Canadian born actor who is best known for his role playing Stephen Jameson stars in The Hunters with which female actress? ",
        "response": "Alexa Vega",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the music for the video games, which are based on the movies which Alexandre Desplat wrote the musical scores for?",
        "response": "Jeremy Soule and James Hannigan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seat capacity of the theater where \"Rod Stewart: The Hits\" was performed? ",
        "response": "4,296",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Miklos Nyiszil's supervisor at Auschwitz flee to after the war?",
        "response": "South America",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Welsh professional footballer and manager succeeded Kevin Blackwell as manager of Sheffield United?",
        "response": "Gary Andrew Speed",
        "source": "hotpot_qa"
    },
    {
        "query": "On what lake does the community at the beginning of Interstate 15 sit?",
        "response": "Ivanpah Dry Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Ted Moore was a cinematographer who won an Acadamy Award for \"A Man for All Seasons\" which was what type of film?",
        "response": "1966 British biographical drama film",
        "source": "hotpot_qa"
    },
    {
        "query": "Hypocalymma and Viguiera, are types of shrubs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the home of the character that might be based on John Capozzi?",
        "response": "Baltimore",
        "source": "hotpot_qa"
    },
    {
        "query": "\"All the Way\" is a song recorded by American band Timeflies and is an upbeat pop song with an electronic musical instrument that generates electric signals that are converted to what?",
        "response": "sound",
        "source": "hotpot_qa"
    },
    {
        "query": "Which winner in the final against Eltingh and Haarhuis is an Indian professional tennis player who is considered to be one of the best doubles and mixed doubles players of all time?",
        "response": "Leander Adrian Paes",
        "source": "hotpot_qa"
    },
    {
        "query": "Lockwood is a census-designated place in what county that is the most populous county in Montana?",
        "response": "Yellowstone County",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that bought the Claud Butler brand based?",
        "response": "Brigg, North Lincolnshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was older when they died, Teinosuke Kinugasa or Don O. Newland",
        "response": "Teinosuke Kinugasa",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the connection between Bubba Sparxxx and The Charm?",
        "response": "third album by American rapper",
        "source": "hotpot_qa"
    },
    {
        "query": "Which road is situated just west of the Derbyshire/Cheshire county boundary and is extremely popular with motorcyclists?",
        "response": "A537",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the lead actress born who starred in the remake of the 2005 short film, \"Monster\"",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "The mother of the girl featured in the Portrait of Marianna of Austria was born in which year?",
        "response": "1606",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of experimentation did Fritz Fischer participate in in the 1940's?",
        "response": "Nazi human experimentation",
        "source": "hotpot_qa"
    },
    {
        "query": "In what movie did a star of the 1998 American crime comedy-drama film directed by Ted Demme, play the role of Xenia Onatopp?",
        "response": "\"GoldenEye\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Myles Kennedy and SafetySuit both associated with rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The .308 Norma Magnum was superseded in popularity by a firearm that was released in what year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a famous Finnish footballer who plays as a Striker for the Dynamo Dresden who's a brother of a Chicago Bull?",
        "response": "Eero Markkanen",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Crocosmia and Correa both genuses?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is an opera in one act: L'enfant et les sortilèges or La Juive?",
        "response": "L'enfant et les sortilèges",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt McNamara was portrayed on the series Nip/Tuck by which American actor?",
        "response": "John Carter Hensley",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year the  Australian politician was born who is now a Minister for the South Australian Government?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "The Robert Monks Professorship of Corporate Governance, is a chair established at the University of Cambridge, assigned to the Cambridge Judge Business School, who established it in 2001 by a benefaction, from which former CEO of Tyco International?",
        "response": "Leo Dennis Kozlowski",
        "source": "hotpot_qa"
    },
    {
        "query": "McElmo Phase refers to a period in the late 11th and early 12th centuries, when drastic changes in ceramics and masonry techniques in Chaco Canyon appeared, archeologists initially suggested that the McElmo influence was brought to Chaco Canyon by immigrants from which site located in Montezuma County, Colorado, it protects some of the best preserved Ancestral Puebloan archaeological sites in the United States?",
        "response": "Mesa Verde National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Zigong and Danjiangkou both located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The A36 road connects 'the middle townland' with which other large town in County Antrim?",
        "response": "Larne",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the concert where King of Rock was performed  held? ",
        "response": "13 July 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one difference in the mini version of Punto Banco baccarat?",
        "response": "the table is smaller",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Goldfinger or Poster Children?",
        "response": "Poster Children",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Mad Max films was the last to feature Mel Gibson as the title role?",
        "response": "Mad Max Beyond Thunderdome",
        "source": "hotpot_qa"
    },
    {
        "query": "Johan Mjällby, is a Swedish football manager and former player, currently in charge as manager of Västerås SK, he  was most recently the assistant manager of which team, working alongside former Celtic team-mate and manager, Neil Francis Lennon, a Northern Irish football coach and former player, who is the head coach of Scottish Premiership club Hibernian?",
        "response": "Bolton Wanderers",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the office held by Donald Tsang from 2005 to 2012 come into being?",
        "response": "1 July 1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Joel Nordström Kinnaman (born 25 November 1979) is a Swedish American actor, known for playing Alex Murphy in the 2014 \"RoboCop\" remake, the American cyberpunk superhero action film directed by José Padilha and written by who?",
        "response": "Joshua Zetumer",
        "source": "hotpot_qa"
    },
    {
        "query": "James Donald Bratt (born 1949) is a scholar of Abraham Kuyper, is a Dutch journalist, statesman and neo-Calvinist theologian, and founded the Reformed Churches, in which country?",
        "response": "Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of \"Not Like Everyone Else\" was also in \"Drunk History\"?",
        "response": "Alia Shawkat",
        "source": "hotpot_qa"
    },
    {
        "query": "Are We Were So Beloved and The World of Charlie Company both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Iver Johnson begin selling the standard-issue sidearm for the United States Armed Forces from 1911 to 1986?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The Snapz Pro X program was used by South Park to feature Cartman, Kyle, Stan, and Kenny enjoying playing what online game?",
        "response": "World of Warcraft",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the 18th episode of the 13th season of the show that is set in the fictional town of Springfield and parodies American culture and society, television, and the human condition air?",
        "response": "April 28, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Massachusetts county does the house at 87 Hull Street, Beverly, Massachusetts reside?   ",
        "response": "Essex County",
        "source": "hotpot_qa"
    },
    {
        "query": "What song about a medical student named Maxwell Edison who commits murders with a hammer was first issued a single in Central America?",
        "response": "Maxwell's Silver Hammer",
        "source": "hotpot_qa"
    },
    {
        "query": " Chess at the 2011 Pan Arab Games was held in which capital city of Qatar?",
        "response": "Doha",
        "source": "hotpot_qa"
    },
    {
        "query": "The first suburban store of this incorporation founded in 1922 Portland is currently occupied what what company?",
        "response": "Rite Aid",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American single-engined, single-seat, all-metal fighter and ground-attack aircraft first flew in which design Donovan Reese Berlin was associated?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Black Sabbath: The Dio Years features remastered tracks from \"Heaven and Hell\" and others featuring which new member? ",
        "response": "It is the first Black Sabbath album to feature vocalist Ronnie James Dio, who replaced original vocalist Ozzy Osbourne in 1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Black Diamonds debut was released by a band from what town?",
        "response": "Atlanta, Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "What American guitarist and singer is famous for their collaboration with Josh Lattanzi?",
        "response": "Albert Hammond Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Domestic Disturbance stars an actor who voiced what character in \"Monsters, Inc.\"?",
        "response": "Randall Boggs",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Rolf de Heer and Joseph M. Newman of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What cable and satellite television channel was founded in 1992 and showed the premier episode of The Tex Avery Show?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Talk Talk and Hunter Valentine, which band was formed earlier?",
        "response": "Hunter Valentine",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the 1980s New Romantic singer/songwriter who wrote the lyrics and music for the stage musical \"Taboo\"?",
        "response": "George Alan O'Dowd",
        "source": "hotpot_qa"
    },
    {
        "query": "In what field did a Swiss physicist who had a geometrical representation named after him work in?",
        "response": "quantum mechanics",
        "source": "hotpot_qa"
    },
    {
        "query": "William Richert served as acting mayor of Detroit, Michigan, after what four-term Republican mayor resigned?",
        "response": "Hazen S. Pingree",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the main campus of the private Tusculum College?",
        "response": "Tusculum, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Aronia or Hermannia have more species?",
        "response": "Hermannia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company used a voice actor who also voiced He-Man?",
        "response": "9Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a poet, Wilfred Owen or Ernst Toller?",
        "response": "Wilfred Edward Salter Owen",
        "source": "hotpot_qa"
    },
    {
        "query": "Hanakapiai Beach is located on the coast on which oldest inhabited Hawaiian island?",
        "response": "Kauaʻ i",
        "source": "hotpot_qa"
    },
    {
        "query": "The location of the area where Fort Nisqually stood is in what Washington county?",
        "response": "Pierce County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Hampton Del Ruth or Ted Kotcheff?",
        "response": "Hampton Del Ruth",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of animal is represented by a bogle, or mythical beast called a Barghest, in Northumbrian mythology?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "John Crewe, 1st Baron Crewe was from the mansion that was from what period?",
        "response": "Jacobean",
        "source": "hotpot_qa"
    },
    {
        "query": "What aspect is shared between \"Finding Nemo\" and \"Melody Time\" although it is created by a computer in one case and as live action in the other?",
        "response": "animated",
        "source": "hotpot_qa"
    },
    {
        "query": "Elmer Wayne Henley Jr. was convicted in 1974 for his role in a series of murders in Houston, Texas, between 1970 and 1973 in which a minimum of 28 teenage boys were abducted, tortured, raped and murdered by Dean Corll, whose  crimes became known as what?",
        "response": "Houston Mass Murders",
        "source": "hotpot_qa"
    },
    {
        "query": "Amme Anupame had a musical score by a composer popularly known as what?",
        "response": "Mellisai Mannar",
        "source": "hotpot_qa"
    },
    {
        "query": "How many broadband subscribers does the direct-broadcast satellite which runs The Spectrum on channel 6028 serve?",
        "response": "580,000",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the choreographer with whom Laz Brotherston has collaborated knighted?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nathalie Sarraute and Anchee Min both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was this global energy and commodity trading company larger than Trafigura as an oil trader formed?",
        "response": "Rotterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "Dilli Ka Thug is a 1958 Hindi-language comedy film with music by an Indian music director who took a break from the 1970s until when?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the length of the river into which Pack Creek runs after it goes through the Spanish Valley? ",
        "response": "1450 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game can have more players, Diplomacy or Space Hulk?",
        "response": "Diplomacy",
        "source": "hotpot_qa"
    },
    {
        "query": "Deogiri College, Aurangabad, is an undergraduate and postgraduate, coeducational college situated in the Aurangabad district of Maharashtra state in which country?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which long-established US university is older: University of California, Berkeley or Syracuse University?",
        "response": "University of California, Berkeley",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did Bong Joon-ho, director of Barking Dogs Never Bite, release his English-language debut?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Carson has performed works by which composer of 9 symphonies?",
        "response": "Ludwig van Beethoven",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the coach of the 2012–13 Lamar Cardinals basketball team born?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": " Han Hyo-joo won Best Actress at the 34th Blue Dragon Film Awards for her performance in a movie that was a remake of what 2007 film?",
        "response": "\"Eye in the Sky\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Orthrosanthus and Solandra members of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was Amy Grant's husband in?",
        "response": "Pure Prairie League",
        "source": "hotpot_qa"
    },
    {
        "query": "Azurik: Rise of Perathia features a score by game composer born in which US state ?",
        "response": "Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "Protein phosphorylation is a post-translational modification of proteins, was first reported in 1906 by which American biochemist who studied the structure and function of nucleic acids, at the Rockefeller Institute for Medical Research?",
        "response": "Phoebus Aaron Theodore Levene",
        "source": "hotpot_qa"
    },
    {
        "query": " the Royal Society was unable to meet its promise to finance the publication of Newton's \"Philosophiae Naturalis Principia Mathematica\" and let this to the clerk of the society who was best known for computing what?",
        "response": "the orbit of Halley's Comet",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hozier and Silverchair both involved in music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Jong-chul's older half-brother was thought to have fallen out of favour after embarrassing the regime in 2001 with a failed attempt to visit where?",
        "response": "Tokyo Disneyland",
        "source": "hotpot_qa"
    },
    {
        "query": "About Last Night  is a 1986 American romantic comedy-drama film whose screenplay was by an American actor best known as a cast member on what?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the complete name for the group whose debut studio album was Tri-Angle?",
        "response": "Tong Vfang Xien Qi",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2003 South Australian National Football League Grand Final saw the Central District Bulldogs defeat a football club whose home base is currently known as what?",
        "response": "City Mazda Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Bailey Chase starred as what character in a WB Television Network show that reached between four and six million viewers?",
        "response": "Graham Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, William March or Richard Brautigan?",
        "response": "William March",
        "source": "hotpot_qa"
    },
    {
        "query": "Two of the pharmacy schools are Midway College School of Pharmacy and which first for-profit college or university to receive the Southern Association of Colleges and Schools?",
        "response": "Sullivan University College of Pharmacy",
        "source": "hotpot_qa"
    },
    {
        "query": "Christine M. McCarthy reports to an American businessman who earned how much money in 2015?",
        "response": "$44.9 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Jug-A-Lug is an album by David Murray released on the Japanese DIW label, the album features performances by Murray with Olu Dara, an American cornetist, guitarist and singer, and the father of which rapper?",
        "response": "Nas",
        "source": "hotpot_qa"
    },
    {
        "query": " Polly Fashion, was a popular fashion doll competitor that competed with various fashion dolls, though the 1960s and 2000s originally made by Valentine Doll Co in 1962 to what year, it was sold through the American variety store chain, Family Dollar department stores, as a cheaper alternative to other fashion dolls?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Small (also known as Abdul Haq) is a retired professional boxer and islamic political activist who was born on which date, in Lewisham, London, his was also referred to as 'Sugar Ray Clay Jones Jr.' (SRCJJ), in homage to Sugar Ray Robinson, Sugar Ray Leonard, Muhammad Ali, and Roy Jones Jr., Ali was an American professional boxer and activist?",
        "response": "20 June 1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British racing driver has raced for 7 different teams and won the European Grand Prix in 1999?",
        "response": "Johnny Herbert",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1957 1000 km Buenos Aires took place on 20 January, on the Circuito de la Costanera Norte, for this event, was moved from its previous venue, the Autódromo Municipal-Avenida Paz, a 45,000 capacity motor racing circuit in Buenos Aires, Argentina built in which year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": " How far is the major building in the parish Hoghton, located to the east of the village of Hoghton, Lancashire, England?",
        "response": "0.7 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "What is used in both Kalimotxo and Rossini?",
        "response": "wine",
        "source": "hotpot_qa"
    },
    {
        "query": "Have singers Dee Dee Ramone and Rod Evans both been members of a band?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Luthien, who appears in Tolkien's companion to The Lord of the Rings, \"The Silmarillion\", has her story told to Frodo by the heir of Isildur, who was first introduced by what name?",
        "response": "Strider at Bree",
        "source": "hotpot_qa"
    },
    {
        "query": "The Peckforton Hills  form a significant part of the longer Mid Cheshire Ridge which extends southwards from Frodsham towards Malpas,  large village that used to be what type of town?",
        "response": "a market town",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reached a higher world ranking, Julien Benneteau or Arantxa Sánchez Vicario?",
        "response": "\"Arantxa\" Sánchez Vicario",
        "source": "hotpot_qa"
    },
    {
        "query": "Rex Salas is an American record producer who worked with an American singer and actress who has been described as embodying female autonomy in a male-dominated industry, and is sometimes referred to as what?",
        "response": "Goddess of Pop",
        "source": "hotpot_qa"
    },
    {
        "query": "Siglistorf is a municipality in the Swiss canton that is situated by the lower course of what river?",
        "response": "Aare",
        "source": "hotpot_qa"
    },
    {
        "query": "Backstreet Project is an American comic book created by Nick Carter and Stan Lee, the comic features members of Carter's band the Backstreet Boys as themselves, the Backstreet Boys (often abbreviated as BSB) are an American vocal group, formed in Orlando, Florida in what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Mayhem's lineup changed because of the murder of which founder of the early Norwegian black metal scene?",
        "response": "Øystein Aarseth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1974 Pittsburgh Steelers draft pick was recognized by the Pro Football Hall of Fame in 1990?",
        "response": "Jack Lambert",
        "source": "hotpot_qa"
    },
    {
        "query": "Franklin Parish, Louisiana is named after a man born in what year?",
        "response": "1705",
        "source": "hotpot_qa"
    },
    {
        "query": "Carlo Emilio Gadda and Katharine Kerr both were considered what?",
        "response": "writers",
        "source": "hotpot_qa"
    },
    {
        "query": "How many men were rescued in the Meuse-Argonne Offensive in October 1918?",
        "response": "194",
        "source": "hotpot_qa"
    },
    {
        "query": "Which FX horror Series had its pilot episode premiered at the ATX Television Festival in Austin, Texas, in early June 2014, staring Rupert Penry-Jones?",
        "response": "The Strain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who replaced the Jamaican lager brewing company, Red Stripe, as the naming rights sponsor for the 31st edition of the Regional Super50?",
        "response": "the competition was unbranded for the first time in its history.",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of music was played by both Tappi Tíkarrass and INXS?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport (Delta County Airport or Grand Canyon West Airport)  is closer to a nearby city?",
        "response": "Delta County Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the squadron commanded by the Vice Admiral who also had command of British naval forces responsible for the death of Leberecht Maass?",
        "response": "1st Battlecruiser Squadron",
        "source": "hotpot_qa"
    },
    {
        "query": "Elder Mother is a being from folklore that is based mainly in what countries?",
        "response": "Nordic",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the production company that will produce the Hugo Award winning short story, Flowers for Algernon?",
        "response": "Alan Polsky and Gabe Polsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Drinkall is an American football coach of the Kansas Wesleyan Coyotes, located at  Kansas Wesleyan University in what city?",
        "response": "Salina",
        "source": "hotpot_qa"
    },
    {
        "query": "C.S. Lewis was a British novelist that wrote \"The Chronicles of Narnia\" that features the Seven Great Lords of Narnia that are mentioned in which two books?",
        "response": "mentioned in \"Prince Caspian\" and are central to the plot in \"The Voyage of the Dawn Treader\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Linqing and Meishan both prefecture-level cities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which UTC time zone was the 2002 FIVB Volleyball Men's World Championship based on?",
        "response": "UTC−3 time zone",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the director who devloped The Walking Dead for television born ",
        "response": "January 28, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the state in which Herschend Family Entertainment services a theme park owned by Dolly Parton?",
        "response": "Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"United States of Eurasia\" is featured on an album that sold how many copies in the first week of its debut?",
        "response": "128,000",
        "source": "hotpot_qa"
    },
    {
        "query": "John Stoltenberg is the managing editor of the magazine that focuses on what?",
        "response": "aging issues",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Jumanji\" actress is known as a common collaborator of Don Lake?",
        "response": "Bonnie Hunt",
        "source": "hotpot_qa"
    },
    {
        "query": "The Contest is an episode of \"Seinfeld\" that is initiated when a character played by whom tells the others that his mother caught him masturbating?",
        "response": "Jason Alexander",
        "source": "hotpot_qa"
    },
    {
        "query": "Takasaki, Gunma is famous as the hometown of a doll that symbolizes what?",
        "response": "perseverance and good luck",
        "source": "hotpot_qa"
    },
    {
        "query": "Which U.S. Army installation is loacted in the city for which Beth Finch served as the first female mayor?",
        "response": "Fort Bragg",
        "source": "hotpot_qa"
    },
    {
        "query": "The team finished what place  in the franchise's 59th season behind the team who went on to lose to the New York Yankees in the World Series?",
        "response": "fifth place",
        "source": "hotpot_qa"
    },
    {
        "query": "What American indie rock band has Robert Pollard as a main member and released it's 24th album in April 2017?",
        "response": "Guided by Voices",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1984 FA Cup Final had a controversial goal from a footballer who was dismissed following allegations of what?",
        "response": "sexism",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the songs that outperformed \"Drive\" was most successful in the United States?",
        "response": "\"Losing My Religion\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Ateneo de Davao University or Bohol Island State University in a city containing more letters?",
        "response": "Bohol Island State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Federated States of Micronesia held their Micronesian parliamentary election on?",
        "response": "5 March 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport does 2012 UEFA Champions League Final and Allianz Arena have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was climbed first Nangpai Gosum or Dhaulagiri?",
        "response": "Dhaulagiri",
        "source": "hotpot_qa"
    },
    {
        "query": "Michaël Llodra of France, called \"the best volleyer on tour\", defeated Juan Martín del Potro a professional of what nationality?",
        "response": "Argentinian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Nick Hexum or Kim Sung-kyu?",
        "response": "Nick Hexum",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Ferit Orhan Pamuk and Mary Doria Russell novelists from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Grizzly Bear or Jesus Jones?",
        "response": "Jesus Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Netflix series \"Unbreakable\" character is Elizabeth Claire Kemper known for playing?",
        "response": "Kimberly Couger \"Kimmy\" Schmidt",
        "source": "hotpot_qa"
    },
    {
        "query": "Senecio and Furcraea are both a genus of what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mine in California, lasting from 1873 to 1883, became one of the most noted mercury producers in the world?",
        "response": "Sulphur Bank Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Quincy Regional Airport, is a city owned public airport 12 miles east of Quincy, a city in Adams County, Illinois, it is used for general aviation but also sees which American airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex?",
        "response": "American Airlines, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the building of The first performance of Pohjola's Daughter built  ",
        "response": "1860",
        "source": "hotpot_qa"
    },
    {
        "query": " \"One Less Set of Footsteps\" is a song written and performed by a singer born in which year ?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Son Ye-jin rose to fame in romance-themed films and television series such as which 2008 South Korean film?",
        "response": "My Wife Got Married",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Vizsla and Bloodhound which one was originally bred for hunting deer?",
        "response": "Bloodhound",
        "source": "hotpot_qa"
    },
    {
        "query": " In the Wild Card round of the playoffs the Toronto Phantoms beat a team whose last coach was who?",
        "response": "Weylan Harding",
        "source": "hotpot_qa"
    },
    {
        "query": "Vaka is the common name for a track and lead single from which band that takes its name from the frontman's sister, Sigurrós Elín?",
        "response": "Sigur Rós",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professor emeritus of Mathematics and statistical mechanics at California State University was also a contributor to The Panda's Thumb? Mark Perakh",
        "response": "Mark Perakh",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Twisted'\" is a track from the soundtrack of which 1996 American disaster film, starring Bill Paxton and Helen Hunt as storm chasers researching tornadoes?",
        "response": "Twister",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of movies are 101 Dalmatians and G-Force?",
        "response": "American family comedy adventure",
        "source": "hotpot_qa"
    },
    {
        "query": "Baile de Los Locos is Voodoo Glow Skulls' third full-length album, track 25 is a cover of which macaronic Christmas song written in 1970 by which Puerto Rican singer and songwriter ?",
        "response": "José Feliciano",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Mark Hennessy and John Corabi both performed with Motley Crue?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In which newspaper was the short story published, of which the film Maniac is a loose adaptation ?",
        "response": "The Saturday Evening Post",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Fabulous Faker Boy\" is the 20th episode of the 24th season of \"The Simpsons\", it originally aired on the Fox network in the United States, on which date?",
        "response": "May 12, 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Kiley Dean was a back-up singer for what famous singer, who was also known as the Queen of Pop?",
        "response": "Madonna",
        "source": "hotpot_qa"
    },
    {
        "query": "This American is best known for his work on such Disney animated films as \"Beauty and the Beast\" and a 1996 American animated musical drama film whose plot centers on who?",
        "response": "Quasimodo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coached the team that lost in a game that started at 5:00 PM US EST on Monday, December 28, 2009?",
        "response": "Mike Sherman",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Leyton-Brown is a Professor of Computer Science and the university he attended was founded in what year?",
        "response": "1908",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occupation do both Grażyna Miller and Richard Fariña follow ?  ",
        "response": "poet",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie where Jensen Ross Ackles plays Jason Todd?",
        "response": "Patrick Lussier",
        "source": "hotpot_qa"
    },
    {
        "query": "William Thomas \"Tom\" Hulatt, (7 September 1930 – 21 May 1990) was an English athlete notable for finishing third behind Sir Christopher Chataway in the historic race in which Sir Roger Gilbert Bannister ran the first sub-four-minute mile on which date, Sir Bannister is an English former middle-distance athlete, physician and academic, who ran the first sub-four-minute mile?",
        "response": "6 May 1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Between what years could one have ordered the came house as the Evan F. Ellis Farmhouse?",
        "response": "between 1908 and 1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Archives and Artifacts is a box set by a band that has released how many studio albums?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "Major Ronald Ferguson's wife is the maternal grandmother of which two women?",
        "response": "Princesses Beatrice and Eugenie of York",
        "source": "hotpot_qa"
    },
    {
        "query": "Fred Durst and Marti Pellow, have which common occupation?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Golf Digest and Wizard or Wizard: The Magazine of Comics, Entertainment and Pop Culture published by the same company?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the treaty transfering the Sanjak of Pojega to the Habsburg Monarchy signed?",
        "response": "Sremski Karlovci",
        "source": "hotpot_qa"
    },
    {
        "query": "Not Alone, is Zhang Liyin's fourth overall single, released on August 20, 2014 in China and August 22 in South Korea,Zhang held a showcase to support the release of the single, which was held at the Century Theater in Beijing, guests at the said event include Kim Jong-dae, a South Korean singer-songwriter and actor, better known by which stage name?",
        "response": "Chen",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Skippy's current manufacturer based on?",
        "response": "Austin, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the king that started coin production in Copenhagen born?",
        "response": "2 February 1455",
        "source": "hotpot_qa"
    },
    {
        "query": "the National Film Award (Silver Lotus Award) for Best Male Playback singer was won six times for 4 different languages by Indian film playback singer who has won the Guinness World Record for recording the highest what?",
        "response": "number of songs",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Games and Official Xbox Magazine have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Voyager\" crew recovers its shuttlecraft containing Commander Chakotay and Chief of Security Tuvok, who had been exploring a nearby dark matter nebula is a scene in which television series?",
        "response": "Star Trek",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football team won a La Liga trophy in the season that started on 29 August 1998 and finished on 20 June 1999?",
        "response": "Fútbol Club Barcelona",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Burn\" and \"Walk Away\" were featured over the end title credits of a film directed by who?",
        "response": "Rob Bowman",
        "source": "hotpot_qa"
    },
    {
        "query": "While Myrsine refers to flowering plants, what type of plants are the Asphodelus?",
        "response": "perennial",
        "source": "hotpot_qa"
    },
    {
        "query": "What structure are both the Four Seasons Hotel Chicago and 900 North Michigan in?",
        "response": "skyscraper",
        "source": "hotpot_qa"
    },
    {
        "query": "What cornerback was re-acquired by the 2015 New York Jets along with a cornerback who had also played for the Arizona Cardinals, New York Jets and Indianapolis Colts?",
        "response": "Darrelle Revis",
        "source": "hotpot_qa"
    },
    {
        "query": "Essential Montreux is a box-set by a singer known for being a guitar virtuoso in what two genres?",
        "response": "rock and blues",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Francoa and Browallia in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Little Dieter Needs to Fly or We Come as Friends?",
        "response": "Little Dieter Needs to Fly",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of Benjamin O. Davis Sr.'s son?",
        "response": "Oliver",
        "source": "hotpot_qa"
    },
    {
        "query": "During active American involvement in World War II (1941–45), propaganda was used to increase support for the war and commitment to an Allied victory, using a vast array of media, propagandists instigated hatred for the enemy and support for America's allies, urged greater public effort for which event,  includes the arms, ammunitions, personnel and financing which were mobilized for the war?",
        "response": "Military production during World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "The Japan national football team in 2014 switched coaches to the former footballer who had what nickname?",
        "response": "El Vasco",
        "source": "hotpot_qa"
    },
    {
        "query": "H & G Simonds Ltd was a brewery founded in Reading, Berkshire, England in 1785, by William Blackall Simonds, eventually the firm became part of Scottish & Newcastle who sold the brands to which compnay that was formed in October 2006 from the merger of the brewing operations of Charles Wells Ltd and Young's Brewery?",
        "response": "Wells & Young's Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "The soundtrack to the film \"Avane Srimannarayana\" was composed by a man that was awardedthe Karnataka State Film Award for Best Music Director for what film? ",
        "response": "\"Jeerjimbe\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote Elephant Stone with the song writer John Squire?",
        "response": "singer Ian Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Denmoza and Olsynium both types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Payment of Existence is the third studio album by the Norwegian band Communic, what is the genre played by Communic also known as?",
        "response": "prog metal or technical metal",
        "source": "hotpot_qa"
    },
    {
        "query": "Chelemys delfini lives in the grassland and scrub of largest desert in Argentina occupying how many square kilometers?",
        "response": "673,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry Hunter was college basketball coach of what North Carolina university?",
        "response": "Western Carolina University",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the director of the political thriller starring Hugo Weaving and Natalie Portman?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "John Canoe is a festival that takes place in which commonwealth within the Lucayan Archipelago?",
        "response": "The Bahamas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more singles titles, Svetlana Kuznetsova or Joakim Nyström?",
        "response": "Joakim \"Jocke\" Nyström",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county is Lynda Blutreich's birthplace the largest city?",
        "response": "Essex County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which much more famous artist co-writes and sings backing vocals on Kellie Pickler's 2008 song \"Best Days of Your Life\"?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Canadian singer-songwriter, multi-instrumentalist and producer who's solo musical project is  Homeshake?",
        "response": "McBriare Samuel Lanyon \"Mac\" DeMarco",
        "source": "hotpot_qa"
    },
    {
        "query": "5 Magazine has featured Juan Mata, who is a professional football player for which position?",
        "response": "midfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther north, Zonic Shockum or Mallory Knox?",
        "response": "Mallory Knox",
        "source": "hotpot_qa"
    },
    {
        "query": "Patches from the Quilt is a digital EP released by an American Band that is from which state?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "In what part of England does The Dean of Blackburn head the chapter of canons?",
        "response": "Lancashire",
        "source": "hotpot_qa"
    },
    {
        "query": "What Connecticut team did František Kučera play for?",
        "response": "The Hartford Whalers",
        "source": "hotpot_qa"
    },
    {
        "query": "The Independent School League includes Washington, D.C. and part of what states?",
        "response": "Maryland and Virginia, along with a small portion of West Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American dancer worked at a jazz music bar and lounge in Atlantic City, New Jersey prior to its closing in the mid-1970's?",
        "response": "Elvera Sanchez",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Spencer Gordon Bennet and Paul McGuigan both directed films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Les Poissons and Howard Ashman related?",
        "response": "song",
        "source": "hotpot_qa"
    },
    {
        "query": "The fast fashion philosophy of quick manufacturing at an affordable price is used by a fashion retail chain that employs over how many people?",
        "response": "6,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist inspired Prince Ea and was placed at number 32 on the list of the \"Top 50 MCs of Our Time (1987-2007)?\"",
        "response": "Canibus",
        "source": "hotpot_qa"
    },
    {
        "query": "Mathura art is usually contasted with art that is the artistic manifestation of Greco-Buddhism, and is a cultural syncretism between buddhism and what?",
        "response": "Classical Greek culture",
        "source": "hotpot_qa"
    },
    {
        "query": " Do both of the drinks the Bronx Cocktail and the Blow Job contain fruit juice?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Garo Yepremian and Edward Manukyan, live in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Royal Oaks light rail station is located near a shopping mall owned by what company?",
        "response": "Fulcrum Property",
        "source": "hotpot_qa"
    },
    {
        "query": "The album that contains the song \"Get Together\" by Madonna was mainly recorded in whose home studio?",
        "response": "Stuart Price",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"It's Getting Boring by the Sea\" was featured on a French-Belgian film starring what actor?",
        "response": "Garance Marillier",
        "source": "hotpot_qa"
    },
    {
        "query": "The Norwegian sports car FYK was backed financially by a company with roughly how many employees?",
        "response": "20,500",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the composer of WAB 89 from?",
        "response": "Austrian",
        "source": "hotpot_qa"
    },
    {
        "query": "What brand mascot that was later used by Eagle Brand was voiced in commercials by an actress who also voiced a character in \"Astro Boy\"?",
        "response": "Elsie the Cow",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the singer of You're Only Lonely born?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the profession of the man who lends his name to the planet 1059 Mussorgskia, discovered in 1925?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent do both Witch-hazel and Broussonetia have native species originations?",
        "response": "Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "Todd Woodbridge and Lukáš Dlouhý, have which occupation in common?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "The Venetian Macao, is a luxury hotel and casino resort in Macau owned by the Las Vegas Sands Corporation is an American casino and resort operating company based in Paradise, Nevada, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Shayn Solberg's best known character \"Spencer Martin\" was from the show Eureka that took place in what town?",
        "response": "Eureka, Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "Both the 2010–11 UEFA Champions League knockout phase  and 011 UEFA Champions League Final were held at what London stadium?",
        "response": "Wembley",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Bruce Channel's best known song recorded?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth date of the wife of the painter of La Lecture?",
        "response": "June 17, 1891",
        "source": "hotpot_qa"
    },
    {
        "query": "Among Seohyun and John S. Hall who worked with King Missile?",
        "response": "John S. Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "While both singer-songwriters have displayed incredible talent, what sets Robert Palmer apart from Wayne Coyne, causing him to gain populatiry in two continents?",
        "response": "eclectic mix of musical styles",
        "source": "hotpot_qa"
    },
    {
        "query": "What Division I college that is part of the Big 12 Conference did Clint Ingram attend?",
        "response": "Oklahoma Sooners football",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the Winter Olympics take place during the year that Michael Raffl was named to Austria's ice hockey team?",
        "response": "Sochi, Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Neal Preston, who worked with an English rock band that formed in 1964,  also worked with other musicians from what genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the film released in which a star of “The Restless Gun” also appeared alongside Maureen O'Hara and Edmund Gwenn?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed the television series in which David Castro played Raphael Santiago?",
        "response": "Ed Decter",
        "source": "hotpot_qa"
    },
    {
        "query": "Pete Ham who wrote \"Baby Blue\" from the series finale of \"Breaking Bad\" also co-wrote this world number one hit with Harry Nilsson?",
        "response": "Without You",
        "source": "hotpot_qa"
    },
    {
        "query": "American singer-songwriter Taylor Swift has released four video albums and has appeared in thirty-eight music videos, five films and three television shows, she followed with three other music videos in 2008, including which song performed by American singer-songwriter Taylor Swift, and was written by Swift and produced by Nathan Chapman, alongside Swift, and was released on September 12, 2008 by Big Machine Records?",
        "response": "Love Story",
        "source": "hotpot_qa"
    },
    {
        "query": "What Valencia CF central midfielder scored 12 goals in the 2014-15 Valencia CF season?",
        "response": "Dani Parejo",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state of Australia can you find the Fitzroy Football Club where Norm Hillard, an Australian rules footballer, played and which represents an inner-Melbourne suburb?",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Garvin Cross had a role in the 1995 film that was created near what Canadian city?",
        "response": "Vancouver",
        "source": "hotpot_qa"
    },
    {
        "query": "Motion pictures featuring who abound and apparently constitute their own subgenre of the Christmas film genre, one of which is played by an American actor known for portraying Randy Taylor on \"Home Improvement\" ? ",
        "response": "Santa Claus",
        "source": "hotpot_qa"
    },
    {
        "query": "What month did the 2015 controversy surrounding Joshua Andrew Dolezal's sister came to media attention?",
        "response": "June",
        "source": "hotpot_qa"
    },
    {
        "query": "When were the band that had the song \"Show You the Way to Go\" formed?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2004 Louisville Cardinals football team by a coach who was a former what?",
        "response": "player",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of grandfather of the man that married the former Carol Shepp in 1965?",
        "response": "Slew",
        "source": "hotpot_qa"
    },
    {
        "query": "Vincent Drucci was a member of the North Side Gang which was the best known rival of the crime boss known by what nickname?",
        "response": "Scarface",
        "source": "hotpot_qa"
    },
    {
        "query": "The Little Mermaid is a Disney media franchise, it paved the way, for what would become the Disney Renaissance, it refers to the era from 1989 to which year, during which Walt Disney Feature Animation (renamed Walt Disney Animation Studios in 2006) experienced a creative resurgence in producing successful animated films based on well-known stories, which restored public and critical interest in The Walt Disney Company as a whole?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "What role is the actor who played Don Flack best known for?",
        "response": "Jim Craig",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Brandywine Productions produce that depicted Warrant Officer Ellen Ripley?",
        "response": "Alien",
        "source": "hotpot_qa"
    },
    {
        "query": "What game was presented by Citi took place at an outdoor athletic stadium in Pasadena, California, just outside Los Angeles?",
        "response": "2007 Rose Bowl",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the character played by Chloe Bennet that was auditioned for my Parisa Fakhri?",
        "response": "Daisy Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 55th Disney animated film with Jolin Tsai as part of the voice cast?",
        "response": "Byron Howard and Rich Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which Sterling Jerins played Constance Lane?",
        "response": "Marc Forster",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more stories, Carnegie Hall Tower or 56 Leonard Street?",
        "response": "Carnegie Hall Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "What tv series is the star of Beautiful & Twisted known for being the title character of?",
        "response": "Murphy Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the visual difference between The Lion King and A Far Off Place?",
        "response": "computer-animated epic musical drama",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the home ground of Goku's football team?",
        "response": "Estadio Municipal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who may have been present at the battle that led to the departure of Royal Governor Lord Dunmore?",
        "response": "Richard Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "The House of Mecklenburg-Schwerinis considered extinct due to a civil code compiled when?",
        "response": "around AD 500",
        "source": "hotpot_qa"
    },
    {
        "query": "Pettson and Findus and Eleanor's Secret were both European stories eventually published in what language?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "The transmitter for what station is located in New Hampshire?",
        "response": "WFEA",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city in the U.S. state of Michigan is Brown Stadium located ",
        "response": "Battle Creek",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the British-American musical fantasy film produced by Walt Disney Productions based upon the book 'How to Become a Witch in Ten Easy Lessons' which features the fraudulent magician Professor Emelius Browne who was played by David Tomlinson the English actor and comedian?",
        "response": "Bedknobs and Broomsticks",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the the collective work of the author who wrote \"The Chronicles of England, Scotland, and Ireland\" commonly known as?",
        "response": "Holinshed's Chronicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which court case, Gonzales v. Carhart or Lawrence v. Texas, struck down the sodomy law?",
        "response": "Lawrence v. Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the murder victim that worked in a restaurant, in which Mark Fuhrman was the detective?",
        "response": "Ron Goldman",
        "source": "hotpot_qa"
    },
    {
        "query": " Rhod Gilbert's Bulging Barrel of Laughs is a 6-part radio show with support from a comedian who won an award at what festival?",
        "response": "2008 Edinburgh Festival Fringe",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the designer of the Redmarshall Old Rectory born?",
        "response": "Knutsford, Cheshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who orchestrated the score on the album that \"Fathoms Below\" was featured on?",
        "response": "Thomas Pasatieri",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, 500 Years Later or My Best Fiend had a earlier release date?",
        "response": "My Best Fiend",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the player who died of cardiac arrest during practice play for the Celtics?",
        "response": "from 1987 to 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Who took Trevor Knight's starting position at quarterback on the Oklahoma Sooners college football team in the 2015 season?",
        "response": "Baker Mayfield",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the origin of the conductor of Where are You, my Brothers?",
        "response": "Armenian and Russian descent.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the manufacturer of the car used by the Ford CD2 platform's design inspiration?",
        "response": "Mazda",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county is Brown's Manor located?",
        "response": "Essex County",
        "source": "hotpot_qa"
    },
    {
        "query": "Dissident Irish Republican campaign includes which paramilitary group that began attacks around 2009?",
        "response": "Óglaigh na hÉireann",
        "source": "hotpot_qa"
    },
    {
        "query": "Chikku Bukku is based off of what film directed by Kwak Jae-yong?",
        "response": "The Classic",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the 1978 National League MVP and a two-time batting champion, who started off in a minor league baseball team, based in Monroe, North Carolina?",
        "response": "The Cobra",
        "source": "hotpot_qa"
    },
    {
        "query": "Bilal Çubukçu plays for a football club with how many consecutive East German championships from 1979-1988?",
        "response": "ten",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is more recent, No End in Sight, or Station to Station?",
        "response": "Station to Station",
        "source": "hotpot_qa"
    },
    {
        "query": "Edithvale railway station is located on a line that is situated in what city?",
        "response": "Melbourne, Australia",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Mandrake Root\" is a song by the globe's loudest band as listed in what book from 1975?",
        "response": "Guinness Book of World Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Abbas Torabian became team manager and director of a football team after his successful talks with a a Portuguese football coach  who has qualified how many national teams to the World Cup?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the keeper for AK during the 2007 AIK Fotboll season?",
        "response": "Swedish",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer born in London in 1988 joined The Voice as a new judge in 2015?",
        "response": "Jessie J",
        "source": "hotpot_qa"
    },
    {
        "query": "What record company recorded both The Gathering Field and Led Zeppelin?",
        "response": "Atlantic Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of unit was led by the German general who wanted to rush north up the Channel coast to capture Boulogne, Calais and Dunkirk during the Battle of Boulogne?",
        "response": "Panzer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album released in 1996 is featured in Streets is Watching ?",
        "response": "Reasonable Doubt",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the book of the musical Cry-Baby that is made by John Waters?",
        "response": "Thomas Meehan",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Godwin played college football in what conference?",
        "response": "Big Ten Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Lone Scherfig directed which film based on a 2009 novel?",
        "response": "One Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, The Plow That Broke the Plains or Seal Island?",
        "response": "The Plow That Broke the Plains",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Bombardier Dash 8's does the airline that operates flights to other communities in Finnmark from Honningsvåg Airport, Valan have?",
        "response": "41",
        "source": "hotpot_qa"
    },
    {
        "query": "T. A. Sarasvati Amma was a scholar born in a country with a population of over how many people?",
        "response": "1.2 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "In which area did this French engineer and physicist, whose name became synonymous to one of a series of concentric prolate ellipsoidal regions of space between and around a transmitting antenna and a receiving antenna system, contribute significantly?",
        "response": "theory of wave optics",
        "source": "hotpot_qa"
    },
    {
        "query": "The Singapore Sling is gin-based, while the Rusty Nail contains Scotch whisky and what?",
        "response": "Drambuie",
        "source": "hotpot_qa"
    },
    {
        "query": "8stops7 and X are both punk or rock bands from which U.S. state?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of Rupert Julian and Robert Z. Leonard?",
        "response": "Rupert Julian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of Outlawz was featured on 2Pac's song Who Do U Believe In?",
        "response": "Yaki Kadafi",
        "source": "hotpot_qa"
    },
    {
        "query": "Harvey Itano used electrophoresis to demonstrate the difference between normal hemoglobin and sickle cell hemoglobin in collaboration with a chemist born in what year?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "What city are WBQC-LD and WCPO-TV are located in?",
        "response": "Cincinnati, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "The tomb of the Unknown confederate soldier is on the grounds of the post-war home of what former president of the Confederate States of america?",
        "response": "Jefferson Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "The National Space Olympiad is conducted in remembrance of an astronaut  who first flew to space in what year ?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie and entertainment conglomerate was behind Million Dollar Arm and Herbie Rides Again?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did a pornographic actor appear in a John Sjogren American action film?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What Icelandic film editor's work includes a film starring Liam Neeson and Geoffrey Rush?",
        "response": "Valdís Óskarsdóttir",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of \"'71\" was also in \"Game of Thrones\"?",
        "response": "Richard Dormer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Missouri river has a tributary that originates from what peak in the Absaroka Range?",
        "response": "Yellowstone River",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Real Simple and EE Times online magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the wife of the richest man in Britian in the 1970s?",
        "response": "Viola Grosvenor",
        "source": "hotpot_qa"
    },
    {
        "query": "The casino owner who was focused on the documentary Nobody Speak: Trials of the Free Press focuses belongs to which nationality? ",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Bugs Bunny's home has been modeled after what famous piece of architecture?",
        "response": "Fallingwater",
        "source": "hotpot_qa"
    },
    {
        "query": "] Conax develops television encryption, conditional access and a set of access control technologies for restricting the use of proprietary hardware and what kind of works?",
        "response": "copyrighted",
        "source": "hotpot_qa"
    },
    {
        "query": "Himalchuli and Skil Brum are both what?",
        "response": "mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was more wild and rebellious, Pavement or The Nymphs?",
        "response": "The Nymphs",
        "source": "hotpot_qa"
    },
    {
        "query": "Criss Angel generated $150 million in tourist revenue for his live performance show in what city?",
        "response": "Paradise, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was from Germany, Anne Frank or Joseph Epstein?",
        "response": "Annelies Marie \"Anne\" Frank",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1976 Rebublican National Convention was held in what 19,500 seat indoor arena located in Kansas City, Missouri?",
        "response": "Kemper Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University has more campuses, Northwestern University or University of Colorado?",
        "response": "University of Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Uva and Rosemarie Uva, were married ex-cons from Ozone Park, Queens and considered a modern-day \"Bonnie and Clyde\", were American criminals who traveled the central United States with their gang during which time period, robbing people and killing when cornered or confronted?",
        "response": "Great Depression",
        "source": "hotpot_qa"
    },
    {
        "query": "Which philosopher, inventor and biomimicry experimenter is alluded to in The Vortex Garden?",
        "response": "Viktor Schauberger",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2016 American drama film stars an actor who played Victor in Dollhouse?",
        "response": "Come and Find Me",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Cuckoo Clock\" is a song written by Brian Wilson and Gary Usher for a band formed in what California city?",
        "response": "Hawthorne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician was born first, Lars Frederiksen or Thom Yorke?",
        "response": "Thomas Edward Yorke",
        "source": "hotpot_qa"
    },
    {
        "query": "A Snowball and a Caesar are both what type of beverage?",
        "response": "cocktail",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Wild Horses\" was written by Birdy and a songwriter from what city?",
        "response": "Derry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which railway station was Windermere Hotel located near ",
        "response": "Windermere railway station",
        "source": "hotpot_qa"
    },
    {
        "query": "Zayyan ibn Mardanish or Zayán Ibn Mardanix, died in Tunisia, a country in North Africa, on which continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who acted in the film and television series, \"Harry and the Hendersons,\" and also worked with Danny Glover?",
        "response": "Kevin Peter Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Alison Moyet and Eduardo Falaschi both have side gigs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The English chef known for his back-to-basics philosphy has a sister named what?",
        "response": "Sophy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that Jeanette Hain appeared in in 2008?",
        "response": "Stephen Daldry",
        "source": "hotpot_qa"
    },
    {
        "query": "What American politician, who was the first formally designated floor leader in the United States Senate, lived at 2000 G Street in Washington, D.C. from 1914 to 1925?",
        "response": "Oscar Wilder Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "The Nexus 10 is a tablet computer co-developed by Samsung Electronics, a, the world's second largest information technology company by revenue after which company?",
        "response": "Apple",
        "source": "hotpot_qa"
    },
    {
        "query": "Does The Island at the Top of the World have more computer animated characters than Monsters, Inc.?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Whos is OG Maco?",
        "response": "American rapper",
        "source": "hotpot_qa"
    },
    {
        "query": "Ashlan Davis played college football at a university whose football team is currently lead by what head coach?",
        "response": "Philip Montgomery",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed the film in which Adam Beach played Slipknot?",
        "response": "David Ayer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the university that the Deutsche Hochschule für Politik (DHfP) integrated into founded?",
        "response": "15 October 1811",
        "source": "hotpot_qa"
    },
    {
        "query": "What play was written by Evgeny Schwartz and directed by Benno Besson?",
        "response": "\"The Dragon\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Sunlight\" by Belgian producer The Magician features guest vocals by which English singer who also is the lead singer of the band Years & Years?",
        "response": "Olly Alexander",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy McClure is a fictional character from the American animated sitcom \"The Simpsons\" who appeared as the main character in an episode that aired when?",
        "response": "March 24, 1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the final Motown release of the singer who had a string of hits including \"How Sweet It Is (To Be Loved By You)\" and \"I Heard It Through the Grapevine\"?",
        "response": "In Our Lifetime",
        "source": "hotpot_qa"
    },
    {
        "query": "What Atlantic City shopping mall is in the Caesar's resort?",
        "response": "Playground Pier",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lucy Gordon acted in what Peter Chelsom directed movie?",
        "response": "Serendipity",
        "source": "hotpot_qa"
    },
    {
        "query": "Under the Yum Yum Tree starred this actress who was born in April, 1927?",
        "response": "Edie Adams",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the primary sponsor for the show Face the Ace opened?",
        "response": "June 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the film that Phyllis Smith played a voice role of Sadness in?",
        "response": "Pixar Animation Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the home stdium of Scott Crichton's college football team?",
        "response": "Reser Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Semisonic and White Magic both US-based rock groups?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What German aircraft designed by Seiegfried and Walter Günter at Heinkel Flugzeugwerke in 1934 was operated by Lehrgeschwader 1?",
        "response": "Heinkel He 111",
        "source": "hotpot_qa"
    }
]