[
    {
        "query": "Who is older, Edgar Wright or Ulli Lommel?",
        "response": "Ulli Lommel",
        "source": "hotpot_qa"
    },
    {
        "query": "Brookvale Bus Depot is a bus depot in the Sydney suburb of Brookvale, operated by which agency, of the Government of New South Wales, operating bus services in Sydney?",
        "response": "State Transit Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Apsley Cherry-Garrard a zoologist?",
        "response": "It was originally named Cherry Glacier by the British Antarctic Expedition, 1910–13, for Apsley Cherry-Garrard, zoologist with the expedition.",
        "source": "hotpot_qa"
    },
    {
        "query": "What  is a district of the city of Shantou, Chenghai District or Gaoping?",
        "response": "Chenghai",
        "source": "hotpot_qa"
    },
    {
        "query": "WNYC Studios is a producer and distributor of podcasts and on-demand and broadcast audio, it produces and distributes several podcasts including which titled podcast hosted by Jessica Williams of \"The Daily Show\" and Phoebe Robinson of \"Broad City\"?",
        "response": "2 Dope Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "In what modern city did Ferdinand Johann Adam von Pernau die?",
        "response": "Bavaria",
        "source": "hotpot_qa"
    },
    {
        "query": "Damon Albarn is an English singer, songwriter, and multi-instrumentalist, and principal songwriter of Gorillaz virtual band, an English virtual band created in which year, by musician Damon Albarn and artist Jamie Hewlett?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "What multi sport event held between December 6 - 13, 1969, located in Rangoon, Burma, included Aquatics such as swimming, diving, and waterpolo events?",
        "response": "1969 Southeast Asian Peninsular Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Hal Bruno was the moderator for the 1992 vice-presidential debate that included which environmentalist?",
        "response": "Albert Arnold Gore Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Danie Visser and Oliver Marach both Grand Slam tennis tournament winners at doubles?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Ahmad Nahavandi or Muhammad Iqbal?",
        "response": "Ahmad ibn Muhammad al-Nahawandi",
        "source": "hotpot_qa"
    },
    {
        "query": "What parade, which is the second-largest in the world, was started by John Martin & Co.?",
        "response": "Adelaide Christmas Pageant",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the catastrophic EF5-rated multiple-vortex tornado struck after which the Missouri Militia members have been active in disaster relief?",
        "response": "May 22, 2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Which African-American composer co-wrote Air?",
        "response": "Scott Joplin",
        "source": "hotpot_qa"
    },
    {
        "query": "As of the 2010 census, does Dongguan or Tongzhou District, Beijing have a larger population?",
        "response": "Dongguan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the foremost Croatian painters died who graduated froma public art school of higher education in Vienna, Austria?",
        "response": "4 July 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian electronic rock band formed in London, Ontario released a DVD directed by Dan Ouellette?",
        "response": "The Birthday Massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides the current head coach of the New York Knicks, which other Phoenix Suns players were acquired by the Sixers in the 1992-93 offseason?",
        "response": "Andrew Lang and Tim Perry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which champion tennis player is older, Maria Sharapova or Tony Roche?",
        "response": "Anthony Dalton Roche",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English writer wrote a non-fictional book about an operation in which 21,000 British troops were deployed?",
        "response": "Ken Wharton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which producer of Minutes to Midnight was born on February 11, 1977?",
        "response": "Mike Shinoda",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain range contains the highest rise of the Hazel River?",
        "response": "the Blue Ridge Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ernst Jünger and Dashiell Hammett both nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both operas Jenůfa and Oberon have the same number of acts?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Basin F was constructed by the United States Army in 1956, to provide for the disposal of contaminated liquid wastes from the chemical manufacturing operations of the Army and its lessee Shell Chemical Company, at which location, that's a United States chemical weapons manufacturing center located in the Denver Metropolitan Area in Commerce City, Colorado?",
        "response": "Rocky Mountain Arsenal",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Worth was an English actor, known for a 1951 British fantasy drama film that is an adaptation of what?",
        "response": "Charles Dickens' \"A Christmas Carol\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Imaan Hadchiti performed at what arts festival that is held at the capital of South Australia?",
        "response": "Adelaide Fringe Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is both Gleaston Castle and Ulverston located within?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of persona does the artist who released Special Herbs, Vols. 4, 5 & 6 adopt?",
        "response": "super villain",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author is known for her \"Anne of Green Gables\" books: Lucy Maud Montgomery or Jan Karon?",
        "response": "Lucy Maud Montgomery",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has starred in more musicals, Jo Kwon or Bada?",
        "response": "Bada",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1996 AT&T Challenge was a tennis tournament played in a city that in 2017 ranked third on the \"USA TODAY\" list of what?",
        "response": "50 best cities to live in",
        "source": "hotpot_qa"
    },
    {
        "query": "What present-day region was the historic base of these Iroquoian-speaking indigenous people who believed in the small, winged sprite of Native American mythology?",
        "response": "upstate New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Digby is an American power pop band whose 2004 album was produced by Todd Smith who has done work with a band that was formed in what year?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": " Shri Vile Parle Kelavani Mandal is a trust in which seventh-largest world country?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie included Robin Williams along with Joshua Aaron Charles, set in 1959 at a Vermont boarding school?",
        "response": "Dead Poets Society",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was born first, Barry Mahon or André Téchiné?",
        "response": "Barry Mahon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Blanca Padilla's role for Dolce and Gabbana?",
        "response": "She was the face",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Arthur C. Clarke or John Fowles?",
        "response": "Sir Arthur Charles Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "What city contains the base of the aviation company that Mobolaji Bank Anthony was a minority investor in?",
        "response": "Ikeja, Lagos State, Nigeria",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the shopping center located that Pacific Plaza was built to be similar?",
        "response": "Colindale, London",
        "source": "hotpot_qa"
    },
    {
        "query": "What based in London and was co-founded by Daniel Johnson, Miriam Gross, Jonathan Foreman and Michael Mosbacher had  a columnist for \"The Daily Telegraph\" write a columns for the magazine?",
        "response": "Standpoint",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country have some of Dilip D'Souza's articles been published?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in California was home to a team that Robert Girard played hockey for?",
        "response": "Oakland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the show that features a 20 second episode called \"All or Nothing\" and was created by Ryan Murphy?",
        "response": "Glee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the parent company of the production company that produced the Shnookums and Meat Funny Cartoon Show?",
        "response": "Disney Channels Worldwide",
        "source": "hotpot_qa"
    },
    {
        "query": "Which operation took place farther north, Operation Nordwind or Gothic Line?",
        "response": "Operation North Wind",
        "source": "hotpot_qa"
    },
    {
        "query": "Self and Family Life are both magazines, do they share the same publisher?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the bassist for the ongoing show hosted by a previous president of \"The Harvard Lampoon\" who was also a writer for \"Not Necessarily the News\" born?",
        "response": "July 28, 1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English woman born on 26 May 1957 was Gitta Sereny, CBE known for interview and and profiles of controversial figures of",
        "response": "Mary Flora Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Martin Fry or Mike Shinoda?",
        "response": "Michael Kenji Shinoda",
        "source": "hotpot_qa"
    },
    {
        "query": "UC Berkeley School of Law produced Edwin Meese, an American attorney and law professor, the schools is also one of how many schools and colleges at the University of California Berkeley?",
        "response": "14",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Ricky Frazier play on three Big Eight Conference championship teams?",
        "response": "Columbia, Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "Who defeated Kaiserslautern  in the 1971–72 DFB-Pokal?",
        "response": "FC Schalke 04",
        "source": "hotpot_qa"
    },
    {
        "query": "What characteristic of Munchkin cats is due to osteochondrodysplasia?",
        "response": "short legs",
        "source": "hotpot_qa"
    },
    {
        "query": "This English actor who starred in a supporting role in 24 Hour Party People also starred in a British-American comic science fiction film that follows a group of friends who discover an alien invasion during what?",
        "response": "an epic pub crawl",
        "source": "hotpot_qa"
    },
    {
        "query": "John D. \"Colonel Jack\" Henderson was a Colonel in the Border Wars of Bleeding Kansas, a series of violent political confrontations in the United States between what years?",
        "response": "1854 and 1861",
        "source": "hotpot_qa"
    },
    {
        "query": "Fernhill is a suburb west of Towradgi, in a local government area in the lllawarra region of New South Wales, Australia, that is adjacent to what sea?",
        "response": "Tasman Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Did William C. McGann or Nicholas Hytner produce a film first?",
        "response": "William C. McGann",
        "source": "hotpot_qa"
    },
    {
        "query": "The rapper of For Whom the Beat Tolls is one half of what group? ",
        "response": "T.H.E.M.",
        "source": "hotpot_qa"
    },
    {
        "query": "Dirty Dancing, an American reality television series, is hosted by an American actor and choreographer known for his brief marriage to whom?",
        "response": "Jennifer Lopez",
        "source": "hotpot_qa"
    },
    {
        "query": "What date did the Major League Baseball draft, in which Alex Lange was drafted by the Chicago Cubs, begin?",
        "response": "June 12, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American comedian born on March 21, 1962, appeared in the movie \"Sleepless in Seattle?\"",
        "response": "Rosie O'Donnell",
        "source": "hotpot_qa"
    },
    {
        "query": "Pride & Joy featured the American actor and producer known as Ari Gold on which comedy series?",
        "response": "Entourage",
        "source": "hotpot_qa"
    },
    {
        "query": "Was 1 More Hit or Giuliani Time released earlier?",
        "response": "Giuliani Time",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who was starred in \"The Last Best Year\" with Bernadette Peters born?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "What film directed by Alfred Hitchcock in 1963 had a sequel made for television in 1994?",
        "response": "The Birds",
        "source": "hotpot_qa"
    },
    {
        "query": "What barrier does Hannah Baxter remove when she acknowledges and comments directly to the audience?",
        "response": "fourth wall",
        "source": "hotpot_qa"
    },
    {
        "query": " What If... is a 2010 drama film that stars an actork best known as Cliff Clavin in what?",
        "response": "Cheers",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2000 Motor City Bowl was a National Collegiate Athletic Association bowl game, it was played on December 27, 2000 at which stadium in Pontiac, Michigan, United States?",
        "response": "Pontiac Silverdome",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Justin David Swibel and Robert Lepage both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Full House\" actor co-wrote an album released in September 2012?",
        "response": "John Phillip Stamos",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Handsworth Grammar School located just off the A41 begin admitting girls in addition to boys?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the birth town of Daniel Boyarin according to the 2010 United States Census?",
        "response": "16,116",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fiery disaster occurred in Ghana in 2015 due to the Accra floods?",
        "response": "a petrol station explosion",
        "source": "hotpot_qa"
    },
    {
        "query": "What clan, hailing from a 13th century tower house, did Alexander Fraser of Touchfraser and Cowie descend from?",
        "response": "Clan Fraser",
        "source": "hotpot_qa"
    },
    {
        "query": "What Pulitzer prize winning, American composer known for exploring addiction and homophobia, wrote \"Tick, Tick...Boom!\"?",
        "response": "Jonathan Larson",
        "source": "hotpot_qa"
    },
    {
        "query": "which american singer and actress did the , Cobb Energy Performing Arts Centre$145 million facility celebrated concert ",
        "response": "Linda Eder",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of film are \"Transparent\" and \"Werner Herzog Eats His Shoe\"?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Musée Grévin Montreal is connected to the Montreal Metro via which station?",
        "response": "McGill station",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 160th Manchester Derby, the goals scored by the defeated team before half time were scored by a versatile English professional footballer playing as a centre back and this athlete.",
        "response": "Edin Džeko",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a public university, University of California or Amherst College?",
        "response": "University of California",
        "source": "hotpot_qa"
    },
    {
        "query": "Klay Alexander Thompson set a then 484 combined three-pointer season record with his teammate who many have called the greatest what?",
        "response": "shooter in NBA history",
        "source": "hotpot_qa"
    },
    {
        "query": "Darren Romanelli has had collaborations with which company founded in 1908?",
        "response": "Converse",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2005, who won the first on two consecutive North American rounds of the highest class of single-seat auto racing sanctioned by the FIA?",
        "response": "Kimi Räikkönen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which surf guitarist influenced other guitarists with advances in amplifiers?",
        "response": "Dick Dale",
        "source": "hotpot_qa"
    },
    {
        "query": "What was released first, Coco or The Nightmare Before Christmas?",
        "response": "The Nightmare Before Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Abdellah Bidane, also known as Abdellah Bidar, is a Moroccan football defender who played for Morocco in which tournament, held in Mexico from 31 May to 29 June 1986?",
        "response": "1986 FIFA World Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the company that operated the SS \"Germanic ocean liner ?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "What tv show did Sarah Price direct that Will Finn did not?",
        "response": "The Carrie Diaries",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the professional ice hockey teams, Dayton Demolition and Dayton Demonz play their home games?",
        "response": "at the Hara Arena in nearby Trotwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the British Conservative politician who served three periods as Foreign Secretary against the Labour Party?",
        "response": "Anthony Eden",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seventh studio album from American Rapper Eminem?",
        "response": "Recovery",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the English actor, who starred in Night Train to Venice and has won a Golden Globe, breakthrough in the film industry?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession, D.W. Kann or Kenny Ortega?",
        "response": "D.W. Kann",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of food does this restaurant in Downtown Las Vegas, Nevada that offers similar services to a breastaurant and courted controversy by serving high-calorie menu items with deliberately provocative names?",
        "response": "hamburger",
        "source": "hotpot_qa"
    },
    {
        "query": "The university that William P. Baker went to is the founding school of what system?",
        "response": "California State University (CSU) system",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Ford played for which football club based out of Old Trafford?",
        "response": "Manchester United",
        "source": "hotpot_qa"
    },
    {
        "query": "The first bald eagle in history, Challenger, is trained to free fly into major sporting events during what national anthem of the United States of America",
        "response": "The Star-Spangled Banner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American educator, stateswoman, philanthropist, humanitarian and civil rights activist coined the term of the Black Cabinet, or Federal Council of Negro Affairs or Black Brain Trust?",
        "response": "Mary Jane McLeod Bethune",
        "source": "hotpot_qa"
    },
    {
        "query": "Under what name does Mikiyo Tsuda write Yaoi?",
        "response": "Taishi Zaō",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this liberal arts college for men in Virginia, where head football coach Bob Thalman served from 1956 to 1959?",
        "response": "Hampden–Sydney College",
        "source": "hotpot_qa"
    },
    {
        "query": "What gaming systems was The Last Guardian and Shadow of the Colossus made for?",
        "response": "PlayStation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building is taller, Marine Midland Building or W New York Downtown Hotel and Residences?",
        "response": "Marine Midland Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Miracle is a song by Julian Perretta, that was a collaboration with what Belgian DJ and record producer that is best known for \"Are you with me\" and \"Reality\"?",
        "response": "Lost Frequencies",
        "source": "hotpot_qa"
    },
    {
        "query": "Library of Souls is the third book in which Ransom Riggs fantasy series?",
        "response": "Miss Peregrine's Home for Peculiar Children",
        "source": "hotpot_qa"
    },
    {
        "query": "In what month was the album containing the song \"Ooh Baby (You Know That I Love You)\", by George Harrison, released?",
        "response": "September",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Heterotheca and Fennelboth flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What mountainous topography spans the French-Italian border?",
        "response": "Mont Blanc",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the youngest billionaire in the world and created a photo messaging application for self-deleting photos?",
        "response": "Evan Spiegel",
        "source": "hotpot_qa"
    },
    {
        "query": "Jalin Marshall signed with the Jets as an undrafted free agent following what 81st annual meeting of National Football League (NFL) franchises?",
        "response": "2016 NFL Draft",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the politician to whom Rajeev Topno was appointed private secretary on 16 July 2014 born?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Kelton, Utah was a section station on what railroad constructed between 1863-1869?",
        "response": "First Transcontinental Railroad",
        "source": "hotpot_qa"
    },
    {
        "query": "The first athlete who won the gold medal for the \"yellow-blues\" Ukraine team was born in what year?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Due West made it into the top-20 on the digital cable network owned by what company?",
        "response": "Scripps Networks Interactive",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Arundel Cathedral and Carlisle Cathedral both located in England?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one has been bred as a GMO creeping bent grass,  Weigela or Agrostis?",
        "response": "Agrostis",
        "source": "hotpot_qa"
    },
    {
        "query": "Provincial road N701 connects the Rijiksweg 6 to what city, named after Cornelis Lely?",
        "response": "Lelystad",
        "source": "hotpot_qa"
    },
    {
        "query": "Stuart James McCullum, is a former cricketer, who played for Otago throughout his career, he is the father of Nathan Leslie McCullum,a former New Zealand international cricketer, who represented New Zealand in Twenty20 Internationals and One Day Internationals, born on which date?  ",
        "response": "1 September 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "Eurovegas was a gambling resort project begun by a man who also owns an Israeli newspaper. What is the name of this newspaper?",
        "response": "Israel Hayom",
        "source": "hotpot_qa"
    },
    {
        "query": "Universal Music Group, AKA Universal, released \"The Ultimate Collection\" in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "This women’s clothing, footwear and accessories retailer is frequented by the wife of James Matthews; where was it founded?",
        "response": "Hampstead",
        "source": "hotpot_qa"
    },
    {
        "query": "Die Hochzeit des Camacho (\"Comacho's Wedding\") is a Singspiel in two acts by Felix Mendelssohn,was a German composer, pianist, organist and conductor of the early Romantic period, and died on which date?",
        "response": "4 November 1847",
        "source": "hotpot_qa"
    },
    {
        "query": "MindGamers is a 2015 Austrian science fiction film directed by who, the film stars Antonia Campbell-Hughes, a Northern Irish actress and former fashion designer, best known for appearing in Jack Dee's sitcom \"Lead Balloon\"?",
        "response": "Andrew Goth",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Zixing and Baotou are cities in what Asian country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2011, what was the population of the town in which Phil Nilsen was born?",
        "response": "134,122",
        "source": "hotpot_qa"
    },
    {
        "query": "El Peyote Asesino is an Uruguayan hip-hop and hard rock band, Terraja 1998, was produced by which Argentine musician, film composer and producer?",
        "response": "Gustavo Alfredo Santaolalla",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the North American women's basketball league in which includes an All-Star game starting in 1999?",
        "response": "Women's National Basketball Association",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Armen Chakmakian and Steve Dildarian have in common?",
        "response": "producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Charlotte Rampling had a role in a neo-noir psychological horror and occult detective film written and directed by who?",
        "response": "Alan Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the current Attorney General of Missouri run against Kurt Schaefer?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Which group operates this hotel that held the 33rd AVN Awards in 2016?",
        "response": "Warner Gaming",
        "source": "hotpot_qa"
    },
    {
        "query": "What era was the show, in which Peter Sellers co-starred with a French actress, popular during?",
        "response": "1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more species, Mussaenda or Sanguinaria?",
        "response": "Mussaenda",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the organisation responsible for hiring an attorney to represent the relatives of an individual who was shot dead by FBI agent Aaron McFarlane in May 2013?",
        "response": "the Council on American–Islamic Relations",
        "source": "hotpot_qa"
    },
    {
        "query": "Pacific Fibre competed with the trans-Pacific network of communications that was commissioned in what year?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the actor that played Blackie Parrish on \"General Hospital\" play in Never Too Young To Die?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays the other star role alongside Meg Ryan in Joe Versus the Volcano?",
        "response": "Tom Hanks",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Erika Jayne or Marco Da Silva",
        "response": "Erika Jayne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress, who at age twelve gained widespread recognition from her role as Claudia in \"Interview with the Vampire\", stars in The Virgin Suicides?",
        "response": "Kirsten Dunst",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rocky Shades and Les Taylor from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What quarterback, born in 1082, was acquired by the Buffalo Bills in 2015?",
        "response": "Matt Cassel",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the president of the company that ranked Randy Neugebauer \"the most conservative\" member of the House in 2011?",
        "response": "Kevin Turpin",
        "source": "hotpot_qa"
    },
    {
        "query": "Everybody's Got Somebody but Me was written by the country music singer signed to what label?",
        "response": "Atlantic Records Nashville",
        "source": "hotpot_qa"
    },
    {
        "query": "What act did the writer of A New Theory of the Earth help instigate?",
        "response": "Longitude Act",
        "source": "hotpot_qa"
    },
    {
        "query": "Field Marshal Alan Francis Brooke, 1st Viscount Alanbrooke, & Bar, was a senior officer of the British Army, As chairman of the Chiefs of Staff Committee, Brooke was the foremost military advisor to which British Prime Minister, and had the role of co-ordinator of the British military efforts in the Allies' victory in 1945, who was this British statesman, army officer, and writer?",
        "response": "Winston Leonard Spencer-Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hennchata and Black Velvet both a type of cocktail?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American magazine covered topics related to amateur radio and radiocommunication experimentation, Modern Screen or QEX?",
        "response": "QEX",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who played Nathan Appleby in The Living and the Dead born?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the scientist, who is the namesake of the Tyndall Center, die?",
        "response": "1893",
        "source": "hotpot_qa"
    },
    {
        "query": "Longden End Brook is a water course in what metropolitcan county in northwest England?",
        "response": "Greater Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Swedish Livonia, which constituted the southern part of modern Estonia, was fully ceded in what peace treaty between Sweden, the Polish-Lithuanian Commonwealth, the Habsburgs and Brandenburg-Prussia?",
        "response": "Treaty of Oliva",
        "source": "hotpot_qa"
    },
    {
        "query": "Girls' Generation-TTS (, also known as TTS, TaeTiSeo, or Girls' Generation-TaeTiSeo) is a subgroup of South Korean girl group Girls' Generation, formed by S.M. Entertainment in 2012, is composed of three Girls' Generation members: Taeyeon, Tiffany, and which South Korean singer and actress, known professionally as Seohyun, born in which year ?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "The Marine Air Terminal (\"Terminal A\"), located at where, which is an airport in the northern part of the New York City borough of Queens in the United States?",
        "response": "LaGuardia Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the British breed of domestic pig which shares its name with a village and parish on the edge of The Fens in Lincolnshire, England?",
        "response": "Baston",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the daughter of Mahesh Bhatt star in an Abhishek Chaubey film?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Russian former figure skater who often skated to the music of Edvin Marton born?",
        "response": "3 November 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Blue Like Jazz stars and Australian actress born on June 11th of what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Who signed the Enforcement Act of 1871 and served as Commaning General of the US Army at the end of the American Civil War?",
        "response": "Ulysses S. Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "Yamaha Crux was launched in 2004 to replace a motorcycle model that was manufactured in which country ?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Azorina or Azadirachta?",
        "response": "Azadirachta",
        "source": "hotpot_qa"
    },
    {
        "query": "Spry was a brand of vegetable shortening produced by a British manufacturing company founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "What position does the American football player Troy Aikman play; the owner of the club being Jerry Jones?",
        "response": "quarterback",
        "source": "hotpot_qa"
    },
    {
        "query": "In regards to the American attitude that is reflected in They Met in Argentina, what president enacted that policy?",
        "response": "Franklin Roosevelt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which project will create more buildings, One Manhattan Square or 80 Flatbush?",
        "response": "80 Flatbush",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had the debut album \"Whisper War\", Boyce Avenue or The Cab?",
        "response": "The Cab",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist began writing earlier, Joseph Roth or J. M. Coetzee?",
        "response": "Joseph Roth",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Chuck Billy and Tracey Thorn share the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "How was the university whose basketball team had a record of 13-12 between 1942 and 1944 established?",
        "response": "The university was established in 1865 as a land grant college and is the flagship university",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the man who played Harold Jones in \"Radio\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What company owns the magazine that shares a name with the channel that airs the show Oorum Unavum?",
        "response": "SRM Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Eastern College Athletic Conference hockey team has its home arena at the Major Donald W. Holleder Center athletic complex?",
        "response": "Army Black Knights",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the breakout movie for the actress and singer who sang backup vocals on \"Spitfire\" by The Prodigy?",
        "response": "\"Cape Fear\"",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Grammy Awards has the soprano who gave Vocalise its world premier won?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Louise Diane d'Orleans is the youngest legitimised daughter of a monarch of the House of Bourbon who reigned as king of france beginning in what year?",
        "response": "1643",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did Isaac Jefferson work for Thomas Jefferson?",
        "response": "Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "The short documentary film \"Chau, Beyond the Lines\" is about a 16 year-old disabled by an defoliant chemical widely used by the U.S. Military who aspires to design what?",
        "response": "clothing",
        "source": "hotpot_qa"
    },
    {
        "query": "Wild Horse, Nevada is a community in the county whose population is what?",
        "response": "48,818",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kamal Haasan and James Kerwin of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was released second Charlie, the Lonesome Cougar or Mulan?",
        "response": "Mulan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ferndale Light Rail System is located in what Maryland county?",
        "response": "Anne Arundel County",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Glenn Bidmead and Gregg Allman both songwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How many feature films has the actor who plays a young American man in the movie Before Sunrise, directed?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the painting stolen on March 19, 1990 for which a museum initially offered a $5 million reward for information leading towards its recovery?",
        "response": "Landscape with Obelisk is painting by Dutch artist Govert Flinck",
        "source": "hotpot_qa"
    },
    {
        "query": "Who first portrayed the Commander shown in Star Trek Beyond in the original Star Trek media franchise?",
        "response": "Leonard Nimoy",
        "source": "hotpot_qa"
    },
    {
        "query": "What American sportscaster who hosted The NFL Today and Thursday Night Football, also hosted The World's Funniest?",
        "response": "James Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of films are The Times of Harvey Milk and Innocence?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which entirely Canadian-born team scored 4 points in the 1975 Stanley Cup?",
        "response": "1974–75 Philadelphia Flyers",
        "source": "hotpot_qa"
    },
    {
        "query": "Arch Hall (foaled 2001 in Ontario) is a Canadian Thoroughbred racehorse best known for his three consecutive wins in the Sir Barton Stakes at Woodbine Racetrack in Toronto, he's owned and bred by Eugene Melnyk, a Ukrainian Canadian businessman who has since February 1991, has resided in which country?",
        "response": "Barbados",
        "source": "hotpot_qa"
    },
    {
        "query": "Umbarra was the Aboriginal elder of  what town in Australia in the Bega Valley Shire?",
        "response": "Bermagui",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog would be a more successful hunter, Basset Fauve de Bretagne or Small Greek Domestic Dog?",
        "response": "Basset Fauve de Bretagne",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the company that published the video game Prototype founded?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Mission Records was created by which lead singer of The Eagles?",
        "response": "Glenn Lewis Frey",
        "source": "hotpot_qa"
    },
    {
        "query": "Guardians of the Galaxy the movie is based on the comic book by what authors?",
        "response": "Dan Abnett and Andy Lanning",
        "source": "hotpot_qa"
    },
    {
        "query": "Who currently serves as the executive chairman of the company who owns and operates Sam's Town Hotel and Gambling Hall, Shreveport?",
        "response": "Bill Boyd",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Susan Stafford and Vanna White have in common?",
        "response": "\"Wheel of Fortune\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city sports locations for both the Specialty Restaurants Limited restaurant company and the Bombay Stock Exchange? ",
        "response": "Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NFL quarterback played college football for Florida State University, was drafted by the Minnesota Vikings in 2011, and replaced Donovan McNabb as starting quarterback for the Vikings?",
        "response": "Christian Ponder",
        "source": "hotpot_qa"
    },
    {
        "query": "What language do both Acinos and Carpobrotus get their names from?",
        "response": "Greek",
        "source": "hotpot_qa"
    },
    {
        "query": "Two posthumous albums by John Lennon (credited with Yoko Ono) were released: \"Milk and Honey\" and what other record?",
        "response": "Double Fantasy",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Aram Avakian and Denis Peterson both have American heritage?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monoral and Versus both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What New York City Borough contains the 7 World Trade Center and the Collegiate Reformed Protestant Dutch Church",
        "response": "Manhattan",
        "source": "hotpot_qa"
    },
    {
        "query": "Terephthaloyl chlorideis the acid chloride of terephthalic acid and is one of two monomers used to make a para-aramid synthetic fiber related to other aramids such as Nomex and what",
        "response": "Technora",
        "source": "hotpot_qa"
    },
    {
        "query": "This American poet and lecturer has her poems appear in which American online magazine that publishes poetry, short stories and creative nonfiction?",
        "response": "Word Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the postcode of a town in Cook County, New South Wales, that is situated approximately 100 km west of the Sydney central business district, and about 8 km east of Katoomba?",
        "response": "2782",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Haibowan District and Bei'an both in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these gymnasts is younger, Tim Daggett or Bart Conner?",
        "response": "Bart Conner",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Paul King or Jimmy Urine?",
        "response": "Paul King",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year died one of the supporting actors of the film \"Sailor's Lady\"?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "What adult Swim show described as a \"Southern Gothic drama\" starred the actress who played Hazel Wassername on \"30 Rock\"?",
        "response": "The Heart, She Holler",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American rock band is from Chapel Hill, North Carolina - Polvo or The Black Keys?",
        "response": "Polvo",
        "source": "hotpot_qa"
    },
    {
        "query": "The Second Rudd Ministry included which Deputy Prime Minister who represented the Division of Grayndler?",
        "response": "Anthony Norman Albanese",
        "source": "hotpot_qa"
    },
    {
        "query": "The Visitors was directed by a man that died in what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean Vander Pyl provided the voice of Rosie on the Hanna-Barbera animated sitcom that originally premiered on which date?",
        "response": "September 23, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "For which film did the female star of the film Mrs Doubtfire receive her second Academy Award ?",
        "response": "Places in the Heart\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What 115 acre theme park at the Disney Resort in Urayasu, Chiba, Japan, did Donn B. Tatum play a major role in the creation of?",
        "response": "Tokyo Disneyland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was published first, Lords of Waterdeep or Drunter und Drüber?",
        "response": "Drunter und Drüber",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of Handel's Messiah covers the birth of a child who, according to the gospels of Luke and Matthew, was born in Bethlehem?",
        "response": "Part I",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the profession of the person who helped Edward Denison Ross write The Broadway Travellers?",
        "response": "economic historian and medievalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose compositions, entitled \"Where Are You\", \"Lay It on Me\", \"Country Woman\" and \"On Time\" were included in some of the Bee Gees' albums?",
        "response": "Maurice Gibb",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2007–08 Premier League was sponsored by which British multinational bank?",
        "response": "Barclays",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicholas Medforth-Mills is a grandson to a king who was born on what day and year?",
        "response": "25 October 1921",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1935 film \"The Informer\" starring Una O'Connor?",
        "response": "John Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "What Danish former football player, manager and licensed agent led the FC Bayern Munich team during their 1991-92 season from 9 October to 11 March?",
        "response": "Søren Lerby",
        "source": "hotpot_qa"
    },
    {
        "query": "3 Days in Havana was directed by an actor best known for what role in \"The Shawshank Redemption\"?",
        "response": "Tommy Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Helen Fielding and Neil Simon English screenwriters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the doubles partner who assisted an American professional tennis player known primarily as a doubles specialist and current tennis broadcaster for ESPN, defeat Larisa Savchenko and Natasha Zvereva in the 1989 Virginia Slims Championships?",
        "response": "Navratilova",
        "source": "hotpot_qa"
    },
    {
        "query": "What German Field Marshal coined the name 1st Battle of Khaskov in Worl War 2?",
        "response": "Wilhelm Keitel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, The Fader or Playgirl featured semi-nude or fully nude men?",
        "response": "Playgirl",
        "source": "hotpot_qa"
    },
    {
        "query": "Randolph Apperson Hearst, was the fourth and last surviving son of William Randolph Hearst and Millicent Hearst, and is the father of which granddaughter of American publishing magnate William Randolph Hearst?",
        "response": "Patty Hearst",
        "source": "hotpot_qa"
    },
    {
        "query": "From what county is Steven Avery, wrongfully convicted man on which the documentary Making a Murderer is based? ",
        "response": "Manitowoc County, Wisconsin",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state are based the animated studios for the producer of the 1991 animated feature film 'Beauty and the Beast' who also create short films and television specials?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "The biographical war film about Lyudmila Pavlichenko, the most successful female sniper in history, credits her with how many kills? ",
        "response": "Credited with 309 kills",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was footage from the role playing game convention in the \"Fellowship of the Dice\" filmed?",
        "response": "Southern California",
        "source": "hotpot_qa"
    },
    {
        "query": "who is younger Ulrich Walter or  Luca Parmitano?",
        "response": "Luca Parmitano",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the metal band who's retrospective box set of albums was entitled Trolsk Sortmetall 1993-1997?",
        "response": "Ulver (Norwegian for wolves) are a Norwegian experimental musical collective founded in 1993, by vocalist Kristoffer Rygg.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bruce Robinson and Giacomo Gentilomo of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2009 Houphouët-Boigny stampede occurred on 29 March 2009 in the Stade Félix Houphouët-Boigny in Abidjan, Côte d'Ivoire before a 2010 FIFA World Cup qualification match, the match was particularly popular among locals, with world stars such as which professional footballer who plays for Championship side Cardiff City and the Ivory Coast national team, as a centre-back?",
        "response": "Souleymane \"Sol\" Bamba",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Weyer was the umpire when Pete Rose broke the record of a Major League outfielder who was born in what city in Georgia?",
        "response": "Narrows",
        "source": "hotpot_qa"
    },
    {
        "query": "What university with  Its headquarters in Carlisle, merged with a college that  provided undergraduate and postgraduate courses in the arts, humanities, business studies, teacher training, health and social care?",
        "response": "The University of Cumbria",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of the TV series \"Family Guy\" produced what American sitcom?",
        "response": "Blunt Talk",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the current name of the city whose previous name is the same as the movie featuring the song \"Humma Humma\"?",
        "response": "Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Jong-hyun's first studio album was distributed by whom?",
        "response": "KT Music",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has been active for the longer period of time, The Bluebells or Gnarls Barkley?",
        "response": "The Bluebells",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American talk show and radio host was an executive producer on a show that aired from January 16, 2007 until March 20, 2007?",
        "response": "Andy Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the nationalities of Leonid Khachiyan and Sofia Kovalevskaya?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the town that the second president and chairman of the board of Marshall Field & Company gifted a library to ?",
        "response": "Alstead, New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "William Phillips worked on the second-unit of the Canadian sci-fi horror film that was released in what year?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Grosvenor House is owned by the president of what authority?",
        "response": "Dubai Civil Aviation Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Lantana or Silybum?",
        "response": "Lantana",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the airline Niki schedule their destinations?",
        "response": "March 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Sadok Sassi played for a national team that made its first World Cup in what year?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Yoo Seung-ho, is a South Korean actor who rose to fame as a child actor, he headlined the historical film, The Magician, a South Korean period fantasy film, released in which year, directed by Kim Dae-seung?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Franco Alesi's racing driver son participated in the 1991 German Grand Prix, held where?",
        "response": "Hockenheimring",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country did Claude Lanzmann's holocaust documentary film take place in?",
        "response": "Poland",
        "source": "hotpot_qa"
    },
    {
        "query": "What old, Catholic university is home to a radio station with its antenna atop the Montefiore Medical Center?",
        "response": "Fordham University",
        "source": "hotpot_qa"
    },
    {
        "query": "What Golden State Warriors player was born in the country with the capitol of Castries?",
        "response": "Chris Boucher",
        "source": "hotpot_qa"
    },
    {
        "query": "What SNL skit starred an actor that also starred in The Mighty Ducks and was rated 88/100 of VH1's greatest teen stars?",
        "response": "What Up with That",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person that Mark Kidel did a portrait of was born in 1947?",
        "response": "John Adams",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university's teams with a mascot called Stomper began competing in the Northern Sun Intercollegiate Conference in 2008?",
        "response": "Minnesota State Mavericks",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the highest mountain in Germany, ahead of the Hochwanner the highest peak on the main ridge of the Wetterstein, lying south of the town of Garmisch-Partenkirchen?",
        "response": "Zugspitze",
        "source": "hotpot_qa"
    },
    {
        "query": "What filmmaker made 40 predominately B-movies, Scott Shaw or Seijun Suzuki?",
        "response": "Seijun Suzuki",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Golden Globe Awards did this English retired actress whose career has spanned over six decades and who appeared in the two-act drama Moby Dick—Rehearsed by Orson Welles?",
        "response": "two Golden Globe Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus Gaylussacia or Lychnis has more species ?",
        "response": "Gaylussacia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who made a hip-hop album with guest appearances from Justice, Lotek and Necro and also wrote semi-autobiographical crime books?",
        "response": "Mark \"Chopper\" Read",
        "source": "hotpot_qa"
    },
    {
        "query": "What mountains range does the high mountain pass through at an elevation of 6820 ft that has part of the Interstate Highway System that runs from San Diego, California, to Sweetgrass, Montana ?",
        "response": "Rocky Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Editor-in-Chief of the newspaper that is sponsoring Aman ki Asha (Hope for Peace) initiative?",
        "response": "Mir Shakil-ur-Rahman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who served as a coach for the third-largest university governed by the Kansas Board of Regents?",
        "response": "George Karras",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mazda F platform was used in a sports car design in 1978 with which Engine?",
        "response": "1146 cc twin-rotor Wankel rotary engine",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist born as Tyrone William Griffin Jr. Is featured as s guest on the album Ether, by B.O.B.",
        "response": "Ty Dolla Sign",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of an Argentine singer, actor who is one of Julian Hernandez's influences?",
        "response": "Fuad Jorge Jury",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the five Cricketers of the Century has their cricket bat on display at the Museum of Antigua and Barbuda?",
        "response": "Viv Richards",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the official death count of the fire in which the Northern Pacific Depot was built one year after the previous depot was destroyed in?",
        "response": "418",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American author best known for the novel \"Mutiny on the Bounty\", James Norman Hall or Harold Lamb?",
        "response": "James Norman Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did William \"Gipsy\" Daniels knock out the future heavyweight champion of the world?",
        "response": "1928",
        "source": "hotpot_qa"
    },
    {
        "query": "What pair of authors used themes and characters from a fairy tale published in 1812?",
        "response": "Joan Holub and Suzanne Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Archduke Elisabeth Marie of Austria's mother born?",
        "response": "21 May 1864",
        "source": "hotpot_qa"
    },
    {
        "query": "Question: The opera sometimes called La favola d'Orfeo's original name is L'Orfeo or La scala di seta?",
        "response": "L'Orfeo",
        "source": "hotpot_qa"
    },
    {
        "query": "Acoustica: Alarm Will Sound Performs Aphex Twin was composed of songs that were on an album originally released on what date?",
        "response": "7 March 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What player won the NBA All-Star Game MVP in 1985 and defeated the Los Angeles Lakers in the 1986 NBA Playoffs?",
        "response": "Ralph Sampson",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer of Indian descent who is no longer able to perform was a member of the pop trio Monsoon?",
        "response": "Sheila Chandra",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the cinematographer best known for photographing the 1999 American drama film directed by Sam Mendes and written by Alan Ball?",
        "response": "Conrad Lafcadio Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American passenger airport in Oklahoma City is the grounds where the 99s Museum of Women Pilots is found?",
        "response": "Will Rogers World Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Masakazu Morita, is a Japanese actor, voice actor and singer from Tokyo, Morita voiced the roles of Troy Bolton, in High School Musical 2 is the second film in the \"High School Musical\" series, and World Premiere took place on which date, at Disneyland, in Anaheim, California?",
        "response": "August 14, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Majority Leader who appointed Nancy Erickson retire?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Florida Institute of Technology and University of Waterloo has the larger main campus?",
        "response": "University of Waterloo",
        "source": "hotpot_qa"
    },
    {
        "query": "The character Jack from While You Were Sleeping was born in what year?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the battle occur for which William Johnstone Milne received the Victoria Cross?",
        "response": "9 to 12 April 1917",
        "source": "hotpot_qa"
    },
    {
        "query": "Which role does this English actor and director, who appeared in the film \"Howards End,\" play on the 2-part television miniseries \"Over Here?\"",
        "response": "RAF pilot Archie Bunting",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Chambers won the sixth season of \"Strictly Come Dancing\" with his partner of which nationality ?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which DC comic artist is known for designing Scarlet Spider?",
        "response": "Tom Lyle",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Chubb Limited and ResMed operate world-wide?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Hanni Toosbuy Kasprzak is a Danish billionaire and the owner of what Danish shoe manufacturer and retailer founded in 1963 in Bredebro, Denmark?",
        "response": "ECCO",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor starred in Dr. Cabbie and \"The Big Bang Theory\"?",
        "response": "Kunal Nayyar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  equestrian weekly magazine of the United Kingdom is Mark Phillips a columnist in ",
        "response": "Horse & Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "What year saw the launch of the review website that gave Mortal Kombat: Annihilation a 3% rating?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Korean singer-songwriter, actor, writer, and fashion designer, was in the rock band F.T. Island that released their 5th album The Mood?",
        "response": "Lee Hong-gi",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of the album Trust, Love, Pray is best known for which 1985 duet with Phil Collins?",
        "response": "Separate Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "When would be the professional wrestling video game release in which Mark Henry will appear as \"legend\"?",
        "response": "October 17, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American reality competition television series  was Davenport  best known as a contestant on the second season",
        "response": "RuPaul's Drag Race",
        "source": "hotpot_qa"
    },
    {
        "query": "The MGM Grand station is a station on a transit system that is how many miles long?",
        "response": "3.9",
        "source": "hotpot_qa"
    },
    {
        "query": "Lifford Bridge, is a cross-border bridge on the A38 connecting with the N15, spanning the River Foyle which marks the border between Strabane, a town in West Tyrone, Northern Ireland, in which county?",
        "response": "County Donegal",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is home to the private research university Jung Seul-ki swam for?",
        "response": "Seoul, South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "\"What Ya Gonna Do Now?\" and \"Bloody Annoying\" are by a singer that is also fouinded what rock band?",
        "response": "Blur",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  American politician and lawyer contested in San Francisco mayoral election, 2003",
        "response": "Matthew Edward",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the film I Am a Camera first adapted as a play?",
        "response": "1951",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an Italian composer, Claudio Monteverdi or Peter Maxwell Davies?",
        "response": "Claudio Giovanni Antonio Monteverdi",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of song did Alexander Grant produce for Eminem?",
        "response": "a midtempo hip hop ballad",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the Walt Disney Production films \"Pinocchio\" and \"The Adventures of Ichabod and Mr. Toad\" both released in 1949?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Beauty and the Beast features the voice of an American actor who is noted for his role in M*A*S*H as who?",
        "response": "Major Charles Emerson Winchester III",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the cast in \"Jennifa's Diary\" was born in Lagos State?",
        "response": "Falz",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the 1960 Olympian who played for the Cincinnati Royals and Milwaukee Bucks?",
        "response": "The Big O",
        "source": "hotpot_qa"
    },
    {
        "query": "What group of participants that carried of Operation Neptune Spear is sometimes referred to in the U.S. media as a Special Mission Unit? ",
        "response": "SEAL Team Six",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy Sanders and Carl Wayne were both what?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Black Madam reportedly performed buttocks injections on which American model and actress? ",
        "response": "Amber Rose",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was won more Academy Awards, Alexander Payne or Justin Reardon?",
        "response": "Payne is a two-time winner",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the animated series which featured an American comedy writer as the voice of Lucy?",
        "response": "Loren Bouchard",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Samuel Beckett and Will Durant both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the anthropomorphic retired race car which Paul Leonard Newman voiced as appears in ",
        "response": "2006 Pixar film \"Cars\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Canadian comedian and actor Dave Thomas appeared in which 1981 American buddy military comedy film?",
        "response": "Stripes",
        "source": "hotpot_qa"
    },
    {
        "query": "What other show did co-creator of and actor in Coppertop flop shop win an award for Leading Young Actor?",
        "response": "He has won two Young Artist Awards in the Leading Young Actor category for his performances in the comedy film \"National Lampoon's Thanksgiving Family Reunion\" (2003)",
        "source": "hotpot_qa"
    },
    {
        "query": "Chapel Hill is a historic plantation house purchased by  an American soldier best remembered as the wartime head of what?",
        "response": "Office of Strategic Services",
        "source": "hotpot_qa"
    },
    {
        "query": "The Yalta Memorial Garden contains a memorial that that commemorates people displaced during what war?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Mordecai Lincoln was the son of Captain Abraham Lincoln, the grandfather of the U.S. president, Abraham Lincoln, and a pioneer settler of what state?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "The performing arts center where The Hudson Museum is located in has been operating since what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "What administrative assistant for the Louisiana State University football program was the head coach of the Tulsa Golden Hurricane football team in 2006?   ",
        "response": "Steven Jon Kragthorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "What country music duo, consisting of a father and daughter, created a song named 'Sweet Desire' and released sixteens albums?",
        "response": "The Kendalls",
        "source": "hotpot_qa"
    },
    {
        "query": "What historic Beaux-Arts hotel in Washington, DC is close to Garfinckel's Department Store?",
        "response": "The Willard InterContinental Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian music director composed the soundtrack for the film Mehndi?",
        "response": "Ravi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which two activites are closely associated with a popular 2004 concept which spurred  the hoax claim, Toothing?",
        "response": "voyeurism and exhibitionism",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, George Reed or Johnny Bright?",
        "response": "Johnny D. Bright",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city where one of the few 19-year-olds drafted in the 2006 AFL Draft is from has a population of 46,421 in the 2016 Census?",
        "response": "Pakenham, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Chief Executive Officer of the company which owns The Buffalo News born?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Swan Lake is a two-act ballet made by New York City Ballet (NYCB) ballet master in chief Peter Martins, Martins' wife, NYCB principal dancer Darci Kistler, chose to include the final act of what, in her farewell performance?",
        "response": "Swan Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Lake Managua and Rush Lake, are an expanse of water entirely surrounded by land and unconnected to the sea?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Keene is an unincorporated community in Wabaunsee County, Kansas, in what federal republic composed of 50 states?",
        "response": "The United States of America",
        "source": "hotpot_qa"
    },
    {
        "query": "Fantastic Beasts and Where to Find Them is written about a topic in the Harry Potter universe, where is this topic derived from?",
        "response": "derived from folklore, primarily Greek mythology, but also British and Scandinavian folklore",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2015, what was the estimated population of the town in which the Carrier Corporation is based ?",
        "response": "62,707",
        "source": "hotpot_qa"
    },
    {
        "query": "Did John Boorman or Alexander Butler direct more films?",
        "response": "Alexander Butler",
        "source": "hotpot_qa"
    },
    {
        "query": "The musical composer of Manru was a spokesman for what country's independence?",
        "response": "Polish independence",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the estimated market capitalisation as of March 2011 of the company that owns Uttar Pradesh Wizards ? ",
        "response": "25.94 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the last team that Carlos Ruiz played for founded?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "who is a retired pornographic actress and American radio personality, Michel Mossessian or Christy Canyon ?",
        "response": "Christy Canyon",
        "source": "hotpot_qa"
    },
    {
        "query": "Evolution Skateboarding is a 2002 skateboarding video game released by Konami for the PlayStation 2 and GameCube, there are also sets of level specific songs such as the metal-remix of the theme of which action-adventure stealth video game produced by Konami Computer Entertainment Japan, and released for the PlayStation in 1998?",
        "response": "Metal Gear Solid",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of saxophonist was this musician who inspired Wilburt Prysock?",
        "response": "jazz tenor saxophonist",
        "source": "hotpot_qa"
    },
    {
        "query": "Max Brady is a fictional character on which soap opera, and was portrayed by Darin Lee Brooks, an American actor born on May 27, 1984?",
        "response": "Days of Our Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "What Pernod Ricard subsidiary produces the whiskey that has sponsored the Empire awards for six consecutive years?",
        "response": "Irish Distillers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the supporting cast in The Man Who Shot Liberty Valance that was norminated for a Golden Globe Award in 1960?",
        "response": "Woody Strode",
        "source": "hotpot_qa"
    },
    {
        "query": "The university where Peter Charanis was the Voorhees Professor of History is in what state?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the last to release work Ishmael Bernal or Henry Kolker?",
        "response": "Ishmael Bernal",
        "source": "hotpot_qa"
    },
    {
        "query": "Flushing Bay is bordered on the west by which airport in Queens?",
        "response": "LaGuardia Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mann Center for the Performing Arts has hosted which front man from the Miracles?",
        "response": "William \"Smokey\" Robinson Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Florida Atlantic University and İzmir Institute of Technology in Florida?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university has the larger campus, University of New Haven or University of West Florida?",
        "response": "University of West Florida",
        "source": "hotpot_qa"
    },
    {
        "query": " Budapest Resonance contained a cover of the song that was first released on what date?",
        "response": "28 August 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Kitchen is an English footballer who played for what club that was founded in 1904, and plays in the second tier of English football?",
        "response": "Hull City Association Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Don Cockroft and Phil Dawson both play for?",
        "response": "Cleveland Browns",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the Birthplace of Sir Isaac Newton and has a neighboring village called Belvor?",
        "response": "Woolsthorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "The was the album with the song  Unbelievable by American rapper The Notorious B.I.G released?",
        "response": "September 13, 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What power is Achimede combined cycle power plant is using to convert the energy from sunlight into electricity using molten salt for heat and storage which is integrated with the combined cycle gas facility?",
        "response": "solar power",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Victor Sjöström and Sally Field, who began their career on several television shows between 1965 and 1974?",
        "response": "Sally Margaret Field",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by 2 Chainz was produced by Thomas Wesley Pentz?",
        "response": "Netflix",
        "source": "hotpot_qa"
    },
    {
        "query": "What concert hall is located on the northern edge or South Kensington, London, and had songs chosen from a number of concerts there?",
        "response": "Royal Albert Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has received more Academy Awards?Asghar Farhadi or Carlos Saldanha?",
        "response": "Asghar Farhadi",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: When was the Virginia native rapper featured in What Them Girls Like born?",
        "response": "May 5, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has had more roles in the film industry, D.W. Kann or Tom Shadyac?",
        "response": "D.W. Kann",
        "source": "hotpot_qa"
    },
    {
        "query": "What was given its name due to its location directly beneath the Old Man of the Mountain, and is located in the state park that has the Flume Gorge and visitor center?",
        "response": "Profile Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the board games Torres and Sector 41 published by the same company?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the debut album of the author of the poem \"A Useless Death\" ?",
        "response": "Horses",
        "source": "hotpot_qa"
    },
    {
        "query": "North Carolina Highway 128 runs to what area established in 1915?",
        "response": "Mount Mitchell State Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed one of the foundations of functional analysis and also taught Hugo Steinhaus?",
        "response": "David Hilbert",
        "source": "hotpot_qa"
    },
    {
        "query": "The political magazine, in which David Weigel was a former journalist for, is based in what city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British fashion designer lends their designs to the distinct social dress embraced by the Punk subculture?",
        "response": "Vivienne Westwood",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach of the 2008 Florida Atlantic University Owls football team coached what national championship team in 1983?",
        "response": "University of Miami",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's fifth album and debut single are Startin' Fires and Austin respectively?",
        "response": "Blake Tollison Shelton",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first world series  of poker that both John Barch and Joe Hachem played against each other at?",
        "response": "2005 World Series of Poker",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed more Abbot and Costello films, Arthur Lubin or Ciro Ippolito?",
        "response": "Arthur Lubin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a German rocket-powered fighter aircraft designed by Alexander Lippisch, the original version being the first to exceed 1000km/h and the subsequent version, known as the Me 263 Scholle having had 3 prototypes, non of which were ever flown?",
        "response": "Messerschmitt",
        "source": "hotpot_qa"
    },
    {
        "query": "Randolph Bromery was a member of a group of airmen that formed which groups of the United States Army Air forces ?",
        "response": "the 332nd Fighter Group and the 477th Bombardment Group",
        "source": "hotpot_qa"
    },
    {
        "query": "How many films were directed by the director of Wise Blood?",
        "response": "37",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ray Taylor and Marguerite Duras both film directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former American football player was the starting quarterback for the Cornhuskers in 1997 and now serves as the current head coach of UCF Knight football?",
        "response": "Scott Frost",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed of dog would be larger, Dalmatian or Bedlington Terrier?",
        "response": "Dalmatian",
        "source": "hotpot_qa"
    },
    {
        "query": "Hoku's song \"Another Dumb Blond\" was from the film Snow Day by which company?",
        "response": "Paramount Pictures and Nickelodeon Movies",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hudson Independent is a monthly newspaper that serves what village in the town of Greenburgh that had a population of 11,277 at the 2010 census?",
        "response": "Tarrytown",
        "source": "hotpot_qa"
    },
    {
        "query": "Alpheoidea is part of the relative level of a group of organisms that contains what families?",
        "response": "families Alpheidae, Barbouriidae, Hippolytidae and Ogyrididae",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Alain Tanner and Marco Bellocchio both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The music of Old Crow Medicine Show has been called a genre of music developed along with various North American dances such as square dancing, clogging and what?",
        "response": "buck dancing",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did this British Conservative politician die, whose death indirectly caused the Paisley by-election 1948?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Do You Want to Build a Snowman?\" was composed by Kristen Anderson-Lopez, and the co-creator of \"The Book of Mormon\" whom is the youngest of how many people who have won an Emmy, a Grammy, an Oscar, and a Tony Award?",
        "response": "twelve people",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a famous Jewish artist?",
        "response": "Maria Altmann",
        "source": "hotpot_qa"
    },
    {
        "query": "At what frequency the magazine publishes which ranked  Aditya Puri #24th in India's 50 Most powerful people of 2017 list?",
        "response": "fortnightly",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the actor who starred in the film Going Under with Geno Lechner ?",
        "response": "Welsh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stadio Libero Liberati is a multi-use stadium in Terni, in which country, and is currently used mostly for football matches and the home of Ternana Unicusano Calcio, an Italian football club based in the city of Terni, Umbria?",
        "response": "Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hellebore and Aethionema from the same flowering plant families?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Guillaume Roquille, a french poet, is known for writing in this Gallo-Romance language?",
        "response": "Franco-Provençal language",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the musical group with which the career of the singer of \"Shikva\" began?",
        "response": "Awaz",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former American professional basketball player, current sports analyst for ESPN, and cofounder of the Jalen Rose Leadership Academy did the Indiana Pacers trade for other players to the Chicago Bulls during their 2001-02 season?",
        "response": "Jalen Rose",
        "source": "hotpot_qa"
    },
    {
        "query": "Which district, Echeng District or Taonan, is one of three administrative districts of the prefecture-level city of Ezhou?",
        "response": "Echeng District",
        "source": "hotpot_qa"
    },
    {
        "query": "Percy Izzard was a correspondent for which middle-market tabloid?",
        "response": "Daily Mail",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American superhero action-adventure television series developed by Ali Adler, Greg Berlanti, and Andrew Kreisberg stars American actress Calista Flockhart?",
        "response": "Supergirl",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ran Paul presidential campaign, 2016 event was held at a hotel on what river?",
        "response": "Ohio River",
        "source": "hotpot_qa"
    },
    {
        "query": "2002–03 Inter Milan season was marked by the arrival of what retired Argentine footballer?",
        "response": "Hernán Crespo",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did Thomas E. McCann serve as a head football coach in 1924?",
        "response": "Tennessee, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The second season of the American legal comedy-drama Suits was ordered on August 11, 2011, the season had six series regulars playing employees at the fictional Pearson Hardman law firm in Manhattan, including Rachel Meghan Markle, an American actress, model and humanitarian from which California location?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the current holder of the Ligue 1 Young Player of the Year award?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Can you find Peter Piper Pizza where Pizza Fusion is based?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffry Fortes is a Dutch-born professional footballer who currently plays as a defensive midfielder for a football club founded on what date?",
        "response": "23 July 1902",
        "source": "hotpot_qa"
    },
    {
        "query": "Mostafa Chamran Save'ei, was an Iranian physicist, politician, commander and guerrilla who served as the first defense minister of post-revolutionary Iran and as member of parliament, as well as the commander of paramilitary volunteers in which armed conflict between Iran and Iraq lasting from 22 September 1980, when Iraq invaded Iran, to August 1988?",
        "response": "Iran–Iraq War",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Christine McVie and George Michael, who had more diverse job experiences?",
        "response": "George Michael",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Leo and Steve Perry a singer?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Christmas (Baby Please Come Home)\" is a rock song originally sung by Darlene Love and included on the 1963 seasonal compilation album, \"A Christmas Gift for You from Philles Records\", the intention of being sung by which American rock and roll singer ,from The Ronettes?",
        "response": "Ronnie Spector",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Caroline Wozniacki or Jared Palmer?",
        "response": "Jared Eiseley Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "In what style of art did Edward Purrington and Paul Hindemith collaborate?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Scientist and Astronomy both science related magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Enlightenment thinker was The Lord Ashley a major supporter of?",
        "response": "John Locke",
        "source": "hotpot_qa"
    },
    {
        "query": "Football is the most popular sport in Côte d'Ivoire, among famous players from the country are Kolo Touré, an Ivorian former footballer, born on which date?",
        "response": "19 March 1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What Emmy-nominated American actress and comedian had a supporting role in the 2015 American romantic comedy film directed by Judd Apatow and written by Amy Schumer?",
        "response": "Vanessa Polster Bayer",
        "source": "hotpot_qa"
    },
    {
        "query": "Davis known for his boyish looks in The Young Country, came to fame in what tv series? ",
        "response": "Dark Shadows",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character does Natalia Wójcik play in the educational preschool series which was developed by television by Douglas Wood?",
        "response": "Annie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Democrat running for president in 2020 currently holds Maryland’s 6th district in the US House of Representatives?",
        "response": "John Delaney",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the TV network which was the rival channel of Nick Jr. Too closed?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Collin Klein appeared as a wide receiver for a team that played their homes games in what stadium?",
        "response": "Bill Snyder Family Football Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 British GT Championship was won by a car that was first introduced in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "What urban area within metropolitan Melbourne, will the premier middle distance harness race of Australia be hosted at ?",
        "response": "Melton",
        "source": "hotpot_qa"
    },
    {
        "query": "Though separate nationalities, soccer players Robbie Rogers and Justin Fashanu shared which common sexual orientation?",
        "response": "openly gay",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie is show in a the link language of Mahl-dominated Minicoy Island?",
        "response": "Onnu Muthal Poojyam Vare",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the film Lawn Dogs that starred actress Mischa Barton?",
        "response": "Naomi Wallace",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dark Side of the Sun stars an American actor and producer who has his own company named what?",
        "response": "Plan B Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Massimo Porrati's research interests is about the fate of the universe?",
        "response": "Cosmology",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that was nominated for Best Actress for her performance in the film \"Humraaz\"  also starred in what movie based on the life of a former Miss Universe? ",
        "response": "Ankahee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which composer died first, Modest Mussorgsky or Luigi Cherubini?",
        "response": "Luigi Cherubini",
        "source": "hotpot_qa"
    },
    {
        "query": "Hallopora can be commonly founded in what type of bedrock formation?",
        "response": "Kope Formation",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the line infantry regiment that Gordon Holmes Alexander MacMillan was appointed acting adjunct to cease to exist due to amalgamation?",
        "response": "March 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2001 Intercontinental Cup was a football match played on 27 November 2001, which Ghanaian retired professional footballer, was named as man of the match?",
        "response": "Samuel Osei Kuffour",
        "source": "hotpot_qa"
    },
    {
        "query": "A \"New York\"-class battleship was reactivated in a navel warfare novel by John Ringo in what series?",
        "response": "\"Legacy of the Aldenata\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Wayman Tisdale was an American professional basketball player in the NBA, and jazz bass guitarist, in 2008, which record label founded by multiple-Grammy Award nominee, Dave Koz, released previously unreleased music by who? ",
        "response": "Wayman Tisdale",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the members of the English rock duo that released \"Only One Woman,\" a song later covered by the Swedish band Alien?",
        "response": "Graham Bonnet and Trevor Gordon",
        "source": "hotpot_qa"
    },
    {
        "query": "Are George Stambolian and David Hedison of the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company is one of thirteen Alaska Native Regional Corporations created under the Alaska Native Claims Settlement Act of 1971 that has 3,400 shareholders with a people whose ancestral name is Sugpiaq?",
        "response": "Koniag, Incorporated",
        "source": "hotpot_qa"
    },
    {
        "query": "In what anthology was Mushishi serialized that each issue typically has around thirty ongoing stories?",
        "response": "Monthly Afternoon",
        "source": "hotpot_qa"
    },
    {
        "query": "The political activist who wrote \"I Shout Love\" was known as a child actress for her role in what Canadian television series?",
        "response": "Road to Avonlea",
        "source": "hotpot_qa"
    },
    {
        "query": "Jarret Lee Stoll (born June 24, 1982) is a Canadian former professional ice hockey player, Stoll has played in the NHL for which professional ice hockey team based in Edmonton, Alberta?",
        "response": "Edmonton Oilers",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Anti-Semitism in the 21st Century: The Resurgence and Spencer Halpin's Moral Kombat documentary films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What conference champions were putted against each other in the first NBA Finals in which the Orlando Magic's played?",
        "response": "Eastern Conference champion Orlando Magic against the Western Conference champion Houston Rockets.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed this 1986 British biopic starring Gary Oldman and Chloe Webb, which was parodied in The Simpsons episode \"Love Springfieldian Style?\"",
        "response": "Alex Cox",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the length of the track where the 2013 Liqui Moly Bathurst 12 Hour was staged?",
        "response": "6.213 km long",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the style of music of Folder 5 developed?",
        "response": "1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Battle of Chickamauga and Operation Nordwind occur in different wars?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Miracle and Dinosaur released in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company owns and operates the casino in Las Vegas that Vic & Anthony's is located in?",
        "response": "Landry's, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "\"His Dark Materials\" is an epic trilogy that includes this book, featuring experiments with a substance called \"Dust.\"",
        "response": "Northern Lights",
        "source": "hotpot_qa"
    },
    {
        "query": "in the 2010 FIFA World Cup Final, Spain defeated the Netherlands 1–0 with a goal from a player who was born in which year ?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "What grand prize was one by a photgrapher featured in the magazine founded in 1968 as a competitor to \"The New Yorker?\"",
        "response": "\"Editor and Publisher Magazine\"’s Ninth Annual Photos of the Year contest",
        "source": "hotpot_qa"
    },
    {
        "query": "Who named this lake after the English monarch, in which the small town Nansio is located?",
        "response": "John Hanning Speke",
        "source": "hotpot_qa"
    },
    {
        "query": " Shownu, Kihyun, Hyungwon, Wonho, Minhyuk, and I.M. and what other South Korean comprise a group created in 2015?",
        "response": "Lee Joo-heon",
        "source": "hotpot_qa"
    },
    {
        "query": "Iğdır Airport is located in what transcontinental country in Eurasia?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cleveland State University and Rochester Institute of Technology in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "This Is Serious was an album by the singer who duetted with whom on the 1985 hit \"Separate Lives\"?",
        "response": "Phil Collins",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the genre of opera in which Josef Mysliveček contributed to eventually end?",
        "response": "1770",
        "source": "hotpot_qa"
    },
    {
        "query": "The Treaty of Raalte was signed by the sovereign Price of where?",
        "response": "Orange",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of an American comedy which co-stars John Turturro, Mel Smith, Bob Nelson and Mel Smith, an English comedian, writer, film director, producer and actor.",
        "response": "Brain Donors",
        "source": "hotpot_qa"
    },
    {
        "query": "Sleeping Dogs Lie stars a band's drummer, where is this band from?",
        "response": "Los Angeles, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The Story Of Star Wars recording was produced by George Lucas and Alan Livingston, and was narrated by which American actor and director known for his rich voice and dignified bearing?",
        "response": "Roscoe Lee Browne",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the American legal drama television series starring an American actor born on August 30, 1977?",
        "response": "Dana Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Robert Stevenson and Am Rong a filmmaker?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Monsters of Destruction is the more racing focused version of what Feld Entertainment event?",
        "response": "Monster Jam",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Martin v. Hunter's Lessee and Buckley v. Valeo which was the first case to assert ultimate Supreme Court authority over state courts in civil matters of federal law?",
        "response": "Martin v. Hunter's Lessee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Pizza chain in Maine, Pat's Pizza or Discovery Zone?",
        "response": "Pat's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "Jackson Galaxy is a behaviorist who hosts the television show that airs on what channel?",
        "response": "Animal Planet",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel John Webb is a much travelled former footballer, who played as a defender after being converted from a striker, he's currently Youth Team Coach at which association football league in England consisting of three divisions, club Leyton Orient having previously managed them in 2017?",
        "response": "National League",
        "source": "hotpot_qa"
    },
    {
        "query": "In recent decades American schools have included much more on ncient times tens of thousands of years ago with the settlement of the Americas by who?",
        "response": "Paleo-Indians",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the most notible for a libretto which is an anonymous adaptation of William Shakespeare's wedding comedy \"A Midsummer Night's Dream\" performed at the Armonico Consort?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former professional footballer was the coach of Real Madrid and Jiangsu Sunung?",
        "response": "Fabio Capello",
        "source": "hotpot_qa"
    },
    {
        "query": "Dete is a small railway re-crewing depot in a country with roughly how many people?",
        "response": "16 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Akihiro Kitamura appeared in the 2009 Dutch film written by whom?",
        "response": "Tom Six",
        "source": "hotpot_qa"
    },
    {
        "query": "A single example of a PRR MP70 is preserved at a museum that has two what?",
        "response": "locations",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more well-known films, Leos Carax or Gene Saks?",
        "response": "Gene Saks",
        "source": "hotpot_qa"
    },
    {
        "query": "Which delta-winged interceptor aircraft was the Orenda PS.13 Iroquois intended for?",
        "response": "The Avro Canada CF-105 Arrow",
        "source": "hotpot_qa"
    },
    {
        "query": "How was one of the cheif figures of the Catilinarian conspiracy connected to a general who played a critical role in the transformation of the Roman Republic?",
        "response": "stepfather",
        "source": "hotpot_qa"
    },
    {
        "query": "The Czech Repulic participated in the 2010 Winter Olympics and had, as its flag bearer, a former NHL player who played in what league after leaving the Rangers?",
        "response": "Kontinental Hockey League",
        "source": "hotpot_qa"
    },
    {
        "query": "What director in 2008 worked with the actress who portrayed the fictional character of Rebecca in the 2016 supernatural horror film \"Lights Out?\"",
        "response": "David Denneen",
        "source": "hotpot_qa"
    },
    {
        "query": "What album has the biggest U.S. hit for the band often credited as one of \"the fathers of crossover thrash\"?",
        "response": "\"The Art of Rebellion\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Simone Simons and Tim Armstrong share what kind of talent?",
        "response": "songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Epcot ride closed in 1995 to be refurbished and closed permanently in 1996?",
        "response": "World of Motion",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the profession of Tracy Letts?",
        "response": "playwright",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the band who released Signs of Light formed?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Which computer between Orao and PMD 85 was developed earlier?",
        "response": "Orao",
        "source": "hotpot_qa"
    },
    {
        "query": "Rihanna's song for the soundtrack of the 3D animated DreamWorks film \"Home\" shares the title of a Bruce Springsteen song. What is it?",
        "response": "Dancing in the Dark",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie, executive produced by Anatole Taubman, starred an American actress who has earned a Prime-time Emmy Award, a Golden Globe Award, and a Screen Actors Guild Award?",
        "response": "\"She's Funny That Way\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Glenn Hughes and Chantal Claret both perform in bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "David Hein is a playwright who is best known for co-writing which musical that is set in the week following the September 11 attacks?",
        "response": "Come From Away",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Nakhal group owned airline is based at an airport located located 9 km from the city center in the southern suburbs of Beirut, Lebanon?",
        "response": "Wings of Lebanon",
        "source": "hotpot_qa"
    },
    {
        "query": "Twelve FCM F1's were ordered in 1940 to replace a tank that was, in physical dimensions the largest what?",
        "response": "operational tank ever made",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Albert Einstein had a close personal connection to what Serbian physicist born in 1875?",
        "response": "Mileva Marić",
        "source": "hotpot_qa"
    },
    {
        "query": "Eloise is a 2017 American thriller film starring an American actor best known for his role in what Martin Scorsese film?",
        "response": "The Wolf of Wall Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Texas Instruments Inc. and Miles Gordon Technology create the same products?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What other song that was on the 'Billboard Hot 100' appears on the same album as 'Mercy' by Shawn Mendes?",
        "response": "Treat You Better",
        "source": "hotpot_qa"
    },
    {
        "query": "Chibuku Shake Shake is a beer based on a traditional beer style commonly found in what country?",
        "response": "South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "At which University did the founder of the Manning Passing Academy play college football ?",
        "response": "University of Mississippi,",
        "source": "hotpot_qa"
    },
    {
        "query": "Who provided the voice in the Persian animation of the 2009 Pixar film of the character orginally voiced by Ed Asner",
        "response": "Mehrdad Raissi Ardali",
        "source": "hotpot_qa"
    },
    {
        "query": "What theater company based in Indianapolis was admired by the 47th Governor of Indiana?",
        "response": "Epilogue Players",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the debut single released by the music group that created the album Three?",
        "response": "Wild at Heart",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both groups, Chvrches and Anavae, feature a guitar?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Razorlight or Nerf Herder formed first?",
        "response": "Nerf Herder",
        "source": "hotpot_qa"
    },
    {
        "query": "What American historian, playwrite, and social activist followed Paul Metcalf's prose?",
        "response": "Howard Zinn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game came out first American Megafauna or Caylus ?",
        "response": "American Megafauna",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Die schweigsame Frau and La straniera which one is an opera in three acts?",
        "response": "Die schweigsame Frau",
        "source": "hotpot_qa"
    },
    {
        "query": "On what channel did the 2009 South Korean television series starring the actress who first gained attention for her 2008 supporting role as a gisaeng in \"Painter of the Wind, air?",
        "response": "KBS2",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tritonia and Kosteletzkya both types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A Killer Within included the American actor who won the Best Supporting Actor in a Drama award at what 2012 gathering?",
        "response": "Critics' Choice Television Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Goodies' production was done by what American rapper who was the frontman of the group Lil John & The East Side Boyz?",
        "response": "Jonathan Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "What is name of the company that resulted from the merging of Cheung Kong Limited and a Fortune Global 500 investment holding company based in Hong Kong?",
        "response": "CK Hutchison Holdings",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris McKay, also known as Chris Taylor, is an American film and television director, producer, editor, animator, and visual effects artist, he is best known for directing and editing three seasons of \"Robot Chicken\" and two seasons of which American adult stop-motion animated television show, which originally aired on Adult Swim?",
        "response": "Moral Orel",
        "source": "hotpot_qa"
    },
    {
        "query": "Wade Dooley was known by what nickname, inspired by a 518-foot tall tower in England?",
        "response": "Blackpool Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "The CEO of Terror Squad Entertainment appears on the cover of \"Bloody Xmas,\" a mixtape by which famous rapper?",
        "response": "Tony Yayo",
        "source": "hotpot_qa"
    },
    {
        "query": " Nil Nirjane included a performance by the Bengali band from what Indian city?",
        "response": "Kolkata",
        "source": "hotpot_qa"
    },
    {
        "query": "Mai Mai Miracle and The Princess and the Frog are examples of what kind of film?",
        "response": "animated",
        "source": "hotpot_qa"
    },
    {
        "query": "Ephwurd has been played by the producer and DJ who first started as lead singer for what post-hardcore band?",
        "response": "From First to Last",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarter located of which John Claiborne was an early president?",
        "response": "Headquartered in Watertown, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Songwriter and producer Keith Diamond worked with American actor and singer Don Johnson who won a Golden Globe for his role on what tv show?",
        "response": "\"Miami Vice\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Batman: Knight Gallery was a comic book that featured art from the artist best known for work on what two other comics?",
        "response": "\"Starman\" and \"Robin\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Governor of Santa Cruz won after a runoff was canceled?",
        "response": "Néstor Kirchner",
        "source": "hotpot_qa"
    },
    {
        "query": "In The Passion of the Christ, who did Monica Bellucci play?",
        "response": "Mary Magdalene",
        "source": "hotpot_qa"
    },
    {
        "query": "Which leader, who unified Germany in the 1860s has a genus of plants in Madagascar named after him? ",
        "response": "Otto von Bismarck",
        "source": "hotpot_qa"
    },
    {
        "query": "What Cameroonian football players nickname, is the last name of a French former footballer and current assistant coach at Premier League club Swansea City.?",
        "response": "Wilfred Bamnjo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band has most recently been on tour, The Juliana Theory or Urge Overkill?",
        "response": "The Juliana Theory",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city WNHN-LP is licensed to?",
        "response": "42,695",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former social conservative and member of the Conservative Christian Fellowship was a politician before Helen Grant in the British Conservative Party?",
        "response": "Ann Widdecombe",
        "source": "hotpot_qa"
    },
    {
        "query": "Cari Roccaro is a soccer player from the CDP in what New York county?",
        "response": "Suffolk",
        "source": "hotpot_qa"
    },
    {
        "query": "Who helped to develop the national flag that consists of a red field with a white square at is center entre in the ratio of 1:2:1, in the middle of which is featured a stylized, red, 11-pointed maple leaf charged in the centre?",
        "response": "John Ross Matheson",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1968 comedy film starred John Saxon, Lana Wood, and Mary Ann Mobley who was also Miss America 1959?",
        "response": "For Singles Only",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American botanist and inventor born in the 1860s, whose birthplace was Diamond, Missouri?",
        "response": "George Washington Carver",
        "source": "hotpot_qa"
    },
    {
        "query": "Whos home country is farther north, Ivan Perestiani or Valie Export?",
        "response": "Valie Export",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the Vanderbilt mansion that is owned and operated by the Preservation Society of Newport County?",
        "response": "Richard Morris Hunt",
        "source": "hotpot_qa"
    },
    {
        "query": "The label that has remixed the singer whose debut single was \"Before Your Love/A Moment Like This\" was established in what year?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "The Four Horsemen was a stable of wrestlers that originally included which Canadian-American?",
        "response": "Tully Arthur Blanchard",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capacity of the stadium at which the 2009–10 RBS Twenty-20 Cup was held?",
        "response": "34,228",
        "source": "hotpot_qa"
    },
    {
        "query": "Who distributed Tonka and The Many Adventures of Winnie the Pooh? ",
        "response": "Buena Vista Distribution",
        "source": "hotpot_qa"
    },
    {
        "query": "The Het peoples live west of the Paraná River on which continent? ",
        "response": "South America",
        "source": "hotpot_qa"
    },
    {
        "query": "Ursula Reit starred in a movie as Mrs. Gloop which was adapted from what novel?",
        "response": "\"Charlie and the Chocolate Factory\" by Roald Dahl",
        "source": "hotpot_qa"
    },
    {
        "query": "Sorority Wars starred which former professional ballet dancer?",
        "response": "Amanda Schull",
        "source": "hotpot_qa"
    },
    {
        "query": "Live at the Electric is a British comedy series by comedian Russell Kane who performs stand-up in between comedy sketches from performers such as an English actress who appeared on what BBC comedy series?",
        "response": "Mock the Week",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was founded first, Middlebury College or Harvard University? ",
        "response": "Harvard University",
        "source": "hotpot_qa"
    },
    {
        "query": " The Cleek-McCabe Site is in what region that makes up the northern part of Kentucky?",
        "response": "Bluegrass region",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American musician, Peter Chelsom or Billy Bob Thornton?",
        "response": "\"Billy Bob\" Thornton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2016 feature film that Laura Carmichael was in?",
        "response": "Amma Asante",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the head coach of the 1999-2000 Kentucky Wildcats basketball team currently coaching?",
        "response": "University of Memphis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album did Celine Dion release first: \"The Colour of My Love\" or \"Unison\"?",
        "response": "Unison",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Wittrockia and Aristotelia belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "City of Bones  is a part of the bestselling series, the last of which was published when",
        "response": "May 27, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Suzanna Catharina de Graaff's claim of being the fifth daughter of Tsar Nicholas II and Tsarina Alexandra, was accepted by one of several imposters who clamed to be who?",
        "response": "Grand Duchess Anastasia of Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2007 British-Canadian-American gangster film for which Vincent Cassel was best known? ",
        "response": "David Cronenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Spinanes were an American indie rock band, primarily active during the 1990s, Plouf began playing with which organization, an American indie rock band based in Boise, Idaho, United States, in 1996?",
        "response": "Built to Spill",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Max W. Kimmich and Dodo Abashidze have the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the semiotician who developed the Actantial model in 1966",
        "response": "French-Lithuanian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by Last One Picked appeared in a 2004 American teen musical comedy film directed by Sara Sugarman?",
        "response": "Na Na",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Croton and Chasmanthium in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the championships held by Rob Terry was renamed in 2001?",
        "response": "OVW Heavyweight Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "Martynas Andriuškevičius, is a Lithuanian professional basketball player, Andriuškevičius has noted perimeter skill for a player of his size, and has trained with Arvydas Sabonis, he spent how many seasons in the National Basketball Association (NBA) in the United States?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "What vehicle was introduced in 1998 by Daimler AG as a City car which battery electric variant's field testing started in London in 2007?",
        "response": "Smart Fortwo",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the nationality of the 2012 Lenox Industrial Tools 301 third finisher ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What band released an album physically on July 19, 2017 in two languages?",
        "response": "EXO",
        "source": "hotpot_qa"
    },
    {
        "query": "Sphingolipid was named after which human-lion mythical creature?",
        "response": "sphinx",
        "source": "hotpot_qa"
    },
    {
        "query": "Blank Check is a 1994 American comedy film starring a character actor who appaered in over how many films, television series, and plays?",
        "response": "100",
        "source": "hotpot_qa"
    },
    {
        "query": "In what time period was the prequel to \"Fate/stay night\" named a best anime series?",
        "response": "Autumn 2011 to Summer 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Donnie Smith who plays as a left back for New England Revolution belongs to what league featuring 22 teams?",
        "response": "Major League Soccer",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of this Italian Canadian professional boxer active until 2007 that the hip hop group Jedi Mind Tricks's song Animal Rap's version is named after?",
        "response": "Thunder",
        "source": "hotpot_qa"
    },
    {
        "query": "Brandywine Productions is an American film production company, most known for its film franchise, Alien, a British-American science-fiction horror media franchise centered on the film series depicting which Warrant Officer, played by Sigourney Weaver, and her battles with an extraterrestrial lifeform, commonly referred to as \"the Alien\"?",
        "response": "Ellen Ripley",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first name of the mother of the artist who recorded Come Some Rainy Day ?",
        "response": "Naomi",
        "source": "hotpot_qa"
    },
    {
        "query": "Flowers in the Attick starred which \"Mad Men\" actress?",
        "response": "Kiernan Brennan Shipka",
        "source": "hotpot_qa"
    },
    {
        "query": "What two term Governor of California participated in the Stop the Madness anti-drug music video in 1985?",
        "response": "Arnold Schwarzenegger",
        "source": "hotpot_qa"
    },
    {
        "query": "Crazy for You was produced by which Chairman and CEO of Mandalay Entertainment?",
        "response": "Howard Peter Guber",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American kickboxer based in Scottsdale Arizona has been beaten in world championships by Changpuek Kiatsongrit?",
        "response": "Rick Roufus",
        "source": "hotpot_qa"
    },
    {
        "query": "Ledzokuku-Krowor Municipal district, one of the ten districts in the Greater Accra Region of Ghana, has a capital in which small town?",
        "response": "Teshie-Nungua",
        "source": "hotpot_qa"
    },
    {
        "query": "Drum is a brand of tobacco distributed by a corporation under what parent company?",
        "response": "Mondelez International",
        "source": "hotpot_qa"
    },
    {
        "query": "Shireburn or Sherburne Baronetcy, of Stonyhurst a 300 acre rural estate owned by the Society of Jesus was created for whom on 4 February 1686?",
        "response": "Nicholas Shireburn",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the actor revealed as \"The Mother\" in the Season 8 finale in  How I Met Your Mother born ",
        "response": "August 16, 1985)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more Grand Slam titles, Rennae Stubbs or Alicia Molik?",
        "response": "Rennae Stubbs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which entertainment company is the creator of \"The X Factor\" the chief executive officer?",
        "response": "Syco",
        "source": "hotpot_qa"
    },
    {
        "query": "Huell Howser provided the voice of Backson in Disney's what numbered animated film?",
        "response": "51st Disney animated feature film.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country did the subject of Mao II govern? ",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeremy Brock is the writer and director of this 2011 drama that was adapted from him and what other female?",
        "response": "Rosemary Sutcliff",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of Dennis Chun is best known for what role on \"Hawaii Five-O?",
        "response": "Chin Ho Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which original film was produced first, Herbie Rides Again or The Shaggy Dog?",
        "response": "The Shaggy Dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which the founder of the Hemdale Film Corporation starred in 1963?",
        "response": "Roy Ward Baker",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Samoyed and Pyrenean Shepherd have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Last of the Wild Horses was filmed in Medford, Oregon, which is the county seat of what county?",
        "response": "Jackson County",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did the senator who broke Theodore F. Green's record represent?",
        "response": "South Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Vern Rutsala Born in McCall, Idaho taught English and creative writing at private liberal arts college with just over how many students attending the undergraduate College of Arts and Sciences?",
        "response": "2,000",
        "source": "hotpot_qa"
    },
    {
        "query": "The pornographic film Animal Farm starred a Danish performer born in what village near Copenhagen?",
        "response": "Hundige",
        "source": "hotpot_qa"
    },
    {
        "query": "Acta Crystallographica and Journal of Synchrotron Radiation are defined as what?",
        "response": "peer-reviewed scientific journal",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Anthony Harvey and Rex Wilson both involved with films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Grieder did what for this rock band formed in 1992 and based in Portland, Oregon?",
        "response": "directed music videos",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Diamond at the Summit and Summit Place Mall have in common?",
        "response": "Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British Indian novelist and essayist did Anthony Burgess address in a lengthy letter?",
        "response": "Salman Rushdie",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Silbervogel and Walter Dornberger connected?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is native to China, Encephalartos or Ginkgo biloba?",
        "response": "Ginkgo biloba",
        "source": "hotpot_qa"
    },
    {
        "query": "What show did the Herbie Goes Bananas star get his big break in?",
        "response": "The Danny Kaye Show",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first: Cynthia Ozick or Malcolm Lowry?",
        "response": "Malcolm Lowry",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Nonbo has represented which top-tier team from Sydbank Park in the Superliga?",
        "response": "SønderjyskE",
        "source": "hotpot_qa"
    },
    {
        "query": "Douglas M. North is the head of a school located in what city?",
        "response": "Albany, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of the man that named René Cormier to the Seante of Canada in 2016?",
        "response": "Pierre Trudeau",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the singer of I Care 4 U die?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Based on which original album, Francis \"Frankie\" Nicholls remixed the songs and released The Remix Album? ",
        "response": "Lisa Stansfield",
        "source": "hotpot_qa"
    },
    {
        "query": "How many cricketers were banned in the scandal in which the 2004 U-19 Pakistan captain was involved?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "Lira Motorsports made their debut on November 20, 2015 in what state?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school was founded first, New York University, or University of Michigan?",
        "response": "The University of Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1965 Memorial Cup final was the 47th junior ice hockey championship of the Canadian Amateur Hockey Association, the George Richardson Memorial Trophy champions is which organization, that were two junior ice hockey franchises, that played in the top tier in the Ontario Hockey Association?",
        "response": "Niagara Falls Flyers",
        "source": "hotpot_qa"
    },
    {
        "query": "What political news website was set up by a supporter of a politician who served in Pennsylvania's House of Representatives from 1999 to 2005?",
        "response": "GrassrootsPA",
        "source": "hotpot_qa"
    },
    {
        "query": "the sculpture by Wayne Chabre, installed on the exterior of Willamette Hall on the University of Oregon campus in Eugene is of a scientist born in which year ?",
        "response": "1879",
        "source": "hotpot_qa"
    },
    {
        "query": "Put You on the Game is a single by the rapper who was part of the group that released their debut album in which year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Mianyang and Shangluo, which one is the larger prefecture-level city?",
        "response": "Mianyang",
        "source": "hotpot_qa"
    },
    {
        "query": "In what regions of the United States is the Eastern Market, Detroit located?",
        "response": "Great Lakes and Midwestern",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthplace of YouTube's 2016 overview featured creator Wengie?",
        "response": "Guangzhou, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the female star of the film The Sound born ?",
        "response": "Italian-born",
        "source": "hotpot_qa"
    },
    {
        "query": "How many campuses does this college have, which inlcudes Pharmaceutical Research Institute (PRI)-Albany?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Sarah Caudwell or Ernst Jünger?",
        "response": "Ernst Jünger",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did the actress who portrayed Sansa Stark appear in in 2016?",
        "response": "X-Men: Apocalypse",
        "source": "hotpot_qa"
    },
    {
        "query": "A Phlyax play, also known as a hilarotragedy, was a burlesque dramatic form that developed in the Greek colonies of Magna Graecia in which century BCE, Magna Graecia, was the name given by the Romans to the coastal areas of Southern Italy?",
        "response": "4th",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was Steve Earle's Grammy-nominated album \"Train' a Comin'\" recorded in?",
        "response": "Nashville",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Scott Treleaven and Raoul Peck make films? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who played Craig Middlebrooks on \"Parks and Recreation\" can be heard playing what charecter in the \"Teen-a-witch\" episode of Bob's Burgers?",
        "response": "Mr. Ambrose",
        "source": "hotpot_qa"
    },
    {
        "query": "China Marine was source material for which 2010 American television series?",
        "response": "The Pacific",
        "source": "hotpot_qa"
    },
    {
        "query": "Antonius Divitis was a composer who was slightly younger than which French master of polyphonic vocal music?",
        "response": "Josquin des Prez",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American crime thriller in which an award winning Australian actor starred in together with Michelle Rodriguez, Tony Shalhoub, Caitlin Gerard, and Sigourney Weaver?",
        "response": "Walter Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Mabel J. Desmond (born January 30, 1929) is an American politician and schoolteacher from Maine, in 2207, the former teacher was appointed by Governor John Elias Baldacci, and an American politician, to which state organization?",
        "response": "Maine State Board of Education",
        "source": "hotpot_qa"
    },
    {
        "query": "Dan Swanö and Simone Simons are both what? ",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "If it Feels Good Do it is featured in what 2004 film starring Emile Hirsch and Elisha Cuthbert?",
        "response": "The Girl Next Door",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Sara Tanaka act in which was directed by Todd Phillips?",
        "response": "Old School",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the record label that James defected from based?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born on October 31, 1942? ",
        "response": "David Ogden Stiers",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of \"Wrinkles in Time\" won the Nobel Prize in Physics in wht year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the cast of Six Flying Dragons also had a supporting role in Doctor Crush?",
        "response": "Yoon Kyun-sang",
        "source": "hotpot_qa"
    },
    {
        "query": "Broad Bay is located upstream from a town with a total population of what?",
        "response": "1,465",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Corey Taylor and Buffalo Tom both American-based musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The irish folk group that collaborated on Celtic Woman: A Celtic Family Christmas was formed in what city?",
        "response": "Dublin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the final film of the man who played Herman Stiles on Evening Shade set?",
        "response": "Cleveland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital serves more neonatal patients, MedStar Washington Hospital Center or Walter Reed Army Medical Center? ",
        "response": "MedStar Washington Hospital Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexa Ray Joel, is an American singer, songwriter, and pianist, and is the older daughter of singer-songwriter Billy Joel and first child of which American model and actress, that spent twenty five years as the face of CoverGirl?",
        "response": "Christie Brinkley",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first women's magazine published in Tehran,  Ettelaat-e Banuvan or Playgirl?",
        "response": "Ettelā'āt-e Bānuvān",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mike Ness and Oliver Sykes both lead vocalists of their bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The country music artist who recorder a cover cersion of Am I That Easy to Forget which reached #11 country in 1960 started out as part of which band as a teenager in the late 1940s? ",
        "response": "the Davis Sisters",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Marcus Lovingood or Jane Lynch?",
        "response": "Jane Marie Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "Currently, how many members are Democrats where Ed Dupont served five terms as a state senator?",
        "response": "10",
        "source": "hotpot_qa"
    },
    {
        "query": "Clara Lieber worked with the German chemist in the fields of what two disciplines?",
        "response": "radioactivity and radiochemistry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song ,written by Mitchell Torok , catapulted \"Gentleman Jim\" to stardom?",
        "response": "Mexican Joe",
        "source": "hotpot_qa"
    },
    {
        "query": "Jordan Rodrigues plays Mat Tan in a tv series created by what two people?",
        "response": "Peter Paige and Bradley Bredeweg",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the band where the Versus Channel start got his start?",
        "response": "Amboy Dukes",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was inspired by a breakup and a hit single in 1985?",
        "response": "\"Voices Carry\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The premiere of fourteenth season animated television series created by Trey Parker and Matt Stone, who served as excutive producers along with Anne Garefino is about which golf pro sex scandal?",
        "response": "Tiger Woods",
        "source": "hotpot_qa"
    },
    {
        "query": "Did singer Julian Casablancas and band Hüsker Dü both play rock music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther east of Nathalie Dechy and Lucie Šafářová?",
        "response": "Lucie Šafářová",
        "source": "hotpot_qa"
    },
    {
        "query": "\"I May Be Wrong but I Doubt It\" is the memoir of a famous person born on what date?",
        "response": "February 20, 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chicago Sports Museum is an 8,000-square-foot museum located along the Magnificent Mile at the Water Tower Place, is a large urban, mixed-use development comprising a 758000 sqft shopping mall and 74 story skyscraper in Chicago, Illinois, it is named after the nearby Chicago Water Tower, and is owned by which organization?",
        "response": "General Growth Properties",
        "source": "hotpot_qa"
    },
    {
        "query": "Musician and satirist Allie Goertz wrote a song about the \"The Simpsons\" character Milhouse, who Matt Groening named after who?",
        "response": "President Richard Nixon",
        "source": "hotpot_qa"
    },
    {
        "query": "Zooperstars features a clam dressed as a baseball player born in what year?",
        "response": "1968",
        "source": "hotpot_qa"
    },
    {
        "query": "The DC Comic movie that features Ike Barinholtz is what number installment in the DC Extended Universe?",
        "response": "third",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of this 2011 South Korean coming of age film, which starred Kim Yoon-seok?",
        "response": "Lee Han",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ralph Nelson and Spencer Gordon Bennet both television directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Le comte Ory and The Magic Flute, are which type of theatre?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "The Solution was an album by a band that was formed in what Long Island town?",
        "response": "Coram",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Queen of the Netherlands from 1890 until her abdication in 1948?",
        "response": "Wilhelmina of the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Game Face and March of the Penguins, are which type of film?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "René Karl Wilhelm Johann Josef Maria Rilke, better known as Rainer Maria Rilke, was a Bohemian-Austrian poet and novelist, \"widely recognized as one of the most lyrically intense German-language poets\", writing in both verse and highly lyrical prose, these deeply existential themes tend to position him as a transitional figure between the traditional and which philosophical movement that, along with cultural trends and changes, arose from wide-scale and far-reaching transformations in Western society during the late 19th and early 20th centuries?",
        "response": "Modernism",
        "source": "hotpot_qa"
    },
    {
        "query": "What team selected the 2009 Pac-10 Offensive Player of the Year in the second round of the 2010 NFL Draft?",
        "response": "Minnesota Vikings",
        "source": "hotpot_qa"
    },
    {
        "query": "Yellow is a Bangladesh-based fashion brand and clothing retailer owned by what, the largest of the Yellow stores are located in Bashundhara City Shopping Complex?",
        "response": "Beximco",
        "source": "hotpot_qa"
    },
    {
        "query": "Which music labels are owned by the group which recorded the album Acoustic II ?",
        "response": "Anjunabeats and Anjunadeep,",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Joseph Druce murder John Geoghan?",
        "response": "1935August23, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hate U Give was written by an author of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the  2016 American Christmas comedy that casts include an  American comedian and actress who also starred as Dr. Jillian Holtzmann in the 2016 \"Ghostbusters\" reboot?",
        "response": "Josh Gordon and Will Speck",
        "source": "hotpot_qa"
    },
    {
        "query": "As of May 2017, how many digital units in the United States has the Jay-Z and Kanye West song that Chauncey Hollis, Jr is best known for sold?",
        "response": "5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band were featured on the soundtrack for the animated film Shrek, Sponge Cola or Smash Mouth?",
        "response": "Smash Mouth",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2014 film is the actor who played the lead role of James in 2007 South Korean film \"My Father\" known for starring in?",
        "response": "Big Hero 6",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in the film The Silence of Joan is also known for playing Davos Seaworth in \"Game of Thrones\"?",
        "response": "Liam Cunningham",
        "source": "hotpot_qa"
    },
    {
        "query": "The Terror is an upcoming anthology television series set to be broadcast on AMC in 2017, and is based on the best-selling novel of the same name by which American author?",
        "response": "Dan Simmons",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Awolnation an American alternative rock band and This Mortal Coil was a music collective",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which underground Mass Rapid Transit interchange is located next to the VivoCity and a shopping mall and ferry terminal that connects to nearby Indonesian ports, as well as the city of Batam and Bintan Island?",
        "response": "HarbourFront MRT Station",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1994 American drama in which Larry Brandenburg appeared?",
        "response": "Frank Darabont",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Faraday was an early 19th-century British scientist, he contributed to the study of electromagnetism and electrochemistry, and died on which date?",
        "response": "25 August 1867",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Gertrude Stein or Ezra Pound?",
        "response": "Gertrude Stein",
        "source": "hotpot_qa"
    },
    {
        "query": "In what series did one of America's most successful living authors call Frank C. Barnes House haunted?",
        "response": "Ramona Quimby series",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Adler is best known for authoring the Adler 32 checksum fuction and his contributions to what type of image format?",
        "response": "Portable Network Graphics (PNG)",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Anand Patwardhan and Tay Garnett have in common?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Sophie Marceau achieved popularity with which debut film in 1980 directed by Claude Pinoteau?",
        "response": "La Boum",
        "source": "hotpot_qa"
    },
    {
        "query": "TABC in Long Beach, California produces stamped metal components for what compact hatchback that is derived from the Toyota Corolla?",
        "response": "Toyota Matrix",
        "source": "hotpot_qa"
    },
    {
        "query": "What studio album was produced by Tyler Bates and was released on October 6, 2017?",
        "response": "Heaven Upside Down",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was founded first, Cornell University or University of California, Los Angeles?",
        "response": "Cornell University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American musician wrote \"I Can Dream About You\" and contributed to \"Never Forget\"? ",
        "response": "Dan Hartman",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Edwin Greenwood and Curtis Hanson create movies during the same time span?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Shape Shifter is the twenty-first studio album (thirty-sixth album overall) by who, \"Gypsy Queen\", a Szabó hit from 1966 covered by Santana in 1970 as a medley with Fleetwood Mac's \"Black Magic Woman\", Fleetwood Mac are a British-American rock band, formed in London in 1967?",
        "response": "Santana",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of tennis do Mark Knowles and Andy Ram specialize in?",
        "response": "doubles",
        "source": "hotpot_qa"
    },
    {
        "query": "What business did Sideshow Bob frame Krusty the Clown for robbing, in the episode, \"Krusty Gets Busted\"?",
        "response": "Kwik-E-Mart",
        "source": "hotpot_qa"
    },
    {
        "query": "Issachar Jacox Roberts graduated from a university located where?",
        "response": "Greenville, South Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Clifford O. Taylor studied with an American composer and professor of classical music at what university?",
        "response": "Harvard University",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Jason Wade And Luisa Hanae Matsushita, Also Known as Lovefoxxx, Share the same Nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Will the towers at Manhattan West or 15 Penn Plaza have 2,050,000 square feet of floor space?",
        "response": "15 Penn Plaza",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Norma Watson in \"Carrie\" also starred in a 1981 film directed by who?",
        "response": "Ivan Reitman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American surgeon and politican, who will take over as governor, following the Kansas gubernatorial election, 2018, if the ccurrent governor resigns?",
        "response": "June 3, 1960",
        "source": "hotpot_qa"
    },
    {
        "query": " Which song on the fourth studio album by French DJ David Guetta feature vocals by Kelly Rowland on the song When Love Takes Over?",
        "response": "One Love",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the female singer of \"consideration\" and \"fourfiveseconds\" who also released an album called \"Anti\"?",
        "response": "Rihanna",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 census population of the town at which  Miss America 2007 was held? ",
        "response": "223,167",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 Pittsburgh Panthers football team played eight games at the home field of which NFL team?",
        "response": "Pittsburgh Steelers",
        "source": "hotpot_qa"
    },
    {
        "query": "Twilight Imperium and Battle Sheep, are which specific type of entertainment?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of these artists has occasionally pursued acting, Joan Jett and Ihsahn ",
        "response": "Joan Jett",
        "source": "hotpot_qa"
    },
    {
        "query": "The Snowball family included Nathaniel, who was recorded in a document that held names and descriptions of what?",
        "response": "3,000 Black Loyalists",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of an author who gave an introduction in the novel Sweets and Other Stories?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American man claimed the song \"Exit\" by U2 influenced him to murder Rebecca Schaeffer?",
        "response": "Robert John Bardo",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahmad Khormali plays after the Goal keeper who plays for what team?",
        "response": "Szombathelyi Haladás",
        "source": "hotpot_qa"
    },
    {
        "query": "The top scorer during the 2012–13 Primeira Liga season what born in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "David Sinclair is a fictional character in \"Numb3rs\", a crime drama produced by what company headquartered in New York City and Los Angeles?",
        "response": "CBS Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the other staring actor who acted alongside a Swedish actress in Indiscreet?",
        "response": "Cary Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "Arrêtez-moi is a film in which film genre, known for suspense and anxiety?",
        "response": "Thriller",
        "source": "hotpot_qa"
    },
    {
        "query": "Are K6 and Trivor on different continents?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kyi-Leo and Toy Manchester Terrier both breeds of terrier?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The NFL Golf Classic was a tournament that frequently included the quarterback who is now an analyst for what cable channel?",
        "response": "ESPN",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of publication does Cobra Rock Boot Company and Garden & Gunhave in common?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Gertrude Blom was an anthropolgist who studied the culture of the peoples who lived in what Mexican state?",
        "response": "Chiapas",
        "source": "hotpot_qa"
    },
    {
        "query": " A Decent Ride is a novel that takes place 10 years after which 2002 Irvine Welsh novel?",
        "response": "Porno",
        "source": "hotpot_qa"
    },
    {
        "query": "What is known to have 27 titles, has Charles Pickel on the squad and referred to a GC?",
        "response": "Grasshopper Club Zürich",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nuri Bilge Ceylan and Gary T. Smith both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the codename of the battle in which Henry Williams Hise won a Distinguished Flying Cross for his actions?",
        "response": "Operation Watchtower",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the composer born that was responsible for the music and lyrics for the Doctor Dolittle musical?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "Who announced the 1997 Fox reality show that was hosted by the American Sportscaster known for being the host of \"The NFL Today\"?",
        "response": "Mark Thompson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Virginia Commonwealth University and the University of California public or private?",
        "response": "public",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more Pulitzer Prizes, Barbara W. Tuchman or Guillaume Apollinaire?",
        "response": "Barbara Wertheim Tuchman",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the Casey Strengel, a 1996 Baseball Hall of Fame member, manage for its 15th World sreies championship?",
        "response": "New York Yankees",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 54th edition the 2009 UEFA Champions League Final, Europe's premier club football tournament , played?",
        "response": "Stadio Olimpico in Rome, Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 population  of the city where the Temple of Eck is located?",
        "response": "22,952",
        "source": "hotpot_qa"
    },
    {
        "query": "Mad Men stars an actress born on July 24th of what year?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the property owner of The Golden Nugget Las Vegas, which inspired a Nintendo DS game of the same name?",
        "response": "Landry's, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the manga series originally serialized from 1994-1995with a superheroine?",
        "response": "Tonde Burin",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the bands Stone Sour and Thirty Seconds to Mars formed in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which German composer used cyclic forms in their pieces?",
        "response": "Jakob Ludwig Felix Mendelssohn Bartholdy",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the third studio album by American rock band Imagine Dragons which Believer is  the lead single in released ",
        "response": "June 23, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Griesedieck Brothers beer and Falstaff Brewing Corporation located?",
        "response": "St. Louis",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Cherie Currie and Alex Désert share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Dave Wakeling and Matthew Tuck musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Plácido Domingo has a vocal range that is a weight between which two characteristics?",
        "response": "lyric and dramatic",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote songs for Kentucky music Hall of Fame artist",
        "response": "Max Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the City Hall that is built above City Hall station built?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "The score that Sara Bareilles wrote for the Broadway musical \"Waitress\" only included music written specifically for what?",
        "response": "the theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "What film directed by Don Mancini has the main character of a murderous doll and is the fourth installment in its francise?  ",
        "response": "Bride of Chucky",
        "source": "hotpot_qa"
    },
    {
        "query": "What game did the writer of \"Blackmoor\" help co-develop?",
        "response": "Dungeons & Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "What powerlifting exericse is a typical example of extended length conditioning?",
        "response": "deadlift",
        "source": "hotpot_qa"
    },
    {
        "query": "Kaye Stevens was an American singer and actress whose big break came at what hotel on the Las Vegas Strip that operated from April 1955 to May 2015?",
        "response": "Riviera",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 Los Angeles Chargers season is the franchise's 48th season in the National Football League (NFL), the 58th overall and the first under which former American football running back and current head coach for the Los Angeles Chargers of the NFL?",
        "response": "Anthony Lynn",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the television series \"Wuthering Heights\" actor who also starred in the action film \"Black Hawk Down\"?",
        "response": "Tom Hardy",
        "source": "hotpot_qa"
    },
    {
        "query": "Ernest Ten Eyck Attwell was the third head football coach at a private, historically black university that was established by who?",
        "response": "Booker T. Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach of the Karachi Kings, Mickey Arthur, is of what decent? ",
        "response": "South African",
        "source": "hotpot_qa"
    },
    {
        "query": "O'Sheas Casino is located in the hotel owned and operated by what company?",
        "response": "Caesars Entertainment Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "American Blues 'Is Here' was a studio album that featured what future drummer for the rock band ZZ Top?",
        "response": "Frank Lee Beard",
        "source": "hotpot_qa"
    },
    {
        "query": "New Woman and Women's Running, are both manufactured into which forms of media?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical directed by Bill Berry was inspired by the play \"Romeo and Juliet\"?",
        "response": "West Side Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American actor and voice actor that guest starred in the animated television series Death in Bloom as Death?",
        "response": "Miguel Ferrer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company headquartered in Overland Park, Kansas, uses its CEO in its commercials?",
        "response": "Sprint Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the military code name for a successful counter-terrorist hostage-rescue mission carries out by the IDF on 4 July 1976?",
        "response": "Operation Thunderbolt",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produce the film who lost to \"Inside Out\" at the Golden Globe Award for Best Animated Feature Film?",
        "response": "Pixar Animation Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"Parks and Recreation\" actor appeared in the 2016 remake of the Magnificent Seven?",
        "response": "Chris Pratt",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Alien Ant Farm and The White Stripes formed in the 1990's?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the woman who ran the Buffalo Ballet Theater from 1967 begin her career? ",
        "response": "Her career started in Russia,",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 FA Community Shield included Manchester United goals by the right winger and right-back of what nationality?",
        "response": "Ecuadorian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species Tetradium or Schlumbergera?",
        "response": "Tetradium",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle took place first Operation Dragoon or Battle of Guam ?",
        "response": "Battle of Guam",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Martin Heidegger and Lytton Strachey from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has the Member of Parliament (MP) for  a constituency represented in the House of Commons of the UK Parliament since 2010, served under?",
        "response": "Jeremy Corbyn",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Jessie in the movie containing the Randy Newman song When She Loved Me?",
        "response": "Joan Cusack",
        "source": "hotpot_qa"
    },
    {
        "query": "What digital television channel that focuses on country music is owned by the company that operates the Retro Television Network?",
        "response": "Heartland",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the coach of the 1963 Oklahoma Sooners football team die ?",
        "response": "February 9, 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of Bernhard Heiden's teacher?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "The Parkers is an American sitcom that aired on UPN from August 30, 1999, to May 10, 2004, a spin-off of UPN's \"Moesha\", features the mother-daughter team of Nikki (played by Mo'Nique) and Kim Parker, played by Countess Danielle Vaughn, born on which date, is an American actress and singer?",
        "response": "August 8, 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more Grand Slam titles, Betty Stöve or Lucie Hradecká?",
        "response": "Betty Stöve",
        "source": "hotpot_qa"
    },
    {
        "query": "The designer of the Zig Zag-chair is also the designer of what UNESCO World Heritage Site?",
        "response": "Rietveld Schröder House",
        "source": "hotpot_qa"
    },
    {
        "query": "Which baseball player appears in the South Korean series \"A Beautiful Mind?\"",
        "response": "Yoon Hyun-min",
        "source": "hotpot_qa"
    },
    {
        "query": "This Jingle Bell Ball performer released his second studio album in 2009 entitled what?",
        "response": "Ready for the Weekend",
        "source": "hotpot_qa"
    },
    {
        "query": "Steven Fowle is the current owner, editor, and publisher of America's oldest newspaper, which non-profit, alternative, bi-weekly newspaper published in Portsmouth, New Hampshire?",
        "response": "New Hampshire Gazette",
        "source": "hotpot_qa"
    },
    {
        "query": "On what street would one find the \"Journal Record Building\" in Oklahoma?",
        "response": "NW 5th",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are singers Florence Welch and Bryan Ferry?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first Paramore or Catherine Wheel ?",
        "response": "Catherine Wheel",
        "source": "hotpot_qa"
    },
    {
        "query": "Word of God was the danish submission to the Academy Awards taking place in which year ?",
        "response": "2018",
        "source": "hotpot_qa"
    },
    {
        "query": "How many students does Mel Groomes alma mater have now?",
        "response": "over 48,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played in the soap opera \"Hollyoaks\" and was also in the production of \"Love Never Dies\"?",
        "response": "Summer Strallen",
        "source": "hotpot_qa"
    },
    {
        "query": "What heavyweight world champion boxer appeared on Le Noche del 10?",
        "response": "Michael Gerard Tyson",
        "source": "hotpot_qa"
    },
    {
        "query": "In what years was the comic-book series which had the duo \"Nite Owl\" published?",
        "response": "1986 and 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ornithogalum and Monstera both flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Arrhenius equation was proposed by this  Nobel-Prize winning Swedish scientist who is one of the founders of the science of what?",
        "response": "physical chemistry",
        "source": "hotpot_qa"
    },
    {
        "query": "Vladimir Olgerdovich was a son of which ruler of medieval Lithuania?",
        "response": "Algirdas",
        "source": "hotpot_qa"
    },
    {
        "query": "The northern terminus of New Hampshire Route 4 is a town with a population of what according to the 2010 census?",
        "response": "2,527",
        "source": "hotpot_qa"
    },
    {
        "query": "What American-Canadian conservative political commentator, actor, and comedian that played the voice of Brain, in the 6th season of the television show \"Arthur\", originally broadcast on PBS?",
        "response": "Steven Blake Crowder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city, Hejian or Shilong, Guangdong, is situated along China National Highway 106?",
        "response": "Hejian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Never a Dull Moment or National Treasure?",
        "response": "Never a Dull Moment",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the  public university that funds Florida Digital Newspaper Library located  ",
        "response": "Jacksonville, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Mafia hitman did Philip Carlo write the biography for?",
        "response": "Thomas Pitera",
        "source": "hotpot_qa"
    },
    {
        "query": "Guadarrama National Park and Garajonay National Park, are both national parks, in which country?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Burnett, a medical CEO from California, was played by Christian Clemenson in which film about 9/11?",
        "response": "United 93",
        "source": "hotpot_qa"
    },
    {
        "query": "what American Industrialist known as the Father of the maerican Industrial Revolution has a state park named after him in Rhode Island?",
        "response": "Samuel Slater",
        "source": "hotpot_qa"
    },
    {
        "query": "Terry Butler is an American bassist who currently performs with the death metal bands Obituary and Massacre, and he was also a member of Six Feet Under, an American death metal band from Tampa, Florida, formed in which year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the character Herbert West who was played by Jeffrey Combs?",
        "response": "H. P. Lovecraft",
        "source": "hotpot_qa"
    },
    {
        "query": "Robyn Elaine Lively (born February 7, 1972) is an American actress, known for her role on Saving Grace, an American crime drama television series which aired on which channel?",
        "response": "TNT",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Noel Gallagher's High Flying Birds and Morphine English rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of the music for the ballet \"The Seasons\"  was the director of what organization from 1905 to 1928?",
        "response": "Saint Petersburg Conservatory",
        "source": "hotpot_qa"
    },
    {
        "query": "White Shepherd and Kunming wolfdog, are a breed of what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "On what channel does an animated television series which contains theme songs written by Danny Jacob air?",
        "response": "Disney Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "American football defensive end Ahtyba Rubin, played for what football team at Iowa State University coached by Matt Campbell?",
        "response": "Iowa State Cyclones football",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthdate of the boxer that defeated a Mexican boxer on November 10, 2013?",
        "response": "October 11, 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Villa Senar is located near Lake Lucerne, which literally translates to what?",
        "response": "Lake of the Four Forested Settlements",
        "source": "hotpot_qa"
    },
    {
        "query": "From which city in Norway hails the black metal band which played at the Bloodstock Open Air heavy metal festival in Walton-on-Trent?",
        "response": "Bergen",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Jo Kopechne, was an American teacher, secretary, and political campaign specialist who died in a car accident at Chappaquiddick Island on July 18, 1969, while she was a passenger in a car being driven by U.S. Senator Ted Kennedy, it was the result of U.S. Senator Ted Kennedy's negligence and resulted in the death of his 28-year-old companion, Mary Jo Kopechne, who was trapped inside the vehicle, the event occurrence is known as what?",
        "response": "Chappaquiddick incident",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American footballer born who broke record for rushing yards in a single season with 1,805 yards?",
        "response": "April 16, 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "What rock group's 2003 album contains some of the last productions by a record producer later tried and convicted of murder?",
        "response": "Starsailor",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is the university located where Lester J. Reed received his Bachelors of Science from?",
        "response": "New Orleans, Louisiana",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that produces Vodka Cruiser is a subsidiary of a brewery company headquartered in what city?",
        "response": "Tokyo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which phenomenon that is associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific, was cited as the cause for the 2016 Vietnam floods?",
        "response": "El Niño",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the people replaced by Blake McIver Ewing was born in August 25, 1982?",
        "response": "Benjamin Diskin",
        "source": "hotpot_qa"
    },
    {
        "query": "What song, originally composed by Pyotr Ilyich Tchaikovsky, was performed by Elizabeth de la Porte in South Africa? ",
        "response": "Piano Concerto No. 1",
        "source": "hotpot_qa"
    },
    {
        "query": "Marilyn Buck participated in the prison escape of what Black Liberation Army member?",
        "response": "Assata Shakur",
        "source": "hotpot_qa"
    },
    {
        "query": "Europop included the lead single, released on what date?",
        "response": "15 January 1999",
        "source": "hotpot_qa"
    },
    {
        "query": "What label released the soundtrack to John Curan's 2006 drama film?",
        "response": "Deutsche Grammophon",
        "source": "hotpot_qa"
    },
    {
        "query": "George O'Malley is a fictional character from the medical drama television series \"Grey's Anatomy\", O'Malley married Callie Torres, played by which Mexican American actress, singer and songwriter?",
        "response": "Sara Ramirez",
        "source": "hotpot_qa"
    },
    {
        "query": "What company is associated with both White Wilderness and The Mighty Ducks?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeep Cherokee was a variant of a popular car that was sold between what years ?",
        "response": "1963 to 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of the British television crime drama series was born on 31 July 1971?",
        "response": "Eve Best",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the downtown sports stadium that the Minnesota Twins played in beginning in 1982?",
        "response": "Hubert H. Humphrey Metrodome",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first governor of the eighth least populous U.S. state?",
        "response": "Nicholas Cooke",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was recognized as one of the most influential scientists of all time and is also credited as one of the inventors of calculus?",
        "response": "Isaac Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Michael Winner and Patrick Rea producers of films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed both Carne in 1991 and I Stand Alone in 1998?",
        "response": "Gaspar Noé",
        "source": "hotpot_qa"
    },
    {
        "query": "Jomar Brun contributed to an operation designed to prevent what country from producing nuclear weapons?",
        "response": "prevent the German nuclear weapon project",
        "source": "hotpot_qa"
    },
    {
        "query": "One Canada Square, sometimes called Canary Wharf Tower or simply Canary Wharf, is a skyscraper in Canary Wharf, London, in late 2010, it was surpassed by which  95-storey skyscraper in Southwark, London, that forms part of the London Bridge Quarter development?",
        "response": "The Shard",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the King of England died based on who's conflict with his wife Philippa of Hainault The Six of Calais is a one-act play was made?",
        "response": "21 June 1377",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current president of the country Samira Negrouche lives and works in?",
        "response": "Abdelaziz Bouteflika",
        "source": "hotpot_qa"
    },
    {
        "query": "Which came first: the birth of Rob Zombie or the formation of the band Wheatus?",
        "response": "Rob Zombie",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that hosted Star Show 360 is also the leader of what boy band?",
        "response": "Super Junior",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the brother of the author of The Rage Against God born?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "What composer, known for his many film scores, composed \"Stronger with Each Tear\" with Mary J. Blige?",
        "response": "Thomas Newman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Atlantic Oceans connection to Old World?",
        "response": "separates",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Maria Sharapova or Heather Watson?",
        "response": "Maria Yuryevna Sharapova",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Clark, was an English Civil Engineer, specialising in hydraulics, he is remembered principally as the designer of what, which two caisson lift lock near the village of Anderton, Cheshire, in North West England?",
        "response": "Anderton Boat Lift",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote shorter stories, Raymond Carver or Lydia Davis?",
        "response": "Lydia Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname for the Football Club that Matt Crouch was recruited by?",
        "response": "the Crows",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a book by Hans-Peter Martin Imagine or The Global Trap?",
        "response": "The Global Trap",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the place in Canada where François Beaucourt (1740-1794) was mainly active acquired its present name?",
        "response": "1763",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the film with a character named Rose Tico?",
        "response": "Rian Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "María Eugenia Bielsa is the sister of the football manager in charge of what team?",
        "response": "Lille",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Incubus\" cinematographer went on to win an Academy Awards for his work on a Sam Mendes directed film released in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "On the first Friday in September, The Adelaide suburb of Wayville hosts the state's biggest event. What is the event?",
        "response": "Royal Adelaide Show",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the American neo-Western crime thriller, starring Jeff Bridges, released?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the location of the execution of Roger David Casement, the Irish Nationalist who made made efforts during World War I to gain German military aid for the 1916 Easter Rising that sought to gain Irish independence?",
        "response": "Casement's Fort",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the woman who was first-seeded and won the singles title in The 1997 Porsche Tennis Grand Prix?",
        "response": "Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played for Real Madrid as a forward and has a yearly, friendly tournament named after him?",
        "response": "Santiago Bernabéu de Yeste",
        "source": "hotpot_qa"
    },
    {
        "query": "What until November 1991, it was known as Jin County, Jinzhou, Hebei or Wuzhong, Ningxia ?",
        "response": "Jinzhou",
        "source": "hotpot_qa"
    },
    {
        "query": "Fudge is a children's television series based on a series of Judy Blume, this show premiered on which channel?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Crimson Skies game designer has founded five game design companies?",
        "response": "Jordan Weisman",
        "source": "hotpot_qa"
    },
    {
        "query": "Ricky Martin's concert tour in 1999 featured an American heavy metal band formed in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seating capacity of the stadium at which the final of the 2009–10 Heineken Cup pool stage was held?",
        "response": "81,338",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the coaches of Southern Methodist University also played what role at the Arizona State Sun Devils?",
        "response": "defensive coordinator",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress appearing in School Dance also appeared in the soap opera If Loving You Is Wrong?",
        "response": "Tiffany Haddish",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was on the album \"Slippery When Wet\" and ranked higher than \"Will You Still Love Me?\" on the \"Billboard\" Hot 100 chart?",
        "response": "\"Livin' on a Prayer\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain is higher, Ngadi Chuli or Porong Ri? ",
        "response": "Porong Ri",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country are Gaizhou and Zhengzhou located?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Racing Extinction or The Fearless Freaks?",
        "response": "Fearless Freaks",
        "source": "hotpot_qa"
    },
    {
        "query": "the county of Gwynedd is located in a country that had how many inhabitants in 2011 ?",
        "response": "3,063,456",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did José Roberto da Silva Junior defect to during the 2001–02 Bayer 04 Leverkusen season?",
        "response": "Bayern Munich",
        "source": "hotpot_qa"
    },
    {
        "query": "what family does the king who dissloved the Jordanian government in 2009 belong to?",
        "response": "Hashemite",
        "source": "hotpot_qa"
    },
    {
        "query": "Eli Wallach played Arthur Abbott is a romantic comedy film written by who?",
        "response": "Nancy Meyers",
        "source": "hotpot_qa"
    },
    {
        "query": "Between the Akita and Boykin Spaniel, which dog breed is larger?",
        "response": "Akita",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Belgorod International Airport and Tupolev Tu-204 related?",
        "response": "airliner",
        "source": "hotpot_qa"
    },
    {
        "query": "Calais ( , traditionally ; ] ; Picard: \"Calés\" ; Dutch: \"Kales\" ) is a town and major ferry port in northern France in the department of Pas-de-Calais, of which administrative division of a country that is below prefecture or province?",
        "response": "Subprefecture",
        "source": "hotpot_qa"
    },
    {
        "query": "What superfund site is the base for the \"Snipers\" Marine Corps squadron",
        "response": "Marine Corps Air Station Yuma",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote  a book about Muhammad Ali and boxers who opposed him?",
        "response": "authored by Stephen Brunt",
        "source": "hotpot_qa"
    },
    {
        "query": "Bukit Jalil National Stadium is the second largest stadium in Southeast Asia behind the stadium named after which first President of Indonesia?",
        "response": "Sukarno",
        "source": "hotpot_qa"
    },
    {
        "query": "Marié Digby an American singer, and songwriter, known for her acoustic cover version of which Rihanna song?",
        "response": "Umbrella",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the creator of the American political satire comedy television series in which Sufe Bradshaw plays an acerbic secretary named Sue?",
        "response": "Armando Iannucci",
        "source": "hotpot_qa"
    },
    {
        "query": "The UFO Incident is a 1975 television film based on the first widely publicized report in the United States of what?",
        "response": "alien abduction",
        "source": "hotpot_qa"
    },
    {
        "query": "Glubbdubdrib was an imaginary country in the novel by the author of what ethnicity?",
        "response": "Anglo-Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Ota Benga and The Devil and Daniel Johnston, are documentary films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which United States Secretary of War under Franklin Pierce was elected President under the Provisional Confederate States Constitution?",
        "response": "Jefferson Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Siegi Sessler was the restaurateur whose club was frequented by which actress with Welsh ancestry?",
        "response": "Ruth Elizabeth \"Bette\" Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the estimated population in 2017 of the city where the 2016 Rally Australia was held?",
        "response": "70,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Lt Col. Stewart Francis Newcombe was a British army officer and associate of a military officerthat was given what title?",
        "response": "Lawrence of Arabia",
        "source": "hotpot_qa"
    },
    {
        "query": "Carleton B. Swift Jr was an officer of Office of Strategic Services, an active agency during which time?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this Indian low cost carrier, in which Calicut International Airport servces as an operating base?",
        "response": "Air India Express",
        "source": "hotpot_qa"
    },
    {
        "query": "are The LaFontaines and Gas Huffer from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What bank merged to creathe the Swiss Bank Corporation?",
        "response": "Union Bank of Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Gibney is known for her role in what television show that stars Brendan O'Carroll?",
        "response": "Mrs. Brown's Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, The Pretenders or Shinedown ?",
        "response": "The Pretenders",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname for the team that is a professional Australian rules football club playing in the Australian Football League, who had a coach  from 1936 to 1938 who was an Australian rules football player who played in the VFL between 1925 and 1935?",
        "response": "Tigers",
        "source": "hotpot_qa"
    },
    {
        "query": "who was born first, Stanislav Smirnov or Lev Schnirelmann?",
        "response": "Lev Genrikhovich Schnirelmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Petticoat Government was written by the author of \"The Scarlet Pimpernel,\" which was set during the Reign of Terror following the start of  what?",
        "response": "French Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film starring Gurinder Kaur Kainth?",
        "response": "Dheeraj Rattan",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 Senior League World Series took place from July 29–August 5 in Easley, South Carolina, guadulce, Panama defeated Coral Springs, Florida in the championship game, which is a city in Broward County, Florida, United States, approximately 20 mi northwest of which city?",
        "response": "Fort Lauderdale",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a movie that is a Japanese replica of a 1967 French drama?",
        "response": "Red Scandal: Affair",
        "source": "hotpot_qa"
    },
    {
        "query": "Dylan Dog: Dead of Night is an American horror comedy film, released in which year, and  based on Tiziano Sclavi's Italian comic book \"Dylan Dog\", starring Brandon Routh, an American actor and former fashion model?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays drums for the Finnish alternative rock band who's first international compilation album was \"Alchemy VOl. 1\"?",
        "response": "Jari Salminen",
        "source": "hotpot_qa"
    },
    {
        "query": "The town of Nieuw-Vennep is southwest of what main international airport of Holland?",
        "response": "Amsterdam Airport Schiphol.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who can play more instruments, Michael Monroe or Alison Goldfrapp?",
        "response": "Michael Monroe",
        "source": "hotpot_qa"
    },
    {
        "query": "the lyrics of Yellow Flicker Beat refer to the rise of the heroine in a trilogy of novels of what genre?",
        "response": "young adult dystopian",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the Landseer or English Mastiff have a limited range of colors? ",
        "response": "English Mastiff",
        "source": "hotpot_qa"
    },
    {
        "query": "What familiar device was invented by human-computer interface engineer Douglas Engelbart, creator of hypertext?",
        "response": "mouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Sooo Many White Guys is a podcast hosted by who, the podcast executive producer is Ilana Glazer, an American comedian, writer, and actress?",
        "response": "Phoebe Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Enemy at the Gates is a 2001 French-American war film written and directed by Jean-Jacques Annaud and based on William Craig's nonfiction book, released in which year, the film's main character is a fictionalized version of sniper Vasily Grigoryevich Zaytsev, a Hero of the Soviet Union during World War II, was a Soviet sniper?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "What World War II facility, near Childersburg, Alabama was the site of the P-9 Project from 1943 to 1945?",
        "response": "The Alabama Army Ammunition Plant",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Kenyan woman born in 1985 coached by Wes Kittley?",
        "response": "Sally Kipyego",
        "source": "hotpot_qa"
    },
    {
        "query": "Which TV channel aired the second season of Dexter, the Miami-set crime series, in the USA?",
        "response": "Showtime",
        "source": "hotpot_qa"
    },
    {
        "query": "What film with actor Israel Contreras used the Yucatec Maya language?",
        "response": "Apocalypto",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the race start that Running on the Sun: The Badwater 135 is about?",
        "response": "Badwater Basin",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the major part of the film, Mounam Pesiyadhe filmed?",
        "response": "the film is shot in Pondicherry.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the home of both Fathead and Quicken Loans?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "This British scholar who attended the oldest English-speaking university in the English speaking world was president of the British academy for what length of time?",
        "response": "from 1971–74",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the Chinese peer reviewed journal which is edited by Li Fanghua, a member of the Chinese Academy of Sciences and the International Union of Crystallography?",
        "response": "Chinese Journal of Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, V-Day: Until the Violence Stops or 51 Birch Street?",
        "response": "V-Day: Until the Violence Stops",
        "source": "hotpot_qa"
    },
    {
        "query": " Dayton's Devils had a cameo from the \"MASH\" star who played what role on the show?",
        "response": "Captain B.J. Hunnicutt",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Steven Zaillian and Arthur Nersesian american?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Ted Cain or Jay Cutler?",
        "response": "Ted Cain",
        "source": "hotpot_qa"
    },
    {
        "query": "Lepidogma rufescens is a moth species that is known to exist in the country that is landlocked on what continent?",
        "response": "South Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "William Jenifer Powell was recognized as a pioneer aviator and a civil rights activist along with James Banning and an American civil aviator who was the first woman of African-American descent to hold a what?",
        "response": "pilot license",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both The Private Life of Plants and The White Diamond, documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Anniston's father portrays the fictional character Victor Kiriakis on what long-running show?",
        "response": "Days of Our Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the 2003 film which has scenes in it filmed at the Quality Cafe in Los Angeles?",
        "response": "Todd Phillips",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Campbell, was a solicitor in New South Wales, Australia and the leader of which organization, that was formed in Sydney, Australia in February 1931 as a paramilitary offshoot from a conservative tradition defending loyalty to King and Empire, sound government, law and order, individual liberty and property rights?",
        "response": "New Guard",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is best known for being the lead singer in a band named after himself: Toby Rand or Jonah Matranga?",
        "response": "best known for being lead singer of rock band RAND",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Winter Olympics did Leslie Thomas compete at, where the host city was chosen over Falun and Cortina d'Ampezzo?",
        "response": "1988 Winter Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "The mother of Archduchess Elisabeth Marie of Austria, was born on which day ?",
        "response": "21 May 1864",
        "source": "hotpot_qa"
    },
    {
        "query": " Karl Templer is creative director of Interview and his work has appeared in publications internationally including Vogue Italia, Vogue Paris, and W, a monthly American fashion magazine published by who?",
        "response": "Condé Nast",
        "source": "hotpot_qa"
    },
    {
        "query": "What community is located in physiographic and geologic highland region of the central United States, primarily in Arkansas, Missouri, and Oklahoma?",
        "response": "Zenar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which national park has more land area, Ordesa y Monte Perdido National Park or the Atlantic Islands of Galicia National Park?",
        "response": "Ordesa y Monte Perdido",
        "source": "hotpot_qa"
    },
    {
        "query": " Steve Evans has had writing appear in the Florida newspaper owned by which company?",
        "response": "McClatchy",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Pocahontas made before Born in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what part of the Absheron Peninsula did Eldar Gasimov host a 2012 song contest?",
        "response": "Baku",
        "source": "hotpot_qa"
    },
    {
        "query": "Immerhof protected blockhouses that were constructed during a war that lasted how long?",
        "response": "eight-month period",
        "source": "hotpot_qa"
    },
    {
        "query": "Guerillas in Pink Lace starred the actor and painter of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What suburb is in the south of Adelaide, South Australia that has a metropolitan neighboring suburb of Seaford, as well as Maslin Beach, Seaford Rise, and Port Noarlunga?",
        "response": "Moana",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Kurt Vonnegut novel that appeared as lyrics in a song on the album Ambrosia first published?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the book that the author of Ug is best known for?",
        "response": "The Snowman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Koeleria and Aristotelia genuses of plants in the grass family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Kellas, Moray is a village that gave its name to a feline that was first discovered in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "The American actor best known for his role as James Evans, Sr. on the CBS television series \"Good Times\"  starred in a 1982 sword and sorcery film directed by whom?",
        "response": "Don Coscarelli",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that owns Claro Colombia headquartered?",
        "response": "Mexico City",
        "source": "hotpot_qa"
    },
    {
        "query": "Born to Use Mics: Reading Nas's Illmatic, edited by which academic, author, and radio host?",
        "response": "Michael Eric Dyson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both the Red House Painters and Us Amongst The Rest considered rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the Island on which Kenneth F. Sutherland was born? ",
        "response": "60,000",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the series Hard Fate starring Hong Kong American actor Kevin Cheng air on TVB?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Rose Mary Woods and Harry Robbins \"Bob\" Haldeman both had ties to President Richard Nixon, how long did Rose Mary Woods work for him?",
        "response": "was Richard Nixon's secretary from his days in Congress in 1951, through the end of his political career.",
        "source": "hotpot_qa"
    },
    {
        "query": "What paper was presented that includes comediennes that were also TV hosts?",
        "response": "The Unkosher Comediennes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third studio album by English punk rock band the Clash, thats single began as an instrumental track called \"Working and Waiting\"?",
        "response": "London Calling",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the MyNetworkTV-affiliated television station for southern Maine and northern New Hampshire ,that airs a food-related television program featuring profiles of New England area restaurants?",
        "response": "WPME",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the American author who wrote , I Wear the Black Hat born ",
        "response": "June 5, 1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the agent for the player with the highest number of appearances in the Premier League?",
        "response": "Michael John Standing",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Rizhao and Linhai in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Toshi and Warrel Dane both in the band Sanctuary?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the prequel to a film made whose sequel was directed by Bradley Raymond in which almost the entire key cast returned for the sequel?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What Sao Sebastiao based airline also manages Corvo Airport?",
        "response": "SATA Air Açores.",
        "source": "hotpot_qa"
    },
    {
        "query": "Taktisches Luftwaffengeschwader 51 was named after which first German WWI flying ace?",
        "response": "Max Immelmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Was The World's Greatest Athlete or Invincible released first?",
        "response": "The World's Greatest Athlete",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Charles Mantagu Doughty or Rory Stewart?",
        "response": "Charles Montagu Doughty",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Feiyu Show or That's Dancing!?",
        "response": "That's Dancing!",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of living organism does Sternbergia and Anagallis have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Walt Disney produce first, Saludos Amigos or Hot Lead and Cold Feet?",
        "response": "Saludos Amigos",
        "source": "hotpot_qa"
    },
    {
        "query": "The first college basketball team that David Padgett played for are part of what NCAA conference?",
        "response": "Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Jones AT&T Stadium is on the campus of the university in what Texas city?",
        "response": "Lubbock",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Treasure Island or The Living Desert?",
        "response": "Treasure Island",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the rapper known as iLoveMakonnen known for his song \"Tuesday\"?",
        "response": "Makonnen Sheran",
        "source": "hotpot_qa"
    },
    {
        "query": "which county has the highest border Jishou: or Acheng District",
        "response": "Acheng District",
        "source": "hotpot_qa"
    },
    {
        "query": "Jung Joon Young 1st mini album is the debut EP by which South Korean singer-songwriter, radio DJ, host, actor, and television personality?",
        "response": "Jung Joon-young",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Edward Sedgwick and Bahman Ghobadi both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Snakes and Ladders and Sugoroku are both what type of game?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show whose first episode is titled An Elephant Makes Love to a Pig?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress born in 1982 stars in the 2015 American drama film \"Bleeding Heart\"?",
        "response": "Jessica Biel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film stars more animals, The Jungle Book or The Lone Ranger?",
        "response": "The Jungle Book",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known as the \"Mexican Robin Hood\", Juan Flores or Joaquin Murrieta?",
        "response": "Joaquin Murrieta Carrillo (sometimes spelled Murieta or Murietta)",
        "source": "hotpot_qa"
    },
    {
        "query": "The Covenant, the Sword, and the Arm of the Lord, founded by James Ellison, was active in what country?",
        "response": "that was active in the United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Adolf Čech led performances of operas by a composer who was active during what period?",
        "response": "romantic",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the formal name of the trail the book \"Monkey Town\" is based on?",
        "response": "The State of Tennessee v. John Thomas Scopes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Henry Green and Richard Wright American authors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What season was it that the Portland Trail Blazers acquired the identical twin brother of Horace Grant, the same season that Chris Dudley had an ankle injury? ",
        "response": "24th season",
        "source": "hotpot_qa"
    },
    {
        "query": "Which consists of more people, Tokyo Police Club and Gotye?",
        "response": "Tokyo Police Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the company that is the successor to News Corporation following its split on 28 June 2013 that Paul Cheesbrough works for?",
        "response": "News Corp.",
        "source": "hotpot_qa"
    },
    {
        "query": "Prince Omar bin Faisal is the nephew of which current King?",
        "response": "Abdullah II of Jordan",
        "source": "hotpot_qa"
    },
    {
        "query": "At which university does the phycisist upon who's bestseller \"Calabi-Yau\" is based teach?",
        "response": "Columbia University",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the multi award winning Senta Berger star in Diabolically Yours with Alain Delon?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Adolfo Suárez Madrid–Barajas Airport is as large as which largest airport in France?",
        "response": "Charles de Gaulle Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Lennon & Maisy are the daughters of the Canadian duo from what Ontario city?",
        "response": "Whitby",
        "source": "hotpot_qa"
    },
    {
        "query": "Tobago Express operated as a sister airline of a state-owned airline that employs more than how many people?",
        "response": "1,700",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member of Exit 57 also appears on BoJack Horseman ?",
        "response": "Amy Sedaris",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Aaron \"Mike\" Einziger is an American musician,he co-wrote and played acoustic guitar on Swedish DJ and electronic music producer, Avicii's 2013 worldwide hit, titled?",
        "response": "Wake Me Up",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town that gets it's water supply from Canobie Lake?",
        "response": "28,776 at the 2010 census",
        "source": "hotpot_qa"
    },
    {
        "query": "Arif Erdem, is a retired Turkish international footballer of Albanian descent and the former manager of İstanbul Büyükşehir Belediyespor, he scored 106 goals in 341 league matches and finished joint top scorer (\"Gol Kralı\") of the Süper Lig with İlhan Mansız, a German-born Turkish former football player and current competing figure skater, at the conclusion of which season?",
        "response": "2001–02",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Scott brought to London an aopera singer who has won how many Grammy Awards?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "Which popular Mexican singer and movie actor is known for his rancheras, a genre of traditional Mexican folk music?",
        "response": "Javier Solís",
        "source": "hotpot_qa"
    },
    {
        "query": " Myles Falls Horton taught and heavily influenced the co-founder of what conference?",
        "response": "Southern Christian Leadership Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game, Trivial Pursuit or Polarity, requires strategic thinking and dexterity?",
        "response": "Polarity",
        "source": "hotpot_qa"
    },
    {
        "query": "Penetrator was the type of aircraft that designated what General Dynamics medium-range tactical attack aircraft?",
        "response": "General Dynamics F-111 Aardvark",
        "source": "hotpot_qa"
    },
    {
        "query": "The BMW N63 engine was launched in a mid-sized luxury what?",
        "response": "crossover",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by American rapper Kanye West from his fifth studio album did this American record producer, songwriter, keyboardist, vocalist, and multi-instrumentalist Jeff Bhasker contribute to and win a Grammy Award for?",
        "response": "All of the Lights",
        "source": "hotpot_qa"
    },
    {
        "query": "What railway station is north of Drigg railway station on the Cumbrian Coast of England?",
        "response": "Whitehaven railway station",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of Attack on Titan?",
        "response": "Shinji Higuchi",
        "source": "hotpot_qa"
    },
    {
        "query": "Govindudu Andarivadele is the soundtrack that has songs whose lyrics were partially written by the writer who won a National award for what other song?",
        "response": "Nenu saitam",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the goalkeeper who blocked the most decorated English footballer player of all time?",
        "response": "Jens Lehmann",
        "source": "hotpot_qa"
    },
    {
        "query": "This Republic, established in 1581 and the focus of The Secret Treaty of Dover, contained how many provinces?",
        "response": "Seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is also a guitarist, Kang Seung-yoon or Piotr Wiwczarek?",
        "response": "Piotr Wiwczarek",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kitchen is a cooking-themed talk show that airs on Food Network, the series is presented by which chef, and  Food Network personality, that began hosting \"How'd That Get On My Plate?\", in July 2008?",
        "response": "Sunny Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in Episode 1 of Star Wars was portrayed by the actor who played Arnold Schwarzenegger's son in Jingle All the Way?",
        "response": "Anakin Skywalker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Massachusetts Representative did Carl Michael Sciortino Jr. lose to in the 2013 special election?",
        "response": "Katherine Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series was also based on a series of books written by Georges Prosper Remi?",
        "response": "The Adventures of Tintin",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series featuring Albert Reed Jr. aired on CBS between 1974 and 1979?",
        "response": "Good Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert N. Charrette (born 1953) is an award-winning graphic artist, game designer, sculptor and author, Charrette produced gaming products for FASA Corporation, an American publisher of role-playing games, wargames and board games between 1980 and 2001, after which they closed publishing operations for several years, becoming an IP holding company under the name FASA Inc, in which year,a wholly owned subsidiary called FASA Games Inc. went into operation, using the name and logo with permission of the parent company.?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was produced by more people, Great Old Amusement Parks or The Devil Came on Horseback?",
        "response": "The Devil Came on Horseback",
        "source": "hotpot_qa"
    },
    {
        "query": "What is special about the African-American cultural and educational center the descendants of enslaved Africans from South Carolina attended?",
        "response": "first school founded in the Southern United States specifically for the education of African-Americans",
        "source": "hotpot_qa"
    },
    {
        "query": "In what town in the Central West region of New South Wales was Brad Haddin born?",
        "response": "Cowra",
        "source": "hotpot_qa"
    },
    {
        "query": "What test preceded Operation Julian before negotiations began for the Coprehensive Test Ban Treaty?",
        "response": "Operation Aqueduct",
        "source": "hotpot_qa"
    },
    {
        "query": "What relationship does Stevie Mann have to an Irish singer-songwriter born in 1973?",
        "response": "second cousin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Huai'an and Qian'an, Hebei both Chinese cities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the job of both A. Manette Ansay and Amos Oz?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town and state was home to Cynthia Farrar and the Kensan-Devan Wildlife Sanctuary at Meetinghouse Pond?",
        "response": "Marlborough, New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Bordan Tkachuk was the CEO of a company that provides what sort of products?",
        "response": "IT products and services",
        "source": "hotpot_qa"
    },
    {
        "query": "After his time coaching for the St. Louis Rams, where did the team that Rich Brooks coached play their home games?",
        "response": "Commonwealth Stadium in Lexington, Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "Strange Weirdos is the official soundtrack album to the film whose director founded what?",
        "response": "Apatow Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times did the murder victim of an heir to the Du Pont family fortune win Olympic Medals?",
        "response": "seven-time",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Fallopia or Punica feature more species of flowering plants?",
        "response": "Fallopia is a genus of about 12–15 species",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the football club that Michael Langer plays for originally from?",
        "response": "Gelsenkirchen, North Rhine-Westphalia",
        "source": "hotpot_qa"
    },
    {
        "query": "The performer of Rack City signed a contract with who?",
        "response": "Young Money Entertainment, Cash Money Records and Republic Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American cartoonist and publisher who had Fred Carter working for him?",
        "response": "Jack Chick",
        "source": "hotpot_qa"
    },
    {
        "query": "William Milliken won the 1970 Michigan gubernatorial election, deafeating a man that was Chairman of the Ways and Means Committe during what years? ",
        "response": "2010 to 2011",
        "source": "hotpot_qa"
    },
    {
        "query": "A peasant and trade union leader was assassinated by a man with which mistaken surname?",
        "response": "Liggio",
        "source": "hotpot_qa"
    },
    {
        "query": "Filmmaker Greg Carter is from which Texas city in Harris County?",
        "response": "Houston",
        "source": "hotpot_qa"
    },
    {
        "query": " The 2012 Olympic hunger summit was held at the official residence and office of who?",
        "response": "First Lord of the Treasury",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Emily Whitehurst and Tim Rushlow both American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which created more weapons, Exidy and Matra?",
        "response": "Matra",
        "source": "hotpot_qa"
    },
    {
        "query": "Resorcerer was created for the operating systems that were first created in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "What plot did Kurt Freiherr von Plettenberg and Claus von Stauffenberg work together on?",
        "response": "20 July plot",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Christmas album Darlene Love performed on that was produced by the man who helped write Not Too Young to Get Married?",
        "response": "A Christmas Gift for You",
        "source": "hotpot_qa"
    },
    {
        "query": "The bombing of Romania in World War II comprised two series of events: until August 1944, Allied operations, and, following the overthrow of Ion Victor Antonescu's dictatorship, operations by Nazi Germany, Antonescu was a Romanian soldier and authoritarian politician who, as the Prime Minister and \"Conducător\" during most of World War II, presided over how many successive wartime dictatorships?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pylon and Team Sleep experimental bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the original name of the brothel at the Wild Horse Adult Resort & Spa that is separate from the Wild Horse Ranch brothel?",
        "response": "Mustang Bridge Ranch",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Trebek hosted a game show in the 1970's that help shape him into the television personality he as become and the host of what syndicated game show?",
        "response": "Jeopardy!",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Marine Corp equivalent of the military award Eugene Mead Caffey received for his heroism in World War II?",
        "response": "Navy Cross",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Wheeler is a radio announcer for an NBA teach based in which city?",
        "response": "Portland, Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film which won the BAFTA Award for Best Editing in 2006?",
        "response": "Paul Greengrass",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the partner of the man who named Tower Rock?",
        "response": "William Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the World Series of Poker Main Event in 1978 and has a cardroom named after him at the Bellagio casino?",
        "response": "Bobby Baldwin",
        "source": "hotpot_qa"
    },
    {
        "query": "John Ball is recorded as one of the 3000 African Americans who escaped to the British lines during the American Revolution in a document about slaves who were evacuated to point in which Canadian Province ?",
        "response": "Nova Scotia",
        "source": "hotpot_qa"
    },
    {
        "query": "A re Tom McCarthy and Jim Sheridan film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Polygonum and Sapium belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player was a better tennis player with his non-dominant hand, Jürgen Melzer or Albert Costa?",
        "response": "Jürgen Melzer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star in The Pokrovsky Gate was also a director and occasional singer?",
        "response": "Oleg Menshikov",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the founding member of The Football League that Willie Almond played for?",
        "response": "Accrington",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the first Bishop, who had Richard Henry Nelson as Coadjutor from 1904 to 1913, born?",
        "response": "Boston",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members Band of Skulls or Live ?",
        "response": "Live",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the four US Presidents who have been assinated was shot on the grounds of the Pan-American Exposition at the Temple of Music in Buffalo, New York?",
        "response": "William McKinley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which play, written by a professor of several universities including State University of New York at Buffalo and the State University of New York at Stony Brook, shared the title of Obie award for Distinguished play?",
        "response": "Dutchman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2012 action thriller that starred Will from Will & Grace?",
        "response": "Andrew Currie",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American child beauty pageant queen born who was killed in her family's home in Boulder and who'smother was Patricia Ann?",
        "response": "August 6, 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was king of Sweden during the Battle of Kirchholm?",
        "response": "Charles IX",
        "source": "hotpot_qa"
    },
    {
        "query": "Which New York City skyscraper is taller, 245 Park Avenue or 1345 Avenue of the Americas?",
        "response": "245 Park Avenue",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The 1975 and Mayday Parade both English rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor known for his role as Tyler Duncan in a movie directed by Paul Feig?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these magazines is published more frequently--National Contest Journal or Baltimore?",
        "response": "Baltimore",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Yale University and University of Oklahoma both among the five oldest universities in the USA?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Princess Charlotte of Cambridge born before or after the repealing of the Royal Marriages Act 1772?",
        "response": "after",
        "source": "hotpot_qa"
    },
    {
        "query": "What flower has a name similar to the name of a type of Digging bar?",
        "response": "Hops",
        "source": "hotpot_qa"
    },
    {
        "query": "Who Killed Nelson Nutmeg? starred the actress who played what role in the Harry Potter series?",
        "response": "Ginny Weasley",
        "source": "hotpot_qa"
    },
    {
        "query": "Lockheed Martin F-35 Lightning II development started in 1992 with the origins of the Joint Strike Fighter program and is set to culminate in full production in 2018, unlike the F-22 Raptor, is intended to be available for export, the Lockheed Martin F-22 Raptor is a fifth-generation, single-seat, twin-engine, all-weather stealth tactical fighter aircraft, developed for which organization?",
        "response": "United States Air Force (USAF)",
        "source": "hotpot_qa"
    },
    {
        "query": "How many staff members were taken hostage during the prision riot that David Rothenberg was a civilian observer of?",
        "response": "42",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did this Austrian former Formula One driver who finished third at the 1978 Brazilian Grand Prix win the F1 World Drivers' Champion first?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the university that owns WCSU-FM historically black or white?",
        "response": "black",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Robert Voser was the CEO from July 2009 to December 2013 to a company headquartered in which country ?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "This 2011 comedy film stars an American actress who won how many Golden Globes for her roll in \"Sex and the City\"?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "How many hotel rooms does the hotel, at which Wayne Newton Live in Concert aired live, have?",
        "response": "2,956",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the route the C2-class Melbourne tram is on operate?",
        "response": "Brunswick East to St Kilda Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Jozy Altidore plays soccer for the United States men's national soccer team and what other team?",
        "response": "Toronto FC",
        "source": "hotpot_qa"
    },
    {
        "query": "which  American singer composed songs in Burl Ives Sings Pearly Shells and Other Favorites",
        "response": "Wyatt Merle Kilgore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of cactus, Austrocylindropuntia or Spathiphyllum?",
        "response": "Austrocylindropuntia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a graphic designer best known for designing the \"swoosh\" logo for an American multinational corporation that is engaged in the design, development, manufacturing, and worldwide marketing and sales of footwear, apparel, equipment, accessories, and services ?",
        "response": "Carolyn Davidson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the highest peak, Haramosh Peak or Siguang Ri? ",
        "response": "Haramosh Peak",
        "source": "hotpot_qa"
    },
    {
        "query": "Martha Graham Center of Contemporary Dance focuses on teaching the technique that was the influence of whose techniques?",
        "response": "Merce Cunningham, Lester Horton, and Paul Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which number in the Final Fantasy series was created by Hiroyuki Ito and allows the player control of the artificial intelligence of the characters in battle?",
        "response": "Final Fantasy XII",
        "source": "hotpot_qa"
    },
    {
        "query": "Are J. G. Farrell and James Thurber both authors ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Craig Melville and Andrzej Wajda both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: Which American publisher, educator, and jazz saxophonist that was born in 1939, transcribed The Charlie Parker Omnibook?",
        "response": "Jamey Aebersold",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1996 NBA rookie is a player development consultant for the Golden State Warriors today?",
        "response": "Stephen John Nash",
        "source": "hotpot_qa"
    },
    {
        "query": "Trevor nunn has directed what non musical show besides Birdsong",
        "response": "Macbeth",
        "source": "hotpot_qa"
    },
    {
        "query": "The college where R. Kent Hughes holds a BA from had approximately how many students enrolled as of fall 2015?",
        "response": "1,725",
        "source": "hotpot_qa"
    },
    {
        "query": "A robot that successfully hitchhiked across Canada was created by Ryerson University in which city?",
        "response": "Toronto",
        "source": "hotpot_qa"
    },
    {
        "query": "What vocal and instrumental duo consisting of siblings Karen (1950-1983) and Richard Carpenter (b. 1946) covered Tim Hardin's \"Reason to Believe\"?",
        "response": "The Carpenters",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine publishes a ranking of colleges and universities, Red Herring or Washington Monthly?",
        "response": "Washington Monthly",
        "source": "hotpot_qa"
    },
    {
        "query": "What American football defensive tackle for the Tampa Bay Buccaneers who played college football at Oklahoma, was third overall pick in the club's 35th season as a franchise in the NFL?",
        "response": "Gerald Keith McCoy Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following animated films won the Annecy Cristal in June 2009: Mary and Max or Alice's Birthday?",
        "response": "Mary and Max",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the palace founded at which Columba de Dunbar died in 1435?",
        "response": "the late 12th Century",
        "source": "hotpot_qa"
    },
    {
        "query": " Geneva Carr, who starred in the 2012 American superhero comedy film Alter Egos, was born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did actor Paul L. Smith play opposite Robin Williams in the 1980 American musical comedy film directed by Robert Altman?",
        "response": "Bluto",
        "source": "hotpot_qa"
    },
    {
        "query": "Which student of Plato was a traditional astrologer?",
        "response": "Aristotle",
        "source": "hotpot_qa"
    },
    {
        "query": "What show included these two actresses Valerie Harper and Mary Jo Keenen?",
        "response": "\"City\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Works by what man, who was part of the duo Simon & Garfunkel, were included in the 1967 Joan Baez album, Joan?",
        "response": "Paul Frederic Simon",
        "source": "hotpot_qa"
    },
    {
        "query": " For British markets Big Time was released as a double A-side single together with a song originally written and produced by who?",
        "response": "George Michael",
        "source": "hotpot_qa"
    },
    {
        "query": "The Expedition that fought the Tiguex war also was the same expedition that marked the first European sightings of the Grand Canyon and what other notable American landmark?",
        "response": "Colorado River",
        "source": "hotpot_qa"
    },
    {
        "query": "Armand Castelmary played Horatio in the 1868 version of the opera set to a play by whom?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed, Drentse Patrijshond or Ratonero Murciano de Huerta, is a Spanish breed of dog originating from Murcia?",
        "response": "Murcian Ratter",
        "source": "hotpot_qa"
    },
    {
        "query": "Herbie Goes Bananas and Those Calloways, are both films made by which company?",
        "response": "Walt Disney Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is the episode \"The Canine Mutiny\" located?",
        "response": "Springfield",
        "source": "hotpot_qa"
    },
    {
        "query": "3000 Miles to Graceland is an American action adventure crime film, released in which year, and directed, co-produced by Damien Lichtenstein, it is a story of theft and betrayal, revolving around a plot to rob the Riviera Casino during a convention of Elvis impersonators, a hotel and casino on the Las Vegas Strip in Winchester, Nevada, which operated from April 1955 to May 2015?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "The highest paid actress in the world in 2015 and 2016 has a cameo appearance in what 2014 documentary about Raf Simon?",
        "response": "Dior and I",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to Paul Centopani, who was the second member of the Young Stallions?",
        "response": "Jim Powers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician, Ian Ball or Dave Mustaine, is co-founder of the American metal band Megadeth?",
        "response": "David Scott Mustaine",
        "source": "hotpot_qa"
    },
    {
        "query": "which  athletics event  style doesThränhardt uses",
        "response": "Fosbury Flop",
        "source": "hotpot_qa"
    },
    {
        "query": "The Public Eye features an actor with the last name Tucci of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first of Taylor Hackford and Howard Zieff?",
        "response": "Howard B. Zieff",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed the roller coaster for the largest theme park in Germany? ",
        "response": "Franz Mack",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the country in which Stuart Blacker taught at a Grammer School?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pizza chain opened first, Pagliacci Pizza or Eatza Pizza?",
        "response": "Pagliacci Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is directing the upcoming thriller film featuring music by shaan?",
        "response": "Jayadev",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lydia Davis and Neil Simon playwrights?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "George Whitefield, Charles Wesley and John Wesley started the Methodist movement in the 18th century within which church denomination?",
        "response": "Church of England",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did the recipient of the 2007 Brownlow Medal play for?",
        "response": "Geelong Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Malfunkshun and Idlewild formed in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Tar Creek made in 2009 and The Story of Stuff a short animation about the lifecycle of material goods are what category of film?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Lights Down Low\" is a song written and recorded by American recording artist and reality television personality Jessie James Decker, the song, was inspired by Decker's relationship with her husband, who, which American football wide receiver for the Tennessee Titans of the National Football League (NFL)?",
        "response": "Eric Decker",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the public high school established in 1958 and located in a high shool district that more than 5000 students, grades 7-12 attend?",
        "response": "Sanford H. Calhoun High School",
        "source": "hotpot_qa"
    },
    {
        "query": "The Love You Take is a duet song that was featured on the soundtrack for the American Christmas comedy film, a modernization of Charles Dickens's \"A Christmas Carol\" released in what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the Suwannee Canal or the Ohio and Erie Canal connect to other canal systems in Pennsylvania?",
        "response": "Ohio and Erie Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "USS \"Atchison County\" was Named for counties in Kansas and Missouri established in honor of a senator who passed away in which year ?",
        "response": "1886",
        "source": "hotpot_qa"
    },
    {
        "query": "Clifford is the first name of which quarterback that played for the Green Bay Packers in 1977?",
        "response": "Lynn Dickey",
        "source": "hotpot_qa"
    },
    {
        "query": "What wife did George Harrison cheat on, who was also the first wife to Eric Clapton?",
        "response": "Pattie Boyd",
        "source": "hotpot_qa"
    },
    {
        "query": "Linfen and Bozhou, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event which occured first, Party Monster was produced, or Richie Rich was produced?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "The original intent of \"Batman: Gotham Knights\" was to feature the exploits of a fictional character created by who?",
        "response": "Bob Kane and Bill Finger",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Charity in the drama series \"Greenleaf\" is a member of a musical family from what city and state?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2009 Christian Sánchez was transferred to a football team owned by who?",
        "response": "Grupo Salinas",
        "source": "hotpot_qa"
    },
    {
        "query": "What TNT American fantasy-adventure did Christian Kane star on?",
        "response": "The Librarians",
        "source": "hotpot_qa"
    },
    {
        "query": "Good Scouts featured the voice of which actor, who also provided the voice of Daisy Duck?",
        "response": "Clarence Charles \"Ducky\" Nash",
        "source": "hotpot_qa"
    },
    {
        "query": "In what film does Jake Gyllenhaal play a coal miner's son, who gets inspired by the 1957 launch of \"Sputnik 1\", to take up rocketry?",
        "response": "October Sky",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the German initials of the party that included Käthe Leichter in its rolls?",
        "response": "SPÖ",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary Glen played for what professional football club based in Gorgie in the west of Edinburgh?",
        "response": "Heart of Midlothian Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "The Gifted is the third studio album by American rapper Wale, In 2008, Wale signed with Interscope Records for $1.3 million, and his debut album \"Attention Deficit\" was released in which year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "SimCity is a city-building and urban planning simulation massively multiplayer online game developed by Maxis, a subsidiary of which an American video game company headquartered in Redwood City, California?",
        "response": "Electronic Arts Inc. (EA)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the film in which the actress best known for her starring roles in Mistress America, plays a supporting role, along side Ben Affleck and Rosamund Pike?",
        "response": "Gillian Flynn",
        "source": "hotpot_qa"
    },
    {
        "query": "What ethnicity is the person James Newton Howard scored nine of his films for?",
        "response": "Indian American",
        "source": "hotpot_qa"
    },
    {
        "query": "Simone da Orsenigo was an Italian architect and builder of the 14th century, his name is on the list of masters working on which term, for an Italian cathedral church?  ",
        "response": "Duomo",
        "source": "hotpot_qa"
    },
    {
        "query": "America: Imagine the World Without Her is a 2014 American political documentary film by a man that was president of what school from 2010 to 2012?",
        "response": "The King's College",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Polynesian-themed resort and casino resort located on the Las Vegas Strip where Terry Fator headlines?",
        "response": "The Mirage",
        "source": "hotpot_qa"
    },
    {
        "query": "How many athletes competed in the event the Samsun Golf Course was made for?",
        "response": "3,148",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that created a keychain RFDI device created to allow electronic payment at McDonald's and 400 other Chicago area restaurants is headquartered in what city and state?",
        "response": "San Jose, California",
        "source": "hotpot_qa"
    },
    {
        "query": "John Hollar played college football at a university in which city ?",
        "response": "Boone, North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which guitarist played in the rock band Kansas?",
        "response": "Mike Slamer",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014-15 UMBC Retrievers men's basketball team were members of what Division 1 conference, whose members are located mainly in the Northeastern United States?",
        "response": "America East Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author was also a soul/jazz poet and musician, Susan Vreeland or Gil Scott-Heron?",
        "response": "Gilbert \"Gil\" Scott-Heron",
        "source": "hotpot_qa"
    },
    {
        "query": "David Kennedy, was an American film producer and talent agent, his work includes which 2012 American horror comedy film based on the gothic television soap opera of the same name, that was broadcast between 1966 and 1971?",
        "response": "Dark Shadows",
        "source": "hotpot_qa"
    },
    {
        "query": "Tulsi Gabbard, supporter of House Resolution 1227, resigned to endorse which politician in 2016?",
        "response": "Bernie Sanders",
        "source": "hotpot_qa"
    },
    {
        "query": "Ken Rich majored in philosophy at what private liberal arts college in Oberlin, Ohio?",
        "response": "Oberlin College",
        "source": "hotpot_qa"
    },
    {
        "query": "Osvaldo de León, is an American actor and model, since its inception with Televisa has participated in several soap operas such as Lo que la vida me robó, a Mexican telenovela produced by who for Televisa?",
        "response": "Angelli Nesma Medina",
        "source": "hotpot_qa"
    },
    {
        "query": "Does The Straight Story and Never a Dull Moment both Star Dick Van Dyke? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Syed Kalbe Hussain was from the capital of which Indian state?",
        "response": "Uttar Pradesh",
        "source": "hotpot_qa"
    },
    {
        "query": "What writer for the TV show \"Scrubs\" has also worked as a writer for the adult animated sitcom created by Aaron McGruder?",
        "response": "Angela R. Nissel",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the group that recorded \"Backstreet's Back\" formed?",
        "response": "Orlando, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog is based in Switzerland, Appenzeller Sennenhund or Drentse Patrijshond?",
        "response": "Appenzeller Sennenhund",
        "source": "hotpot_qa"
    },
    {
        "query": "Xenu was a dictator of a culture who brought people to earth in the spacecraft that was similar to one built by what company?",
        "response": "Douglas Aircraft Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Seth Savoy and Frank Henenlotter, have which mutual occupations?",
        "response": "film director and screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which castle is closer to Roslin in Midlothian, Scotland: Hawthornden Caslte or Roslon Castle?",
        "response": "Roslin Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both  Carleton University and University of Kansas located in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who organized the beauty pageant at which Hoyan Mok was the winner in 1993 ? ",
        "response": "TVB",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Dodecatheon and Bloomeria native to North America?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was created under a government act in 1920?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Naiad, who is a fictional water element, was created by John ostrander and Tom Mandrake who collaborated at what Database?",
        "response": "Grand Comics Database",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant grows further North, Zamia or Vallea?",
        "response": "Zamia",
        "source": "hotpot_qa"
    },
    {
        "query": "Kuach Garang Majok Jok is a footballer from a country that gained its independence in which year ?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Ron Haslam trains riders and racers at his Race School that is based at a motorsport circuit that is now owned by otorSport Vision, and the surrounding Donington Park Estate is under lease by MotorSport Vision until what year?",
        "response": "2038",
        "source": "hotpot_qa"
    },
    {
        "query": "BARGE, the Big August Rec.Gambling Excursion, is a yearly convention where well-known poker players who have participated either as speakers or players including poker player who has won a record of how many World Series of Poker bracelets?",
        "response": "fourteen",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the professional wrestling tag team composed of Glenn Gilbertti and Alex Wright?",
        "response": "The Dancing Fools",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is the game To Court the King similar to with its rolling and re-rolling of dice?",
        "response": "Yahtzee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university is private, Vanderbilt University or University of Oklahoma?",
        "response": "Vanderbilt University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1974 Hindi film stars an actor whose first lead film role was in the film \"Bobby\"?",
        "response": "Rishi Kapoor",
        "source": "hotpot_qa"
    },
    {
        "query": "What brother of Sharon Nazarian  is the founder of an entertainment group?",
        "response": "Sam Nazarian",
        "source": "hotpot_qa"
    },
    {
        "query": "What basketball star who played for the  Orlando Magic and Phoenix Suns stared in Blue chips with Shaquille O'Neal?",
        "response": "Anfernee Deon \"Penny\" Hardaway",
        "source": "hotpot_qa"
    },
    {
        "query": "What Academy Award winning producer was a model for Original Penguin?",
        "response": "Brad Pitt",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Diego Pizarro's older brother born?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Which TV show starring Samuel Page is an adaptation of a BBC miniseries. ",
        "response": "House of Cards",
        "source": "hotpot_qa"
    },
    {
        "query": "Louisburg is a city in which county located in east-central Kansas?",
        "response": "Miami County",
        "source": "hotpot_qa"
    },
    {
        "query": "In Resident Evil 5, which character investigates a terrorist threat while simultaneously looking for his missing younger sister, Claire?",
        "response": "Chris Redfield",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the network of cables with which Pacific Fibre's proposed trans-Pacific undersea cable was to have competed commissioned?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What 52-minute-long British surreal comedy television film starring the Beatles and Ivor Cutler aired on BBC1 in 1967?",
        "response": "Magical Mystery Tour",
        "source": "hotpot_qa"
    },
    {
        "query": "What cultural heritage does the director of the music videos for The xx most identify with?",
        "response": "Swedish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band became popular in the 1980s with their album \"Blow Your Cool!\": Sweethead or Hoodoo Gurus?",
        "response": "Hoodoo Gurus",
        "source": "hotpot_qa"
    },
    {
        "query": "Dennis Anderson attended a college that closed in what year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Did James Cruze and Raoul Walsh act and direct in silent films? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Shaming of the Sun was a studio album by which folk rock music duo?",
        "response": "Indigo Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was older, George Atzerodt or Andrew Johnson?",
        "response": "Andrew Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Death at the Dolphin is a detective novel by Ngaio Marsh; it is the twenty-fourth novel to feature Roderick Alleyn, and was first published in 1967, the plot centers on a glove once owned by Hamnet Shakespeare, Hamnet  was the only son of William Shakespeare and Anne Hathaway, and the fraternal twin of who?",
        "response": "Judith Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "Cliff Burwell's most popular composition was Sweet Lorraine, which had lyrics by what American lyricist that was born in 1900?",
        "response": "Mitchell Parish",
        "source": "hotpot_qa"
    },
    {
        "query": "What meat is traditionally in the Indonesian variation of Shumai?",
        "response": "\"tenggiri\" (wahoo) fish meat",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer won the Nobel Prize, William H. Gass or Naguib Mahfouz?",
        "response": "Naguib Mahfouz",
        "source": "hotpot_qa"
    },
    {
        "query": "What southern California based band covered Blue Öyster Cult's Godzilla?",
        "response": "Fu Manchu",
        "source": "hotpot_qa"
    },
    {
        "query": "Tell Me I'm Pretty is the fourth album by this band formed in what year",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Dee Snider or Brent Smith older?",
        "response": "Daniel \"Dee\" Snider",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer died later, Agatha Christie or Clement Greenberg?",
        "response": "Clement Greenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Dan Trueman studied physics at Carleton College in which city in Dakota and Rice counties in the State of Minnesota?",
        "response": "Northfield",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the elevation of the highest point of the highest peak through which Mount Washington Auto Road runs?",
        "response": "6288.2 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "What president of a brewing company located in Golden, Colorado, was also married to Holly Coors?",
        "response": "Joseph Coors",
        "source": "hotpot_qa"
    },
    {
        "query": "In which play kevin chamberlin acted as uncle fester also knownkas fester addams? ",
        "response": "The Addams Family\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What park are both Marias Pass and Summit Mountain around?",
        "response": "Glacier National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "The Manson Family, led by Charles Manson, murdered actress Sharon and four others in what part of the Beverly Crest, north of Beverly Hills, Los Angeles, California?",
        "response": "Benedict Canyon",
        "source": "hotpot_qa"
    },
    {
        "query": "What 15-minute-long ballet composed by Darius Milhaud was based on traditional beliefs and practices of African people?",
        "response": "La Création du monde",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Hymenocallis and Sinojackia connected?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter McCabe was the editor of which magazine that ceased publication in 2007 ?",
        "response": "Oui",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Josh Franceschi and Lars Frederiksen in the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "MLB Whiparound with Kenneth H. \"Ken\" Rosenthal airs on what network?",
        "response": "Fox Sports 1",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Tyree Henry is an American actor, in February 2017, Henry guest starred in which NBC TV series, created by Dan Fogelman that premiered on NBC on September 20, 2016?",
        "response": "This Is Us",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Robert Penn Warren and Studs Terkel have the same number of Pulitzer prizes?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed earlier, Hinder or The Fatima Mansions?",
        "response": "The Fatima Mansions",
        "source": "hotpot_qa"
    },
    {
        "query": "What British Conservative Party politician was a brother of Boris Johnson?",
        "response": "Jo Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who portrayed Rhett Butler in \"Gone with the Wind\" born?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the song by Kirko Bangz about drinking a concoction which includes a prescription-strength cough syrup used in a manner inconsistent with its labeling?",
        "response": "Sound M.O.B.",
        "source": "hotpot_qa"
    },
    {
        "query": "Pumpkin Ale is created by adding pumpkin flesh to what, a vital component in the fermentation process? ",
        "response": "Mash ingredients",
        "source": "hotpot_qa"
    },
    {
        "query": "Northeast Catholic College, is a non-profit, liberal arts, co-educational, four-year Catholic college located in Warner, a town in Merrimack County, New Hampshire, in which country? ",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Rigid frame airships were used by Germany to fly bombing raid over Great Britian in what war?",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the football and baseball coach of the  independent, national liberal arts college of around 1,692 students located in downtown Spartanburg?",
        "response": "Jim Brakefield",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the famous cinematographer involved in the making of the fifth film of the \"Hannibal Lecter\" franchise?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize was won for a book by a British author and illustrator from Dartmoor, focusing on futuristic steampunk London?",
        "response": "Nestlé Smarties Book Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Which scientific collaboration was established under the leadership of Barry Banish an American experimental physicist?",
        "response": "LIGO Scientific Collaboration",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the town that is near Butcher Hills in 2010?",
        "response": "332",
        "source": "hotpot_qa"
    },
    {
        "query": "Which number of Govenor of Alaska was Mama Grizzly ?",
        "response": "ninth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine founded in 1923 has made a shocking claim about the number of deaths of Nepali World cup workers?",
        "response": "Time",
        "source": "hotpot_qa"
    },
    {
        "query": "This song released on September 29, 1983 and inspired a hit song by Usher was written by who?",
        "response": "Billy Joel",
        "source": "hotpot_qa"
    },
    {
        "query": "John English and Dorothy Arzner, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    }
]