[
    {
        "query": "Were \"The Rape of Europa\" and \"Leading to War\" documentary both composed by the same author?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the racer for whom the bend at the 26th Milestone, Isle of Man is dedicated. When were they born?",
        "response": "25 February 1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Sleeper Agent or The Sounds from closer to Canada?",
        "response": "Sleeper Agent",
        "source": "hotpot_qa"
    },
    {
        "query": "Bruce Boa had a part in the 1987 film directed by whom?",
        "response": "Stanley Kubrick",
        "source": "hotpot_qa"
    },
    {
        "query": "Daisy Lowe is the daughter of the English musician and lead singer from what band?",
        "response": "Bush",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did a movie that starred both Nicholas Cage and Cher come out? ",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert G. Knight and Joan Finney both served in government positions for what state?",
        "response": "Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the WWF Intercontinental Champion who appeared in the six-man tax team match during In Your House 9: International Incident?",
        "response": "Anthony Norris",
        "source": "hotpot_qa"
    },
    {
        "query": "Hospital Daher is located in the capital of Brazil and seat of government of what area?",
        "response": "Federal District",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Madagascar and Daphniphyllum flowering plant species?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Adnan Akmal's brother that was born 26 May 1990?",
        "response": "Umar Akmal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2014 film in which the character Star-Lord appears?",
        "response": "James Gunn",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Neumann, is an Israeli self made billionaire founder, of which American company?",
        "response": "WeWork",
        "source": "hotpot_qa"
    },
    {
        "query": "What driver for the Andretti Autosport team used to drive for the Scuderia Toro Rosso team?",
        "response": "Scott Speed",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the actor who plays the biological father in the movie Daddy's Home?",
        "response": "June 5, 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the son of Geoffrey of Anjou and Matilda, daughter of Henry I of England, and had Anglo-Norman administrator and nobleman ewarded with a marriage to an heiress for his service?",
        "response": "Henry II",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Yangra and Tirich Mir are very tall points but which is the highest peak of the Hindu Kush range?",
        "response": "Tirich Mir",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1953 novel about a postliterate society?",
        "response": "Ray Bradbury",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the rappers who collaborated on the album \"Ghetto Therapy\" headlines the rap rock band SX-10?",
        "response": "Sen Dog",
        "source": "hotpot_qa"
    },
    {
        "query": "The official remix of Up! features a rapper who was shot how many times in 2000?",
        "response": "nine",
        "source": "hotpot_qa"
    },
    {
        "query": "What community were the founding members of Islander 23's rival gang from?",
        "response": "Victoria's South Sudanese community",
        "source": "hotpot_qa"
    },
    {
        "query": "The B-series automotive engines are sold concurrently with an engine used in the first-generation of what?",
        "response": "Integra",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the matches taking place in a title match combat-sport event, with professional wrestling pay-per-view?",
        "response": "card",
        "source": "hotpot_qa"
    },
    {
        "query": "What motion simulator attraction based on the successful \"Star Wars\" film series was Europe in the Air similar to?",
        "response": "\"Star Tours\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American artist, who also illustrated works by Bill Nye and George W. Peck, illustrated an 1876 novel by Mark Twain about a young boy growing up along the Mississippi River?",
        "response": "Truman W. \"True\" Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the professional stage debut of the actress who played Ann in \"The Turn of the Screw\"?",
        "response": "His Dark Materials",
        "source": "hotpot_qa"
    },
    {
        "query": "Which american entertainer, known for his dedication to fundraising and charity, made his debut at the Copacabana?",
        "response": "Danny Thomas",
        "source": "hotpot_qa"
    },
    {
        "query": "\"One Man Band\" ceased publication when?",
        "response": "November 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two artists, Charles Amirkhanian or Katherine Sarafian, is a producer within Pixar.",
        "response": "Katherine Marianne Sarafian",
        "source": "hotpot_qa"
    },
    {
        "query": "What genetic material does James Watson and Rosalind Franklin have in common?",
        "response": "DNA",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexey Dmitrievich Tereshkov fought in the Spanish Civil War and was commander of the 413th Rifle division after an invasion of what country during World War II?",
        "response": "Soviet Union",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-wrote the 1971 British comedy film \"On the Buses\"?",
        "response": "Geoff Unwin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director, Stephan Elliott or Keri Collins, is a BAFTA winning director?",
        "response": "Keri Collins",
        "source": "hotpot_qa"
    },
    {
        "query": "Women's Health and Fucsia, are which type of literary media?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Schmalturm turret was a tank turret designed for use on the Panzer V Ausf, the Panther was a German medium tank deployed during which time period, on the Eastern and Western Fronts in Europe from mid-1943 to its end in 1945?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player is from the United States, Shelby Cannon or Pierre-Hugues Herbert?",
        "response": "Shelby Cannon",
        "source": "hotpot_qa"
    },
    {
        "query": "A Town Has Turned to Dust is a film written by a man that also narrated what science-fiction anthology TV series?",
        "response": "The Twilight Zone",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Daviesia and Agrimonia in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Forward Films production starred the actor who played Lucius Malfoy?",
        "response": "Skeletons",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, John Carpenter or Urszula Urbaniak?",
        "response": "John Howard Carpenter",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Fair Oaks Mall located?",
        "response": "Fairfax County, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American actor, director, screenwriter and producer best known for A Christmas Story and director of Black Christmas?",
        "response": "August 5, 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Which episode of \"Will & Grace\" included an actress that was also on \"Charmed\"?",
        "response": "\"Grace, Replaced\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What shape are the games that are similar to My Little Flufties?",
        "response": "egg-shaped",
        "source": "hotpot_qa"
    },
    {
        "query": "Mariana Kovacevic has treated the defensive midfielder for which Turkish club?",
        "response": "Galatasaray",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rocket propelled weapon, sometimes referred to as the \"Stovepipe,\" did Colonel Leslie Alfred Skinner help develop?",
        "response": "Bazooka",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Willi Forst and William Nigh both actors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the town that Geoffrey Hendricks was born in?",
        "response": "5,928",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation Inherent Resolve (OIR) is the U.S. military's operational name for the military intervention against the Islamic State of Iraq and Syria (ISIS, in the vernacular, Daesh), including both the campaign in Iraq and the campaign in Syria, which terminology is used to define the timeline of United States government military operations is based on the Committee on International Relations (now known as the U.S. House Committee on Foreign Affairs)?",
        "response": "timeline of United States government military operations",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was \"The Gift of Love: A Christmas Story\"'s actor Polly Holliday born in?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Were either Stefan Zweig or Agatha Christie Chinese novelists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Douglas Daniel Clark convicted of a series of killings in Los Angeles? Answer: 1980",
        "response": "1980",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the colony William Bradford was governor of founded?",
        "response": "1620",
        "source": "hotpot_qa"
    },
    {
        "query": "Which independent publisher founded in 1993 by Jeffrey Thomas publishes horror, science-fiction, and dark fantasy?",
        "response": "Necropolitan Press",
        "source": "hotpot_qa"
    },
    {
        "query": "David Whatton QPM, a retired British senior police officer, was the Chief Constable of a territorial police force responsible for policing the English unitary authorities of Cheshire East, Cheshire West and Chester, Halton (including Runcorn, and Widnes) and what other authority?",
        "response": "Warrington",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did Mark Bonnar play in a video game released on October 21, 2016?",
        "response": "Townsend",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 2007 British television film \"Coming Down The Mountain\" and authored a 2003 mystery novel based on Arthur Conan Doyle's short story \"Silver Blaze\"?",
        "response": "Mark Haddon",
        "source": "hotpot_qa"
    },
    {
        "query": "Between David Draiman and Dubstar who is known for their distorted voice and percussive singing style?",
        "response": "David Michael Draiman",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dirty Dozen: Next Mission is a made-for-TV film and sequel to the original \"Dirty Dozen\", directed by Andrew V. McLaglen and reuniting which American film and television actor, with Ernest Borgnine and Richard Jaeckel 18 years after the original hit war film?",
        "response": "Lee Marvin",
        "source": "hotpot_qa"
    },
    {
        "query": "Jordy van Egmond, professionally known by his stage name Dyro, is a Dutch DJ and EDM producer, he has also released official remixes for tracks such as which song by Barbadian recording artist Rihanna from her seventh studio album, \"Unapologetic\" (2012)?",
        "response": "Right Now",
        "source": "hotpot_qa"
    },
    {
        "query": "How many test centuries did the grandfather of Fabian Cowdrey make for England ?",
        "response": "22",
        "source": "hotpot_qa"
    },
    {
        "query": "Maxeda has been owned since 2004 by which American multinational equity firm?",
        "response": "KKR & Co",
        "source": "hotpot_qa"
    },
    {
        "query": "Joran van der sloot ,the killer of Stephany Flores Ramirez, is also suspected of killing what woman featured in a Lifetime Network movie?",
        "response": "Natalee Holloway",
        "source": "hotpot_qa"
    },
    {
        "query": "Live on BBC Radio 1 is a live EP by the American rock band Touché Amoré, vocalist Jeremy Bolm said recording with BBC was an honor and spoke about the storied there, \"where The Smiths\" had played, The Smiths were an English rock band formed in which city, in 1982?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, “Muslim Girl,”or The Woman Voter,” was published first?",
        "response": "The Woman Voter",
        "source": "hotpot_qa"
    },
    {
        "query": "Hank Azaria joined what cartoon as a voice actor 10 years before acting in Mystery Men?",
        "response": "\"The Simpsons\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Roger Corman and Julien Temple the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack \"Jackie\" Earle Haley (born July 14, 1961) is an American film and television actor, His earliest roles included Kelly Leak in which 1976 American sports comedy film, directed by Michael Ritchie?",
        "response": "The Bad News Bears",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1979 comedy film stars an actor who is also a poker commentator in real life?",
        "response": "Fast Break",
        "source": "hotpot_qa"
    },
    {
        "query": "Which intergovernmental military alliance signed in 1949 are Denmark and the Netherlands both members of? ",
        "response": "NATO",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city is this National Register of Historic Place of this bank president and owner of a local hardware store whose uncle fought in the American Civil War, Indian Wars, and the Spanish–American War located?",
        "response": "Miles City, Montana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the video for the Beyoncé song featured on the 2016 album \"Lemonade\" and written by Khalif Brown?",
        "response": "Melina Matsoukas",
        "source": "hotpot_qa"
    },
    {
        "query": "Virginia State Route 160 runs atop the highest mountain peak in Kentucky, which has what elevation level?",
        "response": "4145 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "The music program \"Yesterday\" was named after a song from what Beatles album?",
        "response": "Help!",
        "source": "hotpot_qa"
    },
    {
        "query": "Erinn Hayes starred in the first season of a CBS sitcom that premiered in what year ?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the code name for a German assault during WWII that was the invasion of Denmark and Norway in April 1940?",
        "response": "Weserübung",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2013 McDowell's No.1 Celebration became the largest selling rum in India after overtaking  an iconic vatted Indian dark rum blended and aged for a minimum of how many years?",
        "response": "7",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of ricky lamar hawk who released the debut single \"watch me (whip/nae nae)\"",
        "response": "Silentó",
        "source": "hotpot_qa"
    },
    {
        "query": "What company published the video game for which \"I'll Keep Coming\" and \"Easy Way Out\" by Low Roar were featured as trailer music?",
        "response": "Sony Interactive Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the ghost lights found east of the county seat of Presidio County, Texas?",
        "response": "Marfa lights",
        "source": "hotpot_qa"
    },
    {
        "query": "Susan Ofori-Atta was the first to earn a degree in what track based on essential skills?",
        "response": "liberal arts",
        "source": "hotpot_qa"
    },
    {
        "query": "Orlando Pride play their home games at the stadium that was completed in time for the first home game on which 2017 date?",
        "response": "March 5",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Rathgeber plays for what reserve team of German association football club?",
        "response": "FC Schalke 04 II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released earlier, Unidentified Flying Oddball or Do Dooni Chaar?",
        "response": "Unidentified Flying Oddball",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean-Pierre Kohut-Svelko is a production designer and art director and the winner of a national film award of Francewhich was first awarded in what year?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "1984 Prize of Moscow News had a winner of the Olympics in what future year?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Ayandeh Bank, which offers retail and commercial services such as accepting deposits, making business loans, and offering basic investment products, was established in which city?",
        "response": "Tehran",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Kiri Sings Karl vocalist was born in 1944 and is a New Zealand soprano?",
        "response": "Kiri Te Kanawa",
        "source": "hotpot_qa"
    },
    {
        "query": "The creek of which Paradise Creek is a tributary is a tributary of what river?",
        "response": "Delaware River",
        "source": "hotpot_qa"
    },
    {
        "query": "In what language are the songs in the genre for which Alberto Stylee is most famous typically sung?",
        "response": "Spanish",
        "source": "hotpot_qa"
    },
    {
        "query": "Aboke was the site of the abductions by what heterodox Christian cult?",
        "response": "Lord's Resistance Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pizza chain is located in the San Francisco Bay Area, Dion's or Patxi's Chicago Pizza?",
        "response": "Patxi's",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the company, who operated Slick Mine No. 91 after 1923, begin operations?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian American business executive worked on Micromax Canvas A1?",
        "response": "Sundar Pichai",
        "source": "hotpot_qa"
    },
    {
        "query": "In what direction does the U.S. highway that connects Florence, Souther Carolina and the county seat of Richland County run?",
        "response": "east–west",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Denmark honour awarded Ernst Albrecht von Eberstein was given by an order that did not hold official status until 1693?",
        "response": "Order of the Elephant",
        "source": "hotpot_qa"
    },
    {
        "query": "The current holder of The Professional Footballers' Association Players' Player of the Year award is a French professional footballer who plays what position?",
        "response": "defensive midfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "Radio Iodine and No Doubt are both bands in what music genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tabernaemontana and Caltha both genus of flowering plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2009 Insight Bowl was the 21st edition of the college football bowl game, played at Sun Devil Stadium in Tempe, Arizona, the game matched the Iowa State Cyclones which football team represented Iowa State University in the 2009 NCAA Division I FBS football season?",
        "response": "2009 Iowa State Cyclones football team",
        "source": "hotpot_qa"
    },
    {
        "query": "In what League does the club Sheik Mohamed Fankaty Dabo is on loan from play?",
        "response": "Premier League",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is based on a book by John Michael Green and was directed by Josh Boone?",
        "response": "The Fault in Our Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "Viliami Veasiʻi Veikune is a nobel from a Polynesian sovereign state and archipelago comprised of how many islands?",
        "response": "169",
        "source": "hotpot_qa"
    },
    {
        "query": "Thirumalai Thenkumar had music by which classical violinist?",
        "response": "Kunnakudi Vaidyanathan",
        "source": "hotpot_qa"
    },
    {
        "query": "On which Taylor Swift album can one find the song featured on Now That's What I Call Music! 56 alongside See You Again by Wiz Khalifa?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the player who debuted in the 1973–74 Houston Aeros season?",
        "response": "Mr. Hockey",
        "source": "hotpot_qa"
    },
    {
        "query": "An cricket star who played a supporting role in the film Sinhawalokanaya was a former captain of which cricket team?",
        "response": "Sri Lanka national cricket team",
        "source": "hotpot_qa"
    },
    {
        "query": "Who passed away first, Eudora Welty or Walker Percy ?",
        "response": "Walker Percy",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the station that featured maintenance depot Grimsby engine shed?",
        "response": "North East Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 population of the city that is home to the McLellan House?",
        "response": "16,381",
        "source": "hotpot_qa"
    },
    {
        "query": "Thiruvendran Vignarajah is the lead attorney in the post-conviction appeal of a murderer whose victim attended what high school?",
        "response": "Woodlawn High School",
        "source": "hotpot_qa"
    },
    {
        "query": "The Presbytère is an architecturally important building in the French Quarter of New Orleans, Louisiana which stands facing what  National Historic Landmark?",
        "response": "Jackson Square",
        "source": "hotpot_qa"
    },
    {
        "query": "Louis MacNeice was part of the Auden Group that included the father of what actor?",
        "response": "Daniel Day-Lewis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mother of the head of the House of Saud?",
        "response": "Hussa bint Ahmed Al Sudairi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which channel featured a show with Joe Tracini and laucnhed in 2000?",
        "response": "Boomerang",
        "source": "hotpot_qa"
    },
    {
        "query": "Who appears in \"Deadpool\" 2016 and is also one of the hosts of the American game show \"Fantasy\"?",
        "response": "Leslie Uggams",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Affenpinscher and Villanuco de Las Encartaciones both breeds of dog?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the libretto's of The Turn of the Screw and The Bartered Bride by the same person?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American film director directed music videos and released a dance film in 2014?",
        "response": "Trish Sie",
        "source": "hotpot_qa"
    },
    {
        "query": "when did the king whom John Russell's Regiment of Guards formed following the restoration of born?",
        "response": "29 May 1630",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the British and Irish Lions lose to the year Mike Blair toured with the rugby team?",
        "response": "South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player, Pieter Aldrich or Fred Stolle,  is the father of former Australian Davis Cup player Sandon Stolle?",
        "response": "Frederick Sydney Stolle",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a creator of a science-fiction role-playing game along with Phil McGregor and an American game designer, notable for his work on \"Space Marines\" ?",
        "response": "Edward E. Simbalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director was French, Derek Jarman or Michel Deville?",
        "response": "Michel Deville",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team did the head coach who resigned early in the season of The 2005–06 Miami Heat season go on to coach from 2007 to 2012?",
        "response": "Orlando Magic",
        "source": "hotpot_qa"
    },
    {
        "query": "Haringey Heartlands is located west of a large shopping centre and residential complex that is still referred to by what former name?",
        "response": "Wood Green Shopping City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the tall tower where John Cotton accepted a position of minister in 1612?",
        "response": "Boston Stump",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Lancaster Cathedral and Peel Cathedral belong to the Catholic religion?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which province in Portugal contains inscriptions dedicated to Dercetius? ",
        "response": "Lusitania",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Hemingway's publisher for the novel that brought the festival of San Fermin to the attention of English speakers?",
        "response": "Scribner's",
        "source": "hotpot_qa"
    },
    {
        "query": "Bozhou and Xuanwei, is in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the author of \"The Dream of Rome\" born? ",
        "response": "19 June 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the former Hong Kong singer and model who starred in The Gâteau Affairs? ",
        "response": "Bobo Chan",
        "source": "hotpot_qa"
    },
    {
        "query": "Evelin Ilves was the second wife of which Estonian President, who served from 2006 to 2016?",
        "response": "Toomas Hendrik Ilves",
        "source": "hotpot_qa"
    },
    {
        "query": "Harry Brown starred what English actor who was born in Derby and trained at the Central Junior Television Workshop?",
        "response": "Jack O'Connell",
        "source": "hotpot_qa"
    },
    {
        "query": "Chronicle of a Death Foretold stars an actress of what nationality?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Australian screenwriter, producer, director and actor born who screenplay the Saw III?",
        "response": "17 January 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "What date in 2010 was a South Korean film starring  Kim Hyang-gi released?",
        "response": "January 14, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Patricio Guzmán and Marshall Neilan work on the movie \"The Battle of Chile?\"",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did Shannon Elizabeth Fadal sing in London?",
        "response": "Catch a Christmas Star",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that premiered at The Bagdad Theatre in 1975?",
        "response": "Miloš Forman",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the university founded that Kyle Hartzell graduated from in 2007?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "Samantha Sainte-Claire Ponder, is an American sportscaster from Phoenix, Arizona who is currently the host of Sunday NFL Countdown on ESPN, Ponder replaced Erin Andrews, on which TV show?",
        "response": "College GameDay",
        "source": "hotpot_qa"
    },
    {
        "query": "Why star of The Belle of New York Dies in August of 1981?",
        "response": "Vera-Ellen",
        "source": "hotpot_qa"
    },
    {
        "query": "What Argentinian retired defensive midfielder, and current manager of C.D. Guadalajara, was traded to Parma alongside Sérgio Conçeicão at the end of the 1999–2000 season? ",
        "response": "Matías Jesús Almeyda",
        "source": "hotpot_qa"
    },
    {
        "query": "Which DC comics fictional character is played by Sirena Irwin using only voice?",
        "response": "Mera",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the Multnomah tribe call this region, which is near the northern range of this plant Lilium washingtonianum?",
        "response": "Wy'east",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist that co-founded a band with David Knopfler also played with the group Brewers Droop?",
        "response": "Mark Freuder Knopfler",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1962 United States Senate election in New York was held on which date, incumbent Republican U.S. Senator Jacob Javits won against Democratic challenger James B. Donovan?",
        "response": "November 6, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "In which language is the notable song by Suresh Peters from \"Gentleman \"?",
        "response": "Tamil",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the ice hockey team that drafted Garrett Wilson in 2009 founded?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Air Chief Marshal Hugh Caswall Tremenheere Dowding was unwillingly replaced in command by a senior commander in the Royal Air Force born on what date?",
        "response": "23 December 1893",
        "source": "hotpot_qa"
    },
    {
        "query": "The type of the novel the 2012 American coming-of-age drama film The Perks of Being a Wallflower is based on is a novel written in what form?",
        "response": "a series of documents",
        "source": "hotpot_qa"
    },
    {
        "query": "This American author and politician, with the policy advisor Mike Schofield, served as the 47th governor of what state?",
        "response": "Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Hong Kong singer and actress that starred with Nicholas Tse, Edison Chen, and Simon Yam in the film \"Moving Targets\" born?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director was born first, Albert Capellani or Walerian Borowczyk?",
        "response": "Albert Capellani",
        "source": "hotpot_qa"
    },
    {
        "query": "Georgina Campbell won the British Academy Television Award for Best Actress in 2015 for her role along side which actor ?",
        "response": "Royce Pierreson",
        "source": "hotpot_qa"
    },
    {
        "query": "Both the Greeneville Astros and Tusculum College were located in what city?",
        "response": "Tusculum, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this President of Egypt, who was assassinated and for who Tahseen Bashir served as a confident and spokesman?",
        "response": "Anwar Sadat",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Folger's grandson was known for inventing what?",
        "response": "lightning rod, bifocals, and the Franklin stove",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Jim Ryan and Rod Blagojevich have in common?",
        "response": "American politician",
        "source": "hotpot_qa"
    },
    {
        "query": "Which light rail system would one use to visit the museum that explores the impact of modern conflicts on people and society?",
        "response": "Greater Manchester's Metrolink",
        "source": "hotpot_qa"
    },
    {
        "query": "The fast-food restaurant chain that sells the Baconator sandwich was founded by who?",
        "response": "Dave Thomas",
        "source": "hotpot_qa"
    },
    {
        "query": "John Severin was an American comics artist who had a 45 year stint with the magazine Cracked that was founded in what year?",
        "response": "1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Olivia Hack has done voicework for what American animated television services created by Scott M. Gimple",
        "response": "Fillmore!",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth name of The actor who stars as Patrick \"Lights\" Leary in the drama series Lights out ?",
        "response": "Holt Quinn McAloney",
        "source": "hotpot_qa"
    },
    {
        "query": "Franklin Delano Roosevelt Wakefield, is an innovative American player, of which instrument, in the bluegrass music style, Wakefield is known for his collaborations with a number of important and well-known bands, including The Stanley Brothers?",
        "response": "mandolin",
        "source": "hotpot_qa"
    },
    {
        "query": "Cierra Alexa Ramírez  is an American actress best known for her role in a television series created by who?",
        "response": "Peter Paige and Bradley Bredeweg",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Informe Robinson who was hosted by a Former Republic of Ireland football player Michael Robinson who also played as a striker?",
        "response": "is a monthly Spanish sports magazine programme broadcast",
        "source": "hotpot_qa"
    },
    {
        "query": "What Operatic Singing group did Nathan Lane almost become a member of in Encore! Encore!?",
        "response": "The Three Tenors",
        "source": "hotpot_qa"
    },
    {
        "query": "What composer in Muse was born in 1925?",
        "response": "Vladimir Shainsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the winning coach in the 2009 Big 12 Championship Game?",
        "response": "Mack Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shore does the castle, which Sir James Montgomery, 4th Baronet is the tenth laird of, stand?",
        "response": "Firth of Clyde",
        "source": "hotpot_qa"
    },
    {
        "query": "What Player Draft was held at Gaddafi Stadium and initial squads were finalised in Decenber 2015?",
        "response": "2016 Pakistan Super League players draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Julia Kaye (born June 15, 1988) is an American artist and illustrator, Kaye currently works on which upcoming Disney Television Animation show, formerly known as \"Country Club\"?",
        "response": "Big City Greens",
        "source": "hotpot_qa"
    },
    {
        "query": "In which U.S. state are MedStar Georgetown University Hospital and Providence Hospital?",
        "response": "District of Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is a pizza restaurant chain criticized by Stealing Share headquartered?",
        "response": "Ann Arbor, Michigan, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tale became source material for the character of \"Othello\" whom Iago plots to convince Othello that his wife is having an affair with?",
        "response": "Un Capitano Moro",
        "source": "hotpot_qa"
    },
    {
        "query": "What American professional basketball team is Rodney Dent a part of?",
        "response": "The Orlando Magic",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of both an american physician and retired astronaut, who was staked by Margaret Mary \"Peggy\" Ray?",
        "response": "Story Musgrave",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Kesha song that was at one point the best-selling digital single in history and parodied by the group The Midnight Beast?",
        "response": "Tik Tok",
        "source": "hotpot_qa"
    },
    {
        "query": "Constance Ortmayer designed the coin that was first struck in what year?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year is was the director of the movie that Michael Tarn is best known for born?",
        "response": "1928",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a provincial capital, Zhengzhou or Huangzhou District?",
        "response": "Zhengzhou",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation was shared by Rudolph Polk and Joseph Santley?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "What instrument does Duff McKagan play on Macy Gray's single, Kissed It?",
        "response": "bass",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hans Fallada and John Buchan both from the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British-Pakistani actor starred in a 2010 British satirical dark comedy film directed by Chris Morris?",
        "response": "Rizwan Ahmed",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who portrayed Mark McCormick in \"Santa Barbara\" from November 14, 1985 to July 30, 1986 born?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a solo album released, Nell Sigland or Ben Gibbard?",
        "response": "Benjamin Gibbard",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the namesake of Fermiite win the Nobel Prize?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "What  large family car produced by by the German automaker Volkswagen, is the middle of two other cars one being  small family car marketed worldwide across seven generations, in various body configurations and under various nameplates ?",
        "response": "Volkswagen Passat",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the oldest among Vicente García and Ximena Sariñana?",
        "response": "March 30, 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, Asimov's Science Fiction or Game Informer?",
        "response": "Game Informer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine Me Naiset or Marie Claire is published more frequently ?",
        "response": "Me Naiset",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state was populated by the expanse of the Oregon Trail, which can also be found in the Palouse region of the United States?",
        "response": "Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Pietro Abbati Marescotti taught mathematics in what comune on the south side of the Po Valley?",
        "response": "Modena",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the monarch at the time, the play in which Jack Whitam played Lennox, was written ?",
        "response": "James I,",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Less Than Jake and Wheatus connected?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who the film \"The Chosen\" is based on the murder of was born on what date?",
        "response": "7 November 1879",
        "source": "hotpot_qa"
    },
    {
        "query": "Low and Creed, are an American group of which common genre?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "What hill is named for the catamount?",
        "response": "Panguipulli",
        "source": "hotpot_qa"
    },
    {
        "query": "Capt. Denver Vernon Truelove took part in what raid on the Japanese capital Tokyo on Saturday, April 18, 1942.",
        "response": "Doolittle Raid",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the masks that Bill Johnson's character in the 1986 horror film made of?",
        "response": "human skin",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Realm of the Unreal\" is a short story by a Civil War soldier, of which nationality, wit, and writer Ambrose Bierce?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which type of Elf is mentioned in The Tale of Beren and Luthien?",
        "response": "Beren as a Noldorin elf",
        "source": "hotpot_qa"
    },
    {
        "query": "Dewey Selmon is the brother to the college football player who played for what university?",
        "response": "University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is based off of more stories, Bedknobs and Broomsticks or The Little Mermaid",
        "response": "Bedknobs and Broomsticks",
        "source": "hotpot_qa"
    },
    {
        "query": "Chara is a Japanese bi-monthly magazine of what type of genre that focuses on romantic or sexual relationships between male characters?",
        "response": "Yaoi",
        "source": "hotpot_qa"
    },
    {
        "query": "Perro de Presa Canario and Finnish Spitz, are a breed of what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "The three-member South Korean boy band, High4, released in 2014 a song they collaborated with which South Korean singer, songwriter and actress who signed with LOEN Entertainment in 2007?",
        "response": "IU",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company is based in Kentucky, Vocelli Pizza or Fazoli's?",
        "response": "Fazoli's",
        "source": "hotpot_qa"
    },
    {
        "query": "Java and Twister, are what type of entertainment?",
        "response": "game",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed first, Duran Duran or The Fratellis?",
        "response": "Duran Duran",
        "source": "hotpot_qa"
    },
    {
        "query": "What court case involved a former president of Fédération Internationale de l'Automobile?",
        "response": "Mosley v United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Günter \"Bobby\" Klass was a factory driver for a company that has been successful in many branches of motorsport of which most have been in what?",
        "response": "long distance races",
        "source": "hotpot_qa"
    },
    {
        "query": "Leica M7 is a model designed by the company of what nationality?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wisconsin Athletic Hall of Fame has honored the MLB right fielder who is now the senior VP of what team?",
        "response": "Atlanta Braves",
        "source": "hotpot_qa"
    },
    {
        "query": "The Congress of Afrikan people which later became the Revolutionary Communist League was lead by an African-American writer who recieved the PAN Open Book Award in 2008 for what?",
        "response": "Tales of the Out and the Gone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which judge of the show 'Internet Icon' was born on June 6, 1990 ?",
        "response": "Ryan Higa",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Skin and Laura Stoica both sing?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Michael Hutchence or Attila Csihar?",
        "response": "Michael Kelland John Hutchence",
        "source": "hotpot_qa"
    },
    {
        "query": "How many counties are there on the Island where the 2009 United States Open Championship was held ?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jessica Simpson Collection initially launched in 2006 as a shoe collaboration with a man born in what year?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musican is part of the band Memphis May Fire, Matty Mullins or Steve Winwood?",
        "response": "Matty Mullins",
        "source": "hotpot_qa"
    },
    {
        "query": "Which midfielder for Manchester United was featured on 5 Magazine?",
        "response": "Juan Mata",
        "source": "hotpot_qa"
    },
    {
        "query": "How many days did Nerdland, starring Chicago-born Hannibal Burress, screen before it was released to video in 2017?",
        "response": "one night",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released first, Born Rich or Werner Herzog Eats His Shoe?",
        "response": "Werner Herzog Eats His Shoe",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the plane that the Vought XF8U-3 Crusader II was designed to compete against enter service with the U.S. Navy?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mother of Mary Robinson in Shakespeare's \"The Winter's Tale\"",
        "response": "Leontes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dr. Abdul Razak al-Hashimi was a senior advisor to a leader that died in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Third Reich's best defensive tactical commander plan Operation Herbstnebel?",
        "response": "1944",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Ministry or Dubstar?",
        "response": "Ministry",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Brave New Films founded by Robert Greenwald or Alexander Kluge, a German author and film director?",
        "response": "Robert Greenwald",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American singer and songwriter, known for blending traditional honky tonk and mainstream country sounds, also appeared in the American televisual special My Night at the Grammys?",
        "response": "Alan Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the gang that the authors of \"Our Story\" were involved with?",
        "response": "the Firm",
        "source": "hotpot_qa"
    },
    {
        "query": "What took place first, Battle of Antietam or Battle of Luzon?",
        "response": "Battle of Antietam",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the the basketball player who retired after the 1990-91 Utah Jazz season?",
        "response": "Dr. Dunkenstein",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth name of the producer of \"Here I Go\"?",
        "response": "Ernest Dion Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Bruce Chatwin or Nalini Prava Deka?",
        "response": "Nalini Prava Deka",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the large city in the Canadian province of Saskatchewan, where J.D. McAskill served as mayor? ",
        "response": "Saskatoon",
        "source": "hotpot_qa"
    },
    {
        "query": "Drive Setup allows formatting in what Apple file system?",
        "response": "HFS+",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of The Art of Thinking born?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Hunger Strike\" is a song by a band that formed in which city ?",
        "response": "Seattle",
        "source": "hotpot_qa"
    },
    {
        "query": "Little Nellie 007 is a book by an English military historian and author, who specializes in what?",
        "response": "airfields and aircraft",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the team who won the 2009–10 UEFA Europa League play?",
        "response": "La Liga",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the home stadium of this team in the Federal Hockey League, which Adam McKenzie is currently a member of?",
        "response": "Hara Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2003 Grégory Levasseur film released in the United Kingdom as?",
        "response": "Switchblade Romance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American rapper produced the single 'Sky's the Limit' on an album released in 1997 on Bad Boy Records and Arista Records?",
        "response": "The Notorious B.I.G.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant consists of more species and is native to over 7 different countries, Arachnis or Callistephus?",
        "response": "Arachnis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the comedy film which was written by Tina Fey and based on a book by American parenting educator Rosalind Wiseman?",
        "response": "Mark Waters",
        "source": "hotpot_qa"
    },
    {
        "query": "Samuel E. Wright voiced Kron the Iguanodon in a film produced by what companies?",
        "response": "Walt Disney Feature Animation and The Secret Lab",
        "source": "hotpot_qa"
    },
    {
        "query": "Margaret Dymoke was a lady-in-waiting in the court of the king who ruled England beginning in what year?",
        "response": "1509",
        "source": "hotpot_qa"
    },
    {
        "query": "Overland Park Police Department is located in which most populous Kansas county?",
        "response": "Johnson County",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Radiohead's sixth studio album that was influenced by alternative rock instrumentation with drum machines, synthesisers, and digital manipulation and featured the single \"Go to Sleep\"?",
        "response": "Hail to the Thief",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan H. Juran was he brother of a quality guru born in which year ?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Trilochanapala, last king of the Kabul Shahi dynasty, ruled in the site of which modern country?",
        "response": "Afghanistan",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the alternative names for the hall mentioned in a work of satire by Mark Twain published by the Economist Press in 1901? ",
        "response": "the Society of St. Tammany, the Sons of St. Tammany, or the Columbian Order",
        "source": "hotpot_qa"
    },
    {
        "query": "Åsane Seahawks is an American football and cheerleading team in Norway, that borrowed their name and logo from the NFL team that joined in what year as an expansion team?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "The HMS \"Leopard\" served during what war that was categorised into five conflicts with each one termed after the coalition fought?",
        "response": "Napoleonic Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was created first, Bailout! The Game or Dark Tower?",
        "response": "Dark Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members in their original line-up, Ben Folds Five or Lo-Pro?",
        "response": "Ben Folds Five",
        "source": "hotpot_qa"
    },
    {
        "query": "Karen Maruyama acted in which American sitcom created by Mitchell Hurwitz?",
        "response": "Arrested Development",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Mary Collins and Michael Moore who is the director and producer of \"Fahrenheit 9/11\" (2004)?",
        "response": "Michael Francis Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the eleventh album produced by Iron Maiden that featured Blaze Bayley as vocalist on the hit Futureal? ",
        "response": "Virtual XI",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has the highest scope of work in Philip José Farmer or Francis Ponge ",
        "response": "Francis Jean Gaston Alfred Ponge",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the company who bought Manuel D. Medina's Terremark based? ",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city, commonly referred to as \"the District\", showed a play from January 19-24, 1931 at the National Theatre entitled Green Grow the Lilacs? ",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Gottlieb Heileman took a track for business that was unlike which St. Louis, Missouri-based competitor?",
        "response": "Anheuser-Busch",
        "source": "hotpot_qa"
    },
    {
        "query": "The band who created an international number one hit in 1979 had that song covered in 1995 by was band?",
        "response": "Victrola",
        "source": "hotpot_qa"
    },
    {
        "query": "Approximately how many students are in the university in which Robert Kirthwood was the pioneer financial officer?",
        "response": "2,800",
        "source": "hotpot_qa"
    },
    {
        "query": "Extract starred what American actress who is known for her work on Saturday Night Live from 2005-2012?",
        "response": "Kristen Carroll Wiig",
        "source": "hotpot_qa"
    },
    {
        "query": "What American singer worked with Bill DeLoach?",
        "response": "Danny Gans",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city is the headquarters of of Philip Morris USA?",
        "response": "Henrico County, Virginia.",
        "source": "hotpot_qa"
    },
    {
        "query": "What Guiness World Record is held by the actor who stars as \"Jack\" in a series created by Jim O'Doherty?.",
        "response": "youngest TV director ever",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-founded Prospect Park and is also the CEO of The Firm in Santa Monica?",
        "response": "Jeff Kwatinetz",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the politician who preceded Robert Jenrick and needed to resign twice?",
        "response": "Patrick Mercer",
        "source": "hotpot_qa"
    },
    {
        "query": " The Guelphic Legion was a paramilitary unit maintained at the expense of a king whose reign was ended by what?",
        "response": "the Unification of Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airplane was this Major test-flying after whom the base, that 514th Flight Test Squadron is stated at, is named?",
        "response": "B-17 Flying Fortress bomber",
        "source": "hotpot_qa"
    },
    {
        "query": "Yankee Sullivan lost a fight to the bare-knuckle boxer who went by what nickname?",
        "response": "Old Smoke",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the politician who represents Hatch Lane Ward first elected to office?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Natalia Rom was born in the same city as another Opera singer who passed away in which year ?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Aamras is the pulp of the fruit that belongs to what genus?",
        "response": "Mangifera",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Stripped\" is Depeche Mode's fifteenth UK single, released on 10 February 1986, the first single from which album, that's the fifth studio album by English electronic music band Depeche Mode, released on 17 March 1986 by Mute Records?",
        "response": "Black Celebration",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer did not participate in the song \"We Are the World\" for Africa in 1985 but instead donated \"4 the Tears in Your Eyes\"?",
        "response": "Prince",
        "source": "hotpot_qa"
    },
    {
        "query": "Does University of Arkansas have less students than California State University, Fullerton? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the made for television film in which the holder of the Miss World America 1972 title starred?",
        "response": "Alan J. Levi",
        "source": "hotpot_qa"
    },
    {
        "query": "Metal Flowers Media, LLC is a casting company for unscripted programming and reality television based in Hollywood, California with a branch office in Boulder, Colorado, Metal Flowers Media, LLC is a casting company for unscripted programming and reality television based in Hollywood, California with a branch office in Boulder, Colorado, Boulder, is the home rule municipality that is the county seat, and the most populous municipality, of which country?",
        "response": "Boulder County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who made \"Jesus of Nazareth\"?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the tutor of the Carmatic vocalist with which Anil Srinivasan was well known for collaborating?",
        "response": "Vaigal Shri S. Gnanaskandan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer and journalist contributing to \"The New Yorker\" writes about subjects such as the Art Deco-style skyscraper, the Chrysler Building?",
        "response": "Claudia Roth Pierpont",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Having a Party\" and \"Bring It on Home to Me\" were made by what American Soul singer?",
        "response": "Sam Cooke",
        "source": "hotpot_qa"
    },
    {
        "query": "Johanna Robbins is the winner of a 2010 300-lap super late model stock car automobile race held in what city and state?",
        "response": "Pensacola, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "24 Hour Psycho is the title of an art installation consisting entirely of an appropriation of a movie written by who ?",
        "response": "Joseph Stefano",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the theme song of the the fifth annual Vengeance WWE event?",
        "response": "Happy?",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is about 2003 Bam Earthquake, Über Goober or Voices of Bam?",
        "response": "Voices of Bam",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are both Wuxi and Huadu District both located?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the film that featured the the song \"No Matter What\" on the US edition of the soundtrack?",
        "response": "Duncan Kenworthy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one of Houston's most popular malls and was to be superseded by Town & Country Mall?",
        "response": "Memorial City Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was an alternative rock band Concrete Blonde or Residual Kid?",
        "response": "Concrete Blonde",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Austro-Hungarian general and historian from the province straddling the southern border of the Habsburg Monarchy?",
        "response": "Emil Vojnović von Belobreska",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Katherine Johnson in Hidden Figures along with African American mathematician, Dorothy Vaughan?",
        "response": "Taraji P. Henson",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day was The Beatles album containing a cover of The Shirelles song \"Boys\"?",
        "response": "22 March 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Rich Brightman's hometown is a hamlet of what town in New York? ",
        "response": "Islip",
        "source": "hotpot_qa"
    },
    {
        "query": "Sergei Prokofiev's Symphony-Concerto in E minor, Op. 125 sometimes was referred to as what?",
        "response": "Sinfonia Concertante",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plants has the widest habitat distribution, Phyllodoce or Dampiera?",
        "response": "Phyllodoce",
        "source": "hotpot_qa"
    },
    {
        "query": "Duwayne R. Dunham is an American film director and film editor, he also directed television films for Disney Channel such as which 1999 comedy-drama Disney Channel Original Movie?",
        "response": "The Thirteenth Year",
        "source": "hotpot_qa"
    },
    {
        "query": "Which style of minimalist furniture and housewares from Denmark associated was Hans J. Wegner, one of the leading figures of its movement ",
        "response": "Danish modern",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is this Chinese model, actress, and singer based in Hong Kong who was chosen by \"Southern Metropolis Daily\" as one of the New Four Dan Actresses in 2013 and appeared in the 2016 Hong Kong-Chinese fantasy film League of Gods?",
        "response": "Angelababy",
        "source": "hotpot_qa"
    },
    {
        "query": "Zora Fair was a native to South Carolina who nearly exposed the military campaign conducted through Georgia from when to when?",
        "response": "November 15 to December 21, 1864",
        "source": "hotpot_qa"
    },
    {
        "query": "Jed D. Hoyer, born on which date, is the executive vice-president and general manager of the Chicago Cubs, he joined the Red Sox in 2002, after the ownership changed to John William Henry II, an American businessman and investor and the founder of John W. Henry & Company, an investment management firm?",
        "response": "December 7, 1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one is the most cold-hardy palms in the world, Halimodendron or Rhapidophyllum?",
        "response": "Rhapidophyllum hystrix",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country in Florida is the airport associated with transportation in Jacksonville, Florida?",
        "response": "Duval County",
        "source": "hotpot_qa"
    },
    {
        "query": "The current general manager of the  Sacramento Kings was drafted during the NBA draft that took place in what city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the side of the engineering Kurt Hohenemser performed that deals with electronics?",
        "response": "Avionics engineering",
        "source": "hotpot_qa"
    },
    {
        "query": "What Swedish-born American film actress during the 1920s and 1930s lived as a recluse from public and society for a significant portion of her life?",
        "response": "Greta Garbo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which composer lived longer, Maurice Ravel or Paul Hindemith?",
        "response": "Paul Hindemith",
        "source": "hotpot_qa"
    },
    {
        "query": "How many residents are there in the city that the band \"The Shadows of Knight\" are from?",
        "response": "over 2.7 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Joachim Chreptowicz was an activist of what educational authority in the Polish-Lithuanian commonwealth?",
        "response": "Commission of National Education",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the business that owns the Australian winery, Lindeman's, headquartered?",
        "response": "Southbank, Melbourne, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Epworth by the Sea is named after a small town in what part of North Lincolnshire, England?",
        "response": "Axholme",
        "source": "hotpot_qa"
    },
    {
        "query": "UFC Fight Night: Namajunas vs. VanZant was held at which luxury resort casino in Paradise, Nevada?",
        "response": "Cosmopolitan of Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of territory does Northern New Hampshire Correctional Facility and New Hampshire Department of Corrections have in common?",
        "response": "state",
        "source": "hotpot_qa"
    },
    {
        "query": "What publication contributed to by Jesse Browner was founded to compete with \"The New Yorker?\"",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that Vinod Adani heads headquartered?",
        "response": "Ahmedabad, Gujarat, India",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote one of Johnny Cash's greatest hits?",
        "response": "June Carter Cash",
        "source": "hotpot_qa"
    },
    {
        "query": "What game is operated by Mansion (Gibraltar) Limited, that has been partly responsible for a huge increase in poker players worldwide?",
        "response": "Online poker",
        "source": "hotpot_qa"
    },
    {
        "query": "Stokes problem was named after the physicist who spent his career at what college?",
        "response": "University of Cambridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Marshall University graduate played 14 seasons at wide receiver in the National Football League?",
        "response": "Randy Moss",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the idealized chemical formula of the pigment synthesized by Johann Jacob Diesbach?",
        "response": "Fe7(CN)18",
        "source": "hotpot_qa"
    },
    {
        "query": "What crossover hit was a song by the American Industrial rock band Nine Inch Nails?",
        "response": "\"Closer\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hemigraphis and Alternanthera plants in the family Acanthaceae?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the older brother of the star of the 1997 film \"The Good Life\"?",
        "response": "Sylvester Stallone",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did the team that Jonathan Spector joined in 2006 move to its new home ?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the Naughty Nineties film released, were Abbott and Costellos most remembered baseball sketch was performed?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Shirdonya Chablis Mitchell played football for a college whose home games are played at what field?",
        "response": "Faurot Field",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the bank located that had 85% of its shares acquired in 2002 from Alvaro Pinho da Costa Leite?",
        "response": "Macau, China.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the band behind the album Love Bites formed?",
        "response": "Bolton, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this regional public university located in Mississippi, where The Delta Lady Statesmen are the women's basketball team?",
        "response": "Delta State University",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people, as of the 2015 census, comprise the ethnic group in which Mira Nair is part of?",
        "response": "4 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Dalmeny, New South Wales is approximately seven kilometres north of a town with what population as of the 2016 census?",
        "response": "2,605",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band of Japanese drummer Shinya was originally a visual kei band?",
        "response": "Dir En Grey",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian playback singer stars in \"Iru Mugan\" directed by Anand Shankar?",
        "response": "Nithya Menen",
        "source": "hotpot_qa"
    },
    {
        "query": "The British scientist who performed Faraday's ice pail experiment in 1843 was born on what date?",
        "response": "22 September 1791",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voiced a character that has a pet pet platypus?",
        "response": "Vincent Martella",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Kevin Woo or Scott Weiland ?",
        "response": "Scott Richard Weiland",
        "source": "hotpot_qa"
    },
    {
        "query": "Riviera Partners is a provider of technical search and recruiting services, specializing in talent acquisition for emerging growth companies, Riviera Partners' clientele includes, Zappos.com is an online shoe and clothing shop based in Las Vegas, in which state?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 66th Academy Awards, the awards for technical achievements were presented by what host who was nominated for Best Actress for \"Rambling Rose\"?",
        "response": "Laura Dern",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Encelia and Gleditsia from the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The school where Dr Ian Hesketh was a researcher was established in what year?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Nevil Shute and J. M. Coetzee, have which occupation in common?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "Ann-Margaret, a Swedish-American actress, singer, and dancer starred in what movie with Walter Matthau?",
        "response": "\"I Ought to Be in Pictures\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did Joanne Woodward found Dennis Wayne's Dancers?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the actress who starred next to Stuart Whitman in the movie \"The Fiercest Heart\" raised after World War II?",
        "response": "South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the composer of the \"American Beauty: Original Motion Picture Score\"?",
        "response": "Montgomery",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Frost and Christoper Dewdney both what profession?",
        "response": "poet",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Marion Bartoli or Philipp Petzschner?",
        "response": "Philipp Petzschner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which coach led the 1922 Texas Longhorns football team to a 7-2 record?",
        "response": "Berry M. Whitaker",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that plays David Robert Jones on the series \"Fringe\" also appears in 2016 romantic thriller directed by Robert Zemeckis that stars what actor as a Candian intelligence officer? ",
        "response": "Brad Pitt",
        "source": "hotpot_qa"
    },
    {
        "query": "What former broadcaster of \"The Radio 1 Breakfast Show\", currently co-hosts a brand new family entertainment show called What Do Kids Know?",
        "response": "Sara Cox",
        "source": "hotpot_qa"
    },
    {
        "query": " The Vermejo Park Ranch is a 590823 acre ranch owned by a media mogul born in which year ?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Bogusław I, of the House of Griffins was Duke of Pomerania-Stettin from 1156 to 1187, he was first married to Walburgis (d. 1177), daughter of which King of Denmark from 1146 until his death in 1182?",
        "response": "Valdemar I of Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the first pilot store open of the chain in which Darren Shapland served as the chairman of between 2014 to 2016?",
        "response": "December 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "guitarist Phil Boyd and drummer Paul Quattrone were students at a university founded in which year ?",
        "response": "1787",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional football club Ronnie Simpson was involved in was founded in 1887?",
        "response": "The Celtic Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "At what festival did the 2005 film Down in the Valley premiere, starring the actress who played Tracy Freeland in the film \"Thirteen\"?",
        "response": "2005 Cannes Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "University of Greenwich and Louisiana State University, are universities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was the music album of Taylor Swift, an American singer-songwriter in Philippine iTunes pop music album charts?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Moana predate the film Human?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A Christmas Carol and Otra Película de Huevos y un Pollo are what kind/ type of movies?",
        "response": "animated",
        "source": "hotpot_qa"
    },
    {
        "query": "Which screenplay was written by Vladimir Nabokov and produced by Ray Stark?",
        "response": "Lolita",
        "source": "hotpot_qa"
    },
    {
        "query": "Upper Tantallon, Nova Scotia is likely named for a castle built in what century?",
        "response": "mid-14th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the English cricketer born who made a hat-trick in the the 2015 Royal London One-Day Cup tournament?",
        "response": "3 March 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is longer, the Raccoon River Valley Trail or the American Discovery Trail",
        "response": "American Discovery Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sharleen Spiteri and Cho Kyuhyun from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Ann Beattie and Stephen R. Donaldson both hold a master's degree from the same university?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "what it the birth name of the adult film star who hosted the 18th AVN Awards ?",
        "response": "Jenna Marie Massoli",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the ferry one would take at the east end of New York State Route 25 lead to?",
        "response": "New London, Connecticut",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of the  2014 Best Footballer in Asia award plays for what Premier League club?",
        "response": "Tottenham Hotspur",
        "source": "hotpot_qa"
    },
    {
        "query": "Stamford Baron St Martin was a parish that has a church south of what river?",
        "response": "Welland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the video of Taylor's Swift's debut single in 2006? ",
        "response": "Trey Fanjoy",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Kai Hansen and Serri who is a South Korean singer, songwriter and actress?",
        "response": "Park Mi-yeon",
        "source": "hotpot_qa"
    },
    {
        "query": "What cricket batting stroke, which hits the cricket ball over the keeper, was invented by Tillakaratne Dilshan during the ICC World Twenty20 in 2009?",
        "response": "The Dilscoop",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiendesitas is a part of an interim business district with an area of more than what?",
        "response": "100 ha",
        "source": "hotpot_qa"
    },
    {
        "query": "Which collaborator of Chance the Rapper has also appeared at Soundset Music Festival?",
        "response": "Vic Mensa",
        "source": "hotpot_qa"
    },
    {
        "query": "Cyril Briggs was dedicated to advancing what  worldwide intellectual movement that aims to encourage and strengthen bonds of solidarity between all people of African descent",
        "response": "Pan-Africanism",
        "source": "hotpot_qa"
    },
    {
        "query": "In the The Simpsons episode \"Principal Charming, Homer invites a character over for dinner who is voiced by whom?",
        "response": "Harry Shearer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which court decision occurred first, Terry v. Ohio or Presser v. Illinois?",
        "response": "Presser v. Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hierarcchiologist believed It states that the selection of a candidate for a position is based on the candidate's performance in their current role, rather than on abilities relevant to the intended role?",
        "response": "Laurence J. Peter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Chinese born, Gregory Nava or King Hu?",
        "response": "King Hu",
        "source": "hotpot_qa"
    },
    {
        "query": "A Woman's Secret co-starred the actor who played in which movie alongside Greta Garbo?",
        "response": "Ninotchka",
        "source": "hotpot_qa"
    },
    {
        "query": "Otto Dickel became a proponent of laissez-faire capitalism which translates to what?",
        "response": "\"let go\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of magazine is Eugene Habecker the chairman of?",
        "response": "evangelical Christian periodical",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Michelangelo Antonioni and Lesley Selander film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was nominated for more Academy Awards, Vittorio De Sica or Robert Altman?",
        "response": "Robert Bernard Altman",
        "source": "hotpot_qa"
    },
    {
        "query": "Couple-ish is a series revolving around an artist who self-identifies as what identity that lies outside the gender binary?",
        "response": "Genderqueer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which surname of Mongolian origin do the male actors of Bollywood Sha, Aamir, and Salman share?",
        "response": "Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ship was named for the fifth Chief Justice of the Supreme Court?",
        "response": "USCGC \"Taney\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor known for Brokebabck Mountain and Push in a movie with Mary Stuart Masterson?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has directed a movie featuring the music of Omar Fadel?",
        "response": "Larry Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Oscar Polk played a memorable scene with which actress in Gone with the Wind?",
        "response": "Vivien Leigh",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Country are both Carthamus and Artabotrys found in?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What popular video game company gave Yoma Komatsu her job for the J-pop group BeForU?",
        "response": "Konami",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle occurred first, the Battle of Cold Harbor or Operation Diadem?",
        "response": "Battle of Cold Harbor",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Bertino is a professional animator, formerly Animation Director and Visual Effects Supervisor at Industrial Light & Magic, an American motion picture visual effects company that was founded in May 1975 by who?",
        "response": "George Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Kristosik, is a former American football player, after graduating from which Roman Catholic, private, preparatory school located in Summerlin, Nevada, he entered the working world as a door-to-door salesman and a valet before enrolling at the University of Nevada?",
        "response": "Bishop Gorman High School",
        "source": "hotpot_qa"
    },
    {
        "query": "What band are These Days and Dave Grohl associated with?",
        "response": "Foo Fighters",
        "source": "hotpot_qa"
    },
    {
        "query": "Among David Bowers and John G. Adolfiwho was an American silent film director?",
        "response": "John Gustav Adolfi",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Playford B Power Station permanently closed in by its Australian operator?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ceratophyllum and Saguaro both plant genus? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did the star of Into The Homeland play on the TV show Nashville?",
        "response": "Lamar Wyatt",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Gibbons and Stanley Ketchel were both what type of people?",
        "response": "boxer",
        "source": "hotpot_qa"
    },
    {
        "query": "Luis Gianneo was teacher of which chief exponent of Argentine folk music?",
        "response": "Ariel Ramírez",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this professional American football team based in Louisianna that competes in the NFL and for which Brian Simmons played professionally?",
        "response": "New Orleans Saints",
        "source": "hotpot_qa"
    },
    {
        "query": "What did  the man who  led Sweden to military supremacy during the Thirty Years' War found in 1623?",
        "response": "court in Åbo",
        "source": "hotpot_qa"
    },
    {
        "query": "Known for playing Charlie Eppes on the CBS series \"Numbers\", who created the American comedy tv series Gigi Does It? ",
        "response": "David Krumholtz",
        "source": "hotpot_qa"
    },
    {
        "query": "Rocky Johnson is most notable for his win by submission over an American mixed martial artist who competes for who?",
        "response": "Bellator MMA",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a French documentary, The Seine Meets Paris and Great Old Amusement Parks?",
        "response": "The Seine Meets Paris",
        "source": "hotpot_qa"
    },
    {
        "query": "What platoon mate of Kevin Lacz served four tours in the Iraq War and was awarded several commendations for acts of heroism and meritorious service in combat?",
        "response": "Chris Kyle",
        "source": "hotpot_qa"
    },
    {
        "query": "Until 2010, who led the electoral alliance of which Mónica Troadello was a part?",
        "response": "Néstor Kirchner",
        "source": "hotpot_qa"
    },
    {
        "query": "Where Have All the Flowers Gone? and Darius Goes West, are films of which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Logan Count in Kansas is named for a general who died in this year?",
        "response": "1886",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this King of Morocco, who is the brother of Princess Lalla Hasna of Morocco?",
        "response": "Mohammed VI",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the player whom the Los Angeles Rams traded William Frederick Traux for born?",
        "response": "October 14, 1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Soo Yong starred in a 1955 American drama-romance film that was set in what city?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth date of a film director who wrote a film based on the anthropomorphic concept that all toys, unknown to humans, are secretly alive?",
        "response": "December 3, 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Taya Kyle was the widow of this US Navy SEAL who served how many tours in the Iraq War?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "Fiat justitia ruat caelum was used in the case that was decided in what year?",
        "response": "1772",
        "source": "hotpot_qa"
    },
    {
        "query": "Christine Harper covered what company that is headquartered at 1585 Broadway?",
        "response": "Morgan Stanley",
        "source": "hotpot_qa"
    },
    {
        "query": "What episode of South Park was the episode that aired in May before Funnybot?",
        "response": "146th",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both King Missile and Natalie Merchant?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What Fox-affiliated television station licensed to Louisville is owned by Block Communications?",
        "response": "WDRB",
        "source": "hotpot_qa"
    },
    {
        "query": "Central Memorial High School is a public senior high school located in the southwest community of North Glenmore in Calgary, a city in the Canadian province of Alberta, in which country? ",
        "response": "Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the developer of an  apartment complex that was built in Hudson Heights, a subsection of the Washington Heights, in 1938-39?",
        "response": "Charles V. Paterno",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Pedro Sienna and Harry L. Fraser both American film directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which seinen manga featuring Kei Kurono, and Masaru Kato, did Hiroya Oku write?",
        "response": "Hen",
        "source": "hotpot_qa"
    },
    {
        "query": "Tanmay Jahagirdar played the child of an encounter specialist who was of what nationality?",
        "response": "Indian",
        "source": "hotpot_qa"
    },
    {
        "query": " Are Isaac Asimov and Michael Cunningham both American writers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Fairbanks International Airport and Wiley Post–Will Rogers Memorial Airport, are located in which U.S. state?",
        "response": "Alaska",
        "source": "hotpot_qa"
    },
    {
        "query": "What river does the MINIs on the Dragon take place near?",
        "response": "Little Tennessee River",
        "source": "hotpot_qa"
    },
    {
        "query": "Can the Astragalus and the Onion be eaten?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "While Blumfeld, an indie-pop band that formed in Hamburg, Germany, Depeche Mode is an English electronic band that formed where?",
        "response": "Basildon, Essex",
        "source": "hotpot_qa"
    },
    {
        "query": "What was population of the city where the Dutch retired footballer Foeke Booy born?",
        "response": "108,249",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the University of which the Whiting School of Engineering, is part, founded ?",
        "response": "1876",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the most populous city in the county where Caleb Stegall served as District attorney?",
        "response": "Valley Falls",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 21st, last and northernmost mission in Alta California, and is located on a part of a California State Park located in the center of Sonoma, California ?",
        "response": "Mission San Francisco Solano",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the country where the moth fromurzinia lutescens is found ?",
        "response": "Luanda",
        "source": "hotpot_qa"
    },
    {
        "query": "At what university in Georgia is Scott Lilienfeld a psychology professor?",
        "response": "Emory University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following drinks contain apricot brandy: Angel Face or Gin pahit?",
        "response": "Angel Face",
        "source": "hotpot_qa"
    },
    {
        "query": "Germaine Damar was Peter Alexander's partner in what industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which western Penobscot County town with a population of only 1,246 in 2010 was home to a republican state senator?",
        "response": "Etna is a town in Penobscot County, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was filmed more recently, Scared Straight! or The Fearless Freaks?",
        "response": "Fearless Freaks",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state was William R. Brewster overrun by Confederaqtes at the Emmitsburg Road?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is this professional wrestling promotion that produced La Hora Cero based in?",
        "response": "Mexico City",
        "source": "hotpot_qa"
    },
    {
        "query": "who were Frantz Yvelin and Aigle Azur",
        "response": "airline",
        "source": "hotpot_qa"
    },
    {
        "query": "Jayson Tatum, American professional basketball player, attended what independent Roman Catholic school, of the Marianist Order?",
        "response": "Chaminade College Preparatory School",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1974 Pittsburgh Steelers season was capped off with a 10-3-1 record and the Super Bowl IX championship, which Cornerback, arrived in 1971? ",
        "response": "Mel Blount",
        "source": "hotpot_qa"
    },
    {
        "query": "London Avenue Canal and Folsom South Canal, are located in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Pfeifer is an unincorporated community in Freedom Township, Ellis County, a county located in the U.S. state of Kansas, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "A British sports, health and leisure business hosted the World Games on what dates?",
        "response": "July 25 to August 4",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the University founded that Thomas Caius was a Fellow and Master of?",
        "response": "1249",
        "source": "hotpot_qa"
    },
    {
        "query": "What drummer, whose career spans more than 30 years, played with the British Rock Symphony, The Who, and Oasis?",
        "response": "Zak Starkey",
        "source": "hotpot_qa"
    },
    {
        "query": "Is The Joy Formidable or Sixpence None the Richer a christian rock band?",
        "response": "Sixpence None the Richer",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian May and Adam Ant, have which mutual occupations?",
        "response": "singer and musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1974 building is named for Justice Sherman Minton?",
        "response": "Minton-Capehart Federal Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Parents and My Weekly, are what type of media?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football competition took place between June 25 and July 5, 2009, where French professional footballer Franck Pascal Paul Tabanou played with the under-20 team?",
        "response": "2009 Mediterranean Games",
        "source": "hotpot_qa"
    },
    {
        "query": "The main sponsor of the 2016 supercar challenge is present in over how many countries?",
        "response": "160",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the high profile client Jim Parkman represented was born in June 8, 1970?",
        "response": "Kwame Kilpatrick",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2018 American action adventure film stars Antonio Aakeel?",
        "response": "Tomb Raider",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer has written more \"New York Times\" bestsellers, Terry Brooks or Truman Capote?",
        "response": "Terence Dean \"Terry\" Brooks",
        "source": "hotpot_qa"
    },
    {
        "query": "What animal do both Cocky and cockfights have in common?",
        "response": "rooster",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country contains both Guangyuan and Xiaoshan District?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "The Old Style Saloon No. 10, is located in Deadwood a city in South Dakota, United States, and the county seat of which County?",
        "response": "Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": "In The Simpsons episode that debuted the character Snake Jailbird, Homer Simpson does what that embarrasses his wife?",
        "response": "gets drunk",
        "source": "hotpot_qa"
    },
    {
        "query": "What film is older The Incredible Journey or The Three Musketeers?",
        "response": "The Incredible Journey",
        "source": "hotpot_qa"
    },
    {
        "query": "When was th co-star of the animated short film, The Bolt Who Screwed Christmas born?",
        "response": "June 20, 1951",
        "source": "hotpot_qa"
    },
    {
        "query": "Pennsylvania Route 51 (PA 51) is a major state highway in Western Pennsylvania, Century III Mall is located on this road, an ailing enclosed shopping mall located in the southern Pittsburgh suburb of West Mifflin, in Pennsylvania, opened in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "SkyJump is located at a hotel, casino, and tower located on what street in Las Vegas?",
        "response": "Las Vegas Boulevard",
        "source": "hotpot_qa"
    },
    {
        "query": "John M. Stahl and Patricio Guzmán, share which film occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Istanbul Railway Museum and Çırağan Palace both hotels?'",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Gerald Conway, is an English folk and rock drummer/percussionist, best known for having performed with the backing band for which British singer-songwriter and multi-instrumentalist, in the 1970s, is commonly known by which former stage name",
        "response": "Cat Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "What English singer and songwriter is also the former bassist for the rock band New Order?",
        "response": "Peter Hook",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was Kara Kennedy's mother born?",
        "response": "September 2, 1936",
        "source": "hotpot_qa"
    },
    {
        "query": "This कसबा पेठ विधानसभा मतदारसंघ is an example of a language that ranks what in the number of native speakers in India?",
        "response": "fourth",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former international footballer for the French national team who starred in \"French Film\"  born? ",
        "response": "24 May 1966",
        "source": "hotpot_qa"
    },
    {
        "query": "What farm is located in the Subdistrict of the Hama District in the Hama Governorate, in the country officially known as the Syrian Arab Republic?",
        "response": "Al-Narjis",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who was starred in \"The Telling\" with Holly Madison born?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1969 American drama film did Waldo Salt win an award for ?",
        "response": "Midnight Cowboy",
        "source": "hotpot_qa"
    },
    {
        "query": "Have filmmakers Brent Hodge and Ayoub Qanir both received awards for their work?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "While Lucky magazine was about fashion, was Soaps In Depth about fashion too?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Sophia of England was the daughter of which Queen of Scotland, England, and Ireland?",
        "response": "Anne of Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "The creature HNoMS Draug is named after comes from what kind of mythology?",
        "response": "Norse",
        "source": "hotpot_qa"
    },
    {
        "query": "What state does Jim Garland and Harlan County War have in common?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "The Senator and founder of lobbying firm, Park Strategies, has a federal courthouse named after him located where? ",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the University established at which Chuck Martin was head coach from 2004 to 2009",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the title of the film staring a golden award winner that premiered at the 1998 Sundance Film Festival ? ",
        "response": "Dead Man's Curve",
        "source": "hotpot_qa"
    },
    {
        "query": "what riot in May 10,1849, has the same name as a theatre in Manhattan, New York City?",
        "response": "Astor Place Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times was the singer who hosted, the 1997 Soul Train Music Awards with Brandy and LL Cool J , a Grammy Award winner ?",
        "response": "seven-time",
        "source": "hotpot_qa"
    },
    {
        "query": "I'm Old Fashioned was premiered on June 16, 1983 at the Theater that is part of what larger center?",
        "response": "Lincoln Center for the Performing Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "Josue Larose is a organizer from a city in Broward County, Florida. Which city?",
        "response": "Deerfield Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Coraline and Cloudy with a Chance of Meatballs, which film's source material is more recent?",
        "response": "Coraline",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathleen P. King is a Professor and Director of what private, independent research university in New York City?",
        "response": "Fordham University",
        "source": "hotpot_qa"
    },
    {
        "query": "What software using the Blinnk layout engine is Fluff Busting Purity available for?",
        "response": "Opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a brother of Peter Gusenberg and victim of a massacre?",
        "response": "Frank Gusenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Under which dynasty did this Persian general serve who used the Black Standard in his uprising leading to the Abbasid Revolution in 747?",
        "response": "Abbasid dynasty",
        "source": "hotpot_qa"
    },
    {
        "query": "Wyatt Earp was the brother of which US marshal of Tombstone?",
        "response": "Virgil Walter Earp",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many seasons did the series in which Courtney Thorne-Smith played Lyndsey McElroy run ?",
        "response": "twelve seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was created first, Crosstrack or Terra Mystica?",
        "response": "Crosstrack",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the British comedian who performed Unrepeatable at the Albery Theatre in 1994 and has also starred in movies such as Ocean's Thirteen, Valkyrie and Shadow of the Vampire?",
        "response": "Eddie Izzard",
        "source": "hotpot_qa"
    },
    {
        "query": "What company develops mobile software products in the discipline that focuses upon the efficient and effective delivery of support services?",
        "response": "Pulsion Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the publishing year of this novella from French aristocrat, writer, poet, and pioneering aviator, who was born in June 29, 1900, and became a laureate?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded Eurasia Group in 1998?",
        "response": "Ian Bremmer",
        "source": "hotpot_qa"
    },
    {
        "query": "In which period the son of John Hunyadi was a King of Hungary and Croatia?",
        "response": "1458 to 1490",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name the name of the conquest from 1941 to 1942 that the Japansese boat \"Tomozuru\" fought in?",
        "response": "The Dutch East Indies Campaign",
        "source": "hotpot_qa"
    },
    {
        "query": "The post-rock album The Epiphany of Glenn Jones is an album by which guitarist and composer?",
        "response": "John Fahey",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did the man that Fulbright Hall is named after represent in the United States Senate?",
        "response": "Arkansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show that Michael Wandmacher composed for shares a name with its creator?",
        "response": "The Goldbergs",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the poker competition that John Racener made it to final tables on 14 occasions located in?",
        "response": "Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "The company Kounta started a partnership with in 2013 is in what country?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the American rock band, that released their album on March 19, 2012, from?",
        "response": "Albuquerque, New Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Queen of Bluegrass\" headlined for the Tennessee Fall Homecoming festival?",
        "response": "Rhonda Vincent",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1984 British Grand Prix was won by Niki Lauda, who was a three-time F1 World Drivers' Champion, winning in what 3 years?",
        "response": "1975, 1977 and 1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the head coach during the 2014 and 2015 season for the Minnesota Vikings?",
        "response": "Mike Zimmer",
        "source": "hotpot_qa"
    },
    {
        "query": "What building is older, 126 Madison Avenue or Collegiate Reformed Protestant Dutch Church?",
        "response": "Collegiate Reformed Protestant Dutch Church",
        "source": "hotpot_qa"
    },
    {
        "query": "The creater of von Neumann's inequality, was what nationality?",
        "response": "Hungarian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor appearred in The CW's Gossip Girl and the 2009 film S. Darko?",
        "response": "Ed Westwick",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, George S. Kaufman or Allen Ginsberg?",
        "response": "George Simon Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of Freud's Leaving Home?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has played in more doubles partnerships, Mark Woodforde or Leoš Friedl?",
        "response": "Leoš Friedl",
        "source": "hotpot_qa"
    },
    {
        "query": "Sept répons des ténèbres was composed by a pianist whose work includes what 1957 opera?",
        "response": "Dialogues des Carmélites",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Takin' Place or Lake of Fire?",
        "response": "Lake of Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "Which subject of Gregg Olsen's true crime books gave birth to Vili Fualaau's child?",
        "response": "Mary Kay Letourneau",
        "source": "hotpot_qa"
    },
    {
        "query": "Han Jae-rim directed the 2013 film starring which actor?",
        "response": "Song Kang-ho",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the American retired professional basketball player who was a second year star of 1996–97 Toronto Raptors season and led the team averaging 20.2 points and 8.8 assists per game?",
        "response": "5 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Firor is well known for being involved in the role-playing game developed by what studio?",
        "response": "ZeniMax Online Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has also been an editor, William A. Seiter or Mitch Anderson?",
        "response": "Mitch Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the first films for the universe containing the Arrowverse start production?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Holzschlag was the birthplace for what Austrian forest caretaker, naturalist, pseudoscientist?",
        "response": "Viktor Schauberger",
        "source": "hotpot_qa"
    },
    {
        "query": "What 3D animated movie was written and directed by British film director Garth Jennings?",
        "response": "Sing",
        "source": "hotpot_qa"
    },
    {
        "query": "The 32nd TCA Awards were hosted by a  Mexican actor best known for his roles as Fernando Mendiola in what?",
        "response": "La Fea Mas Bella",
        "source": "hotpot_qa"
    },
    {
        "query": "which  Sydney-based Australian actor, hosted Monster House",
        "response": "Bernard Curry",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mindscape of Alan Moore is a 2003 documentary film which chronicles the life and work of Alan Moore, author of several acclaimed graphic novels, including V for Vendetta is a British graphic novel written by Alan Moore and illustrated by David Lloyd, published by which organization?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city does 1974 American action-comedy film Freebie and the Bean, starring American actress Valerie Harper and James Caan, take place in?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city are both Sibley Memorial Hospital and Howard University Hospital located?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": " Who developed the music video game in which \"Nothing But You\" song appears mixed together with Sandy Rivera's song?",
        "response": "FreeStyleGames",
        "source": "hotpot_qa"
    },
    {
        "query": "The Woodstock Opera House is a historical venue for performing arts and receptions located in Woodstock, Illinois, perhaps the most notable performer to grace the stage was Orson Welles, he was an American actor, director, writer, and producer who worked in theatre, radio, and film, and is remembered for his innovative work in most notably, which 1937 Broadway adaptation of William Shakespeare's \"Julius Caesar\"?",
        "response": "Caesar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Symplocos and Erodium genera contain more species?",
        "response": "Symplocos",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the English translation of the name of Gertraud Antonia Wagner-Schöppl's birthplace?",
        "response": "Salt Fortress",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character is married to the Vision but also the daughter of Magneto?",
        "response": "The character first appeared in \"X-Men\" #4 (March 1964)",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of the Colombian singer, songwriter, dancer, and record producer whose fourth concert tour was named the Oral Fixation Tour?",
        "response": "2 February 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the writer of the 1977 short story \"Time and Again\" born?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "The school in which the Wilmslow Show is held is designated as what?",
        "response": "Centre of Excellence",
        "source": "hotpot_qa"
    },
    {
        "query": "In between The Postal Service and Chagall Guevara which one was formed in 1989?",
        "response": "Chagall Guevara",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seed money lender of Catalist's net worth as of May 2017?",
        "response": "George Soros",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tragedy of Lucretia is a tempera and oil painting on a wood \"cassone\" or \"spalliera\" panel by whch Italian Renaissance master, it is housed in the Isabella Stewart Gardner Museum of Boston, Massachusetts, having been owned by Isabella Stewart Gardner in her lifetime?",
        "response": "Sandro Botticelli",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain is taller, Istor-o-Nal or Siguang Ri?",
        "response": "Istor-o-Nal",
        "source": "hotpot_qa"
    },
    {
        "query": "What team beat Earl Dalton Mossor's team in 1951?",
        "response": "New York Giants",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Hobbs founded the company that is based in what town in Manchester?",
        "response": "Failsworth",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the music for the muscial based on L. Frank Baum's book whose title is commonly shortened to The Land of Oz?",
        "response": "Frederic Chapin",
        "source": "hotpot_qa"
    },
    {
        "query": "What Brittish-American rock band released their debut album in 1987?",
        "response": "Foreigner",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does O and Cirque du Soleil play in?",
        "response": "Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was created first, Fig Trees or Pond Hockey?",
        "response": "Pond Hockey",
        "source": "hotpot_qa"
    },
    {
        "query": "Jaffa Road contains the bus station that serves which three bus routes?",
        "response": "Egged, Superbus and Dan",
        "source": "hotpot_qa"
    },
    {
        "query": "Pat Gorman was in the 1980 American historical drama film about whom?",
        "response": "Joseph Merrick",
        "source": "hotpot_qa"
    },
    {
        "query": "What producer from Augsburg, Germany has worked with a finalist from season 3 of American Idol?",
        "response": "Veit Renn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the United Nations international E-road network runs through Rhône-Alpes?",
        "response": "European route E 15",
        "source": "hotpot_qa"
    },
    {
        "query": "From which ethnic tribe hail the Catuvellani, a settlement of whose can be found near the city of St Albans in Hertfordshire?",
        "response": "Celtic tribe",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bawku municipal district is part of what region?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city is this American banker, businessman, investor, poker player, and amateur mathematician who founded the launch vehicle development company Beal Aerospace currently based?",
        "response": "Dallas",
        "source": "hotpot_qa"
    },
    {
        "query": "In which series did Jacky Ickx, the Belgian Ferrari driver, win more races - Formula One or the Le Mans 24 Hours?",
        "response": "Formula One",
        "source": "hotpot_qa"
    },
    {
        "query": "Tara Ochs starred alongside who in a 2010 American romantic-comedy drama?",
        "response": "Katherine Heigl and Josh Duhamel",
        "source": "hotpot_qa"
    },
    {
        "query": "An American voice actress and actress who had a distinctive speaking style starred what title character in Cartoon Network's comic science fiction animated television series created by Genndy Tartakovsky ?",
        "response": "Chuckie Finster",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitey Hilcher played for a baseball team that joined the National League (NL) in what year?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the band that Vicentico co-founded and produced the album Los Rayos?",
        "response": "Los Fabulosos Cadillacs",
        "source": "hotpot_qa"
    },
    {
        "query": "Al Joyner, husband of heptathlete Jackie Joyner-Kersee, was a gold medalist in which Olympic event in 1984?",
        "response": "triple jump",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport does John McCarthy and UFC 2 have in common?",
        "response": "mixed martial arts",
        "source": "hotpot_qa"
    },
    {
        "query": "Tame Impala and Letters to Cleo, are both musical bands of which type?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Ib has directed music videos for the Australian singer who starred in what soap opera?",
        "response": "Neighbours",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of Toni Nadal's younger brother ?",
        "response": "The Beast",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the boxer defeated by Carlos Quintana in the 2008 WBO welterweight championship?",
        "response": "The Punisher",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Tangshan and Lanxi, Zhejiang from the same province in China?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what neighborhood of Upper Manhattan, New York City, does the Second Avenue Line of the New York City Subway border?",
        "response": "East Harlem",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote A Streetcar Named Desire, which is a play in which Viola Keats starred as Blanche during an Australian tour?",
        "response": "Tennessee Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an American indie rock band carried on Sub Pop Records, Juliana Hatfield or Ugly Casanova",
        "response": "Ugly Casanova",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cody Michelin Cup Biplane was built by a man born in what US city?",
        "response": "Davenport",
        "source": "hotpot_qa"
    },
    {
        "query": "The Major League Baseball Draft is the process by which organization, their teams select athletes to play for their organization, as opposed to the National Football League Draft which appeared on ESPN, no network aired the MLB Draft?",
        "response": "Major League Baseball (MLB)",
        "source": "hotpot_qa"
    },
    {
        "query": "The trail that D.O. Quick crossed connected the Missouri River to what?",
        "response": "valleys in Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "Akash Mukesh Ambani (born 23 October 1991) is an Indian businessman, he's also the Chief of Strategy of which 4G service provider, and LTE mobile network operator in India?",
        "response": "Jio Infocomm Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "Berzerk is from the album released on what date?",
        "response": "November 5, 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the illustrator of a well-known manga starring Goku first achieve mainstream recognition for?",
        "response": "Dr. Slump",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the green that centres the village where Greystoke Castle is located, surrounded by?",
        "response": "stone houses and cottages.",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that starred in \"Stay\" alongside Ewan McGregor made her film debut in which movie?",
        "response": "For Love Alone",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Daughtry and Bobby Fuller, are which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the star of the unreleased Super Nintendo Entertainment System game, Socks the Cat Rocks the Hill, pass away?",
        "response": "February 20, 2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Cowie Castle at Stonehaven, and Allardice Castle near Inverbervie, are part of a coastal chain of castles in Scotland overlooking which sea?",
        "response": "North Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Guillermo Cabrera Infante and Nalini Prava Deka writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The draft in which Mika Zibanejad was selected was which iteration of the NHL draft?",
        "response": "49th",
        "source": "hotpot_qa"
    },
    {
        "query": "The Alaska Native Heritage Center is an educational and cultural institution for all Alaskans, including which Eskimo people residing along the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island?",
        "response": "Siberian Yupik",
        "source": "hotpot_qa"
    },
    {
        "query": "The former owner of Fulham F.C. started a film production company in what decade?",
        "response": "in the late 1970s.",
        "source": "hotpot_qa"
    },
    {
        "query": "Missing Cleveland is the first single from a musician who was also a part of what supergroup?",
        "response": "Velvet Revolver",
        "source": "hotpot_qa"
    },
    {
        "query": "Shaoyang and Haiyang, are in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "The explosion of animals is an uncommon event arising through natural causes or human activity, among the best known examples are the post-mortem explosion of whales, the term exploding whale primarily refers to an event at Florence, Oregon in November 1970, when a dead sperm whale (reported to be a gray whale) was blown up by which organization. in an attempt to dispose of its rotting carcass?",
        "response": "Oregon Highway Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Madonna's seventh single to top the Hot 100 chart was co-written by Madonna and who?",
        "response": "Patrick Leonard",
        "source": "hotpot_qa"
    },
    {
        "query": "What event from December 2001 is featured in the documentary Afghan Massacre: The Convoy of Death?",
        "response": "Dasht-i-Leili massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author wrote a memoir called \"Hillbilly Elegy\", which was on \"The New York Times\" Best Seller list in 2016 and 2017?",
        "response": "James Donald Bowman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the author born in 1817 that is associated with a pond from which Frederic Tudor sold ice?",
        "response": "Henry David Thoreau",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2014 of the city that Jean-Michel Severino was born in?",
        "response": "4.7 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Leonard's brother competed between what years?",
        "response": "1977 to 1997",
        "source": "hotpot_qa"
    },
    {
        "query": "are Il re pastore and King Priam both Operas ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the host of A. J. After Hours born?",
        "response": "June 2, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the principal dancer for the ballet company located at the Bolshoi Theatre?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "Stabat Mater was written by a composer of what nationality?",
        "response": "Polish",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the 2013 successors to the media conglomerate owned by the same person who owns the Moraga Estate?",
        "response": "News Corp and 21st Century Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the designer of a 3-5 player game about impulsive crooks pulling heists that are sure to go terribly wrong?",
        "response": "Jason Morningstar",
        "source": "hotpot_qa"
    },
    {
        "query": "Get Carter starred which Scottish-American actor and activist?",
        "response": "Alan Cumming",
        "source": "hotpot_qa"
    },
    {
        "query": "from the Monty Python group who plays the role of Brian?",
        "response": "Graham Chapman",
        "source": "hotpot_qa"
    },
    {
        "query": "Grace Robinson, is an Australian track and field athlete competing in the disciplines of discus, javelin throw, and shot put, she represented Australia in women's shot put at the 2015 Commonwealth Youth Games was the fifth Commonwealth Youth Games, which started in what year?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Pioneer 4 fly by before inserting into the type orbit that planets of the Solar System are in around the sun?",
        "response": "Moon's surface",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a plant genus of the carrot family Apiaceae native to Europe and western Asia, Hydrangea or Aegopodium ?",
        "response": "Aegopodium",
        "source": "hotpot_qa"
    },
    {
        "query": "Which continent are both magazines, Sayidaty and Closer published?",
        "response": "Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "What do  Jacques Tourneur and Djibril Diop Mambéty have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the largest English-French bilingual university in the world where Professor Juana Munoz-Liceras teaches?",
        "response": "University of Ottawa",
        "source": "hotpot_qa"
    },
    {
        "query": "which writer has the highest number of skill  Langston Hughes or  Ian McEwan",
        "response": "Langston Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "The drama film The Journey is a fictional account of the true story of political enemies, Ian Paisley and which Irish republican?",
        "response": "James Martin Pacelli McGuinness",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Espada was a special assistant to the General Manager and Senior Vice President for what baseball team?",
        "response": "New York Yankees",
        "source": "hotpot_qa"
    },
    {
        "query": "Who stars in The Debt?",
        "response": "Helen Mirren",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more of an independent artist, Pop Evil or Imogen Heap?",
        "response": "Imogen Heap",
        "source": "hotpot_qa"
    },
    {
        "query": "What resort are Disney's River Country and  Disney's Fort Wilderness Resort & Campground apart of?",
        "response": "Magic Kingdom Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Ryan Key and John Corabi been members of the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Androlepis and Corymbia in the same botanical family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the name of the film  best known for an actor who is enacted along with DOug McClure in The Death of Me Yet?",
        "response": "A Christmas Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Austrocedrus bigger than Madagascar?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the writer of the thirteenth episode of \"30 Rock\" born?",
        "response": "May 18, 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "What simulated slot car type dark ride attraction in Cars Land at Disney California inspired by The Disney-Pixar franchise?",
        "response": "Radiator Springs Racers",
        "source": "hotpot_qa"
    },
    {
        "query": "Making North America and Life in the Undergrowth, are if which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan Chapman produced Taylor Swift's first five albums; what was the third one from 2010 called?",
        "response": "Speak Now",
        "source": "hotpot_qa"
    },
    {
        "query": "What animal does Bouvier des Ardennes and French Spaniel have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Under what name did the founder and lead guitarist of the band Porcupine Tree use when he released his album Indicates Void?",
        "response": "Bass Communion",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog is bigger? The Dandie Dinmont Terrier or The Rottweiler?",
        "response": "The Rottweiler",
        "source": "hotpot_qa"
    },
    {
        "query": "What place on season five of \"Canadian Idol\" did the Candadian artist who wrote \"Bucket\" receive? ",
        "response": "third",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author was also an activist, Jonathan Kellerman or Alan Paton? ",
        "response": "Alan Stewart Paton",
        "source": "hotpot_qa"
    },
    {
        "query": "Sinan Bytyqi plays for a club represented at what level?",
        "response": "Reserve level",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Australian dramatic coloratura soprano, who taught Simon Gilbert?",
        "response": "7 November 192610",
        "source": "hotpot_qa"
    },
    {
        "query": "Dennis Anderson is a professional driver known for driving which monster truck considered to be one of the most influential and iconic monster trucks of all time?",
        "response": "Grave Digger",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tier of English football (first, second, third, fourth, fifth) does Koby Arthur play for?",
        "response": "fifth",
        "source": "hotpot_qa"
    },
    {
        "query": "Ardèche is a tributary of the river that has a mouth at what body of water?",
        "response": "Mediterranean Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Lyngby culture is a term used to describe a culture that was located in which region?",
        "response": "north-central Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years did the last Democratic governor of Alabama serve in Alabama government?",
        "response": "26 years",
        "source": "hotpot_qa"
    },
    {
        "query": "Bebe Rexha and Eminem are both what?",
        "response": "American singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who first worked in Hollywood during the transition to \"talkies\", from 1926 to 1930, Michael Herz or Alexander Korda ?",
        "response": "Sir Alexander Korda",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Steve Miller and Jun. K from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both The Black Cauldron and In Search of the Castaways both based on books by Jules Verne?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who also played in Porno for Pyros besides Martyn LeNoble?",
        "response": "The band comprised former Jane's Addiction members Perry Farrell",
        "source": "hotpot_qa"
    },
    {
        "query": "What notable Italian artist and writer founded the \"scuola metafisica\" art movement and painted The Nostalgia of the Infinite?",
        "response": "Giorgio de Chirico",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a small spaniel classed as a toy dog by The Kennel Club and the American Kennel Club, Cavalier King Charles Spaniel or Poitevin?",
        "response": "Cavalier King Charles Spaniel",
        "source": "hotpot_qa"
    },
    {
        "query": "Kristina Anapau plays Galina in a film that revolves around the production of what ballet?",
        "response": "\"Swan Lake\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of a 1999 American action fantasy film in which Arnold Vosloo is known for his roles as Imhotep?",
        "response": "Stephen Sommers",
        "source": "hotpot_qa"
    },
    {
        "query": "Wendy Ayche was featured in 2016 in an annual production created by Youtube and what other organization?",
        "response": "Portal A Interactive",
        "source": "hotpot_qa"
    },
    {
        "query": "The retired American professional basketball player Walt Williams attended this institution in 1988 that is in which conference today?",
        "response": "Big Ten Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this German political and military leader, as well as one of the most powerful figures in the Nazi Party, who attended the Hossbach Memorandum?",
        "response": "12 January 1893",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did an actress from The Secret of NIMH play in A Patch of Blue?",
        "response": "Selina D'Arcy",
        "source": "hotpot_qa"
    },
    {
        "query": "Max Jacob and Grace Metalious, have which mutual occupation?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the duration of the war that was in progress when the USS McAnn first served in the Atlantic Ocean?",
        "response": "1939 to 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Angelo Meli was the leading chairman of an American Mafia crime family based where?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Love Among Freaks and !!! formed in the same State ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the goal as a photographer of the man whose \"Message from the Interior\" was published by Eakins Press?",
        "response": "to make pictures that are \"literate, authoritative, transcendent\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Badger Creek Wilderness is a 29057 acre wilderness area located east of Mount Hood in the northwestern Cascades of Oregon, which is located about 50 mi east-southeast of what city? ",
        "response": "Portland",
        "source": "hotpot_qa"
    },
    {
        "query": " Axel Juárez made his senior debut in Primera División for a sports club based in the Boedo district of where?",
        "response": "Buenos Aires",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Welsh film animator/director who was born in Rhondda in Wales who graduated from the University of Wales with an HNC in Electronics, and worked on projects like the eighteenth spy film in the \"James Bond\" series, and the second to star Pierce Brosnan as the fictional MI6 agent James Bond ?",
        "response": "Marco Marenghi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which position in the us military must you be in to be eligible for the achievement medal?",
        "response": "junior officers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the host of the Australian television quiz show for which Taylor Auerbach was the youngest winner?",
        "response": "Eddie McGuire",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1972 crime film starred the woman who played Juliet in Franco Zeffirelli's 1968 film version of \"Romeo and Juliet\"?",
        "response": "The Summertime Killer",
        "source": "hotpot_qa"
    },
    {
        "query": "The American boy who disappeared in 1979 was lost from what artistic and cultural neighborhood in New York?",
        "response": "Etan Kalil Patz",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Bishop Gorman High School?",
        "response": "Summerlin, Nevada.",
        "source": "hotpot_qa"
    },
    {
        "query": "Wroughton is located on a road that leads to the best known what? ",
        "response": "prehistoric sites in Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Minnesota Timberwolves player was around 20 or younger in the 2015-16 season and also played for University of Kentucky ?",
        "response": "Karl-Anthony Towns",
        "source": "hotpot_qa"
    },
    {
        "query": "What owns the company that is executing the power plant owned by Bajaj Hindusthan Limited?",
        "response": "Government of India",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Way Back into Love\" is a Pop song, written by who, from the 2007 film \"Music and Lyrics\", there are two versions, both have been sung by Hugh John Mungo Grant, an English actor and film producer?",
        "response": "Adam Schlesinger",
        "source": "hotpot_qa"
    },
    {
        "query": "What American organization established by Executive Order 13072 organized the USA Millennium celebrations?",
        "response": "White House Millennium Council",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Not About Angels\" is a theme song for which film based on a novel by John Green?",
        "response": "The Fault in Our Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do Anita Loos and Grace Metalious share? ",
        "response": "American author",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city did Michel Hugo become a professor?",
        "response": "Paradise, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Yovee has a sound that is similar to the British-American rock band formed in London in what year?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "This actress has played in the ITV series \"The Bletchley Circle\" and alongside Keeley Hawes and Jodhi May in a series based on a best-selling debut novel by who?",
        "response": "Sarah Waters",
        "source": "hotpot_qa"
    },
    {
        "query": "Bar Harbor is a town on Mount Desert Island in Hancock County, Maine, the town is served by the Hancock County-Bar Harbor Airport, which has flights on PenAir, and Hyannis Air Service, Inc., operating as Cape Air, is an airline headquartered at Barnstable Municipal Airport in Barnstable, Massachusetts, in which country? ",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What band performed a song released in September 1989 as the second single taken from their self-titled debut album of the same name written an an American songwriter who rose to prominence in 1983, and has since written songs for and with multiple music artists, as well as for several films?",
        "response": "Bad English",
        "source": "hotpot_qa"
    },
    {
        "query": "Finn Andersen, also known as Karrigan, was a founding member of which player owned team?",
        "response": "Astralis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which became a Cathedral first St Chad's Cathedral, Birmingham or Chelmsford Cathedral?",
        "response": "Metropolitan Cathedral Church and Basilica of Saint Chad",
        "source": "hotpot_qa"
    },
    {
        "query": "What New Orleans Pelicans player born in 1993 won the 2017 NBA All-Star Game MVP award?",
        "response": "Anthony Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Super High Me and Superjews, share which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the actor who appeared in \"Bad Dreams\" begin his career?",
        "response": "theater",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this high-speed banked oval that this motor racing circuit in Melbourne, Victoria, Australia, had where 2001 Calder Park V8 Supercar round took place?",
        "response": "Thunderdome",
        "source": "hotpot_qa"
    },
    {
        "query": "Harsh Times was directed by the film director who is best known for writing which 2001 film?",
        "response": "Training Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which air transport operations hub was commanded by the most recent serial killer profiled in the book Cold North Killers: Canadian Serial Murder?",
        "response": "CFB Trenton",
        "source": "hotpot_qa"
    },
    {
        "query": "Hardy Brown is one of only two men to play in the NFL, AAFC and AFL, but which Oklahoma college did he play football for?",
        "response": "University of Tulsa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members Beady Eye or Grant Lee Buffalo?",
        "response": "Beady Eye",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lithocarpus and Epiphyllum in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this public research university and one of 10 campuses in the University of California system, where Harriet Dinerstein earned her Ph.D?",
        "response": "University of California, Santa Cruz",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Esther Renay Dean or Onika Tanya Maraj?",
        "response": "Esther Renay Dean",
        "source": "hotpot_qa"
    },
    {
        "query": "Calum Worthy, known for his role as Dez on the Disney Channel series \"Austin & Ally\" and \"The Coppertop Flop Show\", stars in what 2016 American social science fiction thriller about population control?",
        "response": "The Thinning",
        "source": "hotpot_qa"
    },
    {
        "query": "Radar observations of 101 Helena were made from the Arecibo Observatory in what year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1986 VFL Grand Final and the 2017 AFL Grand Final were both played where?",
        "response": "Melbourne Cricket Ground",
        "source": "hotpot_qa"
    },
    {
        "query": "From 1992 until December 2009 the Thunder played in the Britt Brown Arena located in a suburb with a population of what at the 2010 census?",
        "response": "7,297",
        "source": "hotpot_qa"
    },
    {
        "query": "Arend Glas (born 29 October 1968 in Joure) is a Dutch bobsledder who has competed from 1992 to 2006, competing in two Winter Olympics, he earned his best finish of 16th both in the two-man event at Salt Lake City in 2002, which event occurred in was a winter multi-sport event, that was celebrated from 8 to 24 February 2002 in and around Salt Lake City, Utah, United States?",
        "response": "XIX Olympic Winter Games",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the drama film starring an English actress born July 26, 1973 and Nick Nolte released?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the present post of the head coach of the 1982 NC State Wolfpack football team ?",
        "response": "defensive assistant at Florida Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2011 American comedy-drama film in which Louisa Krause  appeared?",
        "response": "Jason Reitman",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Starr (1813–1890) was a Cherokee in the American West, who was declared an outlaw by his tribe in an internal conflict over treaties with the United States government, he was the grandfather of Henry Starr, and father in-law to Belle Starr, through her marriage to Sam Starr, Myra Maybelle Shirley Reed Starr (February 5, 1848 – February 3, 1889), better known as Belle Starr, was a notorious American ?",
        "response": "outlaw",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed the new intellectual properties release of a 2016 video game notable for its long development cycle?",
        "response": "D-Pad Studio",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the principal of the school which Corey Snide graduated from in 2011?",
        "response": "Christopher Robilotti",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was shown on a double bill with the film \"Dumbo\", Saludos Amigos or Valiant?",
        "response": "Saludos Amigos",
        "source": "hotpot_qa"
    },
    {
        "query": "What ancient officer in North West England is the second Baronet of the Heywood baronets?",
        "response": "High Sheriff of Lancashire",
        "source": "hotpot_qa"
    },
    {
        "query": "The Roman Theatre of Florence was located under a building that has a copy of which statue outside?",
        "response": "Michelangelo's \"David\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Vincent Castellanos (born August 7, 1961) is an American actor, Castellanos is best known for his role as Mateo in the adventure-horror film Anaconda, a 1997 adventure horror film, by which Peruvian director?",
        "response": "Luis Llosa",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of voice did the vocalist for You're a Mean One, Mr. Grinch record for Jolly Holiday?",
        "response": "singing animal voices",
        "source": "hotpot_qa"
    },
    {
        "query": "The Healthy Dead is a novella set in the world of a fantasy series published in the UK by what company?",
        "response": "Bantam Books",
        "source": "hotpot_qa"
    },
    {
        "query": "Both the German Fountain and Basilica Cistern are located in what country?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the hip hop collective, Wu-Tang Clan, appears in the song \"The Glide\" on the Album \"4:21... The Day After,\" but doesn;t get credited? ",
        "response": "U-God",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Beauty and the Beast or The One and Only, Genuine, Original Family Band more political?",
        "response": "The One and Only, Genuine, Original Family Band",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of merchandise does Don Quijote, the discount chain store, sell as opposed to a single line discount store?",
        "response": "basic groceries to electronics to clothing",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1958–59 Huddersfield Town A.F.C. season was managed by the football player of what nationality?",
        "response": "Scottish",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the state which has its eastern border defined by the 25th meridian of longitude west from Washington?",
        "response": "5,540,545",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the country that is in the Baltic region of Northern and Eastern Europe and is also home to the football club, Lihula JK?",
        "response": "Estonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released the Beatles album for which Hold Me Tight was first recorded but not selected for inclusion?",
        "response": "Parlophone",
        "source": "hotpot_qa"
    },
    {
        "query": "Claude Nicollier participated in 4 missions by which name that began in 1982?",
        "response": "Space Shuttle",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the actor who was a leading man of Michèle Mercier and born on November 3, 1921?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiffany Valentine-Ray, is a murderous doll and an antagonist featured in many installments of the \"Child's Play\" franchise of horror films, on January 5, 2017, it was announced that Tilly had signed for the \"Cult of Chucky\" an American supernatural slasher film, released in which year?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the Beeba Boys died in 1998?",
        "response": "Bindy Johal",
        "source": "hotpot_qa"
    },
    {
        "query": "What TV franchise created by producers Simon Fuller and Nigel Lythgoe included French television dance competition You Can Dance?",
        "response": "So You Think You Can Dance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character did the actor who played Carl in an homage and tribute to the Universal Horror Monster films from the 1930s and '40s, play in the \"The Lord of the Rings\" film trilogy?",
        "response": "Faramir",
        "source": "hotpot_qa"
    },
    {
        "query": "Ego is portrayed by Kurt Russell in a movie directed by who ?",
        "response": "James Gunn",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Nedao involved a group of people who lived when? ",
        "response": "4th century AD",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novel by Mark Wisniewski was praised by the eighth-largest newspaper in the United States by circulation?",
        "response": "\"Confessions of a Polish Used Car Salesman\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Manfred Moch was a German trumpet player, he made a name for himself in the 1960s as the featured solo trumpet player for an orchestra of which German orchestra leader, music producer, and songwriter?",
        "response": "Berthold Heinrich Kämpfert",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Yasujirō Ozu and Bent Hamer, who has more creative titles?",
        "response": "Bent Hamer",
        "source": "hotpot_qa"
    },
    {
        "query": "On what game that plays different genres of music when the player enters the vehicle, the track of a 5 teenage girls pop group that had their first music album released under EMI music, was featured?",
        "response": "Grand Theft Auto V soundtrack",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2005 All-Pacific-10 Conference season, the  Pat Tillman Pac-10 Co-Defensive Players of the Year award was given to Dale Robinson and a man that current plays for what NFL team?",
        "response": "Detroit Lions",
        "source": "hotpot_qa"
    },
    {
        "query": "Red Velvet is a 2012 play by Lolita Chakrabarti, dealing with the biography of a 19th century actor born in which year ?",
        "response": "1807",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathryn Micho wrote a novel that was published by a company headquartered in New York City, that is a subsidiary of what?",
        "response": "News Corp.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which bolt-action, magazine-fed, repeating rifle is the Charlton Automatic Rifle a fully automatic conversion of?",
        "response": "Lee–Enfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Sugarcult and Morphine are both what types of groups?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the  2014 incarnation of the charity super group Band Aid?",
        "response": "Band Aid 30",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Indian casinos which formed the Legal forms of gambling in the U.S. state of Connecticut is one of the largest casinos in the United States, with 364000 sqft of gambling space?",
        "response": "Mohegan Sun",
        "source": "hotpot_qa"
    },
    {
        "query": "The wife of Hank Penny is best know for the hits \"Sad Movies (Make Me Cry)\" and what other song?",
        "response": "\"Norman\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published the video game that features a Canadian Ice hockey centre and captain in the NHL?",
        "response": "EA Sports",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the\"Highway Killer\" who helped the movie Hunting for Humans gain notoriety?",
        "response": "Adam Leroy Lane",
        "source": "hotpot_qa"
    },
    {
        "query": "What episode did Mona Penelope Simpson  on the animated show \"The Simpsons\"die?",
        "response": "\"Mona Leaves-a\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Both cities of Karamay and Yima, Henan are located in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Wife of Donald Trump did Arnold Isaacs design a dress for?",
        "response": "Ivana Trump",
        "source": "hotpot_qa"
    },
    {
        "query": "Michel Wachenheim a French ambassador and permanent representative of France of what specialized agency of the United Nations?",
        "response": "The International Civil Aviation Organization",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Bachna Ae Hasseeno\" is an Indian film song that was later made with Ranbir Kapoor, who was the son of which actor?",
        "response": "Rishi",
        "source": "hotpot_qa"
    },
    {
        "query": "People of the City is a novel by Cyprian Ekwensi that preempted the importance of a novel first published in what year?",
        "response": "1958",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of Theatre of Blood has a star on the Saint Louis Walk of Fame?",
        "response": "Vincent Price",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean actress born in Feb 1990 appears on the 2016 South Korean television series \"My Lawyer, Mr. Jo\"?",
        "response": "Kang So-ra",
        "source": "hotpot_qa"
    },
    {
        "query": "The New Hampshire Route 49 highway is near which national forrest?",
        "response": "White Mountain National Forest",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an orbital motorway in Greater Manchester, a metropolitan county in North West England that is adjacent to what was   anciently a hamlet built around what is now the village green?",
        "response": "M60 motorway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American shoe company that primarily produces skating shoes and lifestyle brand footwear must a player have won honors from to earn the \"consensus\" status for the 1942 NCAA Men's Basketball All-Americans team?",
        "response": "Converse",
        "source": "hotpot_qa"
    },
    {
        "query": "Bruce Hornsby's ninth studio album, a collaboration with the legend Ricky Skaggs, worthy of note is the cover of \"Super Freak\", here turned into a version, and form of American roots music, and a related genre of country music, influenced by the music of Appalachia?",
        "response": "Bluegrass music",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Strychnine in the Soup\" is a short story by the British comic writer P. G. Wodehouse, a BBC TV adaptation of the story aired on 9 April 1976, Cyril Mulliner was played by John Alderton (born 27 November 1940) is an English actor, and has often starred alongside his wife, who?",
        "response": "Pauline Collins",
        "source": "hotpot_qa"
    },
    {
        "query": "What queen consort was the wife of William Alexander Frederick?",
        "response": "Anna Pavlovna of Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Matthew Sweet or The Vaccines enjoy longer careers as part of the rock music scene?",
        "response": "Matthew Sweet",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Brazilian mixed martial artist and Brazilian Jiu-Jitsu practitioner, whose associated is affiliated with the ZenQuest Martial Arts Center?",
        "response": "Demian Maia",
        "source": "hotpot_qa"
    },
    {
        "query": "What airline is headquarted in Vientiane and opened in 2015?",
        "response": "Lao Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is focused more on the adult demographic, Jack and Jill or Paper?",
        "response": "Paper",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was also a producer, in addition to being a director, Alexander Mackendrick or Peter Chan?",
        "response": "Peter Ho-sun Chan",
        "source": "hotpot_qa"
    },
    {
        "query": "What second oldest school in Miami-Dade County did a Grammy Award winning record producer and songwriter attend?",
        "response": "Miami Beach Senior High School",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the scientific name of the true creature featured in \"Creature from the Black Lagoon?",
        "response": "Eucritta melanolimnetes",
        "source": "hotpot_qa"
    },
    {
        "query": "Midnight Express is a 1977 non-fiction book by Billy Hayes, an American writer, actor, and film director, born on which date?",
        "response": "April 3, 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper founded the record label in which \"Da 1 U Luv 2 Hate\" was released under?",
        "response": "50 Cent",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person included in the label 300 Entertainment has a debut single \"Trap Queen?\"",
        "response": "Fetty Wap",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city are both Howard University Hospital and MedStar National Rehabilitation Hospital located?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Lewis Milestone and Aaron Katz, are both of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Trent Cotchin was a player in the sport that plays on what shaped field?",
        "response": "oval-shaped",
        "source": "hotpot_qa"
    },
    {
        "query": "Vulcan Inc. oversees a nonprofit museum founded as what?",
        "response": "Experience Music Project",
        "source": "hotpot_qa"
    },
    {
        "query": "Len Vlahov represented Australia at the British Empire and Commonwealth Games held from when to when?",
        "response": "22 November to 1 December 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the cricket ground that people take the Old traffic tram stop to get to open?",
        "response": "1857",
        "source": "hotpot_qa"
    },
    {
        "query": "Arjun Kapoor and Boney Kapoor are both in which country's film industry?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Spanish translation of the name of the concentration camp William Hohri was sent to?",
        "response": "\"apple orchard\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American retired professional basketball player born who was re-signed to Warriors during the offseason of  2000–01 NBA?",
        "response": "July 30, 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Marguerite Duras and Leni Riefenstahl, is French?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In which of the 13 countries that Telenor owns networks is Grameen Telecom located?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "During which century did the king played by Stellan Skarsgård in 2005's Beowulf & Grendel actually live?",
        "response": "early 6th century",
        "source": "hotpot_qa"
    },
    {
        "query": "Gabriel Mann co-starred in a film that was an international co-production between what countries?",
        "response": "the United States, Germany and the United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "TACA Airlines, is an airline owned by a conglomerate owned by who ?",
        "response": "Germán Efromovich",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the film released in which Daniel John Pollock played the role of Davey?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Ulrich of Eppenstein served as an abbot for an Abbey located in which city in Switzerland ?",
        "response": "St. Gallen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which international multi-sport event hosted 10,768 athletes including Moroccan boxer Aboubakr Lbida beginning July 25, 2012?",
        "response": "2012 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the five Civilized Tribes of Sequoyah Bay State Park principally lives in Oklahoma with a minorty in Florida.",
        "response": "Seminole",
        "source": "hotpot_qa"
    },
    {
        "query": "Kansai Electric Power Company is a utility serving a region including Kobe, which has a population of how many?",
        "response": "1.5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What event on April 1, 2007 featured music from the studio album \"Blood Stained Love Story\"?",
        "response": "WrestleMania 23",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Karine A\" affair, also known as Operation \"Noah's Ark\", was an Israeli military action in January of which year, in which Israeli forces seized MV \"Karine A\", which, according to IDF, was a Palestinian freighter in the Red Sea, the vessel was found to be carrying 50 tons of weapons, including the short-range Katyusha multiple rocket launcher?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film that Josef von Sternberg worked on was released later, The Shanghai Gesture or Macao?",
        "response": "Macao",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Jed Hoyer or John William Henry II?",
        "response": "John William Henry II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Miguel Ángel Asturias or Kurt Vonnegut?",
        "response": "Miguel Ángel Asturias",
        "source": "hotpot_qa"
    },
    {
        "query": "The film based on a William Shakespeare play stars an actor who is know for playing dark and troubled characters of what ethnicity?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What Lady Gaga song did the Oxford Belles mix with Rihanna's third single from the reloaded edition of her album \"Good Girl Gone Bad\"?",
        "response": "\"Just Dance\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was created first, The Plow That Broke the Plains or Hollywood Chinese?",
        "response": "The Plow That Broke the Plains",
        "source": "hotpot_qa"
    },
    {
        "query": "What shallow water table aquifer is located near the county seat of Keith County, Nebraska?",
        "response": "Ogallala Aquifer",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy George is a dean at what university located in Homewood, Alabama?",
        "response": "Samford University",
        "source": "hotpot_qa"
    },
    {
        "query": "What was named one of the seven wonders fo the architetural world by the magazine that has won twenty-five National Magazine awards?",
        "response": "the Red Ribbon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ukranian Canadian businessman is both the owner of an ice hockey team and a successful racehorse breeder?",
        "response": "Eugene Melnyk",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the NFL team based in Ohio whose home ground is a multi-purpose stadium which features The Dawg Pound, the name of the bleacher section behind the east end zone known for having passionate fans?",
        "response": "Cleveland Browns",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2013 film was nominated for the Palme d'Or at the 2013 Cannes Film Festival that starred the 2014 Tribeca Film Festival best actress?",
        "response": "A Castle in Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which leading Libyan revolutionary was killed in the Second Gulf of Sidra offensive?",
        "response": "Muammar Gaddafi",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one of the nearest town to the base where \"No. 26 Squadron RAAF\" was headquartered?",
        "response": "Raymond Terrace",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean actress born in 1979 appeared in the South Korean television series, \"Whisper\"?",
        "response": "Lee Bo-young",
        "source": "hotpot_qa"
    },
    {
        "query": "Another Earth starred the actress who was in what 2004 documentary?",
        "response": "Boxers and Ballerinas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opened first, the Whitewater Canal or Lock No. 1, North New River Canal?",
        "response": "Whitewater Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Haslam was an organic chemist that graduated from a sixth form college located in?",
        "response": "Northwich, Cheshire, United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "which property in Oklahoma can you find Serkan Ozkaya's work?",
        "response": "21c Museum Hotels",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a longer life, Giacomo Gentilomo or Claude Sautet?",
        "response": "Giacomo Gentilomo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer and director does Kym Barrett collaborate with?",
        "response": "The Wachowskis",
        "source": "hotpot_qa"
    },
    {
        "query": "Chaplin is a 1992 British-American biographical comedy-drama film about the life of the British comedian, it stars which American actress, born on December 4, 1964?",
        "response": "Marisa Tomei",
        "source": "hotpot_qa"
    },
    {
        "query": "What footballer was rejected after a trial by former Northern Ireland football manager born 5 August 1931?",
        "response": "Cochrane",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Thom Beers television series that features the activities of drivers who operate trucks on seasonal routes crossing frozen lakes and rivers take place?",
        "response": "Manitoba's winter roads",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was created first Lucire or W ?",
        "response": "W",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the wife of French writer Cyril Montana born?",
        "response": "Jakarta",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the most famous single from the 1994 album \"No, No, No\"?",
        "response": "You Don't Love Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was produced first, Summer Magic or Hocus Pocus?",
        "response": "Summer Magic",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1988 Indian Hindi-language romantic drama film in which Imran Khan appeared as a child artist?",
        "response": "Mansoor Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was produced first, Winnie the Pooh or Alice in Wonderland?",
        "response": "Alice in Wonderland",
        "source": "hotpot_qa"
    },
    {
        "query": "Do You Believe Me Now is the second studio album of American country music singer Jimmy Wayne, the album is also Wayne's first album in five years and his debut for Valory Music Group, a subsidiary of which independent American record label specializing in country and pop artists, and  based on Music Row in Nashville, Tennessee, and is distributed by Universal Music Group (UMG)?",
        "response": "Big Machine Records, LLC",
        "source": "hotpot_qa"
    },
    {
        "query": "What genus of gecko, other than Hyplodactylus, is endemic to New Zealand and able to give live birth?",
        "response": "Naultinus",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American figure skater, actress, and sports commentator coached by Richard Callaghan for Olympic games, the U. S. national champion?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Noah and Neon Trees rock bands from Indonesia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the relationship between the two women who organized the car bombings of Old Bailey and Scotland Yard?",
        "response": "sister",
        "source": "hotpot_qa"
    },
    {
        "query": "Howard Webb was the referee in a game that saw Bayern Munich lose by two goals by a team who had won the European cup back to back in which two years ?",
        "response": "1964 and 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the former Trump campaign manager who promoted Jack Posobiec's tweets?",
        "response": "August 27, 1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Constantine developed the main administrative divisions of what?",
        "response": "middle Eastern Roman Empire",
        "source": "hotpot_qa"
    },
    {
        "query": "What William Shakespeare play was written in 1599 and based on true events in Roman history?",
        "response": "Julius Caesar",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the drama type of art which is very near to Chindu Bhagavatam is traditionally performed during what portion of the day? ",
        "response": "from dusk to dawn",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the theme park served by the Huis Ten Bosch train service themed on?",
        "response": "Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the geographical region that early Islamic usage often regarded everywhere east of western Persia and where Vistaham helped Khosrow regain his throne after the rebellion of Bahram Chobin?  ",
        "response": "Khorasan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Golden Triangle where the fortune of an American entrepreneur and engineer who invented what was made?",
        "response": "railway air brake",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the main nickname of the professional association football club where Ewan Fenton spent thirteen seasons?",
        "response": "\"the Seasiders\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of the author of The Trump Card: Playing to Win in Work and Life?",
        "response": "Donald Trump",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the lead actors in Jumper?",
        "response": "Andrew James Matfin Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "General John J. Pershing operated on which main theatre of war during the First World War?",
        "response": "The Western Front",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of moth in the world's seventh-largest country contains only one species?",
        "response": "Crambidae",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town that Anthony Colby was originally from?",
        "response": "4,397",
        "source": "hotpot_qa"
    },
    {
        "query": "What Daou band member created a website who's slogan is \"media for the 65.8 million\"?",
        "response": "Peter Daou",
        "source": "hotpot_qa"
    },
    {
        "query": "Ike Turner worked with which famous American Chicago blues and electric blues pianist and organist? ",
        "response": "Johnny \"Big Moose\" Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "Sven Ottke is a professional boxer who was the third European boxer to retire as an undefeated world champion, following in the footsteps of what English boxer?",
        "response": "Terry Marsh",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Georges Méliès and Alexander Kluge have in common?",
        "response": "film director.",
        "source": "hotpot_qa"
    },
    {
        "query": "Mess Kid has worked with companies such as that run by which former creative director of Balenciaga?",
        "response": "Alexander Wang",
        "source": "hotpot_qa"
    },
    {
        "query": "Kautokeino Airport was rebuilt in 1958 by an air force that was established as a separate arm of the army in what year ?",
        "response": "1944",
        "source": "hotpot_qa"
    },
    {
        "query": "Diane Roark was wrongly suspected of leaking information to a New York Times reporter that has co-written two books about what agency?",
        "response": "Central Intelligence Agency",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of this American professional basketball player, who entered the league out of high school and was a recruit to the 2004-05 Duke Blue Devil men's basketball team?",
        "response": "September 11, 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from Atlanta and has released a joint project with Zaytoven?",
        "response": "Bankroll Fresh",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Bad Batch is born in 1992?",
        "response": "Suki Waterhouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that Conrad Vernon for mainly located?",
        "response": "Glendale, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The name of Dreyse needle gun's succesor was also called what?",
        "response": "Fusil Mle 1886 M93",
        "source": "hotpot_qa"
    },
    {
        "query": "The country FK Dubočica is from has around how many residents?",
        "response": "7 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand was marketed earlier--Crusha or Grapette?",
        "response": "Grapette",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the drama film directed by Mark Pellington starring Patton Oswalt?",
        "response": "Nostalgia",
        "source": "hotpot_qa"
    },
    {
        "query": "Mikael Åkerfeldt and Lee Ranaldo were this kind of instrumentalist in their respective bands. ",
        "response": "Guitarists",
        "source": "hotpot_qa"
    },
    {
        "query": "Morning Glory starred the American actor who is a regular on what Showtime/BBC series?",
        "response": "Episodes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which castle serving as the seat of clan chief John MacLeod of Macleod was was remodelled in a mock-medieval style?",
        "response": "Dunvegan Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British Formula One race car driver finished 3rd in the 1995 British Grand Prix, and also was runner-up in the 2001 Formula One World Drivers' Championship?",
        "response": "David Coulthard",
        "source": "hotpot_qa"
    },
    {
        "query": "What characteristic does the Quince and the Isoplexis share? ",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "During which period the sedan variant of the Volvo V50 car was manufactured?",
        "response": "1995 to 2012",
        "source": "hotpot_qa"
    },
    {
        "query": " Katharine Kerr and Gwendolyn Brooks both sci-fi novelists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founder of Ruthless Records passed away in 1995 ?",
        "response": "Eazy-E",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the university Leila Doolan went to founded?",
        "response": "1854",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernd Hölzenbein, is a German former footballer, best known for being fouled, in the final against Netherlands in 1974, what was this event called?",
        "response": "1974 FIFA World Cup Final",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the last that Jacqueline Kennedy Onassis rode in the SS-100-X?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What position does the writer and director of \"Generation Zero\" hold at Breitbart News?",
        "response": "executive chairman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Sooner was drafted by the Giants in the second round of the 2016 NFL drafter?",
        "response": "Sterling Clay Shepard",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of ''Cryin'' singer Steven Tyler of Aerosmith?",
        "response": "\"Demon of Screamin'\" due to his high screams",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Hillary Clinton's, former United States Secretary of State, mothers name?",
        "response": "Dorothy Emma Rodham",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the man who attempted to assassinate Adolph Botnick from?",
        "response": "Greenwood, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "who co-write the song which Taylor Swift videography released its video ",
        "response": "Swift and Liz Rose",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1945 American comedy film, directed by Hal Walker, did Eddie Bracken, the comedy legend that appeared in \"Hail the Conquering Hero\" and \"The Miracle of Morgan's Creek\" appear?",
        "response": "Duffy's Tavern",
        "source": "hotpot_qa"
    },
    {
        "query": "Prince of the South 2 is the third studio album by a rapper born in which year ?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the given name of the creator of the Album released on July 7, 2017 by Slaughter Gang and Epic Records?",
        "response": "Shayaa Bin Abraham-Joseph",
        "source": "hotpot_qa"
    },
    {
        "query": "Upon which book series is the British television detective drama in which Laura Howard played the role of Cully Barnaby based?",
        "response": "\"Chief Inspector Barnaby\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Muse or The Raconteurs?",
        "response": "The Raconteurs",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the occupation of both Lev Pontryagin and Vladimir Drinfeld?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie featuring Chris Coppola was directed by Marcus Nispel ?",
        "response": "Friday the 13th",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the scientist who first sketched out Constructor theory ?",
        "response": "Elieser",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacob Farrow has worked as a writer and producer for a number of series created by the co-president of what production company?",
        "response": "Schneider's Bakery",
        "source": "hotpot_qa"
    },
    {
        "query": "Murshidabad Medical College and Hospital is a medical institution based in what country?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which feature named for he Scottish Gaelic word for lake is south of Beinn Alligin?",
        "response": "Loch Torridon",
        "source": "hotpot_qa"
    },
    {
        "query": "Members of the social club for Harvard students known as the Hasty Pudding Club formed what kind of singing group, called The Harvard Krokodiloes, in 1946?",
        "response": "a cappella",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the college that Sam Adams Sr located?",
        "response": "Prairie View, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "John G. West helped found the neo-creationist religious campaign for broad social, academic and political change to promote and support the pseudoscientific idea of intelligent design and main hub of the Intelligent design movement from what area-based Discovery Institute?",
        "response": "Seattle-based",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the first song Anthony Mandler directed the music video for with Rihanna?",
        "response": "Shaffer \"Ne-Yo\" Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "The southern border of the state in the southern region of the United States represented by Frank Alexander McLain forms what ?",
        "response": "Gulf of Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the Orianthi single which peaked at No. 3 in Japan?",
        "response": "Howard Benson",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Commonweal or Truckin' Magazine have more editors?",
        "response": "Commonweal",
        "source": "hotpot_qa"
    },
    {
        "query": "I Am Your Gummy Bear is the debut album by what German multilingual character?",
        "response": "Gummibär",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is located closer to the Grand Post Office building at Sirkeci quarter of Fatih district in Istanbul, Veliefendi Race Course or Istanbul Postal Museum",
        "response": "Istanbul Postal Museum",
        "source": "hotpot_qa"
    },
    {
        "query": "Cuando habla el corazón stars what actor born in 1917?",
        "response": "Pedro Infante Cruz",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the first novel written by the author of \"No Longer at Ease\"?",
        "response": "Things Fall Apart",
        "source": "hotpot_qa"
    },
    {
        "query": "What state is the 8th Air Division and the McClellan Air Force Base located?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "The Trial, released in which year, is a film directed by Orson Welles, the film begins with Welles narrating Kafka's parable \"Before the Law\" to pinscreen scenes created by the artist Alexandre Alexeieff, was a Russian Empire-born artist, filmmaker and illustrator who lived and worked mainly in Paris?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Sofian El Fani's credits include a 2013 French coming-of-age romantic drama film based on a graphic novel by who?",
        "response": "Julie Maroh",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014–15 Missouri Tigers women's basketball team play their games at what indoor arena? ",
        "response": "Mizzou Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "American singer-songwriter Taylor Swift has released four video albums, and has appeared in thirty-eight music videos, five films and three television shows, for the video of which song performed by American singer-songwriter Taylor Swift, and she won Best Female Video at the 2009 MTV Video Music Awards?",
        "response": "You Belong with Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what nationality is the man who had input into the album Matangi?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book in \"The Mayfair Witches\" series includes Lestat?",
        "response": "Blackwood Farm",
        "source": "hotpot_qa"
    },
    {
        "query": "Taxi 4 is a 2007 French comedy film that featured which French footballer who plays for Swiss club Yverdon?",
        "response": "Djibril Cissé",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member from the original 1984 movie made a cameo appearance in the 2016 comedy remake?",
        "response": "Dan Aykroyd",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Bronson and Enzo Maccarinelli are professional boxers in what class?",
        "response": "cruiserweight",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had their Houston Aeros debut in the 1973-74 season and is nicknamed \"Mr. Hockey\"?",
        "response": "Gordie Howe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which other animations franchise was involved in the production of a television series, alongside Disney, which was released originally as an animation in 1961, and then remade in 1996 in a live-action version where none of the animals talk?",
        "response": "Jumbo Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Rogue Ales Brewery Co-founded by Jack Joyce located?",
        "response": "Ashland, Oregon, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "REMIXXXX is an album by You Say Party, released on which date, \"REMIXXXX\" is a reworking of their previous album \"XXXX\"?",
        "response": "September 21, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Henricus Antonius \"Han\" van Meegeren sold a forged painting to a military leader who was the recipient of what?",
        "response": "Pour le Mérite",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer-songwriter wrote songs influenced by alternative rock as well as country for her album released in 2012?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": " In what year was the man who remarked on Benson Idahosa as the greatest African ambassador of the apostolic Christian faith to the world born?",
        "response": "1923",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in the 2016 comedy film co-written by an American actor who was a cast member of MADtv and starred in Suicide Squad?",
        "response": "Kevin Hart and Dwayne Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the plane flown by Kampfgeschwader 55, exclusively untill 1943, designed?",
        "response": "Heinkel Flugzeugwerke",
        "source": "hotpot_qa"
    },
    {
        "query": "The song that is about a soul with incarnations in four different places in time and history is a single that is recorded by what record company?",
        "response": "Columbia Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which number president of the United States was honored at the Odd Fellows Hall after the Civil War?",
        "response": "18th",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Henry Selick and John Badham, who was the director of Coraline?",
        "response": "Henry Selick",
        "source": "hotpot_qa"
    },
    {
        "query": " Loudoun Kirk is a disused church located about one mile west of a castle from which century ?",
        "response": "19th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "Which univeristy was founded first, Manipal Institute of Technology or University of Cape Town?",
        "response": "University of Cape Town",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the organization where Jeremy O'Grady was a senior examiner founded?",
        "response": "1912",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal is longer, The Central Arizona Project or the Oswego Canal?",
        "response": "The Central Arizona Project",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 54th Disney animated feature film that won the Oscar for Best Animated Feature in 2015?",
        "response": "Big Hero 6",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nintendo Power and Model Aviation both magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the village between Wilmslow and Knutsford and close to Dukenfield Hall?",
        "response": "Mobberley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the State Chairman of the party  to which Frosty Boss Ribs belongs ?",
        "response": "Jim Elliott",
        "source": "hotpot_qa"
    },
    {
        "query": "Guanahani was visited by an explorer's first voyage born where?",
        "response": "Republic of Genoa",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Peter Grimes and Rusalka written by the asme person?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The current champion of NBA All-Star Weekend Skills Challenge was drafted in which year?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What career do Harmony Korine and Vincent Kok have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in Nevada is named after a career United States Army officer who service in the Mexican-American War?",
        "response": "Reno",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the producers of the show for which Chris McKay made his feature film directorial debut?",
        "response": "Dan Lin, Roy Lee, Phil Lord and Christopher Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lucie Šafářová and Pavel Složil both Czech tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Minneapolis Forum Cafeteria was located at 36 South 7th Street originally constructed in 1914, a 1930 reconstruction created a cafeteria with a stunning Art Deco interior of black onyx and pale green tiles, and which type of ships were marine vessels of unique design, built by the Vikings during the Viking Age?",
        "response": "Viking ships",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the asteroid named after the first Israeli astronaut for NASA discovered?",
        "response": "July 20, 2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked on most different areas, Ali Campbell or Mr Lordi?",
        "response": "Mr Lordi",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Franca: Chaos and Creation\" is a documentary about an editor-in-chief of \"Vogue Italia\" that died in what year?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What city and nation was the location of the 2015 Pacific Games where the Kiribati national basketball team finished with a 0-4 record?",
        "response": "Port Moresby, Papua New Guinea",
        "source": "hotpot_qa"
    },
    {
        "query": "Have both of these novelists, Booth Tarkington and Sarah Waters, won Pulitzer Prizes for Fiction?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building will be taller, One Manhattan Square or 56 Leonard Street?",
        "response": "One Manhattan Square",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of band were Supergrass and 7 Year Bitch?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which vehicle that won the Auto Trader RAC British Touring Car Championship was marketed and produced by a Swedish manufacturer?",
        "response": "Volvo S40",
        "source": "hotpot_qa"
    },
    {
        "query": "Cynthia May Carver, known professionally as Cousin Emmy, was a banjo player and country singer who was one of the pioneering solo female stars in the country music industry, her song \"Ruby, Are You Mad at Your Man?\", became a bluegrass standard after it was covered by the Osborne Brothers, were an influential and popular bluegrass act. during which time period?",
        "response": "1960s and 1970s",
        "source": "hotpot_qa"
    },
    {
        "query": "Ross Partridge, is an American actor, director, screenwriter and producer, he worked on a number of films produced by Kevin Spacey's production company, called what?",
        "response": "Trigger Street Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the father of Kund and grandfather of the princess of Denmark?",
        "response": "Christian X",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Michael Crafter known for being a guitarist in a heavy metal band like Matt Heafy was?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "I Am My Brother's Keeper is a 1970 album by Motown vocalists and siblings David Ruffin and Jimmy Ruffin, an American soul singer, who had several hit records during what years, the most successful being the Top 10 hits \"What Becomes of the Brokenhearted\" and \"Hold On (To My Love)\"?",
        "response": "the 1960s and 1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the beginning date of this inaugural season of a new FIA Champoinship for electrically powered cars, in which the Buenos Aires ePrix was first raced?",
        "response": "13 September 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Lada Negrul, is a Russian actress and poet, she also performs sound poetry and songs by Alexander Galich and who?",
        "response": "Vladimir Vysotsky",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a village and civil parish in Three Rivers District, Hertfordshire, that has a bishop of the Anglican Communion and the former Bishop of Chile, Bolivia & Peru ?",
        "response": "Chorleywood",
        "source": "hotpot_qa"
    },
    {
        "query": "Edgemar was designed by the architect that resides in what city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Andrew Huxley and Alan Lloyd Hodgkin have in common?",
        "response": "biophysicist",
        "source": "hotpot_qa"
    },
    {
        "query": "What unit sent detachments to the main theatre of war during the First World War?",
        "response": "The 1st Durham Engineers",
        "source": "hotpot_qa"
    },
    {
        "query": "Akitsushima has been the name of two ships in a navy that was dissolved following what war?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another name for the league Art Passarella umpired?",
        "response": "Junior Circuit",
        "source": "hotpot_qa"
    },
    {
        "query": "Sun Mark owns which brand founded in 1869?",
        "response": "Heinz",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor that hosted 64th Academy Awards born? ",
        "response": "March 14, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Rules of Engagement and CBS have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1944 British musical comedy film starring \"the Forces' Sweetheart\"?",
        "response": "Walter Forde",
        "source": "hotpot_qa"
    },
    {
        "query": "when was The 52nd annual Berlin International Film Festival held?",
        "response": "February 6 to 17, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Consolata Boyle is an Irish costume designer based in Dublin, she has been nominated twice for the Academy Award for Best Costume Design for her work on two of his films, including Florence Foster Jenkins, released in which year, was an American socialite and amateur soprano who was known and mocked for her flamboyant performance costumes and notably poor singing ability?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the capital of the Arab country, in which the Aulacodes peribocalis moth is found, relocated to?  ",
        "response": "Aden",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has worked with more artists, Taylor Momsen or Steve Lukather?",
        "response": "Steven Lee Lukather",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played the leading role in the independent film \"A Perfect Ending\" also stars with John Bregar in a 2008 film directed by who?",
        "response": "Douglas Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Shelving worked at the Stratford-upon-Avon theatre that has how many seats?",
        "response": "1,040+",
        "source": "hotpot_qa"
    },
    {
        "query": "Mad Dash Racing features the voice of this American voice actor born in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Azzip Pizza and Buddy's Pizza both restaurant chains?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What ride is simlar to a swing boat and has an open, seated gondola?",
        "response": "A pirate ship",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006 Asia Series was held in what stadium that has an all-seating configuration of 42,000?",
        "response": "Tokyo Dome",
        "source": "hotpot_qa"
    },
    {
        "query": "How many rooms are at the hotel where the 2005 Las Vegas Desert Classic was held?",
        "response": "5,124",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the band that sang \"I'm One\" formed?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Kiskiack is a building that still stands at what York County, Virginia naval base?",
        "response": "Naval Weapons Station Yorktown",
        "source": "hotpot_qa"
    },
    {
        "query": "The Day You Went Away: The Best of M2M is the last album and greatest hits compilation by which Norwegian pop music duo?",
        "response": "M2M",
        "source": "hotpot_qa"
    },
    {
        "query": "What groups name means \"sweet melody\" and features an album called Girl's Talk?",
        "response": "Kara",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the current CEO of Station Casinos found Zuffa with?",
        "response": "Lorenzo Fertitta",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Sutherland was held hostage for 2353 days and released at the same time as English humanitarian and author born on what day?",
        "response": "born 31 May 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first single on the Taylor Swift album which also contained a song originally written for Swift's high-school talent show?",
        "response": "\"Tim McGraw\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Hugo Adam Bedau used the example of an American domestic terrorist to support what political policy?",
        "response": "anti-death-penalty",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the fanzine that interviewed the Sex Pistols bassist when he was in the band \"The Flowers of Romance?\"",
        "response": "SKUM",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has worked for more film companies, Kelly Reichardt or Jacques Tourneur?",
        "response": "Jacques Tourneur",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Kai Hansen and Piotr Wiwczarek known for being guitarists for their respective bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, British novelist Doris Lessing or American writer Philip K. Dick?",
        "response": "Doris May Lessing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rebellion did Sir John Wedderburn and Charles Edward Stuart fight for that ended with defeat at the Battle of Culloden?",
        "response": "the unsuccessful Jacobite uprising of 1745",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is from farther west, Woman's Viewpoint or Al Jamila?",
        "response": "Woman's Viewpoint",
        "source": "hotpot_qa"
    },
    {
        "query": "Sansha and Gongqingcheng, are in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Spacemen 3 and Said the Whale English bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The language spoken in the industrial town and cargo port in Cheshire, England is also referred to as what? ",
        "response": "Liverpool English or Merseyside English",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the intelligent, neurotic and introspective character that William Faulkner created in his fourth novel, published in 1929?",
        "response": "Quentin Compson",
        "source": "hotpot_qa"
    },
    {
        "query": "What Minnesota county is the University of Minnesota in?",
        "response": "Hennepin County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a single by Gorillaz that is named after an actor?",
        "response": "Clint Eastwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Shum Laka is a site that was important to the diffusion of the people who were from what continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the fourth episode of the tv series \"Black Mirror\", directed by Owen Harris?",
        "response": "San Junipero",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the song, which includes Young Jeezy, will.i.am, Justin Timberlake and Slash, released?",
        "response": "May 18, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Munif Mohammed Abou Rish was a Palestinian journalist, who in 1974 planned to assassinate a politician born in which year ?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "Beyond the Fridge featured a performance by Jonathan miller who first came to prominence when?",
        "response": "early 1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "Nuestra Belleza México 2010 was crowned by the winner of what other 2010 pageant, the winner of which was crowned on 23 August 2010?",
        "response": "Miss Universe 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "A music group whose members are already successful as solo artists, such as Serpentine Dominion, is called what?",
        "response": "A supergroup",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Anne Frank and Romain Rolland have the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "William Hughes Miller was born in a city with how many inhabitants ?",
        "response": "7,402 at the 2010 census",
        "source": "hotpot_qa"
    },
    {
        "query": "which is located further east, The Susquehanna and Tidewater Canal or the Portage Canal?",
        "response": "Susquehanna and Tidewater Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American author and mother of film and television producer Bryan Spears, who wrote a novel based on Britney's life?",
        "response": "Lynne Irene Spears",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed first, Aaroh or Goldfinger?",
        "response": "Goldfinger",
        "source": "hotpot_qa"
    },
    {
        "query": "The Earth Tower is in the casino that holds the studio of what station?",
        "response": "WMOS",
        "source": "hotpot_qa"
    },
    {
        "query": "George W. Forbes excoriated Booker T. Washington for the agreement struck in what year regarding race relations?",
        "response": "1895",
        "source": "hotpot_qa"
    },
    {
        "query": "Seal Harris was born in what county?",
        "response": "Polk County",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Jimmie Ross and Colin Hay both lead vocalists in their bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian city did Randy Bachman form a rock band in 1965?",
        "response": "Winnipeg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bachelor, season 5, is the fifth season of ABC reality television series \"The Bachelor\", the show featured the first non-American bachelor, Jesse Palmer, a Canadian sports commentator and former college and professional football player who was a quarterback in which organization?",
        "response": "National Football League (NFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "The character Igor Dmitriev played in \"Hamlet\" was summoned by what king to distract the prince from his apparent madness?",
        "response": "King Claudius",
        "source": "hotpot_qa"
    },
    {
        "query": "Allan McKay was the visual effects supervisor for a 2012 movie about an airline pilot that stared what actor?",
        "response": "Denzel Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Será de Dios\" was a pop ballad featuring the vocals of an Argentine actress and what?",
        "response": "model",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was William Stephens Smith's wife named after?",
        "response": "her mother",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the relationship between Chembai Bhagavatar and Lalgudi Jayaraman?",
        "response": "mentored",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the home venue of the rugby club in England on which Scott Armstrong plays full-back or wing?",
        "response": "Woodlands Memorial Ground",
        "source": "hotpot_qa"
    },
    {
        "query": "The British Aerospace ATP (Advanced Turbo-Prop) is an airliner produced by British Aerospace, by the time it entered the market, the segment was already well represented by designs such as the ATR 72 is a twin-engine turboprop, short-haul regional airliner developed and produced in which two countries, by aircraft manufacturer ATR?",
        "response": "France and Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "HCF CATCH is an industry led, not-for-profit, training facility located in a village and civil parish that is where?",
        "response": "North East Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the rating of the highest charting album from Judy Collins that includes the song from \"Love Actually\"?",
        "response": "5",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Losing my religion come out?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Vincent Lacrocq is a French model who headlined a campaign in the city of Byblos, which was built by Cronus as the first city in which country?",
        "response": "Phoenicia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are San Luis Obispo County Regional Airport and Ketchikan International Airport both located in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Snowshoe Peak is the highest peak in a part of the Rocky Mountains that cover how many square miles?",
        "response": "2,134",
        "source": "hotpot_qa"
    },
    {
        "query": "Winterton Community Academy is located in a small town that had how many inhabitants in 2011 ?",
        "response": "4,899",
        "source": "hotpot_qa"
    },
    {
        "query": "What uncompleted opera was composed by the composer of Il signor Fagotto?",
        "response": "\"The Tales of Hoffmann\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Lucy Gichuhi or Bob Day?",
        "response": "Bob Day",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rapper wrote a song based on a power ballad from Aerosmith's 1973 debut Album?",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of the 2009 novel \"Fame\" is noted for his best work titled what?",
        "response": "\"Die Vermessung der Welt\" (translated into English by Carol Brown Janeway as \"Measuring the World\", 2006)",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lacar Lake and the province of Neuquen are located where?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": " Elo and Bracco Italiano are both a what?",
        "response": "breed of dog",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the quadrennial international men's football championship that the 2018-19 UEFA Nations League is a qualifier for?",
        "response": "2020 UEFA European Football Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who appeared in a film about a superhero named Wade Wilson played what role in the series Firefly?",
        "response": "Inara Serra",
        "source": "hotpot_qa"
    },
    {
        "query": "What American guitarist and songwriter claimed that one who wrote \"Rockaway Beach\", Dee Dee Ramone, was \"the only real beachgoer\" in the group?",
        "response": "Johnny Ramone",
        "source": "hotpot_qa"
    },
    {
        "query": "The virus the development of vaccines against which Ian Gust is best known for causes a disease of what organ?",
        "response": "liver",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2005 romance film did the director of Anthony McCarten's 2017 British war drama film work on?",
        "response": "Pride & Prejudice",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel did an author who was featured in the Voices of Ghana and later became a journalist write?",
        "response": "The Gab Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who plays the grown version of Emma Swan's son, from \"Once Upon a Time\", also plays what character in the television show \"The Walking Dead\"?",
        "response": "Gareth",
        "source": "hotpot_qa"
    },
    {
        "query": "What Christian rock band featuring Chad Shirrell released their self titled debut in January 2012?",
        "response": "Pioneer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kenneth Clark and William March both British?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When did this American Southern rock band with multiple guitar players and a heavy metal drummer reach it's peak?",
        "response": "1970s",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Subhash Ghai and Mick Jackson of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the net worth of the founder of Intel Corporation as of 2016?",
        "response": "7.3 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress starred in Whit Stillman's movie Damsels in Distress?",
        "response": "Greta Gerwig",
        "source": "hotpot_qa"
    },
    {
        "query": "What footballer took over Lee Johnsons management position with Barnsley and Oldham Athletic?",
        "response": "Dean Thomas John Holden",
        "source": "hotpot_qa"
    },
    {
        "query": "Which event began first, the Western Allied invasion of Germany or the Battle of Aachen?",
        "response": "The Western Allied invasion of Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Tom Stoppard and Yasunari Kawabata a novelist?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Green and Rob Hyman, are both of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cardigan Pluton was built during what Middle Devonian period?",
        "response": "Acadian orogeny",
        "source": "hotpot_qa"
    },
    {
        "query": " Hariharan Pillai Happy Aanu contains music by which arranger from Kerala?",
        "response": "Stephen Devassy",
        "source": "hotpot_qa"
    },
    {
        "query": "Baicheng and Hsinchu, are which type of human settlement?",
        "response": "city",
        "source": "hotpot_qa"
    },
    {
        "query": " Harrah's Lake Tahoe is a hotel and casino owned and operated by the fourth-largest gaming company in the world, with annual revenues of what in 2013?",
        "response": "$8.6 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Roberto Vittori and Helen Sharman both been in space?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote a work that described European history until the dawn of the age of the longest serving monarch in European history?",
        "response": "Voltaire",
        "source": "hotpot_qa"
    },
    {
        "query": "which cousin is older?",
        "response": "Mohamed Sissoko",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality were Ronald Reagan and Peggy Noonan?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the film produced that Diana Körner is probably most known for?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Maclellan of Bombie was Provost of what town, as well as constructing MacLellan's Castle in the center of that town?",
        "response": "Kirkcudbright, southwest Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town lies between Frogmore and St Albans in Hertfordshire, just inside the M25 motorway that circles London?",
        "response": "Radlett",
        "source": "hotpot_qa"
    },
    {
        "query": "William Walton and Judith Weir had what similar titles?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Crepis and Bouteloua both a genus of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Charles D. Provan attend college before transferring to the University of Pittsburgh?",
        "response": "Greenville, South Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "\"What U Workin' With?\" was recorded for a movie created by who?",
        "response": "Thomas Dam",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did the team that won premierships in both 1992 and 1994 lose in the Grand Final to Hawthorn for the first time?",
        "response": "Melbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "Indiana Central Canal and North Shore Channel, are related to water?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What are examples of athletic teams at University of Hawaii at Manoa that are in the NCAA Division 1 level for softball and other sports?",
        "response": "Hawaii Rainbow Warriors and Rainbow Wahine",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the CBS station that features children's show Gator Tales?",
        "response": "St. Louis, Missouri, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Sun Yu and Leos Carax were both what?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Petersburg Academic University is headed by a physicist born in which year ?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "The White Panthers were a far-left, anti-racist, white American political collective founded in 1968, it was started in response to an interview where Huey P. Newton, co-founder of which revolutionary black nationalist and socialist organization, was asked what white people could do to support the Black Panthers?",
        "response": "Black Panther Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the founder of the company where Patrick MacDonogh held a senior executive post born?",
        "response": "1725",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has had more members, The Operation M.D. or Del Amitri?",
        "response": "Del Amitri",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the position of the player, who played with Chris Jones, currently with Derby County?",
        "response": "goalkeeper",
        "source": "hotpot_qa"
    },
    {
        "query": "The red-eyed wrasse is native to Indonesia and an island located in what ocean?",
        "response": "Indian Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the University of New Hampshire and King Mongkut's University of Technology Thonburi both research schools?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Harry Potter and the Deathly Hallows is the seventh and final novel of the \"Harry Potter\" series, the series ended that began in 1997 with the publication of which J. K. Rowling novel?",
        "response": "Harry Potter and the Philosopher's Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Idiot's Delight showcases an actor born in what year?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "How many marchers were in the protest that Pelham D. Glassford ended? ",
        "response": "43,000 marchers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the guitarist for the band who released the album \"American Idiot?\"",
        "response": "Billie Joe Armstrong",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Daddy was the highest-grossing film by Adam Sandler until a 3D computer animated fantasy-comedy film directed by who?",
        "response": "Genndy Tartakovsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Gummo is the soundtrack album to the film of the same name, and contains songs that were recorded specifically for the film, or were featured in the film, the soundtrack is most notably an abridged version of Burzum, a music project that began in what year, by the Norwegian musician and writer Varg Vikernes?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Nowhere Boy is a 2009 British biographical musical drama film, about John Lennon's adolescence, his relationships with his aunt Mimi Smith and his mother Julia Lennon, the creation of his first band, the Quarrymen, and its evolution into the Beatles, the film is based on a biography written by Lennon's half-sister, who is the younger half-sister of English musician John Lennon and is the eldest daughter of John 'Bobby' Albert Dykins?",
        "response": "Julia Baird",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Klay Thompson's teammate that was named NBA All-Defensive Second Team in 2015?",
        "response": "Andrew Michael Bogut",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the jazz combo, that released the album \"Music from Odds Against Tomorrow\", established?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Mikael Salomon or Miklós Jancsó?",
        "response": "Miklós Jancsó",
        "source": "hotpot_qa"
    },
    {
        "query": "Rudolph the Red-Nosed Reindeer: The Movie starred the actress who was nominated for the Golden Globe in 1950 in what category?",
        "response": "Most Promising Newcomer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player was born first out of Menno Oosting and Anna-Lena Grönefeld?",
        "response": "Menno Oosting",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1971 Oklahoma State Cowboys football team played for the college that was founded in what year?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian-born psychologist conducted the Stanford Marshmallow experiment?",
        "response": "Walter Mischel",
        "source": "hotpot_qa"
    },
    {
        "query": "Huston and Truman Capote's parody film \"Beat the Devil\"  was loosely based on whom that was born in 1904?",
        "response": "Claud Cockburn",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Puss\"/\"Oh, the Guilt\" is a split single from Nirvana and what other alternative rock band based in Chicago, Illinois?",
        "response": "The Jesus Lizard",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, Two Door Cinema Club or Us Amongst The Rest, was recording their debut album in July of 2014?",
        "response": "Us Amongst The Rest",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is the grading system based on a 1/4 point scale and has five letter grades?",
        "response": "the United States",
        "source": "hotpot_qa"
    },
    {
        "query": "This Canadian playwright is best known for co-writing a musical set in the weeks following what?",
        "response": "September 11 attacks",
        "source": "hotpot_qa"
    },
    {
        "query": "Eighth Street station is one mile west of which neighborhood in Miami?",
        "response": "Little Havana",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Dubstar or Audioslave?",
        "response": "Dubstar",
        "source": "hotpot_qa"
    },
    {
        "query": "How large in area is the studios that were once part of the cemetery where George Hackathorne was interned ?",
        "response": "40 acres",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is Gennady Golovkin's opponent from his title fight on October 17, 2015?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "What conference did former Oklahoma Sooners star Willie Warren play in?",
        "response": "Big 12 Conference.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did the author of the Bradley Amendment serve as senator?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the Beatles' song that was covered during Dokken's performance for their \"unplugged\" album?",
        "response": "John Lennon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which boy band is a star of Good Manager part of?",
        "response": "2PM",
        "source": "hotpot_qa"
    },
    {
        "query": "HMS \"Florentina\", was the Spanish frigate \"Santa Florentina\", built in 1786 at Cartagena, Spain, she served in the Mediterranean until she returned to Britain in which year, after the Treaty of Amiens?",
        "response": "1802",
        "source": "hotpot_qa"
    },
    {
        "query": "Baseball Manager is a 1963 pop art painting visible at a neomodern form of baseball architecture with a seating capacity of what?",
        "response": "37,442",
        "source": "hotpot_qa"
    },
    {
        "query": "Siren is a spinoff of the 2012 anthology film created by which two people?",
        "response": "Brad Miska and Bloody Disgusting",
        "source": "hotpot_qa"
    },
    {
        "query": "What daughter of Catherine of Guise was also an aristocratic client of Monsieur Champagne?",
        "response": "Marie Louise Gonzaga",
        "source": "hotpot_qa"
    },
    {
        "query": "Corner in Celebrities Historic District  contains the historic home of the politician who served what post twice under Presidents Harrison, Tyler, and Fillmore?",
        "response": "United States Attorney General",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is located in North Dakota, Grand Forks International Airport or Knox County Regional Airport?",
        "response": "Grand Forks International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Howard Knob rises nearly 1000 ft above the town of Boone and a campus also referred to as?",
        "response": "Appalachian, App State, App, ASU",
        "source": "hotpot_qa"
    },
    {
        "query": "The first person to interpret Relational quantum mechanics has worked in what countries? ",
        "response": "Italy, the United States and since 2000, in France",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the shopping centre on the street numbered B411 open in the space of in the retail space of the former William Whiteley Limited department store?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "The 9th Amphibian Tractor Battalion was integral to the Pacific War battle nicknamed what?",
        "response": "Operation Iceberg",
        "source": "hotpot_qa"
    },
    {
        "query": "PECOTA was developed by a statistician who is a Special Correspondent of who?",
        "response": "ABC News",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director is also a screenwriter, Leslie Pearce or Lucian Pintilie?",
        "response": "Lucian Pintilie",
        "source": "hotpot_qa"
    },
    {
        "query": "John J. Phelan Jr was head of the NYSE during what October, 1987 event?",
        "response": "Black Monday",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of an academic and translator of Arabic literature that teaches at a university located in Radnor Township?",
        "response": "Barbara Romaine",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Alan Berg compose both Lulu and Giulio Cesare?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hugh Michael Jackman (born 12 October 1968) is an Australian actor, singer, and producer, has had lead roles in films such as The Fountain, released in which year, is an American epic magical realism romantic drama film that blends elements of fantasy, history, spirituality, and science fiction?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of 2003 East Asian Football Championship is controlled by what association?",
        "response": "Korea Football Association",
        "source": "hotpot_qa"
    },
    {
        "query": "Famous American actor Robert Rist portrayed popular children's characters, including Michelangelo in \"Teenage Mutant Ninja Turtles,\" Cousin Oliver in \"The Brady Bunch\" and a stuffed dragon in which Disney Channel animated series?",
        "response": "Doc McStuffins",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the brand who makes canned meats that had its own cook off in Austin until 2007?",
        "response": "Hormel Foods Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Max Jacob and Connie May Fowler both memoirists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the voice for all major male Warner Bros, cartoon characters, except Elmer Fudd, and provided voice for Racketeer Rabbit?",
        "response": "Mel Blanc",
        "source": "hotpot_qa"
    },
    {
        "query": "Which DJ is a resident for Underground FG and Radio FG Paris France and has a two-hour monthly show on Pacha FM? ",
        "response": "DJ Paulette",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Supreme Commander of the Irish Defence Forces' father was executed by the nascent Irish Free State?",
        "response": "Erskine Hamilton Childers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the most important producers-directors of the German silent cinema, Maya Deren or Frederic Zelnik ?",
        "response": "Frederic Zelnik",
        "source": "hotpot_qa"
    },
    {
        "query": "What TV network founded in 1984 is co owned by the Hearst Corporation and Disney?",
        "response": "Arts and Entertainment Network",
        "source": "hotpot_qa"
    },
    {
        "query": "What John Lennon/Yoko Ono Vietnam War protest song was covered by The Incredible Penguins to support research on little penguins?",
        "response": "\"Happy Xmas (War Is Over)\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Ledo Pizza and Mountain Mike's Pizza, are what type of restaurant?",
        "response": "pizzeria",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the indie farming simulation role-playing video game produced by the same British video game developer who published \"Starbound\" (2016) and \"Risk of Rain\" (2013)?",
        "response": "Stardew Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Callisto is the Solar System's third largest moon after Titan, which is a moon of which planet named for the Roman god of agriculture?",
        "response": "Saturn",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname given to the woman who held a fundraiser in 2007 in Palm Beach, Florida with the nonprofit organization For Darfur?",
        "response": "Queen of Prep",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is more suitable with watching with your children, 4 or Bangkok Girl?",
        "response": "4",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish rock band formed in 1992 had their biggest selling single released in 2001?",
        "response": "Ash",
        "source": "hotpot_qa"
    },
    {
        "query": "The daughter of playwright Robert Courtneidge starred with Jack Hulbert in what 1940 musical comedy film?",
        "response": "Under Your Hat",
        "source": "hotpot_qa"
    },
    {
        "query": "How many records did Argentine duo from season one of Tu Cara me Suena sell worldwide?",
        "response": "25 million worldwide",
        "source": "hotpot_qa"
    },
    {
        "query": "An anvil firing and explosive fireball have been used to begin which long range precision rifle event held near Orofino, Idaho?",
        "response": "The Boomershoot",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who stars in the 1999 film \"Universal Soldier: The Return\" has her own show on which network?",
        "response": "ESPN",
        "source": "hotpot_qa"
    },
    {
        "query": "The Habbaniya is a part of the Baggara people whose name comes from what Arabic word?",
        "response": "badawī",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city did João Carlos de Oliveira set a world record of 17.89 metres?",
        "response": "Mexico City, Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "Which basketball player had his jersey retired by both the Baltimore Bullets and New York Knicks, and averaged a team high 20.7 points for his team during the 1975-76 NBA season?",
        "response": "Earl Monroe",
        "source": "hotpot_qa"
    },
    {
        "query": "The  folklore  which Daniel C. Taylor gavea definitive explanation for the century-old is for which people ",
        "response": "Nepal,",
        "source": "hotpot_qa"
    },
    {
        "query": "Which winner of the \"are you smarter than a 5th grader?\" Also made a guest appearance on cbs' big bang theory?",
        "response": "George Smoot",
        "source": "hotpot_qa"
    },
    {
        "query": "What university did Matthew Lambley go to that has been a university since 1966?",
        "response": "Loughborough University",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean Luc Gbayara Assoubre plays for a spanish club that plays in what division?",
        "response": "Segunda División",
        "source": "hotpot_qa"
    },
    {
        "query": "What English composer/musician, known as the \"Fifth Beatle,\" produced two records by British vocal group, The Master Singers?  ",
        "response": "George Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Valerie Goodwin-Colbert was the fifth head coach of a womens univeristy team that plays in what conference?",
        "response": "Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucretia Jans, or \"Lucretia van der Miles\" (Amsterdam 1602 – \"fl.\"1641), was a survivor of the events surrounding the sinking of the Batavia, was a ship of the Dutch East India Company (VOC), it was shipwrecked on her maiden voyage, in what year?",
        "response": "1629",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Kitchens of Distinction or Royal Blood?",
        "response": "Kitchens of Distinction",
        "source": "hotpot_qa"
    },
    {
        "query": "In the capital of what district is The Presbyterian University College, Ghana?",
        "response": "Kwahu East district",
        "source": "hotpot_qa"
    },
    {
        "query": "Manuela Pfrunder was chosen by the Swiss National Bank to design the ninth series of what banknote that is issued in denominations of 10,20,50,100,200, and 1000?",
        "response": "Banknotes of the Swiss franc",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie staring Isabel Lucas also starred Ethan Hawke as a hematologist?",
        "response": "Daybreakers",
        "source": "hotpot_qa"
    },
    {
        "query": "\"From a Window\" is a song recorded by a singer of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "James Hansen, an adjunct professor at Columbia University, dubbed which famous Serbain-born American physicist \"the godfather of black carbon\"?",
        "response": "Tihomir Novakov",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city is  Lincoln Michael Riley a head coach for The Oklahoma Sooners football program?",
        "response": "Norman, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the University, at which Dave Paulsen was head coach for seven seasons, founded ?",
        "response": "1846",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the writer of a British sitcom in which Andrew Brooke was appeared?",
        "response": "Graham Linehan",
        "source": "hotpot_qa"
    },
    {
        "query": "Varaždin Generalate was a province that was part of the Kingdom that had what city as its capital?",
        "response": "Zagreb",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the star of Mean Machine play?",
        "response": "midfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "The Congressional Pro-Trade Caucus is a party who identify as what?",
        "response": "conservative Democrats.",
        "source": "hotpot_qa"
    },
    {
        "query": "Bowdon, Greater Manchester is located in an area know for what? ",
        "response": "expensive houses",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known as the singer and front woman for the band T'Pau, Carol Decker or John Corabi?",
        "response": "Carol Ann Decker",
        "source": "hotpot_qa"
    },
    {
        "query": "Pierce Gagnon starred in what science fiction thriller that involved contracted killers?",
        "response": "Looper",
        "source": "hotpot_qa"
    },
    {
        "query": "What team was owned by the Benetton family and participated in the 2000 Canadian Grand Prix?",
        "response": "Benetton Formula",
        "source": "hotpot_qa"
    },
    {
        "query": "Brendon Urie wrote new perspective after firing which bassist?",
        "response": "Brent Wilson was fired",
        "source": "hotpot_qa"
    },
    {
        "query": "What music genre do Richard Ashcroft and the band Galaxie 500 play?",
        "response": "alternative rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Sinch when has the rank held by Sir Charles Comyn Egertong been the highest in the British Army?  ",
        "response": "1736",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did English theatre, film and television actor, Mark Strong,  star in the British film directed by Pete Travis from a script by Paula Milne, based upon the book \"The Fall of Apartheid\" by Robert Harvey?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "The car Scott Pye currently drives has been produced since when?",
        "response": "June 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the famous preacher of San Marco, Florence born?",
        "response": "1452",
        "source": "hotpot_qa"
    },
    {
        "query": "Which historic hospital has the highest rate of wrongful death lawsuits in the Washington D.C. area, Howard University Hospital or St. Elizabeths Hospital?",
        "response": "Howard University Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "Justice as Fairness: A Restatement was written by the philosopher who held a Professorship at what college?",
        "response": "Harvard University",
        "source": "hotpot_qa"
    },
    {
        "query": " What novel was published in seven parts between 1913 and 1927 and was adapted into a musical that ran Off-Broadway in 2003?",
        "response": "In Search of Lost Time",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Max W. Kimmich and Henri-Georges Clouzot German film directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 20 travels through what Rockdale County city in Georgia?",
        "response": "Conyers",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the theatre that \"Here Is Mariah Carey\" was taped have one of the largest of in the Northeast?",
        "response": "movie screens",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Arthur C. Clarke and John Richardson are noted literary figures, the first as a science fiction author and the second as a reviewer for which publication?",
        "response": "The New Observer",
        "source": "hotpot_qa"
    },
    {
        "query": "Head Music was by the band who formed in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What former member of the Unites States House of Representatives is named as a defendent in Stone v. Trump?",
        "response": "Heather Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Samantha Cristoforetti or Jean-Loup Chrétien",
        "response": "Jean-Loup Jacques Marie Chrétien",
        "source": "hotpot_qa"
    },
    {
        "query": "n which country was citizen Kartam Joga a political activist and Maoist, imprisoned for participating in an ambush in which 75 members of the Central Armed Forces, originally known as the Crown Representative's Police, were killed?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this French action film co-written and produced by Luc Besson and directed by Olivier Megaton that starred Zoe Saldana?",
        "response": "Colombiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Remixed Remade Remodeled is a remix album of recordings by a band founded by which two people?",
        "response": "singer Debbie Harry and guitarist Chris Stein",
        "source": "hotpot_qa"
    },
    {
        "query": "Doggy Style Records is named after the debut album released on what date?",
        "response": "November 23, 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "What New York county was Dan Calichman born in?",
        "response": "Suffolk County",
        "source": "hotpot_qa"
    },
    {
        "query": "Omni Group's DICT client differs from the application known as Dictionary, developed by what company as part of macOS?",
        "response": "Apple Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Martin Barrass plays Mike Conrad on a British soap opera created by who?",
        "response": "Kevin Laffan",
        "source": "hotpot_qa"
    },
    {
        "query": "Harvey Fierstein wrote the play Casa Valentina. He has also wrote and stared in other plays and musicals. In what year was he inducted into the American Theater Hall of Fame?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that Charlie Cox played Jonathan Hellyer Jones in?",
        "response": "James Marsh",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of live attraction does the company owned by Melissa Carbone produce?",
        "response": "horror",
        "source": "hotpot_qa"
    },
    {
        "query": "Live at the Whisky: One Night Only is a live album by a singer born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the supermodel represented by Paul Fisher?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1977 film written and directed by Claude Chabrol is loosely based on a novel by the author of the poem \"Jabberwocky\"?",
        "response": "Alice or the Last Escapade",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 1937 American animated musical fantasy film produced by Walt Disney Productions, Snow White and the Seven Dwarfs or The Greatest Game Ever Played ?",
        "response": "Snow White and the Seven Dwarfs",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 Summer Youth Games took place in Nanjing, capital of which east China province?",
        "response": "Jiangsu",
        "source": "hotpot_qa"
    },
    {
        "query": "What school did Vashti Cunningham attend whose mascot is a Gael?",
        "response": "Bishop Gorman High School",
        "source": "hotpot_qa"
    },
    {
        "query": "The Audi RS4 quattro is the top tier and highest performing version of some specific generations of the Audi A4 range of automobiles, it slots distinctly above the Audi S4, the original Audi S4, built from 1991 until which year?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Which political party did a military and political figure of the Cossack Hetmanate associate with?",
        "response": "democratic",
        "source": "hotpot_qa"
    },
    {
        "query": "Under what president did William Cohen serve as Secretary of Defense in the years following the death of Esequiel Hernández Jr.?",
        "response": "Bill Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which performer at the 2016 Ghana Music Awards is the CEO of Burniton Music Group?",
        "response": "Stonebwoy",
        "source": "hotpot_qa"
    },
    {
        "query": "S.Easwara Varma is a violinist who has accompanied an Indian vocalist who is one of ten musicians to receive the Madras Music Academy's Sangeetha Kalanidhi before they turned what?",
        "response": "50 years of age",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the brother of 16th century poet group the Wilton Circle's leader?",
        "response": "Philip Sidney",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the island that is 1,415 km further to the east-southeast of Tokyo?",
        "response": "Wake Atoll",
        "source": "hotpot_qa"
    },
    {
        "query": "Who group founded in 1996 of the biggest companies in Mexico contains a large brewery owned by Anheuser-Busch InBev?",
        "response": "ConMéxico",
        "source": "hotpot_qa"
    },
    {
        "query": "What video game was created for a 32-bit handheld video game console manufactured and marketed by Nintendo on the date December 10, 2002",
        "response": "BattleBots: Beyond the BattleBox",
        "source": "hotpot_qa"
    },
    {
        "query": " GoodWill & MGI produced with what Australian Singer born in 1968 and starred in he Australian soap opera \"Neighbours\"",
        "response": "Kylie Minogue",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the date of Super Bowl XLIV which featured the The Who?",
        "response": "February 7, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Give Me a Home Among the Gumtrees was an entry to replace what song attributed to John Bull?",
        "response": "God Save the Queen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote a Latin narrative poem of history from the cosmogonic myth to Caesar?",
        "response": "Ovid",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American worldwide automotive industry components and parts supplier had a division that manufactured the Norge brand of appliances?",
        "response": "BorgWarner",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the series name of a reality show where Gemma Clare Collins took part for only three days?",
        "response": "UK series 14",
        "source": "hotpot_qa"
    },
    {
        "query": "From what film is a Tamil song composed by A. R. Rahman with lyrics written by Vairamuthu, that features the vocals of  a playback singer of Indian cinema with a career spanning over three decades?",
        "response": "Enthiran",
        "source": "hotpot_qa"
    },
    {
        "query": "susquehanna university and paul musser are both in what city?",
        "response": "Pennsylvania's",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of gesture does Minority languages of Austria and Austrian State Treaty have in common?",
        "response": "signed",
        "source": "hotpot_qa"
    },
    {
        "query": "Small Steps is the sequel to the book released in what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country contains both the Maiden's Tower and the Teşvikiye Mosque?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "The 53rd Disney animated feature film has a ride inspired by it at what theme park?",
        "response": "Walt Disney World Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the album that includes \"An Cant Dubj\"?",
        "response": "Steve Lillywhite",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first David Draiman or Terry Kath?",
        "response": "David Michael Draiman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed an automaton that is similar to \"Life without Death\"?",
        "response": "John Horton Conway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English footballer, having played for St. Mary's Y.M.A., was born in Portsmouth?",
        "response": "Albert Arthur Fry",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current head coach for the NCAA Division I basketball team that was previously coached by Dana Altman?",
        "response": "Bruce Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Both Mississippi State University and Florida International University in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the serious defeats for the Union came first in the American Civil War: the Battle of Chickamauga or the Battle of Fredericksburg?",
        "response": "Battle of Fredericksburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Nebraska Central airlines is based out of the same state as what largest in United States rail system?",
        "response": "Union Pacific Railroad",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the  football club which Wilfred \"Wilf\" Nixon played for Founded in ",
        "response": "1879",
        "source": "hotpot_qa"
    },
    {
        "query": "Who publishes Applied Physics A and B?",
        "response": "Springer Science+Business Media",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born in Ireland and has coached the captain of MLS club Colorado Rapids?",
        "response": "Des McAleenan",
        "source": "hotpot_qa"
    }
]