[
    {
        "query": "How is Scott Speedman and Michael Corvin related?",
        "response": "Underworld",
        "source": "hotpot_qa"
    },
    {
        "query": "William Sadler had a role in the sci-fi comedy film by which director?",
        "response": "Pete Hewitt",
        "source": "hotpot_qa"
    },
    {
        "query": "This English actor who starred in the CBS drama \"Eleventh Hour\" appeared in this 1998 American-Australian Neo-noir science fiction film directed by Alex Proyas?",
        "response": "Dark City",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former chief executive officer of J. C. Penney born who joined after Myron E. \"Mike\" Ullman III?",
        "response": "October 15, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What American football running back for the New Orleans Saints was suspended in 2013 and 2014?",
        "response": "Adrian Peterson",
        "source": "hotpot_qa"
    },
    {
        "query": "Three weeks before the 62nd Academy Awards, the ceremony for the Academy Awards for Technical Achievement were held, and hosted by what actress who won a golden globe for her work on the television show Alice?",
        "response": "Diane Ladd",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first person to describe Relational Quantum mechanics and has worked in Italy, the United States, and France?",
        "response": "Carlo Rovelli",
        "source": "hotpot_qa"
    },
    {
        "query": "The Halfway House starred the retired stage actress who was born in what city and country?",
        "response": "Pretoria, South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mysterious Origins of Man included material by the man who goes by what devotional name?",
        "response": "Drutakarmā dāsa",
        "source": "hotpot_qa"
    },
    {
        "query": "what does The Dig and Industrial Light & Magic have in common?",
        "response": "Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "What former 1985 Scottish League Cup Final player managed Machester United from 1986 to 2013?",
        "response": "Alex Ferguson",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does the professional footballer play for who has a older brother that plays as a winger for Bolton Wanderers?",
        "response": "Nigerian",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Kanako Momota and Timo Kotipelto share a nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What former male model from Cameroon won the title on a reality show that included Ross Matthews and Carson Kressley as judges?",
        "response": "BeBe Zahara Benet",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this episode of \"The Simpsons\" of which the episode \"Days of Future Future\" is a follow-up aired on the Fox network?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a punk rock musician, John Mayer or Ben Weasel?",
        "response": "Ben Weasel",
        "source": "hotpot_qa"
    },
    {
        "query": "Men at Work: The Craft of Baseball was written by what American conservative political commentator who writes regular columns for The Washington Post?",
        "response": "George Frederick Will",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alliance was formed in January 2016 in which the Value Alliance is second to when we talk of  low-cost carriers",
        "response": "U-FLY Alliance",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the chemist who founded Mond gas born?",
        "response": "1839",
        "source": "hotpot_qa"
    },
    {
        "query": "The Williams FW33 was a Formula One racing car developed by Williams F1, it was driven by  rookie driver Pastor Maldonado, a Venezuelan professional racing driver, who competed in which sports organization?",
        "response": "Formula One",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Haslag is the Chair in Economics at the university whose post is named after the businessman who was CEO of what company?",
        "response": "Enron Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Michael Matricciani play his home matches? ",
        "response": "Newton Village Sports Complex",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the original five members of the Mission Mountain Wood Band was born in January, 1948?",
        "response": "Rob Quist",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Bob Mould or Kendall Schmidt better known for their television career?",
        "response": "Kendall Francis Schmidt",
        "source": "hotpot_qa"
    },
    {
        "query": "What role in their respective bands links Brent Smith and Mike Score?",
        "response": "lead vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was from farther West, Timothy Leary or Jaroslav Seifert?",
        "response": "Timothy Francis Leary",
        "source": "hotpot_qa"
    },
    {
        "query": "The 204th overall pick in the 2010 NHL draft played for a European club located in which country?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is older, Stevens Institute of Technology or Drexel University?",
        "response": "Stevens Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "Who else besides Prince Carl of Denmark did Gustav Borngen take portraits of?",
        "response": "Henrik Ibsen and Bjørnstjerne Bjørnson, and numerous cabinet ministers, members of parliament, writers and artists, and members of upper bourgeois families.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are Sibley Memorial Hospital and Walter Reed Army Medical Center located?",
        "response": "Washington D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Sharon Thomas' children include an AMerican actor who is known for his role as Superman, and for being the host of what show?",
        "response": "Ripley's Believe It or Not!",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the code name for this Allied operation in WWII, also known as D-Day?",
        "response": "Operation Overlord",
        "source": "hotpot_qa"
    },
    {
        "query": "What person does Airstream and Spirit of St. Louis have in common?",
        "response": "Charles Lindbergh",
        "source": "hotpot_qa"
    },
    {
        "query": "The largest bank by assets in Pakistan formed a Pakistani football club based in which city ?",
        "response": "Karachi",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the genuses Fraxinus and Thymophylla belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Innocent Pictures ApS is a Danish independent film company founded in 2001, originally as a subsidiary of Lars von Trier's film company Zentropa, which is best known for the production of the erotic feature film, All About Anna is a Danish film released in which year, directed by Jessica Nilsson?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": " Eva Gonda de Rivera owns a major stake in a beverage company hedaquartered in what city?",
        "response": "Monterrey",
        "source": "hotpot_qa"
    },
    {
        "query": "Minister of Interior in the cabinet appointed by the Interim Iraq Governing Council in September 2003, served in the government of the fifth President of where?",
        "response": "Iraq",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Death on the Nile and Mia Farrow have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is American writer and translator Peter Christopher Sebastian's older brother who is a novelist and poet and wrote \"Darconville's Cat\"?",
        "response": "Alexander Theroux",
        "source": "hotpot_qa"
    },
    {
        "query": "What ukulele player has Sheldon Gomberg worked with?",
        "response": "Zooey Deschanel",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrestler has a brother (also a wrestler) who performed with Tammy Sytch acting as his valet?",
        "response": "John \"Johnny\" Candito",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of the actress who played Vanessa Doofenshmirtz in \"Phineas and Ferb\" was an original member of what group?",
        "response": "Boston Comedy Scene",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is from England, Republica or AFI?",
        "response": "Republica",
        "source": "hotpot_qa"
    },
    {
        "query": "This South-African born actress played a real-life person who was executed in 2002 for crimes committed in what movie?",
        "response": "Monster",
        "source": "hotpot_qa"
    },
    {
        "query": "On 30 November 2004, Jakubko made his international debut for Slovakia in the 1–0 victory over Hungary at the 2004 King's Cup, Jakubko played 6 minutes at the 2010 FIFA World Cup against the Netherlands and earned a penalty kick, which was successfully taken by which Slovak football player who currently plays for ŠK Slovan Bratislava?",
        "response": "Róbert Vittek",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Saint Michael Academy is a member of the athletic association made up of high schools in what area?",
        "response": "New York City, Long Island, and Westchester",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2015 population of the city where Straight Street Bridge is?",
        "response": "147,754",
        "source": "hotpot_qa"
    },
    {
        "query": "Kara Louise Tointon, is an English actress, and is known for playing who, in the ITV live production of \"The Sound of Music Live\"?",
        "response": "Maria",
        "source": "hotpot_qa"
    },
    {
        "query": "The music video of \"Palat – Tera Hero Idhar Hai\" features the assistant director to Karan Johar on what 2010 drama?",
        "response": "My Name Is Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Green starred in the 2014 film Noble and what Showtime and Sky series?",
        "response": "\"Penny Dreadful\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the author of the book Dark Slayer ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "BWI Rail Station is served by which Amtrak flagship service?",
        "response": "Acela Express",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the laboratory that houses The Tandem Van de Graaff located?",
        "response": "Upton, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is considered the more well known author, Roger Angell or Harry Stephen Keeler?",
        "response": "Roger Angell",
        "source": "hotpot_qa"
    },
    {
        "query": "Dead-cakes are often eaten at a gathering held before what event?",
        "response": "funeral",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Egyptian method actor regarded as one of the most influential and important actors of Egyptian cinema?",
        "response": "Zaki Rostom",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Ventimilia co-wrote the Simpsons episode that was the 22nd episode of which season",
        "response": "sixth",
        "source": "hotpot_qa"
    },
    {
        "query": "What Grand Prairie, Alberta-born hockey player was traded in 1987 to the Washington Capitals?",
        "response": "Clint Malarchuk",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor is known for his role as spock in 2013 American science fiction action film Star Trek Into Darkness?",
        "response": "Zachary Quinto",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Need You Around\" is a song featured in the soundtrack of a coming-of-age comedy film loosely based on a novel by who?",
        "response": "Jane Austen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed a 2014 drama that featured the actor that played Patrick Kuby in \"Breaking Bad\"?",
        "response": "Mike Binder",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Kelly Preston star in a fantasy film with her husband?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which First Nations group of over 200'000 members living in Canada signed an accord with the Quebec government, leading to the creation of Eeyou Istchee James Bay Territory?",
        "response": "The Cree",
        "source": "hotpot_qa"
    },
    {
        "query": "Which story received publication into a movie, Dangal or Ghostopolis?",
        "response": "Dangal",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of ore was mined at both Thompson-Lundmark Mine and Leckie Mine?",
        "response": "gold",
        "source": "hotpot_qa"
    },
    {
        "query": " Mario Testino OBE has also created images for brands such as Gucci, Burberry, Versace, Michael Kors, Chanel,  Carolina Herrera, Estée Lauder, Lancôme, and Stuart Weitzman, often credited with making what?",
        "response": "expensive shoes",
        "source": "hotpot_qa"
    },
    {
        "query": "What MTV television drama starred an actor who had once boxed with a boxer born in Belarus?",
        "response": "\"Skins\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The title character's actor in Joe Dirt 2: Beautiful Loser was also a cast member of which 1990s show?",
        "response": "\"Saturday Night Live\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Adapted from a comic of the same name, what year was the South Korean film Fashion King?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Was McDull, Kung Fu Kindergarten or Pettson and Findus created first?",
        "response": "Pettson and Findus",
        "source": "hotpot_qa"
    },
    {
        "query": "Frou Frou and Portishead, are electronic bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mirabilis and Podocarpus part of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Josey Scott and Ian Watkins were both promising musicians. Which of these talented men was incarcerated, impacting his career with a rock band?",
        "response": "Lostprophets disbanded in 2013 after Watkins was charged with sexual offences in late 2012.",
        "source": "hotpot_qa"
    },
    {
        "query": "James Clark McReynolds (February 3, 1862 – August 24, 1946) was an American lawyer and judge who served as United States Attorney General under President Woodrow Wilson and as an Associate Justice of the United States Supreme Court, he served on the Court, during the presidency of which 30th President of the United States (1923–29)?",
        "response": "John Calvin Coolidge Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Super Bowl had starting center Kevin Dale Long playing against the rival team St. Louis Rams?",
        "response": "Super Bowl XXXIV",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the publisher based in Farnham and a subsidiary of a multinational events and publishing company based in London established?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Tietê Bus Terminal and this terminal are the largest, and the other terminal opened in what year?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Sumner, New Zealand was named in 1849 in honour of an Archbishop born in which year?",
        "response": "1780",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what county is the city 7 miles east of Trace State Park the seat?",
        "response": "Lee County, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country has the world's 16th largest city as its capital, a city which has Hyoja-dong as a \"dong\"?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the operational conversion unit of the aerial warfare branch of the Australian Defence Force formed?",
        "response": "December 1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the middle names of the senator who is running for reelection in the United States Senate election in Michigan, 2018 ?",
        "response": "Ann Greer",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Magda Behrend Rietschel's second husband born?",
        "response": "1897",
        "source": "hotpot_qa"
    },
    {
        "query": "How many shares of stock were owned by promoters and promoter group prior to the 2016 Indian Banks data breach?",
        "response": "30.81% shares",
        "source": "hotpot_qa"
    },
    {
        "query": "Don R. Berlin designed what American ground-attack aircraft that first flew in 1938?",
        "response": "The Curtiss P-40 Warhawk",
        "source": "hotpot_qa"
    },
    {
        "query": "Darren Criss wrote music an lyrics for a \"Harry Potter\" based parody, for what Chicago based musical theater company?",
        "response": "StarKid Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which Christoph Koncz starred as Kaspar Weiss ?",
        "response": "François Girard",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Farrar advocated for victim in the agency that has headquarters in what Maine city?",
        "response": "Augusta",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the two members of the due who released Hurt Feelings?",
        "response": "Bret McKenzie and Jemaine Clement",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the meaning of the nickname of Messalina's second-cousin?",
        "response": "\"little soldier's boot\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the 1958 movie starring Sofia Costanza Brigida Villani Scicolone set?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport was the player born in the county seat of Osage County involved in?",
        "response": "Rugby",
        "source": "hotpot_qa"
    },
    {
        "query": "A waltz, is dance music in triple meter, often written in time, probably deriving from which German word, and is a folk dance in time which was popular in Austria, south Germany, German Switzerland, and Slovenia at the end of the 18th century?",
        "response": "Ländler",
        "source": "hotpot_qa"
    },
    {
        "query": "Which summer deaflympics did Virender Singh get a bronze metal?",
        "response": "21st Summer Deaflympics",
        "source": "hotpot_qa"
    },
    {
        "query": "Teinosuke Kinugasa, was a Japanese actor and film director, in 1954 he won at which Festival, for \"Jigokumon\" (\"The Gate of Hell\"), named until 2002 as the International Film Festival?",
        "response": "Cannes Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "At what schools did the man who was co-captain of the 1982-83 Princeton Tigers men's basketball team later serve as head coach?  ",
        "response": "Oregon State University and Brown University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which county in New York held the fourth PGA Championship?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "New Haven-style pizza is a style of a pizza believed to have evolved from what?",
        "response": "Jeyoun",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Pure Imagination\" was a cover version sung by Fiano Apple which was oroginally performed by Gene Wilder as Willy Wonka from the adaptation of the children's novel which came out in what year?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "What product targets elementary school aged boys and has a Japanese manga created by Takafumi Adachi?",
        "response": "CoroCoro Comic",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the date that the album on which \"There's No Home for You Here\" appeared was released?",
        "response": "April 1, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who voiced Shaggy in the \"Scooby-Doo\" franchise also appeared as a radio personality on what radio network?",
        "response": "Clear Channel Radio",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film does a compiler of an Under the Influence album play a cameo role?",
        "response": "Harry Potter and the Prisoner of Azkaban",
        "source": "hotpot_qa"
    },
    {
        "query": "Which project is older the Woolworth Building or 80 Flatbush?",
        "response": "Woolworth Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Cão de Castro Laboreiro and Brazilian Dogo both dogs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Rachid Belkacem a Dutch national, was a friend of Mohammed Bouyeri, a Moroccan-Dutch Islamic terrorist and convicted murderer who is serving a life sentence without parole for the assassination of what Dutch film director?",
        "response": "Theo van Gogh",
        "source": "hotpot_qa"
    },
    {
        "query": "6 Interpretations included the songwriter who performed in what band from 1985 to 1995?",
        "response": "Requiem in White",
        "source": "hotpot_qa"
    },
    {
        "query": "How much area does the Lutheran church located in Ulm, Germany covers?",
        "response": "185,000 to 190,000 m³",
        "source": "hotpot_qa"
    },
    {
        "query": "What did a suitor of queen Elizabeth I say Sir Roger Williams was?",
        "response": "\"worth his weight in gold\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the film on which the 2016 film Pete's Dragon is based. In what year was it released?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Evan Turner was selected in what NBA draft that also included five players being drafted from the same school in the first round?",
        "response": "2010 NBA draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Word of Mouth is the third studio album by English-Irish boy band The Wanted, and was preceded by the release of six singles, including Walks Like Rihanna, and was released in the United Kingdom and Ireland, on which date?",
        "response": "23 June 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the coached the Idaho Vandals born?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the character in \"The Closer\" in which the actor also played in the movie \"Mannequin\"?",
        "response": "James Duff",
        "source": "hotpot_qa"
    },
    {
        "query": "Which system by Hero Games is a combination of the Interlock and HERO systems? ",
        "response": "Fuzion",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine launched first, Real Simple or Life?",
        "response": "Life",
        "source": "hotpot_qa"
    },
    {
        "query": "Bassist of the band who released Voivod was originally in a band based where? ",
        "response": "San Rafael, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus was described first, Ixiolirion or Allosyncarpia?",
        "response": "Ixiolirion",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the prototype Big Daddy characters called in the sequel version of the BioShock series?",
        "response": "Subject Delta",
        "source": "hotpot_qa"
    },
    {
        "query": "The Timbarra Gold Mine was a gold mine located in the New England region at the intersection of New England and what?",
        "response": "Bruxner Highway's",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Patricio Guzmán Lozanes or Gil Kenan?",
        "response": "Gil Kenan",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of Codename: Kids Next Door also served as production design for what series?",
        "response": "Beavis and Butt-Head",
        "source": "hotpot_qa"
    },
    {
        "query": "What job does the promotor of the term \"Alt-Right\" Richard Spencer have?",
        "response": "He is president of the National Policy Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "Sindhi women wear this type of dress, a traditional outfit that consists of baggy trousers and what?",
        "response": "long shirt",
        "source": "hotpot_qa"
    },
    {
        "query": "What day did the founder of ESL Music, who was also an American heir and hotelier, die?",
        "response": "December 10, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Paul Davies Work that was established on August 16, 1960",
        "response": "International Academy of Astronautics",
        "source": "hotpot_qa"
    },
    {
        "query": "Chuck Versus the Cougars, is the fourth episode of the second season of \"Chuck\", Heather's nerdy husband Mark Ratner, is played by which American actor, born on September 13, 1980?",
        "response": "Bennett Joseph Savage",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of Povratak Katarine Kožul was convicted of committing war crimes during what war?",
        "response": "Croat-Bosniak War",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do both Jim Grabb and Michael Chang play?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Clinton v. Jones and Baker v. Carr were both court cases that took place in what United States court?",
        "response": "Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in Pinellas County contains at least 145 historic buildings?",
        "response": "Tarpon Springs, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Young Frankenstein included the actress and comedian who has won how many Primetime Emmy Awards over her 7-decade career?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "While at the University of Michigan, Louis Smith played with what American jazz trumpeter, bandleader, and composer?",
        "response": "Miles Dewey Davis III",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical band composed Chicken Fried and Whatever It Is? ",
        "response": "Zac Brown Band",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of the Lisa Simpson character was born in what year?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Cale Gundy's brother play football in college?",
        "response": "Oklahoma State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the home games played by the team coached by Scott Marr?",
        "response": "John Fallon Field",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a retired Mexican tennis player, Jakob Hlasek or Raúl Ramírez?",
        "response": "Raúl Ramírez",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the husband of the first olympic gymnast to be awarded a perfect score of 10.0?",
        "response": "Bart Conner",
        "source": "hotpot_qa"
    },
    {
        "query": "What album was released on October 24, 2006, by Big Machine Records and contains Should've Said No?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Parasite\" is a kind of text that has how many words?",
        "response": "between 7,500 and 40,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of Maurice Elvey and Chester Erskine?",
        "response": "Maurice Elvey",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Jimmie Ross or Chris Daughtry?",
        "response": "Jimmie Ross",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gitlow v. New York and City of Boerne v. Flores both Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the headquarters of the business that includes Houghton Wines as a subsidiary?",
        "response": "South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "While The Church was a psychedelic rock band formed in Sydney in 1980, The New Radicals were what type of music?",
        "response": "American alternative rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the musicians Dan Andriano and Ian Hunter from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Lisa Howard had a role in the comedy that had music and lyrics by whom?",
        "response": "William Finn",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2000 ad movie was produced by Sam Mercer and directed by M. Night Shyamalan?",
        "response": "Unbreakable",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the hero of the book by J.R.R. Tolkien published in 1977?",
        "response": "Húrin",
        "source": "hotpot_qa"
    },
    {
        "query": "On the coast of what ocean is the birthplace of Diogal Sakho?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "How many top-40 hits did the singer of \"Don't Forbid Me\" have?",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shopping mall is owned by GGP and located in the second largest shopping district in Massachusetts?",
        "response": "Natick Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Kool-Aid and  Lucozade are examples of what?",
        "response": "drinks",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the man from Rock City Falls known as the Paper Bag King born in?",
        "response": "1823",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Thomas Friedman or English author David Lodge?",
        "response": "David John Lodge CBE",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian bandleader/orchestrator/composer/conductor created \"A Look at Monaco\" soundtrack?",
        "response": "Percy Faith",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ameican Jazz saxophonist nicked named the \"Hawk\", once played with what musician who died in 2009 and once played with Johnny Carson during Carson's residency?",
        "response": "Shep Meyers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who in the Jewish Guild did The Irish Football Association consider to be the greatest player to ever pull on the green shirt of Northern Ireland?",
        "response": "George Best",
        "source": "hotpot_qa"
    },
    {
        "query": "What political alignment is the media group organized by Lydia Sargent?",
        "response": "left-wing",
        "source": "hotpot_qa"
    },
    {
        "query": "Francis Key Hunt was named after what American poet who wrote a poem entitled at first \"The Defence of Fort McHenry\"?",
        "response": "Francis Scott Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Brothers Barry, Robin and Maurice Gibb, in addition to headlining the pop group the Bee Gees, wrote several hits for other artists, including 1980 hit \"Woman in Love\" performed by who?",
        "response": "Barbra Streisand",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiong Bahru Plaza is located in the city that is at the southern tip of what landform?",
        "response": "Malay Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "David Gwillim is known for playing Prince Hal in a series of British television adaptations of plays created by who?",
        "response": "Cedric Messina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor from \"The Cosby Show\" also starred in \"Play'd: A Hip Hop Story\"?",
        "response": "Merlin Santana",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Faith\" by Stevie Wonder is the lead single from a sountrack for a 2016 film directed by who?",
        "response": "Garth Jennings",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Cooney appeared in which film directed by Peter Weir ?",
        "response": "Dead Poets Society",
        "source": "hotpot_qa"
    },
    {
        "query": " \"The Last Time\" is a song from a studio album that was released on which day ?",
        "response": "October 22, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "What car model was made by the thirteenth-largest car manufacturer and introduced in 1972?",
        "response": "Mercedes-Benz S-Class",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Naperville Central High School quarterback, became the 1988 starting quarterback for the Leicester Panthers?",
        "response": "Patrick Sean Payton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the river that comes out of the Appalachian mountains and runs past Embreeville, Tennessee?",
        "response": "Nolichucky River",
        "source": "hotpot_qa"
    },
    {
        "query": "For which film did this British actor from \"The Shadow Line\" collaborate with Steven Spielberg?",
        "response": "Amistad",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Hannah Arendt or Peter Ackroyd?",
        "response": "Johanna \"Hannah\" Arendt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut went up in space first, Samantha Cristoforetti or Mirosław Hermaszewski?",
        "response": "Mirosław Hermaszewski",
        "source": "hotpot_qa"
    },
    {
        "query": "What former city, now the fourth-largest Russian city, was the Belarusian State Technological University evacuated to in 1941?",
        "response": "Sverdlovsk",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fantastic Miss Piggy Show stars what character also performed by Bob Zmuda?",
        "response": "Tony Clifton",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the psychic, artist, and author died along with whom  McMoneagle is best known for claims surrounding the investigation of RV?",
        "response": "31 January 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Spanish football coach born in 1973 was announced as the new Everton manager in 2013?",
        "response": "Roberto Martínez",
        "source": "hotpot_qa"
    },
    {
        "query": "The film starring Oscar Martinez was selected for which award at the 73rd Venice International Film Festival?",
        "response": "Golden Lion",
        "source": "hotpot_qa"
    },
    {
        "query": "How many girls and boys are in the seventeen sibling family featured on Counting On?",
        "response": "nine girls and 10 boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Which states are consistently included in the region where the Cayuse War took place?",
        "response": "Oregon, Washington, and Idaho",
        "source": "hotpot_qa"
    },
    {
        "query": "Ross Pople worked with which English composer known for his opera \"The Midsummer Marriage\"?",
        "response": "Michael Tippett",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the company that sponsered the 2009 Grand National produce?",
        "response": "beer",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2000 movie starring a veteran of NBC's \"Saturday Night Live\" was promoted using fictionalized reviews attributed to \"David Manning\"?",
        "response": "The Animal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach of the Missouri Tigers women's basketball team that was hired in 2010?",
        "response": "Robin Pingeton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this longtime companion of Adolf Hitler and, for fewer than 40 hours, his wife, whose dogs were taken care of byb Fritz Tomow?",
        "response": "6 February 1912",
        "source": "hotpot_qa"
    },
    {
        "query": "Seein' Red, White 'N' Blue was a short that included which cartoon fictional character?",
        "response": "Popeye",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film distribution company who released \"A Violent Prosecutor\" founded?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the founder of the company that produced White Ox?",
        "response": "Douwe Egberts",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Elia Suleiman and Wilson Yip from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Say Say Say, released in 1983, was written and performed by which two artists?",
        "response": "Paul McCartney and Michael Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cacti has more species, Cereus or Limnanthes?",
        "response": "Cereus",
        "source": "hotpot_qa"
    },
    {
        "query": "Wellesley Farms is a rail station located in what Massachusetts county?",
        "response": "Norfolk",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the town which is connected to Lewiston, Maine by Maine State Route 126?",
        "response": "1,527",
        "source": "hotpot_qa"
    },
    {
        "query": "UPA was an animation studio that created the 1962 film musical that gave who her only animated film voice role?",
        "response": "Judy Garland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2007 film Jin Ji-hee was in?",
        "response": "Yim Pil-sung",
        "source": "hotpot_qa"
    },
    {
        "query": "Which aria provides the only set-piece is the most popular one in the Gianni Schicchi opera?",
        "response": "O mio babbino caro",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Are We in Trouble Now\" was performed by what baritone country singer?",
        "response": "Randy Travis",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a Japanese anime series and the sixth \"Pretty Cure\" installment by Izumi Todo, Otra Película de Huevos y un Pollo or Fresh Pretty Cure! ?",
        "response": "Fresh Pretty Cure!",
        "source": "hotpot_qa"
    },
    {
        "query": "The Muscogee language was spoken by which native people of Florida?",
        "response": "Seminole",
        "source": "hotpot_qa"
    },
    {
        "query": "Chagnoald, was a bishop of Laon during the 7th century, from which collection of Germanic peoples that originated in the lands between the Lower and Middle Rhine in the 3rd century AD and eventually formed a large empire dominating much of western and central Europe during the Middle Ages?",
        "response": "Franks",
        "source": "hotpot_qa"
    },
    {
        "query": "What day did a TV drama, which has an episode titled \"Revenge\" as its 22nd episode of its tenth season, premier on?",
        "response": "September 23, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Arena Bowl XII included what team coached by current head coach of the Washington Redskins?",
        "response": "Orlando Predators",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Italian professional footballer that Taiwanese goalkeeper Lu Kun-Chai is nicknamed after?",
        "response": "Gianluigi \"Gigi\" Buffon",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is the agency that provides access to The Patti Page Show based?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1995 film in which Jeremy Sisto starred ? ",
        "response": "Amy Heckerling.",
        "source": "hotpot_qa"
    },
    {
        "query": "Palentown is a hamlet in a county named for a province of what nationality?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was produced first, Muppet Treasure Island or Honey, I Shrunk the Kids?",
        "response": "Honey, I Shrunk the Kids",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did a Canadian politician born January 2, 1979, succeed as leader of the New Democratic Party in Canada? ",
        "response": "October 1st",
        "source": "hotpot_qa"
    },
    {
        "query": "George Le Brunn wrote \"Oh! Mr Porter\" which included repertoires of what english music hall singer affectionately called \"Queen of the Music Hall\"?",
        "response": "Marie Lloyd",
        "source": "hotpot_qa"
    },
    {
        "query": "What type creative work do Yodel It! and Shake It Off have in common?",
        "response": "song",
        "source": "hotpot_qa"
    },
    {
        "query": "How many students are in the school in which Henry Alex Rubin studied film?  ",
        "response": "1,150",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Filipino-owned regional boutique airline company, which owns an airstrip at El Nido Airport, formerly known as?",
        "response": "Island Transvoyager",
        "source": "hotpot_qa"
    },
    {
        "query": " USS Elrod was named after the Captain who enlisted in what part of the armed forces in 1927?",
        "response": "Marine Corps",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie features a song from Beaucoup Fish's fifth album and stars Arnold Schwarzenegger?",
        "response": "Batman & Robin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did the actor from the comedy film Table for Three grow up?",
        "response": "Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "What team was formed in 1996 that starred players like Robert Parish?",
        "response": "50 Greatest Players in National Basketball Association History",
        "source": "hotpot_qa"
    },
    {
        "query": "Crave Entertainment was an American video game company that went bankrupt in 2012, its headquarters was in Newport Beach, a seaside city in Orange County, California, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": " Jung Yong-hwa and Chrissie Hynde are both musicians in what musical genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Live Acoustic America features a cover of a Beatles song that peaked at what number in the United Kingdom?",
        "response": "4",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people were abord the flight that Umar Farouk Abdulmutallab attempted to bomb in 2009?",
        "response": "290",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the man married to Jaclyn Smith when Victoria Winters was written of the show \"Dark Shadows\" born?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original stage name of the artist who recorded the song element ?",
        "response": "K-Dot",
        "source": "hotpot_qa"
    },
    {
        "query": "Professor Layton and the Eternal Diva and Eureka Seven, both are of which genre?",
        "response": "anime",
        "source": "hotpot_qa"
    },
    {
        "query": "Which festival screened the move In Secret which started English actor Tom Felton? ",
        "response": "Toronto International Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the music group that performed \"Whiskey on My Breath\"?",
        "response": "Stephen Barker Liles, Eric Gunderson, and Brian Bandas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American world boxing champion thatwho met with  Sammy Angott?",
        "response": "Henry Armstrong",
        "source": "hotpot_qa"
    },
    {
        "query": "The word qalat (kalata) is Persian and qal'at (qal‘a) is Arabic for 'fortified place', Qalats can range from castles like which location, to Adobe, a building material made from earth and often organic material?",
        "response": "Rumkale",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stanbic Bank Twenty20 formerly known as the Metropolitan Bank Twenty20 is the domestic Twenty20 cricket competition in Zimbabwe, recently, the tournament has risen in profile with some high-quality cricket, and the attraction of major international stars such as which former Australian cricketer, who recently retired from all three formats of the game, and played in the Big Bash League for the Hobart Hurricanes? ",
        "response": "Shaun Tait",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the album on which the Beatles covered a song from the album The Fabulous Miracles by The Miracles?",
        "response": "With the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the area known in Europe where the pirates were based in against whom Admiral of the Fleet Edward Russell has a operation as a captain in the Mediterranean?",
        "response": "Barbary Coast",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitechapel is a series that depicted a killer who was copying the actions of which unidentified serial killer?",
        "response": "Jack the Ripper",
        "source": "hotpot_qa"
    },
    {
        "query": "Who will direct the upcoming biological film Papillon which is a remake of a film of the same name starring the American actor who won an Academy Award for Best Actor in 1980?",
        "response": "Michael Noer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tommy Karevik and Serri members of the same band",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Lacey Sturm was a co-founder of which Christian pop band founded in 2002?",
        "response": "Flyleaf",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the cost of a building completed in March 2008 and designed by Daniel Libeskind in a city that had a population of 40,640 at the time of the 2010 U.S. census?",
        "response": "$50 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that is a 2006 gay romantic comedy film about  four gay friends  who vow upon graduating high school that they will all lose their virginity of he insertion and thrusting of the erect penis into a person's anus ?",
        "response": "Todd Stephens",
        "source": "hotpot_qa"
    },
    {
        "query": "which medalist in the 2004 Commonwealth Youth Games is a former British recold holder in the 100 metres hurdles, the high jump and the indoor pentathlon?",
        "response": "Jessica Ennis-Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "The inventor of the first thermionic valve made what visual mnemonic tool for generators?",
        "response": "Fleming's right-hand rule",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Kohler created commercials and promos for what network that was launched on October 1, 1992?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Thunbergia and Teucrium part of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which field of studies did Semyon Aranovich Gershgorin and Anatoly Maltsev work in?",
        "response": "He was a mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Elizabeth Austin wrote for a fitness magazine founded by who?",
        "response": "Christine MacIntyre",
        "source": "hotpot_qa"
    },
    {
        "query": "Bloodbrothers starred which opera singer and cast member of Law and Order?",
        "response": "Paul Anthony Sorvino",
        "source": "hotpot_qa"
    },
    {
        "query": "What civil parish has three residential estates (Gorse Covert, Oakwood, and Locking Stumps) and sits near Risley Moss?",
        "response": "Birchwood",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 1982 novel, the subject of which is credited with saving the lives of 1,200 Jews during the Holocaust, including the life of Moshe Taubé?",
        "response": "\"Schindler's Ark\"",
        "source": "hotpot_qa"
    },
    {
        "query": "FAQ U is a program that included which British comedian as guest presenter in its second week?",
        "response": "David James Stuart Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American country music band released a 13 song album on July 27 2017?",
        "response": "Midland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who managed the team that placed the first during the Pittsburgh Pirates season in the 1940s when the Pirates placed the fourth?",
        "response": "Leo Durocher",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the director of King of the Dancehall born?",
        "response": "October 8, 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "The Yenko Super Camaro was a modified Chevrolet Camaro prepared by Yenko Chevrolet, under the personal supervision of Don Yenko, this put the Camaro at a serious disadvantage to the Dodge Dart, is an automobile originally built by Dodge from 1960 to what year, in North America?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Foley is a character on SNL played by which loud, energetic actor and comedian?",
        "response": "Christopher Crosby Farley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1999 short stories collection, \"Trist som faen,\" and was also given two pieces of furniture by Liv Mildrid Gjernes to as a wedding gift from the Norwegian government?",
        "response": "Ari Behn",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack is a 2015 Austrian thriller film about serial killer Jack Unterweger, was an Austrian serial killer who murdered prostitutes in several countries, and first convicted of a murder, in which year?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Steve Dildarian or Ian Bremmer?",
        "response": "Steve Dildarian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more career changes, Charles A. Agemian or Arshile Gorky?",
        "response": "Charles A. Agemian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cavaliers–Warriors rivalry is a National Basketball Association (NBA) rivalry between the Cleveland Cavaliers and the Golden State Warriors, the two teams feature 11 NBA All-Stars, including which American professional basketball player, and was named an NBA All-Star and All-NBA Team member the following two seasons?",
        "response": "Draymond Green",
        "source": "hotpot_qa"
    },
    {
        "query": "What passenger trade route is serviced by Edmonds and runs parallel to the Cascade mountain range?",
        "response": "The Amtrak \"Cascades\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The first Capcom Pro Tour was co-sponsored by a live streaming video platform owned by a subsidary of who?",
        "response": "Amazon.com",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the genera Gordonia and Osbeckia in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these is has more episodes/books in the series, Storm Rider Clash of the Evils or Pettson and Findus?",
        "response": "Pettson and Findus",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Slowness\" is a novel whose author was born in what year?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the overall record of the head coach whom Bill Pace served as offensive coordinator under beginning in 1974?",
        "response": "201–77–10",
        "source": "hotpot_qa"
    },
    {
        "query": "What American self-help author sold over 100 million copies of his book Think and grow Rich worldwide by 2015 after his death in 1970?",
        "response": "Napoleon Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist sings Before He Cheats and Blown Away? ",
        "response": "Carrie Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Everybody's Crazy was produced by Michael Bolton, what genre of music does Everybody's Crazy fit into?",
        "response": "melodic hard rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Warriors' Path State Park is named for a network of trails in eastern North America that was used by Native Americans who ran through where?",
        "response": "Great Appalachian Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed 149 films between 1907 and 1926, Luis Buñuel or J. Searle Dawley ?",
        "response": "James Searle Dawley",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Tim Nichols won a Grammy Award for Best Country Song in 2004 was on which Tim McGraw album?",
        "response": "Live Like You Were Dying",
        "source": "hotpot_qa"
    },
    {
        "query": "What song co-written by Sia was performed by Tokio Myers on Britain's Got Talent in semi-final 3?",
        "response": "Diamonds",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is longer, the Lake Washington Ship Canal or the Colorado River Aqueduct?",
        "response": "The Colorado River Aqueduct",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of \"Sal de Mi Piel\" was naturalized in what country?",
        "response": "Mexican",
        "source": "hotpot_qa"
    },
    {
        "query": "Rita Drávucz, is a female water polo player from Hungary, who competed for her native country at the 2004 Summer Olympics in Athens, Greece, the 2008 Summer Olympics, officially known as the Games of the XXIX Olympiad () and commonly known as Beijing 2008, was a major international multi-sport event that took place in Beijing, China, from which time span?",
        "response": "7 to 24 August 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "The Man Who Sued God is a 2001 Australian comedy film starring Billy Connolly, a Scottish comedian, musician, presenter and actor from Glasgow, in which UK country?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did Wilco's contributor to \"Down in a Mirror: A Second Tribute to Jandek\" grow up in?",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Danish heavy metal band from Copenhagen released a compilation album of rare demo tracks?",
        "response": "Mercyful Fate",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the season of \"The Simpsons\", that contains the episode \"Barthood\", begin airing in the United States?",
        "response": "September 27, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor was from the Silent Era, John Francis Dillon or Morgan Freeman?",
        "response": "John Francis Dillon",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the Gulf War begin that required the force of the 101st Airborne Division Artillery?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city and state did Keith Goganious serve as Assistant Head Coach for a university football team?",
        "response": "Hampton, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which contributor to Fear: 13 Stories of Suspense and Horror was born on March 15, 1953 ?",
        "response": "Heather Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Denton and Albert Costa are both tennis players, which one began playing at the age if five?",
        "response": "Costa",
        "source": "hotpot_qa"
    },
    {
        "query": " How does the Ralph Saenz is differentiated by Daron Malakian?",
        "response": "He is best known as the lead singer for the comedic glam metal band Steel Panther",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of the lead member of the group that released Tragic Serenades?",
        "response": "Tom G. Warrior",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state did both Joe Sestak and Pat Toomey serve in politics?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Slappy and the Stinkers was born in the year 1960 ?",
        "response": "B. D. Wong",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country aided Finland in Operation Stella Polaris against the Soviet Union?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Rettbach (Rot) is a river of Thuringia, a federal state in the central of which country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of the current manager of Maidenhead United appeared more than 100 times in what football league?",
        "response": "The Football League for Chester and Crystal Palace",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Byung-hun worked on the 2005 gangster film written and directed by whom?",
        "response": "Kim Jee-woon",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fiery Furnaces and Paul Westerberg, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voices one of the main characters in the film for which Goe Verbinski won the Academy Award for Best Animated Feature in 2012?",
        "response": "Johnny Depp",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the river that begins 40 mi southwest of the county seat of Beltrami County?",
        "response": "192 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the person who is known for playing bass for the lead singer of the Smiths?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "During which years was the politician, upon whom the character Allison Taylor from \"24\" is baded, First Lady of the United States?",
        "response": "1993 to 2001",
        "source": "hotpot_qa"
    },
    {
        "query": "What Chicago gang were Charles \"Chuckie\" Anthony Nicoletti and Salvatore \"Mooney Sam\" Giancana, better known as Sam Giancana, apart of?",
        "response": "Outfit",
        "source": "hotpot_qa"
    },
    {
        "query": "Were \" Battle Sheep \" and \" Guess Who? \" both developed in the same year ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hayes  is the second Olympic gold medalist to be inducted to the Hall of Fame, after what  member of the Sac and Fox Nation",
        "response": "Jim Thorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "What corporation created the game developed to teach school children about the realities of 19th century pioneer life?",
        "response": "Pressman Toy Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Imre Kemecsey, is a Hungarian sprint canoeist who competed in 1960s, competing in two Summer Olympics, he won a silver in 1960 at Rome, Rome, is the capital of Italy and a special comune, and also serves as the capital, of which region?",
        "response": "Lazio",
        "source": "hotpot_qa"
    },
    {
        "query": "Rosie Fellner portrayed Joei Harkness with an English actor who passed away in which year ? ",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Canadian retired professional ice hockey defenceman who played for nine teams in the National Hockey League, who had a Canadian ice hockey executive currently serving as Senior Advisor to the President-General Manager of the New York Rangers negotiated the playing and marketing contract?",
        "response": "Paul Douglas Coffey",
        "source": "hotpot_qa"
    },
    {
        "query": "Kristofor Brown was the head writer of an MTV show created by who?",
        "response": "Mike Judge",
        "source": "hotpot_qa"
    },
    {
        "query": "What Monteverdi ballet was first performed in Lombardy, Italy? ",
        "response": "Il ballo delle ingrate",
        "source": "hotpot_qa"
    },
    {
        "query": "The Toccata and Fugue in D minor, BWV 538, is an organ piece by Johann Sebastian Bach, like the better-known BWV 565, the Toccata and Fugue in D minor, BWV 565, is a piece of organ music written, according to its oldest extant sources, by who?",
        "response": "Johann Sebastian Bach",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the man whom Dr. Diarmuid Whelan wrote his doctoral thesis on?",
        "response": "an Irish politician",
        "source": "hotpot_qa"
    },
    {
        "query": "Donna Gigliotti is an American film producer who produced a 2008 German-American romantic drama film that was written by David Hare and directed by who?",
        "response": "Stephen Daldry",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Harley Brinsfield do that paved the way for Subway?",
        "response": "became one of the first and largest local fast food franchises",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry R. Williams is the father of four-time Academy Award nominee actress that made her feature film debut in what movie?",
        "response": "\"Lassie\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who suggested that the duo form who recorded \"Hard Workin' Man\"?",
        "response": "Tim DuBois",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat star of The Twins Effect used the first name \"Dior\" early in his career?",
        "response": "Ekin Cheng",
        "source": "hotpot_qa"
    },
    {
        "query": "At which junction does the motorway terminate which has junction 36 in the south west corner of Preston Patrick?",
        "response": "Gretna junction",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the magazine of which Stephanie Stahl is the Editor-in-Chief?",
        "response": "San Francisco, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy McClure first appeared in what 13th episode of The Simpsons second season?",
        "response": "Homer vs. Lisa and the 8th Commandment",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2008 Australian comedy-drama film in which Rhys Wakefield played Thomas Mollison?",
        "response": "Elissa Down",
        "source": "hotpot_qa"
    },
    {
        "query": "What name of a Canadian rock band formed in 1995 in Hanna, Alberta, Canada for which Robert John \"Mutt\" produced albums for? ",
        "response": "Nickelback",
        "source": "hotpot_qa"
    },
    {
        "query": "The luteinizing hormone/choriogonadotropin receptor (LHCGR), also lutropin/choriogonadotropin receptor (LCGR) or luteinizing hormone receptor (LHR) is a transmembrane receptor found predominantly in the ovary and testis, but also many extragonadal organs such as the uterus and breasts, the receptor interacts with both luteinizing hormone (LH) and chorionic gonadotropins, such as hCG in humans, hCG is a hormone produced by the placenta after implantation, the acronym stand for?",
        "response": "Human chorionic gonadotropin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the cities of Dashiqiao and Xinghua, Jiangsu in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Huascarán is a mountain that is just shorter than what type of formation in La Rioja Province, Argentina?",
        "response": "extinct volcano",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom's Rhinoplasty, is the eleventh episode, in the first season of which animated television series?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Which large mammal that appears in the engraving for the Wildebeest Kuil Rock Art Centre, is one of any five extant species of odd-toed ungulates in the family Rhinocerotidae?",
        "response": "rhinoceros",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Roland Joffé and José Bohr have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What hockey team is Wesley Walz the former assistant coach and has one Stanley Cup championship?",
        "response": "Tampa Bay Lightning",
        "source": "hotpot_qa"
    },
    {
        "query": "The ethnic group of which Rev. Charles Bluejacket  was once chief spoke what language?",
        "response": "Algonquian-speaking",
        "source": "hotpot_qa"
    },
    {
        "query": "What generic medication is a non-selective betablocker used to treat congestive heart failure?  ",
        "response": "Carvedilol",
        "source": "hotpot_qa"
    },
    {
        "query": "who was a character in A midsummer's night dream as well as the name of Carl Maria von Weber's opera?",
        "response": "Oberon",
        "source": "hotpot_qa"
    },
    {
        "query": "The biblical chronology sometimes associated with young earth creationism places the creation of the world at which year?",
        "response": "4004 BC",
        "source": "hotpot_qa"
    },
    {
        "query": "Which awards did the author of Heartfire win in 1985 ?",
        "response": "Hugo and Nebula Awards,",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the air date of \"The Simpsons\" episode written by Matt Selman which parodied the VH1 series \"Behind the Music\"?",
        "response": "May 21, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the active years of this American rock band, in which John Fogerty was a member?",
        "response": "late 1960s and early 1970s",
        "source": "hotpot_qa"
    },
    {
        "query": "In what amusement park, that is located 60 miles north of Albany, is the the Canyon Blaster located?",
        "response": "Great Escape",
        "source": "hotpot_qa"
    },
    {
        "query": "Sako Shahinian and Arshile Gorky, are of which mutual nationality?",
        "response": "American-Armenian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tyndall crater was named after John Tyndall, what was John Tyndall famous for?",
        "response": "his study of diamagnetism",
        "source": "hotpot_qa"
    },
    {
        "query": "Zero Airport or Ziro Airport, is located at Ziro in the state of Arunachal Pradesh, India, Jet Airways showed interest in flying into the airport from where?",
        "response": "Delhi",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that has held the distributorship of Polo and Ralph Lauren products in Asia is chaired by a businessman that controls 40.13% of the voting capital of DCIL through what?",
        "response": "trusts",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did the United States House Committee on Oversight and Government Reform chairman and Geolocation Privacy and Surveillance Act sponsor act as a representative for?",
        "response": "Utah",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does Computer Conservation Society and Museum of Science and Industry have in common?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Den Tagayasu lived in the town that was bombed on which dates?",
        "response": "9–10 March 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, TISM or A Perfect Circle?",
        "response": "TISM",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the maiden name of the designer of the sign requested by Ted Rogich?",
        "response": "Whitehead",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film came out first Dumbo or The Country Bears ?",
        "response": "Dumbo",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the occupation of both Nagisa Oshima and Roy Ward Baker?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Children's National Medical Center or MedStar Washington Hospital Center the largest private hospital in Washington, D.C.?",
        "response": "MedStar Washington Hospital Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the band with the song \"Songs from the Big Chair formed?",
        "response": "Bath",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 comedy-drama sports film directed by Jonathan Dayton and Valerie Farris has a plot loosely based on Billie Jean King and Booby Riggs?",
        "response": "Battle of the Sexes",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeremy Dawson was a film producer who was nominatd for an Academy Award for what 2014 comedy film?",
        "response": "The Grand Budapest Hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "Role Models was a comedy film that was co-written by the American actor who studied at what American university?",
        "response": "University of Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "SechsKies, was a six-member South Korean boy band, in what year, one of its members includes Eun Ji-won, a South Korean rapper, host, dancer, composer and leader of the first generation idol group SechsKies?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Between the Vizsla and the Saint-Usuge Spaniel which dog breed national breed club was founded in 1990?",
        "response": "Saint-Usuge Spaniel",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Ryah Nixon originally from? ",
        "response": "Seattle, Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another film by the actress who was in the 1990 crime drama adaptation of Macbeth? ",
        "response": "The Four Seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Gene Schaerr served as law clerk for which former President of Baylor University?",
        "response": "Kenneth Winston Starr",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Hana Mandlíková and Johan Kriek, who won more Grand Slam singles at the French Open?",
        "response": "Hana Mandlíková",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fireworks incident, was a very serious case of Football hooliganism which took place on Easter Sunday, on which date, after a 30 minute recess in which marketing director Edwin van der Sar addressed the crowd?",
        "response": "20 April 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What university is in Muncie, Indiana and is near York Prairie Creek?",
        "response": "Ball State University",
        "source": "hotpot_qa"
    },
    {
        "query": "The town of Seward, New York is named after a US secretary of state born on which day ?",
        "response": "May 16, 1801",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times was Bertha of Savoy's husband excommunicated?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Which commuter airline with its head office in the Isle of Man Airport was sometimes operated by Links Air?",
        "response": "Manx2",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the location of The 2016 iHeartRadio Music Award open?",
        "response": "December 30, 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Lusty Juventus is an example of an Entr'acte, more commonly known in French today as what? ",
        "response": "intermission",
        "source": "hotpot_qa"
    },
    {
        "query": "What state other than North Carolina did John H. Sykes attend college?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What show included an actress who was also in a show set in modern-day San Francisco?",
        "response": "\"Melrose Place\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the monarch of Norway ascend to the throne?",
        "response": "17 January 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "The band Antix released an EP in 1984 that was produced by Don Dokken and Jeff Pilson, who are best known for being members of what band?",
        "response": "Dokken",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Barbra Streisand's son do for a living?",
        "response": "actor, director, producer, writer and singer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miniaturist was inspired by a woman of what nationality?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Forsaken House is a fantasy novel that was written by an Author who has worked on which campaign settings?",
        "response": "Dungeons & Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the debut solo album of the singer who voiced Gloria in Happy Feet Two?",
        "response": "Can't Take Me Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Garry West, Australian politician, held several ministerial positions in the Government of what Australian businessman and former politician?",
        "response": "Nick Greiner",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the man that popularized the Nanissáanah shoot an enemy?",
        "response": "August 5, 1881",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cross Florida Barge Canal and Lake Worth Lagoon both located in Florida?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which superhero created by Jerry Siegel and artist Joe Shuster was featured in virtually every issue of World's Finest Comics?",
        "response": "Superman",
        "source": "hotpot_qa"
    },
    {
        "query": "Rodelinda and La vida breve, are which type of drama?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Noir Désir and Balance and Composure are both what?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Buck Barrow is married to what fringe member of Bonnie and Clyde's gang born in 1911",
        "response": "Blanche Barrow",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animated short film created by Patrick McHale was Over the Garden Wall based on ",
        "response": "Tome of the Unknown",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came first Miracle of the White Stallions or Bedknobs and Broomsticks?",
        "response": "Miracle of the White Stallions",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Louis XIV and Cocteau Twins both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In April 2015 Fuganto Widjaja revealed a surprise takeover bid for a mining company founded by a man that is chairman of what company?",
        "response": "JNR Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "Tunnel Vision is a single from an album, when was the album released?",
        "response": "March 31, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the road course for the 24 hour sports car endurance race which Chuck Parsons participated in Daytona Beach, Florida?",
        "response": "3.56 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Multinational Monitor and Martha Stewart Living also television programs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Raymond Carver and Margaret Wilson, both are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "A Charming Garden is located in what area in the Yau Tsim Mong District?",
        "response": "Mong Kok",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this association football award that recognises the best Premier League player each month of the season, which is announced with the Premier League Manager of the Month, currently called?",
        "response": "EA SPORTS Player",
        "source": "hotpot_qa"
    },
    {
        "query": "What river does Beaver and Erie Canal and Louisville and Portland Canal have in common?",
        "response": "Ohio River",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffrey Ettinger serves as independent director of a company founded in 1923 that is headquartered in what city and state?",
        "response": "St. Paul, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Lou Pai is a former executive of an energy company that went bankrupt in what year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "What dramatic work does Eugene Onegin and Il trovatore have in common?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Apple Sr. VP of Software Engineering that introduced Face ID, a facial recognition system for iPhone X, at the Steve Jobs Theater on September 12, 2017?",
        "response": "Craig Federighi",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Zhulin was the partner of the ice dancer who won the World Championships in what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Aram Chobanian and Vic Darchinyan have the same profession ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jang Hoon, directed which 2008 South Korean action crime film?",
        "response": "Rough Cut",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017–18 Wigan Athletic F.C. season will be a year in which the team competes in the league cup known as what for sponsorship reasons?",
        "response": "Carabao Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the presenters of the 2016 Brit Awards from?",
        "response": "Newcastle upon Tyne, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the best known work by the composer of La Cetra?",
        "response": "\"The Four Seasons\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who wrote the biography of Bertha of Bingen was born in what year?",
        "response": "1098",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the ruling for both Hernandez v. Texas and Berman v. Parker unanimous?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Would you find the Almond plant and Aloinopsis in alaska?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which long-time mistress of King Charles II of England occupied a townhouse in Pall Mall, London?",
        "response": "Nell Gwyn",
        "source": "hotpot_qa"
    },
    {
        "query": "Millet is a French-based company, specializing in outdoor equipment such as backpacks and sleeping bags, owned by which organization, their earning comparisons to United States-based companies such as Columbia Sportswear and Timberland LLC, an American manufacturer and retailer of outdoors wear, with a focus on footwear?",
        "response": "Lafuma",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ratio of flow velocity past a boundary to the local speed of sound for a Saab JAS 39 Gripen?",
        "response": "2",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Gordon and Vincenzo Natali, have which mutual nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheick Guillaume Ouedraogo holds notable wins over the likes of a mixed martial artist whois currentaly ranked as the #7 contender in what?",
        "response": "the official UFC rankings",
        "source": "hotpot_qa"
    },
    {
        "query": "Sallie Wilson was associated with what classical ballet company in New York City that has an annual eight-week season at the Metropolitan Opera House?",
        "response": "American Ballet Theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "The Franco-Siamese War was a conflict that included the system of government adopted in France in what year?",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed in a country closer to England, Kodaline or Rivermaya ?",
        "response": "Kodaline",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American patriot Hamilton, New York Wass named after born?",
        "response": "January 11, 1755 or 1757July",
        "source": "hotpot_qa"
    },
    {
        "query": "Shelley Hennig starred in the 2014 American supernatural horror film directed by whom?",
        "response": "Stiles White",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Fertitta Jr was the founder of Station Casinos based in what county?",
        "response": "Clark County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did the hostess of \"Wheel of Fortune\" star in, that premiered November 20, 1988? ",
        "response": "Goddess of Love",
        "source": "hotpot_qa"
    },
    {
        "query": "From which country originate both the flavoured soft drink Nehi and the soft drinks company Faygo Beverages?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Zhucheng and Suining both county-level cities?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Roman Grill is now a player agent whose clients include a former captain of his national team, which he led to what?",
        "response": "2014 FIFA World Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Woo-bin is a South Korean model and actor who made his breakthrough in part with what South Korean television series that also starred Lee Min-ho and Park Shin-hye?",
        "response": "The Heirs",
        "source": "hotpot_qa"
    },
    {
        "query": "What media franchise features a title character whose friends include Piglet, Eeyore, and Owl? ",
        "response": "Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Price and Rob Schneider are both what profession? ",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the photographer associated with the New York School of Photography whose used his camera as a tool for social reform.",
        "response": "Lewis Hine",
        "source": "hotpot_qa"
    },
    {
        "query": "Just Friends? is a short film starring an actor who gained recognition with his leading role in what 2014 film?",
        "response": "Marriage, Not Dating",
        "source": "hotpot_qa"
    },
    {
        "query": "The group known as Various Production has remixed what artist who graduated from BRIT school for Performing Arts and Technology and released the album \"19\"?",
        "response": "Adele",
        "source": "hotpot_qa"
    },
    {
        "query": "Danny Wallace won one cap for which team, controlled by The Football Association?",
        "response": "England national football team",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the main campus of university to which Excel Engineering College was affiliated located? ",
        "response": "Guindy, Chennai",
        "source": "hotpot_qa"
    },
    {
        "query": "On the morning of April 17, 2009 Cyclone Bijli made landfall just south of a seaport city located on the banks of what river?",
        "response": "Karnaphuli River",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NHL right winger endorsed a failed player equipment line by hockey equipment maker Koho?",
        "response": "Jaromír Jágr",
        "source": "hotpot_qa"
    },
    {
        "query": "David Berman was a partner with what mobster who was a driving force behind the development of the Las Vegas Strip?",
        "response": "Benjamin \"Bugsy\" Siegel",
        "source": "hotpot_qa"
    },
    {
        "query": "T-Shirt is a song from an album by Migos that was released on January 27, 2017, by Atlantic Records and who?",
        "response": "Quality Control Music",
        "source": "hotpot_qa"
    },
    {
        "query": "Unveiled in 1991, the Avalon was a concept vehicle does not appear to have any direct relation to the full-size car produced by Toyota in what country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Benjamin Christensen and Len Wiseman directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "who has played more instrument Built to Spill or Republica?",
        "response": "Republica",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the company situated which developed the game tetris ultimate?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Who known for the many characters she originated on CBS's \"The Carol Burnett Show\", produced and arranged albums with an American record producer, arranger, songwriter, multi-instrumentalist, and vocalist who has made music for commercials of international brands ?",
        "response": "Victoria Ann \"Vicki\" Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": "Which universtiy did the Irish composer which  Stainer & Bell Limited publish the works of attended",
        "response": "University of Cambridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What category of academic qualification can be awarded at The Naval Postgraduate School operated by the United States Navy in Monterey, California and the private American research university, Lehigh University, located in Bethlehem, Pennsylvania and established by businessman Asa Packer?",
        "response": "degree",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both punk rock musicians, Spike Slawson and Greig Nori, from Canada? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Monte Porzio (also called the Battle of Tusculum) was fought on 29 May 1167 between the Holy Roman Empire and the Commune of Rome, comparing its effect on the city of Rome, one historian has been called Monte Porzio the \"Cannae of the Middle Ages\",which major battle of the Second Punic War that took place on 2 August 216 BC in Apulia, in southeast Italy, is called?",
        "response": "Battle of Cannae",
        "source": "hotpot_qa"
    },
    {
        "query": "What common characteristic does the Pulmonaria and Bursera genuses have?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Sgt. Warren Reed was a fictional character in a movie that was set in what city?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Nuruddin Farah and Rachel Carson Somali novelists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "How many passengers has the rail service, that uses Burke Centre, carried in fiscal year 2013?",
        "response": "8.04 million passengers",
        "source": "hotpot_qa"
    },
    {
        "query": "What club did the agent of the player highest number of appearances in the Premier League?",
        "response": "Shoreham",
        "source": "hotpot_qa"
    },
    {
        "query": "The Southern Transitional Council, an autonomous and secessionist body whose 26 members, calls for the separation of southern Yemen, during the term of which former president, Yemeni politician?",
        "response": "Ali Abdullah Saleh",
        "source": "hotpot_qa"
    },
    {
        "query": "Current European Commisioner for Competition, Margrethe Vestager, served under what political party from 2002-2014?",
        "response": "Radikale Venstre",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of \"Green Hell\"?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company produced both Toby Tyler and Honey, I Shrunk the Kids?",
        "response": "Walt Disney Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "What Greek mathematician who spend most of his professional life in Germany lends his name to the Vitali–Carathéodory theorem?",
        "response": "Constantin Carathéodory",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Jung currently plays for Brondby on loan from what German association football club that is based in Leipzig, Saxony?",
        "response": "RB Leipzig",
        "source": "hotpot_qa"
    },
    {
        "query": "is  The Family Handyman or  American Heritage a magazine about home improvement?",
        "response": "The Family Handyman",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was the production run of the car that the Volkswagen Passat NMS replaced?",
        "response": "2005 to 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Mopreme Shakur's hip hop group release their only album?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Flower Alley was bred by the trainer who was killed at what Fayette County, Kentucky airport?",
        "response": "Blue Grass Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "From where is the artist who made the album containing the single \"Sippy Cup\"?",
        "response": "Astoria, Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Soviet Union dictator did secret police officer Stainslav Redens work for?",
        "response": "Joseph Stalin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American actor in theatre, television, and film from \"Peter and the Starcatcher\" who played a song writier in the  musical TV series \"Smash?\"",
        "response": "Christian Borle",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the composer who wrote the music for Euryanthe born? ",
        "response": "31 January 179719",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the foreign born victim of Singapore's caning punishment before Oliver Fricker experienced the same?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American-Chinese psychological film in which Lauren Cohan starred in?",
        "response": "William Brent Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third track on the Rolling Stones album that was the first to feature the same track listings in both its UK and US versions?",
        "response": "\"In Another Land\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What castle in the general vicinity of Bellman's Head was built by the Burnett family?",
        "response": "Muchalls Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Sonya in \"Uncle Vanya\" has won how many Golden Globe Awards?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Co-Ro Food and Pocari Sweat, which is manufactured in Asia?",
        "response": "Pocari Sweat",
        "source": "hotpot_qa"
    },
    {
        "query": "The River Bollin that runs through Styal is a major tributary of the River Mersey in what country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Samuel C. Morrison, Jr. (born April 19, 1982) is a Liberian-born producer, screenwriter and journalist, his professional writing career began as a contributing writer for The Source Magazine, interviewing celebrities including which American football running back for the New Orleans Saints of the National Football League (NFL)?",
        "response": "Adrian Lewis Peterson",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lego Ninjago Movie starred the voice of which Pakistani-American comedian?",
        "response": "Kumail Nanjiani",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1904 Selma Feldbach graduated in medicine from a comprehensive university founded in what year?",
        "response": "1834",
        "source": "hotpot_qa"
    },
    {
        "query": " Rangers also made moves to acquire an American-born Mexican professional baseball infielder born in what year?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the band Luscious Jackson formed before Too Much Joy?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Borodin was part of a group of 19th century composers that were known as what \"number\"?",
        "response": "The Five",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is English, David Yates or Gregory Hoblit?",
        "response": "David Yates",
        "source": "hotpot_qa"
    },
    {
        "query": "Grigori Aleksandrov and Maheen Zia, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What fantasy role-play game set in the fictitious world of Mundana was created by Neogames?",
        "response": "Eon",
        "source": "hotpot_qa"
    },
    {
        "query": "For which University did the quarterback featured on the cover of Madden NFL 06 play basketball ?",
        "response": "Syracuse University.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Argentine sports club for which José San Román played based? ",
        "response": "Rosario, Santa Fe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which basketball club located in Alytus, Lithuania does Anatoly Kashirov play for?",
        "response": "BC Dzūkija",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Chartres Cathedral and Blue Mountains mountain ranges in Jamaica?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was formerly home to \"Maggie\", who's best remembered for exhorting the crew in Lifeboat No. 6 to return to the debris field of the 1912 sinking of RMS \"Titanic\" to look for survivors?",
        "response": "1340 Pennsylvania Street in Denver, Colorado, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "How many cast and crew members are there for stage production at the Wynn Las Vegas casino resort created by the director of the Cirque du Soleil show that was first performed on December 25, 1993?",
        "response": "250",
        "source": "hotpot_qa"
    },
    {
        "query": "Bump and run coverage is a strategy often used by defensive backs in American football in which a defensive player lines up directly in front of a wide receiver and tries to impede him, which formercornerback, five-time Pro Bowler and a 1989 Pro Football Hall of Fame inductee of the Pittsburgh Steelers, specialized in this coverage to such a point as to cause a rule change?",
        "response": "Melvin Cornell Blount",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote \"Old Grey Whistle Theft\"?",
        "response": "Arthur Mathews and Graham Linehan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was  Italian industrialist who was  Umberto Agnelli father born ",
        "response": "2 January 1892",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Blankenship is an American rock musician, he currently plays bass guitar for My Morning Jacket is an American rock band, formed in Louisville, Kentucky in what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Curt Weldon represented the congressional district that involved which major city's suburbs?",
        "response": "Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director is older, Gareth Evans or Hans Weingartner? ",
        "response": "Hans Weingartner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which solo band did the writer of the song \"For No One\" found with his first wife?",
        "response": "Wings",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Pomegranates and Nicolas Jaar related?",
        "response": "album",
        "source": "hotpot_qa"
    },
    {
        "query": "Bat Country peaked at #20 on the list of which hard rock and heavy metal magazine's Top 21st Century Hard Rock Songs?",
        "response": "Loudwire",
        "source": "hotpot_qa"
    },
    {
        "query": "What Christmas album featuring Eric Hansen had songs included on the Christmas 25th Anniversary Collection album by Mannheim Streamroller?",
        "response": "A Fresh Aire Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is this American stepdancer, choreographer, and actress that created the Irish dance show \"Dancing on Dangerous Ground?\"",
        "response": "Jean Butler",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the warfare branch that includes the No. 3 Operational Training Unit (3OTU), and was formed March 1921?",
        "response": "The Royal Australian Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Which season did the UCF Knights represent at an American metropolitan public research university in Orlando, Florida?",
        "response": "2010 NCAA Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Jaroslawa Mirowska spied on which party?",
        "response": "Nazi Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the percentage of people in britain who speaks what Upper class characters were presented in ",
        "response": "3%",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fictional character devised by Lewis Carroll did  Alice recited ",
        "response": "The Mock Turtle",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Greyia and Calibanus, which genus contains more species?",
        "response": "Greyia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third album from the band who released \"Songs for a Tailor\" as their debut album?",
        "response": "Wheels of Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this resort area located in Austria, where Schloss Ort is the gate to it?",
        "response": "The Salzkammergut",
        "source": "hotpot_qa"
    },
    {
        "query": "What concert tour visited Asia, Europe, and North America from 6 August 2015 to 11 January 2016 features collaborations with singers Jon Bellion, Troye Sivan, and rapper Logic?",
        "response": "The True Colors Tour",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was published first The Liberator Magazine or Video Watchdog?",
        "response": "Video Watchdog",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the birth date of the actor and bodybuilder who starred in a film directed by Mads Matthiesen?",
        "response": "25 August 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the animated cartoon inspired by the artist who worked on Star Wars, Battlestar Galactica, ET, and Cocoon?",
        "response": "Lucasfilm Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote \"House of Cards\" and Never Surrender?",
        "response": "Michael Dobbs",
        "source": "hotpot_qa"
    },
    {
        "query": "Although he mostly provided backing vocals as part of this group, Mark Owen's first single \"Four Minute Warning\" released on 4 August 2003, was once part of this English pop music group.",
        "response": "Take That",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the two middle names of the man who won the football match against Werder Bremen in 2005-06?",
        "response": "Miguel Pizarro",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year wast the historic Alabama district that is home to the federally owned corporation pushed by the efforts of Senator George W. Norris founded?",
        "response": "1818",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the single that the Jamaican reggae singer born in 1952 in Kingston, Jamaica was most known for?",
        "response": "Steely and Clevie",
        "source": "hotpot_qa"
    },
    {
        "query": "The Clausius–Clapeyron relation was named after a German physicist and mathematician who is considered one of the central founders of what area of science?",
        "response": "the science of thermodynamics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the composer Howard Ashman worked with on his musical released in 1982? ",
        "response": "Alan Menken",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was written by the first juvenile incarcerated for cybercrime in the United States?",
        "response": "Insha'Allah",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts Il tabarro or Orlando ?",
        "response": "Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "From what town is the actor from who played Denham in the 1967 film directed by James Clavell?",
        "response": "Southmoor, Berkshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Get on the Bus is a 1996 film about the gathering of African American men known as what?",
        "response": "Million Man March",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the college preparatory private school where the author of the novel featuring symbologist Robert Langdon and cryptologist Sophie Neveu located?",
        "response": "Beverly Hills, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The Inbetweeners 2 is a 2014 British comedy film and sequel to \"The Inbetweeners Movie\" (2011), a British coming-of-age comedy film based on the E4 sitcom \"The Inbetweeners\", written by series creators Damon Beesley and Iain Morris, and directed by who?",
        "response": "Ben Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "At which university did the notable psychoanalyst associated with the University of Chicago serve most of his career as a professor of psychiatry?",
        "response": "University of New York Upstate",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Thomas Keneally and Peter Straub both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the character who has a son named Louis and has been played by the same actor since the series' inception?",
        "response": "Charlie Fairhead",
        "source": "hotpot_qa"
    },
    {
        "query": "Damernas Värld, a Swedish language magazine and The Lady's Realm, a British magazine both target which demographic as their key audience?",
        "response": "women",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is airport is located in German and second busiest airport in Germany and operates a dense domestic and European network as a member of Lufthansa Cityline? ",
        "response": "Munich Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played June Moone's role in 2016?",
        "response": "Cara Jocelyn Delevingne",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the botanical name of the fruit called nar in Serbian ?",
        "response": "Punica granatum,",
        "source": "hotpot_qa"
    },
    {
        "query": "The smallest of Hawaii's eight main volcanic islands which is home to the rare flowering plant, Euphorbia skottsvergii, get's how many cm of rainfall on average annually?",
        "response": "65",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the principal activity of the company  which holds that which  Robert Melville previously worked with",
        "response": "design, development, manufacture",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress who frequently collaborates with Lars von Trier starred in the film Jacky in the Kingdom of Women?",
        "response": "Charlotte Gainsbourg",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by Jon Secada and Shanice was featured on Disney's 33rd animated feature film?",
        "response": "\"If I Never Knew You\"",
        "source": "hotpot_qa"
    },
    {
        "query": "how many Infinity Gems must earths heroes seek out? ",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": " Kenneth \"Chi\" McBride currently plays in a main role in an American action police procedural television series that premiered in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Stillness was the final albulm of Sergio Mendes. He also co wrote which song for the 2012 Best Original Song for what movie?",
        "response": "Real in Rio",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is in the family Asparagaceae, Anoda or Dipcadi?",
        "response": "Dipcadi",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Wizboy\" is the first episode of the first season of the animated television series \"Fanboy & Chum Chum\", an American 3D CGI animated television series created by Eric Robles for which organization?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 UTSA Roadrunners football team were coached by the former head coach of what Florida college?",
        "response": "University of Miami",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seat of the county that includes the villae of East Nassau, New York?",
        "response": "Troy",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Twin Tin Bots and Star Wars Epic Duels are what type of games?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film written by Chris Coghill starred Jack O'Connell?",
        "response": "Weekender",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, Leos Carax or Emeric Pressburger, is noted for his poetic style and his tortured depictions of love?",
        "response": "Alex Christophe Dupont",
        "source": "hotpot_qa"
    },
    {
        "query": "Live  is a song that was covered by which Los Angeles-based pop-rock band?",
        "response": "The Bangles",
        "source": "hotpot_qa"
    },
    {
        "query": "Pandikona and Alpine Mastiff are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Stan Zimmerman produced the show \"Rita Rocks\" whose lead actress also appeared in the TV shows Martin and what ABC sitcom?",
        "response": "My Wife and Kids",
        "source": "hotpot_qa"
    },
    {
        "query": "William J. \"Willem\" Dafoe has an apperance in American superhero film directed by who?",
        "response": "Zack Snyder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author would be older today Miriam Toews or W. G. Sebald?",
        "response": "W. G. Sebald",
        "source": "hotpot_qa"
    },
    {
        "query": "For which conflict did the Canadian Government award the Canada General Service Medal for attacks by an Irish Republican organization based in the United States against British army forts and custom posts in Canada?",
        "response": "Fenian raids",
        "source": "hotpot_qa"
    },
    {
        "query": "La princesse de Navarre had music by which French composer?",
        "response": "Jean-Philippe Rameau",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor and former fashion model, known for his role as the titular superhero of the 2006 film \"Superman Returns\" also starred in a 2016 Chinese action film alongside Zhang Yuqi?",
        "response": "Brandon James Routh",
        "source": "hotpot_qa"
    },
    {
        "query": "What city near Space Coast has a population of 11,231 in the 2010 United States Census?",
        "response": "Cocoa Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Nickerson Mountain is a mountain located in Carroll County, New Hampshire, in which location of mountains, just south of the White Mountains of New Hampshire, United States?",
        "response": "Ossipee Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Archduke of Austria-Este was assassinated by Bosian Serb, Mihajlo \"Miško\" Jovanović?",
        "response": "Archduke of Austria-Este",
        "source": "hotpot_qa"
    },
    {
        "query": "Security Square Mall, Perry Hall and the North American School of Trades are all parts of which east-coast U.S. city?",
        "response": "Baltimore",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Lovely Rita\" is a song on what album from a famous English rock band?",
        "response": "Sgt. Pepper's Lonely Hearts Club Band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was created first, Where Have All the Flowers Gone? or American Pimp?",
        "response": "American Pimp",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the town in Hertfordshire, England where Benslow Music Trust is based?",
        "response": "Hitchin",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city are the performers who released the song Be Mine based ?",
        "response": "Paris",
        "source": "hotpot_qa"
    },
    {
        "query": "What Slovakian palace served as the location for the signing of a truce agreement between Napoleon and Holy Roman Emperor Francis II?",
        "response": "Primate's Palace",
        "source": "hotpot_qa"
    },
    {
        "query": "What series is the author of the novelized Bases Loaded II: Second Season game known for?",
        "response": "\"Seven Wonders\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Astro Boy and The Secret of Kells share which genre of film?",
        "response": "Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Sung-hee (born February 3, 1979) is a South Korean film director, he directed which box office hit, a 2012 South Korean fantasy romance film in which a beautiful teenage girl (Park Bo-young) is sent to a country house for her health, where she befriends and attempts to civilize a feral boy she discovers on the grounds ?",
        "response": "A Werewolf Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of cells do Eric Kandel and Paul Greengard share a Nobel Prize for their research of?",
        "response": "neurons",
        "source": "hotpot_qa"
    },
    {
        "query": "Which national park was recognized first, Garajonay National Park or Guadarrama National Park?",
        "response": "Garajonay National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the nationality of the signer whose vocals were used for tilted?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Harlan County War, a series of coal mining-related skirmishes, Florence Reece wrote what acclaimed folksong?",
        "response": "\"Which Side Are You On?\"",
        "source": "hotpot_qa"
    },
    {
        "query": "A Swarovski crystal mesh Armani Privé gown was worn by an Australian actress who has what middle name?",
        "response": "Elise",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, The Saved or Grey Gardens?",
        "response": "Grey Gardens",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the postcode for Kilburn, a suburb located in the inner north of Adelaide, South Australia, and Blair Athol, a suburb located 15km north of Adelaide CBD, Australia?",
        "response": "5084",
        "source": "hotpot_qa"
    },
    {
        "query": "What ocean are both Hampton Beach, New Hampshire and the Hampton Beach Casino Ballroom by?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former name of the landlocked country bordered by Zambia to the northwest, Tanzania to the northeast, and Mozambique on the east, south and west in which a species of moth from the family Adelidae is known?",
        "response": "Nyasaland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has the campus with the greater area, St. Mary's University, Texas or the University of West Florida?",
        "response": "University of West Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more stage names, Simple Kid or Nic Nassuet?",
        "response": "Nic Nassuet",
        "source": "hotpot_qa"
    },
    {
        "query": "What aeronautical engineer, USAF test pilot and chief of the U.S. Air Force's Flight Test Engineering Laboratory starred in \"The Right Stuff\"?",
        "response": "Jack Ridley",
        "source": "hotpot_qa"
    },
    {
        "query": "What author of several best-selling books also wrote The Scarlet Slippers?",
        "response": "Philip Pullman",
        "source": "hotpot_qa"
    },
    {
        "query": "what Florida based band shares a member with the band Tremonti?",
        "response": "Alter Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What shows have seen guest appearances by the actor who played the voice of Hamm in \"Toy Story\"?",
        "response": "\"St. Elsewhere\", \"Wings\" and \"Frasier\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The classic presenter of the paradox of value is a philosopher that died in this year?",
        "response": "1790",
        "source": "hotpot_qa"
    },
    {
        "query": "Who commanded the American forces at the conflicts that took place from January 18–23, 1813 during the War of 1812?",
        "response": "James Winchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed this South Korean action noir film starring Lee Min-ki and Lee Tae-im?",
        "response": "Park Sang-jun",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the band in which the member, who is known as the \"Five Foot Assassin\" and is featured on the song \"La Schmoove,\" is part of?",
        "response": "A Tribe Called Quest",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did General Musa Khan Akbarzada formerly hold the Pakistani capital of Peshawar?",
        "response": "consulate general",
        "source": "hotpot_qa"
    },
    {
        "query": "What liquor is found in both a Black Russian and a Glowtini?",
        "response": "is a cocktail of vodka",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous pawn shop do Richard Kevin Harrison and Core Harrison own?",
        "response": "World Famous Gold & Silver Pawn Shop",
        "source": "hotpot_qa"
    },
    {
        "query": "Frederick Steven \"Freddie\" Roach, is an American boxing trainer and former professional boxer, and is the enduring boxing coach of top prospect Peter Quillin, an American professional boxer who held the WBO middleweight title, from which span of years?",
        "response": "2012 to 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the position in the Wehrmacht of the deputy head of the counter-espionage bureau in the Abwehr who worked with Otto Armster?",
        "response": "general",
        "source": "hotpot_qa"
    },
    {
        "query": "Aerangis and Satureja can both be found on which continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What band did Gator Country guitarist that co-wrote Bloody Reunion come from?",
        "response": "Molly Hatchet",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the total inmate population in the state New Hampshire State Prison for Men is located in?",
        "response": "2,791",
        "source": "hotpot_qa"
    },
    {
        "query": "Star Wars Epic Duels and Camel Up, are which specific form of entertainment?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jerome Robbins and K-Michel Parandi an American filmmaker?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert B. Radnitz was the producer of the 1974 film adaptation of the novel by whom?",
        "response": "Bill and Vera Cleaver",
        "source": "hotpot_qa"
    },
    {
        "query": "When will the location that appears in AC/DC's live 2007 concert DVD host the Summer Olympics?",
        "response": "2024",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting of J.T. Petty's video game \"Outlast 2\"?",
        "response": "the Arizona desert",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 Pro Bowl and the Super Bowl XLIV both took place where?",
        "response": "Miami Gardens, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Joseph Kosinski and Harold Young have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was founded first, High Times or Airliners?",
        "response": "High Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Kern Island Canal and Bald Eagle and Spring Creek Navigation are both relelated to canals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the historical name for the fourteenth-century tower found in a suburb of Edinburgh? ",
        "response": "Niddry Seton",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the majority of Sylheti language speakers located?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Griffin Auto Company Building is named after the company that is in what region of the US?",
        "response": "southeastern",
        "source": "hotpot_qa"
    },
    {
        "query": "What modern countries border the ancient territory of the Kinambroi?",
        "response": "Albania and Montenegro",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game allows more players to play, Forbidden Island or Australia?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cribs and Julian Cope, is of which nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the lodge that William Irving Turner  was credited with constructing built?",
        "response": "1936 to 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what countries was Strut-Harald's half-brother the king?",
        "response": "Denmark and Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "Great Palace Mosaic Museum and Hirami Ahmet Pasha Mosque, have which city in common?",
        "response": "Constantinople",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Bozic fought and lost to a professional boxer with what nickname?",
        "response": "Easton Assassin",
        "source": "hotpot_qa"
    },
    {
        "query": "Lauri Markkanen was traded for which player who was born in Houston?",
        "response": "Jimmy Butler III",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean professional footballer was awarded 2015 Best Footballer in Asia?",
        "response": "Son Heung-min",
        "source": "hotpot_qa"
    },
    {
        "query": "What season of Gilmore Girls featured an actress as a maid of honor who had also played the role of Winnie Foster?",
        "response": "thirteenth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founding member of U-FLY Alliance is based in New North Zone, Chongqing, People's Republic of China?",
        "response": "West Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Which website contributes to the Slashdot effect and allows registered users to up or down vote submissions?",
        "response": "Reddit",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Guy Ritchie and Todd Field.both filmmakers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Up and Scooby-Doo! and the Samurai Sword, have which genre in common?",
        "response": "comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What rebellion, which culminated with the Second Battle of Vinegar Hill, was the largest convict uprising until the 1830 Bathurst rebellion?",
        "response": "Castle Hill convict rebellion",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of group does Social Distortion 2001 Tour and Mike Ness have in common?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the bands Surrounded and The National formed in the same county?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is home of the Lindner Family Tennis Center and the 7th most populous state in the United States?",
        "response": "Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "What seventh studio album is recorded by American rapper Pitbull.",
        "response": "Global Warming",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1960's stage revue written by Peter Cook and Dudley Moore has been regarded as beginning the Satire Boom?",
        "response": "Beyond the Fringe",
        "source": "hotpot_qa"
    },
    {
        "query": "In which mountain range is the the Fitzroy ?",
        "response": "the Andes",
        "source": "hotpot_qa"
    },
    {
        "query": " The Painted Veil is the original soundtrack of a 2006 film based on a novel by what author?",
        "response": "W. Somerset Maugham",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays for Palmeiras and achieves representation from Juan Figer Svirski's organisation?",
        "response": "Zé Roberto",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the album released on which \"Rock is Dead\" is a single?",
        "response": "September 14, 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the cult shows created by Eric Fogel was produced by Tornante Animation in association with Cuppa Coffee Studios and Rogers Communications?",
        "response": "Glenn Martin, DDS",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Scottish Gaelic word for the city in which the Craigentinny Traction Maintenance Depot is located?",
        "response": "Dùn Èideann",
        "source": "hotpot_qa"
    },
    {
        "query": "Cassius M. \"Cash\" Hollister (December 7, 1845 – October 18, 1884) was a 19th-century American law enforcement officer and deputy U.S. marshal who served as mayor and sheriff of which city in Kansas, during his career, he worked with several well-known lawmen including Henry Newton Brown (1857 – April 30, 1884) was an American Old West gunman who played the roles of both lawman and outlaw during his life?",
        "response": "Caldwell",
        "source": "hotpot_qa"
    },
    {
        "query": "Georgia was released in 2016 during which annual event, held in April?",
        "response": "Record Store Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which captain commanded the Dutchman in a film produced by Jerry Bruckheimer?",
        "response": "Davy Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did this hotel and casino, located nearer to Gold Mountain Casino than any other casinos, open?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Which restaurant opened first, Jet's Pizza or East of Chicago Pizza?",
        "response": "Jet's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the episode from the \"Walking Dead\" where Rosita Espinosa and the others find the Alexandria Safe Zone?",
        "response": "\"Self Help\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the author of Freeway Warrior's original occupation?",
        "response": "Originally a musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an English singer-songwriter from Leicester, England, Dirty Three or Jersey Budd ?",
        "response": "Jersey Budd",
        "source": "hotpot_qa"
    },
    {
        "query": "which nuclear reservation in the United States  did  the U.S. Atomic Energy Commission acquired Meyers Mill  as part of ",
        "response": "The Savannah River Site",
        "source": "hotpot_qa"
    },
    {
        "query": "De Beneficiis and the series regarding \"the happy life\" translate to what Greek concept?",
        "response": "eudaimonia",
        "source": "hotpot_qa"
    },
    {
        "query": "On what island is the airport where Marilyn Jordan Taylor designed the SkyCity?",
        "response": "Chek Lap Kok",
        "source": "hotpot_qa"
    },
    {
        "query": "What show did Chuck Woolery host 1 year before hosting the game show \"Think like a Cat\"?",
        "response": "\"Lingo\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Darwin located?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Why is Leon Trotsky associated with permanent revolution?",
        "response": "He would go on to become one of the seven members of the first Politburo, founded in 1917 to manage the Bolshevik Revolution.",
        "source": "hotpot_qa"
    },
    {
        "query": "The Big Green, is a 1995 family sports comedy film, by Walt Disney Pictures starring which English-American actress, singer and songwriter?",
        "response": "Olivia Jane d'Abo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first principle of Kwabena Okyere Darko-Mensah's secondary school?",
        "response": "James Picot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film company has connections with both A Tiger Walks and Finding Dory?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Surfrider is located at the water park owned by what company?",
        "response": "Village Roadshow Theme Parks",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the sea-going vessel used by the Royal Australian Army during 1945 but also use as early as 2nd century AD  and developed rapidly during the Song Dynasty? ",
        "response": "Junk",
        "source": "hotpot_qa"
    },
    {
        "query": "Jung Sung-il placed 17th at the Winter Olympics figure stating competition that was held at what Olympic Amphitheatere?",
        "response": "Hamar",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an award-winning Austrian artist, filmmaker, writer, actor, curator, theatre director and lecturer, Johannes Grenzfurthner or Jaap Speyer?",
        "response": "Johannes Grenzfurthner",
        "source": "hotpot_qa"
    },
    {
        "query": "Cantabrian mythology was likely diluted by what Iron Age mythology?",
        "response": "Celtic mythology",
        "source": "hotpot_qa"
    },
    {
        "query": "What American statesman and a retired four-star general in the United States Army has attended events at the Southern Center for International Studies? ",
        "response": "Colin Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the palace built near the River Arno in Florence, Italy by the son of Buonaccorso Pitti?",
        "response": "Palazzo Pitti",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of navigation is still being taught as of 2014, and has been known to use the word Kanake?",
        "response": "Polynesian navigation",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Noye's Fludde connected to Chester Mystery Plays?",
        "response": "it is based on the 15th-century Chester \"mystery",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Clark-Rouire is best known as being the perennial alternate for someone who won gold where?",
        "response": "2014 Sochi Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Gregory Nava and John Rawlins have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Griffin is a fictional character from the American animated television series \"Family Guy\", an anthropomorphic white dog voiced by which American actor, filmmaker, comedian, and singer, working primarily in animation and comedy, as well as live-action and other genres, and is the creator of the TV series, \"The Orville\" (2017–present)?",
        "response": "Seth MacFarlane",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Breathing Your Love\" is a song by the Swedish singer Darin featuring vocals by singer Kat DeLuna, in October 2009 which Swedish ESA astronaut, and physicist, took 2 copies of the single into space with him?",
        "response": "Christer Fuglesang",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns a 2,640-room hotel, casino and shopping promenade on the Las Vegas Strip that has a casino located within it that includes beer pong tables, a stage, a dance floor and a pit with games including blackjack, roulette, and craps?",
        "response": "Caesars Entertainment Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "The Order of the Lithuanian Grand Duke Gediminas features one of the earliest symbols of Lithuania, which is one of its historical what?",
        "response": "historical coats of arms",
        "source": "hotpot_qa"
    },
    {
        "query": "Is director Laura Neri of the same nationality that actress Susan Oliver was?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published the game Iron Man and X-O Manowar in Heavy Metal, for Sega's 32 bit game console?",
        "response": "Acclaim Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gerard Way and Saffron both singers and songwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which district of the Badakhshan Province is the settlement located which is famous for its ancient mines, which produce a deep blue metamorphic rock used as a semi-precious stone that has been prized since antiquity for its intense color, and are said to produce the world's finest of this stone?",
        "response": "the Kuran Wa Munjan District",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor, who starred in Staten Island Summer and has Carrie Brownstein as a comedy partner, was born on what day?",
        "response": "born December 4, 1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays the title character of the British crime drama programme written by Neil Cross that is also credited to the English and Canadian filmmaker Stefan Schwartz?",
        "response": "Idris Elba",
        "source": "hotpot_qa"
    },
    {
        "query": "DVD version of Living Things + includes live versions from an album that was certified what?",
        "response": "diamond",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Clayton Goose Freeman played for an American football team that is based in Cleveland, Ohio, and competes in what division of the AFC?",
        "response": "North division",
        "source": "hotpot_qa"
    },
    {
        "query": " Billy Preston is an American college basketball player for a team that competes in what?",
        "response": "the Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the manufacturer of the plane that shot down Jameel Sayhood?",
        "response": "McDonnell Douglas",
        "source": "hotpot_qa"
    },
    {
        "query": "In which ancient civilzation of ancient Northeastern Africa did the official Djehuty under the ruling queen Hatshepsut live? ",
        "response": "Ancient Egypt",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the drummer for the Goo Goo dolls when their sixth album, Dizzy Up The Girl was released?",
        "response": "Mike Malinin",
        "source": "hotpot_qa"
    },
    {
        "query": "Cassius Marcellus Clay Sr. is the father of this American former heavyweight boxer, younger brother to Muhammad, born in what year?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Cinco paul and Ken daurio Dr. Seuss' The Lorax",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Ruth Higham is a former \"Page 3\" girl,that modelled for which British tabloid newspaper?",
        "response": "\"The Sun\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Father's Little Dividend is a comedy film directed by an American stage director who was born in what year?",
        "response": "1903",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town where Matthew Butturini was born>",
        "response": "population of 8,523 people",
        "source": "hotpot_qa"
    },
    {
        "query": "The 329th Combat Crew Training Squadronwas inactivated at a base located how far from Sacramento, California ?",
        "response": "115 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "Night of Champions in 2009 was held at what multi-purpose indoor arena in Philadelphia?",
        "response": "Wells Fargo Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Dunstan is an electoral district that includes which suburb of Adelaide in the City of Norwood Payneham St Peters?",
        "response": "College Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Blueberry, is a French acid western, released in what year, directed by Jan Kounen, the film starred Vincent Cassel as the title character along with Michael Søren Madsen, an American actor, producer, director, writer, poet and photographer?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2016 population of the town that Tura Beach, New South Wales is a suburb of?",
        "response": "3,544",
        "source": "hotpot_qa"
    },
    {
        "query": "How old was Rose Hartwick Thorpe when she wrote the poem she would be largely remembered for writing? ",
        "response": "16 years old",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jonathan Demme and Chris Renaud both American filmmakers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A Modest Video Game Proposal is an allusion to the essay written in what year?",
        "response": "1729",
        "source": "hotpot_qa"
    },
    {
        "query": "Anja Nissen (born 6 November 1995), sometimes known as simply Anja, is a Danish-Australian singer, songwriter, dancer and actress, she lists her influences as Patti LaBelle, an American singer, author, actress, and entrepreneur, born when? ",
        "response": "May 24, 1944",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor who starred in the movie Gryphon and as the voice of Pops in \"Johnny Bravo\" born? ",
        "response": "February 21, 1950",
        "source": "hotpot_qa"
    },
    {
        "query": "What name is called by his admirers  who is the music composer and created the music for the Hindi movie Musafir ?",
        "response": "Salilda",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an annual Christmas tradition celebrated in towns across Europe: in France, Germany, and Austria? ",
        "response": "Christmas market",
        "source": "hotpot_qa"
    },
    {
        "query": "What hit song, sung by Rihanna was featured on her fifth studio album \"Loud\" and reached number one on the US Billboard Hot 100?",
        "response": "\"What's My Name?\"",
        "source": "hotpot_qa"
    },
    {
        "query": "John F. Haught testified at the Supreme Court case that was the first direct challenge to the school policy requiring the teaching of what concept?",
        "response": "intelligent design",
        "source": "hotpot_qa"
    },
    {
        "query": "Dave Ragone played football for a university team currently coached by whom?",
        "response": "Bobby Petrino",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the leader of the Network Italy faction within Popular Alternative?",
        "response": "Roberto Formigoni",
        "source": "hotpot_qa"
    },
    {
        "query": "Journey to the Center of the Earth starred a former Metro-Goldwyn-Mayer contract star who is the mother of what actor?",
        "response": "Lorenzo Lamas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Academy Award was won by Stephan Dupuis for a film starring Jeff Goldblum, Geena Davis and John Getz?",
        "response": "Best Makeup",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress and singer is overdubbed in German by Gabrielle Pietermann?",
        "response": "Selena Gomez",
        "source": "hotpot_qa"
    },
    {
        "query": "California Suite is a 1976 play by an american playwright born in what year?",
        "response": "1927",
        "source": "hotpot_qa"
    },
    {
        "query": "American singer Steve Earle has released how many studio albums, including a collaboration with bluegrass artist Del McCoury, Delano Floyd McCoury was born in Bakersville, North Carolina in 1939, but the family relocated to York County, Pennsylvania while he was still a child, is an American bluegrass musician?",
        "response": "sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "The tap dancing soloist in My Feet Keep Dancing also starred in what 1935 MGM musical?",
        "response": "\"An All-Colored Vaudeville Show\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Ryan Murphy cowrote a movie based on which book of the same name that appeared on \"The New York Times\" Best Seller list for 187 weeks?",
        "response": "Eat Pray Love",
        "source": "hotpot_qa"
    },
    {
        "query": "Sara Jane Moore, is an American citizen best known for attempting to assassinate US President Gerald Ford, in which year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the award for his performances throughout the campaign of the 25th season of the Premier League?",
        "response": "Dele Alli",
        "source": "hotpot_qa"
    },
    {
        "query": "The home ground stadium for FC Copenhagen hosted a crowd of how many during the 2010 Danish Cup Final?",
        "response": "18,856",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a documentary on the Louisville, Kentucky band Slint with a focus on their seminal final album that is their second and final studio album?",
        "response": "Lance Bangs",
        "source": "hotpot_qa"
    },
    {
        "query": "Harald Sunde played for the Norwegian football club from which city?",
        "response": "Trondheim",
        "source": "hotpot_qa"
    },
    {
        "query": "What award does James Franck and Humboldt University of Berlin have in common?",
        "response": "Nobel Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "On which semi-autobiographical film is based the 2009 romantic musical drama, which features an ensemble cast including the English actress who made her debut with the Old Vic Company?",
        "response": "8½",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by a Barbadian singer was covered by Marié Christina Digby?",
        "response": "\"Umbrella\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an Anglo-Irish soldier and statesman who was one of the leading military and political figures of 19th-century Britain, who said \"Publish and be damned!\" to an English publisher and editor with something of a reputation as a pornographer?",
        "response": "Arthur Wellesley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist has been a member of fewer musical groups, Curtis Wright or Paul Di'Anno?",
        "response": "Paul Di'Anno",
        "source": "hotpot_qa"
    },
    {
        "query": "Which metal band from Melbourne, Victoria released their debut studio album through Volkanik Music on November 13, 2012?",
        "response": "Twelve Foot Ninja",
        "source": "hotpot_qa"
    },
    {
        "query": "George Robert Reed shares which claim with a Canadian football player who played for Drake University?",
        "response": "greatest running back",
        "source": "hotpot_qa"
    },
    {
        "query": "The Song, Your Mirror, is featured on Stars an, album by Simply Red that was released in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": " Ballad for Americans is a studio album of phonograph records by an American singer and actor whose sold how many records, tapes, compact discs and digital downloads?",
        "response": "over one billion",
        "source": "hotpot_qa"
    },
    {
        "query": "American action thriller film London Has Fallen stars this American film and television actor born in 1963 from which state?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "116th Street lies in what community district?",
        "response": "Manhattan Community District 11",
        "source": "hotpot_qa"
    },
    {
        "query": "Focus is an American music producer who produced tracks for an American rapper, record producer, and actor, who was born in October of what year?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "To which film category are both Call Me Kuchu and That's Dancing! belong?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the net worth of the inventor of the Swift Boat Challenge?",
        "response": "$500 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer/songwriter was older, Gwen Stefani or Freddie Mercury?",
        "response": "Farrokh \"Freddie\" Mercury",
        "source": "hotpot_qa"
    },
    {
        "query": "Are George Marshall and Kenji Mizoguchiboth American screenwriters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Another Day of Sun\" is the opening number from a film that stars who as a jazz pianist?",
        "response": "Ryan Gosling",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the ballet that Vassilie Trunoff performed when he toured Australia in 1975 & 1977 that derives from revivals staged by Marius Petipa?",
        "response": "Giselle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which historical event is known as the Revolution of 1688 and caused the noble in Scotland to lose control over the Church of Scotland parish churches?",
        "response": "Glorious Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the brother of Jorge Santana who first became famous in the late 1960s and early 1970s with his band, Santana?",
        "response": "Carlos Santana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Johnny Carson's sidekick that had a drunk clip of him drunk on \"The Tonight Show\" shown on The Show with No Name?",
        "response": "Ed McMahon",
        "source": "hotpot_qa"
    },
    {
        "query": "The KL-43 was paraded in front of cameras during what political scandal that occurred during the second term of the Reagan administration?",
        "response": "The Iran–Contra affair",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Simpson's episode written by Matt Selman that aired in the United States on May 21, 2000?",
        "response": "Behind the Laughter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the ruler of an ancient city located Northwest of the junction of the Euphrates and Tigris and had several statues found in southern Mesopotamia?",
        "response": "Gudea ruled",
        "source": "hotpot_qa"
    },
    {
        "query": "For what edition of the UEFA European Championship is Elkhan Mammadov spearheading a bid for Baku?",
        "response": "16th edition",
        "source": "hotpot_qa"
    },
    {
        "query": "The dance double in the Black Swan dance double controversy involved which principal dancer of the American Ballet Theatre?",
        "response": "Sarah Lane",
        "source": "hotpot_qa"
    },
    {
        "query": "Leonard Johnson was the cornerback for what college football team who’s home field is the jack trice stadium? ",
        "response": "Iowa State Cyclones football",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who was starred in \"Intrepid\" with James Coburn and Finola Hughes born?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Iruttinte Athmavu, is a Malayalam film, released in which year, and was directed by P. Bhaskaran, and features music by M. S. Baburaj, was a Malayalam music composer?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "What category of publication can, the American food bimonthly Bon Appétit and the official periodical of the Church of Jesus Christ of Latter-day Saints, called Ensign, be described as?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What college teamdid the point guard that led the way for Philedlphia 76ers in the 2017-18 season play basketball in?",
        "response": "Washington Huskies",
        "source": "hotpot_qa"
    },
    {
        "query": "Born Again starred the American film actor who played what role in The Best Years of Our Lives?",
        "response": "Fred Derry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was a side project of New Order bassist Peter Hook, Love Among Freaks or Monaco?",
        "response": "Monaco",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress starred in both of the films \"Unforgettable\" and \"Men in Black II\"?",
        "response": "Rosario Dawson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one, Boğaziçi University or Basilica Cistern, was built in the 6th century during the reign of Byzantine Emperor Justinian I?",
        "response": "The Basilica Cistern",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this English naturalist, geologist and biologist who mentioned the French botanist, Henri Lecoq, 1859 in the preface of his book?",
        "response": "Charles Darwin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Swabian name of the city in Baden-Württemberg with a T-Systems Multimedia Solutions office?",
        "response": "Schduagert",
        "source": "hotpot_qa"
    },
    {
        "query": "Trisha Silvers' husband played for what football club?",
        "response": "Melbourne Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "In what army is Mehmetçik slang for a common a common soldier?",
        "response": "Ottoman Army",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the band that song \"No Smokes\" was used in an episode of the TV series \"Clangers\"?",
        "response": "Jaygars",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiroaki Sato fought which Japanese mixed martial artist born on July 21, 1981?",
        "response": "Yushin Okami",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician performed with Stephen Malkmus and the Jicks, Jon Spencer or Stephen Malkmus?",
        "response": "Stephen Joseph Malkmus",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Dead Milkmen and Thousand Foot Krutch from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Chris Menges or Mike Newell?",
        "response": "Chris Menges",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Waldsteinia and Obregonia contain the same number of species?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The New Year Honours 1961 were appointments by many of the Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries, which type of location is a sovereign state that is a member of the Commonwealth of Nations and shares the same person, currently Elizabeth II, as its head of state and reigning constitutional monarch, but retains a crown legally distinct from the other realms?",
        "response": "Commonwealth realm",
        "source": "hotpot_qa"
    },
    {
        "query": "For which role was actress who made her debut in the film  No Small Affair nominated for an Academy Award ? ",
        "response": "Olive Neal",
        "source": "hotpot_qa"
    },
    {
        "query": "which actress met the prime minister of Gordon at the head quarters of the government of the United Kingdom whose debut album is named faryl released in 2009?",
        "response": "British mezzo-soprano Faryl Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "In what area were the Leičiai native to during 1219 and 1295?",
        "response": "Lietuva Land",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the name of a 2002 thriller film starring Agnes Bruckner",
        "response": "Murder by Numbers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Rob Houwer and Paul Verhoeven's nationality?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Whenever You Need Somebody\" by O'Chi Brown was recycled by the song's producers for an English singer who by time of his retirement in 1993 had sold approximately how many records worldwide?",
        "response": "40 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Lisa Flanagan movie debut was in a film irected by who?",
        "response": "Paul Goldman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show with an episode called \"How to Eat with Your Butt\"?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Before 2012, who were the Baylor Bears sports rival?",
        "response": "Texas A&M Aggies",
        "source": "hotpot_qa"
    },
    {
        "query": "The television series on which Will Mellor starred as Steve Connolly premiered on what date?",
        "response": "4 March 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress was featured in Dreamer, and was nominated for a Screen Actors Guild Award at age eight?",
        "response": "Dakota Fanning",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Barry Ricardo Forde test positive for a substance used to treat hypogonadism and certain types of breast cancer?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the harpist who came out with the album \"White Winds\"?",
        "response": "Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "In which arena did Thato Batshegi lose to Kenyan Nick Okoth in the gold medal match?",
        "response": "Workers Indoor Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more members, Dada or Alt-J?",
        "response": "Alt-J",
        "source": "hotpot_qa"
    },
    {
        "query": "I'm a Loser was considered for release as a single until a track was written that featured the first uses of what in populer music?",
        "response": "guitar feedback",
        "source": "hotpot_qa"
    },
    {
        "query": "Which New York City based newspaper named Rhonda Lee Vincent \"the new Queen of Bluegrass\"?",
        "response": "The Wall Street Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "What title did Krofft Productions give the remake of their half-hour Saturday-morning children's series?",
        "response": "Land of the Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "Raoul Duke is the fictional character in which novel, illustrated by Ralph Steadman?",
        "response": "Fear and Loathing in Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the Tundra Mine and Negus Mine located in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Kaurna name of the river that runs along Mount Torrens in South Australia?",
        "response": "Ngangkiparri",
        "source": "hotpot_qa"
    },
    {
        "query": "Which class was this Austro-Hungarian dreadnought battleship that was renamed to Jugoslavija and rigged with explosives and sunk near the end of World War I?",
        "response": "Tegetthoff",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was released one year before Nicki Minaj's \"Come on a Cone\"",
        "response": "\"Stupid Hoe\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant grows in East Asia, Aquilegia or Semiarundinaria?",
        "response": "Semiarundinaria",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthday of the man who Don Melnick's position is named after?",
        "response": "September 25, 1866",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 biographical sports film was written by Simon Beaufoy and directed by husband and wife, Jonathan Dayton and Valerie Faris?",
        "response": "Battle of the Sexes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio produced the movie which had a 21-minute Halloween television special based on it that premiered on Wednesday, October 16, 2013?",
        "response": "Pixar Animation Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Lake Wollumboola lies to the north of a bay that is said to possess what?",
        "response": "the whitest sand in the world",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was Mark Dacascos featured in first, Brotherhood of the Wolf or Cradle 2 the Grave?",
        "response": "Brotherhood of the Wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio developed the game in which Jarlath Conroy voiced the character Aiden O'Malley?",
        "response": "Rockstar North",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Muppet Treasure Island or Million Dollar Arm ?",
        "response": "Muppet Treasure Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Kings Domain is an area of parklands in Melbourne, Victoria, Australia, it surrounds Govern House Reserve, the home of the Governors of Victoria, and which outdoor performance venue in Melbourne, Victoria, Australia, located in the lawns and gardens of Kings Domain?",
        "response": "Sidney Myer Music Bowl",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Swiss military-trained pilot and an aviation enthusiast had very successful attempt at powered skydiving?",
        "response": "Yves Rossy",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary Anthony Williams voices the character Uncle Ruckus on an animated sitcom that appears on what network?",
        "response": "Adult Swim",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitetop Mountain is the second-tallest mountain in Virginia behind which peak, near Troutdale?",
        "response": "Mount Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Fastbacks and Hüsker Dü formed in Saint Paul, Minnesota?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bowling for Columbine and Incident at Oglala both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Trevor Carlin has had success in the junior motorsport formulas in a period spanning over 25 years, As Team Manager of Bowman Racing, he assembled a talented group of engineers,  in the team's first three seasons and won the 1989 Macau Grand Prix, a motor-racing event held annually in Macau, one of China's Special Administrative Regions, with who driving?",
        "response": "David Brabham",
        "source": "hotpot_qa"
    },
    {
        "query": "Gatti's Pizza and MOD Pizza, are located in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of institution does Danny Watkins and 2010 Baylor Bears football team have in common?",
        "response": "University",
        "source": "hotpot_qa"
    },
    {
        "query": "In which season was Carmelo Anthony, an American professional basketball player traded to the New York Knicks?",
        "response": "2010–11 Denver Nuggets season",
        "source": "hotpot_qa"
    },
    {
        "query": "Luis Gianneo was teacher to what composer who died February 18, 2010?",
        "response": "Ariel Ramírez",
        "source": "hotpot_qa"
    },
    {
        "query": "Extinction stars which Australian model and actress?",
        "response": "Emma Booth",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Beth Taylor was the host of Hey Hey It's Saturday on a TV network of which nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Team Brunel finished second in the 2014–15 Volvo Ocean Race, skippered by Bouwe Bekking, and will also sail in the 2017–18 Volvo Ocean Race, the 13th edition of the round-the-world Volvo Ocean Race, it will start in Alicante, in which country?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "How many participants did the person who shot Adrian Pracon kill at a summer camp?",
        "response": "69",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that built the Southern Pacific 2706 went out of business in what year?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"Under the Silver Lake\" made his debut in what film?",
        "response": "Lions for Lambs",
        "source": "hotpot_qa"
    },
    {
        "query": "This boxer trained by Naazim Richardson won a gold medal in what event in 2007?",
        "response": "Pan Am Games",
        "source": "hotpot_qa"
    },
    {
        "query": "7 Day Sunday, is a British comedy radio talk show, who joined regular guest, Andy Zaltzman?",
        "response": "Sarah Millican",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of the 1994 film Krantiveer was born January 1, 1951?",
        "response": "Nana Patekar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant genus contain two to four species, Greyia or Calycanthus?",
        "response": "Calycanthus",
        "source": "hotpot_qa"
    },
    {
        "query": "What amusement and water park has the Alpine Bobsled roller coaster but is separate from the Six Flags brand?",
        "response": "Great Escape",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Death in Brunswick was born in New Zealand?",
        "response": "John Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "The current president of the University of Oklahoma approved the Oklahoma Housing Finance Agency's first trust indenture in what year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Jon Kortajarena has modeled for the fashion designer who launched his luxury brand in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor stars in both Spanisb drama 'Morrowbone' and American tv show 'Stranger Things'?",
        "response": "Charlie Heaton",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Freebairn appeared on the weeknight program that was on what Australian TV network?",
        "response": "Network Ten",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the sister company of Lynx Aviation that operated out of Denver, Colorado?",
        "response": "Frontier Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chamizal dispute was caused by a shift in which one of the principal rivers in the southwest United States and northern Mexico?",
        "response": "Rio Grande",
        "source": "hotpot_qa"
    },
    {
        "query": "What NBA team did the person who played forward on 2007–08 Duke Blue Devils men's basketball team play on?",
        "response": "Oklahoma City Thunder",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was best known for negotiating the agreement that placed a peanut butter candy manufactured by The Hershey Company in with Steven Spielberg's \"E.T. the Extra-Terrestrial\"?",
        "response": "John H. Dowd",
        "source": "hotpot_qa"
    },
    {
        "query": "In which animated film all characters are beans, Killer Bean Forever or Mai Mai Miracle?",
        "response": "Killer Bean Forever",
        "source": "hotpot_qa"
    },
    {
        "query": "WRAF airs a religious program hosted by which founder and president of In Touch Ministries?",
        "response": "Charles Stanley",
        "source": "hotpot_qa"
    },
    {
        "query": "Baz's Culture Clash was a television series presented by which \"50 Ways to Kill Your Mammy\" radio and tv personality?",
        "response": "Bazil Ashmawy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Khady Sylla and György Pálfi from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Basej-e Milli (National Movement) alternatively called Afghanistan Green Trend (Rawand-e Sabz-e Afghanistan) is a political party in Afghanistan created by former Afghan intelligence chief, Amrullah Saleh, a politician in Afghanistan who served as head of the National Directorate of Security from 2004 until his resignation in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Puffin Rock is an Irish children's television series that originally aired on RTÉjr in Ireland, and in the UK on Nick Jr. Too, (formerly Nick Jr. 2) is the British second channel of Nick Jr. available in the United Kingdom and in the Republic of Ireland, generally presenting popular Nick Jr. programming at other times of the day, it launched on which date? ",
        "response": "24 April 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Who drove the Force India VJM09 along with a Mexican racing driver \"Checo\"?",
        "response": "Nico Hülkenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What Union Occupied estate near Fort Craig overlooks the Potomac River ?",
        "response": "Arlington House",
        "source": "hotpot_qa"
    },
    {
        "query": "who is the younger brother of The episode guest stars of The Hard Easy ",
        "response": "Bill Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "Ole and Lena are central characters in jokes by which specific portion of  Americans, in the broad sense?",
        "response": "Scandinavian Americans",
        "source": "hotpot_qa"
    },
    {
        "query": "What plan, designed by Daniel Burnham, called for new construction throughout Cleveland?",
        "response": "1903 Group Plan",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the 2014 film Camp X-Ray, which starred a leading Twilight actress, debut?",
        "response": "Sundance Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "What band composed the song Steppin' in a Slide Zone?",
        "response": "The Moody Blues",
        "source": "hotpot_qa"
    },
    {
        "query": "Comet is a wooden roller coaster at Hersheypark built by a company that was established in what year?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rennae Stubbs and Carly Gullickson both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Lost Paradise, released in February 1990, is the debut album of which gothic metal band that formed in 1988?",
        "response": "Paradise Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "What private research university in New York City was Vinnie Yablonski enrolled in?",
        "response": "Fordham University",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Itea and Alocasia belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "What military award did the solider who the USS Basilone was named after recieve posthumously?",
        "response": "the Navy Cross",
        "source": "hotpot_qa"
    },
    {
        "query": "Ace Drummond was scripted by an American fighter ace in World War I who received what medal?",
        "response": "Medal of Honor",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Kim worked on the car that was part of what BMW project?",
        "response": "Project i",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Neil Young or Phil Collins?",
        "response": "Neil Percival Young",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Empire of the Sun or 3 Doors Down have more band members?",
        "response": "3 Doors Down",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has a larger population, Hays, Kansas or Ellis County, Kansas?",
        "response": "Ellis County, Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the japanese company who hired Camelia as a spokesmodel traditionally known for?",
        "response": "timepieces",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the worlds largest cricket stadium where John Wayne Hasting played?",
        "response": "Melbourne Cricket Ground",
        "source": "hotpot_qa"
    },
    {
        "query": "Which system is most likely to have impacted current computer technology, Atari or Comx-35?",
        "response": "Atari",
        "source": "hotpot_qa"
    },
    {
        "query": "Revolution will star which singer who is a member of Super Junior?",
        "response": "Choi Si-won",
        "source": "hotpot_qa"
    },
    {
        "query": "Hotride is the fifteenth single released by what music group from Braintree, Essex, that was formed in 1990?",
        "response": "The Prodigy",
        "source": "hotpot_qa"
    },
    {
        "query": "Yahya Al Bishri has designed garments for a King who passed away in which year ?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Cain-Sloan Co. was a department store that could be found in what Goodlettsville, Tennessee mall?",
        "response": "Rivergate Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the actor that played in \"Dawson's Creek\" and a 2000 American supernatural horror film directed by James Wong?",
        "response": "Kerr Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain peak is flanked by Manaslu towards the north, Momhil Sar or Ngadi Chuli?",
        "response": "Ngadi Chuli",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ixiolirion and Aster both flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The French Air Force aircraft engine series Hispano-Suiza V-12's last two models were used mainly around what war(s)?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the public high school at which Freddie James became the head coach located?",
        "response": "Oak Cliff area of Dallas",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dickens novel that tells the story of the French Doctor Manette was written at what home?",
        "response": "Tavistock House",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in \"The Godfather\" was once up for a part in the remake of Ben-Hur?",
        "response": "Marlon Brando",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2013 Spengler Cup were played at this Swiss ice hockey club's home, known as what?",
        "response": "Vaillant Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Transylvanian Hound and Pumi dog origin in from which country?",
        "response": "Hungary",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the offical language of the canton that is home to the Arulmiku Sivan Temple?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Australian Liberty Alliance launched in 2015 with the anti-Islam activist who is director of which organization as a keynote speaker?",
        "response": "Sharia Watch UK",
        "source": "hotpot_qa"
    },
    {
        "query": "What other notable role did the star actor from Jeremy perform? ",
        "response": "the voice of The Beast",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 Texas A&M football team was led by the former head coach of which team from 2007 to 2011?",
        "response": "University of Houston",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Langside involved a dispute between James VI and his sister, who was locked away in which location?",
        "response": "Loch Leven Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Like many Twins teams of its half-decade, the 1998 Minnesota Twins neither impressed nor contended, individual players had solid seasons, and which Hall of Fame designated hitter, nicknamed \"Molly\" and \"The Ignitor\", is an American former Major League Baseball (MLB) player and current manager of the Minnesota Twins, how many All-Star Game appearances did he have?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Urban Meyer do?",
        "response": "coach",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the woman whose former chief of staff was Rachel Noerdlinger born?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American physician co found Charles Horace Mayo",
        "response": "Augustus W. Stinchfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American director inspired a video game based his 1984 movie \"Dune\"?",
        "response": "David Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent were both The Ring and Shonen Jump published in?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "The Working Girls, released in which year, is a exploitation film written and directed by Stephanie Rothman and starring Cassandra Peterson,an American actress best known for her portrayal of the horror hostess character Elvira, Mistress of the Dark?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Which General was involved in the destruction of Frampol during the Bombing of Frampel in 1939 and who was born in 1895?",
        "response": "Wolfram Freiherr von Richthofen",
        "source": "hotpot_qa"
    },
    {
        "query": "David Wurmser served as special assistant at the State Department to a diplomat that was appointed  U.S. ambassador to the United Nations by what president?",
        "response": "George W. Bush",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played the male lead in a teen comedy about a high school nerd directed by Steve Rash? ",
        "response": "Patrick Dempsey",
        "source": "hotpot_qa"
    },
    {
        "query": "Who described the captain of the winners of the 1964-65 European Cup Winners Cup as the best defender he had ever played against ?",
        "response": "Pelé",
        "source": "hotpot_qa"
    },
    {
        "query": "Chinua Achebe and Walter Van Tilburg Clark are both what?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "John Joseph O'Neill was part of the 1937 Pulitzer-winning team along with which Jewish-Lithuanian-American journalist?",
        "response": "William Leonard Laurence",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Almost Sunrise or 4 ?",
        "response": "4",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ali G series star is also an English actor, comedian, screenwriter, and producer?",
        "response": "Sacha Baron Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "What industrial metal band had a single from their 1992 album called \"Just One Fix\" which featured samples from the 1986 British biopic \"Sid and Nancy\"? ",
        "response": "Ministry",
        "source": "hotpot_qa"
    },
    {
        "query": "What edition of tennis' US Open was the 2017 US Open when Petra Kvitova was a quarterfinalist?",
        "response": "137th",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Shin Hyun-joon in the successful South Korean comey sequel?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Tintin and I and Cancer, are films of which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Gerald McRaney actor in Get Low born?",
        "response": "August 19, 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Who scientifically described the animal that shares its name with Marius Tucă's city of birth?",
        "response": "Johann Christian Daniel von Schreber",
        "source": "hotpot_qa"
    },
    {
        "query": "The Really Nasty Horse Racing Game and Inkan aarre, is which specific form of entertainment, and genre?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "What producer who died in 1978 developed American television detective show Mannix?",
        "response": "Bruce Geller",
        "source": "hotpot_qa"
    },
    {
        "query": "Which National Park is bigger Tablas de Daimiel National Park or Guadarrama National Park ?",
        "response": "Guadarrama National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the theatre established where Leonid Kmit was later invited to join in 1936?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "The 15th annual 2011 Webby Awards were held on June 13, 2011 in New York City, the Webby for lifetime achievement was awarded to which former American Motorola executive, and engineer?",
        "response": "Martin Cooper",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the Gainsborough station group and the Gainsborough Central railway station located?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Korean actor struggled to emerge from under the shadow of his older sister,starred in a modern take on Edmond Rostand's 1897 play \"Cyrano de Bergerac\"?",
        "response": "Uhm Tae-woong",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Spanish footballer who plays as a right back for the team that was founded in 1919 and plays home matches at Estadio Nueva Condomina born?",
        "response": "born 18 January 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Doheny ran in the Republican primary for New York's 21st congressional district, a congressional district for the United States House of Representatives that is currently represented by who?",
        "response": "Republican Elise Stefanik",
        "source": "hotpot_qa"
    },
    {
        "query": "What debut studio album by American rapper ASAP Rocky released on January 15, 2013, that had a third single peaked at #80 on the Billboard Hot 100?",
        "response": "LONG.LIVE.A$AP",
        "source": "hotpot_qa"
    },
    {
        "query": "What chord also known as fifth chord is prominent in Asian Kung-Fu Generation songs?",
        "response": "power chord",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Gale co-wrote famously a movie starring Michael J. Fox was which character?",
        "response": "Marty McFly",
        "source": "hotpot_qa"
    },
    {
        "query": "Diego García-Borreguero has completed fellowships in sleep medicine and sleep research at an agency founded when ?",
        "response": "in the late 1870s",
        "source": "hotpot_qa"
    },
    {
        "query": "Rips the Covers Off was an album by the hard rock band formed in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Ferdinand Johann Adam von Pernau was born in a castle now lying where ?",
        "response": "Bavaria, Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manufactures small arms ammunition for the British armed forces?",
        "response": "ROF Radway Green",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pardoner's Tale is a tale by an author known as what?",
        "response": "the Father of English literature",
        "source": "hotpot_qa"
    },
    {
        "query": "Are James Glickenhaus and Dallas M. Fitzgerald both assocaited with silent films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the lowest road in Great Britain, that crosses through the village and civil parish in the Fens of England?",
        "response": "A1101 road",
        "source": "hotpot_qa"
    },
    {
        "query": " IJscolf was a sport popular in coastal regions where?",
        "response": "western Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "National Sports Stadium is a multi-purpose stadium in Ulaanbaatar, Mongolia, The Naadam festival, which celebrates Mongolian independence, is held there every when? ",
        "response": "July",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1948–49 New York Knicks season was the third season for the team in the Basketball Association of America (BAA), which later became the National Basketball Association (NBA),New York qualified for the playoffs, and defeated which American Basketball League (1944–47) team, and later, a Basketball Association of America (1947–49), and (beginning in 1949, following the BAA's absorption of the National Basketball League) a National Basketball Association team based in Baltimore?  ",
        "response": "Baltimore Bullets",
        "source": "hotpot_qa"
    },
    {
        "query": "What company developed the game engine that Brother in Arms uses as its technology base?",
        "response": "Epic Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What Filipino singer, who rose to popularity on YouTube, released an EP in May 2008 under the the name Charice?",
        "response": "Jake Zyrus",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Josepha Buell Hale (October 24, 1788 – April 30, 1879) was an American writer and an influential editor, she's the author of the nursery rhyme \"Mary Had a Little Lamb\", the English language nursery rhyme of nineteenth-century of which nationality origin?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What suburb of Salisbury has a population of 98,861 people?",
        "response": "City of Tea Tree Gully",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Robert De Niro's Waiting...\" is a song by a group formed in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Katie sagona is known as what kind of actor because she was a child acting on stage or in motion pictures or television?",
        "response": "child actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Janelle Monae released a song on July 30, 2014, featuring which backup dancer from Destiny's Child?",
        "response": "Solange Piaget Knowles",
        "source": "hotpot_qa"
    },
    {
        "query": "What defines Downers Grove as a thriller?",
        "response": "by the moods they elicit",
        "source": "hotpot_qa"
    },
    {
        "query": "What stadium is named after Darrell Royal, past coach of the 1976 Texas Longhorns football team?",
        "response": "Darrell K Royal – Texas Memorial Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "In between  Grant Nicholas and Terry Glaze, who was raised in Texas?",
        "response": "Terrence Lee Glaze",
        "source": "hotpot_qa"
    },
    {
        "query": "Republic Airways Holdings, Inc. is an American airline holding corporation based in Indianapolis, Indiana, that owns which regional airline subsidiary of Republic Airways Holdings that operates service as American Eagle, Delta Connection, and United Express using a fleet of Embraer 170 and Embraer 175 regional jets?",
        "response": "Republic Airline",
        "source": "hotpot_qa"
    },
    {
        "query": "Svengali is a American pre-Code supernatural drama/horror film, released in which year, produced and distributed by Warner Bros, it stars John Barrymore, he was an American actor on stage, screen and radio, and a member of the Drew and Barrymore theatrical families?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hoch Conservatory had the teacher on-staff who was the first to publicly perform any work by which composer?",
        "response": "Brahms",
        "source": "hotpot_qa"
    },
    {
        "query": "\"That's Just About Right\" is a song recorded by a band founded in which year ?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Ernest Augustus Anderson  was installed in Hay, New South Wales as the second Anglican Bishop of the Diocese of Riverina, Hay is a town in the western Riverina region of south western New South Wales, in which country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Horrorween starred which actor and stuntman?",
        "response": "Thomas Vincent Savini",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is one of the stores inside Concord Mall based?",
        "response": "Oklahoma City, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Black and Tans and Guerrilla Days in Ireland are both associated with which nationality?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Dolan v. City of Tigard and Gravel v. United States heard in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does South Carolina National Bank of Charleston and Andrew Jackson have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What starring role did the actor and singer play in a 2015 musical based on a 2004 biography of Alexander Hamilton?",
        "response": "Aaron Burr",
        "source": "hotpot_qa"
    },
    {
        "query": " NCAA College Football 2K2: Road to the Rose Bowl has the quarterback for which NFL team on the cover?",
        "response": "New Orleans Saints",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Australian Stumpy Tail Cattle Dog or the Borzoi most similar to a greyhound in appearance?",
        "response": "The Borzoi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the stars of the 2008 South Korean movie that was later remade as Hindi movie entitled \"Murder 2\" in 2011?",
        "response": "Kim Yoon-seok and Ha Jung-woo",
        "source": "hotpot_qa"
    },
    {
        "query": "Mina and the count animated series appeared on two animation show cases Cartoon networks what a Cartoon. Who was the second Animation showcase which appeared on Nickelodeon cable channel ?",
        "response": "Oh Yeah! Cartoons",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the band whose second album was \"Origin of Symmetry\" formed?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "When was a ballet company founded who's most popular performance is a two-act ballet choreographed by Marius Petipa and Lev Ivanov?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Lawson or American Music Club?",
        "response": "Lawson",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of the 2004 book How to Talk to a Liberal (If You Must) was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Big Country and IAMX both dance bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Looking for... the best is an album by the man who set a Guinness World Record as the most watched man on TV, and was released in Germany when?",
        "response": "October 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day aired the last episode of a children's Indian television series starring the Indian actor Keval Vora on SAB TV?",
        "response": "4 November 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film parodied by Enteng the Dragon?",
        "response": "Robert Clouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary came first, 10 Questions for the Dalai Lama or Bougainville – Our Island Our Fight?",
        "response": "Bougainville – Our Island Our Fight",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had movies made in both English and French, Nicholas Hytner or Costa-Gavras?",
        "response": "Costa-Gavras",
        "source": "hotpot_qa"
    },
    {
        "query": "Lexie Dean Robertson's work was featured in a magazine owned by who?",
        "response": "Hearst Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Rimo I and Passu Sar are both part of which mountain range?",
        "response": "Karakoram mountain range",
        "source": "hotpot_qa"
    },
    {
        "query": "Women on Web sends medicine by mail that are taken by what?",
        "response": "mouth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was founded earlier, The Week or New Scientist?",
        "response": "New Scientist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Tommy Lee Jones and Todd Haynes actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American found footage disaster film which starred Alycia Debnam-Carey?",
        "response": "Steven Quale",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization does Capture of Stuff Redoubt and 36th have in common?",
        "response": "Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Helenium and Orychophragmus both annuals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What American real estate developer owns the Encore hotel and casino in Las Vegas?",
        "response": "Steve Wynn",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Basil Bunting and Jack Kerouac both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Trappist Abbey of Achel produces and sells what as an \"Authentic Trappist Product\"?",
        "response": "Trappist beer",
        "source": "hotpot_qa"
    },
    {
        "query": "On which channel did a television series air in 2015 that starred the main vocalist of the South Korean girl group Apink?",
        "response": "KBS2",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of Tumbleweed was also one of the most decorated American combat soldiers of World War II?",
        "response": "Audie Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "Though usually directing films, who recently starred in the film Swades?",
        "response": "Lekh Tandon",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Wilkes-Barre/Scranton International Airport and Long Island MacArthur Airport, which airport is owned by a higher government?",
        "response": "Wilkes-Barre/Scranton International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played Lewis in a 2012 American romantic comedy film directed by Gabriele Muccino?",
        "response": "Noah Lomax",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Jerzy Kawalerowicz and Richard Marquand both from Wales?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the  shipbuilding company which  MS Marina was constructed at based in ",
        "response": "Trieste, Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Barkha Sharma is an Indian fashion designer, in 2010, the duo styled who, which  is an Indian classical musician of Hindustani classical music, he plays santoor and is also a vocalist?",
        "response": "Rahul Sharma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company was founded by the designer of Risk Godstorm ?",
        "response": "Lone Shark Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Californian freestyle motocross racer is featured on SRH Presents: Supporting Radical Habits?",
        "response": "Jeremy Lusk",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the voice of the character who owned a left-handed store in the \"When Flanders Failed\" episode of \"The Simpsons\"?",
        "response": "Harry Shearer",
        "source": "hotpot_qa"
    },
    {
        "query": "In what administrative category are the cities of Beitun, Xinjiang and Wafangdian?",
        "response": "county-level",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the boyfriend of Thelma Lou in the series with Jim Nabors?",
        "response": "Barney Fife",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born last, Dave Peverett or Jang Hyun-seung?",
        "response": "Jang Hyun-seung",
        "source": "hotpot_qa"
    },
    {
        "query": "In the genre of Kanniyin Kaddhali, characters usually appear what? ",
        "response": "stereotyped.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sports is Alex O'Brien and Marc Rosset related to ?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who originally hosted the Nickelodeon show that Bill Long was credited in?",
        "response": "Steve Burns",
        "source": "hotpot_qa"
    },
    {
        "query": "Blanco was used in what organization of 52 states of the British Empire to clean equipment?",
        "response": "Commonwealth of Nations",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people live in the county seat where the school superintendent is John A. Provost?",
        "response": "28,549",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of Italian Gaetano Donizetti or Czech Bedřich Smetana, which opera composer lived and worked earlier?",
        "response": "Domenico Gaetano Maria Donizetti",
        "source": "hotpot_qa"
    },
    {
        "query": "The 'Taj Mahal' represents the finest and most sophisticated example of Mughal architecture, an architectural style developed by who, in the 16th, 17th and 18th centuries throughout the ever-changing extent of their empire in Medieval India?",
        "response": "Mughals",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Indians were killed in the massacre that \"kyáiyótokan\" was a survivor of?",
        "response": "About 200",
        "source": "hotpot_qa"
    },
    {
        "query": "The fourth Baron Derwent served in the Conservative administration of which British statesman of the Conservative Party who served as Prime Minister from October 1963 to October 1964?",
        "response": "Sir Alec Douglas-Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ernst Toller and Patricia Highsmith both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monastery of the Transfiguration, Kinaliada and Süreyya Opera House both Greek Orthodox monasteries? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Forrest Edwin Behm (July 31, 1919 – June 29, 2015) was an American football player, he played college football for the Nebraska Cornhuskers (often abbreviated to Huskers) is the name given to the intercollegiate athletic teams of which organization?",
        "response": "University of Nebraska–Lincoln",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital city of the country, bordred by the Atlantic ocean and Zambia, and where the Phyllogomphus selysi species of dragonfly can be found?",
        "response": "Luanda",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the drummer on the Rhino Bucket album \"PAIN\" born?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "which British technology news and opinion website didMike Magee departed from? ",
        "response": "The Register",
        "source": "hotpot_qa"
    },
    {
        "query": "How are Ceephax Acid Crew  and Squarepusher's music similar?",
        "response": "drum and bass electronic musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the calibre of the controversial rifle invented by Sir Charles Henry Augustus Frederick Lockhart Ross?",
        "response": ".303",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the other decathletes that Dan & Dave was meant to generate excitement and support for other than the decathlete native of Montana?",
        "response": "Dan O'Brien",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the winner of the 2007 Masters of Formula 3?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Kerry Condon is the youngest Royal Shakespeare Company actress ever to play a character who is whose daughter?",
        "response": "Polonius",
        "source": "hotpot_qa"
    },
    {
        "query": "P. J. O'Rourke and N. Scott Momaday both changed history and earned many awards and degrees. Who had more degrees than the other, P.J. O",
        "response": "N. Scott Momaday",
        "source": "hotpot_qa"
    },
    {
        "query": "The Haverhill Historical Society Historic District is located in what county?",
        "response": "Essex County",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Doñana National Park in Andalusia, southern Spain or Garajonay National Park in La Gomera, Canary Islands in Spain larger?",
        "response": "Doñana National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, In These Times or Goldmine, is politcally driven?",
        "response": "In These Times",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of this retired professional footballer who was named as man of the match at 2001 Intercontinental Cup? ",
        "response": "Ghanaian",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the bands Foje and Evermore both come out of Feilding, New Zealand?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the last monarch under which Robert Waterton was a trusted servant of the House of Lancaster born?",
        "response": "1421",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Republican has represented the district in which Wilkins Township, Allegheny Count, Pennsylvania resides?",
        "response": "Tim Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "Western Auto Supply company was started by a man who later founded this not-for-profit university?",
        "response": "Pepperdine University",
        "source": "hotpot_qa"
    },
    {
        "query": "James Leal Greenleaf worked on a monument located where? ",
        "response": "National Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a longer middle name, Isabel Colegate or Peter Benchley?",
        "response": "Peter Bradford Benchley",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Enblish artist who released her second studio album Fall to Grace in 2012, born?",
        "response": "21 July 1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize did the man who used the ideas of Lars Onsager in 1957 to describe the magnetic phase diagram of type-II superconductors in 2003?",
        "response": "Nobel Prize in Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress in the Charitraheen 1974 Bollywood drama film has also received two National Film Awards and two Filmfare Awards?",
        "response": "Sharmila Tagore",
        "source": "hotpot_qa"
    },
    {
        "query": "The Logan & Southern Subdivision is a railroad line owned by CSX Transportation in the U.S. State of West Virginia, it's a state located in which region of the Southern United States?",
        "response": "Appalachian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game show hosted by Mike O'Malley had celebrity guest episodes starring the cast of Welcome Freshmen?",
        "response": "Get the Picture",
        "source": "hotpot_qa"
    },
    {
        "query": "Maurice Bénichou is a French actor, one of his best known roles, includes a collaborations with director Michael Haneke, in which 2005 French psychological thriller written and directed  by Haneke?",
        "response": "Caché",
        "source": "hotpot_qa"
    },
    {
        "query": " Liz Rose co-wrote the Taylor Swift song that was produced by whom?",
        "response": "Nathan Chapman",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the starting city of the concert tour for Taylor Swift's studio album that followed her album \"Speak Now\"?",
        "response": "Omaha, Nebraska",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Naval Station Bremerton located?",
        "response": "Washington state",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is situated in a more populous region? Petersburg James A. Johnson Airport or Lehigh Valley International Airport?",
        "response": "Lehigh Valley International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both University of Cape Town and University of Patras in the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jolo, West Virginia is the home of the snake handling churches of what denomination?",
        "response": "Pentecostal Holiness",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the Member who introduced the Marriage Act 1994 (c. 34)?",
        "response": "8 March 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band released an album first, Evanescence or Arcane Roots?",
        "response": "Evanescence",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the miles of road which Kirkby la Thorpe village is near the start of ",
        "response": "62 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Pearl Jam's studio album preceding Riot Act released?",
        "response": "May 16, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Sonam Kapoor (] ; born 9 June 1985) is an Indian actress who appears in Bollywood films and starring in \"I Hate Luv Stories\" an Indian romantic comedy appeared in what magazine based on her income and popularity?",
        "response": "\"Forbes India\"'s Celebrity 100",
        "source": "hotpot_qa"
    },
    {
        "query": "Kirk Douglas starred in the 1955 movie The Indian Fighter, after his debut in The Strange Love of Martha Ivers in what year?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What United States military base adjacent to Honolulu, Hawaii is host two of United States Pacific Command subordinate Service components?",
        "response": "Joint Base Pearl Harbor–Hickam",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film starring a South Korean singer-songwriter, actor and music producer born in June 1982 released?",
        "response": "15 August 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Who s an American engineer and politician who has been the United States Representative for Kentucky's 4th congressional district that defeated the 63rd District, representative of Kenton County?",
        "response": "Thomas Harold Massie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in \"Bob's Burgers\" and hosted the US version of \"The Planet's Funniest Animals\" from 2005 to 2008?",
        "response": "Keegan-Michael Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Pedro Mascarenhas was the first to explore the island atoll that comprises what landform?",
        "response": "Chagos Archipelago",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes were in the South Korean television series in which Ryu Hye-young played Bo-ra?",
        "response": "20",
        "source": "hotpot_qa"
    },
    {
        "query": "The painting The Quarrel of Oberon and Titania depicts a scene from a Shakespeare play that portrays the events surrounding the marriage of Theseus to who?",
        "response": "Hippolyta",
        "source": "hotpot_qa"
    },
    {
        "query": "Julia Lezhneva studied with the People's Artist of the USSR, who was of what range?",
        "response": "mezzo-soprano",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Dacrydium or Tecophilaea?",
        "response": "Dacrydium",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Reunions magazine and Autograph Collector Magazine both US publications ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, \"VHS or Beta\" or \"Knuckle Puck,\" is originally from a city that is further west?",
        "response": "Knuckle Puck",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote his ninth novel based on a brittish police officer with scotland yard",
        "response": "Charles Dickens",
        "source": "hotpot_qa"
    },
    {
        "query": "Diane English is best known for creating the television show \"Murphy Brown\" and writing and directing the 2008 feature film, \"The Women\", an updated version of the George Cukor-directed 1939 film of the same name based on a 1936 play by what author?",
        "response": "Clare Boothe Luce",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the historical name of the acid that dissolves phenazine?",
        "response": "oil of vitriol",
        "source": "hotpot_qa"
    },
    {
        "query": "Kiki Preston was the alleged mother of a child born out of wedlock with a prince born in which year ?",
        "response": "1902",
        "source": "hotpot_qa"
    },
    {
        "query": "In what nationality's folklore is the cat mentioned in Live Fast, Love Hard, Die Young?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to his role as Francis Gary Powers in Bridges of Spies, Austin Stowell also played in which movie in 2014?",
        "response": "\"Whiplash\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was made in the 20th century, Let's Get Lost or Red State?",
        "response": "Let's Get Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "What Institute Founded in 1969 and with approximately 130 campuses in 38 states of the United States had an American actor sidelined his acting career and became an education supervisor?",
        "response": "ITT Technical Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "What rocket was the world's first long-range guided ballistic missile, and upon which the fictional spaceship Orbit Jet in the 1954 TV series \"Rocky Jones, Space Ranger\" was based on ?",
        "response": "V-2 rocket",
        "source": "hotpot_qa"
    },
    {
        "query": "What man who was the husband of a noblewoman during the reign of Henry VIII of England wished to marry the Queen of England from 1533 to 1536?",
        "response": "Henry Percy",
        "source": "hotpot_qa"
    },
    {
        "query": "Nico di Biase plays for the soccer league that has how many teams?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the 16th-century mosque demolished which occurred a couple of months after \"Ram ke Naam\" was released?",
        "response": "6 December 1992",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"The Hundred and One Dalmatians\" author also wrote a comedy that premiered in London in 1938?",
        "response": "Dodie Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "OK Calculator alludes to the album of what English rock band from Abingdon formed in 1985",
        "response": "Radiohead",
        "source": "hotpot_qa"
    },
    {
        "query": "When Demetrius Jackson was drafted, who had the No.1 Pick?",
        "response": "Philadelphia 76ers",
        "source": "hotpot_qa"
    },
    {
        "query": "Mahatma Gandhi led India to independence through nonviolent civil disobedience which was sometimes referred to as what?",
        "response": "obstructive program",
        "source": "hotpot_qa"
    },
    {
        "query": "Whip It was released by a film distribution company that specializes in the distribution of independent and British films as well as what kind of films?",
        "response": "dramedy and horror",
        "source": "hotpot_qa"
    },
    {
        "query": "william J. Monahan's second produced screenplay was a remake of what film?",
        "response": "\"Infernal Affairs\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Collateral starred the American actor who won a BAFTA Award for which 2004 biographical film?",
        "response": "Ray",
        "source": "hotpot_qa"
    },
    {
        "query": "While Tâb is a board game, what type of game is Time's Up!?",
        "response": "charades-based party game",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1999 Louisville Cardinals football team were led by the college coach who now leads what team?",
        "response": "Kentucky State University",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mazda Familia, also marketed prominently as the Mazda 323 and Mazda Protegé, was a small family car that was manufactured by Mazda between 1963 and 2003, the Familia line was replaced by the Mazda3/Axela for 2004, a compact car manufactured in which country, by Mazda?",
        "response": "Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "How many disciplines are combined in the degree that Hector Janse van Rensburg graduated from the University of York with?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Kennett High School serves the students of a town in what New Hampshire county?",
        "response": "Carroll",
        "source": "hotpot_qa"
    },
    {
        "query": "The Magne Charge system was produced by a General Motors subsidiary based in what Indiana town?",
        "response": "Kokomo",
        "source": "hotpot_qa"
    },
    {
        "query": "Emmett Brown rides in a sports car that features what type of doors?",
        "response": "gull-wing doors",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this city, which is also known as \"The City of the Crosses\" and is located 60 miles (97 km) east of Luna City, New Mexico, United States?",
        "response": "Las Cruces",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Steve Hogarth or Donnie Munro?",
        "response": "Donnie Munro",
        "source": "hotpot_qa"
    },
    {
        "query": "Tumbledown is a 2015 American romantic comedy film directed by Sean Mewshaw, it stars Dianna Elise Agron, an American actress, singer, and dancer, in what year,  Agron made her television debut as Jessica Grant, on which Tumbledown is a 2015 American romantic comedy film directed by Sean Mewshaw, it stars Dianna Elise Agron, an American actress, singer, and dancer, in 2006, Agron made her television debut as who, on CSI: NY?",
        "response": "Jessica Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the earliest published D-I-Y \"home movies\" of New York punk's birth filmed by Amos Poe and Ivan Kral, Koyaanisqatsi or The Blank Generation?",
        "response": "The Blank Generation",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the county seat of the county that incldes Four JG's Orchards & Vineyards?",
        "response": "Freehold Borough",
        "source": "hotpot_qa"
    },
    {
        "query": "How many stores does the main feature of the Oaklands Park suburb contain?",
        "response": "341",
        "source": "hotpot_qa"
    },
    {
        "query": "Units in the City is the debut and only studio album by which American hip hop recording artist, an American rapper from Atlanta, Georgia, known professionally as who?",
        "response": "Shawty Lo",
        "source": "hotpot_qa"
    },
    {
        "query": "What does KO Magazine and Analog Science Fiction and Fact have in common?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle lasted longer, the Battle of Guam, or the Battle of Saipan?",
        "response": "The Battle of Saipan",
        "source": "hotpot_qa"
    },
    {
        "query": "Longton Bridge was a railway station on the West Lancashire Railway in England, it served the village of Longton, and civil parish in the west of the borough of South Ribble, Lancashire, in which country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was drafted ninth overall in the 66th NFL draft?",
        "response": "Koren Lynard Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the astronaut that inspired the nickname of \"Spacetown\" for Derry, New Hampshire?",
        "response": "Derry is the birthplace of Alan Shepard",
        "source": "hotpot_qa"
    },
    {
        "query": "Foxcatcher is a 2014 American true crime sports drama film, the film stars Steve Carell, Mark Ruffalo, and Channing Matthew Tatum is an American actor, born when?",
        "response": "April 26, 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 MTV Video Music Awards was the platform for the premiere of the video for a song off of what singer's upcoming sixth album entitled Reputation?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "What heroic qualities are anti-hero, Seth Gecko, lacking?",
        "response": "idealism, courage, or morality",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film produced by Blinding Edge Pictures starred actors Joaquin Phoenix, Adrien Brody, and Bryce Dallas Howard?",
        "response": "The Village",
        "source": "hotpot_qa"
    },
    {
        "query": "Warren Truss continued as Deputy Prime Minister, until he retired in 2016 and was replaced by a politician born in which year ?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Padmarajan and Wanda Jakubowska have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Aunt Bam's Place is a 2011 American musical play created, written, produced, and directed by Tyler Perry, an American actor, comedian, filmmaker, writer, and songwriter, specializing in which genre?",
        "response": "gospel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Broadway musical with music by Barbara Anselmi was directed by Dennis Courtney in 2016?",
        "response": "It Shoulda Been You",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Liberian President born who tried to eliminate Roosevelt Johnson?",
        "response": "28 January 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Sidney Sheldon or Stan Lee hold more job titles?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Magnificent Bodyguards is a Hong Kong martial arts action film, released in which year, starring Jackie Chan, a Hong Kong martial artist, actor, film director, producer, stuntman, and singer?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Who began their career earlier, Jonathan Lethem or George S. Kaufman?",
        "response": "George Simon Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has written more novels, Zora Neale Hurston or Katherine Kurtz?",
        "response": "Katherine Irene Kurtz",
        "source": "hotpot_qa"
    },
    {
        "query": "Simone Simeri plays for the Italian team from what state?",
        "response": "Piedmont",
        "source": "hotpot_qa"
    },
    {
        "query": "Narakasuravadham is an Aattakatha authored by a maharajah that was born in what year?",
        "response": "1724",
        "source": "hotpot_qa"
    },
    {
        "query": "Conkey's Tavern is where Daniel Shays met with followers and plotted what rebellion?",
        "response": "Shays' Rebellion",
        "source": "hotpot_qa"
    },
    {
        "query": "What do the song \"What Would I Do If I Could Feel\" and Nipsey Russell have in common?",
        "response": "The Wiz",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Sun Tiantian and Tom Gullikson have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Schuylkill Canal and Allegheny Portage Railroad both railways?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the headquarters of the  Chinese investment holding company  who developed WeChat ",
        "response": "Nanshan District, Shenzhen.",
        "source": "hotpot_qa"
    },
    {
        "query": "Piero Mingoia played as midfielder for the ffootball club, established in 1948, that has a local rivalry with what other team?",
        "response": "St Albans City",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Scotch Collie and Burgos Pointer which one is a breed of dog native to Spain?",
        "response": "Burgos Pointer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the Sawamura Award in 2007 and is a starting pitcher for the Los Angeles Dodgers?",
        "response": "Yu Darvish",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the leader of  McCoys of Kentucky died under who's leadrship The Hatfield–McCoy feud occured?",
        "response": "March 28, 1914)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper released the album Big Fish Theory featuring a number of styles of music including Detroit techno?",
        "response": "Vince Staples",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the is the fourth studio album by Mexican pop-singer married to Governor of Chiapas, Manuel Velasco Coello?",
        "response": "Baby Blue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the woman enslaved by Thoams Jefferson who is the suject of the James Ivory film Jefferson in Pairs?",
        "response": "Sally Hemings",
        "source": "hotpot_qa"
    },
    {
        "query": " What is the title of the memoir written by the honoree of the Black and White Ball?",
        "response": "Personal History",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man owns the company that owns Fox Sports Ohio?",
        "response": "Rupert Murdoch",
        "source": "hotpot_qa"
    },
    {
        "query": "He was born into an ecclesiastical family on 28 April 1912, educated at Shrewsbury and Christ Church, Oxford and ordained in 1937, he was a curate at which Church of England parish church of the city of Lancaster, Lancashire, England, formally the Priory Church of St Mary?",
        "response": "Lancaster Priory",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character does Karin Konoval play in the 2014 movie Dawn of the Planet of the Apes? ",
        "response": "Maurice the Orangutan",
        "source": "hotpot_qa"
    },
    {
        "query": "Terrell Lamont Strayhorn is best known for his successful collaborations with a composer born in which year ?",
        "response": "1899",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Michael Powell, or Ralph Bakshi?",
        "response": "Michael Latham Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the person who co-wrote the winning Russian entry for the 2008 Eurovision Song Contest with Jim Beanz?",
        "response": "Dima Bilan",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both the Foals and Escanaba Firing Line formed in 2002?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress played the role of Hillary Winston on \"The Royal Family\" at the age of 4 and was also in the Tina in the Sky with Diamonds episode of Glee?",
        "response": "Naya Rivera",
        "source": "hotpot_qa"
    },
    {
        "query": "Some Things I Know is the second album from a singer born in what year?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one, Purshia or Maihuenia, is a small genus of 5-8 species of flowering plants in the family Rosaceae?",
        "response": "Purshia",
        "source": "hotpot_qa"
    },
    {
        "query": "How long does the lower level degree program, offered at Helene Fuld College of Nursing, typically last?",
        "response": "two years",
        "source": "hotpot_qa"
    },
    {
        "query": "From when the Center for the Arts is operating in which the Hudson Museum is located?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Which female actress appeared in both \"The Five(ish) Doctors Reboot\" and \"Doctor Who\"?",
        "response": "Jenna Coleman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  home rule-class city in Oldham County is  D. W. Griffith House  a historic building in",
        "response": "La Grange",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of the music for the film \"Andaru Dongale Dorikite\" won a Filmfare Award for his work on what film?",
        "response": "\"Satyam\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Republican senator held the Nevada seat from 2001 to 2011, succeeding Richard Bryan?",
        "response": "John Ensign",
        "source": "hotpot_qa"
    },
    {
        "query": "Buck Wolf is a former fashion editor from what weekly celebrity magazine?",
        "response": "Us Weekly",
        "source": "hotpot_qa"
    },
    {
        "query": "The band Salem had a song featured in a 2012 film directed by whom?",
        "response": "Derek Cianfrance",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Dallas team is a member of the Nation Football Conference located?",
        "response": "Dallas metropolitan area",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the county in which Kentucky's 20th-largest city is located founded?",
        "response": "1822",
        "source": "hotpot_qa"
    },
    {
        "query": "What computer accessory was the result of the work on human-computer interaction by the creator of hypertext?  ",
        "response": "mouse",
        "source": "hotpot_qa"
    },
    {
        "query": "What year saw the founding of the baseball team where Hal McRae played from 1973-87?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American business executive and the eighth Secretary of Defense, who surrounded himself with the group of experts called Whiz Kids?",
        "response": "Robert McNamara",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Film is newer,  Follow Me, Boys! or Remember the Titans ?",
        "response": "Remember the Titans is a 2000 American sports film",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry does Walt Aldridge and Adam Levine work in?",
        "response": "record producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is farther north in New York, One57 or 45 Broad Street?",
        "response": "One57",
        "source": "hotpot_qa"
    },
    {
        "query": "William John Macquorn Rankine, was a Scottish mechanical engineer who also contributed to civil engineering, physics and mathematics, who was a founding contributor to the science of thermodynamics, which German physicist and mathematician is this?",
        "response": "Rudolf Julius Emanuel Clausius",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airline, that flew only with foreign models, is the largest airline of the Russian Federation?",
        "response": "Aeroflot",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality where Terry Disley and Billy Bragg?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Julie Wagner or Julia Roberts?",
        "response": "Julie Anne Wagner",
        "source": "hotpot_qa"
    },
    {
        "query": "What band released a studio album in 1974 and a compilation album in 1993?",
        "response": "Judas Priest",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Shock of the Lightning\" is a song by English rock band Oasis and is the fourth track from which seventh and final studio album by English rock band Oasis, released on 6 October 2008 by Big Brother Records?",
        "response": "Dig Out Your Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "Name an organization to which Gene Autry's collaborator on \"Here Comes Santa Clause\" belongs. ",
        "response": "ASCAP",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: Cemu is a Wii U video game console emulator for Microsoft Windows-based personal computers, typically, the emulator updates once every two to four weeks, with supporters of which membership platform that provides business tools for creators to run a subscription content service, as well as ways for artists to build relationships and provide exclusive experiences to their subscribers, or \"patrons\", were receiving updates a week earlier than the public release?",
        "response": "Patreon",
        "source": "hotpot_qa"
    },
    {
        "query": "Carver Glacier is on the north slope of a complex volcano with three peaks each exceeding how many feet in elevation?",
        "response": "10000",
        "source": "hotpot_qa"
    },
    {
        "query": "Is MODE or $pread made for sex workers?",
        "response": "$pread",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American banjo player was featured in the album \"Once in a Very Blue Moon\"",
        "response": "Béla Fleck",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the writer of the song \"I Knew the Bride\"?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Who oversees operations at a hotel and casino situated on the southern end of the Las Vegas Strip?",
        "response": "Corey Sanders",
        "source": "hotpot_qa"
    },
    {
        "query": "What English actor starred in the Stephen Poliakoff play Shout Across the River in London in 1978?",
        "response": "David Threlfall",
        "source": "hotpot_qa"
    },
    {
        "query": " U.S. Route 60 in Oklahoma runs through a city that is the county seat of what county?",
        "response": "Osage County",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the band formed in 2015 by JYP Entertainment through the reality show \"Sixteen\". How many tracks are on the reissue of their third album?",
        "response": "13",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Edward Teller also starred in a 1999 science fiction film loosely based on the video game series named what",
        "response": "Wing Commander",
        "source": "hotpot_qa"
    },
    {
        "query": "Brazilian Dogo and Cirneco dell'Etna are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Physocarpus and Rudbeckia both genus of flowering plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the period instrument ensemble that was formed in the 1950s by the conductor with whom Elisabeth Kulman recorded Beethoven's \"Missa solemnis\"?",
        "response": "Concentus Musicus Wien",
        "source": "hotpot_qa"
    },
    {
        "query": "Robbie Tucker plays in what series that follows a group of friends who run an Irish bar?",
        "response": "It's Always Sunny in Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Succession to the Danish throne restricts the throne to who?",
        "response": "Alexandrine of Mecklenburg-Schwerin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is shared by the official U.S. state song \"The Song of Iowa\" and the German Christmas song \"O Tannenbaum\"?",
        "response": "tune",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was the Symphony for Classical Orchestra in B-flat major completed by Harold Shapero who undoubtedly derived a fair amount from the American composer, teacher and writer known as the 'Dean of American Composers'?",
        "response": "Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team, known along with Linfield as one of Belfast's \"Big Two,\" did Walter McMillen play for?",
        "response": "Glentoran Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Scott Derrickson and Victor Hanbury both directors and producers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is located in Tenerife (Canary Islands, Spain) Teide National Park or Cabañeros National Park?",
        "response": "Teide National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Olaf Stapledon and Maurice Maeterlinck, are British?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Adriano Zumbo was known for his fairytale house on an Australian reality competitive cooking game show, that is produced by Shine Australia, and screens where?",
        "response": "Network Ten",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Gray worked as a bassist alongside Andrew Ridgeley and which other founding member of Wham!?",
        "response": "George Michael",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the sister of Dorothy Gish known as?",
        "response": "First Lady of American Cinema",
        "source": "hotpot_qa"
    },
    {
        "query": "By 1938, Harry McEvoy had established a large factory in Greater Manchester, what is the population of that city?",
        "response": "37,500",
        "source": "hotpot_qa"
    },
    {
        "query": "Erik Hivju is the father of which Game of Thrones actor?",
        "response": "Kristofer Hivju",
        "source": "hotpot_qa"
    },
    {
        "query": "Meg Johnson is an American poet and lecturer, her poems have appeared in numerous literary magazines, including which American online magazine that publishes poetry, flash fiction, short stories, novel excerpts, creative nonfiction, reviews, and interviews?",
        "response": "Word Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "Dodo bird verdict was named after which fictional character from Chapters 2 and 3 of Alice in Wonderland?",
        "response": "Dodo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor had a role in both the movies \"Bridesmaids\" and \"Alice in Wonderland\"?",
        "response": "Matt Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "David Wildstein was a director overseeing the Port Authority in what two states does it have jurisdiction?",
        "response": "New York and New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Marc Rosset and Max Mirnyi both been professional tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Rignot is the Professor of Earth system science in what country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Parrotiopsis and Emilia both types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel by the author of \"The Great Simoleon Caper\" covers topics such as history, linguistics, anthropology, archaeology, religion, and more?",
        "response": "Snow Crash",
        "source": "hotpot_qa"
    },
    {
        "query": "The chef who has been nicknamed The Demon Chef is judging what Canadian competitive cooking show?",
        "response": "MasterChef Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the English Judge who reaffirmed a class of \"equitable mistakes\" in his judgment, which enabled a claimant to avoid a contract in Solle v Butcher?",
        "response": "23 January 1899",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occurred first, the first publication of The Ladder or Heat?",
        "response": "The Ladder",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010–11 Tour de Ski was the 5th edition of the Tour de Ski and took place from 31 December 2010 to which date, Swiss cross-country skier, Dario Cologna won the Men's class?",
        "response": "9 January 2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Vanessa Petruo and  Greek Fire from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manufactured the line of vehicles below the Mercedes-Benz CLK-Class?",
        "response": "Daimler-Benz",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Chien Français Blanc et Orange and Cretan Hound both used for hunting in packs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which material was created by Leo Baekeland and makes up the door handles at the Tivoli Theatre?",
        "response": "Bakelite",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the essay written in 1919 by a German sociologist, philosopher, jurist, and political economist claiming that the state is the \"only human Gemeinschaft which lays claim to the monopoly on the legitimated use of physical force>?",
        "response": "\"Politics as a Vocation\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is blamed by Tacitus for provoking a queen of the Celtic Iceni tribe?",
        "response": "Catus Decianus",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the self-described \"neoceltic pagan folk\" band based in the Netherlands formed?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played both Drake's mischevious younger sister in the television show \"Drake & Josh\" and starred on the NBC sitcom \"Crowded?\"",
        "response": "Miranda Cosgrove",
        "source": "hotpot_qa"
    },
    {
        "query": "Donald K. Peterson was the former CFO of a multinational telecommunications equipment company headquartered in what state?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "KAKU-LP (88.5 FM, \"The Voice of Maui County\") is a low-power FM radio station broadcasting a variety format, licensed to Kahului, Hawaii, United States, the station is currently owned by Maui County Community Television, Kahului is a census-designated place (CDP) in which county, on the island of Maui?",
        "response": "Maui County",
        "source": "hotpot_qa"
    },
    {
        "query": "What arms firm develops a promotional calendar using models often featured bare-breasted in other newspapers?",
        "response": "Edgar Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "Kokdala and Dongxing, Guangxi, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1949 British black comedy film does the Skindles hotel appear on? ",
        "response": "Kind Hearts and Coronets",
        "source": "hotpot_qa"
    },
    {
        "query": "What characteristics do Lutherville and Baltimore County share? ",
        "response": "Maryland, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician or band is from further north, Matthew Good or Modern Baseball?",
        "response": "Matthew Good",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 135's southern terminus is with a highway that is how many miles long?",
        "response": "235",
        "source": "hotpot_qa"
    },
    {
        "query": "The Make America Number 1 super PAC's largest donor is better known as whom?",
        "response": "Bob Mercer",
        "source": "hotpot_qa"
    },
    {
        "query": "Before the Ganghwa massacre, 140 people were executed in Ganghwa in what is known as which war crime against communists and suspected sympathizers that occured in the summer of 1950?",
        "response": "Bodo League massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created this American apocalyptic supernatural action television series in which Christopher Egan played Alex Lannon?",
        "response": "Vaun Wilmott",
        "source": "hotpot_qa"
    },
    {
        "query": "Wycliffe Hall is named after a philosopher who passed away in which year ?",
        "response": "1384",
        "source": "hotpot_qa"
    },
    {
        "query": "The player traded from the Indiana Packers to the Oklahoma City Thunder prior to the 2017-18 season was born in what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Abigail Kinoiki Kekaulike Kawānanakoa, born on which date, sometimes called Kekau, is a member of the House of Kawānanakoa, and is referred to by many as a princess, a common honorary bestowed to descendants of titled subjects of the Kingdom of Hawaii or important figures in the history of Hawaii? ",
        "response": "April 23, 1926",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first, \"Bambi\" or \"Underdog\"?",
        "response": "Bambi",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Flight of the Navigator and Popeye considered films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What ingredient can be found in both a Bee's Knees and Between the Sheets cocktail?",
        "response": "lemon juice",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Waratah and Trachymene native to Fiji?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Dutch footballer is featured on the song Wij zijn Ajax by Ajax and Friends?",
        "response": "Ryan Guno Babel",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the star of the 1930 film Miss Europe ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the last movie that Barry Kooser worked as a background artist for?",
        "response": "Brother Bear",
        "source": "hotpot_qa"
    },
    {
        "query": "Eddie Kendricks co-founded a singing group that was highly influential in the evolution of which genre of music ?",
        "response": "R&B and soul music",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the second most penalized brawl in the NBA?",
        "response": "Madison Square Garden",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a former science teacher that was fired for branding a student with a Christian cross?",
        "response": "John Freshwater",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a three-time Olympic Champion, that starred in the musical film \"Sun Valley Serenade\"?",
        "response": "Sonja Henie",
        "source": "hotpot_qa"
    },
    {
        "query": "The Old \"New York Evening Post\" Building is the former office and printing plant of the \"New York Evening Post\" newspaper, located in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Nothing Has Changed, is a compilation album by English musician David Bowie, it is the first album to showcase Bowie's entire career and includes a new composition, which was later re-recorded for his final album, which twenty-fifth and final studio album by the English musician David Bowie?",
        "response": "Blackstar",
        "source": "hotpot_qa"
    },
    {
        "query": "What U.S. Army division, referred to as  is the focus of Bravo Company, a 1998 Vietnam War memoir by Robert Hemphill, the commander of this division?",
        "response": "25th Infantry Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Ali Awni al-Harzi was a suspect in a coordinated attack against two United States government facilities in which country?",
        "response": "Libya",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1999 American buddy cop movie staring a German-born actor born April 16, 1965?",
        "response": "Les Mayfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was arena  above North Station which is now a hub for MBTA Commuter Rail and Amtrak trains.and was where the 'final four' games of the 1984 ECAC Hockey Men's Ice Hockey Tournament played located?",
        "response": "Boston, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth day of the the Irish rugby union player who competed in the Pro14?",
        "response": "22 December 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Brian Kidd and Mikel Arteta, what year was the older one born?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "The Johann Strauss Orchestra was founded by André Rieu in 1987, it has performed regularly with guest musicians and singers such as which Brazilian operatic soprano?",
        "response": "Carmen Monarcha",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2009 romantic comedy-drama anthology did Cloris Leachman appear in?",
        "response": "New York, I Love You",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the man, with whom John Spencer beat in a 2006 primary, slated to become the next United States Ambassador for?",
        "response": "Singapore",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist has sold over 100 million records worldwide and also created an album that included \"Every picture tells a story\"? ",
        "response": "Rod Stewart",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Ron Dundas play a football position for the offense or defense? ",
        "response": "offense",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the 1992 head coach of the Denver Nuggets go to college?",
        "response": "University of Kentucky,",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the man who Carol Kane played the wife of who was a lovable-but-goofy mechanic in a television series?",
        "response": "Latka Gravas",
        "source": "hotpot_qa"
    },
    {
        "query": "Along which river is the Kentucky Department of Corrections headquarted?",
        "response": "Kentucky River",
        "source": "hotpot_qa"
    },
    {
        "query": "Siegfried and Idomeneo are both what type of performances?",
        "response": "music",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy Anthony Barnett a former American football defensive lineman in the National Football League manages an amazing group of teammates at an American company that manufactures footwear, sports and casual apparel headquartered where? ",
        "response": "Baltimore, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan S. Beman begam president of what college in 1818, which is located in the in the sixth largest city in Georgia?",
        "response": "Franklin College",
        "source": "hotpot_qa"
    },
    {
        "query": "Whats was the population in 2003 of Centralia, the least populated municipality in Pennsylvania, USA?",
        "response": "7",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the album released in which \"Big Fish\" is a song recorded by American rapper Vince Staples?",
        "response": "June 23, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What channel can you watch George Paul Blagden perform on television on in the U.S.?",
        "response": "Ovation",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the team which drafted Brenden Blair Morrow based when it was founded?",
        "response": "Bloomington, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 American action crime thriller featuring American actor Paul Walker",
        "response": "John Luessenhop",
        "source": "hotpot_qa"
    },
    {
        "query": "Ngong Forest is home to which sole member of the genus Crocuta?",
        "response": "spotted hyena",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the album by Monument/Columbia Records released with the Song Travelin Soldier on it?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "What former professional Australian rules footballer who played for the Adelaide Football Club in the Australian Football League (AFL), replaced coach Neil Craig after round 18 of their 21st season?",
        "response": "Mark Bickley",
        "source": "hotpot_qa"
    },
    {
        "query": "Sorry is a 1966 song that was written by Stevie Wright and another Australian musician who moved to Australia with his family as a teenager, but was born where?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Ken Takakuwa win a gold medal for the 200m IM event at the Asian Games?",
        "response": "Guangzhou, China",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who wrote dialogues and lyrics for the Telugu version for Sampoorna Ramayanam received the Sahitya Akademi Award in what year? ",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Jolen is a member of the race of what type of people created by Marvel Comics?",
        "response": "superhumans",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was teacher of the composer of Faschingsschwank aus Wien? ",
        "response": "Friedrich Wieck",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Look At Us Now\" is a song by American DJs based in which city ?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Horizon Pictures had a first release that was taken from the novel written by whom?",
        "response": "C. S. Forester",
        "source": "hotpot_qa"
    },
    {
        "query": "What single was released on May 22, 2012 is also a dance of the same name?",
        "response": "Harlem Shake",
        "source": "hotpot_qa"
    },
    {
        "query": " Teri W. Odom is a member of a scientific journal first published in 2007 by who?",
        "response": "the American Chemical Society",
        "source": "hotpot_qa"
    },
    {
        "query": "What Business conglomerate incorporated in Bermuda is closely associated with Matheson & Company?",
        "response": "Jardine Matheson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of birth of the woman who inspired the opera Midnight Son?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Joe Orton and Henry James, which author is the adjective \"Ortonesque\" used to refer to his work?",
        "response": "John Kingsley \"Joe\" Orton",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Schultz is a senior advisor to former President Barack Obama and is the founder of Schultz Group, after White House Deputy Press Secretary Josh Earnest replaced Jay Carney to become White House Press Secretary, Joshua Ryan Henry Earnest, is an American political aide who served as White House press secretary under President Barack Obama, from which time span?",
        "response": "2014 to 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Do You Believe? starred the football player who played for what team?",
        "response": "Seattle Seahawks",
        "source": "hotpot_qa"
    },
    {
        "query": "Jimmy C. Newman was a long time star of?",
        "response": "The Grand Ole Opry",
        "source": "hotpot_qa"
    }
]