[
    {
        "query": "Bethany Beardslee has performed classical music by which Austrian composer and theorist?",
        "response": "Arnold Franz Walter Schoenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Atlanta Falcons drafted which player as the number one selection overall in 1966?",
        "response": "Thomas Henry Nobis Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "What types of films are both Station 58 and Bougainville – Our Island Our Fight?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "What NIFL Premier Intermediate League team did Sean Connor play for?",
        "response": "Distillery",
        "source": "hotpot_qa"
    },
    {
        "query": "The mint julep is a mixed alcoholic drink, or cocktail, consisting primarily of Bourbon whiskey, a whiskey of which nationality, a barrel-aged distilled spirit made primarily from corn?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "South Australia's smallest electorate is the home of what football club?",
        "response": "Sturt Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "The younger brother, who became king, of Princess Mafalda of Savoy reigned for how many days?",
        "response": "34 days",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Supreme Court case was ruled on first; Glossip v. Gross or New Negro Alliance v. Sanitary Grocery Co.?",
        "response": "New Negro Alliance v. Sanitary Grocery Co.",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Hyun-seok, is a South Korean film director and screenwriter, she wrote and directed C'est si bon, a South Korean musical drama film, released on February 5, 2015?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Alec Baldwin guest starred in which 2004 \"The Fairly Oddparents\" television film? ",
        "response": "Channel Chasers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier Dario Argento or W. S. Van Dyke?",
        "response": "Dario Argento",
        "source": "hotpot_qa"
    },
    {
        "query": "Ralf Zumdick pioneered the practice of the penalty-taking-goalkeeper when he scored against a German former football goalkeeper who was in the German squad that won the 1990 what?",
        "response": "FIFA World Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "Rillington Place is a three-part biographical crime drama about the case of a serial killer that lived in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Billy Bob Thornton and Gene Saks, are Americans that have which occupation in common?",
        "response": "actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which World War II flying ace was Kenneth Marlar Taylor friend ",
        "response": "George Welch",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state does the largest power station in Australia, Eraring Power Station, and fueled by the overland conveyor system of Myuna Colliery reside?",
        "response": "New South Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "Ren Cancan is a female Chinese boxer who has won three world championships, she lost in both of her Olympic Games, to which double-champion British professional boxer?",
        "response": "Nicola Adams",
        "source": "hotpot_qa"
    },
    {
        "query": "The Airth Old Parish Church is located near what body of water?",
        "response": "River Forth",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian documentary is about the hobby where participants wear costumes to represent a specific character?",
        "response": "Fanboy Confessional",
        "source": "hotpot_qa"
    },
    {
        "query": "From what 1981 philosophical treatise did Houellebecq get the name of The Map and the Territory?",
        "response": "Simulacra and Simulation",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the host of Loveline after the show was rebooted?",
        "response": "October 21, 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the county where San Antonio Florida is located ?",
        "response": "464,697",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998 Miami Redskins football team played in which Division I athletic conference?",
        "response": "Mid-American Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "The fictional character Shawn Hunter appears on what sitcom that aired from 1993 to 2000 on ABC?",
        "response": "Boy Meets World",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of team did Enrique Bernoldi join his rookie year?",
        "response": "a British Formula One team",
        "source": "hotpot_qa"
    },
    {
        "query": "What English dancer, judge, and coach was featured as a judge on Strictly Come Dancing on season 14 with Bruno Tonioli, Craig Revel Horwood and Darcey Bussell?",
        "response": "Leonard Gordon Goodman",
        "source": "hotpot_qa"
    },
    {
        "query": "What film, co-written by Luc Besson, was dubbed in Italian by Tonino Accolla?",
        "response": "The Fifth Element",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Anderson and Derek Estlin Purvis are both what?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Shamrock and Styphelia both shrubs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Evan Jones was in the 2002 American drama film written by whom?",
        "response": "Scott Silver",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2009 film features an actor that also started in Bad Samaritan?",
        "response": "Cherrybomb",
        "source": "hotpot_qa"
    },
    {
        "query": "Lionel Barrymore and François Truffaut, are film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1932 horror film based on the book written by Nina Wilcox Putnam?",
        "response": "Karl Freund",
        "source": "hotpot_qa"
    },
    {
        "query": "John Pollow, of Exeter, was an English politician, Exeter is a cathedral city in Devon, in which UK country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the founder of the Material World Charitable Foundation often referred to as?",
        "response": "the quiet Beatle",
        "source": "hotpot_qa"
    },
    {
        "query": "Return to House on Haunted Hill is a sequel to a 1999 horror film directed by whom?",
        "response": "William Malone",
        "source": "hotpot_qa"
    },
    {
        "query": "Adrian Martinez stars in a serires of State Farm commercials alongside an American football quarterback for what team?",
        "response": "Green Bay Packers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which superbowl did Scott Green officiate that was between the Carolina Panthers and New England Patriots?",
        "response": "Super Bowl XXXVIII",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has been known as one of the most popular leading men in the sex industry, as well as \"The King of Porn\" , who directed a 2005 pornographic horror film?",
        "response": "Brad Armstrong",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song with which Critics compared Fading?",
        "response": "Erik Hermansen",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lake Worth Lagoon and London Avenue Canal situated in the state of Florida?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Knovíz culture was part of which central European Bronze Age culture?",
        "response": "Urnfield culture",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Benjamin Britten and Claude Debussy music composers ? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Vienna took place at Kahlenberg Mountain near Vienna in which year, after the imperial city had been besieged by the Ottoman Empire for two months, In the ensuing war that lasted until 1699, the Ottomans lost almost all of Hungary to the Holy Roman Emperor Leopold I, was the Holy Roman Emperor, King of Hungary, Croatia, and Bohemia?",
        "response": "1683",
        "source": "hotpot_qa"
    },
    {
        "query": "If We Must Die is a poem by which Jamaican writer?",
        "response": "Festus Claudius \"Claude\" McKay",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Disney movie had the voices of more movie stars, Frankenweenie or Piglet's Big Movie?",
        "response": "Frankenweenie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which theatrical producer co-created both \"Sunny\" and \"Oklahoma!\"",
        "response": "Oscar Hammerstein II",
        "source": "hotpot_qa"
    },
    {
        "query": "What census-designated place is home to the Geissler Estate?",
        "response": "Fort Salonga",
        "source": "hotpot_qa"
    },
    {
        "query": "Floating Power was a technology developed by an automobile firm headquartered in what MIchigan city?",
        "response": "Auburn Hills",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the actor who, along with Seth MacFarlane, Alex Borstein,  Lacey Chabert and Mila Kunis, provides voices for the show Family Guy ? ",
        "response": "Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the magazine founded that described Chelsea Jade as New Zealand's \"Accidental Dream Pop Hero\"?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Song Min-ho is a rapper who sang Born Hater which originated in which country?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cocktail's name describes how the drink looks, Blue Hawaii or Baby Guinness?",
        "response": "Baby Guinness",
        "source": "hotpot_qa"
    },
    {
        "query": "Day by Day stars the American comedienne who was best known for her work in what field?",
        "response": "television comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which grandson of Emperor Nicholas 1 was the father of Princh John Konstantinovich of Russia?",
        "response": "Grand Duke Konstantin Konstantinovich of Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Toni Nadal's younger brother born?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Delta–Mendota Canal and Union Canal both US-based canals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "This Canadian actor won a Best Picture award for the film River's Edge with which award ceremony?",
        "response": "1986 Independent Spirit Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the rapper who created a song produced by a Norwegian DJ?",
        "response": "Tory Lanez",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this Austrian business magnate, engineer and executive whom Hans Dieter Pötsch succeeded as chairman of the supervisory board of Volkswagen born?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Cathy Berberian and Dickran Tevrizian share the same profession ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Sparks Fly was written and recorded by the singer-songwriter of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the training center that a forward for Spanish side Las Palmas of La Liga located in?",
        "response": "Lyon",
        "source": "hotpot_qa"
    },
    {
        "query": "Just a Little Inconvenience is a 1977 American made-for-television post-war drama film written and directed by Theodore J. Flicker and starring which American film, television and voice actor, best known for portraying the roles of Heath Barkley in the American television Western series \"The Big Valley\" (1965–1969)?",
        "response": "Lee Majors",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Meaning of Shakespeare\" includes a chapter on one of only two of Shakespeare's plays to observe what? ",
        "response": "Unity of Time",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist, Raymond Queneau or Peter Straub, has received the Bram Stoker Award?",
        "response": "Peter Francis Straub",
        "source": "hotpot_qa"
    },
    {
        "query": "John P. Angelos is the elder son of the trial lawyer of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The village of Amissano is where an all-male academic institution was founded in what year?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the older brother sportscaster of a man who is an in-studio analyst alongside Seth Davis?",
        "response": "Bryant Gumbel",
        "source": "hotpot_qa"
    },
    {
        "query": "The Honda XL350R is a dual-sport motorcycle made by Honda in 1984–1985, both \"Cycle\" and which motorcycling magazine in the United States, ranked it as one of the ten best motorcycles of 1985?",
        "response": "Cycle World",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress starred in an American biographical comedy-drama based on the making of Tommy Wiseau's \"The Room\"?",
        "response": "Alison Brie",
        "source": "hotpot_qa"
    },
    {
        "query": "Manuel Quintas de Almeida, was a lieutenant in the military of São Tomé and Príncipe, a Portuguese-speaking island nation, in which location?",
        "response": "Gulf of Guinea",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the singer of the 2002 album Fight?",
        "response": "Dorothee Pesch",
        "source": "hotpot_qa"
    },
    {
        "query": "NBA Access with Ahmad Rashad, an American sportscaster (mostly with NBC Sports) and former professional football player, is an American television program which initially aired on Saturday afternoons on which channel?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1987 Asian WOmen's Handball Championship took place in a city with this population?",
        "response": "4,007,526",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the game publishing company that published Return of the Eight?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Get Outta My Dreams, Get into My Car was based on a line from which Sherman Brothers song?",
        "response": "You're Sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of John Eric Copeland's holding company?",
        "response": "Creative Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Hamilton Institute named after?",
        "response": "Sir William Rowan Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American writer and producer, who wrote several episodes of the animated television sitcom \"The Simpsons\" between 1993 and 1997 who also directed the seventeenth episode of the eighth season of the American comedy television series \"The Office\" ?",
        "response": "Brent Forrester",
        "source": "hotpot_qa"
    },
    {
        "query": "Anna Miełżyńska was the great-grandmother of which Queen consort of the Polish-Lithuanian Commonwealth?",
        "response": "Catherine Opalińska",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Saturday Night Live cast member starred in Strange Magic?",
        "response": "Maya Rudolph",
        "source": "hotpot_qa"
    },
    {
        "query": "527 Euryanthe is a minor planet orbiting the Sun, it was discovered in 1904 by Max Wolf and named after the heroine of an opera by which German composer, conductor, pianist, guitarist and critic, and was one of the first significant composers of the Romantic school?",
        "response": "Carl Maria von Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city did Kyle Irion study a BA in English?",
        "response": "Denton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the 1981 CART PPG Indy Car World Series in Avondale Arizona?",
        "response": "Rick Ravon Mears",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American senior operations officer for the Central Intelligence Agency for 30 years and worked for Eclipse Group?",
        "response": "Duane \"Dewy\" Clarridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the fairy character from Peter Pan 2?",
        "response": "J. M. Barrie",
        "source": "hotpot_qa"
    },
    {
        "query": "Nic Offer and Grant Hart are considered to be which type of artist?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What author was more popular in the 70's, Richard Wright or Richard Bach?",
        "response": "Richard David Bach",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Persea and Hibiscus syriacus both refer to plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the fantasy novella which was reworked in 2014 with a series of paintings by a Spanish artist born in Olalla in 1954?",
        "response": "George R. R. Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Janet Rogers' tribe historically based?",
        "response": "the Mohawk Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Approximate what percentage of the Canadian population live in the province in which Ivan Woods was born ?",
        "response": "nearly 40 percent",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the sucessor wish for his country, Austria after the leader was executed?",
        "response": "wished for it to remain independent.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which war took place first Korean War or The Meuse-Argonne Offensive ?",
        "response": "Meuse-Argonne Offensive",
        "source": "hotpot_qa"
    },
    {
        "query": "Juven is a medical food that is manufactured by a company headquartered in what state?",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Different for Girls\" is a song by Dierks Bentley that features an American singer who released her debut album on what date?",
        "response": "February 17, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former name of the building across from the Rockefeller Building?",
        "response": "Cleveland Union Terminal",
        "source": "hotpot_qa"
    },
    {
        "query": "Global Philanthropy Group is a consulting firm that provides philanthropic services for high-net-worth individuals, charitable foundations and corporations, their clients include Tory Burch, an American fashion designer, businesswoman, and philanthropist, who has won several fashion awards for her designs, she is the Chairman, and what, and Designer of Tory Burch LLC",
        "response": "CEO",
        "source": "hotpot_qa"
    },
    {
        "query": "Shoney's dropped is affiliation with a restaurant whose name, design aesthetic, and menu were previously licensed to who? ",
        "response": "regional franchisees",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the closing night film from the 2013 Deauville American Film Festival?",
        "response": "Bong and Kelly Masterson",
        "source": "hotpot_qa"
    },
    {
        "query": "Cato Point is a headland forming the southwest extremity of an island that lies approximately how far from the coast of South Africa ?",
        "response": "2600 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote more novels, Sandra Dallas or Juan Rulfo?",
        "response": "Sandra Dallas",
        "source": "hotpot_qa"
    },
    {
        "query": "Kung Fu Panda is a 2008 American computer-animated action comedy starring the voice of a Hong Kong martial artist who is known for what kind of fighting style?",
        "response": "acrobatic",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan Chapman is an American record producer who works in the field of country music, he is known primarily for working with Taylor Swift, having produced her albums including Taylor Swift, the debut studio album, released on which date? ",
        "response": "October 24, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed 3D scrolling shooter and third-person shooter video game developed that was promoted by an American-based provider of home movie and video game rental services?",
        "response": "Namco",
        "source": "hotpot_qa"
    },
    {
        "query": "This  social justice leadership training school and cultural center was founded in 1932 by an American educator and socialist  famous for its role in what?",
        "response": "the Civil Rights Movement",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Manfred Eglin play for that first competed in 1912?",
        "response": "Germany Olympic football team",
        "source": "hotpot_qa"
    },
    {
        "query": "What Golden State Warriors basketball player was sent to the All-Star Game and won NBA Defensive Player of the Year?",
        "response": "Draymond Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Jane Arden and Fruit Chan both screenwriters? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist does Thank You Baby! and Up! have in common?",
        "response": "Shania Twain",
        "source": "hotpot_qa"
    },
    {
        "query": "Garth Fundis produced albums for the country singer who was inducted into the Country Music Hall of Fame in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British French Crime drama series did William Ash star in?",
        "response": "The Tunnel",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 1990 Los Angeles Rams season, which player from the University of Oklahama made his NFL debut?",
        "response": "Marcus L. Dupree",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Stich and Chanda Rubin, have which occupation in common?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the British bicycle manufacturer based who produces the Claud Butler bicycle?",
        "response": "Brigg, North Lincolnshire",
        "source": "hotpot_qa"
    },
    {
        "query": "War All the Time is an album released by a band formed in which city?",
        "response": "New Brunswick",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2008 British-American black comedy crime film in which Mark Donovan was a actor?",
        "response": "Martin McDonagh",
        "source": "hotpot_qa"
    },
    {
        "query": "What stadium is home to a team once coached by the current offensive coordinator at Ohio State University?",
        "response": "Memorial Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Dickens of London is a 1976 television miniseries from Yorkshire Television based on the life of English novelist Charles Dickens, Dickens and his father John were played by which British actor known for his Tony Award-winning Broadway performance in the revival of \"A Moon for the Misbegotten\"?",
        "response": "Roy Dotrice",
        "source": "hotpot_qa"
    },
    {
        "query": "Diane Michelle voiced Daisy Duck in the 1999 Christmas anthology film produced by Walt Disney Home Video that won what award at the 5th Kecskemét Animation Film Festival in 1999?",
        "response": "Award for Best Animated Feature Film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is the United States Air Force Installation where the 49th Air Transport Squadron was last stationed?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Cake and The The are what types of bands?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city in which the Irving neighborhood is located ?",
        "response": "86,110",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Norwegian comedy duo consisting of brothers Vegard and Bård Ylvisåker sang \"I Will Never Be a Star\"",
        "response": "Ylvis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was fought earlier in our nation's history, the Seven Days Battles or the Battle of Manila?",
        "response": "The Seven Days Battles",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the covalist on the song \"Come Taste the Band\" inducted into the Rock and Roll Hall of Fame?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "On Giants' Shoulders was written in 1998 by Melvyn Bragg, the book was assembled after a series of interviews Bragg had with current scientists about the world's greatest scientists such as which English mathematician, astronomer, and physicist (described in his own day as a \"natural philosopher\") who is widely recognised as one of the most influential scientists of all time and a key figure in the scientific revolution?",
        "response": "Isaac Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "Where can you hear Kristen Anderson-Lopez's songs in a performance of Finding Nemo - The Musical?",
        "response": "Disney's Animal Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Josh Howard is a columnist for a magazine about what type of publication?",
        "response": "comic books",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tabloid, Star or Trump, was founded in 1974?",
        "response": "Star",
        "source": "hotpot_qa"
    },
    {
        "query": "Northrop F-5F aggressor squadron is based in an air station that is designated as a superfund site due to what ?",
        "response": "a number of soil and groundwater contaminants, including asbestos",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the pro dance partner of the actor and writer of The 15:17 to Paris when he competed on Dancing With the Stars?",
        "response": "Lindsay Arnold",
        "source": "hotpot_qa"
    },
    {
        "query": "What number of U.S. Navy Vessel held the USS Hopping after Lieutenant Commander Hallsted L. Hopping was killed in action? ",
        "response": "seventh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lisbon Traviata revolves around fans of the soprano who was of what nationality?",
        "response": "Greek-American",
        "source": "hotpot_qa"
    },
    {
        "query": "The founding members of The Mystic Deckchairs all attended a college located in this county in the UK?",
        "response": "Cheshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was founded first, Diva or Elle?",
        "response": "Elle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which world war did Ronald Wallens participate in?",
        "response": "the Second World War",
        "source": "hotpot_qa"
    },
    {
        "query": "Superfast!, is a 2015 American parody comedy film written and directed by Jason Friedberg and Aaron Seltzer, and is a parody of which American franchise based on a series of action films that is largely concerned with illegal street racing and heists, and includes material in various other media that depicts characters and situations from the films?",
        "response": "The Fast and the Furious",
        "source": "hotpot_qa"
    },
    {
        "query": "Travis and Luna, are rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Shawty Is a 10\" (also known uncensored as \"Shawty Is Da Shit\") is the first single from American singer-songwriter The-Dream's debut studio album, \"Love Hate\", the song samples the opening singer of Rihanna's \"We Ride\", by the Barbadian singer, from her second studio album \"A Girl like Me\", in which year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the game announced that the St Louis Blues played in for the first time?",
        "response": "March 9, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first name of the father of the actor that was featured in the film Bulldog Drummond's Revenge?",
        "response": "Maurice",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of Velvet Goldmine is also known for his role in what movie directed by Måns Mårlind and Björn Stein? ",
        "response": "Shelter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who one of the leading poets of the First World War, who was the first known user of the phrase  \"the pity of war\" ?",
        "response": "Wilfred Edward Salter Owen",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Holger Klose achieve in the 8th largest city in Germany?",
        "response": "His personal best throw",
        "source": "hotpot_qa"
    },
    {
        "query": "Boomer and Sooner are two matching white ponies who pull the Sooner Schooner, a Conestoga wagon across the field when the University of Oklahoma football team scores, The Sooner Schooner represents the University of Oklahoma as a mascot for the University and its sports teams, what is the name that are the athletic teams that represent the University of Oklahoma, located in Norman?",
        "response": "Oklahoma Sooners",
        "source": "hotpot_qa"
    },
    {
        "query": "Bear Lane is located just north of a constituent college of what university?",
        "response": "University of Oxford",
        "source": "hotpot_qa"
    },
    {
        "query": "White Farm Equipment is a brand of agricultural machinery, now discontinued except for planter, and owned by AGCO, AGCO Corporation is an American agricultural equipment manufacturer based in Duluth, Georgia, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize in Physics has the inventor of the heterotransistor, who is the head of the St Petersburg Academic University won?",
        "response": "Nobel Prize in Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Denver Bronco is son of College Hall of Famer Archie Manning?",
        "response": "Peyton Williams Manning",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed is used more for trailing small game, Irish Terrier or Mountain Cur?",
        "response": "The Mountain Cur",
        "source": "hotpot_qa"
    },
    {
        "query": "While Tom Selleck is known for starring as private investigator Thomas Magnum in the television series \"Magnum, P.I.\", what role did Larry Manetti, play on \"Magnum, P.I.\"?",
        "response": "Orville Wilbur Richard \"Rick\" Wright",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a film about a young engaged couple on a sea cruise, with the woman being implicated in the death of her former lover, and also became an American citizen in 1942?",
        "response": "Cary Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "What rapper from Cleveland, Ohio  has done a collaboration with Blackbear?",
        "response": "Machine Gun Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the airing date of this American medical-drama television series, developed by David Shore that is produced by 3AD, run by Daniel Dae Kim?",
        "response": "September 25, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew James Matfin Bell, is an English actor and dancer, he's known for his roles in which 2011 3D motion capture computer-animated mystery adventure comedy film based on \"The Adventures of Tintin\", the comics series by Belgian cartoonist Hergé?",
        "response": "The Adventures of Tintin",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the treaty that made Hungary a landlocked state which contained the Kolozsvar Ghetto?",
        "response": "Treaty of Trianon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state has both Rocky Mountain Conservatory Theatre and Mizner Park?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county is the town in which the BrightBuilt Barn project was first established ?",
        "response": "Knox County,",
        "source": "hotpot_qa"
    },
    {
        "query": "How Are You Bread stars a singer who is the leader of which boy group?",
        "response": "EXO",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, The Caribbean Pioneer or Cook's Illustrated, is an American cooking magazine published every two months by the America's Test Kitchen company in Brookline, Massachusetts?",
        "response": "Cook's Illustrated",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was the Auto company responsible for sponsorship of the 2016 World Club Series located in?",
        "response": "Romania",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Morris, famous for helping to develop a 50km rail tunnel linking Folkestone to Coquelles is also famous for which other project?",
        "response": "the hovertrain project",
        "source": "hotpot_qa"
    },
    {
        "query": "The show Pole Chudes is hosted by a well-known television and internet personality is named based on what story?",
        "response": "The Golden Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Madden NFL 2002 features a former Minnesota Vikings quarterback who played college football at which school?",
        "response": "University of Central Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Badmaash Company actress won a Filmfare Award?",
        "response": "Anushka Sharma",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Yanka Dyagileva or Alexander Bashlachev?",
        "response": "Alexander Nickolaevich Bashlachev",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reigned for 50 months as lineal champion  and fought Richard Williams?",
        "response": "Sergio Gabriel Martínez",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is Upper and Lower Marlboro located?",
        "response": "Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which influential composer of piano music was active later in the 20th century: Dmitri Shostakovich or Philip Glass?",
        "response": "Philip Morris Glass",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the author of the Beach Boys' song \"Feel Flows\"?",
        "response": "Dean",
        "source": "hotpot_qa"
    },
    {
        "query": " The Honda K series have cast iron sleeves as opposed to the FRM cylinders found only in a roadster that is named for its what?",
        "response": "engine displacement of two liters",
        "source": "hotpot_qa"
    },
    {
        "query": "Which US documentary was made first: Scared Straight! or Soldier Girls?",
        "response": "Scared Straight!",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city where the Ariel Castro kidnappings took place?",
        "response": "388,072",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat German-born French composer created the operetta La Grande-Duchesse de Gérolstein?",
        "response": "Jacques Offenbach",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Smith University was founded by Dr. Donald Grunewald, who was president of what college in Dobbs Ferry, New York?",
        "response": "Mercy College",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is in the Hebei province, Fuxin or Langfang?",
        "response": "Langfang",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a correspondent for NBC, Janet Shamlian or Mia Tyler?",
        "response": "Janet Shamlian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the proper name for the steroid used by the retired British track sprinter who is one of the fastest European sprinters in the history of athletics?",
        "response": "Tetrahydrogestrinone",
        "source": "hotpot_qa"
    },
    {
        "query": "What English motorsport company featured the work of Len Terry, who also worked on BRM and Eagle?",
        "response": "Team Lotus",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the stadium where Atlético Madrid home games were held located? ",
        "response": "San Blas-Canillejas district",
        "source": "hotpot_qa"
    },
    {
        "query": "István Javorek is a retired head strength and conditioning coach at college located in what city and state?",
        "response": "Overland Park, Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American director was raised in San Diego, CA, Dean Silvers or Juan Escobedo?",
        "response": "Juan Escobedo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"Last Man Standing\" actor also starred in the 2015 American comedy horror film \"Gravy\"?",
        "response": "Molly Ephraim",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Dorstenia or Brassavola?",
        "response": "Dorstenia",
        "source": "hotpot_qa"
    },
    {
        "query": "Vanessa Kirby played Joanna Richard Curtis' movie released on what date?",
        "response": "4 September 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the forerunner of the bolt-action rifle chambered for the 7.92×57mm Mauser cartridge that was adopted on 21 June 1935 as the standard service rifle by the German \"Wehrmacht\"?",
        "response": "Mauser M1924",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the first compilation album produced by Guy-Manuel de Homem-Christo's company?",
        "response": "Waves",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiten tejwani starred in kasautii zindagii kay, which was produced by which company?",
        "response": "Balaji Telefilms",
        "source": "hotpot_qa"
    },
    {
        "query": "Dale K. Myers is noted for authoring a book about what  American former U.S. Marine who assassinated United States President John F. Kennedy",
        "response": "Lee Harvey Oswald",
        "source": "hotpot_qa"
    },
    {
        "query": "The single \"Love Can Go to Hell\" from Big Day in a Small Town was nominated for an award which was established in what year?",
        "response": "1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Time Out's 100 best British films was topped by a film adapted from a short story by which author ?",
        "response": "Daphne du Maurier",
        "source": "hotpot_qa"
    },
    {
        "query": "How many basalt columns make up the causeway between Causeway Head and Benbane Head?",
        "response": "about 40,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is home to both the Random House Tower and 383 Madison Avenue?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the person that dedicated Flint River Academy at its opening born?",
        "response": "1915",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was considered more radical, Ivor Gurney or Wilhelm Reich?",
        "response": "Wilhelm Reich",
        "source": "hotpot_qa"
    },
    {
        "query": "What honor was a producer of the album As I Am granted in 2015?",
        "response": "Songwriters Hall of Fame",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1988 IAAF Grand Prix Final took place in a stadium that was originally built for what purpose?",
        "response": "1936 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress born in 1939 starred in The Kid?",
        "response": "Lily Tomlin",
        "source": "hotpot_qa"
    },
    {
        "query": "Fort Ridgely played an important role in an armed conflict between the United States and several bands of Dakota, that started when?",
        "response": "August 17, 1862",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plants is native to Europe, Apera or Thujopsis dolabrata?",
        "response": "Apera",
        "source": "hotpot_qa"
    },
    {
        "query": "Which civil unrest (protests) led to this armed conflict in 2011 in Libya during which Arrai TV was used by overseas Libyans to defend the Gaddafi government?",
        "response": "protests in Benghazi",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the lead single released for Curtain Call: The Hits?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "The Girl He Left Behind is a 1956 romantic comedy film, it was filmed at Fort Ord, a former United States Army post on Monterey Bay of the Pacific Ocean coast in California, which closed in what year?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was created in Finland, King Oil or Inkan aarre?",
        "response": "Inkan aarre",
        "source": "hotpot_qa"
    },
    {
        "query": "The Porsche 928 is a luxurious grand tourer produced by Porsche AG of which country, from 1978 to 1995, the 928 combined the power, poise, and handling of a sports car with the refinement, comfort, and equipment of a luxurious saloon, luxury vehicle is a marketing term for a vehicle that provides luxury — pleasant or desirable features beyond strict necessity — at increased expense?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Rhys Meyers, the actor of Tangled, was the face model of which brand?",
        "response": "Hugo Boss",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television show brought fame to the American singer of 'Cowboy Casanova'?",
        "response": "American Idol",
        "source": "hotpot_qa"
    },
    {
        "query": "The producer of this box office success starring Liam Neeson was born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Who came to prominence first, Saul Metzstein or Elem Klimov?",
        "response": "Klimov",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fantasy book series, with more than 80 million books sold in 37 languages, was written by Only You Can Save Mankind author Terry Pratchett?",
        "response": "Discworld",
        "source": "hotpot_qa"
    },
    {
        "query": "What voice actress born in Osaka played a role in the anime series Fullmetal Alchemist: Brotherhood?",
        "response": "Rie Kugimiya",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Jesus Jones of TV on the Radio?",
        "response": "Jesus Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "William Frederick Harris received the Navy Cross for extraordinary heroism during the breakout in a battle that took place in which war ?",
        "response": "the Korean War",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is rapper Kendrick Lamar, who has his albums produced by Nez & Rio, from?",
        "response": "Compton, California",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the contribution of the \"quiet Beatle\" to a song Ian McDonald described as having \"rich and unusual harmonic motion\"?",
        "response": "use of volume pedal guitar",
        "source": "hotpot_qa"
    },
    {
        "query": "Santana Row, an outdoor shopping mall, is located near this upscale indoor shopping mall whose western portion is located in which city?",
        "response": "Santa Clara",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Jackie Chan film released that Gary Daniels was in?",
        "response": "14 January 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Noor Zehra plays a variation of a stringed instrument that was traditionally used to play what kind of music?",
        "response": "Hindustani music",
        "source": "hotpot_qa"
    },
    {
        "query": "What roller coaster and amusement ride manufacurer from Wichita, Kansas built Submission, a Double Swinging Inverter located in the X-Sector area? ",
        "response": "Chance Rides",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hawaii Hammerheads played in this center formerly know as the Honolulu International Center.",
        "response": "Neal S. Blaisdell Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monta Bell and Mack Sennett both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Couples and \"Heroes\"?",
        "response": "albums",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian billionaire owns a yacht built in the Lürssen Yachts yard?",
        "response": "Heidi Horten",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did the actress, who co-stars with Nicolas Cage in the 2004 heist film, play in \"Baby Blues\"?",
        "response": "Melinda Bitterman",
        "source": "hotpot_qa"
    },
    {
        "query": "Marcia Louise Fudge is the U.S. Representatieve for which city in Cuyahoga County?",
        "response": "Cleveland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professional tennis player is older, Françoise Dürr or Ryan Harrison?",
        "response": "Françoise Dürr",
        "source": "hotpot_qa"
    },
    {
        "query": " Tinker Owens was the younger brother of what running back from the 1970s?",
        "response": "Loren Everett \"Steve\" Owens",
        "source": "hotpot_qa"
    },
    {
        "query": "The tract where \"Upstart Crow\" gets its name came out in what year?",
        "response": "1592",
        "source": "hotpot_qa"
    },
    {
        "query": "Fred: The Movie included the professional wrestler and actor currently signed to what wrestling company?",
        "response": "WWE",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Candy\" is a duet with Iggy Pop and Kate Pierson, an American vocalist, lyricist, and one of the singers and founding members of what group?",
        "response": "The B-52's",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American  former schoolteacher born who is a subject in a true crime book of Gregg Olsen?",
        "response": "January 30, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "James Frawley and Jerry Belson, have which mutual occupation?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company owned by Matt Groening features a logo with the letter \"C\" formed by a reflected surfboard?",
        "response": "The Curiosity Company",
        "source": "hotpot_qa"
    },
    {
        "query": "The university where William I. Rose is a professor was founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "Randy Hansen was part of the group that played North American tours with which guitarist and pianist?",
        "response": "Robert Clark Seger",
        "source": "hotpot_qa"
    },
    {
        "query": "Teri Greeves is an artist living in a city that is the seat of which county ?",
        "response": "Santa Fe County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Phillips Berlina is a neo-classic car that used stretched underpinings from a car that set a new sales record for what model year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed has a number of different varieties, the Harrier or the Schweizerischer Niederlaufhund?",
        "response": "Schweizerischer Niederlaufhund",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2000 film in which Deirdre Quinn appeared as Miss Texas?",
        "response": "Donald Petrie",
        "source": "hotpot_qa"
    },
    {
        "query": "What Irish town, the third-largest in County Tyrone, lies nine miles from Benburb?",
        "response": "Dungannon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the date of the film release in which the Irish Dream Team produced and one member starred in?",
        "response": "September 23, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Officially named Manchester, what city holds the MBTA Commuter Rail Newburyport/Rockport Line and is known for scenic beaches and vista points?",
        "response": "Manchester-by-the-Sea, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did the star of Gimme Shelter who has also provided voice-over work for Disney and DC make her debut in?",
        "response": "\"Kids\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are 10 Years and Ash from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The organisation that was announced as sponsors of the Friends Life t20 competition was based in what country?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bell OH-58 Kiowa was based on which model of two-bladed helicopters made in Quebec?",
        "response": "Bell 206",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Hanson House is located in a city that has a population of how many people ?",
        "response": "641",
        "source": "hotpot_qa"
    },
    {
        "query": "Vashti Cunningham attended what school administered by the Diocese of Las Vegas? ",
        "response": "Bishop Gorman High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Sharon Feingold is the on-air voice for the promo of the HGTV reality show based in Waco, Texas starring which two people?",
        "response": "Joanna and Chip Gaines",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is also known as the writer of the Frank Buck film serial \"Jungle Menace\", Edgar Selwyn or Dallas M. Fitzgerald ?",
        "response": "Dallas M. Fitzgerald",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a French scholar that specialized in Physics and astronomy?",
        "response": "Laplace",
        "source": "hotpot_qa"
    },
    {
        "query": "Eugene Lee's set design works include one for a musical based on an English slave trader by the name of what?",
        "response": "John Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was the professional wrestler who was trained by pioneering Hawaiian sumo wrestler Takamiyama and a participant of Invasion Attack born?",
        "response": "American-born",
        "source": "hotpot_qa"
    },
    {
        "query": "Kirsten Dunst was nominated for a Golden Globe Award for Best Supporting Actress for her role in Interview with the Vampire, which was based on the 1976 novel by the same name, and written by who?",
        "response": "Anne Rice",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area of the park where  Maui ‘alauahio could be found? ",
        "response": "33,265 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is larger in size, the Braque Saint-Germain or the Jack Russell Terrier?",
        "response": "Braque Saint-Germain",
        "source": "hotpot_qa"
    },
    {
        "query": "On what network does The Assistants and About a Girl air? ",
        "response": "The N",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Scandal and More Cattle, Less Bull have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country's flag features one of the national symbols, an 11-pointed maple leaf?",
        "response": "Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Minersville School District v. Gobitis and United States v. Paramount Pictures, Inc., are both related to which organization?",
        "response": "United States Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stevenage railway station and Watton-at-Stone railway station both serves which town?",
        "response": "serves the town of Stevenage in Hertfordshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "The quarterback sacked by Trey Flowers in Super Bowl LI went to what college?",
        "response": "Boston College",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both \"Scarling.\" and \"Archive\" groups which make music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "George Marshall's final film was produced by Hugh Hefner, who also publishes what magazine?",
        "response": "Playboy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer of the Bee Gees sung a middle part of a song in which the majority was sung by Barry Gibb?",
        "response": "Robin Gibb",
        "source": "hotpot_qa"
    },
    {
        "query": "The album \"Siku Ya Bibi\" was dedicated to a jazz musician known by what nickname?",
        "response": "\"Lady Day\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In between The Joy Formidable and The Lumineers which consists of Rhiannon \"Ritzy\" Bryan (lead vocals, guitar),?",
        "response": "The Joy Formidable",
        "source": "hotpot_qa"
    },
    {
        "query": "What project did an American aerospace engineer, test pilot, United States Air Force pilot, and one of the seven original astronauts, also referred to as the Original Seven or Astronaut Group 1, participate in?",
        "response": "Project Mercury",
        "source": "hotpot_qa"
    },
    {
        "query": "Roy Black, is a civil and criminal defense trial attorney, other celebrities whom Black has represented include Joe Francis, creator of what?",
        "response": "Girls Gone Wild",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is native to Africa, Cylindropuntia or Encephalartos?",
        "response": "Encephalartos",
        "source": "hotpot_qa"
    },
    {
        "query": "The group that owns the luxury watch company Longines was founded in which year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "At which school did the Emmy winning American animated television series \"Regular Show,\" which in 2011 began airing annual Halloween specials with the episode \"Terror Tales of the Park,\" first develop in the form of student films?",
        "response": "California Institute of the Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "What Victoria's Secret Angel did Anna Kaiser personal train?",
        "response": "Karlie Elizabeth Kloss",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Francisco 49er who performed backup for \"I Know What I Like\" played college footbal for the University of Southern California?",
        "response": "Ronnie Lott",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting of Death's Domain?",
        "response": "a flat disc balanced on the backs of four elephants which in turn stand on the back of a giant turtle",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Mad Girl's Love Song\" is a poem written by Sylvia Plath in which year, and was written in the villanelle poetic form and is generally included in the biographical note appended to Plath's novel, \"The Bell Jar\", and was the only novel written by the American writer and poet Platt?",
        "response": "1951",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the winter games held in which Sabastien Toutant won a silver medal?",
        "response": "Aspen, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "The person that wrote Pursuit of Honor as served as a story consultant for what television series?",
        "response": "24",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actress who appears in both of the movies, \"Warm Bodies\" and \"Hacksaw Ridge\"?",
        "response": "Teresa Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the films Barbie and the Three Musketeers and Summer Wars released in different years?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Emory University and The University of Oklahoma both from the same region of the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "S Ramachandran is an Indian film director and film journalist, and has directed the music videos with which former Australian international cricketer, who played all three formats of the game?",
        "response": "Brett Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the founder of Judi's house born?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts, Don Quichotte or Tosca?",
        "response": "Don Quichotte",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ca' Pesaro faces what major-water-traffic corridor in Venice, Italy?",
        "response": "Grand Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Una Foden confirmed as a judge for the 4th series of \"The Voice of Ireland\"?",
        "response": "October 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Craig Schlattman and Carl Reiner both do great work in front of the camera as well as writing and directing?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mayor of the municipality that Uddel is in?",
        "response": "John Berends",
        "source": "hotpot_qa"
    },
    {
        "query": "Dick Costolo was the CEO of which company before the co-founder took over in 2015?",
        "response": "Twitter",
        "source": "hotpot_qa"
    },
    {
        "query": "What Swiss agribusiness is a client of Martin Williams Advertising?",
        "response": "Syngenta",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Argentine author, who wrote a novel that was adapted into a broadway musical in 1993 with music by John Kander and Fred Ebb?",
        "response": "December 28, 1932",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novel was a 1997 thriller based on that starred an actor who played leading roles in over 50 films?",
        "response": "A Maiden's Grave",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Funnybot\" is the second episode of the fifteenth season of which American animated television series, created by Trey Parker and Matt Stone?  ",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the hotel which hosted the 37th Daytime Emmy Awards given its current name",
        "response": "July 1, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Randy Newman wrote the country song \"Feels Like Home\" for which multiple award-winning singer?",
        "response": "Linda Ronstadt",
        "source": "hotpot_qa"
    },
    {
        "query": "Cadillac's SUV for which there are no plans to create a V-Series model is built in what city and state?",
        "response": "Arlington, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the professional athlete play who was the grandson of the man who designed the Los Angelos Rams Logo?",
        "response": "left fielder",
        "source": "hotpot_qa"
    },
    {
        "query": "Korn released a compilation album on May 9, 2006, which features a hidden track, from the soundtrack for the 1997 American slasher film written by who?",
        "response": "Kevin Williamson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian feminist protest punk rock group includes Nadezhda Andreyevna Tolokonnikova?",
        "response": "Pussy Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "Great River is a station that is located in what New York town?",
        "response": "Islip",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is known for his film \"Le Monde du silence\": Clarence Brown or Louis Malle?",
        "response": "Louis Marie Malle",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Prológica CP-400 and Atari ST both personal computers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reigned over Duchy of Saxe-Coburg and Gotha from 1844 to his death, and was married to Princess Alexandrine of Badin?",
        "response": "Ernest II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 2005 American science fiction-thriller film directed by Michael Bay, that starred an American actor who is best known for his work in television series such as \"The Sopranos\"?",
        "response": "The Island",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of In the Sun also worked with what other famous artists?",
        "response": "Depeche Mode and U2",
        "source": "hotpot_qa"
    },
    {
        "query": "Im Not Ashamed is a biographical drama film, based on what massacre involving two American spree killers Eric Harris and Dylan Klebold, who killed 13 people and wounded 24 others? ",
        "response": "1999 Columbine High School massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university is considered a public research university, Columbia University of Virginia Commonwealth University?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the composer of the studio album \"on the rock\" and a Grammy award winner?",
        "response": "Andrés Calamaro",
        "source": "hotpot_qa"
    },
    {
        "query": "Which weekly guest on the program New York Week in Review was born in 1972 ?",
        "response": "Elizabeth Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "Name an award that was given to one of the singers of the film Young Malang who belongs to the Patiala Gharana lineage.",
        "response": "President's Pride of Performance civil award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the present role of the man Claude Mongeau succeeded as President and Chief Executive Officer of Canadian National Railway ?",
        "response": "CEO of CSX",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 71st Golden Globe Awards for television in 2013, what achievement did Breaking Bad, police sitcom Brooklyn Nine-Nine and American Hustle attain?",
        "response": "multiple awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard James Gardner, is an American professional football player, he played three seasons in the National Football League for which professional American football team based in Nashville, Tennessee, and previously known as the Houston Oilers, the team began play in 1960 in Houston, Texas, as a charter member of the American Football League (AFL)?",
        "response": "Tennessee Titans",
        "source": "hotpot_qa"
    },
    {
        "query": "What non-profit organization was co founded by the owner of the UC3 Nautilus?",
        "response": "Copenhagen Suborbitals",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the songwriter for \"The Lion and the Cobra\" and also recorded at The Lodge?",
        "response": "Sinéad O'Connor",
        "source": "hotpot_qa"
    },
    {
        "query": "Jorge Julio López disappeared after testifying against the Argentine police officer who worked in what force during the 1970s?",
        "response": "Buenos Aires Provincial Police",
        "source": "hotpot_qa"
    },
    {
        "query": "Which supporting actor in Luck by Chance was born on 10 January 1974 ?",
        "response": "Hrithik Roshan",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music is this musician who composed the soundtrack for \"Niruttara\" (2006) specialized in?",
        "response": "Indian classical and fusion",
        "source": "hotpot_qa"
    },
    {
        "query": "Stuart Chambers succeed what British businessman as chairman of Anglo American plc from 1 November 2017?",
        "response": "Sir John Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a British film director who worked for Hammer Films, Terence Fisher or Bruce Dellis ?",
        "response": "Terence Fisher",
        "source": "hotpot_qa"
    },
    {
        "query": "Björn Ulvaeus was a part of a Swedish pop group, formed in Stockholm in 1972, as well as co-producer on the film \"Mamma Mia!\" with who?",
        "response": "Benny Andersson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city has more population, Shihezi or Yinchuan?",
        "response": "Yinchuan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer wrote the books \"Intelligent Design: The Bridge Between Science and Theology\", and \"The Design Inference: Eliminating Chance through Small Probabilities\"?",
        "response": "William A. Dembski",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the producer of Holiday Showdown?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star in Beneath the Valley of the Ultra-Vixens is a Mexican American film actress, exotic dancer, and porn star?",
        "response": "Kitten Natividad",
        "source": "hotpot_qa"
    },
    {
        "query": "What chess champion who holds the records for consecutive professional tournament victories (15) was featured in the World Chess Championship 1984?",
        "response": "Garry Kasparov",
        "source": "hotpot_qa"
    },
    {
        "query": "The Missionary is a 1982 British comedy film starring Maggie Smith and an actor that was a member of what comedy group?",
        "response": "Monty Python",
        "source": "hotpot_qa"
    },
    {
        "query": "In between University of Michigan and Universidade Positivo which one was moved to Ann Arbor in 1837?",
        "response": "The University of Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "What short lived aircraft, produced for the United States Air Force, is based on a fighter plane armed with four 20 mm cannons?",
        "response": "Northrop F-15 Reporter",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Sioux Gateway Airport and Jack Brooks Regional Airport located in Texas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What were additional names for the Back-to-Africa movement pioneered by Alfred Charles Sam?",
        "response": "Colonization movement or Black Zionism",
        "source": "hotpot_qa"
    },
    {
        "query": "What pivotal event in the Texas Revolution occurred between February 23 and March 6, 1836 and involved Damacio Jiménez serving under Juan Seguín?",
        "response": "Battle of the Alamo",
        "source": "hotpot_qa"
    },
    {
        "query": "are Taksim Gezi Park and Adam Mickiewicz Museum, Istanbul the same type of attraction",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Sabueso Español and Galgo Español suitable dogs for domestic pets?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is located in Pooneryn, adjacent to the Jaffna Peninsula and was captured by  a governorate established in present-day Sri Lanka by the Dutch East India Company?",
        "response": "Pooneryn Fort",
        "source": "hotpot_qa"
    },
    {
        "query": "The Professional Basketball Club LLC is an investment group headed by who, which American businessman and chairman of the Professional Basketball Club LLC, the ownership group of the Oklahoma City Thunder, an NBA franchise formerly known as the Seattle SuperSonics?",
        "response": "Clayton Ike Bennett",
        "source": "hotpot_qa"
    },
    {
        "query": "Dyess Air Force Base is close to a major city with what population size?",
        "response": "117,063",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Evans photographed the wedding of what American actress, producer, and businesswoman born in 1969?",
        "response": "Jennifer Aniston",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Time's Up! and Ashta Chamma bot entities in the same genre of home entertainment? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Calothamnus and Grewia belong to the same genus?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the university where Samuel Scheibler was the director of religion and culture founded in?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pittsburgh Maulers' most prominent player picked during the 1984 USFL draft was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Randy Couture and Conor McGregor are member of which group?",
        "response": "Ultimate Fighting Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Germany's best selling breweries also sponsors one of the 21 regional football cups?",
        "response": "Krombacher Brauerei",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Buck's nephew was the recipient of the National Sportscaster of the Year award how many times?",
        "response": "three-time",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of Barbra Streisand's son?",
        "response": "Emanuel",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the fairy tale of which the plot of \"Tears Were Falling\" can be viewed as a modern interpretation first published?",
        "response": "1844",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2012 movie did the actress who portrayed Dr. Nikki Alexander star in?",
        "response": "Suspension of Disbelief",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Barton Mine or Beanland Mine located closer to Temagami?",
        "response": "Barton Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "What region of Italy did Giovanni Giarola paint in?",
        "response": "Emilia-Romagna",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Goldy is a guitarist in what American heavy metal band that was formed in 1982?",
        "response": "Dio",
        "source": "hotpot_qa"
    },
    {
        "query": "The lead of the CBS series \"I Had Three Wives\" played what role in \"Godspell\"?",
        "response": "Jesus",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1992–93 NBA season was which number season for the Charlotte Hornets in the National Basketball Association, the Hornets selected with Muggsy Bogues?",
        "response": "fifth",
        "source": "hotpot_qa"
    },
    {
        "query": "Stan Lee's Mutants, Monsters & Marvels, released in which year, is an American documentary film produced by Creative Light Entertainment, the two talk about Lee's life, his marriage with Joan Boocock Lee, was a British-American hat model and voice actress?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Knight was drafted by a team founded in which year ?",
        "response": "1898",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is located in Maine, Sacramento International Airport or Knox County Regional Airport?",
        "response": "Knox County Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original product of the company which owned the Realistic brand?",
        "response": "leather goods",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was Roger Leonard's brother?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The remaining two seasons of Kenan & Kel were filmed at which stage facility located at 6230 Sunset Boulevard in Hollywood, California?",
        "response": "Nick on Sunset",
        "source": "hotpot_qa"
    },
    {
        "query": "Joel Hamling made his debut against Greater Western Sydney at a multi-purpose sports and entertainment stadium who had what working name when construction started in October, 1997?",
        "response": "Victoria Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2007 film Jin Ji-hee was in?",
        "response": "Yim Pil-sung",
        "source": "hotpot_qa"
    },
    {
        "query": "The film \"Dirty Work\" stars Norm McDonald, Jack Warden, Traylor Howard and a man that made his stand up comic debut in what year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Yash Johar founded an Indian production and distribution company that was taken over in 2004 by who?",
        "response": "Karan Johar",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played the male lead in a teen comedy about a high school nerd directed by Steve Rash? ",
        "response": "Patrick Dempsey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which charitable trust owns and maintains the bridge next to the City of London School?",
        "response": "Bridge House Estates",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1949 British black comedy film does the Skindles hotel appear on? ",
        "response": "Kind Hearts and Coronets",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the majority of Sylheti language speakers located?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "The head coach of a football team that plays their home games at Gibbs Stadium represents a college with an enrollment of how may students?",
        "response": "1,550",
        "source": "hotpot_qa"
    },
    {
        "query": "John Joseph O'Neill was part of the 1937 Pulitzer-winning team along with which Jewish-Lithuanian-American journalist?",
        "response": "William Leonard Laurence",
        "source": "hotpot_qa"
    },
    {
        "query": "On VH1's Top 40 Videos of the Year, since 2002 twelve videos have been named Video of the Year, including what \"Bleeding Love\" singer, who was born and raised in the London Borough of Islington, London, where she attended the BRIT School for Performing Arts and Technology?",
        "response": "Leona Lewis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the the coming-of-age drama released in 2006 which stars one of the co-starring actors of British thriller film Tower Block?",
        "response": "This Is England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the movie that srarred Stev McQueen in the orignal, and Pierce Brosnan in the remake?",
        "response": "The Thomas Crown Affair",
        "source": "hotpot_qa"
    },
    {
        "query": "Salutation was a modern dance solo choreographed by Martha Graham whose style, known as what, reshaped American dance and is still taught worldwide?",
        "response": "the Graham technique",
        "source": "hotpot_qa"
    },
    {
        "query": "Christian Broda served as Minister of Justice under which Chancellor of Austria who previously served as Foreign Minister? ",
        "response": "Bruno Kreisky",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Are We in Trouble Now\" was performed by what baritone country singer?",
        "response": "Randy Travis",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacksonville station serves the passenger train that has been in continuous operation since what year?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Best known for his World Wrestling Entertainment appearances, Charlie Haas and what other major wrestler formed the World's Greatest Tag Team?",
        "response": "Shelton Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of institution does Danny Watkins and 2010 Baylor Bears football team have in common?",
        "response": "University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor and former fashion model, known for his role as the titular superhero of the 2006 film \"Superman Returns\" also starred in a 2016 Chinese action film alongside Zhang Yuqi?",
        "response": "Brandon James Routh",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the actor who played the cop in Satyam study when he attended Loyola College, Chennai?",
        "response": "Visual Communications",
        "source": "hotpot_qa"
    },
    {
        "query": "who has played more instrument Built to Spill or Republica?",
        "response": "Republica",
        "source": "hotpot_qa"
    },
    {
        "query": "The New Year Honours 1961 were appointments by many of the Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries, which type of location is a sovereign state that is a member of the Commonwealth of Nations and shares the same person, currently Elizabeth II, as its head of state and reigning constitutional monarch, but retains a crown legally distinct from the other realms?",
        "response": "Commonwealth realm",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor born in 1951 starred in Aaj Ka Robin Hood?",
        "response": "Nana Patekar",
        "source": "hotpot_qa"
    },
    {
        "query": "Palentown is a hamlet in a county named for a province of what nationality?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Mucuna or Platycarya",
        "response": "Mucuna",
        "source": "hotpot_qa"
    },
    {
        "query": "What is featured on the album cover of the best-selling 12\" signle of all time?",
        "response": "5.25-inch disk",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that makes the MP5 firearm primarily located?",
        "response": "Baden-Württemberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What criminal case which convicted Brock Allen Turner of three counts of felony sexual assault did Michele Landis Dauber work as attorney on?",
        "response": "People v. Turner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary is older, Hacking Democracy or Raw Opium?",
        "response": "Hacking Democracy",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Twin Tin Bots and Star Wars Epic Duels are what type of games?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Breathe (2 AM)\" is a song by which American singer-songwriter, the song was featured prominently in shows such as Charmed, an American WB TV series, created by Constance M. Burge and produced by Aaron Spelling and his production company Spelling Television?",
        "response": "Anna Nalick",
        "source": "hotpot_qa"
    },
    {
        "query": "what Florida based band shares a member with the band Tremonti?",
        "response": "Alter Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Look At Us Now\" is a song by American DJs based in which city ?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2000 ad movie was produced by Sam Mercer and directed by M. Night Shyamalan?",
        "response": "Unbreakable",
        "source": "hotpot_qa"
    },
    {
        "query": "Which historic port is in the far south west of the state of New South Wales and is home of the paddle steamer \"Ruby\"?",
        "response": "Wentworth, New South Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the director of King of the Dancehall born?",
        "response": "October 8, 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "What mountain range is associated with Kittanning Run and Allegheny Front?",
        "response": "Appalachian",
        "source": "hotpot_qa"
    },
    {
        "query": "What military award did the solider who the USS Basilone was named after recieve posthumously?",
        "response": "the Navy Cross",
        "source": "hotpot_qa"
    },
    {
        "query": "Is director Laura Neri of the same nationality that actress Susan Oliver was?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Williams FW33 was a Formula One racing car developed by Williams F1, it was driven by  rookie driver Pastor Maldonado, a Venezuelan professional racing driver, who competed in which sports organization?",
        "response": "Formula One",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer is older, Alessandro Baricco or Patrick White?",
        "response": "Patrick Victor Martindale White",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom's Rhinoplasty, is the eleventh episode, in the first season of which animated television series?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the location of the organization that recognizes the work of Roger McGuinn with the Byrds?",
        "response": "Cleveland, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "Blue Dream Media is know for following what American basic cable, internet and satellite business?",
        "response": "CNBC",
        "source": "hotpot_qa"
    },
    {
        "query": "What college teamdid the point guard that led the way for Philedlphia 76ers in the 2017-18 season play basketball in?",
        "response": "Washington Huskies",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Saint Michael Academy is a member of the athletic association made up of high schools in what area?",
        "response": "New York City, Long Island, and Westchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is blamed by Tacitus for provoking a queen of the Celtic Iceni tribe?",
        "response": "Catus Decianus",
        "source": "hotpot_qa"
    },
    {
        "query": "Josey Scott and Ian Watkins were both promising musicians. Which of these talented men was incarcerated, impacting his career with a rock band?",
        "response": "Lostprophets disbanded in 2013 after Watkins was charged with sexual offences in late 2012.",
        "source": "hotpot_qa"
    },
    {
        "query": "Meg Johnson is an American poet and lecturer, her poems have appeared in numerous literary magazines, including which American online magazine that publishes poetry, flash fiction, short stories, novel excerpts, creative nonfiction, reviews, and interviews?",
        "response": "Word Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress is \"Beyond Rangoon\" was also in \"True Romance\" and \"Ed Wood?\"",
        "response": "Patricia Arquette",
        "source": "hotpot_qa"
    },
    {
        "query": "Ironman is the debut solo album by American rapper Ghostface Killah, released on October 29, 1996, by Epic Records, it was produced by Robert Fitzgerald Diggs, better known by his stage name RZA ( \"rizza\"), is an American rapper, record producer, musician, actor, filmmaker and author, born on which date?",
        "response": "July 5, 1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Warriors' Path State Park is named for a network of trails in eastern North America that was used by Native Americans who ran through where?",
        "response": "Great Appalachian Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Kirk Douglas starred in the 1955 movie The Indian Fighter, after his debut in The Strange Love of Martha Ivers in what year?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of finanical assistance is available to the students of the co-educational university that was defeated by the 1910 Detroit Titans football team?",
        "response": "private financial assistance",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the resident population of the town that is located north of the Goldfield Hills in 2010?",
        "response": "268",
        "source": "hotpot_qa"
    }
]