[
    {
        "query": "The Loner was recorded by the singer who gained fame as a member of what group?",
        "response": "Bee Gees",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company founded by ex-Black Isle employees developed the game Neverwinter Nights?",
        "response": "Obsidian Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "What school did the author of \"2016: Obama's America\" hold the role of president of from 2010 to 2012?",
        "response": "The King's College",
        "source": "hotpot_qa"
    },
    {
        "query": "Founding Partner and Chief Executive Officer of Windham Capital Management, LLC, Mark Kritzman, teaches a graduate finance course at a business school located where?",
        "response": "Cambridge, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "What national team does the winner of the 2016-17 Crystal Palace Football Club Player of the Year represent?",
        "response": "Ivory Coast",
        "source": "hotpot_qa"
    },
    {
        "query": "Nobel Biocare is stationed next to an airport known as Kloten Airport, what is the airport?",
        "response": "Zürich Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player is from a country closer to New Zealand, Maria Sharapova or Mark Woodforde?",
        "response": "Mark Raymond Woodforde",
        "source": "hotpot_qa"
    },
    {
        "query": " What years did the team that inspired the film Cool Runnings fail to qualify for the Winter Olympics?",
        "response": "2006 and 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "What  battle of the Civil War involved the largest number of casualties of the entire war and is often described as the war's turning point, Second Battle of Bull Run or Battle of Gettysburg?",
        "response": "Battle of Gettysburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Disconnection is a tenet in the belief system started by what author?",
        "response": "L. Ron Hubbard",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathie Pelletier (born 1953) is an award-winning novelist and songwriter who was born and raised in which rural town in Aroostook County, Maine?",
        "response": "Allagash",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Octane and Mischa Barton  have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Yong-soo was a woman who worked in the industry that was instigated by what group?",
        "response": "Imperial Japanese Army",
        "source": "hotpot_qa"
    },
    {
        "query": "which American hard rock band has songs that have been covered by Racer X, Fu Manchu, The Smashing Pumpkins, Sebastian Bach and Fighting Gravity? ",
        "response": "Blue Öyster Cult",
        "source": "hotpot_qa"
    },
    {
        "query": "Frankenstein's Monster is based on a character created by an English novelist born in what year?",
        "response": "1797",
        "source": "hotpot_qa"
    },
    {
        "query": "Which creator of The Bugle is known for his use of extended pun runs?",
        "response": "Andy Zaltzman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish Unionist politician was elected unopposed as Member of parliament for South Tyrone in 1916 as part of the Ulster Unionist Party?",
        "response": "William Coote",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the publisher group that is based in Stamford, Lincolnshire, England, that publishes a bi-monthly, aviation magazine?",
        "response": "Key Publishing",
        "source": "hotpot_qa"
    },
    {
        "query": " ROH 13th Anniversary Show took place at a hotel and casino owned by what company?",
        "response": "Boyd Gaming",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Víctor García and Jim Morrison considered songwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the former high school located by a now closed air base near Limestone and Caribou in Aroostook County, Maine?",
        "response": "Limestone High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Chungking Mansions is a building located at 36–44 Nathan Road in Tsim Sha Tsui, Kowloon, Hong Kong, the unusual atmosphere of the building is sometimes compared to that of the former Kowloon Walled City, Kowloon Walled City was a largely-ungoverned densely-populated settlement in Kowloon City in which region?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the American animated television series based on the \"Spider-Man",
        "response": "Eric Radomski",
        "source": "hotpot_qa"
    },
    {
        "query": "In Greek mythology, Pyrrhus is the grandson of what immortal nereid?",
        "response": "Thetis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Martin Heidegger or Lydia Davis?",
        "response": "Martin Heidegger",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the founder of the dance group Not Your Ordinary Tappers born?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's song \"In the Closet\" was released on November 26, 1991 by Epic Records?",
        "response": "Michael Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Indian professional badminton player defeated by Carolina Marín in Olympics gold medal in women's singles at the 2016 Rio Olympics born? ",
        "response": "5 July 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the movie Aron Warner won an Academy Award for Best Animated Feature for come out?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cathedral was established or dedicated first, Chelmsford Cathedral or Cathedral of St John the Evangelist, Portsmouth?",
        "response": "The Cathedral Church of St John the Evangelist",
        "source": "hotpot_qa"
    },
    {
        "query": "Keannekeuk was known as a prophet and spiritual leader of what Algonquian-speaking Native American people?",
        "response": "the Kickapoo",
        "source": "hotpot_qa"
    },
    {
        "query": "Kresy, which roughly was a part of the land beyond the so-called Curson Line, was drawn for what reason?",
        "response": "demarcation line between the newly emerging states, the Second Polish Republic, and the Soviet Union",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does Jaros, Baum & Bolles and Willis Tower have in common?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Golden State NBA player, who was part of the Cavaliers-Warriors rivalry, named NBA Finals Most Valuable Player?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What Hong Kong actor born in 1980 will star in \"Heart and Greed\"?",
        "response": "Bosco Wong Chung-chak",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the television station, on which \"Za Pakhtoon Yum\" originally aired, launched?",
        "response": "July 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What British rock band released the album Brothers in Arms in 1985 which also featured a song with the same title?",
        "response": "Dire Straits",
        "source": "hotpot_qa"
    },
    {
        "query": "How many districts is Obogu a village in?",
        "response": "27",
        "source": "hotpot_qa"
    },
    {
        "query": "For who was the air force base where the 834th Airlift Division held its last assignment named?",
        "response": "Lieutenant Colonel Horace Meek Hickam",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor in the film adaptation of a novel by Hunter Davies and the film \"This, That and the Other\" born?",
        "response": "21 May 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the 82nd Airborne Division defeated Republican U.S. Senator David Vitter?",
        "response": "John Bel Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation did Modest Mussorgsky and Carl Maria von Weber share?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "According to a British tabloid founded in 1903, how many signatures were collected for a petition from the Snowdrop Campaign to ban ownership and use of handguns?",
        "response": "it gained over 50,000 signatures",
        "source": "hotpot_qa"
    },
    {
        "query": "in the 1979–80 NBA season, Philadelphia 76ers acquired a guard from the Portland Trail Blazers who has recently served as a head coach of which NBA team ?",
        "response": "the Brooklyn Nets",
        "source": "hotpot_qa"
    },
    {
        "query": "Which monarch was imprisoned in Scotland?",
        "response": "Mary, Queen of Scots was imprisoned here in 1567–1568",
        "source": "hotpot_qa"
    },
    {
        "query": "What private university in Georgia owns and operates a television station licensed to Warner Robins?",
        "response": "Mercer University",
        "source": "hotpot_qa"
    },
    {
        "query": "Phyllis Kohn holds a seat in the House of Representatives which meets where?",
        "response": "Saint Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "Formerly titled the Collegiate Church of St Peter at Westminster, of which church was John Fecknam the last abbot?",
        "response": "Westminster Abbey",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many terms was this Indiana State Senate senator and Chief Justice of the Supreme Court of Indiana elected in the Indiana State Senate after whom the Howard Park Historic District is named?",
        "response": "two terms",
        "source": "hotpot_qa"
    },
    {
        "query": "Wilhelm Wiegand is best known for and his publications involving a man that was King of Prussia beginning in what year?",
        "response": "1740",
        "source": "hotpot_qa"
    },
    {
        "query": "How many meta states does the first isotope to be synthesized in Am in 1944 have?",
        "response": "one",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the official name of the tower, previously known as Clock Tower, next to which a proposed Thames Airport was to be built in the 1930s?",
        "response": "Elizabeth Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is a quarterly journal of folk music: Country Living or Sing Out!?",
        "response": "Sing Out!",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the actors in the film Dhruva Natchathiram was awarded an Honorary Doctorate by the People's University of Milan in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the co-author, with Daniel Freedman, of the comic book series Undying Love ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The 22nd, 24th and 28th Presidents of the United States were members of which mainstream political party?",
        "response": "Democratic Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession was both John Updike and Bret Easton Ellis ?",
        "response": "short story writer",
        "source": "hotpot_qa"
    },
    {
        "query": "Six Flying Dragons is a series that stars which actor who had a supporting role in Pinocchio?",
        "response": "Yoon Kyun-sang",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case took place first, Bolling v. Sharpe or Romer v. Evans?",
        "response": "Bolling v. Sharpe",
        "source": "hotpot_qa"
    },
    {
        "query": "Duke is a fictional character who is portrayed by an actor who made his film debut in what 2005 film?",
        "response": "Coach Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the mascot of the oldest private university in Georgia?",
        "response": "The Bears",
        "source": "hotpot_qa"
    },
    {
        "query": "what historical drama film based on a Giles Folden novel landed Alex Heffas the Golden Globe Award for Best Original Score?",
        "response": "The Last King of Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "in the 1975–76, Seattle SuperSonics lost to a team based in which US state ?",
        "response": "Arizona",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Jack Rabbit and Leap-The-Dips made of?",
        "response": "wooden",
        "source": "hotpot_qa"
    },
    {
        "query": "This American stand-up comedian starred in a movie depicting a mother and daughter who are abducted while on vacation in what country?",
        "response": "South America",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Hot Hot Hot!!!\" is a song from an album released in which year ?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Buy Bye Beauty and South of the Border, share which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "The Festning Tunnel runs under what type of structure?",
        "response": "a medieval castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer did the star of American Son marry in 2008?",
        "response": "Mariah Carey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University was founded first University of Chicago or New York University ?",
        "response": "University of Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Austrian-born American celebrity chef, restaurateur, occasional actor, and owner of Wolfgang Puck Companies was a patron of a farm in what town?",
        "response": "Rancho Santa Fe, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The End of the Innocence was a single by which former member of the Eagles?",
        "response": "Donald Hugh Henley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2013 Australian drama film in which the actress, who played the role of Alice in Tim Burton's \"Alice in Wonderland\", starred?",
        "response": "John Curran",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast in 2012 American comedy film written and directed by Coley Sohn, was born, April 10, 1988?",
        "response": "Haley Joel Osment",
        "source": "hotpot_qa"
    },
    {
        "query": "The schmaltrum turret could be found on what tanks other than the Panzerkampfwagen IV?",
        "response": "B Panther II medium tank, Panther A and G medium tank",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the portmanteau of \"snow\" and \"ice\" used in the construction of temporary hotels made up of snow and sculpted blocks of ice?",
        "response": "snice",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Montana county can you find St. Benedict's Catholic School?",
        "response": "Musselshell County",
        "source": "hotpot_qa"
    },
    {
        "query": "The founder of modern utilitarianism influenced a cuban from which art collective?",
        "response": "Los Carpinteros",
        "source": "hotpot_qa"
    },
    {
        "query": "Tropicana Country Club is located across from a hotel and casino that is owned and operated by Penn National Gaming, and is a franchise of what chain?",
        "response": "Hilton's DoubleTree",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bill Forsyth and Juan Escobedo both award-winning actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What punk rock band using horror film imagery was an influence on the Swedish band Entombed?",
        "response": "Misfits",
        "source": "hotpot_qa"
    },
    {
        "query": "Which famed Mexican cartoon character was created in 1943, and Sixto Valencia Burgos later took over the responsibility for drawing?",
        "response": "Memín Pinguín",
        "source": "hotpot_qa"
    },
    {
        "query": "Ylem was a term used by the physicist who was a developer of the theory credited to whom?",
        "response": "Lemaître",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the complex uses a corporate organization in which its supply chain is totally owned by the company located?",
        "response": "Dearborn, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was first elected as the Member of Parliament for Crewe and Nantwich at the 2008 by-election, but was defeated by a British Labour Party politician who was elected as the Member of Parliament at the 2017 general election?",
        "response": "Anthony Edward Timpson",
        "source": "hotpot_qa"
    },
    {
        "query": "What song originally released by an American rock band active in the late 1960's and early 1970's did The Reels do a cover of in 1986?",
        "response": "\"Bad Moon Rising\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress plays Suren on Being Human and Katya Kinski on Neighbours?",
        "response": "Dichen Lachman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the meaning of the name of Daniel Quigley's home town?",
        "response": "\"oak grove\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American business magnate, investor, and philanthropist, who is featured in the documentary Nobody Speaks: Trials of the Free Press, regarding his secret purchase of the Las Vegas Review Journal?",
        "response": "August 4, 1933",
        "source": "hotpot_qa"
    },
    {
        "query": "Gabriel Knight: Sins of the Fathers, is a 1993 point-and-click adventure game written, designed, and directed by Jane Jensen, its CD-ROM version includes voice-acting by stars including which American actor and voice artist who is known for his role as the Klingon Worf, in the \"Star Trek\" franchise?",
        "response": "Michael Dorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Karwei is a chain Dutch shops that are sometimes known as what?",
        "response": "DIY stores",
        "source": "hotpot_qa"
    },
    {
        "query": "2006 GP2 Series season was won by a man that won his first World Championship title in what year?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is in the pop genre, Capital Cities or Tweaker?",
        "response": "Capital Cities",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the interviewee in an interview arranged by a co-founder of the the \"Sturmabteilung\" for British journalist Sefton Delmer in 1931?",
        "response": "Adolf Hitler",
        "source": "hotpot_qa"
    },
    {
        "query": "What publication did write Tim Rogers write for between January 1995 and January 2002?",
        "response": "Next Generation",
        "source": "hotpot_qa"
    },
    {
        "query": "What Northern Irish comic stars in the 2017 film Jawbone with Johnny Harris, Ray Winstone, and Ian McShane?",
        "response": "Michael Smiley",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Frühlingsstimmen\" was written by a composer known by what nickname?",
        "response": "\"The Waltz King\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What rifle is the basis for the the magazine-fed, gas-operated semi-automatic rifle designed to be manufactured with the extensive use of aluminum alloys and synthetic materials?",
        "response": "United States military M16 rifle",
        "source": "hotpot_qa"
    },
    {
        "query": "Anders Morgenthaler and Max Neufeld are both what?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "German economist Anita Bose Pfaff and Emilie Schenkl are both immediate family members of what major leader of Indian nationalism?",
        "response": "Subhas Chandra Bose",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actors starred in \"Apollo 18\" was born in November 1975?",
        "response": "Warren Christie",
        "source": "hotpot_qa"
    },
    {
        "query": "A New Theory of the Earth was written by what English theologian?",
        "response": "William Whiston",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Casey was a part of what some consider to be the best recruiting class in UK history which included a player who named an All American how many times?",
        "response": "twice",
        "source": "hotpot_qa"
    },
    {
        "query": "What bar hosted the hen night of the bride who married the Duke of Cambridge in 2011?",
        "response": "68–86 Bar and Restaurant",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the actors from the web series Red Bird is also known for what character in the popular television show Seinfeld?",
        "response": "Kramer's caddy Stan",
        "source": "hotpot_qa"
    },
    {
        "query": "Desmia ploralis is found in what country in Central America that is a representative democracy, and whose capital and largest sity is Nueva Guatemala de la Asuncion?",
        "response": "Guatemala",
        "source": "hotpot_qa"
    },
    {
        "query": "OPPO Digital shares the brand name with the companies owned by what Chinese multinational?",
        "response": "BBK Electronics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-wrote the song with Eminem featured in the movie \"8 Mile\" that was released on October 28, 2002, as the lead single from the soundtrack?",
        "response": "Jeffrey \"Jeff\" Bass",
        "source": "hotpot_qa"
    },
    {
        "query": "What river is near both Indiana Army Ammunition Plant and Charlestown State Park?",
        "response": "Ohio River",
        "source": "hotpot_qa"
    },
    {
        "query": "Wymering Manor is a Grade II* listed building, which is the oldest in the city of Portsmouth, England, and was the manor house of Wymering, it became the property of King William the Conqueror, after which event that was fought on 14 October 1066 between the Norman-French army of William, the Duke of Normandy, and an English army under the Anglo-Saxon King Harold Godwinson, beginning the Norman conquest of England?",
        "response": "Battle of Hastings",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the occupation of  the man best known for his research on human osteology and human decomposition, who is the founder of  a research facility where decomposition can be studied in a variety of settings?",
        "response": "forensic anthropologist",
        "source": "hotpot_qa"
    },
    {
        "query": "The Raid on Alexandria was a British victory during the War of 1812, but by delaying the British forces may have contributed to the heavy causalities on them in which sea/land battle fought later that year?",
        "response": "Battle of Baltimore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one, Spoon or Iamamiwhoami, is the electronic music and audiovisual project of Swedish musician and singer-songwriter Jonna Lee?",
        "response": "iamamiwhoami",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Dante DiMartino and Cyma Zarghami are developing a new series for which network?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "How was the man investigated by Keith Beauchamp killed?",
        "response": "lynched",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the serial killer that was interviewed in the Spider and the Fly?",
        "response": "Kendall Francois",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times is magazine, for which Lillian Ross was a staff writer, published annually ?",
        "response": "47 times",
        "source": "hotpot_qa"
    },
    {
        "query": "What party does the person that represents Stoke Newington Central belong to?",
        "response": "British Labour Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the driver who finished second in the 2008 British Grand Prix ?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Maxwell Braden \"Max\" Mittelman is a voice actor whose roles have in included a charcter who  has grown bored by the absence of challenge in his fight against evil and seeks to find what?",
        "response": "a worthy opponent",
        "source": "hotpot_qa"
    },
    {
        "query": "The musician who wrote \"Man of the Hour\" also appeared as a guest vocalist in what Andrew Wood tribute band?",
        "response": "Temple of the Dog",
        "source": "hotpot_qa"
    },
    {
        "query": "When was one of the co founder of  GF Biochemicals born who was also a a French professional footballer?",
        "response": "7 March 1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Who appeared as Makepeace's neighbour in a 1998 American romantic period comedy-drama film directed by John Madden?",
        "response": "John Ramm",
        "source": "hotpot_qa"
    },
    {
        "query": "Under whose administration does the National Wildlife Refuge, which is located in an island that hosted the Naval Air Facility Midway Island, falls?",
        "response": "United States Fish and Wildlife Service",
        "source": "hotpot_qa"
    },
    {
        "query": "What American regional sports cable and satellite television network does American television sports personality Charlie Moore host two shows on?",
        "response": "NESN (New England Sports Network)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musical starring Tommy Abbott is also inspired by William Shakespeare's play \"Romeo and Juliet\"?",
        "response": "West Side Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Eileen Heckart star in three years before The Bad Seed?",
        "response": "\"Picnic\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Heyman co-wrote the 2010 film directed by whom?",
        "response": "Darren Aronofsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Winter formal, also called Winterfest, Winter Ball, Sweethearts, Snow Ball, or Queen of Hearts Dance, is a dance held by high schools in the United States and Canada, at some schools, this dance may supplement or replace which informal dance sponsored by a high school, middle school or college, in which female students invite male students?",
        "response": "Sadie Hawkins Dance",
        "source": "hotpot_qa"
    },
    {
        "query": "What weekly British conservative magazine favorably reviewed Hirohito’s War?",
        "response": "The Spectator",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the song released that is considered the B side on the album \"Nevermind?\"",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Rickman is an American film director and screenwriter known for a biographical film which tells the story of what country music singer? ",
        "response": "Loretta Lynn",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2016 population of the state where the majority of the San Luis Valley is located? ",
        "response": "5,540,545",
        "source": "hotpot_qa"
    },
    {
        "query": "The most recent person to win the Crystal Palace F.C. Player of the Year for the second time is a footballer who was born in what year?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "How many rooms has the hotel which hosted EVO2014 ?",
        "response": "2,956",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonas Nyrén and Tilo Wolff both have what profession?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What three letter abbreviation is the college where Chrissy Roberts is head coach commonly referred to by?",
        "response": "EKU",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the album released for which the song \"Burn\" was originally recorded?",
        "response": "12 October 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "What Austrian-British biographer, historian, and investigative journalist's book Albert Speer: His Battle with Truth\" was the basis for the 2000 play Albert Speer?",
        "response": "Gitta Sereny",
        "source": "hotpot_qa"
    },
    {
        "query": "During which war was the boat built which is on display at a museum in Oregon and was constructed at a city in the \"Silicon Beach\"?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Romanian writer wrote the short story, \"Ivan Turbincă\"?",
        "response": "Ion Creangă",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died first, Edward Yang or Anthony Asquith?",
        "response": "Anthony Asquith",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Bannon is the executive chairman of a website founded by who ?",
        "response": "Andrew Breitbart",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the husband of Duchess Victoria do for a living? ",
        "response": "European Parliament (1984–1989)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is a German-style board game, Medici or Titan?",
        "response": "Medici",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Meet the Patels and Up Series books?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Breakable You is a book that was made into a movie staring what actor who is also known for roles in Raiders of the Lost Ark and Enchanted April?",
        "response": "Alfredo \"Alfred\" Molina",
        "source": "hotpot_qa"
    },
    {
        "query": "The album The Last Days of Pompeii is about rocket scientist Wernher von Braun traveling back to what volcano located on the Gulf of Naples in Campania, Italy?   ",
        "response": "Mount Vesuvius",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther west, Luna or Janet Gardner?",
        "response": "Janet Patricia Gardner",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the mother of Joseph Ferdinand Leopold of Bavaria die?",
        "response": "1692",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more members Talking Heads or Kings of Convenience?",
        "response": "Talking Heads",
        "source": "hotpot_qa"
    },
    {
        "query": "How many children does this novel by Stephen King center around that along with \"Insomnia\" and \"Dreamcatcher\" takes place in a fictional town Derry, Maine?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the English zoo owner that founded The Aspinall Foundation born? ",
        "response": "11 June 1926",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which Tico Wells played Dexter Williams?",
        "response": "Mira Nair",
        "source": "hotpot_qa"
    },
    {
        "query": "What film that \"H. G. Wells' The Shape of Things to Come\" tried to capitalize on was directed by George Lucas? ",
        "response": "\"Star Wars\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former Wachovia Building know as now in city where the William Allen Blair House is located at in North Carolina?",
        "response": "Wells Fargo Center",
        "source": "hotpot_qa"
    },
    {
        "query": "How far from Los Angeles International Airport was Live Concert at the Forum recorded?",
        "response": "three miles",
        "source": "hotpot_qa"
    },
    {
        "query": "This Republican who currently represents New York District 19 in the United States House of Representatives was born in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the architectural design of the cathedral that contains 500 sculptures by Jay Hall Carpenter?",
        "response": "Neo-Gothic",
        "source": "hotpot_qa"
    },
    {
        "query": "What region in New South Wales is known for is covered by the Roman Catholic Diocese of Wollongong and is under the local government area of the Wingecarribee Shire?",
        "response": "Southern Highlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city which, along with Clayton, is covered by the Mount Diablo Unified School District?",
        "response": "122,067",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are Julian Cope and Miki Berenyi?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain is inside Tibet - Kangphu Kang or Labuche Kang?",
        "response": "Labuche Kang",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Shot by Both Sides\" writter is also known as the leader of Buzzcocks?",
        "response": "Pete Shelley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director does Sylvain Bellemare and Arrival have in common?",
        "response": "Denis Villeneuve",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre did the heavy metal band switch to in their career?",
        "response": "Spiritism",
        "source": "hotpot_qa"
    },
    {
        "query": "What fraudulent company was listed on both the Alberta Stock Exchange and the Toronto Stock Exchange?",
        "response": "Bre-X",
        "source": "hotpot_qa"
    },
    {
        "query": "The most decorated English footballer of all time appeared in a 2013 documentary film detailing the careers of six footballers for which team?",
        "response": "Manchester United",
        "source": "hotpot_qa"
    },
    {
        "query": "Sportverein Sandhausen 1916 e.V. owns this stadium.",
        "response": "BWT-Stadion am Hardtwald",
        "source": "hotpot_qa"
    },
    {
        "query": "New York's 19th congressional district is represented by what Republican?",
        "response": "John Faso",
        "source": "hotpot_qa"
    },
    {
        "query": "What roles did Anders Fridén and Raimund Marasigan have in common in their respective bands?",
        "response": "vocalist and lyricist",
        "source": "hotpot_qa"
    },
    {
        "query": "Alpnachstad railway station is the lower terminus of the mountain railway in what country?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the actor younger brother of the co-writer of Club Paradise?",
        "response": "Bill Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "Wollongong Wolves Football Club is an Australian semi-professional football club based in Wollongong, in the Illawarra region of New South Wales, the club plays its home games out of WIN Stadium, Wollongong Showground, known as WIN Stadium for sponsorship reasons, is a multi-purpose stadium located in Wollongong, in which country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city, Daqing or Pengzhou, is a prefecture-level city in the west of Heilongjiang province, People's Republic of China?",
        "response": "Daqing",
        "source": "hotpot_qa"
    },
    {
        "query": "Wayne Wang and Ringo Lam are both from which country?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "Wolfgang Pree teaches at a university in what state? ",
        "response": "State of Salzburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicholar Winton, who's work was found out in 1988, was given what nickname by the British press?",
        "response": "British Schindler",
        "source": "hotpot_qa"
    },
    {
        "query": "In which month does this major tennis tournament take place, which was once called Australasian Championships?",
        "response": "January",
        "source": "hotpot_qa"
    },
    {
        "query": "International University of Management is based in the capital of what?",
        "response": "Republic of Namibia",
        "source": "hotpot_qa"
    },
    {
        "query": "Tequila Sunrise and Grog, are what?",
        "response": "alcoholic beverages",
        "source": "hotpot_qa"
    },
    {
        "query": "RSPCA Animal Rescue is hosted by a musician born in which year ?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Oklahoma send it's 38 pledged delegates to represent them in the 2008 Democratic National Convention?",
        "response": "Denver, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Which industrialist established a museum in Heckscher Park that features \"First Friday\" concerts?",
        "response": "August Heckscher",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the actor's middle name that voices the character Dr. William MacDougal?",
        "response": "Louis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novel influenced the movie in which Hattie Morahan played Ann?",
        "response": "A Slight Trick of the Mind",
        "source": "hotpot_qa"
    },
    {
        "query": "What airport is George Naccara serving as the Federal Security Director that is officially known as General Edward Lawrence Logan International Airport?",
        "response": "Logan International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Norwegian explorer, who crossed Greenland in 1888, was best known for his \"Fram\" expedition?",
        "response": "Fridtjof Nansen",
        "source": "hotpot_qa"
    },
    {
        "query": "In regards to the 54th Speaker of the US House of Representatives, what year was he a candidate for VP?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which WWE signed wrestler was in the APA tag team?",
        "response": "Ronald Simmons",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the music played by the Norwegian band Aeternus a subgenre of?",
        "response": "heavy metal music",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does Natasha Romanoff and Captain America join forces with in Captain America: The Winter Soldier?",
        "response": "Falcon",
        "source": "hotpot_qa"
    },
    {
        "query": "The character John Clifford from \"When a Stranger Calls Back\" made how many appearances in movies, television shows and plays?",
        "response": "over 200",
        "source": "hotpot_qa"
    },
    {
        "query": "Which species is native to Asia, Corokia or Rhodotypos?",
        "response": "Rhodotypos",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Brake plays which character on the HBO fantasy drama television series which premiered on April 6, 2014?",
        "response": "Night King",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the University of Szeged have a bigger budget than the University of California, Irvine?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Dušan Makavejev and Michael Caton-Jones work in film?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which place where Charles M. Van Artsdalen surfed 25-foot waves has name which means \"reddish water\" in Hawaiian?",
        "response": "Waimea Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Muse - is the first studio album of Valery Leontiev, the authors of the songs in the album are very well known poets and composers, including which Soviet and Russian composer, born on 12 December 1925?",
        "response": "Vladimir Yakovlevich Shainsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Rowland and Lauri Ylönen both share what occupation?",
        "response": "singer-songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "University of the Philippines and Adamson University, are located in which country?",
        "response": "Philippines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress of the movie Havoc is daughter of John Phillips",
        "response": "Bijou Phillips",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Northwestern University and Middlebury College both private schools?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Vaughan Williams' friend who helped collect folk songs in southern England and was a founding father of the folk-song revival in England in the early 20th century?",
        "response": "Cecil Sharp",
        "source": "hotpot_qa"
    },
    {
        "query": "A Dandy in Aspic is a 1968 Technicolor and Panavision British spy film starred Laurence Harvey, Tom Courtenay, and who?",
        "response": "Mia Farrow",
        "source": "hotpot_qa"
    },
    {
        "query": "Jal Pari, which translated in another language refers to which legendary creature which are sometimes associated with perilous events such as floods, storm,s shipwrecks, and drownings?",
        "response": "A mermaid",
        "source": "hotpot_qa"
    },
    {
        "query": "\"International Love\" features vocals from an R&B singer born in what town?",
        "response": "Tappahannock, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Arlington Robinson and Kate Atkinson, share which industry?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2012-13 FC Sion they brought in Gennaro Gattuso and a player who now plays for what Scottish team?",
        "response": "Scottish Premiership club Hearts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is from farther west, American University of Sharjah or Valparaiso University?",
        "response": "Valparaiso University",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of shows are Punch and Judy and The Beggar's Opera?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Seller Wallace was shot in the chest by one of the fugitives in the incident on the outskirts of this town located how far west of Calgary?",
        "response": "126 km",
        "source": "hotpot_qa"
    },
    {
        "query": "What can be described as a substance to provide nutritional support for an organism, and was one of the specialties of the Marnie Rose Agency?",
        "response": "Food",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffrey Walker and Fat Mike, share which mutual occupation?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Movement 98 was a Paul Oakenfold project on Circa Records, built around the vocals of a singer born in what year?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": " Of what culture is a dance erformed by a team of dancers who manipulate a long flexible figure of a dragon using poles positioned at regular intervals along the length of the dragon, that is used in public celebrations, rituals and ceremonies?",
        "response": "Chinese culture",
        "source": "hotpot_qa"
    },
    {
        "query": "Gioachino Rossini and Alessandro Scarlatti are both what?",
        "response": "Italian composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What British department store chain is an anchor store in the Mercat Shopping Center in Fife, Scottland?",
        "response": "British Home Stores",
        "source": "hotpot_qa"
    },
    {
        "query": "The doll which is a fusion a white girl child with a Southern United States archetype for a black woman who worked as a nanny is dated to what year? ",
        "response": "1950s",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus, Bismarckia or Adonis, if either, contains more species ?",
        "response": "Adonis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the episode of \"30 Rock\" which guest starred theman who played the role of Goerge Oscar \"Gob\" Bluth II in \"Arrested Development\"?",
        "response": "Andrew Guest",
        "source": "hotpot_qa"
    },
    {
        "query": "How many seats does the house of the Parliament of Italy that Massimiliano Fedriga is a member of have?",
        "response": "630",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted the event that Thai decathlete won gold at?",
        "response": "Bhubaneswar",
        "source": "hotpot_qa"
    },
    {
        "query": "In which movie the Stephanie Kay Panabaker was alongside with her elder sister Danielle Nicole Panabaker?",
        "response": "\"Read It and Weep\" (2006)",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Football Club for which Siam Hanghal plays as a midfielder based? ",
        "response": "Kochi, Kerala",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 47th Governor of Indiana beat Republican David M. McIntosh in 2000?",
        "response": "Frank O'Bannon",
        "source": "hotpot_qa"
    },
    {
        "query": "Raimond Aumann was nicknamed after a character in from a fictional book written by who?",
        "response": "Rudyard Kipling",
        "source": "hotpot_qa"
    },
    {
        "query": "Matilda Ziegler, is an English television, stage and film actress best known for her role as Irma Gobb in which British sitcom created by Rowan Atkinson and Richard Curtis, produced by Tiger Aspect Productions, and starring Atkinson as the title character?",
        "response": "Mr. Bean",
        "source": "hotpot_qa"
    },
    {
        "query": "Salzburg Global Seminar is held at a palace located on which lake?",
        "response": "Leopoldskroner Weiher",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American drama will include Ewan McGregor, Miracle or Christopher Robin?",
        "response": "Christopher Robin",
        "source": "hotpot_qa"
    },
    {
        "query": "Kirsi Hannele Viilonen's career was launched in the late 1980s, inspired by the success of such busty international stars like which English singer, songwriter, actress and former glamour model born on April 15, 1966?",
        "response": "Samantha Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Tar Creek and Before Stonewall have in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Conrail Shared Assets Operations operates networks for which owner that has heaquarters in what state?",
        "response": "Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of ship was the panzerschiff\"Admiral Graf Spee\"?",
        "response": "\"Deutschland\"-class \"\"Panzerschiff\"\" (armored ship)",
        "source": "hotpot_qa"
    },
    {
        "query": "The film Against the Sun stared stared which English actor?",
        "response": "Tom Felton",
        "source": "hotpot_qa"
    },
    {
        "query": "Spoiler Shield is what, designed to block spoilers of popular television shows, can even block spoilers from even the American anthology horror series created and produced by Ryan Murphy and Brad Falchuk?",
        "response": "iOS and Android app",
        "source": "hotpot_qa"
    },
    {
        "query": "The IERS Reference Meridian (IRM), is the prime meridian (0° longitude) maintained by which organization, it is also the reference meridian of the Global Positioning System (GPS), originally Navstar GPS, is a space-based radionavigation system owned by the United States government and operated by the United States Air Force?",
        "response": "International Earth Rotation and Reference Systems Service (IERS)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university has the most acreage, University of West Florida or Gonzaga University?",
        "response": "University of West Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "How far from the center of the city is the suburb that bordered a port that played an important role in the formative decades of South Australia?",
        "response": "20 minutes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian-American actress has done numerous voice animations and has been on cast for the television sitcom, Mosquito Lake? ",
        "response": "Tara Strong",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the wife of the current United States ambassador to Russia?",
        "response": "Mary Kaye Huntsman",
        "source": "hotpot_qa"
    },
    {
        "query": "H & G Simonds Ltd was a brewery founded in Reading, Berkshire, England in 1785 by William Blackall Simonds, eventually the firm became part of Scottish & Newcastle who sold the brands to Wells & Young's Brewery, was formed in October 2006 from the merger of the brewing operations of which organization, and Young's Brewery?",
        "response": "Charles Wells Ltd",
        "source": "hotpot_qa"
    },
    {
        "query": "What Croatian singer performed the song \"My Friend\" using head voice, a particular part of the vocal range, to sing the English parts of the multiligual song?",
        "response": "Jacques Houdek",
        "source": "hotpot_qa"
    },
    {
        "query": "Pakistan Idol included a singer and philanthropist who has performed at what British landmark?",
        "response": "Royal Albert Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor born in 1974 plays a character in commercials for Old Spice?",
        "response": "Isaiah Mustafa",
        "source": "hotpot_qa"
    },
    {
        "query": "Did David Nixon produce more films than Philippe de Broca?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hungry Howie's Pizza and Snappy Tomato Pizza both pizza franchises?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "William John Christopher Vassall, was a British civil servant who spied for the which government nation, under pressure of blackmail from 1954 until his arrest in 1962, the Vassall scandal greatly embarrassed the Macmillan government, but was soon eclipsed by the more dramatic Profumo affair, was a British political scandal that originated with a brief sexual relationship in 1961 between John Profumo, the Secretary of State for War in Harold Macmillan's government, and Christine Keeler, a 19-year-old would-be model?",
        "response": "Soviet Union",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state was the football team Don Faurot coached in 1944?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was also an aviator, Mark Rydell or Susan Oliver?",
        "response": "Susan Oliver",
        "source": "hotpot_qa"
    },
    {
        "query": "Aukštaitian, is one of the dialects of the Lithuanian language, spoken in ethnographic regions of Aukštaitija, Dzūkija and which of the smallest of the five cultural regions of Lithuania?",
        "response": "Suvalkija",
        "source": "hotpot_qa"
    },
    {
        "query": "Modern Jive is a dance style derived from this American dance originated in Harlem, New York City in 1928, which s frequently described as what dance?",
        "response": "jazz dance",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress of Puerto Rican descent starred in Sleeping with the Fishes?",
        "response": "Gina Rodriguez",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was invented farther north, Through the Desert or Tantrix?",
        "response": "Through the Desert",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Thomas Schlamme or Jodie Foster?",
        "response": "Thomas David Schlamme",
        "source": "hotpot_qa"
    },
    {
        "query": "Gnaeus Pompeius of Pompeia became a member of the First Triumvirate along with this general and politician who played a key role in the transformation of the Roman Republic into the Roman Empire and was the second wealthiest person next to which person?",
        "response": "Augustus Caesar",
        "source": "hotpot_qa"
    },
    {
        "query": "What s a series of crossover action role-playing games owned by Disney Interactive Studios, that had an English actress reprised her voice acting role s both Alice and Wendy in the 2002 video game?",
        "response": "Kingdom Hearts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song that caused the Columbia Kingsmen to change their name to Sha Na Na?",
        "response": "Richard Berry",
        "source": "hotpot_qa"
    },
    {
        "query": "What Donald Glover created series features Brian Tyree Henry as Alfred Miles?",
        "response": "Atlanta",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did Sarah Chalke play on the most watched television show in the United States from 1989 to 1990?",
        "response": "the second Rebecca \"Becky\" Conner",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dengta and Xuanwei located in the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fighter from WEC 38 is known as the \"busiest\" fighter in the UFC?",
        "response": "Donald Cerrone",
        "source": "hotpot_qa"
    },
    {
        "query": "A Wish Way is a device that appears in three of the Oz books of Ruth Plumly Thompson, \"The Royal Book of Oz\", \"The Lost King of Oz\", and which other book?",
        "response": "The Hungry Tiger of Oz",
        "source": "hotpot_qa"
    },
    {
        "query": "Which other occupation is the American actress who stars as a Jewish-American girl who befriends a German prisoner of war in a made-for-television war drama?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1982 the New York Jets defeated the Cincinnati Bengals and Los Angeles Raiders to advance to a playoff game in which league ?",
        "response": "the National Football League (NFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry makes both Dana Ivey and Rush Hour 3 popular?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this role playing game by Alexander Scott, originally published in 1984, which were covered by the Cretan Chronicles?",
        "response": "Maelstrom",
        "source": "hotpot_qa"
    },
    {
        "query": "What German composer wrote a letter in 1770 addressing Lucrezia Aguiari's ability to perform in C sporano acuto?",
        "response": "Leopold Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "Survial Under Atomic Attack was a document released during a state of what?",
        "response": "geopolitical tension",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Boys Over Flowers\" actor co-starred in The Legend of the Blue Sea with Jun Ji-Hyun?",
        "response": "Lee Min-ho",
        "source": "hotpot_qa"
    },
    {
        "query": "Dankaran Touman was the first son of Naré Maghann Konaté, father of Sundiata Keita, founder and first Emperor of the Mali Empire, which was an empire in West Africa from 1230 to 1670, during which century?",
        "response": "13th",
        "source": "hotpot_qa"
    },
    {
        "query": "Everything, Everything is based on the novel by author of what nationality?",
        "response": "Jamaican-American",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Felton won MTV Movie Awards for Best Villain for his performance in \"Harry Potter and the Half-Blood Prince\" and a film directed by who?",
        "response": "David Yates",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Banks, was an English politician, of Revesby Abbey, it was a Cistercian monastery located near the village of Revesby in Lincolnshire, in which country?.",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "The Freemen of the South, were belligerents in an 1839 rebellion in south Buenos Aires province, Argentina against Federalist Governor Juan Manuel de Rosas, a mixture of disgruntled ranchers and Unitarian revolutionaries, the Freemen briefly took control of Dolores, Chascomús and which main city of the homonymous partido (department), located in Argentina, in the southeast of Buenos Aires Province, just north-northwest of the Tandilia hills?",
        "response": "Tandil",
        "source": "hotpot_qa"
    },
    {
        "query": "What do The American Jewess and Hänt Extra have in common?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this British multinational banking and financial services company that operates a network of over 1,000 branches across dozens of countries that was formed in 1969 after merging of a few companies?",
        "response": "Standard Chartered",
        "source": "hotpot_qa"
    },
    {
        "query": "The most nominations at the Chicago Film Critics Association Awards in 2016 went to a coming-of-age drama film that was based on a play by Tarell Alvin McCraney, and was written and directed by who?",
        "response": "Barry Jenkins",
        "source": "hotpot_qa"
    },
    {
        "query": "Harrison Chad had a role as Boots on \"Dora the Explorer\" and a spin-off that originally aired on what network?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "\"And So It Goes\" is a poem written by which person that also married Christie Brinkley?",
        "response": "Billy Joel",
        "source": "hotpot_qa"
    },
    {
        "query": "who directed a 1979 seven-part drama spy mini-series made by BBC TV, that starred a Scottish actor of film, stage and television ?",
        "response": "John Irvin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director worked on Reservoir Dogs, Roger Avary or Clark Johnson?",
        "response": "Roger Avary",
        "source": "hotpot_qa"
    },
    {
        "query": "n recent years Pakistan champions cricket league (PCCL) matches have been telecasted live through a channel that belongs to which corporation ?",
        "response": "Independent Media Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former New Zealand international cricketer who has 20 balls in 2007 Cricket World Cup born",
        "response": "27 September 1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is closest to the castle once owned by the Scottish inventor who invented a military cannon described by Isaac Newton as \"destructive to the human species\"?",
        "response": "Aberchirder, Aberdeenshire, Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from Lawrence, Coheed and Cambria or Godsmack?",
        "response": "Godsmack",
        "source": "hotpot_qa"
    },
    {
        "query": "Port Subdivision has a northern terminus at the port with facilities on both sides of what river?",
        "response": "Hudson",
        "source": "hotpot_qa"
    },
    {
        "query": "For which Twin cities the name of the team came from for which Daniel John Dobbek played one full season and parts of two others of MLB?",
        "response": "Minneapolis and St. Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the leader of the Stanford marshmallow experiment born?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the male star of the film The Picasso Summer ?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What award was won by the leader of the 2006-07 Oregon Ducks men's basketball team?",
        "response": "NBA Most Improved Player Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor starred in Detention",
        "response": "Joshua Ryan \"Josh\" Hutcherson",
        "source": "hotpot_qa"
    },
    {
        "query": "Diary of a Chav was written by the journalist who chiefly writes for which newspaper?",
        "response": "The Independent",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2005 film directed by Michael Bay featured a concept car unveiled at the 2002 Detroit Auto Show?",
        "response": "The Island",
        "source": "hotpot_qa"
    },
    {
        "query": "14 Carrot Rabbit was a cartoon that featured which Mel Blanc-voiced character?",
        "response": "Bugs Bunny",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Kazuo Ishiguro and Yukio Mishima both move from Japan to England?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film debuted first, Captain Mike Across America and American Scary?",
        "response": "American Scary",
        "source": "hotpot_qa"
    },
    {
        "query": "Jay Kahn is a Democratic member of the New Hampshire Senate, what is a county that is located in the 10th district?",
        "response": "Cheshire County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the country format radio station based in Nelson County's Bardstown in Kentucky?",
        "response": "Central Kentucky Broadcasting, Inc",
        "source": "hotpot_qa"
    },
    {
        "query": "Henry of Almain was the song of one of the wealthiest men in Europe who joined what?",
        "response": "the Barons' Crusade",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of Chynna Phillips' mother?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Dutch media tycoon transferred all of its media activities to Talpa Holding?",
        "response": "John de Mol Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born on November 17, 1972 and helped form the American indie folk rap group, The Uncluded?",
        "response": "Kimya Dawson",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the mixed martial artist who defeated Trent Jenkins in the first ever fight in UFC history?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the member of the Los Angeles Rams who made his debut On November 11, 1990 frow up?",
        "response": "Philadelphia, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted the 7th edition of the nternational sporting competition for athletes with intellectual disabilities, organized by the IOC-recognised Special Olympics organisation?",
        "response": "Anchorage, Alaska",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the week long programming block on the Discovery Chanel featuring docufiction Zombie Shark?",
        "response": "Shark Week",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Man's Best Friend\" air on Spike TV created by John Kricfalusi but was renamed what?",
        "response": "Ren & Stimpy \"Adult Party Cartoon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Thomas Ritter or Stefan Effenberg?",
        "response": "Thomas Ritter",
        "source": "hotpot_qa"
    },
    {
        "query": "Rensselaer Polytechnic Institute and Baylor University are both considered what kind of university?",
        "response": "private",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was filmed first, The Barefoot Executive or Honey, I Blew Up the Kid?",
        "response": "The Barefoot Executive",
        "source": "hotpot_qa"
    },
    {
        "query": "Orlando Lightfoot played basketball for a univeristy located in what county?",
        "response": "Latah County",
        "source": "hotpot_qa"
    },
    {
        "query": " The Railway Hotel was used in a film about what Cambodian regime?",
        "response": "Khmer Rouge",
        "source": "hotpot_qa"
    },
    {
        "query": "Why is Minister Pool important to Black Country and the West Midlands in England?",
        "response": "defence of the Cathedral",
        "source": "hotpot_qa"
    },
    {
        "query": "What book was written about a person who now resides at HMP Low Newton?",
        "response": "Inside 25 Cromwell Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, Michael Cunningham or P. C. Wren, was an English writer, mostly of adventure fiction?",
        "response": "Percival Christopher Wren",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is White Sulphur Springs, Montana located in?",
        "response": "Meagher County",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack Gelber was a professor at what public university system of New York City?",
        "response": "City University of New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Over what years was the city hall on top of which the Rathausmann is located constructed?",
        "response": "1872 to 1883",
        "source": "hotpot_qa"
    },
    {
        "query": "Whilst studying English at University College Matthew Tempest was a member of UCL Film Society with a director born in which year ?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Wes Brown played for what Indian club?",
        "response": "Kerala Blasters",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthdate of the actor who starred in the movie Voodoo?",
        "response": "July 16, 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "The line surrounding the Sambor Ghetto was established during which war?",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Twin Atlantic and Patti Smith both musical acts?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the regional department store based out of that was one of the original anchor stores at The Mall at Tuttle Crossing and is now a Macy's?",
        "response": "Columbus, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name character in Magnum P.I. that was played by the star of The Closer?",
        "response": "Thomas Magnum",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the king of England, Scotland and Ireland create in 1652?",
        "response": "The I'Anson Baronetcy of Bassetbury",
        "source": "hotpot_qa"
    },
    {
        "query": "Pandit Kishan Maharaj, was an Indian tabla player of Hindustani classical music, who belonged to which one of the six most common styles of playing of the Indian tabla? ",
        "response": "Benares gharānā",
        "source": "hotpot_qa"
    },
    {
        "query": "A Christmas Fantasy Parade features which character from Walt Disney Productions' first animated feature film?",
        "response": "Snow White",
        "source": "hotpot_qa"
    },
    {
        "query": "Thursday Night Baseball includes a play-by-play announcer who has been on NBC Sports since what time period?",
        "response": "early 1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state did Joan Horvath work for sixteen years?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Károly Makk and Barry Mahon both held this title in films?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Corvo Attano is the lead protagonist in a 2012 stealth action-adventure video game that was developed by Arkane Studios, and published by who?",
        "response": "Bethesda Softworks",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the mountain in the northern Franconia Range that flanks along the southwest of Garfield Ridge in the White Mountains?",
        "response": "5249 ft",
        "source": "hotpot_qa"
    },
    {
        "query": " Is California State University, Los Angeles or University of South Alabama east of united states?",
        "response": "University of South Alabama",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more Tony Award's, Alex Greenwald or Constantine Maroulis?",
        "response": "Constantine James Maroulis",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Murray Grigor or László Benedek involved in projects outside of film making?",
        "response": "Murray Grigor",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the writer of the film Baby's Day Out born?",
        "response": "February 18, 1950",
        "source": "hotpot_qa"
    },
    {
        "query": "How many employees did the oilfield services company which has B. Clark Burchfiel as a professor have? ",
        "response": "100,000 people",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2011 net worth of the executive producer of \"I'm Bad\"",
        "response": "$340 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the Wall Street Tower and 55 Hudson Yards, which one will add 4,000,000 sq ft of space?",
        "response": "55 Hudson Yards",
        "source": "hotpot_qa"
    },
    {
        "query": "What dance company is featured at the same venue which hosted the 2006 National Football League Draft?",
        "response": "the Rockettes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the song that the Irish tenor, also a Papal Count, recorded with Anton Strelezki?",
        "response": "Dreams",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Daldøs and Masterpiece which one was invented by Joseph M. Burck?",
        "response": "Masterpiece",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was used longer by humans, the Bavarian Mountain Hound and English White Terrier?",
        "response": "English white terrier",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indonesian-American actress starred in the movie featuring the title track by Everlife?",
        "response": "Tania Gunadi",
        "source": "hotpot_qa"
    },
    {
        "query": "Tex is based on a novel by an American writer which recieved which award?",
        "response": "Margaret Edwards Award",
        "source": "hotpot_qa"
    },
    {
        "query": "The brother of Elvira Wayans, born in 1960, is known for getting his breakthrough on what show?",
        "response": "In Living Color",
        "source": "hotpot_qa"
    },
    {
        "query": "According to the 2010 census, what was the population of the county in which Huntley, Montana is located?",
        "response": "147,972",
        "source": "hotpot_qa"
    },
    {
        "query": "The Thirsty Whale, which opened in 1975, was a rock and roll club, in River Grove, Illinois, it brought in which American rock band, headed by frontmen Gary Cherone and Nuno Bettencourt?",
        "response": "Extreme",
        "source": "hotpot_qa"
    },
    {
        "query": "From what state was the congressman who became Secretary of Defense and reportedly refused to promote Les Brownlee to Secretary of the Army because he was not a CEO?",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the phrase that is commonly used on the day which is observed on 25 April each year?",
        "response": "\"Lest we forget\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Where have Pradhan Mantri Jan-Dhan Yojana and Narendra Damodardas Modi served in politics?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What day of the week does a South Korean television series starring a German-South Korean actress aired on?",
        "response": "Thursdays",
        "source": "hotpot_qa"
    },
    {
        "query": "Where do both the New Jersey Devils and the Seton Hall Pirates play?",
        "response": "Prudential Center",
        "source": "hotpot_qa"
    },
    {
        "query": "The Strumpshaw Hall Steam Museum is home to a collection of an engine sometimes called road locomotives to distinguish from what?",
        "response": "railway locomotives",
        "source": "hotpot_qa"
    },
    {
        "query": "Name a Mexican pop/rock singer born in the 70s who acts on the telenovela \"El derecho de nacer (TV series)\"",
        "response": "Cristian Castro",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationalityof the author of the erotic romance \"Grey: Fifty Shades of Grey as Told by Christian\"?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Tornjak and Dunker are both what?",
        "response": "breed of dog",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of mansion was built for the founder of the company marketed the oil engine under the \"Hornsby-Akroyd\" name?",
        "response": "Gothic Revival",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has released more albums The Red Jumpsuit Apparatus or Ian Brown?",
        "response": "Ian George Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 Supercheap Auto Bathurst 1000 will be held at the racing track with what two official names?",
        "response": "Mount Panorama and Wahluu",
        "source": "hotpot_qa"
    },
    {
        "query": "What activity, restricted or banned in many countries, was the business of the murder victim of the \"Pink Skirt Murder\"?",
        "response": "Online gambling",
        "source": "hotpot_qa"
    },
    {
        "query": "Jody Williams possesses what distinct property, also known as tone color?",
        "response": "timbre",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the actress who costarred in \"King\" with Arjan Bajwa and Nagarjuna Akkineni?",
        "response": "4 May 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of musical theatre was the final sonata composed by a popular Italian-born British composer, pianist, pedagogue, conductor, music publisher, editor, and piano manufacturer titled after?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music is this English composer who composed the music for \"Blondel\" best known for?",
        "response": "operas.",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times did the leader of the criminal gang, of which Russell Clark was a member, escape from jail ?",
        "response": "twice",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain borders more countries, Yukshin Gardan Sar or Nangpai Gosum?",
        "response": "Nangpai Gosum",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the club that Pavol Bajza plays for?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "What team was Adam Morrison's Co-Player of the Year drafted to in the NBA?",
        "response": "Orlando Magic",
        "source": "hotpot_qa"
    },
    {
        "query": "Codename: Kids Next Door was created by what American animator who created the short \"Kenny and the Chimp\"?",
        "response": "Thomas Warburton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the talisman who was part of the year that AIK only conceded 28 goals?",
        "response": "Nisse",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Downsborough was born in a town located in which country ?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Little Feat's Lowell George, or Ian Hunter from Mott the Hoople?",
        "response": "Ian Hunter",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hilton was replaced on the revival of Let's Make a Deal by the original host, who was of what ethnicity?",
        "response": "Canadian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ran longer Arizona Canal and Allegheny Portage Railroad",
        "response": "Arizona Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British-American factual television series featured the inventor of the World Wide Web?",
        "response": "How We Got to Now",
        "source": "hotpot_qa"
    },
    {
        "query": "Innovative Leisure is a record label that features an R&B musical duo based out of what city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "who was part of the heavy metal band Ratt, Stephen Pearcy or Alexander O'Neal?",
        "response": "Stephen Pearcy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the borough Burnley High School is in?",
        "response": "87,500",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Interstate 90 in Pennsylvania and U.S. Route 20 intersect or are they parallel?",
        "response": "parallels that of Interstate 90 (I-90",
        "source": "hotpot_qa"
    },
    {
        "query": "the Cotroni crime family was supplanted by a family based in which city ?",
        "response": "Montreal",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Grammy awards did an English singer-songwriter born 19 May 1992 win in 2015?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach for the team who was one of the top too rushing teams in 2010 and also plays their home games at Bobby Dodd Stadium?",
        "response": "Paul Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who logged more hours in space, James P. Bagian or Edward Avedisian",
        "response": "James Philip Bagian",
        "source": "hotpot_qa"
    },
    {
        "query": "Lim Gan was well known for his comic roles in a film series based on the exploits of a Cantonese martial artist who was considered an expert in what style?",
        "response": "Hung Ga",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plant has more species, Melasphaerula or Weigela?",
        "response": "Weigela is a genus of between six and 38 species",
        "source": "hotpot_qa"
    },
    {
        "query": "La passione di Gesù Cristo was written by a composer who spent his career as a subject of what monarchy?",
        "response": "Habsburg Monarchy",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who appointed Ahmad Khatami as Tehran’s substitute Friday prayer leader was born in what year?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the director of Passchendaele born?",
        "response": "Calgary, Alberta",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the number one single by the band that features a lead singer who won the season finale of a television reality game show that premiered in 2010 on NBC?",
        "response": "Every Rose Has Its Thorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine founded in 1977 has sponsored \"The Music Show\" in Ireland?",
        "response": "Hot Press",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1967 by Colombian author Gabriel García Márquez takes place in Macondo, Colombia?",
        "response": "One Hundred Years of Solitude",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joyce Carol Oates and Terence Rattigan both published writers ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Teddy Riley was involved with the production of Dangerous, the 8th album by Michael Jackson. Who produced his previous albums?",
        "response": "Quincy Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Hong Kong film production company produced The Proud Youth?",
        "response": "Shaw Brothers Studio",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is the second most populous city in the U.S. state of Kansas, that has a private post secondary institution that provides training every year to hundreds of students from around the world to work in fashion, film, and television ?",
        "response": "Johnson County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case is cited as the business purpose doctrine: Gregory v. Helvering or Ableman v. Booth?",
        "response": "Gregory v. Helvering",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, The Animal World or Wheel of Time?",
        "response": "The Animal World",
        "source": "hotpot_qa"
    },
    {
        "query": "How many seasons did the namesake of the River East Royal Knights' home stadium play?",
        "response": "21 seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film starring Shoichi Hirose as King Ghidorah, also known as Ghidrah in English markets?",
        "response": "Ishirō Honda",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building is across the street from 5 World Trade Center, 125 Greenwich Street or 50 Hudson Yards?",
        "response": "125 Greenwich Street",
        "source": "hotpot_qa"
    },
    {
        "query": "The Plymouth fury produced from 1955 to 1989  was replaced by what for police and fleet applications?",
        "response": "Chrysler K platform",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Thomas Reiter and Franz Viehböck from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Holiday Special, is the third episode in the twenty-first season of which American animated television series, premiered on Comedy Central ?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is located within 6 miles of the only east-west US Numbered Highway that connects Mexico and Canada?",
        "response": "Cynthiana",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth name of the pope who appointed the current secretary of the Congregation for Bishops?",
        "response": "Jorge Mario Bergoglio",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Kostritz and the Kostritzer brewery are located in what country?",
        "response": "in Germany.",
        "source": "hotpot_qa"
    },
    {
        "query": " Samvel Alumyan was a Soviet-Armenian classical pianist and frequent collaborator with a violinist many considered to be among the greatest violinists of what?",
        "response": "the 20th century",
        "source": "hotpot_qa"
    },
    {
        "query": "Between two bands This Century and Residual Kid, which band has been more active recently?",
        "response": "Residual Kid",
        "source": "hotpot_qa"
    },
    {
        "query": "In which battle the Roman Emperor from 361 to 363 was killed?",
        "response": "Battle of Samarra",
        "source": "hotpot_qa"
    },
    {
        "query": "William Effingham Lawrence (1781–1841) was an English colonist to Australia, the son of Captain Effingham Lawrence, a merchant, Lawrence was an educated and refined man, an intimate of which English philosopher, jurist, and social reformer regarded as the founder of modern utilitarianism?",
        "response": "Jeremy Bentham",
        "source": "hotpot_qa"
    },
    {
        "query": "Non-Stop Mix Best is by a pair of producers who are of what heritage?",
        "response": "Belgian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the programmer of Minicraft ?",
        "response": "Swedish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the town which constituted part of the Megunticook Lake was in Waldo County, Maine, United States?",
        "response": "Lincolnville",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of species was Carl Baugh interviewed about in the television special The Mysterious Origins of Man?",
        "response": "\"Australopithecus afarensis\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was the suicide bombing which started Operation Ghazi?",
        "response": "Pakistan",
        "source": "hotpot_qa"
    },
    {
        "query": "The world's largest global airline alliances in which United is a founding member was founded when?",
        "response": "14 May 1997",
        "source": "hotpot_qa"
    },
    {
        "query": "The Adventures of Mimi is a DVD by the singer and actress who released her first album in what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Bendy Casimir, made his WEC debut on March 6, 2010 at WEC 47, losing via first-round knockout, against which American mixed martial artist who currently fights as a Featherweight in the Ultimate Fighting Championship organization?",
        "response": "Ricardo Alejandro Lamas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American Sitcom that aired on CBS featured music created by Adam Merrin?",
        "response": "How I Met Your Mother",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Rocker is an original member of a band that were heavily influenced by who?",
        "response": "Eddie Cochran, Carl Perkins, Gene Vincent and Bill Haley & His Comets",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 40th president who was in office when the Job Partnership Act of 1982 was passed?",
        "response": "Ronald Reagan",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1974 United States Senate election in Oregon, was held on November 5, 1974, which Incumbent Republican U.S. Senator, from Oregon, won re-election to a second term?",
        "response": "Robert William Packwood",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the production end of the engine for the vehicle that was a launch model for Acura in 1986?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Wild Honey is a 1984 adaptation of a untitled four act play written specifically for what rising star of Maly Theatre?",
        "response": "Maria Yermolova",
        "source": "hotpot_qa"
    },
    {
        "query": "Camp Upton was located near another military camp named in whose honor?",
        "response": "Major General Albert L. Mills",
        "source": "hotpot_qa"
    },
    {
        "query": "Talia al Ghul, a fictional character, is the mother of a character who was reinterpreted in 2006 by whom?",
        "response": "Grant Morrison",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American businessman and had a court case dealing with what Center?",
        "response": "World Trade Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Pauline Fossil on a show that premiered on BBC in December 2007?",
        "response": "Emma Watson",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Drop It Like It's Hot\" featuring Pharrell and \"Sexual Eruption\", also known by the censored version title \"Sensual Seduction\" are by what American rapper?",
        "response": "Snoop Dogg",
        "source": "hotpot_qa"
    },
    {
        "query": "Which winner of America's Best Dance Crew was formed in 2007 by Matthew \"Dumbo\" Nguyen?",
        "response": "Poreotics",
        "source": "hotpot_qa"
    },
    {
        "query": "Hana Mandlíková and Robert Seguso, have which occupation?",
        "response": "former professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "What kinds of citizenship does star of Kill Switch have?",
        "response": "American, Russian, and Serbian",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the team that won the Apertura in 2007 against the UNAM Pumas founded?",
        "response": "1916",
        "source": "hotpot_qa"
    },
    {
        "query": "Which came out second, Making North America or A Funny Thing Happened on the Way to the Moon?",
        "response": "Making North America",
        "source": "hotpot_qa"
    },
    {
        "query": "John Reed Clubs were an American federation of organizations targeted toward which writers, led by a socially active journalist?",
        "response": "Marxist",
        "source": "hotpot_qa"
    },
    {
        "query": "What settlement in the Fens of Eastern England is located on Forty Foot Drain?",
        "response": "Ramsey Forty Foot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a food magazine, Latin Mass Magazine or Saveur?",
        "response": "Saveur",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Prostitute\" is a song written by Axl Rose and Paul Tobias with additional work by an American guitarist has played in two different bands on a list of what? ",
        "response": "100 Greatest Artists of Hard Rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of an American former professional wrestler that had a son, Eric Watts, who also followed in his footsteps?",
        "response": "Bill Watts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who sang with The Police and was paid tribute to on The Men I Love?",
        "response": "Sting",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is farther west, Monterey Regional Airport or Fort Lauderdale–Hollywood International Airport?",
        "response": "Monterey Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "The Northeast People's Anti-Japanese Volunteer Army was confined by what country?",
        "response": "the Japanese",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Weberocereus and Conospermum part of the same genus?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the English rock band who sang  \"Rain\" formed ",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the lead vocalist of the alternative rock band Garbage, Shirley Manson or Carol Decker?",
        "response": "Shirley Ann Manson",
        "source": "hotpot_qa"
    },
    {
        "query": "What short story is a 2008 American science fiction film with the screenwriter who's most famous work is the screenplay for the film \"The Last Castle\" based off of ?",
        "response": "Farewell to the Master",
        "source": "hotpot_qa"
    },
    {
        "query": "What children's book is Laura Numeroff best known for and wrote?",
        "response": "If You Give a Mouse a Cookie",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Reece Noi and Waterloo Road have in common?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which the soundtrack was the first solo album by a member of the Beatles?",
        "response": "Joe Massot",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actress who played Dana Gray in Stowaway episode of Fringe born?",
        "response": "June 1, 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Sporting News and Men's Journal are both names of what?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former 2008 coach of the Panathinaikos currently the coach of?",
        "response": "Al Jazira",
        "source": "hotpot_qa"
    },
    {
        "query": "What band along with Tony Sheridan released the first consolidated American packaging of a 1962 German album that because of the later fame of the band, the material has been repackaged several times ?",
        "response": "The Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2007 Canadian idol contestant is now being produced by Stint?",
        "response": "Carly Rae Jepsen",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1995 film directed my Michael Caton-Jones did Brian Cox act in?",
        "response": "Rob Roy",
        "source": "hotpot_qa"
    },
    {
        "query": "Eddie Cahill is best known for portraying a retired American ice hockey goaltender who was part of the 1980 U.S. hockey team that won the gold medal at the Olympic games that were held where?",
        "response": "Lake Placid",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the similarity between Redd Kross and Saving Abel?",
        "response": "American rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "In which town is the university located that Stewart Wingate graduated from during his time at Black & Decker?",
        "response": "Newcastle",
        "source": "hotpot_qa"
    },
    {
        "query": "Treenailed boats were use used by viking in which centuries?",
        "response": "8th to late 11th centuries",
        "source": "hotpot_qa"
    },
    {
        "query": "What song about the homeless was remixed by J Farell?",
        "response": "The A Team",
        "source": "hotpot_qa"
    },
    {
        "query": "Approximately how many locations is BJ's Wholesale Club operating in, as of early 2008?",
        "response": "650 locations",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of group does Amstrad and BBC Micro have in common?",
        "response": "company",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the band that Tom William HIngley is the frontman for formed?",
        "response": "Oldham, Greater Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is the original film, Choices of One or Star Wars?",
        "response": "Star Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Western Conference team included a Dutch born player in there roster when they won the 2007 NBA Championship?",
        "response": "San Antonio Spurs",
        "source": "hotpot_qa"
    },
    {
        "query": "What research group was formed in 2014 due to Russia's suspension?",
        "response": "The G7 Research Group",
        "source": "hotpot_qa"
    },
    {
        "query": "In what film did David Wharnsby's wife star in 2004?",
        "response": "Dawn of the Dead",
        "source": "hotpot_qa"
    },
    {
        "query": "How many miles is the racing circuit in which Jack Dunfee played one of the \"Bentley Boys\" before the Second World War?",
        "response": "2.75",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Washington City Canal and Champlain Canal both still fully operational ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Maich is the editor of which of the longest-publishing business magazine, based in Toronto, Ontario, Canada?",
        "response": "Canadian Business",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the soft drink that is older than Hires Root Beer?",
        "response": "James Vernor",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the island named after on which the city Anna Maria is located?",
        "response": "Anna Maria Ceravolo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song was a number one hit in Australia for the male lead of the movie \"Caprice\"?",
        "response": "MacArthur Park",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pleiades supercomputer is housed in a facilities in what county?",
        "response": "Santa Clara County",
        "source": "hotpot_qa"
    },
    {
        "query": "This American poet, born in 1830, was the sister in law of Susan Huntington Gilbert Dickinson? ",
        "response": "Emily Dickinson",
        "source": "hotpot_qa"
    },
    {
        "query": "The Passacaglia for orchestra, Opus 1, is the first published composition of twentieth century Austrian composer Anton Webern, who was mentored by who?",
        "response": "Arnold Schoenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the 7th Duke of Westminster which Gerald Grosvenor was his father born ",
        "response": "29 January 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Last in Line reunited in 2010 with the guitarist who was of what nationality?",
        "response": "Northern Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "What stands beside the Pont de Grenelle in Paris, one of hundreds of similar examples around the world?",
        "response": "a replica of the Statue of Liberty",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English rock ban from Abingdon, Oxfordshire, covered \"No Surprises\" from American singer-songwriter, Blake Morgan's 2006 album \"Silencer\".",
        "response": "Radiohead",
        "source": "hotpot_qa"
    },
    {
        "query": "Antony and Cleopatra and Hans Heiling, are what type of theater?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Canadien-American actress who has gotten nominations in the Annie Awards and the Daytime Emmys who plays a main character in the animated television series \"Teen Titans\"?",
        "response": "Tara Strong",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does In the Basement and Feiyu Show have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "The upcoming film Pattinapakkam is composed by which Indian music composer known as shaan?",
        "response": "Ishaan Dev",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film star from the movie \"Lion\" released in 2016 was also in the movie \"300\" ?",
        "response": "David Wenham",
        "source": "hotpot_qa"
    },
    {
        "query": "Dollhouse is the debut extended play by a singer raised in what New York city?",
        "response": "Baldwin",
        "source": "hotpot_qa"
    },
    {
        "query": "Civil rights advocate  Carolyn Goodman's murdered son was born in what year?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Along what road was the former mall near White Flint station located?",
        "response": "Rockville Pike",
        "source": "hotpot_qa"
    },
    {
        "query": "Which abbey constructed the castle located in Dalton Town with Newton?",
        "response": "Furness Abbey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fast food chain competes with a restaurant named after a character in\"Treasure Island\"?",
        "response": "Arthur Treacher's Fish and Chips",
        "source": "hotpot_qa"
    },
    {
        "query": "Which organization operates a natural and cultural history museum located in the Carlton Gardens in Melbourne, Australia?",
        "response": "Museums Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacques Tourneur and Susan Seidelman, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American film director, screenwriter, actor, producer born who's soundtrack was the Dead Man?",
        "response": "January 22, 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Before the film Homo Erectus, Giuseppe Andrews played a deputy in what film",
        "response": "Cabin Fever",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the male presenter on Sky News Tonight, who has also presented for Sky News?",
        "response": "Dermot Murnaghan",
        "source": "hotpot_qa"
    },
    {
        "query": "John Mosier is currently a professor of English at a private, co-educational, Jesuit university, that was established as Loyola College in what year?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Second World War, the No. 22 Squadron of the Royal Air Force operated in the torpedo bomber role over this body of water located between Great Britain, Scandinavia, Germany, the Netherlands, Belgium, and France?",
        "response": "The North Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Carnegie Mellon University and Emory University both located in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress born in 1965 in Buenos Aires starred in the romantic comedy Apariencias?",
        "response": "Andrea Del Boca",
        "source": "hotpot_qa"
    },
    {
        "query": "Searching for Jerry Garcia is the final studio album of a Detroit rapper who died in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Which album was in Streets Is Watching  was released on June 25, 1996, by Roc-A-Fella Records and Priority Records?",
        "response": "Reasonable Doubt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which will be higher Time Warner Center or One Manhattan Square ?",
        "response": "One Manhattan Square",
        "source": "hotpot_qa"
    },
    {
        "query": "What American quartery lifestyle magazine did Hearst Shkelev Media also publish?",
        "response": "Departures",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the ruling in the Terry v. Ohio and Reynolds v. Sims cases given in the same year ? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 32nd season for the Phoenix Suns Scott Skiles would come on as head coach, replacing the current  general manager and President of Basketball Operations for what team?",
        "response": "Boston Celtics",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two presidents who served during the heyday of the \"Kansas City Star,\" which one did NOT use nuclear weapons in war?",
        "response": "Dwight D. Eisenhower",
        "source": "hotpot_qa"
    },
    {
        "query": "Max Ophüls and Lloyd Bacon are both what?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the coach of the 1981 Sooners football team?",
        "response": "Barry Switzer",
        "source": "hotpot_qa"
    },
    {
        "query": "which American Class I railroad was White Horse, formally located ",
        "response": "The Great Northern Railway",
        "source": "hotpot_qa"
    },
    {
        "query": "When you see an American crocodile in the wild, where could it be found?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Lesley Foxcroft worked with MDF, Card, and which material that is produced by pressing together moist fibres?",
        "response": "Paper",
        "source": "hotpot_qa"
    },
    {
        "query": "Walter Samuel played with the defender or midfielder who was of what nationality?",
        "response": "Argentine",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Alex Russo in \"Wizards of Waverly Place\" also appears on a siundtrack for a series that aired on what network?",
        "response": "Disney Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Peter Bogdanovich and Bob Clark American actors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Jyoti Hegde is an artist who performs on the instrument typical of what genre?",
        "response": "Hindustani classical music",
        "source": "hotpot_qa"
    },
    {
        "query": "Along with Tom Jones, and Spiderbait, which American rock is known for their hit \" Black Betty\"? ",
        "response": "Ram Jam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which premier league team does the recipient of the FIFA U-20 Golden Shoe play for ?",
        "response": "Manchester City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which published on a bi-monthly basis  Giant Robot or Sculptural Pursuit magazine?",
        "response": "Giant Robot was a bi-monthly magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine that contains a \"Motherboard\" section was founded in 1994?",
        "response": "Vice",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Il-hyung's first feature film was released by which company ?",
        "response": "Showbox",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the Scriblerus Club also wrote an opera in which music was arranged by Johann Christoph Pepusch?",
        "response": "John Gay",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, Waking Sleeping Beauty or Tonka, was filmed in Bend, Oregon, and distributed by Buena Vista Distribution?",
        "response": "Tonka",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Tropicana Resort & Casino located?",
        "response": "Tropicana Resort & Casino in Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Beaconsfield Supply Store was the birthplace of the supermarkets founded in what year?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is German, Donald Crombie or Peter Schamoni?",
        "response": "Peter Schamoni",
        "source": "hotpot_qa"
    },
    {
        "query": "In what drama did the Saving Mr Banks and Saul Dibb's 2015 WW2 romance actress portray Alice Morgan?",
        "response": "Luther",
        "source": "hotpot_qa"
    },
    {
        "query": " What did an English former footballer purchase in march 2009?",
        "response": "50 JJB Sports Fitness Clubs",
        "source": "hotpot_qa"
    },
    {
        "query": "Papa Dee's most commercially successful track is his version of a Cat Stevens song released in which year ?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Renntech makes modifications for the company headquartered in what city?",
        "response": "Affalterbach",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Fahrenheit 88 and Pavilion Kuala Lumpur are located in what country?",
        "response": "Malaysia",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the concert film for U2's first arena tour since 2005-2006 shot at?",
        "response": "AccorHotels Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "The television series in which Steve Bannos portrayed Frank Kowchevski was cancelled after how many episodes had aired?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "Who else was given the label in the quartet along with  Henry Drummond Wolff, John Gorst and a genuine Tory radical, who coined the term Tory Democracy ?",
        "response": "Arthur Balfour",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first prime minister and president of Ghana that established The Ghana Institute of Languages in 1961?",
        "response": "Kwame Nkrumah",
        "source": "hotpot_qa"
    },
    {
        "query": "Because I Said So starred an American actor who is known for his role as Harvey Specter in what series?",
        "response": "Suits",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation did Nicholas Christopher and Roger Ebert share?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Gong Hyo-jin had a role in what 2014 television series airing on SBS?",
        "response": "It's Okay, That's Love",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the surname of the Italian composer of the works for which the baritone Giovanni Polese was celebrated?",
        "response": "Verdi",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor Swift released a music video from the song that was released on September 12, 2008 on what record label?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What crime is Gary Ridgway associated with? ",
        "response": "He murdered numerous women and girls in Washington State during the 1980s and 1990s.",
        "source": "hotpot_qa"
    },
    {
        "query": "The American multi-platinum mixer, engineer, producer and songwriter Nick Brophy worked with which American singer-songwriter known for arrative songs about her personal life?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was the dance from featured in the The Cool Mikado?",
        "response": "Cuban",
        "source": "hotpot_qa"
    },
    {
        "query": "Reima Karppinen won a silver medal in the double sculls at the Rowing Championships held in what German city?",
        "response": "Oberschleißheim",
        "source": "hotpot_qa"
    },
    {
        "query": "The Arena for the River East Royal Knights was named after a hockey player who played what position?",
        "response": "goaltender",
        "source": "hotpot_qa"
    },
    {
        "query": "Rua Santos Minho is a small street in Póvoa de Varzim city center, in which country, that's officially the Portuguese Republic?",
        "response": "Portugal",
        "source": "hotpot_qa"
    },
    {
        "query": "Sumner, Mississippi is one of two county seats for Tallahatchie County, the other being the city having a population of what figure as of 2000?",
        "response": "2,198",
        "source": "hotpot_qa"
    },
    {
        "query": "Which naval base in Duval County, Florida houses the United States Navy aircraft squadron, the VP-26 \"Tridents\"?",
        "response": "Naval Air Station Jacksonville",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Desert of Maine located in?",
        "response": "Cumberland County, Maine, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What rival shopping mall to Bluewater was constructed on the site of a former chalk quarry?",
        "response": "Lakeside Shopping Centre",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrestling promotion was formed by the current NEVER Openweight Champion?",
        "response": "Pro Wrestling Fujiwara Group",
        "source": "hotpot_qa"
    },
    {
        "query": " Saturday Freedom was a show that competed against which highest-rated Saturday evening show?",
        "response": "Infinite Challenge",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the publishing group founded that the Univeristy Press of America belongs to?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film which Jiaban de Tianshi was shooting while she recorded track 10 on her first album ?",
        "response": "Teddy Chan.",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Twenty Two\" is an episode of the series \"The Twilight Zone.\" adapted from an anecdote by a publisher who made appearance in what panel game show?",
        "response": "What's My Line",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Down and Out in America or Garlic Is as Good as Ten Mothers preserved by the Academy Film Archive?",
        "response": "Garlic Is as Good as Ten Mothers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Now You See Me 2 was born on July 23, 1961 ?",
        "response": "Woody Harrelson",
        "source": "hotpot_qa"
    },
    {
        "query": "Maura Murray disappeared on a route that connects what?",
        "response": "Bath to Conway",
        "source": "hotpot_qa"
    },
    {
        "query": "Lagerstroemia and Veitchia, have which characteristic in common?",
        "response": "flowering",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of the man who who translated the personal writing of Marcus Aurelius into English?",
        "response": "Isaac Casaubon",
        "source": "hotpot_qa"
    },
    {
        "query": "in which year was this American composer and singer-songwriter born, whom Jessie Mueller portrayed and won the 2014 Tony Award for Best Actress for her portrayal?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the day on which Imperial Japan surrendered in World War II, with the same idea of a holiday celebrated on August 15 in both North and South Korea?",
        "response": "Victory over Japan Day",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor, known for playing the title role in the Percy Jackson films, also starred in the 2011 romantic action adventure film The Three Musketeers?",
        "response": "Logan Lerman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American retired professional basketball player, who played point guard, and who had 13.1 assists per game with the Los Angeles Lakers?",
        "response": "August 14, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Friedrich Hund, creator of Hund's rule of maximum multiplicity, is known for his work on what?",
        "response": "known for his work on atoms and molecules.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the country music star, whose dad was popular for coining the phrase \"Ya Gotta Believe,\" marry?",
        "response": "Faith Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Are 7 World Trade Center and the Time Warner Center both located in New York City?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the honoree of the Earl Haig memorial a junior or senior officer of the British Army?",
        "response": "senior officer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Transylvanian Hound and Irish Red and White Setter are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Muslim name of the man who put out the album \"Soul Finger\"?",
        "response": "Abdullah Ibn Buhaina",
        "source": "hotpot_qa"
    },
    {
        "query": "The city in which Monty Waters was born is Italian for what word?",
        "response": "modest",
        "source": "hotpot_qa"
    },
    {
        "query": "Which news channel did the creator of the Goodwill Games found?",
        "response": "Cable News Network",
        "source": "hotpot_qa"
    },
    {
        "query": "Which live release from the band Wings came first: Rockshow or Wings over America?",
        "response": "Wings over America",
        "source": "hotpot_qa"
    },
    {
        "query": "What Classification is the album by UK band Seccond Person, and a musical genre that originated in the early 1990s in the United Kingdom, especially Bristol?",
        "response": "Trip hop",
        "source": "hotpot_qa"
    },
    {
        "query": "What ABC Family series is one of the stars of the 2015 American drama film Rosemont best known for her role in?",
        "response": "\"Make It or Break It\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Kew Cottages is located in the eastern suburb of Melbourne how far away from the Central Business District?",
        "response": "6 km east",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Maya Usova's partner?",
        "response": "Alexander Zhulin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who recorded the song co-written by Jamille Pierre and co-produced by Kanye West that was remixed by this Canadian DJ and musician who is signed to Diplo's record label Mad Decent?",
        "response": "Rihanna",
        "source": "hotpot_qa"
    },
    {
        "query": "What show was hosted by Jessica Drake's ex husband?",
        "response": "Spice Hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of collection does Nådens år and Agnetha Fältskog have in common?",
        "response": "album",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Blue Peter and Alanis Morissette who's album \"Supposed Former Infatuation Junkie\", was released in 1998?",
        "response": "Alanis Nadine Morissette",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American television serial drama started to broadcast on Fox which was written by Nicholas Wootton and created by Paul Scheuring?",
        "response": "August 29, 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the nominate cheetah subspecies, that makes the Entabeni Game Reserve it's home, classified as Vulnerable by the IUCN?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Juan Rulfo or John le Carré?",
        "response": "Juan Rulfo",
        "source": "hotpot_qa"
    },
    {
        "query": "For what team did the former second baseman and catcher who was inducted into the Baseball Hall of Fame in 2015 play?",
        "response": "Houston Astros",
        "source": "hotpot_qa"
    },
    {
        "query": "who directed one of  the movie that Nakash Aziz helped  A. R. Rahman to compose ?",
        "response": "Shankar",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of the 1979 BAFTA TV Award for Best Actress co-starred with Daniel Craig in a 2002 British tv drama directed by who?",
        "response": "Howard Davies",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this King of England, born in June 1239, in which the Prioress swore fealty to him, after his foray in Scotland in 1296?",
        "response": "Edward I of England",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2010 American Revisionist Western film based on the DC Comics character of the same name starred, Josh James Brolin, who had his first role in the 1985 film \"The Goonies?\"",
        "response": "Jonah Hex",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the star of Redbelt get a scholarship?",
        "response": "London Academy of Music",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did this Argentine dancing competition begin airing, in which Bailando 2012 was its eighth Argentinean season?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bag Man is was inspired by a work from what Swiss Jungian psycologist and scholar?",
        "response": "Marie-Louise von Franz",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Heysen, whose name was given to an electoral district of the House of Assembly in the Australian state of South Australia, won what for landscape painting a record nine times?",
        "response": "Wynne Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Oscar De La Hoya vs. Félix Trinidad was a boxing match held in which urban agglomeration in Nevada?",
        "response": "Las Vegas Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Tenorman Must Die is the fourth episode of the fifth season of what television series that was created by Trey Parker and Matt Stone?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the motorsport team that manufactured the Ligier JS4 founded?",
        "response": "1968",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show aired first, \"Rudolph the Red-Nosed Reindeer\" or, \"A Charlie Brown Christmas\"?",
        "response": "Rudolph the Red-Nosed Reindeer",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the Douglas DC-8 a four -engine long range jet airliner flying from New Orleans International Airport to Washington Dulles International Airport crash?",
        "response": "February 25, 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the American band The Belltower and the former band the Smiths with lead singer Morrissey both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which queen, crowned in 1952 bestowed Caritas Lawrence the recipient of the Order of the British Empire?",
        "response": "Elizabeth II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns and operates the location where ROH 13th Anniversary Show took place?",
        "response": "Boyd Gaming",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mine is older, the Burwash Mine or the Con Mine?",
        "response": "The Burwash Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1998 action-thriller disaster film produced by Mark Gordon for which Graham Yost is best-known?",
        "response": "Mikael Salomon",
        "source": "hotpot_qa"
    },
    {
        "query": "The Itchy & Scratchy & Poochie Show included the voice of Alex Rocco, who also guested on which 18th episode of season 7 of the Simpsons?",
        "response": "The Day the Violence Died",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Mark L. Lester or Andrew Stevens?",
        "response": "Mark L. Lester",
        "source": "hotpot_qa"
    },
    {
        "query": "No. 11 Squadron is based at an airbase 25 km north of the center of what city?",
        "response": "Adelaide",
        "source": "hotpot_qa"
    },
    {
        "query": "The Roman Catholic Diocese of Ventimiglia-San Remo is a territory in a coastal region of Italy popular with tourists for its what?",
        "response": "beaches, towns and cuisine",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was the latest screen adaptation of Shakespeare's \"Hamlet set?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What film produced by BBC Films was adapted from the 2003 novel of the same name by Zoë Heller?",
        "response": "Notes on a Scandal",
        "source": "hotpot_qa"
    },
    {
        "query": "The contractor for the Shrewsbury–Chester line died in what year?",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the English football coach and former player and former manager of the 1996-97 Machnester City F.C. season, who resigned after 32 days?",
        "response": "Steve Coppell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these men, Scott Treleaven and Edmund Mortimer, is credited with working in both films and photography?",
        "response": "Scott Treleaven",
        "source": "hotpot_qa"
    },
    {
        "query": "What Horror thriller film directed by Franck Khalfoun, stars Stephanie Moore?",
        "response": "P2",
        "source": "hotpot_qa"
    },
    {
        "query": "The Death of General Wolfe, an oil painting, depicts a scene from which pivotal French and Indian War battle that took place outside the walls of Quebec City?",
        "response": "Battle of the Plains of Abraham",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Sting and Bon Scott both members of the band The Police?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Concerto for Double String Orchestra is one of the most popular and frequently performed works of a composer born in which year ?",
        "response": "1905",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a collegiate athletic conference affiliated with the NCAA Division, that has Binghamton University competing in it?",
        "response": "America East Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mosaic covenant are recorded in the first five books of the Hebrew Bible, which also sometimes refers primarily to the Torah or first five books of the Hebrew Bible?",
        "response": "Law of Moses",
        "source": "hotpot_qa"
    },
    {
        "query": "The loch where the Dorback Burn river originates is home to the ruins of what castle?",
        "response": "Lochindorb Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following speculates what might become of Earth should humanity instantly disappear: Life After People or The Vanishing Prairie?",
        "response": "Life After People",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  English rapper, singer and songwriter who sang  \"Later\" born ",
        "response": "20 June 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the mountains known as Trivor and The Crown both found in Asia?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, The Smashing Pumpkins or The Mighty Lemon Drops?",
        "response": "The Mighty Lemon Drops",
        "source": "hotpot_qa"
    },
    {
        "query": "The Brogue shoe is typically found in what style similar to that of a ballet shoe?",
        "response": "Ghillies",
        "source": "hotpot_qa"
    },
    {
        "query": "Marina Zueva was the coach for which Canadian World Champion ice dancer?",
        "response": "Tessa Jane McCormick Virtue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this census-designated place with a population of over 25,000, that is the home of the WFTU college radio station?",
        "response": "Dix Hills, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of Spendthrift an American Paramount Pictures romance film starring Henry Fonda who was an American film and stage actor?",
        "response": "Raoul Walsh",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Murakami Namiroku's grandson, assassinate a politician?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the actor who hosted the24th People's Choice Awards with  Reba McEntire ?",
        "response": "Albert",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize did the winner of the Senate race against Daniel W. Lawler win in 1929?",
        "response": "Nobel Peace Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Connoisseur Media currently owns WALK (1370 AM), what other station do they own located in Hempstead, New York?",
        "response": "WHLI (1100 AM)",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Echidnopsis and Lechenaultia both genuses of plants? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Jimmy \"Duck\" Holmes or Skip James ?",
        "response": "Jimmy \"Duck\" Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are University of Engineering and Technology, Lahore and Clarkson University both private universities?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the fourth studio album of the solo artist who had three minor country singles in the charts as one half of the duo Skip & Linda?",
        "response": "Some Things Are Meant to Be",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the daughter of Haia and mother of Enbilulu?",
        "response": "Ninlil",
        "source": "hotpot_qa"
    },
    {
        "query": "Fantasista is a song named after which player from Júbilo Iwata?",
        "response": "Shunsuke Nakamura",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one dates back further, the film Emil and the Detectives or the Magic Kingdom theme park?",
        "response": "Emil and the Detectives",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Squirrel Nut Zippers and Kongos both rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band opened for more major international acts, Blessid Union of Souls or Blue Peter?",
        "response": "Blue Peter",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the team that drafted Ed Davis established?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the most populous city in the country that contains Eastern Samar province?",
        "response": "Quezon City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British submachine gun was carried by Tommy Gunn?",
        "response": "Sterling submachine gun",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Julio Cortázar and Norman Lindsay both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Scottish Deerhound and Jämthund, are breeds of hounds?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What collection of papers by a Russian-British social and political theorist appeared in 1969?",
        "response": "\"Four Essays on Liberty\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfond Stadium was rededicated in 1998 to a person who founded which company ?",
        "response": "the Dexter Shoe Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What English film actress who died in 2003 starred in Clochemerle?",
        "response": "Wendy Hiller",
        "source": "hotpot_qa"
    },
    {
        "query": "Kristofor Brown was the head writer of the animated sitcom designed by whom?",
        "response": "Mike Judge",
        "source": "hotpot_qa"
    },
    {
        "query": "To The Point is hosted by which former Australian politician?",
        "response": "Kristina Kerscher Keneally",
        "source": "hotpot_qa"
    },
    {
        "query": "The Death Camp of Tolerance is an episode from an animated television series that was created by which two people?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Timberwolves players under 20 years of age played for the Duke Blue Devils?",
        "response": "Tyus Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Who represents the district that Gawthorpe is in?",
        "response": "Julie Cooper",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine presented the award of \"Best Media Source\" to Dann Stupp's website MMAjunkie.com?",
        "response": "\"Fighters Only\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by AIR was on their debut album \"Moon Safari\" and was featured in the film \"10 Things I Hate About You\"?",
        "response": "Sexy Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "Deborah Allen wrote a Top 10 hit for which American country music vocal group consisting of two sisters and their father? ",
        "response": "The Whites",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the English version of the show in which Susan Glover played Lucille first air?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Spetz' writer, producer, director, and star, is a Russian mobster and crime boss in what area?",
        "response": "Vladivostok area",
        "source": "hotpot_qa"
    },
    {
        "query": "What do you call a pore, found in the epidermis of leaves, stems, and other organs, that facilitates gas exchange, is part of the soil-plant-atmosphere continuum (SPAC),  the name of the pathway for water moving from soil through plants to the atmosphere",
        "response": "stoma",
        "source": "hotpot_qa"
    },
    {
        "query": "This Canadian actor appeared in Trailer PArk Boys, which was filmed in which province?",
        "response": "Nova Scotia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has created more musical compositions, Frankie Kazarian or Armen Donelian?",
        "response": "Armen Donelian",
        "source": "hotpot_qa"
    },
    {
        "query": "What cricketeer active 1974–1993 had a strong performance in the tour by the Australian cricket team in England in 1981?",
        "response": "Ian Botham",
        "source": "hotpot_qa"
    },
    {
        "query": "Whistle Stop starred an American film actor and dancer who played a truck driver in what movie?",
        "response": "They Drive by Night",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine focuses on religion, Liahona or Film Threat?",
        "response": "Liahona",
        "source": "hotpot_qa"
    },
    {
        "query": "Marion M. Ganey relied on a fellow Jesuit who had grown up at the non-profit that is located in which state?",
        "response": "Nebraska",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of tree is closely-related to witch hazel, Toona or Parrotia?",
        "response": "Parrotia",
        "source": "hotpot_qa"
    },
    {
        "query": "Heaton Park BT Tower lies on the banks of the reservoir, which is close to Junction 18 of a motorway that encompasses which city ?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Bob Fosse and Emile Ardolino who has worked more recently?",
        "response": "Emile Ardolino",
        "source": "hotpot_qa"
    },
    {
        "query": "What division of the United States Army, nicknamed \"The Big Red One\" landed on Normandy on D-Day?",
        "response": "1st Infantry Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Which online classroom training provider provides certifications in the field that deals with the study of investments?",
        "response": "EduPristine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which U.S. Senator won re-election to a third term in which  James Charles Slattery was the Democratic candidate in 2008?",
        "response": "Pat Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shipping company was co-founded by a man whose biography was written by James Scurlock?",
        "response": "DHL Worldwide Express",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the film in which the star of  The Bulldog Breed had his first lead role ?",
        "response": "Trouble in Store",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker  is most often identified woth the 1960's French film movement \"La Nouvelle Vague\", Jean-Luc Godard or Frances-Anne Solomon",
        "response": "Jean-Luc Godard",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population as of the 2010 census of the city in which the NBC affiliate WTVA is located?",
        "response": "34,546",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryant Reeves (born June 8, 1973) is an American retired professional basketball player, Reeves spent his entire career with the NBA's Vancouver Grizzlies, were a Canadian professional basketball team based in Vancouver, in which Canadian province?",
        "response": "British Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Lieutenant Governor of Kentucky who served under the only governor in state history born in Jefferson County?",
        "response": "Emerson \"Doc\" Beauchamp",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plants is endemic to Australia, Retama or Baeckea?",
        "response": "Retama",
        "source": "hotpot_qa"
    },
    {
        "query": "Into the Homeland starred the actress of what nationaity?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out more recently, Jackass Number Two or Seoul Train?",
        "response": "Jackass Number Two",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Clair Bayfield is best known as the manager of an American socialite who was ranked as what by Stephen Pile?",
        "response": "the world's worst opera singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the songwriter who wrote the songs for the album \"Song Hits from Holiday Inn\" born?",
        "response": "Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which editor in chief of Marvel comics created the fictional deity Hera?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Matthew Settle is known for his role on Band of Brothers as what United States Army officer who served in the 506th Parachute Infantry Regiment of the 101st Airborne Division during World War II?",
        "response": "Lieutenant Colonel Ronald C. Speirs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor played fraternity president \"Lewis Skolnick\" in the \"Revenge of the Nerds\" comedy films?",
        "response": "Robert Reed Carradine",
        "source": "hotpot_qa"
    },
    {
        "query": "Beauty and the Beast, is an American musical romantic fantasy film,released in which year, the film features an ensemble cast that includes Stanley Tucci, an American character actor, writer, producer and film director?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "The county that Doris Beck was the first woman to serve as a Mayor of had a population of what in 2010?",
        "response": "783,969",
        "source": "hotpot_qa"
    },
    {
        "query": "Who operates the airport that Regent Airways is based at?",
        "response": "Civil Aviation Authority, Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "Which institution did the basketball team coached by Linda Lappe represent? ",
        "response": "University of Colorado Boulder",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the movie produced by Nasir Hussain and has a remake named Keyamat Theke Keyamat?",
        "response": "Qayamat Se Qayamat Tak",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Depue was on the panel investigating the event that occurred on what date?",
        "response": "April 16, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Voyvodinovo is a village  2 km to the east of a city that has evidence of habitation since what time period?",
        "response": "6th millennium BC",
        "source": "hotpot_qa"
    },
    {
        "query": "What flag features 13 stars, and has a creator who also has a memorial bridge named after her connecting Pennsylvania and New Jersey?",
        "response": "Betsy Ross",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Shipping News and Versus both American bands who play in their own genre of rock?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Dance of the Dead actor also appeared in Satisfaction?",
        "response": "Blair Redford",
        "source": "hotpot_qa"
    },
    {
        "query": "What Crackle series does the actor who played Nick Eliot in The Crush currently star in?",
        "response": "The Art of More",
        "source": "hotpot_qa"
    },
    {
        "query": "What large pancake house franchise has it's headquarters in an unicorporated part of Gwinnett County, Georgia?",
        "response": "Waffle House",
        "source": "hotpot_qa"
    },
    {
        "query": "JJ Project (Korean: 제이제이 프로젝트 ) is a South Korean pop duo, consisting of JB and Jinyoung, They debuted as a part of which is a South Korean boy group formed by JYP Entertainment, in January 2014?",
        "response": "Got7",
        "source": "hotpot_qa"
    },
    {
        "query": "Port Vale's 74th season what complete eason of The Football Leauge?",
        "response": "the 87th",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both LINK 480Z and CARDboard Illustrative Aid to Computation both involve computers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the winner of the 2016 Marrakesh ePrix born?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "The same man who produced such models as the Eindecker monoplanes, had a bomber designed created by him begin manufacturing in 1924 in what city?",
        "response": "Amsterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "AquAdvantage salmon includes a growth hormone-regulating gene from which Pacific salmon genus?",
        "response": "Oncorhynchus",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the rock bands Suede and Jack's Mannequin from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a French filmmaker known for the Holocaust documentary film \"Shoah\", Claude Lanzmann or Shane Meadows?",
        "response": "Claude Lanzmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Sly Stone or Jeremy McKinnon?",
        "response": "Sly Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a rare survivor on the David and Catherine Driver Farm from American Civil War campaign led by American soldier, businessman, educator, and author William Tecumseh Sherman?",
        "response": "1839 barn",
        "source": "hotpot_qa"
    },
    {
        "query": "Ibou Touray plays for Which Football Club based in the Kersal area of Salford, Greater Manchester, England?",
        "response": "Salford City",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 75 runs from near Williamsburg to Covington by way of which state which has a town to the east of the interstate and was founded in 1786?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "The Twisted Tales of Felix the Cat is an animated series starring the character Felix the Cat, produced for television by Film Roman, an American animation studio owned by what production company?",
        "response": "Waterman Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrestler known for his \"cowboy\" gimmick did Billy Red Lyons win a tag team championship with?",
        "response": "Bill Watts",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the philosophy of Tulkus?",
        "response": "Reincarnation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bethel Airport and Homer Airport both state-owned?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boston Martyrs were executed for disobeying a law banning them from where?",
        "response": "Massachusetts Bay Colony",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of a 2015 film based on Austro-Bavarian folklore has collaborated with which screenwriter?",
        "response": "Dan Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Aml Eysan Ameen acted in is an American science fiction drama web television series created by Lana and Lilly Wachowski and J. Michael Straczynski?",
        "response": "Sense8",
        "source": "hotpot_qa"
    },
    {
        "query": "Buipe is the capital of what part of North Ghana?",
        "response": "Central Gonja District",
        "source": "hotpot_qa"
    },
    {
        "query": "What New York representative and politician was defeated by Alan Hevesi in 2002?",
        "response": "John Faso",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tomorrow People follows a group of young people who possess what paranormal phenomenon?",
        "response": "Psionics",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the father of  James Hamilton, 5th Duke of Hamilton born?",
        "response": "1658",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Paul Éluard and Georges Bataille from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "John Fonville has premiered works by composers including Ben Johnston, called, \"one of the best non-famous composers this country has to offer\" in 1990, by what American critic?",
        "response": "John Rockwell",
        "source": "hotpot_qa"
    },
    {
        "query": "which city with the smallest population of all the members of the Council of Europe Chiesa di Sant'Andrea  located?",
        "response": "San Marino",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the WBA titleholder that Derrick Gainer lost to in a unanimous decision since his defeat to Juan Manuel Márquez?",
        "response": "Indonesian",
        "source": "hotpot_qa"
    },
    {
        "query": "Fuganto Widjaja is the grandson of Eka Tjipta Widjaja, the founder of the Sinar Mas Group, an Indonesian palm oil and property conglomerate started before the Second World War, in April 2015, he revealed a surprise takeover bid for Asia Resource Minerals, the coal mining company founded by which British-born financier who has settled in Switzerland, and a member of the prominent Rothschild family?",
        "response": "Nathaniel Philip Rothschild",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Tyler was named, April 2017, as the spokesman, for which organization, under the leadership of Tom Perez?",
        "response": "Democratic National Committee",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Seth Grahame-Smith and Gene Kelly both been film producers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 18th Empire Awards are presented by a magazine first issued when? ",
        "response": "July 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Duke Univeristy a private research university company or state university?",
        "response": "private research university",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ryan McCombs and Dan Haseltine members of the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that currently owns and distributes Schweppes Cola is based in what city?",
        "response": "Plano, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo In-sung, is a South Korean actor, best known for his leading roles, in which 2017 South Korean political crime thriller film, starring Jo In-sung and Jung Woo-sung?",
        "response": "The King",
        "source": "hotpot_qa"
    },
    {
        "query": "which university has the highest number of graduated students University of Texas at Austin or  Minnesota State University, Mankato ",
        "response": "Minnesota State University, Mankato",
        "source": "hotpot_qa"
    },
    {
        "query": "The Final Solution pays homage to a series where Sherlock Holmes calls his later archenemy the \"Napoleon\" of what?",
        "response": "crime",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the genera Indigofera and Dasylirion, which has more species?",
        "response": "Indigofera",
        "source": "hotpot_qa"
    },
    {
        "query": "John Carroll Power served as the first custodian of a tomb of a president and how many of his sons ?",
        "response": "three of their four sons",
        "source": "hotpot_qa"
    },
    {
        "query": "Allan Graf began running second unit for an American sports comedy film produced by which two individuals?",
        "response": "Robert Simonds and Jack Giarraputo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 7 ft green mantis who is an imprisoned evil nemesis on the spin off show of Space Ghost Coast to Coast?",
        "response": "Zorak",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Irish presidential election of what year, outgoing President Patrick Hillery agreed under enormous political pressure to seek a second term, though Seán MacBride, a former Nobel Peace Prize and Lenin Peace Prize winner, made it known in the newspaper that he wanted to contest the office,  an Irish government minister, a prominent international politician and a Chief of Staff of the IRA? ",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Deuce Bigalow is a character played by an alumn of what NBC sketch comedy series?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Ginny Stikeman or Luis Mandoki?",
        "response": "Virginia (Ginny) Stikeman (born 1941)",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation Ruman is the British government's combined military and humanitarian operations in September 2017 to provide relief to the British Overseas Territories in the Caribbean affected by which natural disaster?",
        "response": "Hurricane Irma",
        "source": "hotpot_qa"
    },
    {
        "query": "National Guild of Hypnotists is headquartered in a city named in 2013 as the 23rd best place to live by what magazine?",
        "response": "CNN Money Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original title of the opera in which Placido Domingo first appeared in 1961?  ",
        "response": "\"Violetta\"",
        "source": "hotpot_qa"
    },
    {
        "query": "La dame blanche (\"The White Lady\") is an opéra comique in three acts by the French composer François-Adrien Boieldieu, the work was one of the first attempts to introduce the fantastic into opera and is a model for works such as Faust , a grand opera in five acts by who?",
        "response": "Charles Gounod",
        "source": "hotpot_qa"
    },
    {
        "query": "were Conspiracy and Barbarossa created by the same company",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from Jpan, Hello Sleepwalkers or Arcade Fire?",
        "response": "Hello Sleepwalkers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Smith! or The Many Adventures of Winnie the Pooh?",
        "response": "Smith!",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was the battle that Don Chafin was a commander in in 1921?",
        "response": "five days",
        "source": "hotpot_qa"
    },
    {
        "query": "Which comic series involves characters such as Nick Fury and Baron von Strucker?",
        "response": "Marvel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French car manufacturer supplied the technology for the Burton?",
        "response": "Citroën",
        "source": "hotpot_qa"
    },
    {
        "query": "This luxury integrated resort in Sé, Macau, China is owned by a a publicly traded corporation founded in what year?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Which came out first, Cool Runnings or Max Keeble's Big Move?",
        "response": "Cool Runnings",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of group does Pablo Carballo and Argentine Air Force have in common?",
        "response": "military",
        "source": "hotpot_qa"
    },
    {
        "query": "What city and county seat in South Dakota, was Crow Dog, a Brulé Lakota subchief, nephew of former principal chief Conquering Bear, and leaders that helped popularize the Ghost Dance tried and convicted for shooting and killing principal chief Chief Spotted Tail?",
        "response": "Deadwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American gymnast represented the United States of America at the 2001 international multi-sport event held in Akita, Japan?",
        "response": "Shenea Booth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which episode of this season of \"The Simpsons\"' that had two hold-over episodes from the previous season was written by Ken Keeler, Dan Greaney, and David S. Cohen?",
        "response": "Treehouse of Horror VII",
        "source": "hotpot_qa"
    },
    {
        "query": "The Social Contract is a book which Jean-Jacques Rousseau identified in which earlier book?",
        "response": "Discourse on Inequality",
        "source": "hotpot_qa"
    },
    {
        "query": "Lansing Schools USD 469 is in a town of what population as of 2010?",
        "response": "11,265",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the American digital cable and satellite television network that aired \"The Secret Saturdays?\"",
        "response": "Boomerang",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an Italian-American composer and librettist, Antonín Dvořák or Gian Carlo Menotti ?",
        "response": "Gian Carlo Menotti",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress appeared with a character named Dr. Frank-N-Furter in a 1975 film?",
        "response": "Susan Sarandon",
        "source": "hotpot_qa"
    },
    {
        "query": "The Herodotus Machine was a machine described by Herodotus, a Greek historian born in Halicarnassus, Caria, modern-day Bodrum, Turkey, who claims this invention enabled the Ancient Egyptians to construct the pyramids, the Egyptian pyramids are ancient pyramid-shaped masonry structures located in Egypt?",
        "response": "Herodotus",
        "source": "hotpot_qa"
    },
    {
        "query": "Between what two states does the valley the Ojibwe ceded their rights to by the Treaty of Old Crossing form the border?",
        "response": "Minnesota and North Dakota",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American stand up comedian, actor, and television host, who starred in Quicksilver and was born in March 1953?",
        "response": "Louie Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "What film, based on Cheryl Strayed's memoir, had sound edited by Ai-Ling Lee?",
        "response": "Wild",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the screenplay for American film director and screenwriter Brian De Palma's \"The Bonfire of the Vanities\"?",
        "response": "Michael Cristofer",
        "source": "hotpot_qa"
    },
    {
        "query": "This band American heavy metal band founded in September 1995 included what former bassist for the band Will Haven?",
        "response": "Christopher Michael \"Chris\" Fehn",
        "source": "hotpot_qa"
    },
    {
        "query": " Among Kele Okereke and Jon Hume who made the New Zealand band Evermore?",
        "response": "Jon Hume",
        "source": "hotpot_qa"
    },
    {
        "query": "Who represents a village in the southwest part of the town of Greenburgh in the New York state Senate?",
        "response": "Andrea Stewart-Cousins",
        "source": "hotpot_qa"
    },
    {
        "query": "In what european city is a location of the college from which the woman known as Comic Book Girl 19 received her degree?",
        "response": "Lacoste, France",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Pablo Trapero or Aleksander Ford?",
        "response": "Aleksander Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "Prince Faisal bin Hussein, is a son of King Hussein and which Princess, born on 25 April 1941?",
        "response": "Princess Muna al-Hussein",
        "source": "hotpot_qa"
    },
    {
        "query": "Lou Reed and Jack Russell, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case Illinois v. Gates or Shelley v. Kraemer took place first ?",
        "response": "Shelley v. Kraemer,",
        "source": "hotpot_qa"
    },
    {
        "query": "the album COnfidential by M-1 features guest appearances from a musician born on which day ?",
        "response": "December 4, 1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides Jennifer Lawrence, Chris Pratt, Michael Sheen, and Laurence Fishburne, who else acted in the movie, \"Passengers?\"",
        "response": "Gene Serdena",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1869 novel was a favorite of the writer known as Vladimir Sirin?",
        "response": "Misunderstood",
        "source": "hotpot_qa"
    },
    {
        "query": "Genki Sudo holds a notable win over an American mixed martial artist who has been a professional competitor since what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "Best known for her performance as Donna Hayward, this actress also starred in what 2006 movie?",
        "response": "Land of the Blind",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sense of an Ending is an British-American mystery drama film, released in which year, it stars include Michelle Dockery, an English actress and singer?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actress that starred in Galveston is known for portraying Betty Cooper on The CW television series \"Riverdale?",
        "response": "Lili Reinhart",
        "source": "hotpot_qa"
    },
    {
        "query": "House Party 3 features the debut of an American actor born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What country group, forned in Dallas, Texas, 1990, has a nationionally recognized fiddle player as a founding member?",
        "response": "Dixie Chicks",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Lands is a remake of what American film director known for westerns, \"The Lost Patrol\"?",
        "response": "John Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the main difference between the game Plateau and the game Colt Express?",
        "response": "Colt Express is a railway-themed",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Completely Serious and Daniel Tosh have in common?",
        "response": "comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Tunxi District and Aral, Xinjiang, are situated in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American band from Knoxville Tennessee released the album From Birth to Burial?",
        "response": "10 Years",
        "source": "hotpot_qa"
    },
    {
        "query": "Edmond Memorial High School is located in what city whose population was 81,405 as of 2010?",
        "response": "Edmond, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie that was a major winner during the 2016-2017 film award season was directed by Damien Chazelle?",
        "response": "La La Land",
        "source": "hotpot_qa"
    },
    {
        "query": "What band performed the song \"Jihad\" about 9/11, and includes band member Tom Araya?",
        "response": "Slayer",
        "source": "hotpot_qa"
    },
    {
        "query": " Las Estrellas telenovela actress Violeta Urtizberea and her father worked for which telenovela in 2012?",
        "response": "2012 telenovela Graduados",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the railway on which Newby Bridge Halt is located?",
        "response": "3.2 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Wavves or Social Code?",
        "response": "Social Code",
        "source": "hotpot_qa"
    },
    {
        "query": "Who conducted the election in which Steve Kamper was elected to the New South Wales Legislative Assembly as the member for Rockdale for the Australian Labor Party?",
        "response": "New South Wales Electoral Commission",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hunger Games: Mockingjay – Part 2 featured the actor who played Josh Taylor on what soap opera?",
        "response": "Neighbours",
        "source": "hotpot_qa"
    },
    {
        "query": "What level of education does Ateneo de Davao University offer that the University of Minnesota does not?",
        "response": "a grade school and high school",
        "source": "hotpot_qa"
    },
    {
        "query": " What type of television show did Dylan Everett star in, in 2015?",
        "response": "American-Canadian mystery-drama",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the woman whose execution for treason by German firing squad was the reason for Prussian Generalleutnant (Lieutenant General) Traugott von Sauberzweig's replacement as Military Governor of Brussels in 1915?",
        "response": "Edith Louisa Cavell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who achieved a higher ranking in professional tennis doubles, Gisela Dulko or Bruno Soares?",
        "response": "Gisela Dulko",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Harry Lachman and Lionel Barrymore, which man was an actor?",
        "response": "Lionel Barrymore",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Lipsky and Donald Johnson, have which mutual occupation?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": " Which album did the band Kraftwerk release after their successful album which reached number 25 on the US \"Billboard\" Hot 100 chart?",
        "response": "Radio-Activity",
        "source": "hotpot_qa"
    },
    {
        "query": "Fernando Rey starred in That obscure Object of Desire that was directed by whom?",
        "response": "Luis Buñuel.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, Pick Me Up or All You?",
        "response": "Pick Me Up!",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Jobe Watson drafted?",
        "response": "AFL draft",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Bosnian Coarse-haired Hound and Small Greek Domestic Dog, which one is hunting dog?",
        "response": "Bosanski Oštrodlaki Gonič",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Hawaiian native of Portuguese descent had a number one hit song with a rap verse by Bobby Brown?",
        "response": "Glenn Medeiros",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor starred in \"The New Daughter\" born? ",
        "response": "January 18, 1955",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of study does University of Cape Town and Queen's University have in common?",
        "response": "public research",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the artist born who went to high school with the creators of the Man of Steel comics?  ",
        "response": "Cleveland, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "Garlic Is as Good as Ten Mothers and Hip-Hop: Beyond Beats and Rhymes are both what?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine came out first New Zealand Woman's Weekly or Ms. ?",
        "response": "Ms.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band did the American rapper, singer and songwriter co-founder who toured USA with I Fight Dragons in 2010?",
        "response": "Gym Class Heroes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the outdoor football stadium on the 16,000 acre campus of West Point?",
        "response": "Michie Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of drug is Oxandrolone that was found in the system of  Cinthya Domínguez in 2015?",
        "response": "steroid",
        "source": "hotpot_qa"
    },
    {
        "query": "The Trans-Tasman Challenge winning car was based off which second generation North american Ford compact car?",
        "response": "Ford Falcon",
        "source": "hotpot_qa"
    },
    {
        "query": " Scott Hochberg represented District 132 which included a domed sports stadium offically opened in what year?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "the 1961 crime drama film \"The Sinister Urge\" was written and directed by a director who passed away on which day ?",
        "response": "December 10, 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the last time a Chevrolet car bore the name of the vehicles used to race around Canada in the first season of The Amazing Race Canada?",
        "response": "1968",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Goodbye Earl\" CD single ncludes an ironic 'B-Side' cover of \"Stand By Your Man\" by which American country music singer-songwriter born on Ma 5, 1942?",
        "response": "Tammy Wynette",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Holland made is NHL debut playing for a team that plays their home games where?",
        "response": "the Honda Center",
        "source": "hotpot_qa"
    },
    {
        "query": "What numbered volume would one find the character \"Pelendur\" in the J. R. R Tolkien work?",
        "response": "third",
        "source": "hotpot_qa"
    },
    {
        "query": "In what American state was this record recorded live?",
        "response": "Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill Woodfull opened pairing with what cricketer who died in April of 1991?",
        "response": "Bill Ponsford",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day of what month did the episode of \"SpongeBob SquarePants\" first air in which there first appeared the character voiced by an actor who also played Michael \"Dauber\" Dybinski on the sitcom \"Coach\"?",
        "response": "May 1",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean-Jacques Beineix and Angela Murray Gibson are both what?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters for the Ustream company partner that is currently owned by William Morris Endeavor and Silver Lake Partners?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the player that has a style similar to that of the captain of the Real Madrid team?",
        "response": "Finnish",
        "source": "hotpot_qa"
    },
    {
        "query": "What fictional superhero created by Doug Moench and Don Perlin was the mortal enemy of Black Spectrel",
        "response": "Moon Knight",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of the person who released \"(Open Up the Door) Let the Good Times In\" in 1966?",
        "response": "June 7, 1917",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a hit with Feliz Navidad and also features in Naci Para Sufrir?",
        "response": "José Feliciano",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the writer of most of the tracks on \"Go Simpsonic with The Simpsons\" born?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the striker who scored 19 goals during the 2007–08 Blackburn Rovers F.C. season from?",
        "response": "Paraguaya",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the pre-1974 library of the organization that produced The Last Unicorn?",
        "response": "Universal Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did an event take place resulting in a win during a domestic double due to the action of a Peruvian footballer known for his goal scoring ability?",
        "response": "Bundesliga",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1995 song by TLC featuring horns arranged by Neal Pogue?",
        "response": "Lisa \"Left Eye\" Lopes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the film in which Lily James plays Debora best known for?",
        "response": "its choreography",
        "source": "hotpot_qa"
    },
    {
        "query": "Katniss Everdeen, a fictional character and protagonist of Susan Collins' dystopian novel trilogy, is played by what actress?",
        "response": "Jennifer Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Indian film actor, director and producer starred in \"Dil Toh Baccha Hai Ji\" born? ",
        "response": "2 April 1969",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the former football winger whose goal to give Manchester United a 2-1 win was cancelled do as a career now?",
        "response": "current manager",
        "source": "hotpot_qa"
    },
    {
        "query": "la faniciulla del west by giacomo is also known as which musical western film by David Belasco?",
        "response": "The Girl of the Golden West",
        "source": "hotpot_qa"
    },
    {
        "query": "As the oldest player in the NFL, this football player is the only player ever to have accomplished what?",
        "response": "score 1,000 points with two different teams",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Michael Hofmann and Martin Ritt both from the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Henry Eugene \"Red\" Erwin, Sr. is a recipient of the Medal of Honor which he earned aboard a heavy bomber whose design exceeded the cost of what?",
        "response": "the Manhattan Project",
        "source": "hotpot_qa"
    },
    {
        "query": "Twin Cities Air Service is an American fixed-base operator and charter airline based at Auburn, Maine and operating from Portland International Jetport, a public airport two miles (3 km) west of downtown Portland, in Cumberland County, in which state?",
        "response": "Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "At which role the did the director of the 2007 South Korean crime thriller film starring Yunjin Kim and Park Hee-soon played before directing films?",
        "response": "stuntman",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are both Xinmin, Liaoning and Ningxiang?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "The Poor Law Amendment Act 1834 (PLAA), known widely as the New Poor Law, was an Act of the Parliament of the United Kingdom passed by the Whig government of Earl Grey, it resulted from the 1832 Royal Commission into the Operation of the Poor Laws which included John Bird Sumner, was a bishop in the Church of England and Archbishop of where?",
        "response": "Canterbury",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more species, Sinowilsonia or Azolla?",
        "response": "Azolla",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the band that released the single \"Reaping Death\". In what year were they formed?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city that SR 11 is in?",
        "response": "1309",
        "source": "hotpot_qa"
    },
    {
        "query": "Codiaeum and Phygelius, are a type of what items?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Are University of Texas at Dallas and Northwestern University research universities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What technical director of FC St. Pauli was seriously injured in a foul in 1981?",
        "response": "Ewald Lienen",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the novelist for whom the Gaskell Memorial Tower and King's Coffee House is a memoral?  ",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": " The 2015 East Carolina Pirates football team was led by a sixth-year head coach who was named interm head coach of the Red Raiders on what date?",
        "response": "December 28, 2009",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years did the winner of the United Kingdom general election in 1955 serve?",
        "response": "1955 to 1957",
        "source": "hotpot_qa"
    },
    {
        "query": "How many movements are in the musical suite that includes \"Le cygne\"?",
        "response": "fourteen",
        "source": "hotpot_qa"
    },
    {
        "query": "Advitha Creative Studios provided special effects for  a 2015 French-British crime thriller film written and directed by who?",
        "response": "Brian Helgeland",
        "source": "hotpot_qa"
    },
    {
        "query": "When was American former professional basketball player.inwhich Blit represented David Kuchinsky in his suit against born",
        "response": "December 5, 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Contreras Motorsports was a Mexican professional stock car racing team that fielded the No 71 full-size and heavy-duty pickup truck manufactured by who? ",
        "response": "General Motors",
        "source": "hotpot_qa"
    },
    {
        "query": "What university houses the speech pathology and audiology programs named after the conductor of the Monster Study?",
        "response": "University of Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "The Super High Roller Bowl poker tournament in Las Vegas takes place at a resort that was opened in what year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Clayton S. Rose succeeded an official as president of Bowdoin College who was born in what year?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician filled more roles in their bands, Vibeke Stene or Wong Ka Kui?",
        "response": "Wong Ka-kui",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cão Fila de São Miguel and Griffon Nivernais from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A verse in the Billy Joel song \"The Entertainer\" references the shortening of another Joel song that was released in what year?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "A major British multinational retailer headquartered in the City of Westminster, London, that's also known as M&S?",
        "response": "Marks and Spencer plc",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the sequel to the 2004 game Flat out and features new gameplay modes and graphics as well as at least two new cars?",
        "response": "FlatOut 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Frederick A. Young,was one of Britain's most distinguished and influential cinematographers, he's probably best known for his work on Lawrence of Arabia, an epic historical drama film based on the life of T. E. Lawrence, released in what year?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rasul v. Bush and United States v. Windsor both US Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Arkapaw photographed the 2015 film that was directed by whom?",
        "response": "Niki Caro",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American cello rock band was hired by a three time Super Bowl winner to perform at his private party?",
        "response": "The 440 Alliance",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the historic hay and livestock barn located in a hamlet in Suffolk County with a population of 5,945 as per 2010 census?",
        "response": "Suffolk County Almshouse Barn",
        "source": "hotpot_qa"
    },
    {
        "query": "What parts of life in many Italian regions is included in an investigative book by Roberto Saviano and includes organized crime in Italy?",
        "response": "social and economic life of many Italian regions",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animated film did John Powell compose the score to that became the highest-grossing stop motion animated film ever?",
        "response": "Chicken Run",
        "source": "hotpot_qa"
    },
    {
        "query": "Who replaced Dom Capers, the football coach and current defensive coordinator for the Green Bay Packers after he was fired by the Houston Texans in a season where they finished with the worst record in franchise history?",
        "response": "Gary Kubiak",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2015 the New York Giants played their home games in a city with a record population of what in 2010?",
        "response": "8,913",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is acclaimed for his \"lyrical flow of his statements\": Nâzım Hikmet or Arthur Miller?",
        "response": "Nâzım Hikmet",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Wisconsin v. Yoder and Planned Parenthood v. Casey both Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Mountain is closer to Afghanistan  Kabru or Gasherbrum IV ?",
        "response": "Gasherbrum IV",
        "source": "hotpot_qa"
    },
    {
        "query": "Henrique de Senna Fernandes was a writer of the peoples who are of what mixed heritage?",
        "response": "Chinese and Portuguese",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was created first, Exposing Homelessness or Point of Order!?",
        "response": "Point of Order!",
        "source": "hotpot_qa"
    },
    {
        "query": "This rider, nicknamed \"The GOAT,\" won his seventh AMA Motocross Championship in what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The theatre in which the United States premiere of the opera Armida was given is located in which state?",
        "response": "New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack Fairbrother was an English football goalkeeper, who was best known for his time with what football club that was founded in 1892 by the merger of Newcastle East End and Newcastle West End?",
        "response": "Newcastle United Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Which President of the Ultimate Fighting Championship has grown it into a globally popular enterprise and recruited famous fighters such as Devin Clark?",
        "response": "Dana White",
        "source": "hotpot_qa"
    },
    {
        "query": "Were directors Kenneth Branagh and Anthony Asquith from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has the highest scope of profession in Troy Duffy or David Lean ",
        "response": "David Lean",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Robert Wise and Stuart Gillard both actors in films in the 20th century?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Butautas tried to depose his uncle who between which years ?",
        "response": "from 1345 to 1377",
        "source": "hotpot_qa"
    },
    {
        "query": "What role in their respective bands do Stephen Christian and Jonathan Davis share?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the company that manufactured a roller coaster found in the Efteling theme park?",
        "response": "Bolliger & Mabillard",
        "source": "hotpot_qa"
    },
    {
        "query": "Positive Women is an international development charity working in the UK and a country border on the south by what other country?",
        "response": "South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2013 who formally recognized the continued existence of the county John Langhorne was born in?",
        "response": "In 2013, the Secretary of State for Communities and Local Government, Eric Pickles, formally recognised and acknowledged the continued existence of England's 39 historic counties, including Westmorland.",
        "source": "hotpot_qa"
    },
    {
        "query": "David I. Arkin is the father of an American actor, director, screenwriter, musician, and singer, who performed in Popi and Catch-22, and who was born when?",
        "response": "March 26, 1934",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Quincy Perkins and Jerzy Skolimowski both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the head coach for the 12th season of the team that played their home games in the stadium in Suffolk County that opened in 2002?",
        "response": "Chuck Priore",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the son of the man to whom Marie-Thérèse Walter was a mistress?",
        "response": "Paulo",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jump is a British television series that follows celebrities as they try to master various winter sports, which is Britain's first Olympic ski jumper, who in 1988 became the first competitor since 1929 to represent Great Britain in Olympic ski jumping, finishing last in the 70 m and 90 m events?",
        "response": "Eddie \"The Eagle\" Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "Natalie Venetia Belcon born in 1969 appeared in which musical based on Rosa Guy's 1985 novel set in the French Antilles archipelago?",
        "response": "Once on This Island",
        "source": "hotpot_qa"
    },
    {
        "query": "What show was a Hip-Hop Dicktrine: The Official Boondocks Mixtake made for?",
        "response": "animated sitcom on Adult Swim",
        "source": "hotpot_qa"
    },
    {
        "query": "What chemical \"body\" did Constantin Fahlberg discover that is used to sweeten drinks, candies, cookies, etc.?",
        "response": "Saccharin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which co-host of the broadcast event of \"Children in Need 2015\" is best known for her work in pop groups S Club 8 and The Saturdays?",
        "response": "Rochelle Humes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are René Clément and David Lean both film directors ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Sugartown was the name of at least three Cherokee towns, the third Sugartown was located on Sugar Creek, a tributary of the Toccoa River, near the present-day city of which city in Georgia?",
        "response": "Blue Ridge",
        "source": "hotpot_qa"
    },
    {
        "query": "which film directed by José Padilha did  Joel Kinnaman: starred in ",
        "response": "RoboCop",
        "source": "hotpot_qa"
    },
    {
        "query": "How are James Earp and Nicholas Porter Earp related?",
        "response": "Earp",
        "source": "hotpot_qa"
    },
    {
        "query": "Intimidad de los parques was based on a short story by the novelist and essayist of what nationality?",
        "response": "Argentine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, in 1978, acquired ownership of the NBA team that plays their home games at TD Garden?",
        "response": "John Y. Brown, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who plays Quinn Fabray in Glee was born in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the \"Saw\" film that Gregg Hoffman was working on when he died?",
        "response": "Darren Lynn Bousman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the former MGM Grand Garden Special Events Center where the Mayweather-Ortiz fight took place?",
        "response": "MGM Grand Garden Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released later, Baghdad ER, or Capturing the Friedmans?",
        "response": "Baghdad ER",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town in Albany County, New York has a former hamlet that now belongs to the city of Albany?",
        "response": "Bethlehem",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose son's death brought titles to Edward III's most trusted captain?",
        "response": "Thomas, 2nd Earl of Lancaster",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Dariush Mehrjui and Paul W. S. Anderson are members of the Iranian Academy of the Arts?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the novel come out that was the basis for Natalie Venetia Belcon's role as Erzulie? ",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Queenie Eye\" is a song on Paul McCartney's sixteenth solo album called what? ",
        "response": "New",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one is a shopping mall, Robert College or Akmerkez?",
        "response": "Akmerkez",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of a film which the 21st Secretary of Defense appeared in?",
        "response": "William Karel",
        "source": "hotpot_qa"
    },
    {
        "query": "Ivey League was a poker training website founded by a professional poker player that was elected to the Poker Hall of Fame in what year?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Mogens Palle a Danish professional boxing promoter and manager brought to Denmark a boxer who was awarded an MBE in 2017 for services to boxing at what?",
        "response": "Queen's Birthday Honours",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Le roi malgré lui and Manon, which one was first performed at the Opéra-Comique in Paris on 19 January 1884? ",
        "response": "Manon",
        "source": "hotpot_qa"
    },
    {
        "query": "When  was the Soviet nuclear physicist died after who's name The SS \"Fizik Kurchatov\" was named?",
        "response": "7 February 1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retired Israeli general was the head of the sole military wing of the Israeli security forces?",
        "response": "Yom Tov Samia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are James Lee Burke and Max Jacob both writers ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Jayantabhai Ki Luv Story is a remake of the 2010 film written and directed by whom?",
        "response": "Kim Kwang-sik",
        "source": "hotpot_qa"
    },
    {
        "query": "For what international computer art subculture did Mark Alan Knight start out his career writing chiptune and module file music for?",
        "response": "Demoscene",
        "source": "hotpot_qa"
    },
    {
        "query": "What American Civil War General in the Union Army was compared to a character created by Shakespeare?",
        "response": "Orville Elias Babcock",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Serbain footballer had a major role in the dramatic ending of the 2015 Belgian Cup Final?",
        "response": "Aleksandar Mitrović",
        "source": "hotpot_qa"
    },
    {
        "query": "Romance Theatre is a 30-minute American anthology television series produced for first-run syndication by Courtship Productions, guest stars included which American actress, author and philanthropist whose career spanned six decades of television?",
        "response": "Doris Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "Tonino Valerii, was an Italian film director, most known for his Spaghetti Westerns,among his best-known films are which 1973 Spaghetti Western comedy film, and, in some scenes, directed by Sergio Leone?",
        "response": "My Name Is Nobody",
        "source": "hotpot_qa"
    },
    {
        "query": "John Valliant’s work has appeared in which outdoor-focused magazine whose first issue was published in September 1977?",
        "response": "Outside",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Dusty Drake and Joe Diffie sing which genre of music?",
        "response": "country",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the album Recess on March 18,2014 featuring the single Dirty Vibe?",
        "response": "Skrillex and Diplo",
        "source": "hotpot_qa"
    },
    {
        "query": "What person was manager for Bayer Leverkusen immediately before the man who is the third-highest goalscorer in the history of Bundesliga?",
        "response": "Robin Dutt",
        "source": "hotpot_qa"
    },
    {
        "query": "What metropolitan area is Creative Planning, Inc headquartered at?",
        "response": "Kansas City metropolitan area",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team involved in the Manchester Derby plays at Vity of Manchester Stadium?",
        "response": "Manchester City",
        "source": "hotpot_qa"
    },
    {
        "query": "Nat Moore, Bob Griese and Dan Marino all featured in the great 1980s football sides for which team?",
        "response": "Miami Dolphins",
        "source": "hotpot_qa"
    },
    {
        "query": "What country do this social and ethnic group, to which William Stewart, 1st Viscount Mountjoy belongs and that are mostly the descendants and successors of the English Protestant Ascendancy, live?",
        "response": "Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is North Carolina located in the United States?",
        "response": "within the Southern United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 19th Disney animated feature film with an Icelandic actor and voice actor is the voice of Kaa?",
        "response": "The Jungle Book",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more Grand Slam singles titles Li Na or Larisa Neiland?",
        "response": "Li Na",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2015-16 S.S.C. Napoli season, a player of what nationality set a Serie A goal record?",
        "response": "Argentine",
        "source": "hotpot_qa"
    },
    {
        "query": "I'll Sleep When I'm Dead is a song by American rock band Bon Jovi, it was written by John Francis Bongiovi Jr., known as Jon Bon Jovi, is an American singer-songwriter, a record producer, a philanthropist, and an actor, born when?",
        "response": "March 2, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Vails Gate, New York is part of the statistical area that contains the seat of what New Jersey county?",
        "response": "Essex",
        "source": "hotpot_qa"
    },
    {
        "query": "In which borough at the eastern border of Bergen County were many early film studios based by the time The Venus Model was released?",
        "response": "Fort Lee, New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Victor Spilotro's mobster brother had what nickname?",
        "response": "\"The Ant\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the television series in which Sean Harris had the role of Micheletto Corella ?",
        "response": "Neil Jordan;",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Les McKeown or Andi Deris?",
        "response": "Leslie Richard McKeown",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player, Sandy Mayer or Jennifer Capriati, won ten titles in singles and twenty-four titles in doubles?",
        "response": "Alexander \"Sandy\" Mayer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Gerald Schoenfeld Theatre is located in a borough bounded by what three rivers?",
        "response": "Hudson, East, and Harlem rivers",
        "source": "hotpot_qa"
    },
    {
        "query": "What two teams played in the final to advance to the npower Championship?",
        "response": "Crystal Palace and Watford",
        "source": "hotpot_qa"
    },
    {
        "query": "Wall Street is a 1987 American drama film, directed and co-written by Oliver Stone, the film tells the story of Bud Fox (Sheen), a young stockbroker who becomes involved with which wealthy, unscrupulous corporate fictional character in the 1987 film \"Wall Street\" and its 2010 sequel?",
        "response": "Gordon Gekko",
        "source": "hotpot_qa"
    },
    {
        "query": "Ella Rumpf is an actress known for a 2016 movie directed by whom?",
        "response": "Julia Ducournau",
        "source": "hotpot_qa"
    },
    {
        "query": "What Japanese unit was commanded by the admiral targeted by Operation Vengeance?",
        "response": "the Combined Fleet",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Vanelle or Jane Arden have more tasks in their resume?",
        "response": "Jane Arden",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the bands Tool and Capital Cities both from Los Angeles, California?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1966 Football League Cup Final was contested with which team that is based in the West Midlands?",
        "response": "West Bromwich Albion Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "For which college team did this American professional basketball player for the Miami Heat of the National Basketball Association (NBA) who earned praise for being the NBA's leading rebounder during the 2016–17 Miami Heat season play?",
        "response": "the Marshall Thundering Herd",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed was recognized first, the Swedish Vallhund or the Ratonero Bodeguero Andaluz?",
        "response": "Swedish Vallhund",
        "source": "hotpot_qa"
    },
    {
        "query": "72 Miles as co-produced by an actor who has appeared in how many Hindi films?",
        "response": "over a hundred",
        "source": "hotpot_qa"
    },
    {
        "query": "Which waterway, the New Orleans Outfall Canals or the Corpus Christi Ship Channel, is closer to the city of El Paso?",
        "response": "Corpus Christi Ship Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "Kam Heskin plays Paige Morgan in a 2004 film directed by who?",
        "response": "Martha Coolidge",
        "source": "hotpot_qa"
    },
    {
        "query": "How many novels has the author of Sheikh's Castaway written?",
        "response": "almost 40",
        "source": "hotpot_qa"
    },
    {
        "query": "A song was re-recorded for The Warrior's code, appearing in a film with Leonardo Dicaprio, and written by who?",
        "response": "William Monahan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the membership-only retail chain founded by Sam Walton founded?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the owner of a five-diamond luxury hotel and casino resort located on the Las Vegas Strip on the site of the old Sands Hotel?",
        "response": "Sands China Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Bedhead or The Creatures?",
        "response": "The Creatures",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Xifeng District and Xingyi, Guizhou belongs to which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Who married One-Eye DeSimone's nephew?",
        "response": "Angelica \"Cookie\" Spione",
        "source": "hotpot_qa"
    },
    {
        "query": "Dick Rutan piloted a craft around the world without stopping with the aviator of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Spirited Away, is a 2001 Japanese animated fantasy film written and directed by Hayao Miyazaki and produced by Studio Ghibli, Inc, a Japanese animation film studio based in Koganei, Tokyo, in which country?",
        "response": "Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Kent Whealy was raised in the county seat of what Kansas county?",
        "response": "Sumner",
        "source": "hotpot_qa"
    },
    {
        "query": "where was class of warships which ARA \"Sarandí\" is its fourth and last ship built ",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Sara Lee has worked with which folk rock music duo?",
        "response": "Indigo Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jon Turteltaub and Nicolas Roeg of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Johnny Mathis Sings included a song that started out as the instrumental title track to a film directed by whom?",
        "response": "Blake Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the older member of the Miami Dolphins Killer Bees Defense born between Doug Betters and Charles Bowser?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2004 NFL Draft pick lived in Santa Clara, California?",
        "response": "Maurice Mann",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Zorlu Center and Bayezid II Mosque in different cities?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Ewen Page is editor in chief of the magazine owned by what company?",
        "response": "BBC Worldwide",
        "source": "hotpot_qa"
    },
    {
        "query": "The scene some journalists grouped Distant Cousins with developed in what area of the United Kingdom in the late 1980s? ",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "What color uniform did Aaron Finch wear when he was captain of his team?",
        "response": "red cricket uniform",
        "source": "hotpot_qa"
    },
    {
        "query": "What Dutch professional football club based in Amsterdam can claim Sven Westendorp as a supporter?",
        "response": "AFC Ajax",
        "source": "hotpot_qa"
    },
    {
        "query": "What Do You Mean was from the Justin Bieber album released on what date?",
        "response": "November 13, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was known for his main role in  American cable television series created for FX by Noah Hawley?",
        "response": "Amber Midthunder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was formed earlier, Short Stack or Harvey Danger?",
        "response": "Harvey Danger",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the album released in 1995 by this Australian band that published the EP \"The Beasts of Suburban?\"",
        "response": "Machiavelli and the Four Seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "The first king of Portugal fought which Muslim inhabitants of the Maghreb?",
        "response": "Moors",
        "source": "hotpot_qa"
    },
    {
        "query": "The Marshall Library of Economics is located in a collegiate public research university, located where?",
        "response": "Cambridge, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Miguel Delibes and Iain Banks both Scottish authors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Author, Designer born in 1974 is the writter of The Order of the Stick",
        "response": "Rich Burlew",
        "source": "hotpot_qa"
    },
    {
        "query": "What community in Imperial County, California is partly named after a species of tree that is native to North America, Europe, and western Asia?",
        "response": "Alamorio",
        "source": "hotpot_qa"
    },
    {
        "query": "Were H. P. Lovecraft and John Updike the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the singer-songwriter who released his sixty-first album \"Redemption Road\" in 2015 born?",
        "response": "October 31, 1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Manlia Scantilla, was a Roman woman who lived in the 2nd century, she was very briefly Roman Empress as wife to which Roman Emperor for nine weeks during 193, the Year of the Five Emperors?",
        "response": "Didius Julianus",
        "source": "hotpot_qa"
    },
    {
        "query": "What political party is the current Attorney General of Missouri associated with?",
        "response": "Republican",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more known for their works on popular movies, Bob Monkhouse or J. R. R. Tolkien?",
        "response": "John Ronald Reuel Tolkien",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the members of the band that performed the song \"Junior's Farm?\"",
        "response": "his first wife, Linda, and Denny Laine.",
        "source": "hotpot_qa"
    },
    {
        "query": "Jasmin Geljo is known for his role in a 2005 post-apocalyptic horror film written and directed by who?",
        "response": "George A. Romero",
        "source": "hotpot_qa"
    },
    {
        "query": "A Bayou Legend is an American opera composed by William Grant Still, was an American composer, who composed more than 150 works, including five symphonies and eight operas, with a libretto by his wife and frequent collaborator, who?",
        "response": "Verna Arvey",
        "source": "hotpot_qa"
    },
    {
        "query": "Are 8 Spruce Street and One Madison both on the same street?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hong Kong based company produces a productt whose canonese name is Lap ceung what is the english translation?",
        "response": "Chinese sausage",
        "source": "hotpot_qa"
    },
    {
        "query": "The Nevada Gaming Control Board assigned the name \"Downtown Las Vegas Area\" to the area that includes the downtown Las Vegas casinos and the Stratosphere Las Vegas, which used to be called what?",
        "response": "Vegas World",
        "source": "hotpot_qa"
    },
    {
        "query": "This 1997 American superhero film starred an American Actress who mader her film debut in what movie?",
        "response": "The Crush",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Disney-Pixar film co-directed by the first woman to win the Academy Award for Best Animated Feature set?",
        "response": "the Scottish Highlands",
        "source": "hotpot_qa"
    },
    {
        "query": "which virtual channel 46 (UHF digital channel 19), was Jane Robelot  primary anchor for",
        "response": "WGCL-TV,",
        "source": "hotpot_qa"
    },
    {
        "query": "James Northcote (born James Walker; 10 October 1987) is an English actor and Producer who has appeared in which 2014  American historical drama thriller film, directed by Morten Tyldum and written by Graham Moore, loosely based on the biography by Andrew Hodges?",
        "response": "The Imitation Game",
        "source": "hotpot_qa"
    },
    {
        "query": "The birthplacce of Ian Johnston is located on what river?",
        "response": "River Lagan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Native American to play professional baseball and was nicknamed The deerfoot of the diamond?",
        "response": "Louis Sockalexis",
        "source": "hotpot_qa"
    },
    {
        "query": "A Prize of Arms is set during an invasion of what country?",
        "response": "Egypt",
        "source": "hotpot_qa"
    },
    {
        "query": "Derek Hough and Joe Strummer, have which mutual occupations?",
        "response": "actor and singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author wrote the novella which formed the basis for the Christmas television special that was accompanied by Kelly Clarkson's album \"Wrapped in Red\"?",
        "response": "Charles Dickens",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Jeanne Murray's cousin in the sitcom \"All in the Family\"?",
        "response": "Beatrice Arthur",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the University of Oklahoma's presidents and a member of the Senate Select Committee on Intelligence?",
        "response": "David Boren",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Alfred Santell and Anthony Kimmins American?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of \"An American Tragedy\" emigrated permanently to the United States at what age?",
        "response": "fourteen",
        "source": "hotpot_qa"
    },
    {
        "query": "What series has Smith worked on that is based on a novel by Margaret Atwood?",
        "response": "The Handmaid's Tale",
        "source": "hotpot_qa"
    },
    {
        "query": "The confucian academy, Dosan Seowan, located in the East Asian country bordered by China to the northwest and Russia to the northeast, was founded by two prominant Confucian scholars, one being known as Yi Yulgok. What was the \"pen\" name of the other founding scholar?",
        "response": "Yi Hwang is often referred to by his pen name Toegye (\"Retreating Creek\").",
        "source": "hotpot_qa"
    },
    {
        "query": "Heidi Newfield and Tim Rushlow, have which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "This American football coach who is partnered with John Lynch and whose father was head coach of Los Angeles Raiders is a part of which Football League?",
        "response": "National Football League",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alternative rock band, The Cinematics or Cloud Control has released more albums?",
        "response": "The Cinematics",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Appleton International Airport and Gerald R. Ford International Airport in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What award does Crystal Palace F.C. present, first won by John McCormick and most recently by Wilfried Zaha?",
        "response": "Player of the Year",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the former chairman of the 2016 Clinton campaign found a firm in D.C.?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut was born first; Jean-Loup Chrétien or Lodewijk van den Berg?",
        "response": "Lodewijk van den Berg",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the singer/writer that had their songs music video reach three billion viewers?",
        "response": "Luis Alfonso Rodríguez López-Cepero",
        "source": "hotpot_qa"
    },
    {
        "query": "Madden NFL 2003 featured the running back who played for how many seasons in total?",
        "response": "twelve",
        "source": "hotpot_qa"
    },
    {
        "query": "Candor was a British far right-wing magazine founded by a man born in what year?",
        "response": "1899",
        "source": "hotpot_qa"
    },
    {
        "query": "What suburban county on Long Island and the easternmost county in the U.S. state of New York is the location of a village called Lindenhurst?",
        "response": "Suffolk County",
        "source": "hotpot_qa"
    },
    {
        "query": "In which part of Attica was the battle of Marathon in 490 BC fought?",
        "response": "northeastern",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times has the driver, who won the Nation's Cup with Petter Solberg, in the 2014 Race of Champions, won  the 24 Hours of Le Mans ?",
        "response": "nine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Oakland Raiders relocation to Las Vegas was a successful effort by the owner of the Oakland Raiders, the team is scheduled to begin play as the Las Vegas Raiders for the 2020 National Football League (NFL) season, playing home games at the Las Vegas Stadium, the working name for a domed stadium under construction in which city in Nevada?",
        "response": "Paradise",
        "source": "hotpot_qa"
    },
    {
        "query": "What team, who was lead by Bob Stoops in 2015, current quarterback is Baker Mayfield?",
        "response": "2015 Oklahoma Sooners football team",
        "source": "hotpot_qa"
    },
    {
        "query": "What song composed by Robert Alexander Anderson is the best known Hawaiian Christmas song?",
        "response": "Mele Kalikimaka",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the prodcution company that produced the film that was nominated for Best International Film at the 2012 Saturn Awards ?",
        "response": "Pan-Européenne",
        "source": "hotpot_qa"
    },
    {
        "query": "which ITV comedy series starring Nicholas Lyndhurst and Janet Dibley as Ashley and Elaine?",
        "response": "The Two of Us",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the director of The Man from U.N.C.L.E direct his first film?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "What album by 2Pac was released on March 14, 1995 featuring a certified Platinum hit single?",
        "response": "Me Against the World",
        "source": "hotpot_qa"
    },
    {
        "query": "Bobby Arora is the trading director of a retail chain that was formed in what year?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport that is located in Texas and is the largest hub for American Airlines",
        "response": "Dallas/Fort Worth International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Tarrafal was a prison camp established by a politician and economist who founded and led what?",
        "response": "the \"Estado Novo\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which figurine produced by Walt Disney and originally released by RKO Radio Pictures was in the collection of Musical Memories?",
        "response": "Snow White and the Seven Dwarfs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, OneRepublic or Alien Ant Farm, made their first album with producer Greg Wells during the summer and fall of 2005 at his studio, Rocket Carousel, in Culver City, California?",
        "response": "OneRepublic",
        "source": "hotpot_qa"
    },
    {
        "query": "The theatre company named after what branch of the Federal Theatre Project that boasts actors best known for her work on the 1982 musical-drama television series \"Fame\"?",
        "response": "African-American branch",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2001 film did the actress, who played the sister of McGarrett on Hawaii Five-O, make her debut?",
        "response": "Crazy/Beautiful",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the parent company of DC Direct?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Out of the Woods\" is a song by American singer-songwriter Taylor Swift, it  is the fourth track on the album, after which song, the third track from her fifth album, \"1989\" (2014)?",
        "response": "Style",
        "source": "hotpot_qa"
    },
    {
        "query": "The shooting of Stephen Ballard took place at what chain of gas stations?",
        "response": "Wawa Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "To where did a co-founder of the Women's Social and Political Union flee, leaving Rachel Barrett as the joint organiser?",
        "response": "Paris",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1992,  in which county, did  Steven A. Cohen establish the hedge funds SAC Capital Advisors?",
        "response": "Fairfield County",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2011 Census population of this village and civil parish in Lincolnshire, where Regents Academy is based?",
        "response": "759",
        "source": "hotpot_qa"
    },
    {
        "query": " 2006 Montana Grizzlies football team, who's head coach  led the Rebels to their first winning season since 2000, represented who?",
        "response": "University of Montana",
        "source": "hotpot_qa"
    },
    {
        "query": "The booth western art museum holds works of this artist, who has more than 2,000 pieces at a Museum complex in montana",
        "response": "Charles Marion Russell",
        "source": "hotpot_qa"
    },
    {
        "query": "Bear Island is one of the five islands of this town with a population of about 150 as of 2010 located in which county?",
        "response": "Hancock County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lifetime show did the actress who starred in the 1993 coming-of-age baseball film co-written and directed by David M. Evans, star in?",
        "response": "The Lottery",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Glazer and Robert Rodriguez both work as what?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Something Tells Me appeared in a 1988 film that was directed by whom?",
        "response": "Roman Polanski",
        "source": "hotpot_qa"
    },
    {
        "query": "In what division is Nicolas Dalby competing in, in the American mixed martial arts organization which features the top-ranked fighters of the sport?",
        "response": "welterweight division",
        "source": "hotpot_qa"
    },
    {
        "query": "Samuel P. Cox killed somebody on what day in the Battle of Albany?",
        "response": "October 26, 1864",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mecklenburg Investment Company Building is associated with what movement that was originally called the \"New Negro\" movement?",
        "response": "Harlem Renaissance",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2007 American psychological horror film did a Golden Globe Award nominee for High Fidelity star in?",
        "response": "1408",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more artistic skills such as directing, Mario Bava or Val Guest?",
        "response": "Mario Bava",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was perhaps not the only king of the West Saxons at the time, whos viceroy is said to have constructed Chisbury Camp, and to have founded Abingdon Abbey?",
        "response": "Centwine",
        "source": "hotpot_qa"
    },
    {
        "query": "on Wednesdays and Thursdays",
        "response": "on Wednesdays and Thursdays at 22:00",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Calgary Flame wrote the autobiography Playing with Fire?",
        "response": "Theoren Fleury",
        "source": "hotpot_qa"
    },
    {
        "query": "Summer Holiday starred what actor who won  a BAFTA in 1954>",
        "response": "David Kossoff",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Rapper from Michigan featured on the \"I Changed a Lot \"  studio album by DJ Khaled?",
        "response": "Big Sean",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Franz Viehböck or Dumitru Prunariu?",
        "response": "Dumitru-Dorin Prunariu",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Prince of Wales and Flaming beverage both non-alcoholic drinks?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the third studio album of Rihanna released?",
        "response": "May 31, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the population of the town where the Greek Revival Church on Maine State Route 231 is located in 2010?",
        "response": "5,542",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1958 born American television writer and actress contributed to the writing on I Am Not Homer?",
        "response": "Deborah \"Deb\" Lacusta",
        "source": "hotpot_qa"
    },
    {
        "query": "What pizza chain is headquartered in Texas, Papa John's Pizza or Gatti's Pizza?",
        "response": "Gatti's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the parent company of the company that distributes Afro Samurai in Australia?",
        "response": "Atari, SA",
        "source": "hotpot_qa"
    },
    {
        "query": "SAF-TE was abbreviated from what?",
        "response": "Small Computer System Interface (SCSI, )",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 film that caused Katherine Heigl to be absent from \"Invest in Love\"?",
        "response": "Greg Berlanti",
        "source": "hotpot_qa"
    },
    {
        "query": "At what age did the singer of Good Friend and a Glass of Wine rise to stardom?",
        "response": "13",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the 6th commissioner of the athletic conference that the Stephen F. Austin Lumberjacks baseball team is part of?",
        "response": "Tom Burnett",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the systems that uses the RedBoot is a double-deck, wide-body, four-engine jet airliner manufactured by European manufacturer Airbus?",
        "response": "Airbus A380",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the genuses Mentzelia and Periploca native to the same continents?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the family of twin-engine combat aircraft that carries the Thermal Imaging Airborne Laser Designator targeting pod in the UK?",
        "response": "Panavia Tornado",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a Danish televesion crime series and stars Trine Pallesen?",
        "response": "Rejseholdet",
        "source": "hotpot_qa"
    },
    {
        "query": " Beverley Knight MBE is an English recording artist heavily influenced by an American singer, songwriter, and what?",
        "response": "entrepreneur",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the singer of The Fact Is have her debut?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the band Road was also part of the Jimi Hendrix Experience?",
        "response": "Noel Redding",
        "source": "hotpot_qa"
    },
    {
        "query": "What British drama television series begins on the day where one of the biggest bombs detonated in Great Britain since War World II?",
        "response": "From There to Here",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Lent is best known as the co-writer of the memoirs of Hugh Rowland, a star on a reality television series that premiered on what date?",
        "response": "June 17, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first single by the Gorillaz that features guest appearances by Snoop Dogg?",
        "response": "Stylo",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is located 8 miles East of Utkinton and also lies on the River Weaver south of Northwich and west of Middlewich?",
        "response": "Winsford",
        "source": "hotpot_qa"
    },
    {
        "query": "What Russian composer and pianist was friends with Canadian composer, pianist, writer on music, and music educator Alfred La Liberté?",
        "response": "Alexander Scriabin",
        "source": "hotpot_qa"
    },
    {
        "query": "Kebo Gotti appeared on which American rapper's fourth and final single from the 2010 debut album \"Flockaveli\", the rapper is better known as who?",
        "response": "Waka Flocka Flame",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Ely Buendia or Joseph Williams?",
        "response": "Joseph Stanley Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Kwok Kin Pong or Edison Chen?",
        "response": "Edison Koon-hei Chen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote  a tragedy that John Sinklo performed with Sussex's men in?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "Christopher Nixon Cox is the son of an American politician who is currently the chairman of what?",
        "response": "New York Republican State Committee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brewpub run by the brewing company that serves as the home base of Greensky Bluegrass?",
        "response": "Eccentric Cafe",
        "source": "hotpot_qa"
    },
    {
        "query": "The Night Club Lady is a 1932 American Pre-Code mystery film directed by Irving Cummings, and starring which American film and theater actress, and appeared in over 30 films, as well as on Broadway?",
        "response": "Mayo June Methot",
        "source": "hotpot_qa"
    },
    {
        "query": "Splendor in the Grass was a film directed by a Greek-American director described as  \"one of the most honored and influential directors in Broadway and Hollywood history\" by who?",
        "response": "The New York Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Minnesota functionals were developed at which Minnesota city?",
        "response": "Twin Cities",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show on which \"The Locomotion Interruption is an episode?",
        "response": "Chuck Lorre and Bill Prady",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the former member of Team Halfords Bikehut who currently works as an environmental consultant?",
        "response": "7 July 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "What Andy Williams' album did a song written by Charles Wesley appear on?",
        "response": "The Andy Williams Christmas Album",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Salford Quays regenerated before or after the opening of Harbour City tram stop?",
        "response": "following the closure of the dockyards in 1982.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth year of the director of a company which manufactured the product 'Marlboro'?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ruggero Deodato from Italy, and Mexican Alejandro Springall, both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dan Muller's birth city is near what national park?",
        "response": "Glacier National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Washington based nonprofit healthcare organization that was a pioneer to the Medical facilities of Seattle?",
        "response": "Group Health Cooperative",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the population of the place where Pond Monkeys were based ",
        "response": "8,087",
        "source": "hotpot_qa"
    },
    {
        "query": "In what month was the Rihanna song that Mikky Ekko is best known for being featured on released?",
        "response": "January",
        "source": "hotpot_qa"
    },
    {
        "query": "Tupac Shakur's music was featured in what musical?",
        "response": "Holler If Ya Hear Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the novel which All the Way Home is based on?",
        "response": "James Agee",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the company that ran the airplane hijacked on 11-24-1968 founded?",
        "response": "1927",
        "source": "hotpot_qa"
    },
    {
        "query": " Pramod Bhasin was the former CEO of a company that provided what kind of services?",
        "response": "IT",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the screenplay for the movie that Dana Barron played Audrey Griswold in?",
        "response": "John Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "What long-disctance trail that is part of the Neusiok Trail?",
        "response": "Mountains-to-Sea Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "Which american president's father was a farmer and he was a former US representative from NY?",
        "response": "Millard Fillmore",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Local Natives or Material Issue originate in Chicago?",
        "response": "Material Issue",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song from the album \"Help!\" was covered in the fourth studio album by composer and producer Kramer released in 1998?",
        "response": "You've Got to Hide Your Love Away",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is best known for his bass playing and work with the bands King Crimson and Bad Company, Boz Burrell or Jon Hume ?",
        "response": "Raymond \"Boz\" Burrell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Asian American who has coached LeBron James in his professional career in the National Basketball Association?",
        "response": "Erik Spoelstra",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine cover did the model who also worked for the founder of the SpA company appear on?",
        "response": "Vogue",
        "source": "hotpot_qa"
    },
    {
        "query": "In which publication did the great 19ty-century liberal philosopher John Stuart Mill explain the harm principle, of exercising power over others only to protect them from harm?",
        "response": "On Liberty",
        "source": "hotpot_qa"
    },
    {
        "query": "Myron F. Diduryk's exploits were described in a book by an author holding what military rank?",
        "response": "lieutenant general",
        "source": "hotpot_qa"
    },
    {
        "query": " John O'Sullivan is currently the editor of what Australian monthly magazine that reviews literature as well as features essays on ideas such as politics, history, universities and the arts?",
        "response": "Quadrant",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city is the Lowry hotel, which opened featuring a restaurant run by celebrity chef Marco Pierre White?",
        "response": "Salford",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fifth studio album by Northern Irish singer-songwriter Van Morrison did Bill Church leave Sawbuck for?",
        "response": "Tupelo Honey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which award was won in 1990, by the scorer of the tying run in game 7 of the 1992 National League Championship ?",
        "response": "Rookie of the Year Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full birth name of the singer who sang \"All Alone Am I\"?",
        "response": "Brenda Mae Tarpley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the legislature for which Minnesota Senate election, 1980 was held  is the bicameral legislature of the U.S. state of Minnesota consisting of two houses: the Senate and the House of Representatives?",
        "response": "Minnesota Legislature",
        "source": "hotpot_qa"
    },
    {
        "query": "Sugoi Japan Award is an event that awards Manga, Anime, Light novel, and Entertainment novels. These entertainment styles was development in what century?",
        "response": "19th century",
        "source": "hotpot_qa"
    },
    {
        "query": "Sam Houston, was a bodyguard to Gen. George Washington and was one of the first residents of Searsport, Maine, and is depicted in which 1851, oil-on-canvas painting by the German American artist Emanuel Gottlieb Leutze? ",
        "response": "Washington Crossing the Delaware",
        "source": "hotpot_qa"
    },
    {
        "query": "What person, known also as Jane Ryan, has a four lane highway in the Philippines name after her? ",
        "response": "Imelda Marcos",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress, voice actress, screenwriter, producer, and director was featured in \"King of the Hill\" and \"Mongo Wrestling Alliance?\"",
        "response": "Pamela Adlon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the American adventure film of a shipwrecked family building an island home, Swiss Family Robinson or Tonka?",
        "response": "Swiss Family Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Tingsted Church was built in which style of medieval Europe with semi-circular arches?",
        "response": "Romanesque Architecture",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Stauntonia and Pimelea?",
        "response": "plant",
        "source": "hotpot_qa"
    },
    {
        "query": "Fort King George State Historic Site is which type of military constructions or buildings designed for the defense of territories in warfare, and also used to solidify rule in a region during peace time, located in the U.S. state of Georgia in McIntosh County, adjacent to Darien?",
        "response": "Fortifications",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2012 documentary film about the Welsh artist best known for his work with Hunter S. Thompson?",
        "response": "Charlie Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, The Three Lives of Thomasina or The Shaggy Dog?",
        "response": "The Shaggy Dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Yas Taalot recorded a song with which former member of A Perfect Circle?",
        "response": "Twiggy Ramirez",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of vine, Bougainvillea or Mimetes?",
        "response": "Bougainvillea",
        "source": "hotpot_qa"
    },
    {
        "query": "Stockely Webster has paintings hanging in what home (that serves as the residence for the Mayor of New York)?",
        "response": "Gracie Mansion",
        "source": "hotpot_qa"
    },
    {
        "query": "Science & Nature includes a cover of a Rolling Stones song written by whom?",
        "response": "Mick Jagger and Keith Richards",
        "source": "hotpot_qa"
    },
    {
        "query": "Durring what war was the \"U-1304\" used by the navy of Nazi Germany from 1935 to 1945.?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this Spanish professional footballer who plays as a midfielder and was featured in 5 Magazine?",
        "response": "Juan Mata",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Australian mammalogist wrote Chasing Kangaroos ",
        "response": "Timothy Fridtjof",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the father of the professional ice hockey player with the middle name \"Fosgaard\" born?",
        "response": "June 13, 1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What peer-reviewed scientific journal, started in 1970, discusses a geometric theory published by Albert Einstein?",
        "response": "Reports on Mathematical Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacob C. Spores House is located north of city located how far east from the Oregon Coast ?",
        "response": "50 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Gilbert Blount worked under what person who is considered  \"one of the most ingenious and prolific figures in engineering history\" and \"one of the 19th century engineering giants\"?",
        "response": "Isambard Kingdom Brunel",
        "source": "hotpot_qa"
    },
    {
        "query": "What british comic artist had illustrations in the novel entitled Danger Society: The Young Bond Dossier?",
        "response": "Kev Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is both Kpandae and Kpandai District located within?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the Bonne de Luxembourg on her father's side?",
        "response": "Henry VII",
        "source": "hotpot_qa"
    },
    {
        "query": "The company Lena Himmelstein Bryant Malsin founded began in what year?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brewing company who brewed Bevo in the early 20th century, and is based in St. Louis, Missouri?",
        "response": "Anheuser-Busch",
        "source": "hotpot_qa"
    },
    {
        "query": "Which President of the United States planned to trade and build skyscrapers in German in 2000?",
        "response": "Donald Trump",
        "source": "hotpot_qa"
    },
    {
        "query": "Who holds the Director position in a multinational professional services firm headquartered in London?",
        "response": "Nille Juul-Sørensen",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rapper, comedian, television personality, television host and actress hosted Girl Code Live?",
        "response": "Awkwafina",
        "source": "hotpot_qa"
    },
    {
        "query": "The Monument to the Unknown Hero built in 1934-1938 is located in which country and is similar to many other tombs of the unknown soldier?",
        "response": "Serbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published by Condé Nast, Design News or Architectural Digest?",
        "response": "Architectural Digest",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the college where C. Hassell Bullock is a professor founded?",
        "response": "1860",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1938 comedy starring the husband of Cyd Charisse?",
        "response": "William A. Seiter",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is broadcaster of World Have Your Say headquartered?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the origination of the beer that is similar to most of Austria's beer?",
        "response": "Bavaria",
        "source": "hotpot_qa"
    },
    {
        "query": "Bounce is currently hosted by what former Australian football player born in 1979",
        "response": "Cameron Mooney",
        "source": "hotpot_qa"
    },
    {
        "query": "What public holiday traditionally sees the start of the Sydney to Hobart Yacht Race at noon?",
        "response": "Boxing Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American-Canadian Actress stars in Dragon: The Bruce Lee Story?",
        "response": "Lauren Holly",
        "source": "hotpot_qa"
    },
    {
        "query": "The town that is the starting point for the Boston Marathon is also home to a multinational corporation that was added to the New York Stock Exchange in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Which the city where Age of Fishes Museum is located is counter intuitively pronounced?",
        "response": "Canowindra",
        "source": "hotpot_qa"
    },
    {
        "query": "Which largest Spanish-speaking country has the Goya albivenella?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Sergio Leone or Marc Evans?",
        "response": "Sergio Leone",
        "source": "hotpot_qa"
    },
    {
        "query": "which comedian features on Thundershots and Saturday Night Live?",
        "response": "Michael Che",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animated cartoon character in the Warner Brothers \"Looney Tunes\" series did the mouse go to for help because it distrusted Daffy?",
        "response": "Speedy Gonzales",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Boghossian and Strawberry Saroyan, are of which mutual nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Shuanghe and Zhuozhou, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Karen Blixen and Julian Barnes both used pseudonyms in their works. ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of rock do cambarus cryptodytes live near?",
        "response": "Paleogene carbonate rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Ritwik Ghatak and Jehane Noujaim, are Bengali?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Cliff Hague is Emeritus Professor of Planning and Spatial Development at a university established in what year?",
        "response": "1821",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the corrupt politician in the CBS series inspired by Moonrunners",
        "response": "Jefferson Davis \"Boss\" Hogg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Krusty Krab is a fictional fast food restaurant in a tv series created by who?",
        "response": "Stephen Hillenburg",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does J. T. Petty and Outlast have in common?",
        "response": "video game",
        "source": "hotpot_qa"
    },
    {
        "query": "Ludwig van Beethoven's Cello Sonata No. 3 in A major, Op. 69 was written in 1808, in the same year Beethoven also completed and published his Fifth and Sixth Symphonies, composed and completed in 1808, which was first performed in the Theater an der Wien on which date, in a four-hour concert?",
        "response": "22 December 1808",
        "source": "hotpot_qa"
    },
    {
        "query": "Which beer is now produced by AB Inbev and was popularly known as The Cream of Manchester?",
        "response": "Boddingtons Bitter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born in 1922 and published a book in 1985 by Delacorte Press?",
        "response": "Kurt Vonnegut",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was captain of the Netherlands national team who scored a goal in the 2010 DFB-Pokal Final born?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the king who ruled in the South West of England, and became the ruler of Mercia upon the death of his sister?",
        "response": "Edward the Elder",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Atchison was the President of the theme park that had headquarters in what city?",
        "response": "Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "what band recorded their third single from their self titled debut studio album from december 2008 to february 2009?",
        "response": "The xx",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the man that resigned as the president of Israel before the Israeli presidential election, 2000 born?",
        "response": "1924",
        "source": "hotpot_qa"
    },
    {
        "query": "The city that hosted the Virginia Renaissance Faire between 1996 and 1999 had a population of 24,286 in what census?",
        "response": "the 2010 census",
        "source": "hotpot_qa"
    },
    {
        "query": "The water-based dark ride in Walt Disney is connected to a song known for what?",
        "response": "most performed song of all time",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the senator for Nassau County, New York, United States?",
        "response": "John Brooks",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are  Xi'an District, Liaoyuan and Shouguang located?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city were the Track Marshall brand of earthmoving equipment manufactured?",
        "response": "Gainsborough, Lincolnshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Juan Pablo Di Pace appeared in a musical with music from what successful pop group?",
        "response": "ABBA",
        "source": "hotpot_qa"
    },
    {
        "query": "What NFL team drafted the USC quarterback on the cover of NCAA Football 10",
        "response": "New York Jets",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sord Computer Corporation and Apple I both PC manufacturers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth name of the man that created \"Fourth World\"?",
        "response": "Jacob Kurtzberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Israeli actress, Odeya Rush, is known for her lead role in 2015 American horror comedy film based on the children's book series created by what author?",
        "response": "R.L. Stine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Greek film director Andrew Lau or Yannis Smaragdis? ",
        "response": "Iannis Smaragdis (Greek: Γιάννης Σμαραγδής ) is a Greek film director.",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2013–14 Phoenix Suns season brought back a player who now plays for what team?",
        "response": "Houston Rockets",
        "source": "hotpot_qa"
    },
    {
        "query": "when did the black Angolan was one of the earliest African-American landowners in what would become the United States.acieved his freedom ",
        "response": "in the early 17th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "E. J. Singler plays for the Canadian G League basketball team based in what city?",
        "response": "Mississauga, Ontario",
        "source": "hotpot_qa"
    },
    {
        "query": "By which professor from the territory's second oldest university (CUHK) the post-reform era Socialism 3.0 was proposed?",
        "response": "Professor Wang Shaoguang",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose father adopted Jeremiah Porter in 2015?",
        "response": "Ben Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie directed by Peggy Holmes stars the voice of Anjelica Huston as narrator?",
        "response": "Secret of the Wings",
        "source": "hotpot_qa"
    },
    {
        "query": "Which traditional event that began on 26 December did the Pakistani cricket team replace with a tour of South Africa during the 2012-13 cricket season?",
        "response": "Boxing Day Test",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the star that acted in both Now Add Honey and Lightning Point?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is special about the truth to promises album byHeavy/Power metal band Symphorce.",
        "response": "Power metal band",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the former political position of the president who appointed Melvyn R. Paisley United States Assistant Secretary of the Navey (Research, Engineering and Systems)?  ",
        "response": "33rd Governor of California",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Michael Jackson and Joe Strummer the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "For what console was the sequel to the Shenmue Online MMORPG released?",
        "response": "Dreamcast",
        "source": "hotpot_qa"
    },
    {
        "query": "What two occupations do  Alberto Cavalcanti and Oscar Apfel have in common?",
        "response": "film director and producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1956 American drama film was Albert Akst nominated for an Academy Award on?",
        "response": "Somebody Up There Likes Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Pat Smear joined what American rock band, co-founded by Kurt Cobain, as a touring guitarist?",
        "response": "Nirvana",
        "source": "hotpot_qa"
    }
]