[
    {
        "query": "Which author's work has been translated into more languages, Natalia Ginzburg or Glenn Cooper?",
        "response": "Glenn Cooper",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the professional baseball team based in Washington DC which played at RFK Stadium and Nationals Park and for whom Melvin Dorta had his debut in 2006?",
        "response": "Washington Nationals",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was titled after T. E. Lawrence the same year John Steinbeck was awarded the Nobel Prize in Literature?",
        "response": "Lawrence of Arabia",
        "source": "hotpot_qa"
    },
    {
        "query": "Love's Travel Stops and Country Stores is a chain of truck stops that include which fast-food restaurant established in NC in 1960?",
        "response": "Hardee's Food Systems",
        "source": "hotpot_qa"
    },
    {
        "query": "MGS and LRS are relays of an Australian television station owned and operated by who?",
        "response": "Network Ten",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1964 Norman Rockwell painting is considered the iconic image of the Civil Rights Movement?",
        "response": "The Problem We All Live With",
        "source": "hotpot_qa"
    },
    {
        "query": "Which knight and actor played Iago in the 1995 film of Othello?",
        "response": "Kenneth Branagh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Brink's robbery of 1981 was an armed robbery and three related murders committed on October 20, 1981, which were carried out by six Black Liberation Army members, including Mutulu Shakur, he was a close friend of who?",
        "response": "Geronimo Pratt",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical featured the song \"Tick, Tick... Boom!\" by a 3 time Tony winner?",
        "response": "Rent",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the singer of Paper or Plastic born?",
        "response": "July 20, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the shopping mall, located near Therrell High School in Atlanta, open?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Shin Hye-sung and Trent Reznor, have which mutual occupations?",
        "response": "singer, songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "What do the University of California, Davis and University of Oklahoma have in common?",
        "response": "public research university",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Howard M. Mitchell and Coleman Francis direct silent films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are a Fuzzy navel and Pastis both alcoholic beverages?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie combined the work of English film editor Jake Roberts and director John Crowley?",
        "response": "Brooklyn",
        "source": "hotpot_qa"
    },
    {
        "query": "Won Shin-yun, is a South Korean film director, he has shown strong talent in which 2013 South Korean spy-action thriller film?",
        "response": "The Suspect",
        "source": "hotpot_qa"
    },
    {
        "query": "Frannie Lindsay earned her B.A. from a women's college in Troy, New York, that is one of three colleges that make up what?",
        "response": "The Sage Colleges",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the other offcies of an e-commerce marketplace who's headquarter is  Jaipur, Rajasthan?",
        "response": "Udaipur, Bangalore and Pune",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the hub of the airline that was a main sponsor of the 2007 Lexus Cup?",
        "response": "Singapore Changi Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "In what movie did Scott Paulin portray a World War II pilot who later became an astronaut?",
        "response": "The Right Stuff",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the official name of the nation for which Jose Semedo plays football?",
        "response": "Republic of Cabo Verde",
        "source": "hotpot_qa"
    },
    {
        "query": "The devut studio album by English recording artist, fashion designer, and songwriter, Nicola Roberts, is a concept derived from what?",
        "response": "fairy tales",
        "source": "hotpot_qa"
    },
    {
        "query": "Cole Younger was an outlaw leader with a gang based in what state?",
        "response": "Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": " In what year was the University that hosted the decathlon in the 1980 USA Outdoor Track and Field Championships founded ?",
        "response": "1876",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Girls Girls\", was released by Atlantic Records founded by who?",
        "response": "Ahmet Ertegün and Herb Abramson",
        "source": "hotpot_qa"
    },
    {
        "query": "What Slovenian basketball player played was traded from the Phoenix Suns to the Miami Heat?",
        "response": "Goran Dragić",
        "source": "hotpot_qa"
    },
    {
        "query": "The Little River is a 7.2 mile long (11.6 km) river largely in the town of Exeter in Rockingham County, New Hampshire, it is a tributary of the Exeter River, part of the Great Bay/Piscataqua River watershed in which New Hampshire region, the southeast area of the U.S. state of New Hampshire that includes the eastern portion of Rockingham County and the southern portion of Strafford County?",
        "response": "Seacoast Region",
        "source": "hotpot_qa"
    },
    {
        "query": "A-Hunting We Will Go is a popular folk song and nursery rhyme by who, he was an English composer, best known for the patriotic song \"Rule Britannia\"?",
        "response": "Thomas Arne",
        "source": "hotpot_qa"
    },
    {
        "query": "The New englands quarterback that has won 2 super bowls and is on what installment of of the Madden NFL series?",
        "response": "29th installment",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the University, of which The Dove Marine Laboratory is a part, gain University status ? ?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician born on April 27, 1942 was featured in John Hiatt's eighth album \"Bring the Family?\"",
        "response": "Jim Keltner",
        "source": "hotpot_qa"
    },
    {
        "query": "Bennington, the radio show is hosted on a broadcasting company with a Canadian affiliate company called?",
        "response": "SiriusXM Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "The duo who created \"The Bedsit Tapes\" came to prominence in what decade?",
        "response": "1980s",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Australian state leader of Australian Conservatives was formerly a member of the Family First Party?",
        "response": "Dennis Hood",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathy Sullivan was a chairwoman of which affiliate of the Democratic party?",
        "response": "New Hampshire Democratic Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Cornelis Gerrit \"Kees\" van der Staaij, is a Dutch politician of the Reformed Political Party, he has been an MP since 19 May 1998 and focuses on matters including Kingdom relations of which location, commonly known as the Netherlands, is a sovereign state and constitutional monarchy with the large majority of its territory in western Europe and several small islands in the Caribbean Sea, in the West Indies islands (Leeward Islands / Lesser Antilles)?",
        "response": "Kingdom of the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Scottish term and quarter days are the four divisions of the legal year, historically used as the days when contracts and leases would begin and end, servants would be hired or dismissed, and rent, interest on loans, and ministers' stipends would become due, Lammas is one of the Quarter Days, Lammas Day (Anglo-Saxon \"hlaf-mas\", \"loaf-mass\"), is a holiday celebrated in some English-speaking countries in the Northern Hemisphere, usually between 1 August and 1 of which month?",
        "response": "September",
        "source": "hotpot_qa"
    },
    {
        "query": "A low cost airline made plans to operate intercontinental flights from its home at the main domestic hub and international airport in Norway, and second-busiest airport in the Nordic countries, to the International airport in what American city? ",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is a Struthio camelus?",
        "response": "2.75 m",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacky Vincent is an English musician who was the lead guitarist and backing vocalist of a rock band formed in what year?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Hotline Bling released as part of an album?",
        "response": "April 29, 2016,",
        "source": "hotpot_qa"
    },
    {
        "query": "What outspoken abolitionist and author of \"An Appeal to the Coloured Citizens of the World\" was also the father of one of the first black men to pass the Massachusetts bar?",
        "response": "David Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the 1976 European Cup Final ,which featured Dominique Rocheteau, played at?",
        "response": "Hampden Park, Glasgow",
        "source": "hotpot_qa"
    },
    {
        "query": "What James Bond film did the actress who played Bathsheba in The Story of David star in?",
        "response": "Live and Let Die",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of film are both \"500 Years Later\" and \"Manson\"?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill Harry is the creator of the publication that was founded in what city?",
        "response": "Liverpool",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Pavlovich Dianin, was a Russian chemist from Saint Petersburg, and was married to the adopted daughter of fellow chemist Alexander Borodin, was a Russian Romantic composer of Georgian origin, as well as a doctor and chemist, he was one of the prominent 19th century composers, known as what?",
        "response": "The Mighty Handful",
        "source": "hotpot_qa"
    },
    {
        "query": "What ocean is home of the Hawaiian-Emperor seamount chain and Kure Atoll?",
        "response": "the Pacific Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": " Umaru Mutallab had a son who tried to detonate materials about the flight that took place on what date?",
        "response": "December 25, 2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played drums on the album The Sky's Gone Out?",
        "response": "Kevin Haskins",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county of New York was Circumstantial Productions founded?",
        "response": "Rockland County",
        "source": "hotpot_qa"
    },
    {
        "query": "What southern part of the Kingdom of Slavonia straddled the borderland of the Habsburg Monarchy?",
        "response": "The Military Frontier",
        "source": "hotpot_qa"
    },
    {
        "query": "In V for Vendetta the actor of an anarchist freedom fighter is best known for playing who in The Matrix?",
        "response": "Agent Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the English football club which George Goldsmith once played for located? ",
        "response": "Tottenham, Haringey, London",
        "source": "hotpot_qa"
    },
    {
        "query": "At which university does Frank Martin coach the Gamecocks at basketball?",
        "response": "University of South Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "What republic was started because of a dispute in the area The Green Mountain Boys were a militia?",
        "response": "Vermont Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the first performance of the musical which features a character named Mr. Mistoffelees?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What pictures Teresa of Ávila and is located in a church about two blocks northwest of Piazza della Repubblica and Teatro dell'Opera metro stop?",
        "response": "Ecstasy of Saint Teresa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the father of the Mughal King born in Mukundpur?",
        "response": "Shah Alam II",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the transportation company that owns Talbot based in?",
        "response": "Montreal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Malasian-Austrailan film, born in 1977 that was discovered at the Melbourne Underground Film Festival?",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "Ford v. Wainwright and Gravel v. United States, both are which organization cases?",
        "response": "Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was known for playing a fictionalized version of the wild politician who was the face of communist scare tact's in the early 1950's?",
        "response": "James Gregory",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film premiered more recently, Sweet Crude or My Generation?",
        "response": "Sweet Crude",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian singer has Melissa VanFleet been compared to?",
        "response": "Alanis Morissette",
        "source": "hotpot_qa"
    },
    {
        "query": "Julianna Cox was a character played by which American actress?",
        "response": "Michelle Renee Forbes Guajardo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who vacated the seat for which a Republican nominee ran who was suspended from his court position in 2016?",
        "response": "Jeff Sessions",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian actor appears as a supporting actor in The Divergent Series: Insurgent?",
        "response": "Keiynan Lonsdale",
        "source": "hotpot_qa"
    },
    {
        "query": "How many assists did the Bosnian football player account for during the 2008–09 VfL Wolfsburg season?",
        "response": "20 assists",
        "source": "hotpot_qa"
    },
    {
        "query": "Arianrhod RPG is a Japanese fantasy role-playing game released in 2004, at present, Arianrhod RPG is one of the most popular traditional RPG in Japan like as Sword World 2.0, and Alshard, a Japanese role-playing game designed by Jun'ichi Inoue, and which organization?",
        "response": "FarEast Amusement Research",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musican is older, Tom Verlaine or David Vincent?",
        "response": "Tom Verlaine",
        "source": "hotpot_qa"
    },
    {
        "query": "In which album was the Lionel Richie-composed hit ballad released by American soul group the Commodores and produced by James Anthony Carmichael?",
        "response": "Natural High",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Jack Green and Gerard Kuiper have in common?",
        "response": "professor",
        "source": "hotpot_qa"
    },
    {
        "query": "What mountain range is Area 51 located in?",
        "response": "Groom Range",
        "source": "hotpot_qa"
    },
    {
        "query": "Which athlete was an American tennis player: Henri Kontinen or Melanie Oudin?",
        "response": "Melanie Oudin",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tim Parry Johnathan Ball Foundation for Peace was named after the two persons lost in the bomb attacks that took place on what 1993 date?",
        "response": "26 February",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player born in 1969 is the son of Bob Boone?",
        "response": "Bret Boone",
        "source": "hotpot_qa"
    },
    {
        "query": "Patten gymnasium is in Evanstan, Illinois, United States on the campus of?",
        "response": "Northwestern University",
        "source": "hotpot_qa"
    },
    {
        "query": "Bram Stoker's Dracula was directed by the creator of what Gothic soap opera?",
        "response": "Dark Shadows",
        "source": "hotpot_qa"
    },
    {
        "query": "Dora Old Elk  grew up on an indian reservation established in what year?",
        "response": "1868",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members, The Rockfords or The Heavy?",
        "response": "The Rockfords",
        "source": "hotpot_qa"
    },
    {
        "query": "What new policy suspened former Baltimore Orioles playerRafael Palmeiro?",
        "response": "steroid policy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band released the album \"Megalithic Symphony\", Awolnation or World Party?",
        "response": "Awolnation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1971 drama film starred a professional football player?",
        "response": "Black Chariot",
        "source": "hotpot_qa"
    },
    {
        "query": "What Transit company that was founded in 1980 has bus route that service the Walt Whitman Shops?",
        "response": "Suffolk County Transit",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the book that was written by the author of Metamagical Themas?",
        "response": "Gödel, Escher, Bach: An Eternal Golden Braid",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the high school attended by Ray Romero founded?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "Phil Edwards is an American surfer from California whose photo appeared in the cover of what magazine which has over 3 million subscribers and is read by 23 million people each week?",
        "response": "Sports Illustrated",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the the ship launched ,that along with the Tripitz and the Lützow was a target for  Operation Source ?",
        "response": "3 October 1936.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who wrote the music for \"Smile\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Sumitro was a prominent Indonesian General during which Indonesian's presidency?",
        "response": "Suharto",
        "source": "hotpot_qa"
    },
    {
        "query": "Gerard F. Conway, is an American writer of comic books and television shows, he is known for scripting the death of the character Gwen Stacy during his long run on which TV show?",
        "response": "The Amazing Spider-Man",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist's work was sampled as part of Larry Sanders' collaboration with Coolio?",
        "response": "Stevie Wonder's",
        "source": "hotpot_qa"
    },
    {
        "query": "Which video game company, headquartered in Kyoto, continues to produce Mario games for current generation consoles?",
        "response": "Nintendo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of city that the 1961 NCAA Division I Men's Ice Hockey Tournament took place in?",
        "response": "Mile-High City",
        "source": "hotpot_qa"
    },
    {
        "query": "Songs of Minutes is a 2001 album by jazz band Erik Vermeulen trio contains covers from American composer of popular music who composed song for what 1939 film?",
        "response": "The Wizard of Oz",
        "source": "hotpot_qa"
    },
    {
        "query": "San Marco and Medina are both what type of game?",
        "response": "board",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ralph Saenz and Tom Chaplin both from England?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pianist is a memoir in which the author survives with the help of which German Army officer?",
        "response": "Wilhelm Adalbert Hosenfeld",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Earned It\", is a song by Canadian singer The Weeknd, the song was released as the lead single from the soundtrack to the film \"Fifty Shades of Grey\", released in which year?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the current name of the fort that Phineas Stevens defended in April 1747?",
        "response": "Charlestown",
        "source": "hotpot_qa"
    },
    {
        "query": "Which court case set voting requirements, Oregon v. Mitchell or Barron v. Baltimore?",
        "response": "Oregon v. Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "Colonel Humphrey Mews was Deputy Private Secretary to which member of the British royal family?",
        "response": "Charles, Prince of Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Strange Kind of Woman\" featured on American and Canadian versions of the 1971 album Fireball by which British band?",
        "response": "Deep Purple",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the army officer who resigned after an attack by least ten Taliban fighters?",
        "response": "Afghan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the British dancer, director and choreographer who was part of the judge of Stepping Out born ",
        "response": "17 July 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Romanian footballer played for Petrolul Ploiesti and is a higher scorer than the all-time scorer for Steaua?",
        "response": "Mircea Dridea",
        "source": "hotpot_qa"
    },
    {
        "query": "Panama Pacifico International Airport's first commerical airline service is partly owned by who?",
        "response": "Ryanair",
        "source": "hotpot_qa"
    },
    {
        "query": "The George Perkins Marsh Boyhood Home, also known as the Marsh-Billings House, is the architectural centerpiece of Marsh-Billings-Rockefeller National Historical Park, in Woodstock, Vermont, United States,  The 550 acre estate on which it stands was given by Mary French Rockefeller (the granddaughter of Frederick Billings) and which American philanthropist, businessman, financier, and major conservationist?",
        "response": "Laurance Spelman Rockefeller",
        "source": "hotpot_qa"
    },
    {
        "query": "Libra is a novel written by an American essayist whose works have covered the advent of what?",
        "response": "the digital age",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Irvine is a small village east of what city?",
        "response": "Sydney",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1st Earl of Nottingham commanded the English fleet against a fleet that contained how many ships?",
        "response": "130",
        "source": "hotpot_qa"
    },
    {
        "query": "Robyn Karney used to be a critic for what film magazine published monthly by Bauer Consumer Media of Hamburg ",
        "response": "Empire",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of person does Ian Johns and World Series of Poker have in common?",
        "response": "player",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the woman who used the song \"Let's Light It Ip\" by Kari Meredyth Kimmel as entrance music born?",
        "response": "March 19, 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Love is Blindness was the final track on the 1991 U2 album produced by which two men?",
        "response": "Daniel Lanois and Brian Eno",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was established first Texas Tech University or University of California, San Diego ?",
        "response": "Texas Tech University",
        "source": "hotpot_qa"
    },
    {
        "query": "Our Race Will Rule Undisputed Over The World is a fabricated speech often cited in which type of propoganda, that exhibits hostility to, prejudice, or discrimination against Jews?",
        "response": "Antisemitism",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mother of Mary, Crown Princess of Denmark's husband?",
        "response": "Queen Margrethe II",
        "source": "hotpot_qa"
    },
    {
        "query": "Which advocate for Bitcoin is also an executive with Lemon Wallet?",
        "response": "Wences Casares",
        "source": "hotpot_qa"
    },
    {
        "query": "The team captain of the 2008–09 Chicago Blackhawks season was born in what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Union Square is located at the foot of which historic neighborhood in Washington, D.C.?",
        "response": "Capitol Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Humphrey (VII) de Bohun, 4th Earl of Hereford (1276 – 16 March 1322) was a member of a powerful Anglo-Norman family of the Welsh Marches and was one of the Ordainers who opposed the excesses of Edward II, he was King of England from 1307 until he was deposed in January, of which year?",
        "response": "1327",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Alexander Hall and Jon Amiel both considered film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "W. Davis Merritt was an editor of a newspaper owned by who?",
        "response": "The McClatchy Company",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat is the birthdate of this English football manager and former professional player, whose second season as manager of the Reading F.C. was 2000-01?",
        "response": "18 July 1961",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the founder of this group, which co-managed Virgin Racing along with Manor Motorsport and Wirth Research born?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "What CD music retailer operates in the most densely populated borough of New York City?",
        "response": "Other Music",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Grammy awards were won by an album named after the Joni Mitchell song from Love Actually?",
        "response": "two Grammy awards",
        "source": "hotpot_qa"
    },
    {
        "query": "For which team in the National Hockey League does this Canadian professional ice hockey defenceman, who was named top defenceman during the 2008 IIHF World Championship, play currently?",
        "response": "San Jose Sharks",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both Ingmar Bergman and Geir Hansteen Jörgensen?",
        "response": "Swedish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is Japanese, Tony Scott or Takashi Shimizu?",
        "response": "Takashi Shimizu",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the person who instituted the Indian Independence Medal?",
        "response": "14 December 1895",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike's Hard Lemonade is distributed by what Belgian-owned Canadian beer company founded by John Kinder Labatt in 1847 in London, Ontario?",
        "response": "Labatt Breweries of Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university offers more types of degrees, the University of Engineering and Technology, Lahore or California State University, Sacramento?",
        "response": "California State University, Sacramento",
        "source": "hotpot_qa"
    },
    {
        "query": "Which European composer was regarded as a great contemporary of Beethoven, Luigi Cherubini or Charles Gounod?",
        "response": "Beethoven regarded Cherubini as the greatest of his contemporaries.",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Paul Theodore Pojman hold at one of the largest public universities in Maryland that still produces the most teachers of any university in the state?",
        "response": "professor of philosophy",
        "source": "hotpot_qa"
    },
    {
        "query": "Piano Concerto was premiered by a pianist who has what ethnicity?",
        "response": "Chinese",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Woods followed David Moyes to Manchester United to be the new goalkeeping coach and replace another coach born in which year ?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of the operetta \"Chris and the Wonderful Lamp\" shares a nickname with what other composer?",
        "response": "Kenneth J. Alford",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rugby team plays in the Super League and was one of the contestors of the 1982 Challenge Cup?",
        "response": "Widnes Vikings",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sam Mendes and John Rawlins both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous convention center is in the same neighborhood as the Boston Society of Natural History?",
        "response": "Hynes Convention Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Carol Thurston starred in eight episodes of \"The Life and Legend of Wyatt Earp\" and also in which 1953 film directed by Spencer G. Bennet?",
        "response": "Killer Ape",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the subject of the song \"What Do You Want from Me?\" by Peter Hook win? ",
        "response": "BAFTA",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed both Fritz the Cat and Heavy Traffic?",
        "response": "Ralph Bakshi",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the profession of the person by who's name a memoir exists and the film \"Stronger\" is made?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Who from the Black Eyed Peas released a debut solo album in 2006?",
        "response": "Fergie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Sunye or Stephen Pearcy?",
        "response": "Stephen Pearcy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital is older, George Washington University Hospital or Howard University Hospital?",
        "response": "Howard University Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the movie based on the board game that the actor known for his work in John Carter, Savages, and Lone Survivor also starred in?",
        "response": "Peter Berg",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the writer of \"Inescapable\" rise to prominence?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "The plaintiff of Paul v. Clinton was convicted for business dealing with whom?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times longer than an Association football pitch is the stadium in Prague at which the Spartakiads took place?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more people, Zhaoqing or Kangding?",
        "response": "Zhaoqing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which restaurant was founded first, Papa Murphy's or Gino's Pizza and Spaghetti?",
        "response": "Gino's Pizza and Spaghetti",
        "source": "hotpot_qa"
    },
    {
        "query": "Best Of was recorded by which American major record label whose parent company was Universal Music Group?",
        "response": "Interscope Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What leaning does the government that introduced the Windfall Tax have?",
        "response": "centre-left",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor, singer, dancer, comedian, and musician died who's screen name was Danny Kaye and was also present with Virginia Mayo in a series?",
        "response": "March 3, 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lucia di Lammermoor and The Bartered Bride both comic operas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What monster truck team was created by a man from Kill Devil Hills?",
        "response": "Grave Digger",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor who played roles in both \"The Manchurian Candidate\" and \"Barney Miller\" also featured in American anthology series \"Police Story\"?",
        "response": "James Gregory",
        "source": "hotpot_qa"
    },
    {
        "query": "Were BBC Master and Acorn Archimedes both sold by Acorn Computers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which German prince became a Belgian King and was closely connected to a German-born banker of Jewish descent who was awarded the Order of Leopold?",
        "response": "Leopold I",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Corey Crowder was born in what county?",
        "response": "Carroll County",
        "source": "hotpot_qa"
    },
    {
        "query": "what country was the banner song \"Forward! Forward! Blare the bright fanfares\" sung in 1922?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeff Buckley and Vampire Weekend both American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-wrote a song with an American singer, produces and politician with a wife named Cher?",
        "response": "Jack Nitzsche",
        "source": "hotpot_qa"
    },
    {
        "query": "Trevor George Smith Jr., is better known by his stage name Busta Rhymes, is an American rapper, actor, record producer and record executive, Chuck D of which group, gave him his moniker?",
        "response": "Public Enemy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Legislative Council of the Territory of Florida governed Florida after a treaty was made between Spain and what other country?",
        "response": "the United States",
        "source": "hotpot_qa"
    },
    {
        "query": "In which place the salt industry developed by James Geddes was located?",
        "response": "Syracuse, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Animal Music was featured in an American music magazine founded by whom?",
        "response": "Mike Shea",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie featuring Dwayne Johnson and Yahya Abdul-Mateen II?",
        "response": "Seth Gordon",
        "source": "hotpot_qa"
    },
    {
        "query": "The Church Of The Lord Jesus With Signs located in Jolo, West Virginia is infamous for what?",
        "response": "snake handling",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British electronic musician is known for his extended play Computer Controlled Acoustic Instruments pt2 and his album Drukqs?",
        "response": "Richard D James",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The End of Serialization as We Know It\" is the tenth episode and the season finale in the twentieth season of which American animated sitcom, that premiered on Comedy Central on September 14, 2016?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "William Moody, was an American politician from Maine, he also served at the same time as Sheriff of York County, York County is the most southwestern county of the state of Maine located along New Hampshire's eastern border, in the which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that acquired RunKeeper in 2016 has a name that is an acronym of a phrase in what language?",
        "response": "Latin",
        "source": "hotpot_qa"
    },
    {
        "query": "Monsters of Folk includes a member of what musical duo that includes Zooey Deschanel?",
        "response": "She & Him",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the University where Joost Alois Businger is an emeritus professor established ?",
        "response": "1861",
        "source": "hotpot_qa"
    },
    {
        "query": "USCGC \"Point Grey\" was constructed at the Coast Guard Yard in which Maryland county?",
        "response": "Anne Arundel County",
        "source": "hotpot_qa"
    },
    {
        "query": "Stellan Skarsgård's son was in what History Channel series?",
        "response": "\"Vikings\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is native to Mexico, Sanvitalia or Buckinghamia?",
        "response": "Sanvitalia",
        "source": "hotpot_qa"
    },
    {
        "query": "New Order was formed of the remaining members of the band formed in what Manchester town?",
        "response": "Salford",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the namesake of the Kilby International Awards take part in the realization of the integrated circuit at?",
        "response": "Texas Instruments",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university uses English as the language of instruction, University of A Coruña or German University in Cairo?",
        "response": "German University in Cairo",
        "source": "hotpot_qa"
    },
    {
        "query": "Martin Elbourne had her first job here, what grade was the House listed as?",
        "response": "Grade II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other German name of a safety feature appearing in Elio Motors three wheeled car, the Elio P4?",
        "response": "ASR",
        "source": "hotpot_qa"
    },
    {
        "query": "Closing the Ring is a 2007 film directed by an English filmmaker who served in the film unit of of the Royal Air Force duing what war?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 1940 biographical film which tells the story of Knute Rockne, Notre Dame football coach, and stars  Pat O'Brien portraying the role of Rockne and Ronald Reagan as player nicknamed \"The Gipper\" who was selected as Notre Dame's first Walter Camp All-American ?",
        "response": "Knute Rockne, All American",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Hall of the Mountain King is a piece by a composer of what nationality?",
        "response": "Norwegian",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Fritz Görnnert's relationship to the last commander of \"Jagdgeschwader\" 1?",
        "response": "Ministerial Counsellor",
        "source": "hotpot_qa"
    },
    {
        "query": "Underwater! is a 1955 adventure film starring an American film actress who was a leading sex symbol in what decades?",
        "response": "1940s and 1950s",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Greensky Bluegrass band's home and location of where they created their first album?",
        "response": "Bell's Brewery, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music do both God Lives Underwater and Pavement bands perform?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization did Xernona Clayton work for who's first president was Martin Luther King Jr?",
        "response": "Southern Christian Leadership Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiba Tawaji was coached by a singer in the fourth season for \"The Voice\" that was born in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian poet, sometimes credited as Rajinder Krishan, helped composed for Bahar?",
        "response": "Rajendra Krishan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the mathematician husband of Anneli Cahn Lax born?",
        "response": "1926",
        "source": "hotpot_qa"
    },
    {
        "query": "What American comedy drama produced by Darren Star was acted in by Jon Gabrus?",
        "response": "Younger",
        "source": "hotpot_qa"
    },
    {
        "query": "Other than Willie Nelson, what artists inspired the title cut for the album \"Waves of Grain\"? ",
        "response": "John Mellencamp and Neil Young",
        "source": "hotpot_qa"
    },
    {
        "query": " Michael Brandon's theater credits include playing a British-American who hosted a tabloid talk show that debuted in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  weekly magazine published by the United States military during World War II did , Yank takes its title from ",
        "response": "Yank, the Army Weekly",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Francis Square Mall is a direct competitor of what shopping mall in the Ortigas business district?",
        "response": "SM Megamall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is both an Austrialian-born British independent filmaker and is known for his work  with the YouTube series THE PERIODIC TABLE OF VIDEOS?",
        "response": "Brady Haran",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more popular among Martin Flavin and William March ?",
        "response": "Martin Archer Flavin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which parent of Angelina Jolie and James Haven also worked as a Humanitarian Worker?",
        "response": "Marcheline Bertrand",
        "source": "hotpot_qa"
    },
    {
        "query": "What arena hosted both the Farewell 1 Tour-Live from Melbourne and the Australian Open?",
        "response": "Rod Laver Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Louis Blues is a 1958 American film broadly based on the life of W. C. Handy, It starred various jazz and blues greats, and actress Ruby Dee, an American actress, poet, playwright, screenwriter, journalist and what?",
        "response": "civil rights activist",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former Roseanne star more recently appeared in Patriots Day alongside Mark Wahlberg?",
        "response": "John Goodman",
        "source": "hotpot_qa"
    },
    {
        "query": "Because of Game Center, Mini Motor Racing games can now do what?",
        "response": "share multiplayer functionality between the Mac and iOS versions of the app",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded an independent, postdoctoral research center for theoretical research and intellectual inquiry, that had a Swiss mathematician as a permanent professor ?",
        "response": "Abraham Flexner",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the stadium replaced by the current stadium that is adjacent to the Ridgely's Delight historic residential neighborhood? ",
        "response": "Memorial Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the centerpiece of a former monastery complex of the Canons Regular of the Lateran, opposite of the chief diplomatic mission of the United Kingdom in Lithuania that represents the British Overseas Territories in Lithuania ?",
        "response": "St. Peter and St. Paul's Church",
        "source": "hotpot_qa"
    },
    {
        "query": " Blair Jones played for what ice hockey team based in British Columbia?",
        "response": "Vancouver Canucks",
        "source": "hotpot_qa"
    },
    {
        "query": "The Greysteel massacre was the killing of 8 people in a County Londonderry pub in October of which year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what ethnicity is the founder of the Orchestra which debuted on January 1, 1988?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pashtunkhwa Milli Awami Party is considered which  Iranian ethnic group who mainly live in the Pashtunistan region of southern and central Asia, in Afghanistan and the Khyber Pakhtunkhwa province (KPK)?",
        "response": "Pashtuns",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the male star of Voices born?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "A Woman's Revenge was a film starring an actress who was also what kind of dancer?",
        "response": "ballet dancer",
        "source": "hotpot_qa"
    },
    {
        "query": "What city did the characters from Gargoyles the Movie: The Heroes Awaken wake up in after being in an enchantedly petrified state for a thousand years?",
        "response": "modern-day New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Nike Bauer purchase an ice hockey company?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What British soldier received an award from Royal Society judges for a \"substantial contribution to the improvement of natural knowledge, including mathematics, engineering science and medical science\"?",
        "response": "George Martin Lees",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are film directors David Nixon and Arthur Berthelet?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Donatos Pizza and Shakey's Pizza, which of the two restaurants has more locations across the United States?",
        "response": "Donatos Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the Miami Heat beat the Oklahoma City Thunder in the NBA Finals?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the Northern Shoshone referred to as?",
        "response": "Indigenous Peoples",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016 Africa Eco Race replaced a rally raid organised by who?",
        "response": "Amaury Sport Organisation",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of series is the Argentine telenovela \"Sos mi vida\"?",
        "response": "romantic comedy television series",
        "source": "hotpot_qa"
    },
    {
        "query": "What group did the 253 West 125th Street-contest winner Spyder Turner sing back up for?",
        "response": "The Stereophonics and The Fabulous Counts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Italian DJ is a member of the same musical group as Jeffrey Jey and Maurizio Lobina ?",
        "response": "Gabry Ponte",
        "source": "hotpot_qa"
    },
    {
        "query": "Seiko Holdings Corporation was formerly known as which watch and jewlery shop?",
        "response": "K. Hattori",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series was part of Cartoon Network's 2017 April Fools' prank and had a song by Justin Roiland played during the third season of the same show?",
        "response": "Rick and Morty",
        "source": "hotpot_qa"
    },
    {
        "query": "what nationality is the man that discovered the NGC 5879 galaxy? ",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the relation between current manager of Chinese club Tianjin Quanjian and Paolo Cannavaro?",
        "response": "brother",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the company that published Casey Rae's book, Music Copyright in Practice: An Authoritative Guide, founded ? ",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, James D Grant, who uses the pen name of Lee Child, or Bernhard Schlink?",
        "response": "Bernhard Schlink",
        "source": "hotpot_qa"
    },
    {
        "query": "What American model and actress was born August 6, 1993 and starred in Mad Families?",
        "response": "Charlotte McKinney",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor, known for his roles in movies like The Waterboy and The Wedding Singer, founded the company Happy Madison Productions?",
        "response": "Adam Sandler",
        "source": "hotpot_qa"
    },
    {
        "query": "Allied Domecq PLC has been acquired by a French company that produces several other types of what?",
        "response": "pastis",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir William Arthur Mount, 1st Baronet is the great-grandfather of which former British PM?",
        "response": "David William Donald Cameron",
        "source": "hotpot_qa"
    },
    {
        "query": "Rica Fukami is a Japanese voice actress and singer from Saitama Prefecture who is affiliated with Vi-Vo, shad major roles, such as Fran, from which fantasy role-playing video game developed and published by Square Enix for the PlayStation 2 home video console? ",
        "response": "Final Fantasy XII",
        "source": "hotpot_qa"
    },
    {
        "query": "The 42d Attack Squadron of the United States Air Force flies General Atomics MQ-9 Reaper, sometimes called Predator B, is an unmanned aerial vehicle (UAV) capable of remotely controlled or autonomous flight operations, developed by General Atomics Aeronautical Systems (GA-ASI), primarily for which organization?",
        "response": "United States Air Force (USAF)",
        "source": "hotpot_qa"
    },
    {
        "query": "Liz Rose (born in Dallas, Texas) is an American country music songwriter best known for her work with Taylor Swift, she has co-written twenty of Swift's officially-released songs and singles, including \"Teardrops on My Guitar\" is a song by American singer-songwriter Taylor Swift, released in what year?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Thulli Thirintha Kaalam, is a 1998 Tamil language film, directed by Balasekaran, the film had music composed by Evangelos Odysseas Papathanassiou, known professionally as Vangelis, of which nationality, a composer of electronic, progressive, ambient, jazz, and orchestral music?",
        "response": "Greek",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two major peninsulas that make up the state of Michigan contains the M-69 Highway?",
        "response": "The Upper Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "How far is Sadie Macdonald's home town from Sydney?",
        "response": "300 km north west",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ligue 1 Young Player of the Year is an award given to the player aged 23 years or under at the start of the season whose performances are considered to be the best, playing in Ligue 1, the current holder is Ousmane Dembélé, a French professional footballer who plays as a forward for which Spanish club. and the France national team?",
        "response": "FC Barcelona",
        "source": "hotpot_qa"
    },
    {
        "query": " Gero Miesenböck is a physiology professor at what university that is a constituent college of Magdalen College?",
        "response": "the University of Oxford",
        "source": "hotpot_qa"
    },
    {
        "query": "What songwriter of Maybelline did Alan Reeves appear with?",
        "response": "Chuck Berry",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of event is held in Santo Domingo every year and is given by Presidente, a brand of Pilsner beer?  ",
        "response": "an annual music festival",
        "source": "hotpot_qa"
    },
    {
        "query": "De Wilp is a northeastern village in the Netherlands on the border of Groningen and which other province?",
        "response": "Friesland",
        "source": "hotpot_qa"
    },
    {
        "query": "What day did Led Zeppelin release their album that contained The Crunge?",
        "response": "28 March 1973",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of the controversial 2013 2013 internationally co-produced romantic drama film adaptation of a William Shakespeare play?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Here's Little Richard is a debut album containing a song written by Little Richard, Enotris Johnson and who else?",
        "response": "Robert \"Bumps\" Blackwell",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the first model of the sports car which Dave McLellan notably engineered?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the school where the Kansas City Spartans play their home games located?",
        "response": "Overland Park, Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Gordon Ogilvie wrote his 1973 book over a farmer who pioneered in what field?",
        "response": "aviation",
        "source": "hotpot_qa"
    },
    {
        "query": "Jayantabhai Ki Luv Story includes a lead role for the film actress and model who is a native of what city?",
        "response": "Bihar",
        "source": "hotpot_qa"
    },
    {
        "query": "Friendly Persuasion lost out on an Academy Award to which song by Livingston and Evans?",
        "response": "Que Sera, Sera",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Lev Schnirelmann or Mark Naimark ?",
        "response": "Lev Genrikhovich Schnirelmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Kurt Cobain and His Name Is Alive, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Cleavland School district based in?",
        "response": "Bolivar County, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Meji Mwamba contested the 2012 Olympic super heavyweight final with which Azerbaidjani boxer?",
        "response": "Magomedrasul Majidov",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1996 Grammy award winning musical did Bill Berry direct at The 5th Avenue Theater in Seattle?",
        "response": "Smokey Joe's Cafe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film starring Bob Hoskins, Christopher Lloyd, and others, spawned a series of short films from 1998 to 1993?",
        "response": "Who Framed Roger Rabbit",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sergei Parajanov and Syed Noor both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Rosenberg is a recipient of the 2004 Academy Award for Best Picture for a film directed by who?",
        "response": "Clint Eastwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Thorne South railway station is north of Doncaster on the line that has a terminus of what resort town?",
        "response": "Cleethorpes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mind Funk included which American guitarist who later served in the US Army?",
        "response": "Jason Mark Everman",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was jack Albertson born?",
        "response": "June 16, 1907",
        "source": "hotpot_qa"
    },
    {
        "query": "Inductivism was a scientific method attributed to a man that served in what two capacities?",
        "response": "Attorney General and as Lord Chancellor of England",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor received an Academy Award nomination for a film directed by Martin Ritt?",
        "response": "James Garner",
        "source": "hotpot_qa"
    },
    {
        "query": "Who fought the National Patriotic Front of Liberia in the Sierra Leone Civil War?",
        "response": "Revolutionary United Front",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, \"Deerhunter\" or \"Parabelle\"?",
        "response": "Deerhunter",
        "source": "hotpot_qa"
    },
    {
        "query": "This Ole House is an album by the singer who is of what nationality?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Calliandra and Thalia?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "South Burlington, Vermont is the home of the company that makes ice cream founded in what year?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area (in km²) of the country that Maya Sazonova is from?",
        "response": "2,724,900",
        "source": "hotpot_qa"
    },
    {
        "query": "Sanborn Regional High School is located in Kingston, New Hampshire and serves towns, including Newton, a town in Rockingham County, in which state?",
        "response": "New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the singer of \"May the Bird of Paradise Fly Up Your Nose\" become a member of the Grand Ole Opry?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "What film company produced The Littlest Outlaw and The Jungle Book?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "This controversial prison-themed board game designed by the son of a former federal judicial nominee to the United States District Court for what district?",
        "response": "District of Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Do War and Peace and Mireille have the same number of acts?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "We Could Be Kings was used in the sports film directed by whom?",
        "response": "Craig Gillespie",
        "source": "hotpot_qa"
    },
    {
        "query": "Sihung Lung had a role in the Taiwanese film about a gay immigrant released in what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Punta Delgada is a tourist resort on what peninsula on the Atlantic coast that is 3625 km2 in size?",
        "response": "The Valdes Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a guitarist who played on Alice Cooper's sixth studio album that became the best selling Alice Cooper record at the time of its release ?",
        "response": "Mick Mashbir",
        "source": "hotpot_qa"
    },
    {
        "query": "Flowered Up were a British band of how many members, formed in Camden Town, London in the late 1980s, they were influential in the Baggy movement?",
        "response": "five-man",
        "source": "hotpot_qa"
    },
    {
        "query": "KSCW-DT is part of a duopoly with which virtual channel 12 in Wichita?",
        "response": "KWCH-DT",
        "source": "hotpot_qa"
    },
    {
        "query": "With what name was the actor that played Elsie Gregory in the British ITV soap opera \"Coronation Street\" born with?",
        "response": "Patricia Frederica Manfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Spoon and The Datsuns, are bands of which shared genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Many legends surrounding Manoa Falls in Hawaii involve which spirits who are said to march at sunset and just before the sunrises?",
        "response": "Nightmarchers",
        "source": "hotpot_qa"
    },
    {
        "query": "Batkid is the superhero name of Miles Scott, an American child and cancer survivor, his wish was to be \"Batkid\", a sidekick of which eponymous fictional comic book superhero, appearing in American comic books published by DC Comics, and the subject of books, radio, television, and films?",
        "response": "Batman",
        "source": "hotpot_qa"
    },
    {
        "query": "Mirjam Weichselbraun presented what charity event in Europe that supports people with HIV or AIDS?",
        "response": "Life Ball",
        "source": "hotpot_qa"
    },
    {
        "query": "Radisson Red (stylized as Radisson RED) is an international chain of full service hotels, marketed at millennials, for Radisson Hotels, an international hotel company and a subsidiary of which organization?",
        "response": "Carlson Rezidor Hotel Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Name one journalist that served Maine's largest and principal commercial city?",
        "response": "Barbara Ann Walsh",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters for a kids magazine that employs the journalist Brennan LaBrie?",
        "response": "Tampa, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What friend of a performance artist and professional wrestler has performed in the role of Tony Clifton?",
        "response": "Bob Zmuda",
        "source": "hotpot_qa"
    },
    {
        "query": "Naked and Sacred was released by the member of the daughter of which band?",
        "response": "The Mamas & the Papas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant has more species, Silybum or Bauhinia?",
        "response": "Bauhinia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1988 animated science fantasy film produced by SEK Studio?",
        "response": "René Laloux",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the band that sang Numb during their 1992 to 1993 Zoo TV concert tour?",
        "response": "\"Numb\" is a song by rock band U2.",
        "source": "hotpot_qa"
    },
    {
        "query": "Ettore or Edoardo Ettore Forti was an Italian painter, who was prolific in depicting realistic Neo-Pompeian scenes of Ancient Roman life and events, these subjects were popular in the late-Victorian period, as exemplified by the popularity of Lawrence Alma-Tadema, born in Dronrijp, in which country?",
        "response": "Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this Swiss expressionist painter, designer, teacher, writer, and theorist associated with the Bauhaus and whose exploration of the relationship of art, technology, and the universe if examined by Olivia Kapoor?",
        "response": "Johannes Itten",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian actress was a contestant on an Indian reality television series that began October 16, 2016?",
        "response": "Antara Biswas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Canadian actor and musician whose mom gets set up with Kurt Hummel's dad in \"Home\"?",
        "response": "Cory Monteith",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 Texas Tech Red Raiders baseball team represents Texas Tech University in the 2014 college baseball season, the Red Raiders play home games at which home stadium, nicknamed \"The Law\", in Lubbock, Texas?",
        "response": "Dan Law Field at Rip Griffin Park",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Branko Oblak's usual position before he became a manager for ND Crunce?",
        "response": "attacking midfielder or deep-lying playmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the coming-of-age novel, set in the Canadian Prairies, that has a strong affiliation with the genre that expresses a primarily realistic view of the real world while also adding or revealing magical elements?",
        "response": "Thomas King",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capacity of the entertainment venue at which the 1996 World Matchplay darts tournament was held?",
        "response": "3,000",
        "source": "hotpot_qa"
    },
    {
        "query": "In Such Good Company is a memoir by the comedienne who has had a career spanning how many decades?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "What French-Mexican actress co-starred with Fernanda Castillo in a series of movies?",
        "response": "Angelique Boyer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was African-American, Patrick White or Ernest J. Gaines?",
        "response": "Ernest James Gaines",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Pace was a character played by which American actress?",
        "response": "Morgan Fairchild",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Patrick McDonnell's works features Earl, a dog?",
        "response": "the daily comic strip \"Mutts\"",
        "source": "hotpot_qa"
    },
    {
        "query": "El Americano: The Movie featured the voice of an American comedian comically known as what?",
        "response": "Fluffy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country is the language a poem written and sung on a holiday and created in the 13th century from? ",
        "response": "Israel",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the company which produces the liqueur used in the Rusty Nail? ",
        "response": "Morrison Bowmore Distillers",
        "source": "hotpot_qa"
    },
    {
        "query": "The Last Debate is a 2000 political television film directed by John Badham, based on the book by which American journalist, and novelist, born on May 19, 1934?",
        "response": "James Charles Lehrer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Commersonia and Paulownia in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "This female artist's 2013 debut album included a platinum hit, \"Replay\", an electro-R&B song co-written and produced by Mick Schultz.",
        "response": "Zendaya",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the network on which the Pakistani drama serial \"Meri Beti\" aired?",
        "response": "Abdul Razzak Yaqoob",
        "source": "hotpot_qa"
    },
    {
        "query": "What town has a  24.8 mi tributary of Schoharie Creek in Schoharie and Albany counties in the U.S. state of New York, and was named after governor Silas Wright?",
        "response": "Wright",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the population of town that Whitworth railway station served at the 2011 Census?",
        "response": "7,500",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 DC Animated Universe comic released in 2017 appeared at what Comic-Con?",
        "response": "San Diego Comic-Con International",
        "source": "hotpot_qa"
    },
    {
        "query": "Are John Dunning and Sharon Kay Penman of the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahn So-hee is a former member of a girl group formed by what producer?",
        "response": "Park Jin-young",
        "source": "hotpot_qa"
    },
    {
        "query": "What departed \"Gossip Girl\" cast member was born in 1993?",
        "response": "Taylor Michel Momsen",
        "source": "hotpot_qa"
    },
    {
        "query": "Gustav Mahler composed a beautiful piece performed by the Bach-Elgar Choir. What is the name of that piece??",
        "response": "Symphony No. 2",
        "source": "hotpot_qa"
    },
    {
        "query": "Rebecca Skloot wrote a book featuring a woman whose cervical cancer cells were named what?",
        "response": "HeLa",
        "source": "hotpot_qa"
    },
    {
        "query": "Dombeya and Epigaea, are a genus of which specific type of plant?",
        "response": "flowering",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event which occured first, Kellie Pickler's self title album was released, or The Best Days of Your Life was released?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Babyface and Tony Kakko, are in the music industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was released first, Hocus Pocus or The Sword in the Stone?",
        "response": "The Sword in the Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "St. John of the Cross Episcopal Church has a rectory that was in a style that was a product of what earlier style?",
        "response": "Hellenism",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Corina Morariu or Paul Haarhuis?",
        "response": "Paul Vincent Nicholas Haarhuis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Victor Amaya or Robin White?",
        "response": "Victor Amaya",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city in Kansas was home to both a prisoner-of-war camp during World War II and a community college today? ",
        "response": "Concordia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a funk singer, Chaka Khan or Takahiro Moriuchi.?",
        "response": "Chaka Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "In which season of coaching was the longer serving of the two coaches of the 2016 Auburn Tigers football team and 2016 Oklahoma Sooners football team ?  ",
        "response": "18th season",
        "source": "hotpot_qa"
    },
    {
        "query": "What river is the location of the PENREN across from?",
        "response": "the Potomac River",
        "source": "hotpot_qa"
    },
    {
        "query": "How long has the wife of Michael Coutts-Trotter been a member of Parliament?",
        "response": "been the Member of Parliament for Sydney since 1998,",
        "source": "hotpot_qa"
    },
    {
        "query": "What airline is based on the Big Island of Hawaii and has a former CEO from Washington?",
        "response": "Mokulele Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": " Michael Bowen acted in this American neo-western crime drama television series created and produced by who",
        "response": "Vince Gilligan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the actor who played the villainous James Stenbeck on \"As the World Turns?\"",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Orkustra was a bamd with a member who is serving a life sentence for a murder which occured on what date?",
        "response": "July 27, 1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Alycia Jasmin Debnam-Carey, is an Australian actress, in 2016, she starred in the German film \"Friend Request\", an English-language German supernatural-psychological horror film, directed by who?",
        "response": "Simon Verhoeven",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Clifford \"Tomas\" Arana is an American-Italian character actor who played in what British television series?",
        "response": "Spooks",
        "source": "hotpot_qa"
    },
    {
        "query": "Which event held from 5 October to 20 October 1951 did Greece competed?",
        "response": "1951 Mediterranean Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Brian Gottfried and Andy Murray both from the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ladislao Vajda and Matthew Vaughn both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American singer-Songwriter, who released the album Dance, along with Lindsey Buckingham, Mick Fleetwood, Christine McVie, and John McVie?",
        "response": "May 26, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed originates from a region farther east, the Lancashire Heeler or the Russian tracker?",
        "response": "Russian Tracker",
        "source": "hotpot_qa"
    },
    {
        "query": "Avenged Sevenfold is featured in which EA Canada and SkyBox Labs mixed-martial arts video game?",
        "response": "EA Sports UFC",
        "source": "hotpot_qa"
    },
    {
        "query": "Luna and Patrick Stump, have which mutual musical occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary McCaffrie has collaborated with the actor and comedian of what nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Hemsworth had a role in the 2013 sports drama film that was written by whom?",
        "response": "Peter Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Robert Florey and Geoff Murphy both in the film-making profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the person who beat Alex Clark for mayor in 1967 stop serving as a US senator?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is in Georgia, St. Pete–Clearwater International Airport or Augusta Regional Airport?  ",
        "response": "Augusta Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "As part of Spain's effort to colonize the region and convert the Timucua people to Christianity, what Spanish Franciscan mission was build in the Florida Panhandle?",
        "response": "San Miguel de Asile",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one league of \"Australian rules\" football?",
        "response": "Australian Football League (AFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mobile Regional Airport and Hoonah Airport located in California?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Bruno Mattei or Hisham Zreiq?",
        "response": "Bruno Mattei",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building was completed first, The New York Times Building or The Spiral?",
        "response": "The New York Times Building",
        "source": "hotpot_qa"
    },
    {
        "query": "In which internationally recognised block do both Budapest, the most populous city of Hungary and  Mirosław Hermaszewski, a retired Air Force officer and cosmonaut belong?",
        "response": "EU",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, A Brony Tale or Captain Mike Across America, debuted at the Toronto International Film Festival on September 7 and 8, 2007?",
        "response": "Captain Mike Across America",
        "source": "hotpot_qa"
    },
    {
        "query": "Viktor Lutze became commander of the Sturmabteilung after succeeding a man who was executed in what event?",
        "response": "Night of the Long Knives",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the heavy metal band from Tronheim, Norway, who specializes in music that embodies a continuous move between explicit and implicit references to genres and strategies derived from cultural domains, formed?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Echo\" is the thirteenth episode and the season finale of the second season of a series created by who ?",
        "response": "Joe Weisberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniela Rhodes studied for her PhD under the supervision of chemist and biophysicist that won the Nobel Prize in Chemistry in what year?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Rashad al-Shawwa was the Palestinian mayor of  a city that has been inhabited since what century?",
        "response": "15th",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has recorded more albums, Sunny Day Real Estate or Against Me!?",
        "response": "Against Me!",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the metropolitan population of the residential area that Nagabhavi is in?",
        "response": "8.52 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2015 American action film starring the actor who played Richard B. Riddick?",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert “Bobby” Cumming and John Reames were both members of what team?",
        "response": "Lincoln City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this college football game help by the Big 12 Conference, in which Colorado played for the second time and lost to Oklahoma in 2002?",
        "response": "Big 12 Championship Game",
        "source": "hotpot_qa"
    },
    {
        "query": "The Panismahas were a sub-group of a tribe that historically lived in what two states?",
        "response": "Nebraska and Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Hyun-seok (born June 7, 1972) is a South Korean film director and screenwriter, Kim wrote and directed, which 2015 South Korean musical drama film written and directed by Kim Hyun-seok?",
        "response": "C'est si bon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the present leader of the party that headed a minority government after the Canadian federal election, 2008 ? ",
        "response": "Andrew Scheer,",
        "source": "hotpot_qa"
    },
    {
        "query": "Rabinjan is located between Samarkand and a city located on what famous road that runs between China and the Mediterranean?",
        "response": "Silk Road",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the deployment locations of an American football player who was the subject of a biography written by Jon Krakauer?",
        "response": "Iraq and Afghanistan",
        "source": "hotpot_qa"
    },
    {
        "query": "For what country does the defensive midfielder of Lazio that graduated from Gremio F.B.P.A. Academy play for?",
        "response": "Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the author of the 2006 novel that was adapted into a 2013 horror movie in which Shane Hart was an extra?",
        "response": "Max Brooks",
        "source": "hotpot_qa"
    },
    {
        "query": "What main thoroughfare in Warsaw's borough of Ursynów connects to a 6,500 km international road which coincides with the Trans-Siberian Highway?",
        "response": "Jana Rosoła street",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the genre of the book series written by Kinley MacGregor?",
        "response": "romance",
        "source": "hotpot_qa"
    },
    {
        "query": "The Y platform, or Y body, designation has been used twice by the General Motors Corporation, the first was for a group of entry-level compacts including the conventional front-engine compacts built by GM divisions Buick, Oldsmobile and Pontiac from 1961 to which year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What band from Bakersfield, California had it's first single from the band's debut album appear on both a compilation album and a communications commercial, a song which remains one of it's most popular and well known songs?",
        "response": "Adema",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player, who also played for the New Jersey Nets and the Golden State Warriors, finished third in the league with 231 three-point field goals during the 1995-96 Atlanta Hawks season?",
        "response": "Mookie Blaylock",
        "source": "hotpot_qa"
    },
    {
        "query": "Are XLR8R and Allure both magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Australian cinematographer who collaborated on a 2016 American science fiction action adventure film based on the video game franchise of the same name?",
        "response": "Adam Arkapaw",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member of \"Flying Down to Rio\" was born on July 16, 1911?",
        "response": "Ginger Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth name of the actor that plays Wong Fei-hung in \"Druken Master II\"?",
        "response": "Chan Kong-sang",
        "source": "hotpot_qa"
    },
    {
        "query": "Masters of Flip centers on Dave and Kortney Wilson, country musicians and television personalities in what state?",
        "response": "Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two are older, the Talking Heads, or Charlie Simpson?",
        "response": "Talking Heads",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the driver who finished third in the 2009 Monaco Grand Prix ?",
        "response": "The Ice Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Dave Dennis was one of the organizers of the events that were launched in what month?",
        "response": "June 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the given name of the performer who released the album Eric the Pilot ?",
        "response": "Henry Lawrence Garfield",
        "source": "hotpot_qa"
    },
    {
        "query": "What castle in Ireland once occupied by the MacDonnells is accessible by a bridge?",
        "response": "Dunluce Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What is in South Burlington that is an American company that manufactures ice cream, frozen yogurt, and sorbet?",
        "response": "Ben & Jerry's",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was owned by more companies during its existence Family Circle or Women's Physique World?",
        "response": "Family Circle",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2011 population in the civil parish that Belnie is located in?",
        "response": "2,958",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Chuck Weber's ice hockey team play its home games?",
        "response": "the Infinite Energy Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "What reformatory built between 1886 and 1910 housed American criminal and  fugitive Frank Freshwater?",
        "response": "Ohio State Reformatory",
        "source": "hotpot_qa"
    },
    {
        "query": "How many stores does the sponsor of 7 Eleven Roadbike Phillipines operate?",
        "response": "56,600",
        "source": "hotpot_qa"
    },
    {
        "query": "What channel was Cashin' In with Eric Bolling broadcasted on?",
        "response": "Fox News Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "Nancy Massie Meadows, served as social director at what palatial luxury resort located in the Allegheny Mountains near White Sulphur Springs in Greenbrier County, West Virginia?",
        "response": "The Greenbrier",
        "source": "hotpot_qa"
    },
    {
        "query": "Grimaldi's Pizzeria and Mr. Jim's Pizza, are located in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Citizens Financial Group and Waters Corporation both US companies?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie dramatized the aborted lunar mission of the astronaut who would have been the 6th man to walk on the moon?",
        "response": "Apollo 13",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both the Houston Ship Channel and Carondelet Canal still in operation?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Princeton Stadium located in?",
        "response": "Mercer County",
        "source": "hotpot_qa"
    },
    {
        "query": "who is younger Joakim Nyström or Kimberly Po ?",
        "response": "Kimberly Po-Messerli",
        "source": "hotpot_qa"
    },
    {
        "query": "George Juskalian was the MACV inspector general under the leader who served as Chief of Staff for the Army during what span?",
        "response": "1968 to 1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was created first out of Unidentified Flying Oddball and The BFG?",
        "response": "Unidentified Flying Oddball",
        "source": "hotpot_qa"
    },
    {
        "query": "Not Love Alone is the first opera by a Russian compser and winner of what prize?",
        "response": "Lenin Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "In how many World Cups has the English striker who once played for IFK Hässleholm appeared as a member of the English national team?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed more recently Said the Whale or Butthole Surfers?",
        "response": "Butthole Surfers",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the artist featured on the single \"More Than You'll Ever Know\" born?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Eui-sung is an actor who appears in the TV series \"W\", a 2016 South Korean television series that airs on what network?",
        "response": "MBC",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Nome Airport and Mercedita Airport public use airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is the watch company which owned the Hamilton Watch Complex based?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was produced earlier, Body of War or Air Force, Incorporated?",
        "response": "Air Force, Incorporated",
        "source": "hotpot_qa"
    },
    {
        "query": "which  American actor was Candace Kita  guest starred with ",
        "response": "Bill Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this college football coach, head coach of UNLV Rebels in their first season in 2010 and head coach of Montana previously?",
        "response": "Bobby Hauck",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Swedish heavy metal band which was formed by guitarist Jesper Stromblad in 1990 who later went on to form Sinergy with Kimberly Goss from Dimmu Borgir?",
        "response": "In Flames",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's nonviolent activism inspired the man who C.T. Vivian was lieutenant to during the Civil Rights Movement?",
        "response": "Mahatma Gandhi",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the job of Francesco Cocco-Ortu in the state that founded as a result of the unification of Italy under the influence of the Kingdom of Sardinia ?",
        "response": "deputy",
        "source": "hotpot_qa"
    },
    {
        "query": "Wonder Woman is the superhero film that is fourth in the line of what direct-to-video projects by Warner Premiere, Warner Bros. Animation, and DC Comics?",
        "response": "DC Universe Animated Original Movies",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company whose European branch Richard Alden  was president of headquartered?",
        "response": "Beachwood, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the following Polish political parties more right or left winged, Poland Comes First or Law and Justice?",
        "response": "right-wing",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the team Rick Bennett coaches play?",
        "response": "Frank L. Messa Rink",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the five-part BBC/HBO/VRT television serial in which the actor, who first came to public attention in 1981, when he was cast in Julian Mitchell's play and subsequent film \"Another Country\", played a role?",
        "response": "Susanna White",
        "source": "hotpot_qa"
    },
    {
        "query": "Open House starred which actor who played the role of Mark Cohen in \"Rent\"?",
        "response": "Anthony Deane Rapp",
        "source": "hotpot_qa"
    },
    {
        "query": "Orson Scott Card first published his short story \"Killing Children\" in this American science-fiction magazine whose first issue was published when?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won one women's grand slam singles title at the US Open in 1990, Brian Gottfried or Gabriela Sabatini?",
        "response": "Gabriela Beatriz Sabatini",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Astronaut\" is the third single from Simple Plan and was played in Earth orbit by the first Canadian to what?",
        "response": "walk in space",
        "source": "hotpot_qa"
    },
    {
        "query": "Harold Edward Holt went missing while swimming in the suburb of what city?",
        "response": "Melbourne, Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Richie McDonald and Dave Williams, have which common occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenny Hotz is a contributor for what Montreal-based magazine?",
        "response": "Vice",
        "source": "hotpot_qa"
    },
    {
        "query": "Into how many categories do scholars group the early works of the author of the play A Midsummer Night's Dream?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "The film \"Ikke Pe Ikka\" stars Shanti Priya, Chandni, and an actor that has won how many Filmfare Awards?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor starred in both \"Westworld\" and \"Sweetwater\"? ",
        "response": "Ed Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "Jan Julius Lodewijk Duyvendak translated The Book of Lord Shang which is attributed to which major Qin reformer?",
        "response": "Shang Yang",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Global Rhythm and Stanford Chaparral both magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the capital city which the WMFX rock radio station serves in South Carolina?",
        "response": "Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of an American writer who denied paternity and who's mother s an American painter and writer who wrote the autobiography \"The Bite in the Apple\" ?",
        "response": "Steve Jobs",
        "source": "hotpot_qa"
    },
    {
        "query": "NY Wired was a game show produced in association with a part of the New York State Gaming Commission based where?",
        "response": "Schenectady",
        "source": "hotpot_qa"
    },
    {
        "query": "How many state representatives are there in the lower house of the legislature of which Valdenia Winn is a member?",
        "response": "125",
        "source": "hotpot_qa"
    },
    {
        "query": "What British singing group released a single in 1984 based on a 1974 film directed by a five-time nominee of the Academy Award for Best Director?",
        "response": "New Order",
        "source": "hotpot_qa"
    },
    {
        "query": "Mille Dinesen is known for her role in which television series?",
        "response": "Rita",
        "source": "hotpot_qa"
    },
    {
        "query": "Althea Currier was born in what town in Washington County, Maine, that had a population of 1,521 at the 2010 census?",
        "response": "Baileyville",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mercury tracer is based on variations of the Mazada Protege which is manufactured by which company?",
        "response": "Mazda Familia",
        "source": "hotpot_qa"
    },
    {
        "query": "Not including guest members, which band consisted of more members, Temple of the Dog or The Sugarcubes?",
        "response": "The Sugarcubes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Demetrius Calip's 1988-1989 National Championship team's members is currently serving as the general manager of another sports team?",
        "response": "Rob Pelinka",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2010 American drama film starring the actor who played Dr. Emil Skoda in \"Law & Order\"?",
        "response": "Marilyn Agrelo",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sarantine Mosaicv alludes to works by which poet who helped to found the Abbey Theater?",
        "response": "William Butler Yeats",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is one of the original founding members of the band who released an album in 1964?",
        "response": "Ciarán Bourke",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American romantic comedy-drama in which \"Cold Blooded Old Times\" appeared on the film soundtrack?",
        "response": "Stephen Frears",
        "source": "hotpot_qa"
    },
    {
        "query": " Otto Stern is the second most nominated person for a Nobel Prize behind a German theoretical physicist who pioneered developments in what?",
        "response": "atomic and quantum physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Walter Scott of Harden lived in what 16th century tower house? ",
        "response": "Harden Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the South Korean boy group whose leader is Kang Seung-yoon formed?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Edgar Rice Burroughs and Graham Swift, have which occupation in common?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 Indianapolis motorcycle Grand Prix took place at what racing circuit that is also home of the Indianapolis 500?",
        "response": "The Indianapolis Motor Speedway",
        "source": "hotpot_qa"
    },
    {
        "query": "What Academy Award nomination did an actress who was in 1989 American comedy film directed by John Hughes and starring John Candy, receive for another film? ",
        "response": "Best Supporting Actress",
        "source": "hotpot_qa"
    },
    {
        "query": "Marcus Wayne Garland spent nine seasons with an American professional baseball team that is based in Baltimore, Maryland, and was one of the AMerican League's original eight charter franchises when the league was established in what year?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Echium or Ptilotus?",
        "response": "Ptilotus",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Paul Roberts and Andy Biersack in the same band together?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor stared in the film \"Heropanti\" and originally stared off as a model?",
        "response": "Kriti Sanon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the town near Vernon Hills which was laid out in 1857 and with a city hall designed by Charles Sumner Frost?",
        "response": "19,375",
        "source": "hotpot_qa"
    },
    {
        "query": "Shilpa Architects has designs that can be seen at what largest artists' commune in India?",
        "response": "Cholamandal Artists' Village",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary premiered first, Life in the Undergrowth or Sketches of Frank Gehry?",
        "response": "Life in the Undergrowth",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did Frank Jardine represent at the V Olympic Winter Games?",
        "response": "Great Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played in the American professional baseball team based in Oakland, California and was born 1963?",
        "response": "Steven Bernard Howard",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tulsa Golden Hurricane will join an American collegiate athletic conference, featuring how many member universities?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from the San Francisco area, Faith No More or Acceptance?",
        "response": "Faith No More",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the singers of \"Tear in My Heart\" from?",
        "response": "Columbus, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the famous director of Marnie, a psychological thriller, for which a book about his relationship with Evan Hunter and their ill fated collaboration was written?",
        "response": "Alfred Hitchcock",
        "source": "hotpot_qa"
    },
    {
        "query": "Shulk is the protagonist in which Monolith Soft’s role-playing game released in Japan in 2010? ",
        "response": "Xenoblade Chronicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bernardo Bertolucci and Jodie Foster both producers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Rock Dog featured the voice of which actor who got his start on \"All That\"?",
        "response": "Kenan Thompson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which head coach lead the 2016 Penn State Lions In the 2016 NCAA division of college football and served as a head football coach for Vanderbilt University?",
        "response": "James Franklin",
        "source": "hotpot_qa"
    },
    {
        "query": "Lada Negrul, is a Russian actress and poet, and is the author and producer of documentaries about which highly popular Russian actor who starred in fifty seven films including several TV serials, such as \"Spetsnaz\" (2002)?",
        "response": "Vladislav Galkin",
        "source": "hotpot_qa"
    },
    {
        "query": "Wayne B. Sappleton was a star at an institution founded in what year?",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "Above and Beyond is a 1952 American war film about Lt. Col. Paul W. Tibbets, Jr., best known as the pilot who flew the \"Enola Gay\" when it dropped Little Boy, the first of two atomic bombs used in warfare, on the Japanese city of what?",
        "response": "Hiroshima",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did this Australian actor, who appeared in Empire State, play in the the soap opera \"Neighbours?\"",
        "response": "Josh Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "When was an organization representing the descendants of Protestant Lowland Scottish migrants to Ireland founded?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional sport was played by the person who co-hosted the 1989 Soul Train Music Awards with Patti LaBelle and Dionne Warwick?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "What song references a man who began playing music as part of The Stanley Brothers?",
        "response": "Pony",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Arum and Honeysuckle both native to Europe?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film maker is older, Jan Bucquoy or Stan Moore?",
        "response": "Jan Bucquoy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joe Elliott and Paul Meany both keyboardists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "James and the Giant Peach stars which English actress born on April 18, 1961?",
        "response": "Jane Leeves",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of radio stations played songs by the group who released the album Holiday Harmony?",
        "response": "pop/soft rock stations",
        "source": "hotpot_qa"
    },
    {
        "query": "Yongji, Shanxi and Nanchuan District, are located in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Bear Paw Ski Bowl is a ski area that draws people from a recreaton area of what tribe? ",
        "response": "Chippewa-Cree Tribe",
        "source": "hotpot_qa"
    },
    {
        "query": "Torteval, Guernsey contains a bird reservoir that was redeveloped to mark what anniversary?",
        "response": "60th",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the album that produced the single which broke the record for the most weeks spent at number one by a female country artist ?",
        "response": "Red",
        "source": "hotpot_qa"
    },
    {
        "query": "Just Tell Me What You Want is a 1980 American comedy film, directed by Sidney Lumet, stars include in it, is which American actor and comedian known for his biting wit and often angry humorous rants, and became well known as a Jewish comedian and satirist?",
        "response": "Alan King",
        "source": "hotpot_qa"
    },
    {
        "query": "What brewery, founded in 1543, is located in the district of Greiz in Germany?",
        "response": "The Köstritzer brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "What church was the college Marjorie Hass is the 20th president of formerly affiliated with?",
        "response": "Presbyterian Church",
        "source": "hotpot_qa"
    },
    {
        "query": "Koozå is a touring circus production by which Canadian entertainment company, and the largest theatrical producer in the world?",
        "response": "Cirque du Soleil",
        "source": "hotpot_qa"
    },
    {
        "query": "What Cleveland Ohio based department store was one of the original anchors for the Parmatown Mall?",
        "response": "Higbee's",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and produced the R&B hit single which was featured as #69 in Billboards magazines Top Hot 100 songs of 1983?",
        "response": "Jimmy Jam & Terry Lewis",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Ram Gopal Varma and Paul Andrew Williams share the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Rivelin Rocks and A57 road have in common?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city where the transmitter site for KQSP (1530 AM) is located?",
        "response": "22,952",
        "source": "hotpot_qa"
    },
    {
        "query": "Which conference does Bill Fenellys women’s basketball team from Iowa participate in?",
        "response": "Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the debut studio album that is going to be released by the YouTube personality who had her debut EP \"Bubblebath\"?",
        "response": "Poppy.Computer",
        "source": "hotpot_qa"
    },
    {
        "query": "Louis Hartz (April 8, 1919 – January 20, 1986) was an American political scientist and influential liberal proponent of the idea of American exceptionalism, is an ideology that holds that which country, is unique among nations in a positive way, particularly with respect to its ideals of democracy and personal freedom?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the person who designed Catherine, Duchess of Cambridge's wedding dress born?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "What amusement park that is privately owned seventeen miles north of Salt Lake City launched a steel roller coaster?",
        "response": "Lagoon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Israeli folk song is featured on Scottish bagpipes for the soundtrack album from Monty Python's Life of Brian?",
        "response": "Hava Nagila",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Cyhi the Prince from?",
        "response": "DeKalb County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is farther south, Palm Beach International Airport or Fairbanks International Airport?",
        "response": "Palm Beach International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Aaron F. Libby's district comprised Waterboro and parts of a town that had how many inhabitants in 2010 ?",
        "response": "4,344",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the founding year of this American for-profit college, which helps to operate a 2 year, dual degree high school located in Chicago, Illinois, with Chicago Public Schools?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Korean-American actor born who acted as Glenn in the eighth episode of \"Made to Suffer\"?",
        "response": "December 21, 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Sam Boyd's family operates what hotel located in Paradise, Nevada?",
        "response": "The Orleans",
        "source": "hotpot_qa"
    },
    {
        "query": "My 5 Wives is a 2000 American comedy film directed by Sidney J. Furie and starring Rodney Dangerfield, an American stand-up comedian, actor, producer and screenwriter known for what catchphrase?",
        "response": "\"I don't get no respect!\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Wheatley Hills Golf Club is located in what county?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the district in which the town of Barekese is located ? ",
        "response": "Nkawie",
        "source": "hotpot_qa"
    },
    {
        "query": "Geoff Boss won a race in which city, 22 miles from Lake Tahoe?",
        "response": "Reno",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel \"Dan\" Greaney was hired after writing the first draft of and episode aired on what date?",
        "response": "November 5, 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Albert Wilson play college football?",
        "response": "Atlanta, Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band did the English musician, composer, singer-songwriter, and painter who wrote the song Terrapin found?",
        "response": "Pink Floyd",
        "source": "hotpot_qa"
    },
    {
        "query": "Tuomas Lauri Johannes Holopainen, is a Finnish songwriter, multi-instrumentalist musician (but mainly keyboardist) and record producer, best known as the founder, leader, keyboardist and songwriter of symphonic metal band Nightwish, formed in which year? ",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport are both Anthony Martial and CO Les Ulis known for?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the famous work of an astronomer, mathematician and physicist originally from a city in modern-day Uzbekistan and is one of the oldest inhabited cities in Central Asia ?",
        "response": "Zij-i-Sultani",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine, started in 1966, was founded at Rabin county a high school.",
        "response": "Foxfire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more titles, Michael Chang or Ellis Ferreira?",
        "response": "Michael Te-Pei Chang",
        "source": "hotpot_qa"
    },
    {
        "query": "Where Syd Barrett and Johnny Borrell both known for their founding of Pink Floyd? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Shangri-La City and Ma'anshan cities in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the only man to beat Jarrell Miller in kickboxing?",
        "response": "Croatian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was also a poet, Penelope Fitzgerald or Emma Goldman?",
        "response": "Penelope Fitzgerald",
        "source": "hotpot_qa"
    },
    {
        "query": "What  profession did Mike Robbie's father practice?",
        "response": "an American attorney",
        "source": "hotpot_qa"
    },
    {
        "query": "Daikon and plain rice flour form what Chinese dim sum dish?",
        "response": "Turnip cake",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Herbert Selpin or Marc Lawrence?",
        "response": "Herbert Selpin",
        "source": "hotpot_qa"
    },
    {
        "query": "British screenwriter John Hodge adapted The Beach for a movie from the novel by which author?",
        "response": "Alex Garland",
        "source": "hotpot_qa"
    },
    {
        "query": "Barrie Ciliberti is a professor at a univeristy located in what Maryland county?",
        "response": "Prince George's County",
        "source": "hotpot_qa"
    },
    {
        "query": "What genus honors John Parkinson, Parkinsonia or Rumohra?",
        "response": "Parkinsonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Francisco Jose Hernandez was a participant in an invasion that took place in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What public service broadcaster with over 20,950 employees, aired the variety show Welsh Rarebit?",
        "response": "British Broadcasting Corporation (BBC)",
        "source": "hotpot_qa"
    },
    {
        "query": "The song by the American rock band Linkin Park \"Faint\" is from this album co-produced by which producer?",
        "response": "Don Gilmore",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American economist to which Joseph A. Loftus worked as a communications assistant born? ",
        "response": "December 13, 1920",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the home of the General buried in the Christ Episcopal Church built?",
        "response": "1795",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenji Satake was part of the team that worked on the 1700 earthquake that had what magnitude?",
        "response": "8.7–9.2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which physicist who played a role in the Manhattan project was the professor of Walter Marshall?",
        "response": "Rudolf Peierls",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor received an Academy Award for his role in \"The Usual Suspects\" and starred in the short film \"Envelope\"?",
        "response": "Kevin Spacey",
        "source": "hotpot_qa"
    },
    {
        "query": "Is it true or false that both the Harrier and English Springer Spaniel are hound dogs?",
        "response": "The English Springer Spaniel is a breed of gun dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Grant O'Riley played in the Victorian Football League for a football club nicknamed the Lions or the what?",
        "response": "Roys",
        "source": "hotpot_qa"
    },
    {
        "query": "Hargus Melvin \"Pig\" Robbins who has played with an American alternative rock band whose highest charting single was what?",
        "response": "Push th' Little Daisies",
        "source": "hotpot_qa"
    },
    {
        "query": "What was an American regional airline called when it was founded in 1982, that company acquired a carrier operated a mixed fleet of Beechcraft 1900, Piper Navajo Chieftains, Beech 99 Airliners, and also occasionally utilized a Beech King Air 90 as a back-up aircraft?",
        "response": "Atlantic Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Are York Minster and Brentwood Cathedral in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Parodia and Thalictrum flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film which starred Steve Cochran and the actor who played Sheriff Roy Coffee in \"Bonanza\"?",
        "response": "Louis King",
        "source": "hotpot_qa"
    },
    {
        "query": "What major company produced the film \"Fun and Fancy Free\", an American live-action animated movie in 1947 and \"Roving Mars\", an IMAX documentary about the Mars Exploration Rovers years later?",
        "response": "Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the team captain of the 2017 Peshawar Zalmi born?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsay Parker played the role of Carrie in a 1987 film based on a book by what author?",
        "response": "V. C. Andrews",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is found a facility where small, open, four-wheeled vehicles are raced?",
        "response": "New Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1953 Belgian Grand Prix was won by a Ferrari driver who was born when?",
        "response": "13 July 1918",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following received two Academy Awards: Jerome Robbins or Michael Curtiz?",
        "response": "Jerome Robbins",
        "source": "hotpot_qa"
    },
    {
        "query": "WUAF-LP serves this county seat of Columbia County, Florida, with what population according to the 2010 census",
        "response": "12,046",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Garajonay National Park and Caldera de Taburiente National Park located on the same island?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University of Virginia alumnus also served under the 30th Governor of Kentucky?",
        "response": "John Nicholas Galleher",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team plays at the park that American baseball pitcher Marcus  Stroman calls his summer home?",
        "response": "the Firebirds",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and performed as a duo with her sister Anna McGarrigle, and wrote \"Proserpina\", the album's first single?",
        "response": "Kate McGarrigle",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the rock band whose lead singer was associated with music promoter Annik Honoré?",
        "response": "Warsaw",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film where Susanne Pollatschek voiced Olivia Flaversham?",
        "response": "Burny Mattinson, David Michener, and the team of John Musker and Ron Clements",
        "source": "hotpot_qa"
    },
    {
        "query": "Question: Michael and Peter Spierig directed this 2014 science fiction film that won Matt Villa his second AACTA Award. ",
        "response": "Predestination",
        "source": "hotpot_qa"
    },
    {
        "query": "Casino Royale was loosely based on a novel by Ian Fleming, an English author, journalist and naval intelligence officer who is best known for what series of spy novels?",
        "response": "James Bond",
        "source": "hotpot_qa"
    },
    {
        "query": "How many copies were sold of the last UK number-one single that was written by Noddy Holder and Jim Lea?",
        "response": "in excess of one million copies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is younger, Black Francis or Makoto Koshinaka?",
        "response": "Makoto Koshinaka",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of Most Popular New Female Talent in the Logie Awards of 2004 was born in what year ?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Peter Ackroyd or Colum McCann?",
        "response": "Peter Ackroyd",
        "source": "hotpot_qa"
    },
    {
        "query": "The wife of the pastor of Lakewood Church was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Pabst Brewing Company is the holding company for which former company located in St. Paul, Minnesota?",
        "response": "Jacob Schmidt Brewing Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the 2008 film starring Grayson \"The Professor\" Boucher premiere?",
        "response": "2008 Tribeca Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the shopping center the B46 bus route runs north of open?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Foo Fighter album featured \"RUN\" as its first Single? ",
        "response": "Concrete and Gold",
        "source": "hotpot_qa"
    },
    {
        "query": "Gerald Moore CBE (30 July 1899 – 13 March 1987) was an English classical pianist best known for his career as an accompanist for many famous musicians, among those with whom he was closely associated were which German soprano, and was among the foremost singers of lieder, and was renowned for her performances of Viennese operetta?",
        "response": "Olga Maria Elisabeth Friederike Schwarzkopf",
        "source": "hotpot_qa"
    },
    {
        "query": "What state is the town and village, who share the same name and are both located southwest of Syracuse, located in?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Merengue is a musical form extended through all in which location, the rhythms have very little in common, except that they were commonly written for partner dances, whose basic choreography involves coordinated dancing of two partners, as opposed to individuals dancing alone, or individually, in a non-coordinated manner, and as opposed to groups ?",
        "response": "Caribbean",
        "source": "hotpot_qa"
    },
    {
        "query": "Gábor Korolovszky once played for what team located in the community of Castile-La Mancha?",
        "response": "Club Deportivo Toledo",
        "source": "hotpot_qa"
    },
    {
        "query": " Martin Childs won the 1998 Academy Award for best Art Direction-Set Decoration for a movie directed by who ?",
        "response": "John Madden",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the main subjects of photographs taken by William Clarridge in a medium-sized historic market town close to the western boundary of Hertfordshire, England?",
        "response": "young girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the actress who co-starred with Peter Breck in \"Hootenanny Hoot\"?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "Henry: Portrait of a Serial Killer is a 1986 American psychological horror crime film, the characters of Henry and Otis are loosely based on real life serial killers Henry Lee Lucas and which American drifter and serial killer who was convicted of six counts of murder?",
        "response": "Ottis Toole",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary came out first, The Real Dirt on Farmer John or Prophet's Prey?",
        "response": "The Real Dirt on Farmer John",
        "source": "hotpot_qa"
    },
    {
        "query": " John Gavin Malkovich appeared in Warm Bodies, a 2013 American paranormal romantic zombie comedy film based on whose novel of the same name?",
        "response": "Isaac Marion",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the private, historically black University in Virginia, United States where Keith Lorenzo Goganious served as Assistant Head Coach between 2009 and 2013?",
        "response": "Hampton University",
        "source": "hotpot_qa"
    },
    {
        "query": "who was born in 1979, and debuted a show in 2011, on Cartoon Network?",
        "response": "Peter \"Pete\" Browngardt",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Colin Michael Foale or Roberto Vittori ?",
        "response": "Colin Michael Foale",
        "source": "hotpot_qa"
    },
    {
        "query": "Cut Bank Municipal Airport is in the Montana county that has a population of what as of 2010?",
        "response": "13,399",
        "source": "hotpot_qa"
    },
    {
        "query": "Fritz von Brodowski was killed during what global war that lasted from 1939 to 1945?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced both DC Nation and Beware the Batman?",
        "response": "Warner Bros",
        "source": "hotpot_qa"
    },
    {
        "query": "Did writers Milan Kundera and John Berger both live in France?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What number was the Winter Olympic Games in which Yevgeniy Velichko represented Kazakhstan in cross-country skiing?",
        "response": "21st",
        "source": "hotpot_qa"
    },
    {
        "query": "What college did the son of William Drew Robeson I play football for?",
        "response": "Rutgers College",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the length of an episode for the show that Jose María del Río is a narrorator in? ",
        "response": "seven-minute episodes.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the best selling book about serial killers that was written by a former chief reporter of national red top newspaper published in the United Kingdom?",
        "response": "Inside 25 Cromwell Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the singer and songwriter who recorded a demo of \"Love the Way You Lie\" alongside Alex da Kid from?",
        "response": "Mazomanie, Wisconsin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink is attributed to the French Post-Impressionist painter Henri de Toulouse-Lautrec: 7 and 7 or Earthquake?",
        "response": "Earthquake",
        "source": "hotpot_qa"
    },
    {
        "query": "Nils Gaup and Mikio Naruse, are in which shared industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "British Hong Kong was under British Crown rule from 1841-1997. From 1856-1860 the British Empire was against the Qing Dynasty of China with what other Empire?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Berlin's \"Love Life\" included the band's first Top 40 single. Which of their songs made it to number 1?",
        "response": "\"Take My Breath Away\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The seat of Cardinal Timothy Dolan, what is the name of the landmark Roman Catholic building facing the Atlas statue opposite the Rockefeller Center?",
        "response": "St. Patrick's Cathedral",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the English actor who starred in Flash backs of a Fool?",
        "response": "Wroughton",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor for a two-part 2008 biopic about Argentine Marxist revolutionary Ernesto Che Guevara was born in what city?",
        "response": "Brooklyn, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dimorphotheca and Rhipsalis both genii of plants?",
        "response": "Rhipsalis is a genus",
        "source": "hotpot_qa"
    },
    {
        "query": "The Veer Towers are located in what county?",
        "response": "Clark County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian voice actor voiced Edd a.k.a. Double D from \"Ed, Edd n Eddy\" as well as voicing the same character that Akira Ishida did in \"Mobile Suit Gundam SEED\"?",
        "response": "Samuel Vincent",
        "source": "hotpot_qa"
    },
    {
        "query": "What was created from the Type 30 rifle for the Imperial Japanese Navy as a replacement for their aging Type 22 Murata rifles, with the date meaning the Meiji period according to the Gregorian calendar together with year designations stating the year of the reign of the current Emperor? ",
        "response": "Type 35 Rifle",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this single-vehicle car accident involving a US Senator and his companion, who was an American teacher, secretary, and political campaign specialist?",
        "response": "Chappaquiddick incident",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the genre of film featuring musicians from the ensemble Qutub-E-Kripa?",
        "response": "Indian science fiction",
        "source": "hotpot_qa"
    },
    {
        "query": "\"When My Blue Moon Turns to Gold Again\" was recorded by which artist who passed away on July 31, 1964 ?",
        "response": "Jim Reeves",
        "source": "hotpot_qa"
    },
    {
        "query": "Designed by Chevrolet, this engine shared bore diameter and some parts with General Motors X engine.",
        "response": "122",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the game released in which players gamble casino chips on various possible random outcomes or combinations of outcomes?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1st Battalion, 319th Field Artillery Regiment is assigned to a division based in what state?",
        "response": "North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the second lieutenant in the United States Army who had The White Rose played at his 2001 funeral?",
        "response": "Rick Rescorla",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a Japanese-Canadian action adventure television series staring Scott McCord as Dan Kuso?",
        "response": "Bakugan Battle Brawlers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area of the Island that Wailoa River State Recreation Area is on?",
        "response": "4028 sqmi",
        "source": "hotpot_qa"
    },
    {
        "query": "Were László Benedek and Norman McLaren of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The NAB AFL Rising Star award is given annually to a stand out young player in the Australian Football League, the winner for 2013 was Jaeger O'Meara, a professional Australian rules footballer playing for which sports team?",
        "response": "Hawthorn Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Which religious settlement lived near present-day Iowa City and owned an appliance company now owned by Whirlpool?",
        "response": "The Amana Colony",
        "source": "hotpot_qa"
    },
    {
        "query": "The vocal co-leader of the band Fitz and the Tantrums is from what city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Scaramouche is ofeten beaten by a character believed to have been introduced by whom?",
        "response": "Zan Ganassa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed the program used to create the 147th episode of South Park?",
        "response": "Ambrosia Software",
        "source": "hotpot_qa"
    },
    {
        "query": "What aeronautical engineer ,born in 1932, was the only  person ever hired into the astronaut corps who had already earned astronaut wings?",
        "response": "Joe Henry Engle",
        "source": "hotpot_qa"
    },
    {
        "query": "Bartram Village, Philadelphia is named after a botanist who was described by whom as the \"greatest natural botanist in the world\"?",
        "response": "Carl Linnaeus",
        "source": "hotpot_qa"
    },
    {
        "query": "Lake Bell is an American actress who starred in a 2008 comedy film that starred Cameron Diaz and Ashton Kutcher, and was directed by who?",
        "response": "Tom Vaughan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Joe Bill Dryden Semper Viper Award is an award granted by a company headquartered in what state?",
        "response": "Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Genichiro Sata elected Chief Deputy Secretary of the party also known as Jimintō?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Derived from the characteristically coloured marls and sandstones which occur beneath the chalk is a late Cretaceous lithostratigraphic group,  particularly along the coast of one of six countries that make up what?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Renen Schorr or Michael Schultz?",
        "response": "Michael Schultz",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of movie directed by F. Javier gutierrez did an Italian model and actress star in?",
        "response": "American supernatural psychological horror film",
        "source": "hotpot_qa"
    },
    {
        "query": "\"All I Want for Christmas is You\" is a Christmas song by Mariah Carey, which is the lead single from an album that contains a contemporary holiday theme, and was released by who?",
        "response": "Columbia Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Who served as Physician to the President for the 41st President of the United States?",
        "response": "Burton James Lee III",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American Idol winning singer is represented by the PR company The Outside Organization?",
        "response": "Carrie Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 3 Michelin Star Restaurant that is located in the second largest hotel in the United States?",
        "response": "Joël Robuchon",
        "source": "hotpot_qa"
    },
    {
        "query": "United States Climate Alliance aims to meet or exceed targets of the policy aimed at combating what?",
        "response": "anthropogenic climate change",
        "source": "hotpot_qa"
    },
    {
        "query": "What Republican politician from New York who was the 11th chief justice of the United states appointed Ernest Wilson Huffcut to a role for him.?",
        "response": "Charles Evans Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Mississippi Valley State University located in?",
        "response": "Leflore County, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Were James Lee Burke and William Faulkner from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Marta Eggerth was a singer from the silver age of which genre of light opera, \"light\" in terms both of music and subject matter?",
        "response": "Operetta",
        "source": "hotpot_qa"
    },
    {
        "query": "What 19th-century transportation route through central North America did William Bent and his brothers establish a trade buisness along?",
        "response": "The Santa Fe Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of device is the iPod Classic, formerly known just as the iPod, marketed by Apple, and with an alternative 4G version known as the Apple iPod+HP?",
        "response": "portable media player",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Exidy Sorcerer and Heathkit H11 have in common?",
        "response": "computer",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of Wang Quan'an and Donald Sawyer?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "who has worked on more projects, Mike Valerio or Jean Epstein?",
        "response": "Mike Valerio",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick Cescau was the first combined Chief Executive of the manufacturing company that merged to become what?",
        "response": "Unilever",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the actor who plays Stinky Pete in a 1999 Disney sequel?",
        "response": "February 21, 1955",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dragon's Triangle and the Bermuda Triangle share what name?",
        "response": "Devil's Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "The Møller Centre is a dedicated, residential executive training and conference centre in Cambridge, its full title is The Maersk Mc-Kinney Møller Centre for Continuing Education, named after who, which was a Danish shipping magnate?",
        "response": "Mærsk Mc-Kinney Møller",
        "source": "hotpot_qa"
    },
    {
        "query": "Anti-Semetism in the 21st Century: The Resurgence was hosted by a journalist and writer who is an anchor of what show?",
        "response": "PBS NewsHour",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2014, what was the populatioin of the largest ity in the district once represented by Ben McAdams?",
        "response": "2,423,912",
        "source": "hotpot_qa"
    },
    {
        "query": "Two by-elections to the Swiss Federal Council were held in Switzerland on 22 September 2010, elected were who, which Swiss politician of the Social Democratic Party of Switzerland who is a current member of the Swiss Federal Council, the federal government of Switzerland, and head of the Federal Department of Justice and Police (the Swiss justice minister)?",
        "response": "Simonetta Sommaruga",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Cake and Grandaddy which one was formed in 1992, and featured Jason Lytle?",
        "response": "Grandaddy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American businesswoman and principal owner of the Buffalo Bills was Pegula Ice Arena named after.",
        "response": "Kim Pegula",
        "source": "hotpot_qa"
    },
    {
        "query": "In which period Hong Junsheng faced the turmoil of the Cultural Revolution?",
        "response": "from 1966 until 1976",
        "source": "hotpot_qa"
    },
    {
        "query": "The Orchestra is a rock band formed by former members of what band that was formed in Birmingham in 1970?",
        "response": "Electric Light Orchestra",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the actor, who appeared in \"One Life to Live\" and \"General Hospital\" in 2012, earn a Daytime Emmy Award?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "The Northway Shopping Center  in Colonie, New York is located across Central Avenue from an enclosed shopping mall opened in what year?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Dinner for Schmucks is a 2010 American comedy film directed by Jay Roach, it stars which American actor, comedian, director, producer, and writer, and is best known for playing Michael Scott on the American version of \"The Office\" (2005–2011)? ",
        "response": "Steve Carell",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Augie March and The Ocean Blue both indie bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Seattle University Redwings men's team plays in a complex known as?",
        "response": "Seattle Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kirsty MacColl and The Radio Dept. both based out of England?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "On Physical Lines of Force, is a famous four-part paper written by James Clerk Maxwell, he was able to model which English scientist lines of force?",
        "response": "Michael Faraday",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has had more bandmates, Jersey Budd or The Go-Betweens?",
        "response": "The Go-Betweens",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Ivan Lendl or Lisa Raymond reach a high rank in singles tennis?",
        "response": "Ivan Lendl",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did John McCarthy officiate his first UFC match? ",
        "response": "Denver, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Turkish leisure airline started operations under its own AOC in April 2011?",
        "response": "Corendon Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both B. E. Doxat-Pratt and Lev Yilmaz known for working in the film industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the city in which S. Lester Ralph was the thirtieth Mayor?",
        "response": "75,754",
        "source": "hotpot_qa"
    },
    {
        "query": "WHICH ACTRESS PLAYED CHARACTERS LOVE INTEREST OF SHIA LABEOF'S CHARACTER, DIRECTED BY MICHAEL BAY.",
        "response": "Megan Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Which daughter-in-law of Judah and mother of Perez and Zerah is mentioned in both the Vayeshev and the Book of Genesis?",
        "response": "Tamar",
        "source": "hotpot_qa"
    },
    {
        "query": "Originally hired in April of 2010, who was the head coach of the 2015-16 Missouri Tigers women's basketball team?",
        "response": "Robin Pingeton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the unpleasant children’s camp first appearing in the fouth season of the television The Simpson’s ?",
        "response": "Kamp Krusty",
        "source": "hotpot_qa"
    },
    {
        "query": "Third Murderer appears to assassinate someone in legendary Scottish history known as what?",
        "response": "Fleance",
        "source": "hotpot_qa"
    },
    {
        "query": "Was The Nearly Deads founded in a city closer to the Atlantic Ocean than Of Montreal?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born in 1899 and wrote the book series \"Mary Poppins\"?",
        "response": "P. L. Travers",
        "source": "hotpot_qa"
    },
    {
        "query": "What airport serviced by American Airlines Shuttle, is also the largest airport in the New England region and 17th busiest in the U.S?",
        "response": "Logan International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the film that use \"The Ricks Must Be Crazy\" as a reference?",
        "response": "Jamie Uys",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the conference the members of the Fresno State–San Diego State rivalry are both part of begin operations?",
        "response": "July 1999",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of political party that combined conservative policies with liberal stances were Pio Cabanillas Gallas and Jose Maria de Areilza the leaders of?",
        "response": "liberal conservative",
        "source": "hotpot_qa"
    },
    {
        "query": "Tryphosa Bates-Batcheller is often mentioned in the same context as what American socialite and amateur soprano was known and mocked for her flamboyant performance costumes and notably poor singing ability",
        "response": "Florence Foster Jenkins",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the song on Vampire Weekend's 2013 album with a name and musical echoes of an old Monkees song?",
        "response": "Unbelievers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the original Assassin to \"The Assassins\" was best known as one half of the tag team?",
        "response": "Jody Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Emperor Go-Toba was what head of the Imperial Family in Japan?",
        "response": "Emperor of Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American animated children's television series that debuted in 2006 was created by Josh Selig?",
        "response": "Wonder Pets",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry were both Mike Nichols and Liam Lynch a part of?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "When Larry Johnson played for the UNLV Runnin' Rebels basketball team, in what state was his home team located?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "What river has five waterfalls depicted on a state seal?",
        "response": "Missouri River",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did a Canadian sledge hockey player win gold during a major international multi-sport event involving athletes with a range of disabilities?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What team does a South African-born Australian cricketer play for in the Big Bash League, and a Pakistani professional cricket franchise which plays in the Pakistan Super League?",
        "response": "Sydney Thunder",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the hockey field where the 2015 Hockey City Classic was played open?",
        "response": "1924",
        "source": "hotpot_qa"
    },
    {
        "query": "Heavy Gear II is a sequel to a game that was released in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  Norwegian composer which Jens Peter Daniel Bogren has worked on his album born ",
        "response": "10 October 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city that has an 18-hole championship golf course founded by the George Bryan family?",
        "response": "11,307",
        "source": "hotpot_qa"
    },
    {
        "query": "What town part of the Heysen electoral district is located  in the Adelaide Hills, south-east of Adelaide?",
        "response": "Bridgewater",
        "source": "hotpot_qa"
    },
    {
        "query": "The Filipino theme park known as EK features the Space Shuttle which is what kind of ride?",
        "response": "steel roller coaster",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an alternative translation of the award title given to Marina Alekseyevna Ladynina?",
        "response": "National Artist of the USSR",
        "source": "hotpot_qa"
    },
    {
        "query": "Uncharted 3: Drake's Deception is an action-adventure video game developed by Naughty Dog, the plot draws from the archaeology days of T. E. Lawrence, was a British archaeologist, military officer, diplomat, and writer, born on which date?",
        "response": "16 August 1888",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Taylor Swift's songs from the album \"Reputation\" premiered at the 2017 MTV Video Music Awards, held on August 27, 2017 at the Forum in Inglewood, California?",
        "response": "The music video for Taylor Swift's song \"Look What You Made Me Do\" premiered during the broadcast.",
        "source": "hotpot_qa"
    },
    {
        "query": "What Mexican city had an Athletic Club whose football team played in the Primera Fuerza in 1943?",
        "response": "Puebla",
        "source": "hotpot_qa"
    },
    {
        "query": "When was  American actress born who is a star in both \"The Santa Clause\" and The Purge: Election Year?",
        "response": "March 27, 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Front man of Blutory, Jung Yong-hwa, was cast in what South Korean television series for 16 episodes? ",
        "response": "You're Beautiful",
        "source": "hotpot_qa"
    },
    {
        "query": "Until what year did Afghanistan's captain also called Haroon Fakhruddin play for the Afghanistan national football team?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "The place where Fred Brice served as the head football coach at from 1921 to 1940 was established in what year?",
        "response": "1865",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the stars of the film \"I'm Dangerous Tonight\" was a former marine drill instructor?",
        "response": "R. Lee Ermey",
        "source": "hotpot_qa"
    },
    {
        "query": "What screenwriter was Bernardo Bertolucci married to when he directed Liv Tyler's first leading film role?",
        "response": "Clare Peploe.",
        "source": "hotpot_qa"
    },
    {
        "query": "Funmi Falana is the mother of the rapper and stage actor who began his career with what group?",
        "response": "The School Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "What is special about the wristwatches that Favre-Leuba manufactures?",
        "response": "Swiss made",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Kansas City International Airport and Bismarck Municipal Airport, which airport is categorized as a primary commercial service airport?",
        "response": "Bismarck Municipal Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What county in the 10-county Atlanta Regional Commission had a population of 259,424 during the 2010 census?",
        "response": "Clayton County",
        "source": "hotpot_qa"
    },
    {
        "query": "Palaeoscincus is a genus of dinosaur based on what upper Cetaceous Formation from 80 - 75 million years ago?",
        "response": "Judith River Formation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song on the album The Downward Spiral was a top 40 hit in 1995?",
        "response": "Hurt",
        "source": "hotpot_qa"
    },
    {
        "query": " Alfred C. Baldwin III was hired by a CIA officer who has been linked to which scandal ?",
        "response": "the Watergate scandal",
        "source": "hotpot_qa"
    },
    {
        "query": "The Electoral district of Fisher covers what city the has the known shopping mall called \"The Hub\"?",
        "response": "Aberfoyle Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animal rights activist starred along side of John Forsythe's daughters on The John Forsythe Show?",
        "response": "Pamelyn Ferdin",
        "source": "hotpot_qa"
    },
    {
        "query": "Duerme Negrito is a popular Latin American folkloric lullaby, originally an area near the Venezuelan and Colombian border, the song was popularized by himself and other musicians, such as Mercedes Sosa, sometimes known as La Negra, was an Argentine singer, who was popular throughout Latin America and many countries outside the region, and was born, on which holiday?",
        "response": "Argentina's Independence Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was described as post-harcore, The Ready Set or Rapeman/>",
        "response": "Rapeman",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Adamowicz is known for his work at a game developer which is lead by who?",
        "response": "Todd Howard",
        "source": "hotpot_qa"
    },
    {
        "query": "Which states in the United States of America have connections to both the Saint Louis River and Lake Superior?",
        "response": "Minnesota and Wisconsin",
        "source": "hotpot_qa"
    },
    {
        "query": "John Parker is the younger brother of a professional boxer that was born what year?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Does the Mexican Hairless Dog or the Dalmatian breed come in various sizes?",
        "response": "hairless breed of dog, found in toy, miniature, and standard sizes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city six miles north of Octagon City?",
        "response": "1,953",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a survival documentary, Go Further or Touching the Void?",
        "response": "Touching the Void",
        "source": "hotpot_qa"
    },
    {
        "query": "The physicist born in 1871 who worked on the identification of alpha radiation as the nucleus of the helium atom, was considered by Encyclopedia Britannica to be the greatest experimentalist since who ?",
        "response": "Michael Faraday",
        "source": "hotpot_qa"
    },
    {
        "query": "What American mainstream R&B group signed by Jermaine Dupri  has a song featuring samples the beat of LL Cool J's song \"Kanday\" from his album  ",
        "response": "Jagged Edge",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American musical comedy-drama film directed by Stephen Herek, for which Tom Werman produced the music and soundtrack, released?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "WHo is the person who wrote many novels about Reginald Ashley Caton's child?",
        "response": "Martin Amis",
        "source": "hotpot_qa"
    },
    {
        "query": "What century were the Leiper Canal and Duluth Ship Canal built?",
        "response": "19th century",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sprekelia and Arisaema both plants in the Amaryllis family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote Sangita Makaranda an ancient work on classical Indian music whose main feature is the treatment of Ragas?",
        "response": "Narada",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American professional basketball team was founded in 1946 and picked Jamie Feick in the 2nd round of the 1996 NBA draft?",
        "response": "Philadelphia 76ers",
        "source": "hotpot_qa"
    },
    {
        "query": "How long has the award been given that Glynis Johns won an award for her role of Desiree Armfeldt?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Gardner Sheppard Hardee, was the founding settler of Rockledge, Florida and a member of which upper house of the legislature of the U.S. state of Florida?",
        "response": "Florida Senate",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2014 Ottawa Fury goalkeeper coach missed a shot deflected off Ronnie Whelan in the 1987 Football League Cup Final?",
        "response": "Bruce Grobbelaar",
        "source": "hotpot_qa"
    },
    {
        "query": "What daytime medical soap opera has an actor who has appeared in an Italian drama television series starring Jude Law?",
        "response": "General Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "What symbol identifies the currency that is maintained by the caja de conversión?",
        "response": "$",
        "source": "hotpot_qa"
    },
    {
        "query": "During which United States national holiday was the Mothership Space Net Penthouse completed in 2014?",
        "response": "Thanksgiving",
        "source": "hotpot_qa"
    },
    {
        "query": "Size2shoes performed alongside a an actor known for \"Gladiator\" called what?",
        "response": "Russell Crowe",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed Jim Aton in a 1969 film?",
        "response": "Sydney Pollack",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2013 Indiana Hoosiers football team were lead by which current offensive coordinator at Ohio State?",
        "response": "Kevin Reece Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the physicist that used electrostatic levitation in his oil drop experiment born?",
        "response": "1868",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first overall pick in the 2000 NBA draft held at the Target Center in Minneapolis?",
        "response": "Kenyon Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "A Danish actress born 14 February 1978 was in a french Fantasy and romantic drama film. Who was the director of that film?",
        "response": "Luc Besson",
        "source": "hotpot_qa"
    },
    {
        "query": "TLC: Tables, Ladders & Chairs was an event that was held at the arena in what part of Dallas?",
        "response": "Victory Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Seven Brief Lessons on Physics was written by an Italian physicist that has worked in France since what year?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "are Better Homes and Gardens and Al Jamila from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In commercial aviation, what is the system where in-flight food or beverages are able to be purchases after being issue the document or electronic record by the airline?",
        "response": "In commercial aviation, buy on board (BoB) is a system where in-flight food or beverages are not included in the ticket price, but are either purchased on board",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the American football quarterback born who is in the cover of NCAA Football 2004?",
        "response": "December 27, 1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What game, created by Swedish game designer Markus \"Notch\" Persson uses FireDeamon Pro as an operating system service management?",
        "response": "Minecraft",
        "source": "hotpot_qa"
    },
    {
        "query": "Canada Bay, New South Wales is in the local government area of a city formed when?",
        "response": "1 December 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Gene Hackman won an Academy Award for best actor in a movie directed by who ?",
        "response": "William Friedkin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the party that included Roberto Bueno Campos founded?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Rugby union at the 1979 South Pacific Games was held in Fiji at the newly renovated National Stadium in which southeast coastal city on the island of Viti Levu?",
        "response": "Suva",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Bonauto has been referred to as \"our Thurgood Marshall\" by a US Representative that served as chairman of the House Financial Services Committee during what years?",
        "response": "2007–2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Myles Goodwyn or Jesse James Dupree?",
        "response": "Myles Francis Goodwyn",
        "source": "hotpot_qa"
    },
    {
        "query": "In which league did this professional minor league ice hockey team, which Knoxville Ice Bears played against at the final, play in 2010?",
        "response": "Central Hockey League",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who was part of the cast of The Ridiculous 6 played what role in The Twilight Saga?",
        "response": "Jacob Black",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created both the movie and television shows The Naked Brothers Band?",
        "response": "Polly Draper",
        "source": "hotpot_qa"
    },
    {
        "query": "Spitzer Space Telescope and INTEGRAL, are which type of specific item?",
        "response": "space telescope",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the English 2010 FIFA squad was also a member of the Tampa Bay Rowdies? ",
        "response": "Joe Cole",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Elko Regional Airport and Gerald R. Ford International Airport located in Michigan?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal was built between 1836 and 1847, Washington City Canal or Whitewater Canal?",
        "response": "The Whitewater Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a cave diving organisation which was formed in September 1973 that administers and supports cave diving activity in other parts of Australia including the Nullarbor Plain and  a town in inland New South Wales, Australia, located at the junction of the Macquarie and Bell Rivers?",
        "response": "Cave Divers Association of Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Philip Marlowe, Private Eye, and an American Western television Series produced by David Milch feature which actor? ",
        "response": "Powers Boothe",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the professions of Terry Hall and Joseph Williams?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Simon Boccanegra and L'elisir d'amore, are operas?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an American consumer goods corporation founded in 1837 by a British-born American candlemaker and industrialist?",
        "response": "P&G",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won more grand slam titles Lisa Raymond or Stan Wawrinka?",
        "response": "Lisa Raymond",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song that was the A-side to the song \"Summertime\"?",
        "response": "Burt Bacharach and Bob Hillard",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1996, Terence P. Jeffrey became editor of a website founded as a newspaper in what year?",
        "response": "1944",
        "source": "hotpot_qa"
    },
    {
        "query": "Margaret Mary Ray stalked an American physician and retired NASA astronaut who is a public speaker and consultant to Disney's IMagineering group, and who else?",
        "response": "Applied Minds",
        "source": "hotpot_qa"
    },
    {
        "query": " Ina Anita Carter (March 31, 1933 – July 29, 1999), the youngest daughter of Ezra and Mother Maybelle Carter, was a versatile American singer, splayed upright bass with her sisters Helen Carter and June Carter Cash as The Carter Sisters, were an American singing quartet consisting of who, and her daughters ?",
        "response": "Maybelle Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the defending champion at the Men's Singles tournament of the 2013 BWF World Championships?",
        "response": "Chinese",
        "source": "hotpot_qa"
    },
    {
        "query": "Midwinter Graces is the eleventh solo studio album by an American singer-songwriter, pianist, and composer, whose vocal range is what?",
        "response": "mezzo-soprano",
        "source": "hotpot_qa"
    },
    {
        "query": " Dulwich College is a member of an association of how many independent schools?",
        "response": "283",
        "source": "hotpot_qa"
    },
    {
        "query": "Killer Be Killed is the debut studio album from the supergroup Killer Be Killed, included what Brazilian heavy metal band from Belo Horizonte?",
        "response": "Sepultura",
        "source": "hotpot_qa"
    },
    {
        "query": "Ilya Naishuller and Sacha Guitry are from which countries?",
        "response": "Alexandre-Pierre Georges \"Sacha\" Guitry (] ; 21 February 188524 July 1957) was a French stage actor, film actor, director, screenwriter, and playwright of the Boulevard theatre.",
        "source": "hotpot_qa"
    },
    {
        "query": "Edgar Evans had a famous role in the play composed by which Russian composer of the Romantic period?",
        "response": "Pyotr Ilyich Tchaikovsky",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University is both a rival to the Baldwin Wallace Yellow jackets and a coeducational, liberal arts college?",
        "response": "The University of Mount Union",
        "source": "hotpot_qa"
    },
    {
        "query": "A Monster Folk member and guitarist teamed up with what American singer songwriter to record the album \"The Coincidentalist\"?",
        "response": "Howe Gelb",
        "source": "hotpot_qa"
    },
    {
        "query": "Going Out was the first single from the second album by which English rock band from Oxford?",
        "response": "Supergrass",
        "source": "hotpot_qa"
    },
    {
        "query": "The Last Resort was the B-side of what Eagles' single in 1977?",
        "response": "Life in the Fast Lane",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the Toll House Cookie and also named them after the inn she owned?",
        "response": "Ruth Graves Wakefield",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a series called Trust centered around him and founded Getty Oil?",
        "response": "J. Paul Getty",
        "source": "hotpot_qa"
    },
    {
        "query": "Surviving Picasso is a 1996 Merchant Ivory film starring Anthony Hopkins as the famous painter Pablo Picasso, the screenplay was loosely based on the biography \"Picasso: Creator and Destroyer\" by which Greek American author, syndicated columnist, and businesswoman?",
        "response": "Arianna Stassinopoulos Huffington",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film, co-written, directed, and produced by Nicholas Stoller, did Da'Vone McDonald briefly appear in?",
        "response": "The Five-Year Engagement",
        "source": "hotpot_qa"
    },
    {
        "query": "Bartolomé \"Tomeu\" Salvá Vidal, is a Spanish tennis player, while he plays singles, he is also a doubles player, who partners with Rafael Nadal, a Spanish professional tennis player, currently ranked World No. what in men's singles?",
        "response": "1",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Fixer\" is a song from an album produced by who ?",
        "response": "Brendan O'Brien",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the band that released the studio album \"Blackhawk\" formed?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Jereme Leafe is originally from a ton in Grafton County, New Hampshire, that is located along a bend in what river?",
        "response": "Connecticut River",
        "source": "hotpot_qa"
    },
    {
        "query": "Floyd Gerhardt is a fictional character in the the second season of Fargo, an American anthology black comedy–crime drama television series created by Noah Hawley, premiered on which date, on the basic cable network FX?",
        "response": "October 12, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed more films, Marguerite Duras or Arthur Rosson?",
        "response": "Arthur Rosson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who originally wrote an unproduced script that later became an animated movie in which the song \"Chanson Illusionist\" was featured?",
        "response": "Jacques Tati",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession did both Leni Riefenstahl and Abel Ferrara share?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter J Pestillo is the former Chairman and CEO of Visteon based in a city in Wayne County, and that had a population of what in the 2010 cesus?",
        "response": "98,153",
        "source": "hotpot_qa"
    },
    {
        "query": "Which an American actor has a recurring role on an and series based on a tailor and spy, born on September 25, during the American Revolutionary War?",
        "response": "Kelly AuCoin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Walking with Monsters and Youth in Crisis both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Shifty Shellshock and Alex Désert from the same country",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the original film to which \"2048: Nowhere to Run\" is a sequel released?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Both MedStar Georgetown University Hospital and Children's National Medical Center are located in which U.S. city?",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Seattle–Tacoma International Airport and Cyril E. King Airport in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What season did the Houston Rockets pick up the basketball player born in 1989?",
        "response": "the 46th season",
        "source": "hotpot_qa"
    },
    {
        "query": "What was officially initiated by Sherif Hussein bin Ali at Mecca on 10 June 1916, and was part of the Siege of Medina that occurred during World War I?",
        "response": "Arab Revolt",
        "source": "hotpot_qa"
    },
    {
        "query": "Broadbent Arena and Freedom Hall are landmarks of which U.S. city?",
        "response": "Louisville",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is the location of the University that plays Florida A&M University in the Florida Cassic?",
        "response": "Daytona Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Jay-Z released his 1996 Rolling Stone-rated \"500 Greatest\" album on which record labels?",
        "response": "Roc-A-Fella Records and Priority Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the paternal grandfather of Alexander Macmillan ?",
        "response": "Harold Macmillan",
        "source": "hotpot_qa"
    },
    {
        "query": "A Cameroonian footballer player is one of eleven players to have played in the top divisions in Europe as well as another player from Chile who can play as what three positions?",
        "response": "striker, second striker or winger",
        "source": "hotpot_qa"
    },
    {
        "query": "What school district is the campus that the Kansas City Spartans play their home games on in?",
        "response": "Unified School District 512",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthday of the former President of Israel whose resignation resulted in the 2000 election?",
        "response": "15 June 1924",
        "source": "hotpot_qa"
    },
    {
        "query": "Which German aeronautical engineer concieved the Dornier Aerodyne?",
        "response": "Alexander Lippisch",
        "source": "hotpot_qa"
    },
    {
        "query": "On May 25, 2017 Greg Gianforte won the special election following the resignation of a politican that current holds what position?",
        "response": "United States Secretary of the Interior",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of living organisms are categorised by the genus Delairea from the family Asteraceae and the genus Hedyotis also known as starviolet?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Quietdrive and Supergrass?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is Italian, James Rolfe or Liliana Cavani?",
        "response": "Liliana Cavani",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University is the oldest, Princeton University or the University of Kentucky?",
        "response": "Princeton University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Aliens of the Deep or The Rescuers Down Under?",
        "response": "The Rescuers Down Under",
        "source": "hotpot_qa"
    },
    {
        "query": "He's the DJ, I'm the Rapper, by DJ Jazzy Jeff and the Fresh Prince, was an early project by which famous rapper and film star?",
        "response": "Will Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "William E. Kapelle is a medieval historian at a university in a city which was the prototype for what?",
        "response": "19th century industrial city planning",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Bananarita and the The Goldeneye served in different kind of glass?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, The Christadelphian Tidings of the Kingdom of God or Hello Mr.?",
        "response": "The Christadelphian Tidings of the Kingdom of God",
        "source": "hotpot_qa"
    },
    {
        "query": " Green on Red and Hollywood Undead are both what?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Belushi: A Biography is an \"oral history\" biography of a comedian born in what year?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Boaz Yakin and Max W. Kimmich have the same profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What brand does the company that  Tadashi Yanai is the founder of own other than uniqlo?",
        "response": "J Brand",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Laura Ingalls Wilder and P. G. Wodehouse have in common?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "the work of The Last Poets and Gil Scott Heron inspired music that fits under what larger sub-genre?",
        "response": "underground hip hop",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the contractors of the Kendal Windermere Railways had also built one third of the railways in which country by 1847?",
        "response": "Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "Dominick V. \"Quiet Dom\" Cirillo briefly served as acting boss for a mobster who started out as a what?",
        "response": "professional boxer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Incyte and DXC Technology both publicly traded?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the illustrator of Batman: The Killing Joke born?",
        "response": "26 March 1951",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the star of the 1982 remake of The Spider's Web appointed to Dame Commander of the Order of the British Empire (DBE)?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "The venue where The Heart of Gaming opened on April 29th 2017 first opened in stages between what years?",
        "response": "1968 and 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Four Seasons and Julian Cope the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "he Frozen Ground is a 2013 American crime thriller drama film directed and written by who, one of its stars is Radha Mitchell, an Australian actress, she started her career acting in various Australian television series and films?",
        "response": "Scott Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the training ground for the club Arthur Crompton played for?",
        "response": "Bulls Cross",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the host of the show Sabrina?",
        "response": "Lorena Fabiana Colotta",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the Bulgarian-Canadian film director and producer, known for his work in the 1989 American comedy about a dead boss, currently reside?",
        "response": "Beverly Hills, California",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the town as of 2010 from where Carrie Gertrude Stevens came?",
        "response": "4,855",
        "source": "hotpot_qa"
    },
    {
        "query": "Sirene was a Norwegian barque that was wrecked against Blackpool's North Pier, on which date?",
        "response": "9 October 1892",
        "source": "hotpot_qa"
    },
    {
        "query": "2014 S/S is the debut album of a South Korean boy group that was formed by who?",
        "response": "YG Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, The Living Church, or Asimov's Science Fiction?",
        "response": "The Living Church",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the game in which George Newbern played Sephiroth? ",
        "response": "Tetsuya Nomura",
        "source": "hotpot_qa"
    },
    {
        "query": "Blue Streak is a roller coaster at the park located in what Pennsylvania city?",
        "response": "Conneaut Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Tara Seibel (born February 4, 1973) is an American cartoonist, graphic designer and illustrator from Cleveland, her work has been published in which magazine created in 1994 by a group of artists and collectors including Robert Williams, Fausto Vitello, C.R. Stecyk III (a.k.a. Craig Stecyk), Greg Escalante, and Eric Swenson to both help define and celebrate urban alternative and underground contemporary art?",
        "response": "Juxtapoz Art & Culture Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Red Swoosh was a peer-to-peer file sharing company founded in 2001, by Travis Kalanick, an American businessman, and who else?",
        "response": "Michael Todd",
        "source": "hotpot_qa"
    },
    {
        "query": "American actor Ma Dong-seok stars in a movie based on the story of who?",
        "response": "Jang Ja-yeon",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Cocoa Krispies and former Superman sponsor located?",
        "response": "Battle Creek, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which big box store that surrounds Westgate Mall has 78 supermarkets in New Hampshire, Massachusetts, and Maine?",
        "response": "Market Basket",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the birthplace of the Belgian former football goalkeeper of whom Anne Noe had to wear their old shirts?",
        "response": "Lebbeke",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was older at their time of death, Pedro Sienna or Eugeniusz Bodo?",
        "response": "Pedro Sienna",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person created the animated sitcom that \"Mayored to the Mob\" is an episode of?",
        "response": "Matt Groening",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game can be played by more than 2 players at a time, Game of the Generals or Ludo?",
        "response": "Ludo",
        "source": "hotpot_qa"
    },
    {
        "query": "What corporation does the company that publishes the monthly magazine that focuses almost exclusively on the Western United States and featured photograph by Julius Shulman of a home designed by Rodney Walker belong to?",
        "response": "Southern Progress Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "on 16 January 1995 \"First Knight\" was being filmed at a studio located how far from Windsor ?",
        "response": "7 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of vegetation does Tabernaemontana and Crinum have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Faline is a fictional character in two Disney films the first of which came out in what year?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the hotel, founded by E. S. Babcock, designated a National Historic Landmark?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the album Before REMIXXXX by You Say Party released?",
        "response": "September 29, 2009",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Lynn Franklin and Robert F. Kennedy have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the play which  Carmen Tănase  in ",
        "response": "Albert Camus",
        "source": "hotpot_qa"
    },
    {
        "query": "What month of the year did the symbolic monarchy of the Tulip Festival takes place? ",
        "response": "May",
        "source": "hotpot_qa"
    },
    {
        "query": "Wincenty Gostkowski, was a lawyer and associate of Antoni Patek, and who?",
        "response": "Adrien Philippe",
        "source": "hotpot_qa"
    },
    {
        "query": "The March to the Drina was dedicated to a commander who had fought during a battle in the early stages of what war?",
        "response": "First World War",
        "source": "hotpot_qa"
    },
    {
        "query": "Tower of Terror is a 1997 made-for-TV supernatural thriller, it's based on which accelerated drop tower dark ride?",
        "response": "The Twilight Zone Tower of Terror",
        "source": "hotpot_qa"
    },
    {
        "query": "Which expedition was the man who developed the Chinook dogsled breed part of?",
        "response": "Byrd Antarctic Expedition",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of the Volta Laboratory and Bureau was credited with patenting what first? ",
        "response": "telephone",
        "source": "hotpot_qa"
    },
    {
        "query": "What current state did the father of Nathan Boone settle?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is from India, Kromfohrländer or Mudhol Hound?",
        "response": "Mudhol Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "In America \"Instant Karma!\" competed with a song that had the highest debut on the \"Billboard\" Hot 100, beginning its chart run at what?",
        "response": "number 6",
        "source": "hotpot_qa"
    },
    {
        "query": "The American multinational oil and gas corporation headquartered in Irving, Texas is giving how much much money to the Liquefied Natural Gas Project in Hides?",
        "response": "$16 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the new stadium for the Atlanta Falcons open in?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine published first, Premiere or Nickelodeon Magazine?",
        "response": "Premiere",
        "source": "hotpot_qa"
    },
    {
        "query": "Some of Jane Hamilton-Merritt's worked focused on breeding a a domesticated species of South American what?",
        "response": "camelid",
        "source": "hotpot_qa"
    },
    {
        "query": "Luca Hischier, is a Swiss ice hockey player currently playing with SC Bern of the National League (NL), internationally Hischier has represented Switzerland at the 2015 World Junior Championships, was the 39th edition of World Junior Ice Hockey Championship, played from December 26, 2014 to which date?",
        "response": "January 5, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people live in the area maintained by the Cherokee National Forest?",
        "response": "25 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Laura Fermi's husband won a Nobel Prize in Physics in what year?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, WomenSports or I Confess, was the first magazine dedicated to women in sports?",
        "response": "womenSports",
        "source": "hotpot_qa"
    },
    {
        "query": "What style of songs are Lana Del Rey's  \"Born to Die\" and \"Video Games\"?",
        "response": "pop ballad",
        "source": "hotpot_qa"
    },
    {
        "query": "Which US Supreme Court case occured first, Engel v. Vitale or United States v. Guest?",
        "response": "Engel v. Vitale",
        "source": "hotpot_qa"
    },
    {
        "query": "This New York City born actress gained prominence for her lead roll in an American romantic comedy film with many scenes shot at what Tacoma school?",
        "response": "Stadium High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Anticimex's parent company headquartered?",
        "response": "EQT Plaza in Pittsburgh, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "What television show was produced by Scott Gimple and is centered on Cornelius Fillmore?",
        "response": "Fillmore!",
        "source": "hotpot_qa"
    },
    {
        "query": "Ontario Mills and The Great Mall of the Bay Area are both located where?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, born July 3, 1959, wrote the Simpson's episode \"The Trouble with Trillions\"?",
        "response": "Ian Maxtone-Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization controlled Hilmar Björnsson and the Iceland national football team?",
        "response": "Football Association of Iceland",
        "source": "hotpot_qa"
    },
    {
        "query": "Hate to Feel is the tenth track on what Alice in Chains' album that peaked as number six on the Billboard 200?",
        "response": "Dirt",
        "source": "hotpot_qa"
    },
    {
        "query": "In what publication are the regulations for the governing bodg for racing events?",
        "response": "International Sporting Code.",
        "source": "hotpot_qa"
    },
    {
        "query": "Boris Vasilyevich Shchukin, was a Soviet actor in 1936 received which honorary title granted to artists of the Soviet Union?",
        "response": "People's Artist of the USSR",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American film director is known for the sexploitation film genre, Wes Anderson or Doris Wishman?",
        "response": "Doris Wishman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a crime that is punishable by the type of sentence that Madame Le Corbeau received in Canada?",
        "response": "capital crimes or capital offences",
        "source": "hotpot_qa"
    },
    {
        "query": "Battle of Canusium was part of a larger offensive to narrow the base of the general who was the son of which commander?",
        "response": "Hamilcar Barca",
        "source": "hotpot_qa"
    },
    {
        "query": "Om Prakasj Sharma received the National Award for Painting by what commander-in-chief of the Indian Armed Forces?",
        "response": "President of India",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film did Emilio Estevez star in in the same year as Nightmares",
        "response": "The Outsiders",
        "source": "hotpot_qa"
    },
    {
        "query": "Picnic at Hanging Rock starred a film actress who was born on 20th of July of what year?",
        "response": "1924",
        "source": "hotpot_qa"
    },
    {
        "query": "What Norwegian heiress, is the daughter of the owner of Norwegian holding company Ferd?",
        "response": "Alexandra Gamlemshaug Andresen",
        "source": "hotpot_qa"
    },
    {
        "query": "What team won the Stanley Cup Final in the first season that Matthew Martin led the league in hits delivered?",
        "response": "Los Angeles Kings",
        "source": "hotpot_qa"
    },
    {
        "query": "Based on the satrical essay ny Jonathan Swift, the open letter \"A Modest Video Game Proposal\" was sent to which attorney in 2005?",
        "response": "Jack Thompson",
        "source": "hotpot_qa"
    },
    {
        "query": "Bae Ki-tae, is a former speed skater from which country?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "What companies does the creator of Heroes for Hire work for?",
        "response": "Marvel Comics and DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "The mixed-use, urban complex where The Harmon was a highrise building at has how many square feet?",
        "response": "16797000",
        "source": "hotpot_qa"
    },
    {
        "query": " Intelligent Design is a summary of mathematical theory based on a book by a philosopher of what ethnicity?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which George S. Kaufman-Moss Hart play is the musical with lyrics by the dean emeritus of the Actors Studio Drama School at Pace University in New York City, based on?",
        "response": "\"The Man Who Came to Dinner\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what years did Jo Platt's predecessor hold her office?",
        "response": "2001 to 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in All You Need Is Kill inspired Tom Cruise's character in Edge of Tomorrow?",
        "response": "Keiji Kiriya",
        "source": "hotpot_qa"
    },
    {
        "query": "Mariinsky Theatre Second Stage has hosted which Russian operatic soprano?",
        "response": "Anna Yuryevna Netrebko",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do both Michael Jones and Maher Sabry share?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the bomb dropped on Hiroshima by the B-29 aboard which Thomas Ferebee was the bombardier dropped?",
        "response": "6 August 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "OSA Archivum, abbreviated as OSA, short for Open Society Archives at the Central European University, is an archival repository and laboratory that aims to explore new ways of assessing, contextualizing, presenting, and making use of archival documents both in a professional and a consciously activist way, it was founded in 1995, by which Hungarian-American investor, business magnate, philanthropist, and author?",
        "response": "George Soros",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the current representative of the House of Commons in the UK Parliament elected as a North Wales regional Assembly Member?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Laura García-Caro Lorenzo (born 16 April 1995) is a female racewalker from Spain, a sovereign state located on which location, in southwestern Europe, with two large archipelagos, and other various islands?",
        "response": "Iberian Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the quarterback for the New England Patriots during their 32nd season in the National Football League?",
        "response": "Tom Brady",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Oklahoma All-American defensive tackle helped the 2010 Tampa Bay Buccaneers achieve the best turnaround in franchise history?",
        "response": "Gerald McCoy",
        "source": "hotpot_qa"
    },
    {
        "query": "Of all Hitchcock films that Dorothea Holt Redmond collaborated in, which film stars Laurence Olivier?",
        "response": "Rebecca",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the forming year of this American indie rock band that formed in Stockton, California, and was produced by Nigel Godrich?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1989 film on which \"Batman: The Ride\" is thematically based?",
        "response": "Tim Burton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the main antagonist in the New Zealand television film, The Hunchback?",
        "response": "Richard Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the person who was born on May 5, 1972 who is featured in Chocolate City: Vegas Strip?",
        "response": "Darrin Henson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a supporting cast member of King Rat and was knighted in February 2001?",
        "response": "Sir Thomas Daniel Courtenay",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the band the man who released truth is a frontman for from?",
        "response": "Orange County, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The four Tantum ergo are settings of the hymn \"Tantum ergo\" composed by a composer of what nationality?",
        "response": "Austrian",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the American socialite, musician, author and former model who was the wife of Senator Ted Kennedy and mother to Kara Kennedy, the oldest of three children and a member of the Kennedy dynasty?",
        "response": "Joan Bennett Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state are both Soccer America and Entrepreneur headquartered in?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical was inspired by the films that included Ruth Leuwerik's best known role?",
        "response": "The Sound of Music",
        "source": "hotpot_qa"
    },
    {
        "query": "Anetta Kahane is a former agent for the official state security service of the German Democratic Republic which was headquartered where?",
        "response": "East Berlin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country did Konami Holdings Corporation release the Evolution Snowboarding video game?",
        "response": "Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "What show created by Micheal jacobs and april kelly featured actor Danny brian mcnulty?",
        "response": "\"Girl Meets World\"",
        "source": "hotpot_qa"
    },
    {
        "query": "During which years was the model of car, featured on the cover of Earth's \"Pentastar: In the Style of Demons\" manufactured?",
        "response": "1964 to 1974",
        "source": "hotpot_qa"
    },
    {
        "query": " Dwellers in the Crucible was a novel that spoke of the friendship between Spock and which captain of the Enterprise?",
        "response": "James Tiberius \"Jim\" Kirk",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what origin is the name of the Russian game that inspired Puyo Puyo?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "What landmark is located in Caithness, Scotland, and west of John o' Groats?",
        "response": "Castle of Mey",
        "source": "hotpot_qa"
    },
    {
        "query": "What children's book was written by the director of short series featuring Disney animation cartoon character that resembles a mouse?",
        "response": "Big Ideas of Buster Bickles",
        "source": "hotpot_qa"
    },
    {
        "query": "J. B. Thompson was a cricketer for the club founded in what year?",
        "response": "1838",
        "source": "hotpot_qa"
    },
    {
        "query": "What colonel during the Mexican Revolution owned a factory that distilled an alcoholic beverage made from any type of agave plant native to Mexico?",
        "response": "Amelio Robles Avila",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Macquarie Town is 65 km by road from Sydney?",
        "response": "Richmond",
        "source": "hotpot_qa"
    },
    {
        "query": "Occultic;Nine, is a Japanese light novel series written by who, the creator of \"Steins;Gate\"?",
        "response": "Chiyomaru Shikura",
        "source": "hotpot_qa"
    },
    {
        "query": "1966 South African Grand Prix ended with a car in 2nd place that was by a company founded in what year?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the author of the book on which the 2008 movie starring Azharuddin Mohammed Ismail was loosely based?",
        "response": "Vikas Swarup",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died on March 4, 1994 and was in the famed comapny with Suzanne?",
        "response": "John Candy",
        "source": "hotpot_qa"
    },
    {
        "query": "Georges Jaloustre was a Minister of State for the most densely populated sovereign state in the world that has a population of how many people?",
        "response": "38,400",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2014 American comedy-drama film that is being remade as a Hindi film directed by Raja Krishna Menon?",
        "response": "Jon Favreau",
        "source": "hotpot_qa"
    },
    {
        "query": "Coptic nationalism is a belief system of a group of people who inhabit which modern-day nation?",
        "response": "Egypt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is an actor, Sid Haig or Don Manoukian?",
        "response": "Sid Haig",
        "source": "hotpot_qa"
    },
    {
        "query": "What school did the British sports businessman, who attempted to ban the British athlete who has the fourth fastest time by a British sprinter, go to?",
        "response": "King Edward's School, Birmingham",
        "source": "hotpot_qa"
    },
    {
        "query": "Texas Tech University and Brigham Young University are both research universities, but are they both public?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " The Nantahala National Forest and the Croatan National Forest are both located in which state?",
        "response": "North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "What Danish art drama film inspired the name of Lars von Trier's film company?",
        "response": "Europa",
        "source": "hotpot_qa"
    },
    {
        "query": "Two positions were filled in The Voice of Ireland b which British-Irish girl group based in London, England?",
        "response": "The Saturdays",
        "source": "hotpot_qa"
    },
    {
        "query": "Nowhere but Up was written by the mother of whom?",
        "response": "Justin Bieber",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university does the football team who invited 2016 Auburn Tigers football team to the Sugar Bowl?",
        "response": "University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the retired American Olympic gymnast which  Tim Daggett  competed with in the 1984 Los Angeles Olympics born",
        "response": "March 28, 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Christopher Markus and Stephen McFeely are screenwriters for a series of fantasy films by C.S. Lewis, what was the film series?",
        "response": "The Chronicles of Narnia",
        "source": "hotpot_qa"
    },
    {
        "query": "What British rock band is responsible for bolstering Quiet Riot's hit \"Mental Health?\"",
        "response": "Slade",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did Thomas Doherty play in sitcom based on the Israeli series \"North Star\"?",
        "response": "Sean",
        "source": "hotpot_qa"
    },
    {
        "query": "What are alternate names for the type of roof on Ravenswood, a historic home located near Bunceton, Missouri?  ",
        "response": "\"French roof\" or \"curb roof\"",
        "source": "hotpot_qa"
    },
    {
        "query": "William Kite was best known as being Mr. Kite from the song \"Being for the Benefit of Mr. Kite\" which was composed from what English band?",
        "response": "the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "Starship Entertainment, is a South Korean record label established in 2008 by Kim Shi Dae, and formerly home to girl group Sistar, it currently manages artists such as which South Korean-Chinese girl group formed by Starship Entertainment and Yuehua Entertainment which debuted in 2016, also known as WJSN?",
        "response": "Cosmic Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What Satanic band had a lyrical theme featuring the mass murderer with the birth surname of Maddox?",
        "response": "Burn, Baby, Burn!",
        "source": "hotpot_qa"
    },
    {
        "query": "What author provided a bases for one of James Garner's films?",
        "response": "Nicholas Sparks",
        "source": "hotpot_qa"
    },
    {
        "query": "World Series of Fighting 31: Ivanov vs. Copeland took place at a hotel and casino complex on what Indian reservation?",
        "response": "Mashantucket Pequot Indian Reservation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who served as the 1st Vice President of Colombia under El Libertador?",
        "response": "Antonio Hilarión Zea Díaz",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ride a Wild Pony and Frozen 2 computer-animated films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In which Georgia county is inactive Robins Air Force Base located?",
        "response": "Houston County",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of plants are Galium odoratum and Chadsia?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Young Dolph was featured on the hit single by which American hip hop recording artist?",
        "response": "O.T. Genasis",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Terry was trained in \"Harvey's\" by a British chef born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that created the Data Universal Numbering System has a database that contains how many business records?",
        "response": "265 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are the band formed in 2008 that leads their music scene along with a band who self-describes as pagan?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the film, other than The Good Shepherd, in which Leonard Logsdail appeared as a tailor ?",
        "response": "Martin Scorsese",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the university where Philip Pedley was educated established?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Harry Styles is the debut studio album by English singer and songwriter Harry Styles, it was preceded by the release of its lead single, \"Sign of the Times\", released on which date?",
        "response": "7 April 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music band is associated with Sun Set?",
        "response": "rock group",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: What venue, also called the \"Convent Garden,\" did Adrian Boult conduct for?",
        "response": "The Royal Opera House",
        "source": "hotpot_qa"
    },
    {
        "query": "Live: In Paradise is a live concert DVD by a musical duo from where?",
        "response": "Boston, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population, within the town limits, in the  2010 census, of the town where Chesapeake Tide were based ?",
        "response": "631",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor, born in Lucknow, starred in the 2013 Hindi film Fukrey?",
        "response": "Ali Fazal",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sydney Ghost Train was first constructed in 1931, and had been transported from a city located on the shores of which bay ?",
        "response": "Holdfast Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Eva Anna Paula Hitler, was the longtime companion of Adolf Hitler and, for fewer than 40 hours, his wife, she was a key figure within Hitler's inner social circle, mid-1944, when her sister Gretl married which high-ranking commander in the Waffen-SS of Nazi Germany?",
        "response": "Hermann Fegelein",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tri-City ValleyCats play at which stadium located on the campus of Hudson Valley Community College in Troy, New York?",
        "response": "Joseph L. Bruno Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Have John Dufresne and Mario Vargas Llosa both won awards for their work?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Man Who Never Was is a 1956 Second World War film, based on the book of the same name by Lt. Cmdr. Ewen Montagu and dramatising actual events, it is about which 1943 British Intelligence plan to deceive the Axis powers into thinking Operation \"Husky\", the Allied invasion of Sicily, would take place elsewhere, a successful British disinformation strategy?",
        "response": "Operation Mincemeat",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Arturo Uslar Pietri and Brian O'Nolan both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Herbert Achternbusch and Charles Barton both involved in film making?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephanie Lee has had a role in the SBS drama series that aired for how many episodes?",
        "response": "18",
        "source": "hotpot_qa"
    },
    {
        "query": "South African multi-instrumentalist of Cape Malay descent, Ricky Fataar, performed in a rock band known for their visual and aural pastiches and parody of what famous band?",
        "response": "the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "For what contribution did Simon van der Meer won the that is given by he Royal Swedish Academy of Sciences?",
        "response": "CERN",
        "source": "hotpot_qa"
    },
    {
        "query": "Robin Pingeton replaced Cindy Stein as head coach of which university women's basketball team? ",
        "response": "University of Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "State Route 445 connects a metropolitan area to a geographic sink of what basin?",
        "response": "Truckee River Basin",
        "source": "hotpot_qa"
    },
    {
        "query": "Donna Mills starred as Tobie Williams in a movie directed by who ?",
        "response": "Clint Eastwood",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Juliet\" is the sixth single by British pop rock band Lawson and was released via a record label established in what year?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "What date did the American global music corporation release the song which was the 2017 Eurovision Song Contest representative of Slovenia?",
        "response": "8 April 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which producer is known for his album Worlds Remixed and Worlds?",
        "response": "Porter Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Prime Minister of Australia when the Joint Communiqué with the People's Republic of China was signed?",
        "response": "Gough Whitlam",
        "source": "hotpot_qa"
    },
    {
        "query": "What American record producer, who worked on the album Fishscale, is really named Peter O. Philips?",
        "response": "Pete Rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Lake Valencia or  Lake Nyos in Cameroon?",
        "response": "Lake Nyos",
        "source": "hotpot_qa"
    },
    {
        "query": "Alan Bock wrote regular columns for which opinion site and news aggregator and fringe site?",
        "response": "WorldNetDaily",
        "source": "hotpot_qa"
    },
    {
        "query": "What film of the creator of \"Busters verden\" won an Academy Award?",
        "response": "Pelle the Conqueror",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kenji Mizoguchi and Metodi Andonov both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the person whom a cove in Antarctica cove is named for?",
        "response": "famous 1919 article \"The Arrangement of Electrons in Atoms and Molecules",
        "source": "hotpot_qa"
    },
    {
        "query": "News correspondent Bob Pisani presents for which international satellite and cable business channel?",
        "response": "CNBC",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation did William Friedkin and Wang Quan'an share?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who operates the Luxury hotel and casino that is situated on the west side of Las Vegas next to Caesars Palace?",
        "response": "MGM Resorts International",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did the future wife of Brian May take to Number Four in the UK singles chart ?",
        "response": "Anyone Can Fall in Love",
        "source": "hotpot_qa"
    },
    {
        "query": "South Korean actress Bae Doona, known for her role in 2000 television series \"Look Back in Anger\", had an English-speaking role in which 2012 film directed by the Wachowski siblings?",
        "response": "\"Cloud Atlas\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Resident Evil: Afterlife is a 2010 3D science fiction action horror film written and directed by Paul W. S. Anderson, it stars which British-American actor, model, and screenwriter.?",
        "response": "Wentworth Earl Miller III",
        "source": "hotpot_qa"
    },
    {
        "query": "Ishmael Bernal and Nicolas Cage, have which mutual occupations?",
        "response": "actor, director",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Tourniquet\" is a single by Marilyn Manson from an album released in what year?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "Chiemsee Cauldron is decorated in a way that is reminiscent of which cauldron thought to date between 200 BC - 300 AD?",
        "response": "Gundestrup cauldron",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the well-known American fur trader and politician during Minnesota's territorial era and the Civil War?",
        "response": "Joseph Rolette",
        "source": "hotpot_qa"
    },
    {
        "query": "California Gurls was produced in part by a Swedish record producer rose to prominence in the second half of the 1990, after making hits for the Backstreet Boys, Britney Spears, and who?",
        "response": "NSYNC",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Phalaris and Chamaelirium types of plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Helen Fielding and Allan Bloom philosophers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The largest United Methodist congregation in the United States is associated with which school of theology?",
        "response": "Saint Paul School of Theology",
        "source": "hotpot_qa"
    },
    {
        "query": "Dezadeash Lake is located in the territory that has what capital?",
        "response": "Whitehorse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Opera has more acts Les vêpres siciliennes and La scala di seta ?",
        "response": "Les vêpres siciliennes",
        "source": "hotpot_qa"
    },
    {
        "query": "Yin Jian, also known as Dongshan, was an early member of the Communist Party of China(CPC) is the founding and ruling political party of which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film came out later, Pocahontas or The Game Plan?",
        "response": "The Game Plan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer, Jesse James Dupree or Jack Russell, is primary songwriter in the rock band Jacky?",
        "response": "Jesse James Dupree",
        "source": "hotpot_qa"
    },
    {
        "query": "How many television series did the sitcom in which Liz Smith played the role of a character called \"Nana\" run for?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Franz Kafka and Wilfred Owen, wrote in German?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which digital media player that can stream to a capable television is produced by an American multinational technology company headquartered in Cupertino, California?",
        "response": "Apple TV",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building had more designers, 70 Pine Street or Wall Street Tower?",
        "response": "70 Pine Street",
        "source": "hotpot_qa"
    },
    {
        "query": "What are some examples of elite, highly academically competitive private liberal colleges other than the Little Ivies?",
        "response": "Similar groups include: Public Ivies, Southern Ivies,",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of UK's largest television and broadband internet services where the first two season of Losing Control can be watched?",
        "response": "Sky UK",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rego Park Jewish Center is in the city with a land area of what?",
        "response": "302.6 sqmi",
        "source": "hotpot_qa"
    },
    {
        "query": "Needed me and kiss it better were packaged together and released to radio on what date?",
        "response": "March 30, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Deputy Assistant Secretary in the United States Department of Commerce under President Barack Obama currently represents California;s 17th congressional district?",
        "response": "Ro Khanna",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Gene Rayburn?",
        "response": "American radio and television personality",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname given to Reshawn Davis's co-star on \"Rob & Big\"?",
        "response": "\"Big Black\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does The Good Dinosaur and The Three Lives of Thomasina have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American spy thriller TV series, which was developed by Howard Gordon and Alex Gansa, had a fourth season episode titled \"Krieg Nicht Lieb?\"",
        "response": "Homeland",
        "source": "hotpot_qa"
    },
    {
        "query": "Kacha, Sevastopol is a settlement that is part of a sovereign state bordered on the northwest by which country?",
        "response": "Belarus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American disaster thriller was last film directed by Tony Scott came out the year after The Taking of Pelham 123?",
        "response": "Unstoppable",
        "source": "hotpot_qa"
    },
    {
        "query": "The High and the Mighty is a 1953 novel by Ernest K. Gann based on a real-life trip that he flew as a commercial airline pilot for Matson Lines , and was adapted into the WarnerColor\" American \"disaster\" film, The High and the Mighty, released in which year?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Oedekerk collaborated with Jim Carrey in 2002, what year was Jim Carrey born?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Collin Klein's official team color in 2009?",
        "response": "Royal Purple",
        "source": "hotpot_qa"
    },
    {
        "query": "The TMMTX assembly lines currently produce the Tundra full-size pickup truck and which pickup truck manufactured in the U.S. by the Japanese automobile manufacturer Toyota since 1995?",
        "response": "Toyota Tacoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which President was escorted by the battleship whose pieces are now featured at the Glendale Veterans War Memorial?",
        "response": "Woodrow Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist wrote under the pen name Walter Ericson: Laura Esquivel or Howard Fast?",
        "response": "Howard Melvin Fast",
        "source": "hotpot_qa"
    },
    {
        "query": "Coco and Ratatouille were both films associated with what production studio?",
        "response": "Pixar",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Irish rock band whose bassist was Mike Hogan reunite?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "What was opened by a member of the Minnesota Timberwolves?",
        "response": "Crawford Court",
        "source": "hotpot_qa"
    },
    {
        "query": "The Little Iroquois River is a tributary of the Iroquois River (Saint John River), flowing in Notre Dame Mountains, are a portion of which mountain range, extending from the Gaspé Peninsula of Quebec to the Green Mountains of Vermont?",
        "response": "Appalachian Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiran Porter was a member of what American rock band from San Jose, California?",
        "response": "The Doobie Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "What district of Japan does Toyoko Tokiwa cover in his book about Yokohama after World War 2?",
        "response": "red-light district",
        "source": "hotpot_qa"
    },
    {
        "query": "What American film actress served as the First Lady of the United States from 1981 to 1989 starred in a 1957 black-and-white World War II submarine film drama from Columbia Pictures?",
        "response": "Nancy Davis Reagan",
        "source": "hotpot_qa"
    },
    {
        "query": "Luis Aguilar-Monsalve is a professor at a college in what state? ",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Tracy Reiner is known for her role in \"A League of Their Own\", which was a fictionalized account of which real-life sports league?",
        "response": "All-American Girls Professional Baseball League (AAGPBL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Jolt Cola and Diet Mountain Dew both sugar-free drinks, as advertised?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the bronze sculpture located that portrays America's first major prima ballerina, among others? ",
        "response": "Tulsa, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Felipe Boero became acquainted with the pieces of which Spanish composer while at the Paris Conservatory?",
        "response": "Manuel de Falla y Matheu",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Wilson, an American film actor, was born in Helena, Montana, in what county?",
        "response": "Lewis and Clark County",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the monument built by the Emperor Trajan in the style of the influential Nile-based civilization located?",
        "response": "Agilkia Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Egeria and Kunzea both native to south of the equator?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the university at which Doug Weaver served as the head football coach from 1960 to 1966 opened?",
        "response": "1863",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Stephen King novel did the name of the band Ad Sluijter contributed to come from? ",
        "response": "The Eyes of the Dragon",
        "source": "hotpot_qa"
    },
    {
        "query": "Ross Mcburney's High School was locally known as what?",
        "response": "East",
        "source": "hotpot_qa"
    },
    {
        "query": "What striker had his best 19 goal season in 2007-8?",
        "response": "Roque Santa Cruz",
        "source": "hotpot_qa"
    },
    {
        "query": "Make a Wish was a movie starrin Basil Rathbone, where was he born?",
        "response": "South African-born",
        "source": "hotpot_qa"
    },
    {
        "query": "The English language print of \"Sweden: Heaven and Hell\" was narrated by an actor best known for his starring role in what 1954 film?",
        "response": "\"The Egyptian\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Night Is Young is based on a story written by the author of what nationality?",
        "response": "Austrian",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American singer and producer born who's debut album is \"Santogold\" and also has appearance in Long Live ASAP album?",
        "response": "September 25, 1976",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was written by Silvio Horta and starred the actor who played Jordan Catalano?",
        "response": "Urban Legend",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the head teacher of the school where Wilmslow Show is held at?",
        "response": "Dr. James Pullé",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is located farther north, Wrexham Cathedral or Newport Cathedral?",
        "response": "Wrexham Cathedral",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the professional who is paid to write lyrics and melodies for songs who write the first full-length studio recording from American post-punk band The Soft Moon?",
        "response": "Luis Vasquez",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American film, television and theater actress born who was a star in the film the Matchmaker and also received the 40th AFI Life Achievement Award?",
        "response": "April 24, 1934",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the city founded where Berlitz Corporation was founded in 1878 by Maximilian Berlitz?",
        "response": "1636",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original title of the television series in which Don Stark played fictional Los Angeles Devils owner Oscar Kinkade?",
        "response": "Bounce",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song which was sampled in Letting Go? ",
        "response": "Mikkel S. Eriksen",
        "source": "hotpot_qa"
    },
    {
        "query": "What university did 5'9\" point guard Nate Robinson attend before signing with Aaron Goodwin, the sports agent that in 2004, was ranked eighth on \"Sports Illustrated\"'s list of the Most Influential Minorities in Sports?",
        "response": "University of Washington in Seattle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did the writer of Tim Burton's 2005 fantasy musical came out in 2003.",
        "response": "Big Fish",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a South Korean singer that was one of six members in a girls group named \"Apink\"? ",
        "response": "Son Na-eun",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1980 romantic drama directed by Jeannot Szarc was also known as Bid Time Return?",
        "response": "Somewhere in Time",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1959 American Western film in which the actor, who played Reverend Robert Alden in \"Little House on the Prairie\", plays a role?",
        "response": "Paul Landres",
        "source": "hotpot_qa"
    },
    {
        "query": "Rob Nilsson and Ted Demme, are in which mutual industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both directors David Wall and Lucile Hadžihalilović share the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the American singer which Jon Levine has written and produced songs for born ?",
        "response": "born August 30, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2013 British short film starring the actor who played Major Lance \"Corky\" Corkoran in the BBC series \"The Night Manager\"?",
        "response": "Mark Gill",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state was the composer, who wrote the music and lyrics to \"Around the World,\" born?",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the head coach whose team were first year members in a collegiate athletic conference whose member institutions are located within the Southern United States?",
        "response": "Michelle Clark-Heard",
        "source": "hotpot_qa"
    },
    {
        "query": "What country in the Maghreb region of North Africa has the First Statement Stadium?",
        "response": "Libya",
        "source": "hotpot_qa"
    },
    {
        "query": "Putting Pants on Philip was a short film starring the comedy duo famous during what American cinematic period?",
        "response": "Classical Hollywood era",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Deftones albums were released before their album released in 2000?",
        "response": "20",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the title character of Man vs. Wild from?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What number largest mall in Los Angeles County is the one where Born Lucky was taped?",
        "response": "fourth",
        "source": "hotpot_qa"
    },
    {
        "query": "Vol.4 Make Friends and Enemies was produced by Paul Leavitt who was a member of what American rock band from Towson, Maryland, a suburb of Baltimore, formed in 2003?",
        "response": "All Time Low",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person, Chuck Essegian or Haig Patigian, played in Major League Baseball (MLB) the Philadelphia Phillies, St. Louis Cardinals, Los Angeles Dodgers, Baltimore Orioles, Kansas City Athletics, and Cleveland Indians?",
        "response": "Charles Abraham \"Chuck\" Essegian",
        "source": "hotpot_qa"
    },
    {
        "query": "Arthur Laffer is best know for a curve that illustrates a theoretical relationship between what?",
        "response": "rates of taxation and the resulting levels of government revenue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2016 census population of the city which creates the eastern boarder where Armenians in Russia are found?",
        "response": "606,653",
        "source": "hotpot_qa"
    },
    {
        "query": "What Shakespeare's play had music composed by Felix Mendelssohn, featuring one of the most frequently used wedding marches, generally being played on a church pipe organ?",
        "response": "A Midsummer Night's Dream",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  American director, producer, and screenwriter born who co-founded Amblin Entertainment?",
        "response": "December 18, 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "In which battle did the Uncle of Henry Armstrong Reed and youngest brother of a US Army Lt Colonel and a two-time Medal of Honor Recipient get killed along with his brothers and his nephew? ",
        "response": "Battle of the Little Bighorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Rose Leclercq created the role of Lady Bracknell in a play that was first performed on February 14, 1895, at what London theater?",
        "response": "St James's Theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Dr. Giggles is a 1992 horror film starring a comedian known as Benny Stulwicz in what?",
        "response": "L.A. Law",
        "source": "hotpot_qa"
    },
    {
        "query": "Monica Rofriguez was appointed to the Los Angeles board by a mayor that is a member of which party ?",
        "response": "the Democratic Party",
        "source": "hotpot_qa"
    },
    {
        "query": "In what district is the Art Faculty located geographically?",
        "response": "Konkan division",
        "source": "hotpot_qa"
    },
    {
        "query": " North American Aviation created the prototype of the B-70 bomber, capable of traveling at what height?",
        "response": "70,000 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tony Hadley and Seo Eunkwang both radio presenters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What purpose do both the F-Shaped barrier and the Jersey barrier serve?",
        "response": "employed to separate lanes of traffic",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Fell in Love with a Girl\" is a song by the American garage rock band The White Stripes, written and produced by Jack White for the band's third studio album, \"White Blood Cells\", the third studio album, released on which date?",
        "response": "July 3, 2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Jessie the Yodeling Cowgirl from Toy Story 2 and 3 also appears in what 21-minute Halloween television special? ",
        "response": "Toy Story of Terror!",
        "source": "hotpot_qa"
    },
    {
        "query": "Bluebottle (formerly known as AOS and now as A2) is a modular, object-oriented Operating System with unconventional features, it has automatic and garbage collected memory management and provides soft real-time features and is developed at which science, technology, engineering and mathematics university in the city of Zürich, Switzerland?",
        "response": "ETH Zurich",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the male lead of If the Shoe Fits?",
        "response": "March 17, 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Which computer animated film was released first, Khan Kluay or A Christmas Carol starring Jim Carrey?",
        "response": "Khan Kluay",
        "source": "hotpot_qa"
    },
    {
        "query": "The head of the New Hampshire Department of Justice was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Considered the strongest recorded tropical cyclone, which cyclone had a film made about it in 2007?",
        "response": "1999 Odisha cyclone",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Bougainvillea\" was co-written by what actor that also played the role of James \"Sonny\" Crockett?",
        "response": "Donald Wayne Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two magazines, Card Player and Ranger Rick, which offers feature articles and activities for children, ages 7 and up?",
        "response": "Ranger Rick",
        "source": "hotpot_qa"
    },
    {
        "query": " Since 2017 Nick Ayers has been Chief of Staff to a man that served as governor of what state?",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American professional is a wrestler and actor signed to WWE?",
        "response": "Luke Harper",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this music genre that originated in the mid 1960s when African American musicians created a rhytmic, danceable new form of music though a mix of soul, jazz, and R&B, the genre of the band Gotcha!?",
        "response": "Funk",
        "source": "hotpot_qa"
    },
    {
        "query": "What company is John P. McConell CEO of and is based in Columbus, Ohio?",
        "response": "Worthington Industries",
        "source": "hotpot_qa"
    },
    {
        "query": " Portland Winterhawks alumni list includes a Danish professional ice hockey right winger born 15 March 1986 currently playing for what NHL Team?",
        "response": "San Jose Sharks",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand name devised by Lexicon Branding turned out to be an 85 million dollar project?",
        "response": "Metreon",
        "source": "hotpot_qa"
    },
    {
        "query": "What great  boxer formerly known as Cassius Clay along with American former professional boxer and commentator trained at Gleason's Gym?",
        "response": "Muhammad Ali",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Candy\" is the debut single of an singer that starred with Diane Keaton in a 2007 romantic comedy directed by who?",
        "response": "Michael Lehmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Franz Burri, was a supporter of Nazi Germany from an early age and frequently visited the country during the 1930s, his hopes for a career in the SS were dashed when Reinhard Heydrich deemed him unsuitable, Heydrich was a high-ranking German Nazi official during World War II, and a main architect of which event?",
        "response": "Holocaust",
        "source": "hotpot_qa"
    },
    {
        "query": "In which university stadium the Golden Gophers played their home games?",
        "response": "University of Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Clarence House has been the official residence of the heir apparent of who?",
        "response": "Queen Elizabeth II",
        "source": "hotpot_qa"
    },
    {
        "query": "The Marlowe Memorial is in memory of a playwright from what era?",
        "response": "Elizabethan",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Canadian rock band Moist form before Natalie Merchant joined the 10,000 Maniacs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Goodbye Christopher Robin was written by which Guardian Prize winner?",
        "response": "Frank Cottrell-Boyce",
        "source": "hotpot_qa"
    },
    {
        "query": "Minouche Barelli participated in what contest in Vienna, Austria?",
        "response": "Eurovision Song Contest 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "What field of study did Boris Galerkin and Jakow Trachtenberg both work in?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Frank Powell or André Berthomieu more involved in all aspects of the making of films?",
        "response": "Frank E. Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Kerry Downes or John Vanbrugh?",
        "response": "John Vanbrugh",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes does Kim-ji-soo show Memory have?",
        "response": "16 episodes",
        "source": "hotpot_qa"
    },
    {
        "query": "are Hongjiang and Tongren both city's withing China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which two men directed the film adaptation of an American actor, comedian, director, and drama teacher's life?",
        "response": "Frank L. Anderson and Barry Poltermann",
        "source": "hotpot_qa"
    },
    {
        "query": "What classic western song is the theme to the Range Busters series?",
        "response": "Home on the Range",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Simon Neil or Michael McKean?",
        "response": "Michael John McKean",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the eighteenth season of the American animated sitcom which \"The Cissy\" is the third episode in ",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "John Choon Yoo (born July 10, 1967) is a Korean-American attorney, law professor, and author, his best known for his opinions concerning the Geneva Conventions that attempted to legitimize the War on Terror by the United States,  is a metaphor of war referring to the international military campaign that was launched by the U.S. government after the September 11 attacks in the U.S. in what year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "The discovery of the supercurrent in SNS contacts is sometimes mistakenly attributed to what Welsh theoretical physicist and professor emeritus of physics at the University of Cambridge?",
        "response": "Brian Josephson",
        "source": "hotpot_qa"
    },
    {
        "query": "What game published by Riot Games does Kim Hee-chul play?",
        "response": "League of Legends",
        "source": "hotpot_qa"
    },
    {
        "query": "Eureka Seven and Pokémon: Arceus and the Jewel of Life, are  of which nationality?",
        "response": "Japanese",
        "source": "hotpot_qa"
    },
    {
        "query": "Marcia Gardner is an Australian screenwriter who has worked on such shows as which Australian television series that premiered on ABC TV on 1 February 2013 at 8:30 pm, and the series stars Craig McLachlan in the lead role of Doctor Lucien Blake?",
        "response": "The Doctor Blake Mysteries",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was Joseph Druces victim working in?",
        "response": "Boston",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted the 29th Genie Awards and the game show Celebrity Poker Showdown?",
        "response": "Dave Foley",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Denmark lose control of Frederiknagore?",
        "response": "until 1845, when their alliance with a defeated France led to the colony being ceded to the British East Indian company.",
        "source": "hotpot_qa"
    },
    {
        "query": "Fenbendazole is ineffective against which parasite that is also called the flea tapeworm?",
        "response": "Dipylidium caninum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Genus has more species Darmera or Roystonea ?",
        "response": "Roystonea",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film produced by the wife of Nick Hornby, starring Saoirse Ronan, Emory Cohen, Domhnall Gleeson, Jim Broadbent, and Julie Walters released?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What town did Robert D. Manning teach in?",
        "response": "Henrietta",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the band formed who recorded the song, In the Street, for their 1972 album ?",
        "response": "Memphis, Tennessee,",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Peter Yates and Marcus Nispel from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mathematician, who was among many who proposed the SYZ conjecture, won the Fields medal in 1982?",
        "response": "Shing-Tung Yau",
        "source": "hotpot_qa"
    },
    {
        "query": " Austin Abayomi Koledoye, is a Nigerian professional basketball coach, he's coached Cambodia's national basketball team, which he led to its best performance ever at which 2015 event that occured in Kallang, Singapore?",
        "response": "2015 Southeast Asian Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the lead singer of the band formed in 1981 that toured with Mark Watrous?",
        "response": "Vince Neil",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Got to Be Real\" has been called one of the defining moments of a type of music that was popular with who?",
        "response": "both men and women",
        "source": "hotpot_qa"
    },
    {
        "query": "Cake Man Raven was said to \"turn Dixieland dessert red velvet cake into a Brooklyn thing.\" by a news paper that was founded in which year ?",
        "response": "1919",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Xinyang or Zhuanghe have a bigger population as of the 2010 census?",
        "response": "Xinyang",
        "source": "hotpot_qa"
    },
    {
        "query": "The Simon Property Group manages what mall in a town known for witch trials in 1692?",
        "response": "Liberty Tree Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "VA-873 was an attack squadron of the U.S. Navy Reserve based at a station located on what bay?",
        "response": "San Francisco Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  Canadian-born New Zealand actress who was a cast in \"X2\" born?",
        "response": "24 July 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Weekend Express stars which anchor/correspondent for HLN?",
        "response": "Lynn Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "What number largest bank is the sponsor of the World Rugby Sevens Series?",
        "response": "seventh",
        "source": "hotpot_qa"
    },
    {
        "query": "Henry Hun was a professor of Nervous Diseases at  a medical school founded by who ?",
        "response": "Alden March and James H. Armsby",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Smile\" from 1st Round was composed by an actor of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Phillip Pullman's book set in a parallel universe featuring a character named Lyra Belacqua was put into audio in what year?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "The Brood was a stable that was composed of Gangrel, Christian, and an actor and retired professional wrestler, who is a member of the WWE Hall of Fame, and whose nationality is what?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which publication has been published by a greater number of groups, House Beautiful or Smithsonian?",
        "response": "House Beautiful",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the actress who plays Brittany in \"Sexy\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Oeceoclades perrieri is an orchid that is native to the country bordered by what to the east?",
        "response": "Indian Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in the film in which Hugh Keays-Byrne played \"Toecutter\"?",
        "response": "Mel Gibson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the actor in the British crime drama, Mind Games, and in the \"Harry Potter\" films.",
        "response": "Fiona Shaw",
        "source": "hotpot_qa"
    },
    {
        "query": "Why was \"Looking For Alaska\", the debut novel of John Micheal Green (born in 1977), challenged in 2015?",
        "response": "profanity and sexually explicit",
        "source": "hotpot_qa"
    },
    {
        "query": "\"A Song of Ice and Fire\" is an ongoing series of epic fantasy novels by American novelist and screenwriter George R. R. Martin, the first installment of the series, \"A Game of Thrones\", which was originally planned as a trilogy, was published in which year?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "George Howard, 4th Earl of Suffolk, was the son of which English nobleman and politician?",
        "response": "Theophilus Howard, 2nd Earl of Suffolk",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Tony, Emmy, and Academy Award-winning actor appears in the 1968 movie Isadora?",
        "response": "Jason Robards",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Vignoles has accompanied singer Sylvia McNair, what redister does she sing in?",
        "response": "soprano",
        "source": "hotpot_qa"
    },
    {
        "query": "George Hires represented the state that ranks what in regards to population figures?",
        "response": "11th-most populous",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the album first issued whose outtakes provided the first four tracks on the album The Unissued Johnny Cash",
        "response": "November 3, 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was filmed in Canada and starred an English actor and dancer?",
        "response": "Edge of Winter",
        "source": "hotpot_qa"
    },
    {
        "query": "What fictional Supervillain that is one of the world's first mutants caused damaged that North America needed to recover from in Age of Apocalypse",
        "response": "Apocalypse",
        "source": "hotpot_qa"
    },
    {
        "query": "Have singers David Gilmour and Adam Duritz both been members of a band?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mexican Indignados Movement is a response to a war also known as?",
        "response": "Mexican War on Drugs",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Justin Vincent the MVP of a collegiate championship game?",
        "response": "January 4, 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Worcester Polytechnic Institute in Massachusetts and Princess Sumaya University for Technology in Jordan both technology colleges?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Gagiano won Best Actor Award as Alf Bueller in a show written by who?",
        "response": "Neil Gooding",
        "source": "hotpot_qa"
    },
    {
        "query": "What other product does Weston Bakeries sell, in addition to their bread?",
        "response": "Twinkie",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the director of the film \"Losin' It\" die?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Affenpinscher and Finnish Hound are both what?",
        "response": "breed of dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ingredient of Taro cake is known by its Cantonese name 'lap ceung'?",
        "response": "Chinese sausage",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director, Cheick Oumar Sissoko or Michel Boisrond, also held a career in politics?",
        "response": "Cheick Oumar Sissoko",
        "source": "hotpot_qa"
    },
    {
        "query": "What English rock band's song was sampled for \"Be in a Fix?\"",
        "response": "Led Zeppelin",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the airline alliance founded whose one of the member among 20 member carriers is Korean Air?",
        "response": "June 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Vincent Clarkson is a fictional character from the soap Opera Passions, that aired on what American direct broadcast satellite service provider that is a subsidiary of AT&T?",
        "response": "DirecTV",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the writer for which Joseph Maher took a role of their character died on 9 August 1967?",
        "response": "Joe Orton",
        "source": "hotpot_qa"
    },
    {
        "query": "To whom was the self-designated group advises to in which Cheryl D. Mills was considered a member?",
        "response": "Hillary Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Monoral or Alt-J?",
        "response": "Alt-J",
        "source": "hotpot_qa"
    },
    {
        "query": " The 1971 Masters Tournament was the 35th Masters Tournament, held April 8–11 at Augusta National Golf Club, located in Augusta, in which US state?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "Ceasair and Omnia are examples of what type of music?",
        "response": "neoceltic pagan folk",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress portrays Jenna Hamilton on the MTV teen comedy series \"Awkward\"?",
        "response": "Ashley Nicole Rickards",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, Ideamen or The Sugarcubes, is still playing together?",
        "response": "Ideamen",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1988 American Band from California did Black Steel support in 2006?",
        "response": "Black Label Society",
        "source": "hotpot_qa"
    },
    {
        "query": "License to Drive featured what future president of the Screen Actors Guild?",
        "response": "Richard Masur",
        "source": "hotpot_qa"
    },
    {
        "query": "Neal Dodson was the producer of what movie directed by J. C. Chandor?",
        "response": "All Is Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Alabama Joe\" mocked which race of people?",
        "response": "African American",
        "source": "hotpot_qa"
    },
    {
        "query": "Heatstroke stars an actress who has written how many non-fiction books?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2014 film that cast the professional surfer who lost part of her arm in a 2003 shark attack?",
        "response": "Charles Martin Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "What film grossed nearly $700 million worldwide and has a plot that follows an FBI agent and an Interpol detective who track a team of illusionists who pull off bank heists during their performances and reward their audiences with the money?",
        "response": "Now You See Me",
        "source": "hotpot_qa"
    },
    {
        "query": "What ABC television series did the actor, who played the notorious criminal John Dillinger in \"Young Dillinger,\" star in?",
        "response": "his starring role in the ABC television series \"The Rebel\" (1959).",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Sissy Spacek play Carrie White, the main protagonist in Stephen King's novel \"\"Carrie\"?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Graham Central Station was a live music venue in Phoenix, Arizona,that played host, to which American singer-songwriter, musician, and pianist?",
        "response": "Jerry Lee Lewis",
        "source": "hotpot_qa"
    },
    {
        "query": "Song for Someone is from what 2014 U2 studio album?",
        "response": "Songs of Innocence",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person who contributed to the classic story of the same name by Hans Christian Andersen is an American musical theatre and film score composer and pianist?",
        "response": "Alan Irwin Menken",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did Selina Giles play in the 2005 dystopian political thriller named \"V for Vendetta\"?",
        "response": "Evey's mother",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did the actor who received the Laurence Olivier Award for Best Actor, the Drama Desk Award for Outstanding Actor in a Play, the Outer Critics Circle Award for Best Featured Actor and the Tony Award for Best Performance by a Leading Actor in a Play, all for his role in \"The History Boys\", play in \"The Naked Gun 2½: The Smell of Fear\"",
        "response": "Dr. Albert S. Meinheimer",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was Dorothy Bridges's grandson born?",
        "response": "November 13, 1973",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nick name given to a fighter pilot with the German Air Force during World War I and whose distant relative is Bolko von Richthofen, a German archaeologist?",
        "response": "Red Baron",
        "source": "hotpot_qa"
    },
    {
        "query": "What product is being built at a 107,000 acre industrial park for Tesla Motors?",
        "response": "lithium-ion battery",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Charles Sorley or Pearl S. Buck?",
        "response": "Pearl Sydenstricker Buck",
        "source": "hotpot_qa"
    },
    {
        "query": "Krysten Alyce Ritter, is an American actress and former model, she has appeared in films such as which 2008 American comedy film directed by Tom Vaughan, written by Dana Fox and starring Cameron Diaz and Ashton Kutcher?",
        "response": "What Happens in Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the American television series created by Dan Fogelman which follows the family lives and connections of several people who all share the same birthday, and whose cast includes Mandy Moore, Justin Hartley and Chris Sullivan?",
        "response": "This Is Us",
        "source": "hotpot_qa"
    }
]