[
    {
        "query": "Paul Haggis and John G. Avildsen have both won what award?",
        "response": "Academy Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the lowest road in Great Britain, that crosses through the village and civil parish in the Fens of England?",
        "response": "A1101 road",
        "source": "hotpot_qa"
    },
    {
        "query": "Faye Elaine Marsay is an English actress who had a notible role in a series directed by who?",
        "response": "James Hawes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mastophora dizzydeani is a species of spider named after baseball player Jerome Herman Dean who goes by what nickname?",
        "response": "Dizzy Dean",
        "source": "hotpot_qa"
    },
    {
        "query": "Father's Little Dividend is a comedy film directed by an American stage director who was born in what year?",
        "response": "1903",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Aurelia Browder or Claudette Colvin?",
        "response": "Aurelia Shines Browder Coleman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film and soundtrack was based on the musical about the life of First Lady of Agentina, Eva Peron?",
        "response": "Evita",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chief Product Officer of the company who acquired FreeCharge for $400 million also works for which social media application?",
        "response": "Facebook Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the home games played by the team coached by Scott Marr?",
        "response": "John Fallon Field",
        "source": "hotpot_qa"
    },
    {
        "query": "What castle in the general vicinity of Bellman's Head was built by the Burnett family?",
        "response": "Muchalls Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the manufacturer who manufactures the brand formerly known as the Old Oscar Pepper Distillery based?",
        "response": "Louisville, Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheetah and Toy Story, have which organization in common?",
        "response": "Walt Disney Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Security Square Mall, Perry Hall and the North American School of Trades are all parts of which east-coast U.S. city?",
        "response": "Baltimore",
        "source": "hotpot_qa"
    },
    {
        "query": "Chinua Achebe and Walter Van Tilburg Clark are both what?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both the Foals and Escanaba Firing Line formed in 2002?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What product targets elementary school aged boys and has a Japanese manga created by Takafumi Adachi?",
        "response": "CoroCoro Comic",
        "source": "hotpot_qa"
    },
    {
        "query": "Of all the teams John Nyskohus played for, which team was known as \"the Black and Whites?\"",
        "response": "Adelaide City",
        "source": "hotpot_qa"
    },
    {
        "query": "The Timbarra Gold Mine was a gold mine located in the New England region at the intersection of New England and what?",
        "response": "Bruxner Highway's",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the brewery that is located in the home of Neuhaus produce?",
        "response": "lambics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was older at the time of Benny Lynch's career ending fight, Aurel Toma or Benny Lynch? ",
        "response": "Aurel Toma",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Faith\" by Stevie Wonder is the lead single from a sountrack for a 2016 film directed by who?",
        "response": "Garth Jennings",
        "source": "hotpot_qa"
    },
    {
        "query": "Why is Leon Trotsky associated with permanent revolution?",
        "response": "He would go on to become one of the seven members of the first Politburo, founded in 1917 to manage the Bolshevik Revolution.",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the Johnson house built? ",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Benjamin Pulleyn was the Cambridge tutor of an English mathematician, astronomer, and physicist, whose book,Mathematical Principles of Natural Philosophy, was first published in what year? ",
        "response": "1687",
        "source": "hotpot_qa"
    },
    {
        "query": "WMCW is a radio station that carried an Adult Contemporary format with a man who retired when? ",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Tietê Bus Terminal and this terminal are the largest, and the other terminal opened in what year?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has released more albums, Unwritten Law or PVRIS?",
        "response": "Unwritten Law",
        "source": "hotpot_qa"
    },
    {
        "query": "Erling Lorentzen is the widower of a princess born in which year ?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert \"Bob\" Schrijber, is a Dutch former mixed martial artist and kickboxer, his most famous student at the moment is which UFC fighter, a Dutch mixed martial artist who competes as a heavyweight in the UFC?",
        "response": "Stefan Struve",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author would be older today Miriam Toews or W. G. Sebald?",
        "response": "W. G. Sebald",
        "source": "hotpot_qa"
    },
    {
        "query": "Tintin and I and Cancer, are films of which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the father of the man the Norwegian Storting elected king of Norway on 4 November 1814?",
        "response": "King Adolf Frederick",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2015 what was the value of the sales of the company founded by John H McConnell ?",
        "response": "$3.38 billion.",
        "source": "hotpot_qa"
    },
    {
        "query": "What former professional Australian rules footballer who played for the Adelaide Football Club in the Australian Football League (AFL), replaced coach Neil Craig after round 18 of their 21st season?",
        "response": "Mark Bickley",
        "source": "hotpot_qa"
    },
    {
        "query": "Arena Bowl XII included what team coached by current head coach of the Washington Redskins?",
        "response": "Orlando Predators",
        "source": "hotpot_qa"
    },
    {
        "query": "Capitan Mountains Wilderness was the birthplace of which forest fire prevention ad created by Albert Staehle?",
        "response": "Smokey Bear",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American popular music and country music singer recorded J. D. Souther song ",
        "response": "Linda Maria Ronstadt",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Chien Français Blanc et Orange and Cretan Hound both used for hunting in packs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine has more issues each month, In These Times or Multinational Monitor?",
        "response": "Multinational Monitor",
        "source": "hotpot_qa"
    },
    {
        "query": "In what area were the Leičiai native to during 1219 and 1295?",
        "response": "Lietuva Land",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both Graziano Delrio and Matteo Renzi?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Tuxedo, New York is a town that includes the system of limited access highways named for which Governor?",
        "response": "Thomas E. Dewey",
        "source": "hotpot_qa"
    },
    {
        "query": "What passenger trade route is serviced by Edmonds and runs parallel to the Cascade mountain range?",
        "response": "The Amtrak \"Cascades\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Norwegian professional footballer who plays as an attacking midfielder and who broke the record for the youngest player that has ever played in the Norwegian top league?",
        "response": "17 December 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does 2013 East Carolina Pirates football team and Ruffin McNeill have in common?",
        "response": "coach",
        "source": "hotpot_qa"
    },
    {
        "query": "How many schools are in the league that the Penn Quakers compete in?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor or actress starred in the British musical \"Pieces of Eight\", and was one of the main ensemble in 26 of the 31 \"Carry On\" films?",
        "response": "Kenneth Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third album from the band who released \"Songs for a Tailor\" as their debut album?",
        "response": "Wheels of Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a longer middle name, Isabel Colegate or Peter Benchley?",
        "response": "Peter Bradford Benchley",
        "source": "hotpot_qa"
    },
    {
        "query": "Ace Drummond was scripted by an American fighter ace in World War I who received what medal?",
        "response": "Medal of Honor",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seat of the county that includes the villae of East Nassau, New York?",
        "response": "Troy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the baboon in a show on which Rumen Petkov recently worked as writer, storyboard artist, animation director and director on some episodes?",
        "response": "I.R. Baboon",
        "source": "hotpot_qa"
    },
    {
        "query": "Lacey Sturm was a co-founder of which Christian pop band founded in 2002?",
        "response": "Flyleaf",
        "source": "hotpot_qa"
    },
    {
        "query": "The title character's actor in Joe Dirt 2: Beautiful Loser was also a cast member of which 1990s show?",
        "response": "\"Saturday Night Live\"",
        "source": "hotpot_qa"
    },
    {
        "query": "National Sports Stadium is a multi-purpose stadium in Ulaanbaatar, Mongolia, The Naadam festival, which celebrates Mongolian independence, is held there every when? ",
        "response": "July",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Pomegranates and Nicolas Jaar related?",
        "response": "album",
        "source": "hotpot_qa"
    },
    {
        "query": "Which submachine gun built by Societe Luxembourgeoise SA in Luxembourg between 1954 and 1957 was capable of using magazines developed in Nazi Germany?",
        "response": "The Sola",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Farrar advocated for victim in the agency that has headquarters in what Maine city?",
        "response": "Augusta",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Clayton Goose Freeman played for an American football team that is based in Cleveland, Ohio, and competes in what division of the AFC?",
        "response": "North division",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie starring Jung Jin-young was adapted from the 2000 state play \"Yi?\"",
        "response": "King and the Clown",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical band composed Chicken Fried and Whatever It Is? ",
        "response": "Zac Brown Band",
        "source": "hotpot_qa"
    },
    {
        "query": "Just Friends? is a short film starring an actor who gained recognition with his leading role in what 2014 film?",
        "response": "Marriage, Not Dating",
        "source": "hotpot_qa"
    },
    {
        "query": "The Working Girls, released in which year, is a exploitation film written and directed by Stephanie Rothman and starring Cassandra Peterson,an American actress best known for her portrayal of the horror hostess character Elvira, Mistress of the Dark?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who wrote dialogues and lyrics for the Telugu version for Sampoorna Ramayanam received the Sahitya Akademi Award in what year? ",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film starring a South Korean singer-songwriter, actor and music producer born in June 1982 released?",
        "response": "15 August 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Who else besides Prince Carl of Denmark did Gustav Borngen take portraits of?",
        "response": "Henrik Ibsen and Bjørnstjerne Bjørnson, and numerous cabinet ministers, members of parliament, writers and artists, and members of upper bourgeois families.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more members, Dada or Alt-J?",
        "response": "Alt-J",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of \"Green Hell\"?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Spanish football coach born in 1973 was announced as the new Everton manager in 2013?",
        "response": "Roberto Martínez",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American pornographic actress born in 1958 that, along with two other actresses, was among the first African-American women to \"cross over\" into mainstream porn video?",
        "response": "Jeannie Pepper",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the stars of the 2008 South Korean movie that was later remade as Hindi movie entitled \"Murder 2\" in 2011?",
        "response": "Kim Yoon-seok and Ha Jung-woo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who s an American engineer and politician who has been the United States Representative for Kentucky's 4th congressional district that defeated the 63rd District, representative of Kenton County?",
        "response": "Thomas Harold Massie",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Landslide an Ouija board games?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1984 American action comedy film starring Eddie Murphy as Axel Foley, a street-smart Detroit cop who visits originally a Spanish ranch where lima beans were grown?",
        "response": "Martin Brest",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the period instrument ensemble that was formed in the 1950s by the conductor with whom Elisabeth Kulman recorded Beethoven's \"Missa solemnis\"?",
        "response": "Concentus Musicus Wien",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the winner of the 2007 Masters of Formula 3?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Abigail Kinoiki Kekaulike Kawānanakoa, born on which date, sometimes called Kekau, is a member of the House of Kawānanakoa, and is referred to by many as a princess, a common honorary bestowed to descendants of titled subjects of the Kingdom of Hawaii or important figures in the history of Hawaii? ",
        "response": "April 23, 1926",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous pawn shop do Richard Kevin Harrison and Core Harrison own?",
        "response": "World Famous Gold & Silver Pawn Shop",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Argentine sports club for which José San Román played based? ",
        "response": "Rosario, Santa Fe",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Darwin located?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress was featured in Dreamer, and was nominated for a Screen Actors Guild Award at age eight?",
        "response": "Dakota Fanning",
        "source": "hotpot_qa"
    },
    {
        "query": "What former male model from Cameroon won the title on a reality show that included Ross Matthews and Carson Kressley as judges?",
        "response": "BeBe Zahara Benet",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the chemist who founded Mond gas born?",
        "response": "1839",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Soviet and Russian composer born who was a veteran composer?",
        "response": "12 December 1925",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the composer who wrote the music for Euryanthe born? ",
        "response": "31 January 179719",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this English professional footballer, who played with Chris Jones during his spell with the Yorkshire outfit?",
        "response": "4 January 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "A house in Milan, Ohio, now a National Historic Landmark, is the birthplace of which inventor?",
        "response": "Thomas Edison",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the founders of the magazine published by Time Inc that was created in 1978?",
        "response": "Ariane and Michael Batterberry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Film is newer,  Follow Me, Boys! or Remember the Titans ?",
        "response": "Remember the Titans is a 2000 American sports film",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Grand Slam titles did the winner of the 1980 Avon Championships of Houston win ? ",
        "response": "39",
        "source": "hotpot_qa"
    },
    {
        "query": "What car model was made by the thirteenth-largest car manufacturer and introduced in 1972?",
        "response": "Mercedes-Benz S-Class",
        "source": "hotpot_qa"
    },
    {
        "query": "Morrisson Kaye also spelled as Morrisson K, formerly known as Morrisson, is an American singer, songwriter, producer and musician from the San Francisco Bay Area, his earliest official releases were underground tracks of which subgenre of house music, and originated in the 1980s, initially fusing elements of Chicago house with 1980s jazz-funk and touches of soul music?",
        "response": "Deep house",
        "source": "hotpot_qa"
    },
    {
        "query": "Winter Soldier and Soldier Girls are both what type of film?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Hairy Jeremy was a television show created in a style that, when it uses plasticine, is called what?",
        "response": "clay animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the family that Nikhil Nanda belong is a prominent Indian show business family with a long history in Hindi cinema?",
        "response": "Kapoor family",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a genus of about 15–20 species of annual and perennial herbaceous plants in the daisy family Asteraceae, Collomia or Calendula ?",
        "response": "Calendula",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cat in the Hat was a comedy film directed by which production designer and director?",
        "response": "Robert W. \"Bo\" Welch III",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Lovely Rita\" is a song on what album from a famous English rock band?",
        "response": "Sgt. Pepper's Lonely Hearts Club Band",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the former South Korean boy band leader who left the band in 2010, whose current main rapper was born in 1988?",
        "response": "Jay Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Doñana National Park in Andalusia, southern Spain or Garajonay National Park in La Gomera, Canary Islands in Spain larger?",
        "response": "Doñana National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the character that Mel Blanc was the voice for?",
        "response": "Leon Schlesinger Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2009 romantic comedy-drama anthology did Cloris Leachman appear in?",
        "response": "New York, I Love You",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor portrayed the main professional boxer who appeared in the seven movie series, including \"Creed\" and \"Rocky Balboa\"?",
        "response": "Sylvester Stallone",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Apple Sr. VP of Software Engineering that introduced Face ID, a facial recognition system for iPhone X, at the Steve Jobs Theater on September 12, 2017?",
        "response": "Craig Federighi",
        "source": "hotpot_qa"
    },
    {
        "query": "Iruttinte Athmavu, is a Malayalam film, released in which year, and was directed by P. Bhaskaran, and features music by M. S. Baburaj, was a Malayalam music composer?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "How many acts are in the Santo Richard Loquasto based on a work by Miguel de Cervantes?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did a Canadian politician born January 2, 1979, succeed as leader of the New Democratic Party in Canada? ",
        "response": "October 1st",
        "source": "hotpot_qa"
    },
    {
        "query": "Rungra People's Pleasure Ground was opened with a ceremony including which First Lady of North Korea?",
        "response": "Ri Sol-ju",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Children's National Medical Center or MedStar Washington Hospital Center the largest private hospital in Washington, D.C.?",
        "response": "MedStar Washington Hospital Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Before 2012, who were the Baylor Bears sports rival?",
        "response": "Texas A&M Aggies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author is French, Andre Dubus III or Monique Wittig?",
        "response": "Monique Wittig",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the musicians Dan Andriano and Ian Hunter from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie containing the phrase inspiring the name of The Dismemberment Plan?",
        "response": "Harold Ramis",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year wast the historic Alabama district that is home to the federally owned corporation pushed by the efforts of Senator George W. Norris founded?",
        "response": "1818",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a cast member on Saturday night live, the late show and the tonight show?",
        "response": "Jimmy Fallon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cacti has more species, Cereus or Limnanthes?",
        "response": "Cereus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following films presents a survey of the history of the comic book in America: Beyond Hatred or Comic Book Confidential?",
        "response": "Comic Book Confidential",
        "source": "hotpot_qa"
    },
    {
        "query": "For the court cases Curtis Publishing Co. v. Butts and Katzenbach v. Morgan, which established First Amendment protections, and which allowed Congress law enactment?",
        "response": "Curtis Publishing Co. v. Butts, 388 U.S. 130 (1967), was a case in which the Supreme Court of the United States established the standard of First Amendment protection",
        "source": "hotpot_qa"
    },
    {
        "query": "Raymond Carver and Margaret Wilson, both are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Edward L. Cahn and Saeed Rizvi film directors ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actors that starred in \"Ghosts of Girlfriends Past\" was born on April 17, 1972?",
        "response": "Jennifer Garner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played Madame Pince in the film Harry Potter and the Chamber of Secrets?",
        "response": "Sally Mortemore",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Jack Arnold or P. J. Castellaneta?",
        "response": "Jack Arnold",
        "source": "hotpot_qa"
    },
    {
        "query": "Team Brunel finished second in the 2014–15 Volvo Ocean Race, skippered by Bouwe Bekking, and will also sail in the 2017–18 Volvo Ocean Race, the 13th edition of the round-the-world Volvo Ocean Race, it will start in Alicante, in which country?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "The biblical chronology sometimes associated with young earth creationism places the creation of the world at which year?",
        "response": "4004 BC",
        "source": "hotpot_qa"
    },
    {
        "query": "What position in MLB did the first winner of the Pacific Coast League Manager of the Year Award play?",
        "response": "shortstop",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shopping mall is owned by GGP and located in the second largest shopping district in Massachusetts?",
        "response": "Natick Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "FC Bayern Munich beat Eintracht Frankfurt in the 2005-06 season thanks to a goal from someone that plays for what national team?",
        "response": "Peru",
        "source": "hotpot_qa"
    },
    {
        "query": "What do both Norwegian Lundehund and Kerry Blue Terrier have in coman",
        "response": "dog breed",
        "source": "hotpot_qa"
    },
    {
        "query": "What County does Route 97 continue to after going through Essex County?",
        "response": "Rockingham County",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress in the Charitraheen 1974 Bollywood drama film has also received two National Film Awards and two Filmfare Awards?",
        "response": "Sharmila Tagore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Californian freestyle motocross racer is featured on SRH Presents: Supporting Radical Habits?",
        "response": "Jeremy Lusk",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the percentage of people in britain who speaks what Upper class characters were presented in ",
        "response": "3%",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Inside Out and Hercules made by Walt Disney Pictures?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 18th-century frontier fort at the current site of Cumberland, Maryland, USA was an important military and economic center during the war, 1756-63, that pitted the colonies of British America against those of New FranceFrance?",
        "response": "Fort Cumberland",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of the 2004 book How to Talk to a Liberal (If You Must) was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2008 Houston Cougars football team, also known as the Houston Cougars, Houston, or UH, represented the University of Houston in the 2008 NCAA Division I FBS football season, the team was coached by which first-year American head football coach, and former player who is the head coach at Texas A&M University?",
        "response": "Kevin Sumlin",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Battle of Tara, the Norse Vikings were led by the King of which area of Ireland?",
        "response": "Northumbria and Dublin",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the film debut of the actress who stars in Bad Girls alongside Madeleine Stowe, Mary Stuart Masterson, and Drew Barrymore?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which National Park is bigger Tablas de Daimiel National Park or Guadarrama National Park ?",
        "response": "Guadarrama National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, C. S. Forester or Lionel Trilling?",
        "response": "Cecil Louis Troughton Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was created first, Murderball or Year at Danger?",
        "response": "Murderball",
        "source": "hotpot_qa"
    },
    {
        "query": " USS Elrod was named after the Captain who enlisted in what part of the armed forces in 1927?",
        "response": "Marine Corps",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Contrast and Xbox One have in common?",
        "response": "video game",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American subsidiary of the French production company that Germaine Dulac spent the last decade of her life working on newsreels for?",
        "response": "Gaumont International Television",
        "source": "hotpot_qa"
    },
    {
        "query": "At the time of her appointment to the Senate of Canada, Marie-Françoise Mégie was a professor at a university that offers how many doctoral programs?",
        "response": "71",
        "source": "hotpot_qa"
    },
    {
        "query": "The 329th Combat Crew Training Squadronwas inactivated at a base located how far from Sacramento, California ?",
        "response": "115 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the ruler of an ancient city located Northwest of the junction of the Euphrates and Tigris and had several statues found in southern Mesopotamia?",
        "response": "Gudea ruled",
        "source": "hotpot_qa"
    },
    {
        "query": "Millet is a French-based company, specializing in outdoor equipment such as backpacks and sleeping bags, owned by which organization, their earning comparisons to United States-based companies such as Columbia Sportswear and Timberland LLC, an American manufacturer and retailer of outdoors wear, with a focus on footwear?",
        "response": "Lafuma",
        "source": "hotpot_qa"
    },
    {
        "query": "In which part of Tennessee was this unrecognized and autonomous territory co-founded by Samuel Wear located?",
        "response": "eastern Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Delmer Daves and Whit Stillman both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Martin Miller, born Rudolph Muller, was a Czech-Austrian character actor who played many small roles in British films and television series from the early 1940s until his death, on stage he was noted in particular for his parodies of Mr. Paravinci in which murder mystery play by Agatha Christie, and opened in London's West End in 1952, and has been running continuously since then?",
        "response": "The Mousetrap",
        "source": "hotpot_qa"
    },
    {
        "query": "James Leal Greenleaf worked on a monument located where? ",
        "response": "National Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "What ocean are both Hampton Beach, New Hampshire and the Hampton Beach Casino Ballroom by?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "Skagboys is a 2012 novel by Scottish writer Irvine Welsh, it is a prequel to his 2002 sequel, which novel published in 2002 by Scottish writer Irvine Welsh, and is the sequel to \"Trainspotting\"?",
        "response": "Porno",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian model and actress appeared in the movie Fever as well as the action thriller \"Game\" (2011)?",
        "response": "Gauhar Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "Syrian statesman, politician, and general who was President of Syria from 1971 to 2000, died before the Syrian presidential election, held on what date?",
        "response": "10 July 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the company situated which developed the game tetris ultimate?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Emprise Bank has branches in a city situated along what river?",
        "response": "Neosho River",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Sidney Sheldon or Stan Lee hold more job titles?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Waldsteinia and Obregonia contain the same number of species?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "EuroBasket 2001 had an MVP of the basketball player of what nationality?",
        "response": "Serbian",
        "source": "hotpot_qa"
    },
    {
        "query": "SechsKies, was a six-member South Korean boy band, in what year, one of its members includes Eun Ji-won, a South Korean rapper, host, dancer, composer and leader of the first generation idol group SechsKies?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitetop Mountain is the second-tallest mountain in Virginia behind which peak, near Troutdale?",
        "response": "Mount Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "New Jersey politicians Linda Stender and Leonard Lance were born within a year of each other beginning in which year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Antifaschistisches Infoblatt cooperates with similar publications in other countries including one founded in 1975 by who?",
        "response": "Gerry Gable",
        "source": "hotpot_qa"
    },
    {
        "query": "Which science fiction trilogy has in the lead role an actress who had a voice role in the 3D film Peter Rabbit?",
        "response": "Star Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "What day did the founder of ESL Music, who was also an American heir and hotelier, die?",
        "response": "December 10, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Rita Drávucz, is a female water polo player from Hungary, who competed for her native country at the 2004 Summer Olympics in Athens, Greece, the 2008 Summer Olympics, officially known as the Games of the XXIX Olympiad () and commonly known as Beijing 2008, was a major international multi-sport event that took place in Beijing, China, from which time span?",
        "response": "7 to 24 August 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the occupation of both Nagisa Oshima and Roy Ward Baker?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The High Deeds of Finn MacCool is a story that is closer to the type that typically has origins in which tradition?",
        "response": "European tradition",
        "source": "hotpot_qa"
    },
    {
        "query": "Which child of a woman whose television career includes a presenting role on ITV1's \"Loose Women\" came sixth in the nineteenth series of Channel 5 reality show \"Celebrity Big Brother\".",
        "response": "Bianca Gascoigne",
        "source": "hotpot_qa"
    },
    {
        "query": "Collateral starred the American actor who won a BAFTA Award for which 2004 biographical film?",
        "response": "Ray",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Muppet Treasure Island or Million Dollar Arm ?",
        "response": "Muppet Treasure Island",
        "source": "hotpot_qa"
    },
    {
        "query": "What club is currently managed by the retired 2011-12 front of the Valencia Club de Futbol?",
        "response": "French club Paris Saint-Germain FC",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the woman enslaved by Thoams Jefferson who is the suject of the James Ivory film Jefferson in Pairs?",
        "response": "Sally Hemings",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Dacrydium or Tecophilaea?",
        "response": "Dacrydium",
        "source": "hotpot_qa"
    },
    {
        "query": "How many cadets nationwide are enrolled in the Army Reserve Officers' Training Corps, which one brigade is based out of Great Lakes Naval Training Center in Illinois?",
        "response": "20,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian bandleader/orchestrator/composer/conductor created \"A Look at Monaco\" soundtrack?",
        "response": "Percy Faith",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Beth Taylor was the host of Hey Hey It's Saturday on a TV network of which nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "BMW X5 is a mid-size version that was produced alongside which newer model, produced in 2009?",
        "response": "BMW X6",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal was in operation most recently, the Chesapeake and Ohio Canal or the Blackstone Canal?",
        "response": "Chesapeake and Ohio Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Scott Speedman and Michael Corvin related?",
        "response": "Underworld",
        "source": "hotpot_qa"
    },
    {
        "query": "Who managed the team that placed the first during the Pittsburgh Pirates season in the 1940s when the Pirates placed the fourth?",
        "response": "Leo Durocher",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is one of the stores inside Concord Mall based?",
        "response": "Oklahoma City, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Tim Nichols won a Grammy Award for Best Country Song in 2004 was on which Tim McGraw album?",
        "response": "Live Like You Were Dying",
        "source": "hotpot_qa"
    },
    {
        "query": "Which college did American football punter Brian Moorman attend?",
        "response": "Pittsburg State University",
        "source": "hotpot_qa"
    },
    {
        "query": "David Wurmser served as special assistant at the State Department to a diplomat that was appointed  U.S. ambassador to the United Nations by what president?",
        "response": "George W. Bush",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Indian American conservative political commentator, author and filmmaker born who's documentary film is America: Imagine the World Without Her? ",
        "response": "April 25, 1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What starring role did the actor and singer play in a 2015 musical based on a 2004 biography of Alexander Hamilton?",
        "response": "Aaron Burr",
        "source": "hotpot_qa"
    },
    {
        "query": "What Heisman winner did not have success at the professional level and is now a business owner in Oklahoma?",
        "response": "Jason White",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Soviet Union dictator did secret police officer Stainslav Redens work for?",
        "response": "Joseph Stalin",
        "source": "hotpot_qa"
    },
    {
        "query": "M.I.L.F. $ was a song from the album released on what date?",
        "response": "September 22, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is this American stepdancer, choreographer, and actress that created the Irish dance show \"Dancing on Dangerous Ground?\"",
        "response": "Jean Butler",
        "source": "hotpot_qa"
    },
    {
        "query": "What English actor starred in the Stephen Poliakoff play Shout Across the River in London in 1978?",
        "response": "David Threlfall",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Ivan Perestiani and Patricio Guzmán both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was the Bourne and Sleaford Railway and Midland and Great Northern Joint Railway located?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cooper is a comic opera, in two acts, by which English composer?",
        "response": "Thomas Augustine Arne",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the music group that performed \"Whiskey on My Breath\"?",
        "response": "Stephen Barker Liles, Eric Gunderson, and Brian Bandas",
        "source": "hotpot_qa"
    },
    {
        "query": "Pēteris Dzelzītis fought for the Latvian partisans during which armed struggle against Soviet rule that spanned for 1944 until the mid-1950s?",
        "response": "Guerrilla war in the Baltic states",
        "source": "hotpot_qa"
    },
    {
        "query": "Terrell Lamont Strayhorn is best known for his successful collaborations with a composer born in which year ?",
        "response": "1899",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Dolan v. City of Tigard and Gravel v. United States heard in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the four-year coeducational federal service academy located in Orange County and which was attended by Robert Emlen Boyers, a United States Army officer and American football player and coach who served as head coach there?",
        "response": "United States Military Academy",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of ore was mined at both Thompson-Lundmark Mine and Leckie Mine?",
        "response": "gold",
        "source": "hotpot_qa"
    },
    {
        "query": "Three weeks before the 62nd Academy Awards, the ceremony for the Academy Awards for Technical Achievement were held, and hosted by what actress who won a golden globe for her work on the television show Alice?",
        "response": "Diane Ladd",
        "source": "hotpot_qa"
    },
    {
        "query": "Among many eminent country music artists who started in honky-tonks, which played in the band the Strangers?",
        "response": "Merle Haggard",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the head basketball coach at Ohio State University a coach in 2015-2016",
        "response": "Butler University",
        "source": "hotpot_qa"
    },
    {
        "query": "The first Capcom Pro Tour was co-sponsored by a live streaming video platform owned by a subsidary of who?",
        "response": "Amazon.com",
        "source": "hotpot_qa"
    },
    {
        "query": "Dead-cakes are often eaten at a gathering held before what event?",
        "response": "funeral",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the Broadway theater that was founded by the man Anita Sarko worked for in 1985?",
        "response": "Gallo Opera House",
        "source": "hotpot_qa"
    },
    {
        "query": "Fred Durst and Ricky Ross, share which mutual industry occupation?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this French-Italian multinational electronics and semiconductor manufacturer headquartered in Geneva, Switzerland, and part of a joint venture with Ericsson called ST-Ericsson?",
        "response": "STMicroelectronics",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of the lead member of the group that released Tragic Serenades?",
        "response": "Tom G. Warrior",
        "source": "hotpot_qa"
    },
    {
        "query": "Rodelinda and La vida breve, are which type of drama?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "What club did the agent of the player highest number of appearances in the Premier League?",
        "response": "Shoreham",
        "source": "hotpot_qa"
    },
    {
        "query": "The Basej-e Milli (National Movement) alternatively called Afghanistan Green Trend (Rawand-e Sabz-e Afghanistan) is a political party in Afghanistan created by former Afghan intelligence chief, Amrullah Saleh, a politician in Afghanistan who served as head of the National Directorate of Security from 2004 until his resignation in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Sako Shahinian and Arshile Gorky, are of which mutual nationality?",
        "response": "American-Armenian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chamber of Commerce of the State of New York attracted the attention of a businessman born on July 17th who died in what year?",
        "response": "1848",
        "source": "hotpot_qa"
    },
    {
        "query": "What WikiLeaks using whistleblower is notable for having a hacking organization with a user base of over 1,800,000?",
        "response": "Jeremy Hammond",
        "source": "hotpot_qa"
    },
    {
        "query": "Westfield Culver City is owned by what Australian shopping centre company that existed from 1960 to 2014",
        "response": "Westfield Group",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1945-born actor starred in Tulips?",
        "response": "Gabe Kaplan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Reunions magazine and Autograph Collector Magazine both US publications ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport did Robert Lindstedt and Alex O'Brien play?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the person who shot 16 people during a disaster in 1987 in the United Kingdom?",
        "response": "Michael Robert Ryan",
        "source": "hotpot_qa"
    },
    {
        "query": "Like many Twins teams of its half-decade, the 1998 Minnesota Twins neither impressed nor contended, individual players had solid seasons, and which Hall of Fame designated hitter, nicknamed \"Molly\" and \"The Ignitor\", is an American former Major League Baseball (MLB) player and current manager of the Minnesota Twins, how many All-Star Game appearances did he have?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of profession does Jonah Meyerson and Alison Pill have in common?",
        "response": "actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older Harold Bloom or Wally Lamb ?",
        "response": "Harold Bloom",
        "source": "hotpot_qa"
    },
    {
        "query": "The University of Richmond and Middlebury College are both private universities in what state?",
        "response": "Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"Under the Silver Lake\" made his debut in what film?",
        "response": "Lions for Lambs",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does Computer Conservation Society and Museum of Science and Industry have in common?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the cost of a building completed in March 2008 and designed by Daniel Libeskind in a city that had a population of 40,640 at the time of the 2010 U.S. census?",
        "response": "$50 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Woo-bin is a South Korean model and actor who made his breakthrough in part with what South Korean television series that also starred Lee Min-ho and Park Shin-hye?",
        "response": "The Heirs",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Borodin was part of a group of composers from what nationality?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "Kern Island Canal and Bald Eagle and Spring Creek Navigation are both relelated to canals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the cities of Dashiqiao and Xinghua, Jiangsu in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "American action thriller film London Has Fallen stars this American film and television actor born in 1963 from which state?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the city where the Mount Moriah Cemetery is located?",
        "response": "1,270",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the woman for whom Hart State Park is named?",
        "response": "Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "Schalke's top scorer is which Dutch professional footballer born on August 12, 1983?",
        "response": "Klaas-Jan Huntelaar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio developed the game in which Jarlath Conroy voiced the character Aiden O'Malley?",
        "response": "Rockstar North",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress who frequently collaborates with Lars von Trier starred in the film Jacky in the Kingdom of Women?",
        "response": "Charlotte Gainsbourg",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show with an episode called \"How to Eat with Your Butt\"?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Up and Scooby-Doo! and the Samurai Sword, have which genre in common?",
        "response": "comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What state other than North Carolina did John H. Sykes attend college?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team in the National Hockey League's Pacific Division plays at the T-Mobile Arena?",
        "response": "Vegas Golden Knights",
        "source": "hotpot_qa"
    },
    {
        "query": "The luteinizing hormone/choriogonadotropin receptor (LHCGR), also lutropin/choriogonadotropin receptor (LCGR) or luteinizing hormone receptor (LHR) is a transmembrane receptor found predominantly in the ovary and testis, but also many extragonadal organs such as the uterus and breasts, the receptor interacts with both luteinizing hormone (LH) and chorionic gonadotropins, such as hCG in humans, hCG is a hormone produced by the placenta after implantation, the acronym stand for?",
        "response": "Human chorionic gonadotropin",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent were both The Ring and Shonen Jump published in?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "Cain-Sloan Co. was a department store that could be found in what Goodlettsville, Tennessee mall?",
        "response": "Rivergate Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Samuel C. Morrison, Jr. (born April 19, 1982) is a Liberian-born producer, screenwriter and journalist, his professional writing career began as a contributing writer for The Source Magazine, interviewing celebrities including which American football running back for the New Orleans Saints of the National Football League (NFL)?",
        "response": "Adrian Lewis Peterson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Thomas Friedman or English author David Lodge?",
        "response": "David John Lodge CBE",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Bozic fought and lost to a professional boxer with what nickname?",
        "response": "Easton Assassin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current Speaker of the House of the state legislature which Rida T.R. Cabanilla Arakawa is a member of?",
        "response": "Scott Saiki",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the worlds largest cricket stadium where John Wayne Hasting played?",
        "response": "Melbourne Cricket Ground",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American found footage disaster film which starred Alycia Debnam-Carey?",
        "response": "Steven Quale",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the historic romantic novel No Good Duke Goes Unpunished win in 2014?",
        "response": "RITA Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the composer of the soundtrack of \"Krishnaveni Panjaalai\"?",
        "response": "Indian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which recording artist or band has appeared on more television shows and films, Tyson Ritter or Hot Hot Heat?",
        "response": "Tyson Jay Ritter",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fiery Furnaces and Paul Westerberg, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the college preparatory private school where the author of the novel featuring symbologist Robert Langdon and cryptologist Sophie Neveu located?",
        "response": "Beverly Hills, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of city of Joy was born on 18 September 1950 ?",
        "response": "Shabana Azmi",
        "source": "hotpot_qa"
    },
    {
        "query": "What is shared by the official U.S. state song \"The Song of Iowa\" and the German Christmas song \"O Tannenbaum\"?",
        "response": "tune",
        "source": "hotpot_qa"
    },
    {
        "query": "How many top-40 hits did the singer of \"Don't Forbid Me\" have?",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "Thin and Cancer, have which genre in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Who established the University where Cecil Leonard played college football?",
        "response": "Booker T. Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Who lived on the second floor of what is now a museum and a former residence ofakberte winehouse, who's wife was the second woman to finish a full program of study at the Department of Mathematics and Physics ?",
        "response": "Albert Einstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members, The Cinematics or The Rubens?",
        "response": "The Rubens",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both University of Cape Town and University of Patras in the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of the music for the film \"Andaru Dongale Dorikite\" won a Filmfare Award for his work on what film?",
        "response": "\"Satyam\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the question of the debate that led Bill Nye's 2014 book?",
        "response": "Is Creation A Viable Model of Origins?",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Schuylkill Canal and Allegheny Portage Railroad both railways?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrea Ojeda represents Argentina at international and Olympic level at football, and plays for which famous Buenos Aires club?",
        "response": "Boca Juniors",
        "source": "hotpot_qa"
    },
    {
        "query": "Longton Bridge was a railway station on the West Lancashire Railway in England, it served the village of Longton, and civil parish in the west of the borough of South Ribble, Lancashire, in which country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Which solo band did the writer of the song \"For No One\" found with his first wife?",
        "response": "Wings",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Tennessee Williams or Walter Mosley?",
        "response": "Thomas Lanier \"Tennessee\" Williams III",
        "source": "hotpot_qa"
    },
    {
        "query": "What ingredient can be found in both a Bee's Knees and Between the Sheets cocktail?",
        "response": "lemon juice",
        "source": "hotpot_qa"
    },
    {
        "query": "The Prodigy who sampled \"Funky Man\" in a song \"Smack My Bitch Up\" belongs to which nationality? ",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "What hit song, sung by Rihanna was featured on her fifth studio album \"Loud\" and reached number one on the US Billboard Hot 100?",
        "response": "\"What's My Name?\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What party did the author of \"The Great Illusion\" belong to?",
        "response": "Labour Party",
        "source": "hotpot_qa"
    },
    {
        "query": "WRAF airs a religious program hosted by which founder and president of In Touch Ministries?",
        "response": "Charles Stanley",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Marc Rosset and Max Mirnyi both been professional tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Deinanthe and Sparaxis endemic to the Asian regions?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these Egyptians was a real person, Nefermaat or Bastet?",
        "response": "Nefermaat",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rennae Stubbs and Carly Gullickson both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of actress Lee Jong-suk who starred in the Doctor Stranger television series?",
        "response": "South Korean",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 1971 American musical fantasy film directed by Mel Stuart, an adaptation of a 1964 novel whose music was sampled in a 2007 album by Caspa and Rusko called FabricLive.37?",
        "response": "Willy Wonka & the Chocolate Factory",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did Wilco's contributor to \"Down in a Mirror: A Second Tribute to Jandek\" grow up in?",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "USS South America was used to block ports and waterways on states commonly referred to as what?",
        "response": "the Confederacy",
        "source": "hotpot_qa"
    },
    {
        "query": "Pandikona and Alpine Mastiff are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "What do the song \"What Would I Do If I Could Feel\" and Nipsey Russell have in common?",
        "response": "The Wiz",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of car is Sir Tow Mater's best friend in the movie \"Cars\"?",
        "response": "an anthropomorphic stock car",
        "source": "hotpot_qa"
    },
    {
        "query": "The Machine in the Garden: Technology and the Pastoral Ideal in America, is a 1964 work of literary criticism written by Leo Marx and published by Oxford University Press, trope notably appears in Henry David Thoreau's \"Walden\" (1854) when the whistling sound of a steam locomotive disrupts the natural landscape of which lake in Concord, Massachusetts in the which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did Kwak Do-won play a role in and sold 11,375,954 tickets?",
        "response": "The Attorney",
        "source": "hotpot_qa"
    },
    {
        "query": " Rainbow Studios was acquired by the company that was founded in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "What state developed and published Samna Software?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of \"Sal de Mi Piel\" was naturalized in what country?",
        "response": "Mexican",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the acronym of the country's navy that was responsible for discovering Cape Sobral?",
        "response": "ARA",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Pearl Jam's studio album preceding Riot Act released?",
        "response": "May 16, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: What is the nickname of the athlete featured on the cover of the video game \"MLB 14: The Show\"",
        "response": "Miggy",
        "source": "hotpot_qa"
    },
    {
        "query": "Carrie Pilby stars which Irish actor and musician?",
        "response": "Colin Arthur O'Donoghue",
        "source": "hotpot_qa"
    },
    {
        "query": "What university is Linda Lappe the head coach of?",
        "response": "University of Colorado Boulder",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucien Lucius Nunn, was an American entrepreneur and educator who founded which organization,  a small liberal arts two-year college in Deep Springs, California, United States?",
        "response": "Deep Springs Men's College",
        "source": "hotpot_qa"
    },
    {
        "query": "The Halfway House starred the retired stage actress who was born in what city and country?",
        "response": "Pretoria, South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": " Eva Gonda de Rivera owns a major stake in a beverage company hedaquartered in what city?",
        "response": "Monterrey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band released an album first, Evanescence or Arcane Roots?",
        "response": "Evanescence",
        "source": "hotpot_qa"
    },
    {
        "query": "Units in the City is the debut and only studio album by which American hip hop recording artist, an American rapper from Atlanta, Georgia, known professionally as who?",
        "response": "Shawty Lo",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick Galbraith and Ilie Năstase are famous for playing what sport?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Foley is a character on SNL played by which loud, energetic actor and comedian?",
        "response": "Christopher Crosby Farley",
        "source": "hotpot_qa"
    },
    {
        "query": "Jackson Ramsay, is a professional Australian rules football player at the Collingwood Football Club in the Australian Football League (AFL), after the match he was mentioned as one of the outstanding younger players of the team by the coach,  Nathan Charles Buckley, is a former professional Australian rules football player, commentator and coach, best known for his time as captain of the Collingwood Football Club, in which organization?",
        "response": "Australian Football League (AFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Wayne A. Cauthen graduated from what college that is also a member-school of the Thurgood Marshall College Fund?",
        "response": "Central State University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the sovereign state in which Brendan Christian was born?",
        "response": "St. John's",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the animated cartoon inspired by the artist who worked on Star Wars, Battlestar Galactica, ET, and Cocoon?",
        "response": "Lucasfilm Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who known for the many characters she originated on CBS's \"The Carol Burnett Show\", produced and arranged albums with an American record producer, arranger, songwriter, multi-instrumentalist, and vocalist who has made music for commercials of international brands ?",
        "response": "Victoria Ann \"Vicki\" Lawrence",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the home of the appointed Chief Justice during the case that involved Maryland attempting to impede operation of a branch of the Second Bank of the United States?",
        "response": "Richmond, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of molluscs did the returning restaurants serve after Schultz Preserve was restored in 1995?",
        "response": "salt-water bivalve",
        "source": "hotpot_qa"
    },
    {
        "query": "Shira Piven directed the 2014 film \"Welcome to Me\" whose starring actress is also known for her work on which NBC sketch comedy series?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "The stew most similar to stobhach is served over what type of bread?",
        "response": "cornbread or corn muffins",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1983 American-Canadian comedy film starring the actor who started his career at age 19 in the film \"Endless Love\"?",
        "response": "Curtis Hanson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which comic strip created by Robert Crump featured the drawing of Manuel Perez?",
        "response": "Fritz the Cat",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was written by the first juvenile incarcerated for cybercrime in the United States?",
        "response": "Insha'Allah",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary Anthony Williams voices the character Uncle Ruckus on an animated sitcom that appears on what network?",
        "response": "Adult Swim",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper released the album Big Fish Theory featuring a number of styles of music including Detroit techno?",
        "response": "Vince Staples",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Sonya in \"Uncle Vanya\" has won how many Golden Globe Awards?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress starred in both of the films \"Unforgettable\" and \"Men in Black II\"?",
        "response": "Rosario Dawson",
        "source": "hotpot_qa"
    },
    {
        "query": "What years would Lyman James Briggs have been the director of the National Bureau of Standards, if he was a  a director of the National Bureau of Standards during the Great Depression?",
        "response": "mostly during the 1930s",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the former Member of Parliament whose son was elected as Secretary of State at the Department for Transport?",
        "response": "John Gummer",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the Member who introduced the Marriage Act 1994 (c. 34)?",
        "response": "8 March 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is dedicated more to the environment, Wallace Stegner or Miguel Delibes?",
        "response": "Wallace Earle Stegner",
        "source": "hotpot_qa"
    },
    {
        "query": "Julia Lezhneva studied with the People's Artist of the USSR, who was of what range?",
        "response": "mezzo-soprano",
        "source": "hotpot_qa"
    },
    {
        "query": "Cassius M. \"Cash\" Hollister (December 7, 1845 – October 18, 1884) was a 19th-century American law enforcement officer and deputy U.S. marshal who served as mayor and sheriff of which city in Kansas, during his career, he worked with several well-known lawmen including Henry Newton Brown (1857 – April 30, 1884) was an American Old West gunman who played the roles of both lawman and outlaw during his life?",
        "response": "Caldwell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Almost Sunrise or 4 ?",
        "response": "4",
        "source": "hotpot_qa"
    },
    {
        "query": "Professor Layton and the Eternal Diva and Eureka Seven, both are of which genre?",
        "response": "anime",
        "source": "hotpot_qa"
    },
    {
        "query": "Jon Kortajarena has modeled for the fashion designer who launched his luxury brand in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the band whose second album was \"Origin of Symmetry\" formed?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joe Manganiello and Adam G. Sevani both American actors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Kenneth \"Chi\" McBride currently plays in a main role in an American action police procedural television series that premiered in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the singer born in 1958 who sang backup vocals on the track \"Who's Right, Who's Wrong\"?",
        "response": "Michael Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city and state did Keith Goganious serve as Assistant Head Coach for a university football team?",
        "response": "Hampton, Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "John F. Haught testified at the Supreme Court case that was the first direct challenge to the school policy requiring the teaching of what concept?",
        "response": "intelligent design",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hoch Conservatory had the teacher on-staff who was the first to publicly perform any work by which composer?",
        "response": "Brahms",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football hall of fame was the head coach of the 1968 Minnesota Vikings elected to first?",
        "response": "the Canadian Football Hall of Fame",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the first Christmas album of this singer and songwriter, released in 1994, that includes bell chimes and heavy back up vocals, as well as synthesizers?",
        "response": "Merry Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "The Logan & Southern Subdivision is a railroad line owned by CSX Transportation in the U.S. State of West Virginia, it's a state located in which region of the Southern United States?",
        "response": "Appalachian",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of Povratak Katarine Kožul was convicted of committing war crimes during what war?",
        "response": "Croat-Bosniak War",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animated TV series, originally shown in 1985, has been revived this decade in a new action series and Nintendo DS game?",
        "response": "ThunderCats",
        "source": "hotpot_qa"
    },
    {
        "query": "The Succession to the Danish throne restricts the throne to who?",
        "response": "Alexandrine of Mecklenburg-Schwerin",
        "source": "hotpot_qa"
    },
    {
        "query": "Mahatma Gandhi led India to independence through nonviolent civil disobedience which was sometimes referred to as what?",
        "response": "obstructive program",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Daryl Palumbo and Jack Russell are part of what industry?",
        "response": "American rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the is the fourth studio album by Mexican pop-singer married to Governor of Chiapas, Manuel Velasco Coello?",
        "response": "Baby Blue",
        "source": "hotpot_qa"
    },
    {
        "query": "A former mayor of Malverne, Francis T. Purcell later became a political commentator for what New York cable channel?",
        "response": "News 12 Long Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Dunstan is an electoral district that includes which suburb of Adelaide in the City of Norwood Payneham St Peters?",
        "response": "College Park",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did the cricketer who took a hat-trick of wickets in the 2015 Royal London One-Day Cup Final make his first class debut ?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "What suburb of Salisbury has a population of 98,861 people?",
        "response": "City of Tea Tree Gully",
        "source": "hotpot_qa"
    },
    {
        "query": "While The Church was a psychedelic rock band formed in Sydney in 1980, The New Radicals were what type of music?",
        "response": "American alternative rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "The Thoen Stone is on display at a museum in what county?",
        "response": "Lawrence County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Freddie Mercury Tribute Concert was the final full-length concert for the musician of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie features a song from Beaucoup Fish's fifth album and stars Arnold Schwarzenegger?",
        "response": "Batman & Robin",
        "source": "hotpot_qa"
    },
    {
        "query": " Rangers also made moves to acquire an American-born Mexican professional baseball infielder born in what year?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Lisa Howard had a role in the comedy that had music and lyrics by whom?",
        "response": "William Finn",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Roland Joffé and José Bohr have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What river does Beaver and Erie Canal and Louisville and Portland Canal have in common?",
        "response": "Ohio River",
        "source": "hotpot_qa"
    },
    {
        "query": "What does KO Magazine and Analog Science Fiction and Fact have in common?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which awards did the author of Heartfire win in 1985 ?",
        "response": "Hugo and Nebula Awards,",
        "source": "hotpot_qa"
    },
    {
        "query": "What Slovakian palace served as the location for the signing of a truce agreement between Napoleon and Holy Roman Emperor Francis II?",
        "response": "Primate's Palace",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band included more previously-known figures when it was formed, !!! or Puddle of Mudd?",
        "response": "!!!",
        "source": "hotpot_qa"
    },
    {
        "query": "Lusty Juventus is an example of an Entr'acte, more commonly known in French today as what? ",
        "response": "intermission",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Onyx and Game For Fame follow the same genre?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What 4x100 metres relay sprinter won a bronze at the British Commonwealth Games in Edinburgh, Scotland? ",
        "response": "Brian Green",
        "source": "hotpot_qa"
    },
    {
        "query": "How many species of Hawaiian hibiscus do not have white flowers?",
        "response": "250",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the series where Brian Tyree Henry guest starred as William's cousin?",
        "response": "Dan Fogelman",
        "source": "hotpot_qa"
    },
    {
        "query": "The non-fiction book \"Finding Chandra\" is about an affair between the victim and a congressman that holds a B.B.A from what school?",
        "response": "USC Marshall School of Business",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the ruling for both Hernandez v. Texas and Berman v. Parker unanimous?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What rocket was the world's first long-range guided ballistic missile, and upon which the fictional spaceship Orbit Jet in the 1954 TV series \"Rocky Jones, Space Ranger\" was based on ?",
        "response": "V-2 rocket",
        "source": "hotpot_qa"
    },
    {
        "query": "What United States military base adjacent to Honolulu, Hawaii is host two of United States Pacific Command subordinate Service components?",
        "response": "Joint Base Pearl Harbor–Hickam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company, Honeywell or Multitech, created the Micro-Professor MPF-I, which was the world's longest selling computer and later became Acer?",
        "response": "The Micro-Professor MPF-I, introduced in 1981 by Multitech (which, in 1987, changed its name to Acer), was the first branded computer product from Multitech and probably one of the world's longest selling computers.",
        "source": "hotpot_qa"
    },
    {
        "query": "Saturday Night Live's 40th season premiered with which American actor as the first host?",
        "response": "Christopher Michael Pratt",
        "source": "hotpot_qa"
    },
    {
        "query": "The Song, Your Mirror, is featured on Stars an, album by Simply Red that was released in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the genera Gordonia and Osbeckia in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephanie Daley — retitled What She Knew for US television — is a 2006 film starring Amber Tamblyn, Melissa Leo, Timothy Hutton, and Tilda Swinton,  won the Academy Award for Best Supporting Actress and the BAFTA Award for what in a Supporting Role for her performance as Karen Crowder in the 2007 film \"Michael Clayton?",
        "response": "Best Actress",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the leader of the Network Italy faction within Popular Alternative?",
        "response": "Roberto Formigoni",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another film by the actress who was in the 1990 crime drama adaptation of Macbeth? ",
        "response": "The Four Seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "is  The Family Handyman or  American Heritage a magazine about home improvement?",
        "response": "The Family Handyman",
        "source": "hotpot_qa"
    },
    {
        "query": "Blueberry, is a French acid western, released in what year, directed by Jan Kounen, the film starred Vincent Cassel as the title character along with Michael Søren Madsen, an American actor, producer, director, writer, poet and photographer?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pete Loeffler and Chris Robinson both singers in American rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Paul Davies Work that was established on August 16, 1960",
        "response": "International Academy of Astronautics",
        "source": "hotpot_qa"
    },
    {
        "query": "The Whitianga Festival of Speed (Whitianga FOS) was a motorsport festival held in the seaside town of Whitianga on the Coromandel Peninsula in New Zealand in 2009 and 2010, the festival hosted a multitude of events including which type of rotorcraft in which lift and thrust are supplied by rotors? ",
        "response": "helicopter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the other decathletes that Dan & Dave was meant to generate excitement and support for other than the decathlete native of Montana?",
        "response": "Dan O'Brien",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is English, David Yates or Gregory Hoblit?",
        "response": "David Yates",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Duke basketball player was All-ACC and plays for the Atlanta Hawks?",
        "response": "Quinn Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink is native to the Spanish region of Seville, The Clover Club Cocktail or the Agua de Sevilla?",
        "response": "Agua de Sevilla",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress born in Larne, County Antrim in 1917 appeared in a 1934 film adaptation of Badger's Green?",
        "response": "Valerie Hobson",
        "source": "hotpot_qa"
    },
    {
        "query": "Teinosuke Kinugasa, was a Japanese actor and film director, in 1954 he won at which Festival, for \"Jigokumon\" (\"The Gate of Hell\"), named until 2002 as the International Film Festival?",
        "response": "Cannes Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "The B46 bus route in Brooklyn, New York City, United States, runs to what shopping center opened in September of 1970?",
        "response": "Kings Plaza",
        "source": "hotpot_qa"
    },
    {
        "query": "George Le Brunn wrote \"Oh! Mr Porter\" which included repertoires of what english music hall singer affectionately called \"Queen of the Music Hall\"?",
        "response": "Marie Lloyd",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Dunn's Famous Deli and Steakhouse serve is a raw meat is brined, partially dried, seasoned with herbs and spices, then smoked and steamed?",
        "response": "Pastrami",
        "source": "hotpot_qa"
    },
    {
        "query": "On which channel did a television series air in 2015 that starred the main vocalist of the South Korean girl group Apink?",
        "response": "KBS2",
        "source": "hotpot_qa"
    },
    {
        "query": "Simple Kid and Eugenius, are in which similar industry?",
        "response": "musical",
        "source": "hotpot_qa"
    },
    {
        "query": "Kiki Preston was the alleged mother of a child born out of wedlock with a prince born in which year ?",
        "response": "1902",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this historic castle in Aberdeenshire where Marc Ellington resides built?",
        "response": "1593",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the religion of Mountain Wolf Woman originate?",
        "response": "U.S. State of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which charecter did Burt Kwouk in the 1993 film Son of the Pink Panther?",
        "response": "Cato",
        "source": "hotpot_qa"
    },
    {
        "query": "From where is the artist who made the album containing the single \"Sippy Cup\"?",
        "response": "Astoria, Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of Italian Gaetano Donizetti or Czech Bedřich Smetana, which opera composer lived and worked earlier?",
        "response": "Domenico Gaetano Maria Donizetti",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cinefantastique and Utne Reader both magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Sylva Kelegian and Lisa Rose Apramian, have which nationality?",
        "response": "Armenian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the music director for Garrett Borns born?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band composed \"Yellow Ledbetter\" and \"Jeremy\"?",
        "response": "Pearl Jam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character does Karin Konoval play in the 2014 movie Dawn of the Planet of the Apes? ",
        "response": "Maurice the Orangutan",
        "source": "hotpot_qa"
    },
    {
        "query": "How many studio albums has the band that played A Warrior's Call released?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "Rediscovered is the fifth studio album by English-Norwegian pop group A1, the album was released on which date in Norway, two singles have thus far been released from the album: \"Just Three Words\", featuring singer Annie Khalid?",
        "response": "2 November 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish band's name is a play on a hit song by Dire Straits?",
        "response": "The Sultans of Ping FC",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following women was the first woman promoted to Master Chief Petty Officer in the US Navy: Anna Der-Vartanian or Eve Beglarian?",
        "response": "Anna Der-Vartanian",
        "source": "hotpot_qa"
    },
    {
        "query": "Shelley Hennig starred in the 2014 American supernatural horror film directed by whom?",
        "response": "Stiles White",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Cale Gundy's brother play football in college?",
        "response": "Oklahoma State University",
        "source": "hotpot_qa"
    },
    {
        "query": " \"The Last Time\" is a song from a studio album that was released on which day ?",
        "response": "October 22, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the founders of the multinational corporation venture capital conglomerate for which David Baxby was formerly Co-CEO?",
        "response": "Sir Richard Branson and Nik Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the writer of the song \"I Knew the Bride\"?",
        "response": "English",
        "source": "hotpot_qa"
    }
]