[
    {
        "query": " \"I Am What I Am\" is a song performed by the character of Albin Mougeotte, first played by an actor of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Anthony Kimmins and Cesar Montano in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South African born singer featured the musical revue \"Sigh No More\"?",
        "response": "Graham Payn",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the last Summer Olympics Games held that included athletes from Singapore?",
        "response": "Rio de Janeiro, Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the covalist on the song \"Come Taste the Band\" inducted into the Rock and Roll Hall of Fame?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the founder of the Friend of Ireland born?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "Evil controllers was featured on Game informer who was published by which monthly video magazine corporation?",
        "response": "GameStop Corp.",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the architect who in 1905 designed the wing of By-the-Harbor containing a ballroom born?",
        "response": "1853",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Barton Mine or Beanland Mine located closer to Temagami?",
        "response": "Barton Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Praise 102.7 directs it's signal mainly toward the north and east to avoid interfering with W4 Country's transmitter located at it's studios off of what road?",
        "response": "South Wagner Road",
        "source": "hotpot_qa"
    },
    {
        "query": "What show featuring Homer, Bart and Lisa lampoons American culture by going on vacation in Itchy & Scratchy Land?",
        "response": "The Simpsons",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 71st Golden Globe Awards for television in 2013, what achievement did Breaking Bad, police sitcom Brooklyn Nine-Nine and American Hustle attain?",
        "response": "multiple awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Illicium and Lithophragma, are native to which mutual continent?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Mickey Rooney or Wilfred Lucas work in vaudeville? ",
        "response": "Mickey Rooney",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Gi-kwang and Lukas Rossi were both what?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Alongside Bob Geldof, who co-wrote the 1984 song written in reaction to television reports of the 1983–85 famine in Ethiopia, which was re-released in 2014 with re-tweaked lyrics to reflect the Ebola virus epidemic in West Africa?",
        "response": "Midge Ure",
        "source": "hotpot_qa"
    },
    {
        "query": "Erika Rosenberg is an author, interpreter and journalist, who wrote a biography about a Sudeten German-born woman who helped to save the lives of how many Jews during World War II?",
        "response": "1,200 to 1,700",
        "source": "hotpot_qa"
    },
    {
        "query": "What network did Rebecca Sugars best known work air on?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Thornton Wilder and Richard Llewellyn have in common?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre does Telemark and Quickstep have in common?",
        "response": "ballroom dance",
        "source": "hotpot_qa"
    },
    {
        "query": "Jayson Tatum, who played in the 2017-18 Philadelphia 76ers season, played for which college before declaring himself eligible for the 2017 NBA draft?",
        "response": "Duke Blue Devils",
        "source": "hotpot_qa"
    },
    {
        "query": "Panthera youngi is known from Choukoutien, northeastern China and Japan, and lived about 350,000 years ago in the Pleistocene epoch, Harington, 1969 suggested that the American lion, the Eurasian cave lion and the large Chinese \"Panthera youngi\" are conspecific, The American lion (\"Panthera leo atrox\" or \"P. atrox\" ) – also known as the North American lion, Naegele’s giant jaguar or American cave lion – is an extinct lion of the family Felidae, endemic to which location during the Pleistocene epoch?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the founder of the Material World Charitable Foundation often referred to as?",
        "response": "the quiet Beatle",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the movie with the actor Simon Baker released?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer has sold over 3 million albums and 5 million singles worldwide released his second studio album on May 15, 2012?",
        "response": "Adam Mitchel Lambert",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the record label that both Rihanna's albums from 2006 and 2008 were released under?",
        "response": "Def Jam Recordings",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1988 IAAF Grand Prix Final took place in a stadium that was originally built for what purpose?",
        "response": "1936 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "What team do Andre Russell and Carlos Brathwaite both play for?",
        "response": "West Indies",
        "source": "hotpot_qa"
    },
    {
        "query": "Emory Nusz was born in the city that is the county seat of what county?",
        "response": "Frederick County",
        "source": "hotpot_qa"
    },
    {
        "query": "Phil Power was most recently a manager of a team that plays in which league ?",
        "response": "National League North",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Princess Yolanda of Savoy and Elena of Montenegro related?",
        "response": "Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "are Taksim Gezi Park and Adam Mickiewicz Museum, Istanbul the same type of attraction",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Cato Point is a headland forming the southwest extremity of an island that lies approximately how far from the coast of South Africa ?",
        "response": "2600 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Roy Black, is a civil and criminal defense trial attorney, other celebrities whom Black has represented include Joe Francis, creator of what?",
        "response": "Girls Gone Wild",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a composer of an opera that Anton van Rooy appeared in?",
        "response": "Richard Wagner",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the best known novel by the author whose work was the basis for the French film Thomas the Impostor? ",
        "response": "Les Enfants Terribles",
        "source": "hotpot_qa"
    },
    {
        "query": "Earth Sound Research was located in what New York county?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "What British musical act had a number one hit in 1997 in the UK and recorded all the tracks on their debut album on an 8-track recorder?",
        "response": "White Town",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Idexx Laboratories and Harris Corporation defense contractors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of music do Suede and I Mother Earth play?",
        "response": "alternative rock",
        "source": "hotpot_qa"
    },
    {
        "query": "I Saw the Devil starred the actor who was in what critically-acclaimed 2015 film?",
        "response": "Inside Men",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in Holding the Fort is also known for being a television presenter for shows \"Game for a Laugh\", \"You Bet!\" and \"Stars in Their Eyes\"?",
        "response": "Matthew Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "João Guimarães Rosa and Robert Creeley have what in job in common?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "The founding members of The Mystic Deckchairs all attended a college located in this county in the UK?",
        "response": "Cheshire",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jaguar C-XF, was a concept car that was designed to showcase the preliminary styling cues of which yet to be announced executive/mid-size luxury car, and estate produced by which British car?",
        "response": "Jaguar XF",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of animal does Pont-Audemer Spaniel and Jämthund have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate H-201 (H-201) passes Red Hill, Fort Shafter and a facility whose massive coal pink structure can be see from where?",
        "response": "any point in the Honolulu District",
        "source": "hotpot_qa"
    },
    {
        "query": "ZZ Ward was a guest appearing in the release of what artist's hip hop recording?",
        "response": "Asher Roth",
        "source": "hotpot_qa"
    },
    {
        "query": "In which six Western European territories have Celtic languages or cultural traits survived?",
        "response": "Brittany, Cornwall, Ireland, Isle of Man, Scotland and Wales.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays more instruments, Feist or The Brothers Creeggan?",
        "response": "The Brothers Creeggan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Phillips Berlina is a neo-classic car that used stretched underpinings from a car that set a new sales record for what model year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Kirkpatrick was a founding member of which famous American boy band?",
        "response": "NSYNC",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Tiko's Spanish football club hold home games at?",
        "response": "Estadio de López Cortázar",
        "source": "hotpot_qa"
    },
    {
        "query": "Pray to God is a song by Calvin Harris, that features vocals from what American pop rock band from Los Angeles, that consists of three sisters?",
        "response": "Haim",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of art started as a flip book in early times but has been used to make films such as \"Life is Cool\" in 2008?",
        "response": "Korean animation",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in  Suffolk County in Nw York that houses a subsidiary of Anheuser-Busch InBev?",
        "response": "Patchogue",
        "source": "hotpot_qa"
    },
    {
        "query": "James William Keenan was a Major League Baseball catcher who played for a team that joined the National League in what year?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose films have featured music from the creator of the album Always Got Tonight?",
        "response": "David Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "What former LSU Tigers defensive coordinator led the 2015 Youngstown State Penguins football team?",
        "response": "Bo Pelini",
        "source": "hotpot_qa"
    },
    {
        "query": "The Central Coast including the suburb of Palmdale is located on what sea's coast?",
        "response": "Tasman Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress known by the media as the \"love goddess\" had a small uncredited role in what 1935 American comedy film?",
        "response": "Piernas de seda",
        "source": "hotpot_qa"
    },
    {
        "query": "Igor Lemos Cajuhy was from which capital of Bahia?",
        "response": "Salvador",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more than just a film director, Gene Kelly or Yannis Smaragdis?",
        "response": "Eugene Curran Kelly (August 23, 1912 – February 2, 1996) was an American dancer, actor of film, stage and television, singer, film director, producer, and choreographer.",
        "source": "hotpot_qa"
    },
    {
        "query": "Dale K. Myers is noted for authoring a book about what  American former U.S. Marine who assassinated United States President John F. Kennedy",
        "response": "Lee Harvey Oswald",
        "source": "hotpot_qa"
    },
    {
        "query": "Nature's Symphony in 432 is an album by a group that performs in what genre?",
        "response": "country and bluegrass gospel",
        "source": "hotpot_qa"
    },
    {
        "query": "Not About Angels was used in the film adaptation of what novel by John Green?",
        "response": "The Fault in Our Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "What caused the church council to accept funding plans from Mr. Burns in The Simpson's episode in which Lisa converted to Buddhism?",
        "response": "a model rocket",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Germany's best selling breweries also sponsors one of the 21 regional football cups?",
        "response": "Krombacher Brauerei",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer is older, Joseph Epstein or Milan Kundera?",
        "response": "Milan Kundera",
        "source": "hotpot_qa"
    },
    {
        "query": "Which King of Norway, born in 1903 officially opened Frigg Gas Field?",
        "response": "Olav V of Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "The front-woman for the band The Rebirth is a currently co-lead vocalist and percussionist for what band?",
        "response": "Fitz and The Tantrums",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Grosse produced an album for what band formed in 2004 in Orlando, Florida?",
        "response": "Alter Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "In which U.S. city did Kyle Richardson begin his college football career?",
        "response": "Jonesboro, Arkansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the novel which the terms Tom show and Uncle Tom are derived from?",
        "response": "Harriet Beecher Stowe",
        "source": "hotpot_qa"
    },
    {
        "query": "The  2008 Football League Championship play-off Final was won by Hull City through a 38th-minute goal by a player born in what year?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "What U Workin' With was a song from the film based on the dolls created by whom?",
        "response": "Thomas Dam",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the singer who cofounded United Musicians with Aimee Mann and Michael Hausman?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musical genre do the bands Eleventh Dream Day and Verona both play?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the architect who designed the Lincoln Memorial dedicated in 1922?",
        "response": "Henry Bacon",
        "source": "hotpot_qa"
    },
    {
        "query": "Barnstable County Hospital was the location of the autopsy of the son of President John F. Kennedy and Jacqueline Kennedy, and the younger brother of who?",
        "response": "Caroline Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of Celtic Woman appeared in stage productions of Grease and Legally Blonde the Musical?",
        "response": "Susan McFadden",
        "source": "hotpot_qa"
    },
    {
        "query": "What chess champion who holds the records for consecutive professional tournament victories (15) was featured in the World Chess Championship 1984?",
        "response": "Garry Kasparov",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company owned by Matt Groening features a logo with the letter \"C\" formed by a reflected surfboard?",
        "response": "The Curiosity Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Guy Maddin and Mel Brooks both been directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Wiccan teaching coven is based out of a local government area (LGA) located on the southern fringe of Adelaide, South Australia?",
        "response": "The Circle of Oak and Mistletoe",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Canadian producer, Melville Shavelson or Armand Schaefer?",
        "response": "Armand Schaefer",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor born on January 13, 1996 played in the movie The Heist?",
        "response": "Campbell Cooley",
        "source": "hotpot_qa"
    },
    {
        "query": "What American film director born on Nov 30, 1943 also wrote \"Pocket Money\"?",
        "response": "Terrence Malick",
        "source": "hotpot_qa"
    },
    {
        "query": "Which athletics arena was coveted by three Premier League clubs before one from East London was selected to become its new tenant?",
        "response": "Olympic Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "U. S. Grant Sharp Jr. is related to a general and president who fought in what war?",
        "response": "Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian billionaire owns a yacht built in the Lürssen Yachts yard?",
        "response": "Heidi Horten",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1992 New Hampshire gubernatorial election was held for what seat?",
        "response": "77th Governor of New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hegman attended the public university founded in what year?",
        "response": "1869",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital city of the country of origin of the famous actor Omar Sharif?",
        "response": "Beirut",
        "source": "hotpot_qa"
    },
    {
        "query": "12th & Midtown is in Midtown Atlanta along what street",
        "response": "Peachtree Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicola Dickson \"Niki\" Sauvage Tsongas is an American politician whose husband lost the 1992 Democratic presidential primary to who?",
        "response": "Bill Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "What were these letters from World War I authored by British High Commissioner to Egypt on the political status of lands under the Ottoman Empire that came to attention during the Cairo Conference?",
        "response": "the McMahon letters",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the Celtic nation began publish poetry in the late 1960's in the New Irish Writing Page of The Irish Press?",
        "response": "Gerard Smyth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book by Michael Lewis is Jeremy Van Brown  known for his place in",
        "response": "Moneyball",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the film where Hailee Steinfeld starred as Zooey Renner?",
        "response": "McG",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the historical county, later duchy of the Holy Roman Empire, located in the Low Countries that  Adolf van Nieuwenaar worked for in the  Eighty Years' War?",
        "response": "Guelders",
        "source": "hotpot_qa"
    },
    {
        "query": "Karl Camillo Schmidt-Hellerau, was a German carpenter, furniture manufacturer and social reformer, and is notable as the founder of Hellerau, Germany, by which method of urban planning in which self-contained communities are surrounded by \"greenbelts\", containing proportionate areas of residences, industry, and agriculture?",
        "response": "garden city movement",
        "source": "hotpot_qa"
    },
    {
        "query": "Who will direct the upcoming adaptation of the first of four novels in Philip Reeve's quartet of novels?",
        "response": "Christian Rivers",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Love to Hate You\" is a song by Erasure, an English synthpop duo, consisting of singer and songwriter Andy Bell and songwriter and which keyboardist?",
        "response": "Vince Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "What modern Japanese martial art was developed by Morihei Ueshiba, often referred to as\"the founder\" \"Kaiso\" or \"Ōsensei\"?",
        "response": "Aikido",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were home games played for the 2003 Missouri Tigers football team who lost the Independence Bowl to Arkansas?",
        "response": "Faurot Field in Columbia, Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the artist who released the album Gene Italiano born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manages the Spanish team that competes in the biennial UEFA European Under-21 Championship?",
        "response": "Albert Celades López",
        "source": "hotpot_qa"
    },
    {
        "query": "What do both Aealo and Rotting Christ have in common?",
        "response": "Greek extreme metal band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed is used more for trailing small game, Irish Terrier or Mountain Cur?",
        "response": "The Mountain Cur",
        "source": "hotpot_qa"
    },
    {
        "query": "Which commander of the Republic of Texas is played by Laurence Harvey in The Alamo?",
        "response": "William B. Travis",
        "source": "hotpot_qa"
    },
    {
        "query": "What high school is located in the town in which most television stations in the Louisvillve market have their transmitter facilities located? ",
        "response": "Floyd Central High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is larger in size, the Braque Saint-Germain or the Jack Russell Terrier?",
        "response": "Braque Saint-Germain",
        "source": "hotpot_qa"
    },
    {
        "query": "Which number overall pick was the Lithuanian player who debuted with the Toronto Raptors in the 2012-13 season?",
        "response": "fifth",
        "source": "hotpot_qa"
    },
    {
        "query": "The battle in which Giuseppe Arimondi lost his life secured what for Ethiopia?",
        "response": "sovereignty",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the proper name for the steroid used by the retired British track sprinter who is one of the fastest European sprinters in the history of athletics?",
        "response": "Tetrahydrogestrinone",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Hedley Mascot Mine and Ruth Mine have in common?",
        "response": "gold mine",
        "source": "hotpot_qa"
    },
    {
        "query": "ISO 3166-1 alpha-2 is a widely used country code system, along with what three-letter system?",
        "response": "ISO 3166-1 alpha-3",
        "source": "hotpot_qa"
    },
    {
        "query": "What hotel did the influential National Crime Syndicate member found with David Berman?",
        "response": "Flamingo Hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the American based Apple Inc. and Vertex Pharmaceuticals companies headquartered in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What English actor appeared in the horror film The Ward?",
        "response": "Jared Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brother of the player traded from the Washington Bullets to the Portland Trail Blazers after the 1993 NBA season?",
        "response": "Horace Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "Which co-creator of spider-man was born in December of 1922?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Kabhi Kabhie (Hindi: कभी कभी, English: \"Sometimes\") is a Indian Hindi romantic drama film, produced and directed by Yash Chopra, film lyricist Sahir Ludhianvi won the Best Lyricist Award for \"Kabhi Kabhie Mere Dil Mein,\" the song which also got singer Mukesh, the Best Male Playback Singer award, is a song from which year Bollywood movie \"Kabhi Kabhie\" ?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Roenberg directed a movie named Bandidas starring which two actresses?",
        "response": "Salma Hayek and Penélope Cruz",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Ki-duk (born December 20, 1960) is a South Korean filmmaker noted for his idiosyncratic art-house cinematic works, major festival awards include Golden Lion at 69th Venice International Film Festival for \"Pietà\", Pietà is a South Korean film, in which year?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series aired first, Big Hero 6 or Kim Possible?",
        "response": "Kim Possible",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was created first, Chatelaine or Arthur's Magazine?",
        "response": "Arthur's Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Ruscus and Oxalis, which one has more number of known species?",
        "response": "Oxalis",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the Sissala East District in the Upper West region of north Ghana?",
        "response": "Tumu",
        "source": "hotpot_qa"
    },
    {
        "query": "Tommy Swerdlow co-wrote the screenplay of what film directed by Jon Turteltaub?",
        "response": "Cool Runnings",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Martin Adams and Sid Haig American actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Akim Tamiroff and Robert Nalbandyan both Armenian?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Vanessa Kirby played Joanna Richard Curtis' movie released on what date?",
        "response": "4 September 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was produced earlier, The Fighting Prince of Donegal or The Moon-Spinners?",
        "response": "The Moon-Spinners",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former name of the building across from the Rockefeller Building?",
        "response": "Cleveland Union Terminal",
        "source": "hotpot_qa"
    },
    {
        "query": "What beauty pageant was held in Las Vegas in 2010 with Lady Mina as one of the contestants?",
        "response": "Miss Universe 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Delhi Public School was inaugurated by an Indian politician who became the Union Deputy Minister of Commerce in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British French Crime drama series did William Ash star in?",
        "response": "The Tunnel",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was the professional wrestler who was trained by pioneering Hawaiian sumo wrestler Takamiyama and a participant of Invasion Attack born?",
        "response": "American-born",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the widow of Lee Harvey Oswald who used to live with Ruth Paine at the time of the JFK assassination? ",
        "response": "Marina Nikolayevna Oswald Porter",
        "source": "hotpot_qa"
    },
    {
        "query": "What pivotal event in the Texas Revolution occurred between February 23 and March 6, 1836 and involved Damacio Jiménez serving under Juan Seguín?",
        "response": "Battle of the Alamo",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress that starred alongside Sady Rebbot in the 1962 film \"Vivre sa vie\" born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Which suburb of the Twin Cities is part of District 50B in Minnesota?",
        "response": "New Brighton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is the training center that a forward for Spanish side Las Palmas of La Liga located in?",
        "response": "Lyon",
        "source": "hotpot_qa"
    },
    {
        "query": "From what 1981 philosophical treatise did Houellebecq get the name of The Map and the Territory?",
        "response": "Simulacra and Simulation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which park in Manhattan can be seen from the San Remo, the 27-floor apartment building opened in 1930?",
        "response": "Central Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ralph Ceder and Norman Foster a film director?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the tutor of the person San Casimiro is named after?",
        "response": "Johannes Longinus",
        "source": "hotpot_qa"
    },
    {
        "query": "What girl group writes and composes their own music and also debuted a single and music video on the same day?",
        "response": "Pristin",
        "source": "hotpot_qa"
    },
    {
        "query": "Global Philanthropy Group is a consulting firm that provides philanthropic services for high-net-worth individuals, charitable foundations and corporations, their clients include Tory Burch, an American fashion designer, businesswoman, and philanthropist, who has won several fashion awards for her designs, she is the Chairman, and what, and Designer of Tory Burch LLC",
        "response": "CEO",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city has more population, Shihezi or Yinchuan?",
        "response": "Yinchuan",
        "source": "hotpot_qa"
    },
    {
        "query": "The WEMF AG für Werbemedienforschung collects figures on what in Switzerland?",
        "response": "media usage",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2017 comedy loosely based on the real-life relationship between Kumail Nanjiani and Emily Gordon, played by Zoe Kazan?",
        "response": "Michael Showalter",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarter of an American restaurant holding company who's chairman and chief executive officer was Jon L. Luther?",
        "response": "Canton, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Glen Benton and Thomas Erak both musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which univerisity was founded 1838, Virginia Commonwealth University or Stevens Institute of Technology?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "who played Thomas Andrews in Titanic",
        "response": "Victor Joseph Garber",
        "source": "hotpot_qa"
    },
    {
        "query": "Which province does this Australian Senator and media personality represent, with whom Alyson Best appeared in a famous photo in \"Playboy?\"",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy J. Sloan was the CEO of Wells Fargo who succeeded the CEO who took the job in what month?",
        "response": "June 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What label released Julio José Iglesias de la Cueva's 2003 album?",
        "response": "Columbia Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What film used a song sung by Debbie Harry as its theme?",
        "response": "American Gigolo",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Stich and Chanda Rubin, have which occupation in common?",
        "response": "tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "Which village in New South Wales, Australia has a larger population, Mogriguy or Dubbo?",
        "response": "Dubbo",
        "source": "hotpot_qa"
    },
    {
        "query": "How many German scientists, engineers, and technicians, were recruited in post-Nazi Germany as a result of the clandestine operation where Arthur Rudolph became one of the main developers of the U.S. ?space program",
        "response": "more than 1,600",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more known species, Cissus or Digitalis?",
        "response": "Cissus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lethal game of chance is featured in the 2013 film Roulette?",
        "response": "Russian roulette",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the rapper who created a song produced by a Norwegian DJ?",
        "response": "Tory Lanez",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the group behind Jerry Kasenetz's 1977 hit formed?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Raymond Palmer co-wrote The Coming of the Saucers with an American aviator and businessman who made what is considered the first widely reported unidentified flying object sighting when?",
        "response": "June 24, 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gerhart Hauptmann and Piers Anthony both German?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "William Frederick Harris received the Navy Cross for extraordinary heroism during the breakout in a battle that took place in which war ?",
        "response": "the Korean War",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American distance runner who died in an automobile accident in Oregon had a trail named after him?",
        "response": "Steve Prefontaine",
        "source": "hotpot_qa"
    },
    {
        "query": "Jessica Lee, former MP for Erewash, served as Parliamentary Private Secretary to the experienced representative for Beaconsfield, when he held which office?",
        "response": "Attorney General",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the team that won the Frauen DFB-Pokal cup competition in 1995 disband?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more occupations in the cinema industry, George Stevens or Claire Denis?",
        "response": "George Cooper Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American football tight end for the New England Patriots was featured on Madden NFL 18?",
        "response": "Rob Gronkowski",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the producer of the album \"The Bends\" born? ",
        "response": "28 February 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this disease related to abnormality in the oxygen-carrying protein haemoglobin that Chukwuedu Nwokolo is carrying out research on?",
        "response": "Sickle-cell disease",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress debuted in \"The River Rat\" and also starred in \"I'm Not Rapport\"?",
        "response": "Martha Plimpton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator and writer of the sitcom that features a character named Cassandra Trotter?",
        "response": "John Sullivan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ganslernhang (or Ganslern for short) is a ski piste in Kitzbühel in Austria, on which the slalom events of the Hahnenkamm Races take place, located next to the final straight of the Streif downhill course, he Hahnenkamm is a mountain in Europe, directly southwest of Kitzbühel in the Kitzbühel Alps of which country?",
        "response": "Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry were both the Llama Company and L.F. Rothschild involved in?",
        "response": "investment banking",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Ron Richardson play in a musical with a book by William Hauptman and lyrics by Roger Miller?",
        "response": "Jim",
        "source": "hotpot_qa"
    },
    {
        "query": " RuneQuest is a fantasy role-playing game created by a game designer born in what year ?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mayor of the municipality that Uddel is in?",
        "response": "John Berends",
        "source": "hotpot_qa"
    },
    {
        "query": "Rob Zombie and David Howard are both what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 Oklahoma Sooners football team represented the University of Oklahoma in the 2014 NCAA Division I FBS football season, the team was led by two-time Walter Camp Coach of the Year Award winner, Bob Stoops, a former American college football coach, and is the former head football coach at which university?",
        "response": "University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "What was name of  the children's animated series that aired from 1992 to 1995 that Stacey Jefferson voiced two characters?",
        "response": "The Animals of Farthing Wood",
        "source": "hotpot_qa"
    },
    {
        "query": "What school district is the high school Christie Ambrosi attended part of?",
        "response": "Blue Valley Unified School District",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bush Beast was a roller coaster at the amusement park in what part of Sydney?",
        "response": "Eastern Creek",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Velvetpark or Shape magazine written more for a lesbian and queer-identified female readership?",
        "response": "Velvetpark",
        "source": "hotpot_qa"
    },
    {
        "query": "Who s the original and current lead singer of the Japanese heavy metal band, Loudness, Dave Matthews or Minoru Niihara?",
        "response": "Minoru Niihara",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Brian Warren and Jake Shields are considered what?",
        "response": "mixed martial arts fighter",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Craig Schlattman and Carl Reiner both do great work in front of the camera as well as writing and directing?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was introduced first, Aladdin's Dragons or CirKis?",
        "response": "Aladdin's Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the book published that Best Laid Plans was loosely based on?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Who used to coach for the university that ranked 27th in the nation in 2016?",
        "response": "Sharon Dawley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Treasure of Matecumbe or The Wild Country?",
        "response": "The Wild Country",
        "source": "hotpot_qa"
    },
    {
        "query": "Stand By Me, famously starring River Phoenix, was a film adapted from a short story called The Body, by which famous author?",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "What posthumous collection of essays by William Gaddis was published at the same time as Gaddis's last novel ublished posthumously in 2002 by Viking?",
        "response": "The Rush for Second Place",
        "source": "hotpot_qa"
    },
    {
        "query": "Of which nationality is the guide book that has awarded chef Christian Le Squer with three stars?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team picked Rod Strickland's godson in the 2011 NBA draft?",
        "response": "Cleveland Cavaliers",
        "source": "hotpot_qa"
    },
    {
        "query": "What are Sidney Morgan and William Friedkin known for?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who one of the leading poets of the First World War, who was the first known user of the phrase  \"the pity of war\" ?",
        "response": "Wilfred Edward Salter Owen",
        "source": "hotpot_qa"
    },
    {
        "query": " Which game, Löwenherz or Sentinels of the Multiverse, was created first?",
        "response": "Löwenherz",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the Grain company manufacture using Northern White Cedar and Western Red Cedar wood?",
        "response": "surfboards",
        "source": "hotpot_qa"
    },
    {
        "query": "Krzysztof Penderecki who is Poland's greatest living composer and the composer of Utrenia is from which country?",
        "response": "Poland",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Hairspray and Zac Efron have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Victor Amaya and Mark Woodforde both former professional tennis players ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 8x8 wheeled amphibious armoured personnel carrier provided by the Sri Lanka Armoured Corps replaced which two vehicles",
        "response": "BTR-60 and BTR-70",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathleen Baker is the current world-record holder in the 4x100 metre medley relay along with an American compedition swimmer who qualified for what in 2016?",
        "response": "Rio Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did the cover athlete of the NFL Quarterback Club 96 play 13 years of his career for?",
        "response": "San Francisco 49ers",
        "source": "hotpot_qa"
    },
    {
        "query": "In between The Joy Formidable and The Lumineers which consists of Rhiannon \"Ritzy\" Bryan (lead vocals, guitar),?",
        "response": "The Joy Formidable",
        "source": "hotpot_qa"
    },
    {
        "query": "Last Dinosaurs and Uverworld are both what?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "Prem Granth is a Hindi movie which was released in India, which star of the movie, is also known by her married name Madhuri Dixit Nene?",
        "response": "Madhuri Dixit",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the son of Henry James, Sr. and the brother of renowned philosopher and psychologist William James and diarist Alice James, Henry James, or Mary Higgins Clark?",
        "response": "Henry James",
        "source": "hotpot_qa"
    },
    {
        "query": "2017–18 Everton F.C. and the 2017–18 Premier League both compete in what sport?",
        "response": "English football",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's life is captured in the 1999 British film about the collapse of Baring's Bank, the United Kingdom's oldest merchest bank, due to fraudulent, speculative trading?",
        "response": "Nick Leeson",
        "source": "hotpot_qa"
    },
    {
        "query": "What cultural, social and artistic explosion taking place in Harlem, New York is Madame E. Toussaint Welcome associated with?",
        "response": "The Harlem Renaissance",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both movies Nerdcore Rising and What Would Jesus Buy? focused on similar topics?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "This british television film was directed by whom",
        "response": "James Strong",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy W. Lake is a news anchor for a television station owned by what media group?",
        "response": "Nexstar Media Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Marcia Louise Fudge is the U.S. Representatieve for which city in Cuyahoga County?",
        "response": "Cleveland",
        "source": "hotpot_qa"
    },
    {
        "query": "Old Rectory is in a small town and civil parish where?",
        "response": "North Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "A Spanish model that has been the face of Jimmy Choo, and an Italian luxury fashion house that was founded in 1983, is known for what facial feature?",
        "response": "her eyes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the location of the state secondary school Agnes Body was the founding head of (Apart from Queen Margaret's School)?",
        "response": "on \"Wragby Road\" in Lincoln, Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Jesus Jones of TV on the Radio?",
        "response": "Jesus Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Nubuke Foundation is an art foundation in East Legon, a town in the Accra Metropolitan district, a district of the Greater Accra Region of which country?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "When was English singer and songwriter was born who wrote the song Fly on the Wall and was he became the third lead singer of AC/DC?",
        "response": "5 October 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed has a number of different varieties, the Harrier or the Schweizerischer Niederlaufhund?",
        "response": "Schweizerischer Niederlaufhund",
        "source": "hotpot_qa"
    },
    {
        "query": "Ho Iat Seng  is a member of a legislative assembly that has how many members ?",
        "response": "33-member",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bowling Green massacre was alluded to by a government official born in what year?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Byron Black and Iván Molina play which sport?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who cared for the castle with which was the caput of Lord of Liddesdale?",
        "response": "Historic Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is a genus of flowering plant, Sinofranchetia or Melaleuca?",
        "response": "Sinofranchetia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Canadian-American actor, voice actor, comedian, screenwriter, and graphic artist, who was part of the cast of NewsRadio, in his final regular role before his death?",
        "response": "September 24, 1948May",
        "source": "hotpot_qa"
    },
    {
        "query": "Mexican Federal Highway 45D has tolled segments between Chihuahua City and which largest city in the Mexican state of Chihuahua?",
        "response": "Ciudad Juárez",
        "source": "hotpot_qa"
    },
    {
        "query": "Just a Little Inconvenience is a 1977 American made-for-television post-war drama film written and directed by Theodore J. Flicker and starring which American film, television and voice actor, best known for portraying the roles of Heath Barkley in the American television Western series \"The Big Valley\" (1965–1969)?",
        "response": "Lee Majors",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacques-Louis was a founding member of the geological society before returning to France after what period of French history that followed the fall of Napoleon in 1814 until the July revolution of what year?",
        "response": "1830",
        "source": "hotpot_qa"
    },
    {
        "query": "Baknaffek samples a song by the impresario who was of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What rapper featured in Hot 100 song on the album released by Beyonce during the Destiny's Child hiatus?",
        "response": "Jay-Z",
        "source": "hotpot_qa"
    },
    {
        "query": "Kindada Jones' is the daughter of composer Quincy Jones and what 1970 Golden Globe Winner for Best Actress in a Television Drama? ",
        "response": "Peggy Lipton",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of facility was Roger Batzel best known for as director?  ",
        "response": "federal research",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the  historic market town  in which East Hertfordshire council has offices in located ",
        "response": "Hertfordshire, England.",
        "source": "hotpot_qa"
    },
    {
        "query": "What appeared first, Gunnin' for That No. 1 Spot or Baghdad ER?",
        "response": "Baghdad ER",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band has a song title that refers to the nickname of the Paul Brown Stadium?",
        "response": "Guns N' Roses",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the cities of Yiwu and Jiaohe, Jilin both located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A Culă is a type of building originally made to be able to fortify the ruling class against invasions during which wars?",
        "response": "Ottoman–Habsburg wars",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boar's Nest is the local restaurant and tavern in an American action-comedy television series that aired for how many seasons?",
        "response": "seven seasons",
        "source": "hotpot_qa"
    },
    {
        "query": " Chairmen of the Bored is an album that references a joke made by a cast member of what series?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "The top draft pick of the 1999-2000 Los Angeles Clippers season what born in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Bridge Day is an annual one-day festival in Fayetteville, Fayette County, West Virginia, United States The event is coordinated by the New River Gorge Bridge Day Commission, the event, held on the third Saturday every October, commemorates the 1977 completion of which steel arch bridge 3030 ft long over the New River Gorge near Fayetteville, West Virginia, in the Appalachian Mountains?",
        "response": "New River Gorge Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "James Patrick Aylward, was a Missouri attorney, Democratic party leader, and a political associate of Harry S. Truman, he was the 33rd President of the United States (1945–53), assuming that office upon the death of Franklin D. Roosevelt during the waning months, of which historic event?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Xinji and Liyang located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Puma evoPOWER was marketed by what Spanish professional footballer?",
        "response": "Francesc \"Cesc\" Fàbregas Soler",
        "source": "hotpot_qa"
    },
    {
        "query": "Matthew Casey is a fictional character portrayed by actor Jesse Spencer on which American drama tv show that debuted in 2012?",
        "response": "\"Chicago Fire\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Emma Roberts and Blow have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Phillip Ferdinand \"Phil\" Mahre had a  total of 27 World Cup race wins is fourth among Americans, only behind Lindsey Vonn, Bode Miller, and Mikaela Shiffrin, an American World Cup alpine ski racer who specialized  in what?",
        "response": "slalom and giant slalom",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the composer of \"Anthem\" born?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "The second studio album by American death metal band The Faceless, was inspired by a book by an author of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Indian nationalist whose defiant patriotism made him a hero in India and for which Netaju Bhawan was maintained as a memorial to him?",
        "response": "23 January 1897",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Weak and Powerless\" is the first single by the alternative rock band A Perfect Circle, from their second album Thirteenth Step, released on which date?",
        "response": "September 16, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  eyeglass maker buried?",
        "response": "29 September 1619",
        "source": "hotpot_qa"
    },
    {
        "query": "The Story of Us is from the album on what label?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the parent company of the electric supply to Yuoga?",
        "response": "Volta River Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Italian-American composer and librettist wrote the English language opera, Maria Golovin?",
        "response": "Gian Carlo Menotti",
        "source": "hotpot_qa"
    },
    {
        "query": "Which suitcase manufacturer is named after a Peruvian artifact and has a store in an urban shopping mall in Time Warner Center in Manhattan?",
        "response": "Tumi Holdings, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city where the Ariel Castro kidnappings took place?",
        "response": "388,072",
        "source": "hotpot_qa"
    },
    {
        "query": "SAVAK was dissolved during the outbreak of the overthrow of which dynasty?",
        "response": "Pahlavi",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does one of the co-writers of \"Dirty Water\" live?",
        "response": "Nashville, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which weekly guest on the program New York Week in Review was born in 1972 ?",
        "response": "Elizabeth Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more titles, Kathy Jordan or Stan Smith?",
        "response": "Kathryn \"Kathy\" Jordan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the member of Country Flavour was born on October 20, 1942?",
        "response": "Philomena Begley",
        "source": "hotpot_qa"
    },
    {
        "query": "What medival stone bridge is a short distance from the Palazzo Pitti?",
        "response": "Ponte Vecchio",
        "source": "hotpot_qa"
    },
    {
        "query": "Akumadan is the capital of Offinso North, the Offinso North District is one of the twenty-seven (27) districts in the Ashanti Region of Ghana, and its capital is which location?.",
        "response": "Akomadan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current Group Chief Executive & Editor-in-Chief of the newspaper for which Ibrahim Jalees wrote the column \"Waghaira Wghaira\"?",
        "response": "Mir Shakil-ur-Rahman",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Frank Coraci and Roger Donaldson have the same profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brother of Jordan Subban was born on May 13, 1989?",
        "response": "P. K. Subban",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the chief executive officer (CEO) of GlaxoSmithKline born to whom  Deirdre Connelly reported to?",
        "response": "22 August 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "JoBeth Williams starred in the tv miniseries Murder Ordained, What was the name of her 1994 short film?",
        "response": "On Hope",
        "source": "hotpot_qa"
    },
    {
        "query": "Which philosophical movement that developed in the late 1820s and 1830s is Frederic Henry Hedge part of ",
        "response": "Transcendentalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Minersville School District v. Gobitis and United States v. Paramount Pictures, Inc., are both related to which organization?",
        "response": "United States Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "What voice actress born in Osaka played a role in the anime series Fullmetal Alchemist: Brotherhood?",
        "response": "Rie Kugimiya",
        "source": "hotpot_qa"
    },
    {
        "query": "Someone Like You is a collection of stories by a notable author who sold how many copies of his books?",
        "response": "250 million",
        "source": "hotpot_qa"
    },
    {
        "query": "How many books are in the Stephen King series of which Roland Deschain of Gilead is the protagonist?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "The university where William I. Rose is a professor was founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Mircea Eliade and B. Traven who had a more diverse career?",
        "response": "Mircea Eliade",
        "source": "hotpot_qa"
    },
    {
        "query": "What record company released the third album by the woman, who was featured as a topless model for \"The Sun\" in 1983?",
        "response": "Jive Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What project did an American aerospace engineer, test pilot, United States Air Force pilot, and one of the seven original astronauts, also referred to as the Original Seven or Astronaut Group 1, participate in?",
        "response": "Project Mercury",
        "source": "hotpot_qa"
    },
    {
        "query": "Owen Wilson, who played in the movie \"Father Figures\" earned a nomination for the Academy Award for Best Original Scrrenplay for what movie?",
        "response": "The Royal Tenenbaums",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to having research and development facilities for Fila, Montebelluna also is the place where Geox is based, what is Geox?",
        "response": "an Italian brand of shoe and clothing",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the draft where Calvin Andre \"C.J.\" Miles Jr. was drafted by the Utah Jazz held?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2013 American comedy film that premiered in the Special Presentation section at the 2013 Toronto International Film Festival, and co-starred  a French singer-songwriter, musician, actress and model?",
        "response": "John Turturro",
        "source": "hotpot_qa"
    },
    {
        "query": "Death of a Gentleman is a 2015 documentary about the takeover of the governance of cricket by ICC's 'Big Three', features interviews with which English cricket broadcaster and a former professional cricketer?",
        "response": "Jonathan Agnew",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the author of the Beach Boys' song \"Feel Flows\"?",
        "response": "Dean",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cocktail's name describes how the drink looks, Blue Hawaii or Baby Guinness?",
        "response": "Baby Guinness",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the former French football striker whose 24 goal record was tied during the 2001-02 Piacenza Calcio season?",
        "response": "David Sergio Trezeguet",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Hamilton Institute named after?",
        "response": "Sir William Rowan Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Song Min-ho is a rapper who sang Born Hater which originated in which country?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population as of the 2010 census of the county in which Pilsen, Kansas is located?",
        "response": "12,660",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was Mykolas Dluskis a priest in 1788?",
        "response": "Lithuania",
        "source": "hotpot_qa"
    },
    {
        "query": "Por Baazar contains a cameo by an Indian film director, screenwriter, producer, actor, playback singer, and television host, who was born to Javed Akhtar and who?",
        "response": "Honey Irani",
        "source": "hotpot_qa"
    },
    {
        "query": "The producer of this box office success starring Liam Neeson was born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Elizabeth Cecil, 16th Baroness de Ros Was the granddaughter of who?",
        "response": "Henry Manners",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is compared to Koyaanisqatsi, Baraka or Burma VJ?",
        "response": "Baraka",
        "source": "hotpot_qa"
    },
    {
        "query": "What band does the rhythm guitarists of the band that won the New Orleans regional polls' wife who plays bass currently play for?",
        "response": "Star & Dagger",
        "source": "hotpot_qa"
    },
    {
        "query": "What European production and distribution animation company co-produced Gormiti Nature Unleashed?",
        "response": "Mondo TV",
        "source": "hotpot_qa"
    },
    {
        "query": "Hellhammer was a Swiss extreme metal band from Nurensdorf, active during 1981–1984, in June 1984, Hellhammer disbanded and founded another highly influential band, which Swiss heavy metal band, from Zürich?",
        "response": "Celtic Frost",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the anchor store of the GVK One mall open?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Which biennial multi-sport event held among the athletes from South Asia has Syed Maratab Ali Shah gold medaled in twice?",
        "response": "The South Asian Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Always True to You in My Fashion was written for what musical written by Samuel and Bella Spewack?",
        "response": "Kiss Me, Kate",
        "source": "hotpot_qa"
    },
    {
        "query": "An article titled \"The Color Line\" was published in the \"North American Review\" in 1881, by Frederick Douglass, who became a national leader of what movement in Massachusetts and New York?",
        "response": "the abolitionist movement",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the singer of Ever Ever After born?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Park Bo-ram made her debut with release digital single \"Beautiful\" featuring the leader of what boy group?",
        "response": "Block B",
        "source": "hotpot_qa"
    },
    {
        "query": "Madden NFL 2002 features a former Minnesota Vikings quarterback who played college football at which school?",
        "response": "University of Central Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which series of advertisements did Dave Bickler go on to provide the vocals in advertisement",
        "response": "Real Men of Genius",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the star actor of The Getaway?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Do No Harm was an episode of what series that was on ABC from 2004 to 2010?",
        "response": "Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "When the View-Master was the official film of Disneyland in the 1970s, an actor whose career spanned how many decades was its spokesman?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian and later American chess master who was also a highly influential writer and chess theoretician competed for the first contest  that was defined \"in advance\" as being for the world championship?",
        "response": "Steinitz",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Knight was drafted by a team founded in which year ?",
        "response": "1898",
        "source": "hotpot_qa"
    },
    {
        "query": "What film, directed by Bryan Singer, has a video game released by Paradox on the Game Boy Color and PlayStation?",
        "response": "X-Men",
        "source": "hotpot_qa"
    },
    {
        "query": "The president of the Alabama Christian Movement for Human Rights from 1956 to 1969 helped who during the Civil Rights movement?",
        "response": "Martin Luther King Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the highest point of the roller coaster at Paradise Pier?",
        "response": "120 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1953 Taça de Portugal Final was won by a team from which Portuguese city ?",
        "response": "Lisbon",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Weimaraner and Old Time Farm Shepherd types of dogs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the starring basketball player in the movie that Ryan Woodward worked on that was about basketball?",
        "response": "Michael Jordan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who, along with Laurence and Lydia Fox, is a grandchild of Robin Fox born?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the final book in the series that depicts a society that has eliminated emotion and color to attempt to achieve equality?",
        "response": "Son",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film which inspired the EP Los Angeles by Graf Orlock ?",
        "response": "Michael Mann",
        "source": "hotpot_qa"
    },
    {
        "query": "Jamael Orondé \"Rondé\" Barber (born April 7, 1975) is a former American football cornerback and safety who spent his entire 16-year career playing for the Tampa Bay Buccaneers of the NFL, the twin brother of which former American football running back who played for the New York Giants, for ten seasons?",
        "response": "Atiib Kiambu Hakeem-Ah \"Tiki\" Barber",
        "source": "hotpot_qa"
    },
    {
        "query": "What cover song by hard rock/blues rock band AC/DC was included on the 1.22.03 Acoustic EP?",
        "response": "Highway to Hell",
        "source": "hotpot_qa"
    },
    {
        "query": "War All the Time is an album released by a band formed in which city?",
        "response": "New Brunswick",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2010 Disney Channel Original Movie Co-starred Danielle Campbell  and an actor best known for playing the roles as Alex in \"17 Again\" ?",
        "response": "Starstruck",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that was shot in or around Leland, North Carolina in 1986",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "Gemma Christina Arterton, is an English actress, she plays the lead role in which 2016 British war comedy-drama film directed by Lone Scherfig and written by Gaby Chiappe, based on the 2009 novel \"Their Finest Hour and a Half\" by Lissa Evans?",
        "response": "Their Finest",
        "source": "hotpot_qa"
    },
    {
        "query": "In what countries was the FIFA World Cup held during which Bruno Metsu coached Senegal into the quarter-finals?",
        "response": "South Korea and Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "The person that the Lindsey Islands were named for was born in what year?",
        "response": "1907",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of the initial novella in Clive Barker's horror franchise that feautures a character named 'Butterball'?",
        "response": "\"The Hellbound Heart\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Blind Side is an American biographical sports drama film, released in which year, the storyline features Michael Oher, an American football offensive tackle who is currently a free agent?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Sammy Winward plays Lisa Murdoch in a series first broadcast on what date?",
        "response": "28 April 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the singer of one of the songs that \"Just the Two of Us\" was behind on the \"Billboard\" Hot 100?",
        "response": "Kim Carnes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mimosa and Sidalcea both genus of plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Crawford on Game Design contains a response about a life simulation game developed by who?",
        "response": "EA Maxis",
        "source": "hotpot_qa"
    },
    {
        "query": "For which state did this American politician serve as senator whose logo morphing from the apple logo was featured in \"Hillary 1984?\"",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "What example of a venue with strippers to provide adult entertainment could be found in what neighborhood in New York City?",
        "response": "Chelsea neighborhood",
        "source": "hotpot_qa"
    },
    {
        "query": "What president did the chairman of the Commission on Protecting and Reducing Government Secrecy serve as an advisor to?",
        "response": "Richard Nixon",
        "source": "hotpot_qa"
    },
    {
        "query": "Elymus and Nicandra, are types of what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Between \"This Changes Everything\" and \"My Architect\", which documentary is about Louis Kahn?",
        "response": "My Architect",
        "source": "hotpot_qa"
    },
    {
        "query": "This city is known as the \"heart of the Ruby Valley\" and contains Gordon Peak which has an elevation of 8478ft?",
        "response": "Sheridan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish comedy hip-hop duo from Limerick city did Series two  introduced as reporters, bizarre weathermen and agony aunts",
        "response": "The Rubberbandits",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2010, what was the population where the Village of Westbury is located?",
        "response": "226,322",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actress starred with Alan Alda in the 1963 film Gone Are the Days?",
        "response": "Ruby Dee",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the cricketer, for whom Fanny Rush is best known for her portrait of, retire from all formats of cricket?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "The 249th episode of \"The Simpsons\" was aired on what date?",
        "response": "November 1, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the cousin of the man called \"The Great Commoner\"?",
        "response": "Lewis Bryan",
        "source": "hotpot_qa"
    },
    {
        "query": " In a Metal Mood: No More Mr. Nice Guy is a 1997 album by an American who had how many top-40 hits?",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Tell Me Why on the album Maya is recorded by what English artist?",
        "response": "M.I.A.",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day was the first appearance of a three-time British Soap Award for Best Comedy Performance winner on the British soap opera \"Coronation Street\"?",
        "response": "26 November 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "The Russell Subdivision is a railroad line owned by a railroad headquartered in what state?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of the founder of MAD Symposium?",
        "response": "16 December 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, Matthew Good Band or Switchfoot is still together?",
        "response": "Switchfoot",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the hotel which hosted the 37th Daytime Emmy Awards given its current name",
        "response": "July 1, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Major League Baseball teams usually attend the meeting where the John H. Johnson President's Award is awarded?",
        "response": "30 Major League Baseball teams",
        "source": "hotpot_qa"
    },
    {
        "query": "Which type of flowering plant is commonly used as a spice in Middle Eastern cuisine, Sumac or Gentianopsis?",
        "response": "Sumac",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music is this musician who composed the soundtrack for \"Niruttara\" (2006) specialized in?",
        "response": "Indian classical and fusion",
        "source": "hotpot_qa"
    },
    {
        "query": "What CBS-affiliated station serves Pontotoc County, Oklahoma?",
        "response": "KXII",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lottery is a 1989 American short film starring Bette Midler, which was shown at the then Disney-MGM Studios in line for the first versions of the Studio Backlot Tour was a theme park attraction at Disney's Hollywood Studios theme park at the Walt Disney World Resort in Lake Buena Vista, in which state? ",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Why I Love You was a song from the album collaborated on by which two American rappers?",
        "response": "Jay-Z and Kanye West",
        "source": "hotpot_qa"
    },
    {
        "query": "Which supporting actor in Luck by Chance was born on 10 January 1974 ?",
        "response": "Hrithik Roshan",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat German-born French composer created the operetta La Grande-Duchesse de Gérolstein?",
        "response": "Jacques Offenbach",
        "source": "hotpot_qa"
    },
    {
        "query": "what kind of business was Elmer Lucille Allen the first African-American Chemist at?",
        "response": "spirits and wine business",
        "source": "hotpot_qa"
    },
    {
        "query": "What Austrian composer of Um Mitternacht was best known for his symphonies, masses, and motels?",
        "response": "Anton Bruckner",
        "source": "hotpot_qa"
    },
    {
        "query": "Geoffrey Wilder is the father of which Runaways supervillain?",
        "response": "Alex Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the ninth Typhoon that effected Japan in the Month of August during the unusually late Pacific typhoon season of 2016?",
        "response": "Typhoon Mindulle",
        "source": "hotpot_qa"
    },
    {
        "query": "What company developed a new simulation strategy video game depicting theme park management similar to \"RollerCoster Tycoon\" in 2006?",
        "response": "Frontier Developments",
        "source": "hotpot_qa"
    },
    {
        "query": "Nexus and Girlfriends are both what?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Fernando Francisco González Ciuffardi played his only major final in 2007 losing to a Swiss professional tennis player who has won 19 what?",
        "response": "Grand Slam singles titles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city, Yixing or Shangqiu, has a larger population?",
        "response": "Yixing",
        "source": "hotpot_qa"
    },
    {
        "query": "James Frawley and Jerry Belson, have which mutual occupation?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ugandan political leader was responsible for the murder of Erinayo Wilson Oryema?",
        "response": "Idi Amin Dada",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a musical based on a book by Marc Acito, Kuo, and Lorzenso Thione, in which actor Greg Watanabe played in?",
        "response": "Allegiance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was formerly known as something else, Women's Running or Playgirl?",
        "response": "Women's Running",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 World RX of Canada was the eight round of a season that started at what location?",
        "response": "Circuit de Barcelona-Catalunya",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is native to France, the Basset Bleu de Gascogne or the Carolina Dog?",
        "response": "Basset Bleu de Gascogne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is bigger, Griffon Bruxellois or English Mastiff?",
        "response": "English Mastiff",
        "source": "hotpot_qa"
    },
    {
        "query": "Fawad Siddiqui was in a George Clooney film alongside a Scottish actor born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress from the movie Teen Patti is the ambassador of the Indian cosmetics brand Lakmé? ",
        "response": "Shraddha Kapoor",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2008 City Theatre Dublin ran productions of a play by who?",
        "response": "Oscar Wilde",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the founder of Tensor Trucks called?",
        "response": "Father of Street Skateboarding",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose team was promoted to the second division of professional German football in the 2005-06 season?",
        "response": "Ali Bilgin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a case regarding the protections offered by the Speech or Debate Clause of the United States Constitution, Rasul v. Bush or Gravel v. United States?",
        "response": "Gravel v. United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the tour that accompanied the album released on November 11, 2008 by Big Machine Records?",
        "response": "The Fearless Tour",
        "source": "hotpot_qa"
    },
    {
        "query": "Auranticarpa and Huernia are both plant genus?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "On Giants' Shoulders was written in 1998 by Melvyn Bragg, the book was assembled after a series of interviews Bragg had with current scientists about the world's greatest scientists such as which English mathematician, astronomer, and physicist (described in his own day as a \"natural philosopher\") who is widely recognised as one of the most influential scientists of all time and a key figure in the scientific revolution?",
        "response": "Isaac Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "Capitol Technology University and Walla Walla University, are located in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Actor whose birth name was Charles Dennis Buchinsky, was part of the Leslie Nielsen comedy?",
        "response": "Charles Bronson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Marguerite Duras and Maheen Zia both of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Roddy Woomble and Kelli Ali, have which mutual occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed originated further east, the Cão Fila de São Miguel or the Saluki?",
        "response": "Saluki",
        "source": "hotpot_qa"
    },
    {
        "query": "Sandra Sdraulig, executive coach and owner of Through the Roof, is chairman of an international film festival held over two weeks in mid October where?",
        "response": "Adelaide, South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian composer wrote Symphony No. 35 dated December 10, 1767?",
        "response": "Joseph Haydn",
        "source": "hotpot_qa"
    },
    {
        "query": "Sparks Fly was written and recorded by the singer-songwriter of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of a film which featured the winner of FX's inaugural MMA competition?",
        "response": "James Z. Feng",
        "source": "hotpot_qa"
    },
    {
        "query": "Which corporation produces this brand that first appeared in 1928 in the United States and whose concept car released in 1995 could fit two passengers and had a space for a laptop on a small table?",
        "response": "Chrysler Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Ray McKinnon, who wrote, and produced the film Chrystal, born?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "In between University of Michigan and Universidade Positivo which one was moved to Ann Arbor in 1837?",
        "response": "The University of Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stevenage railway station and Watton-at-Stone railway station both serves which town?",
        "response": "serves the town of Stevenage in Hertfordshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Brewer is a former American football player, He played quarterback for the University of Texas Longhorns during the 1981 and 1982 season, The University of Texas at Austin (UT, UT Austin, or Texas) is a public research university, and the flagship institution of which organization?",
        "response": "University of Texas System",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrews Outlier is an Ancestral Puebloan archeological site south of a park containing the most sweeping collection of ancient ruins north of where?",
        "response": "Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the HMS Dreadnought?",
        "response": "battleship",
        "source": "hotpot_qa"
    },
    {
        "query": "Which creative outlet was enjoyed by both Mary Doria Russell and T. E. Lawrence?",
        "response": "writing",
        "source": "hotpot_qa"
    },
    {
        "query": "What city did Yasmin Giger compete in at the 2017 World Championships?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": " Marine Day was established by what law?",
        "response": "Public Holiday Law",
        "source": "hotpot_qa"
    },
    {
        "query": "What team and sport was played by Juaquin Iglesias and coached by Lincoln Riley?",
        "response": "Oklahoma Sooners football",
        "source": "hotpot_qa"
    },
    {
        "query": "In how many countries did a song written by Rolf Magnus Joakim Larsson go to the number one spot?",
        "response": "25",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Theo van Gogh or Raj Kapoor?",
        "response": "Theodoor \"Theo\" van Gogh",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Watertown International Airport and Alexandria International Airport both airports in the same state ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the fairy Queen Mab orginate?  ",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose novel deals with an artist who committed suicide time in Belgium?",
        "response": "Nellie Hermann",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer whose stage name references a New York City subway station debuted her first album at number two on the Billboard 200 chart?",
        "response": "Halsey",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of the head coach of the 1976-77 Phoenix Suns team?",
        "response": "Matthew",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Hocus Pocus and Ten Who Dared have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "which  southern region of Asia did  Indian whiting inhabits its  east and west coasts",
        "response": "The Indian subcontinent",
        "source": "hotpot_qa"
    },
    {
        "query": "Zircon known for what soundtrack?",
        "response": "PIU",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick Tam and Padmarajan, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Simon Turner\" is the debut album of the singer and later film soundtrack composer Simon Fisher Turner, at the time Turner was being widely promoted in the UK pop press as a homegrown alternative to David Cassidy, he is known for his role as who?",
        "response": "Keith Partridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Chicken Cha Cha Cha or RoboRally receive more awards?",
        "response": "RoboRally",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Fibigia and Tanakaea a flowering plant?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What British made dance competition television series franchise did Claudia Albertario appear on?",
        "response": "\"Dancing on Ice\" around the world",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the company with which Tashi Dorje performs as a soloist formed?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to writing, what was the author of the text to Lord of All Being, Throned Afar formally trained in?",
        "response": "law",
        "source": "hotpot_qa"
    },
    {
        "query": "Mick Jones and Johnny Van Zant, have which mutual occupation?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting for the television drama in which the man playing Sir Richard Carlisle in \"Downton Abbey\" played the title role?",
        "response": "Galway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Secret Garden is an Irish actor and novelist?",
        "response": "John Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the sport in which the purpose is to accumulate the highest score for a \"game\", consists of eight or ten ends, and whose Swedish team consisted of Major Delaval Graham L'Eastrange Astley?",
        "response": "Curling",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2007 Rand Hummel  was named Director of THE WILDS of New England located in what county?",
        "response": "Hillsborough County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the present role of the man Claude Mongeau succeeded as President and Chief Executive Officer of Canadian National Railway ?",
        "response": "CEO of CSX",
        "source": "hotpot_qa"
    },
    {
        "query": "The show Pole Chudes is hosted by a well-known television and internet personality is named based on what story?",
        "response": "The Golden Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Southwest Airlines Flight 1763 left which primary commercial airport serving Las Vegas?",
        "response": "McCarran International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the first woman to serve as the Speaker of thr Oregon House of Representatives as well as thr Portland Oregon mayor in 2000?",
        "response": "Vera Katz",
        "source": "hotpot_qa"
    },
    {
        "query": "which Indian state-owned International banking and financial services company has  Central Bank of India has a  joint venture with",
        "response": "Bank of Baroda",
        "source": "hotpot_qa"
    },
    {
        "query": "Norigae is a film based on the story of a South Korean actress who had been staring in what television drama series?",
        "response": "Boys Over Flowers",
        "source": "hotpot_qa"
    },
    {
        "query": "What station does the show that the actress born on August 31, 1989 air on?",
        "response": "KBS2",
        "source": "hotpot_qa"
    },
    {
        "query": "How many basalt columns make up the causeway between Causeway Head and Benbane Head?",
        "response": "about 40,000",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1st Alabama Siege Artillery Unit were massacred by Confederate troops under whose command?",
        "response": "Major General Nathan Bedford Forrest",
        "source": "hotpot_qa"
    },
    {
        "query": "Cole Williams has a 2005 American drama film called?",
        "response": "North Country",
        "source": "hotpot_qa"
    },
    {
        "query": "Czechoslovakian Wolfdog and Kromfohrländer, are which type of animal?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "James Francis \"Jimmy\" Cagney Jr. starred in White Heat, written by what writer?",
        "response": "Ivan Goff and Ben Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "What film other than the 2007 American computer-animated science fiction comedy film produced by Walt Disney Animation Studios was produced during Stainton's tenure?",
        "response": "\"Chicken Little\"",
        "source": "hotpot_qa"
    },
    {
        "query": "How long did the career span of the actor who starred with Mickey Rooney and Marilyn Maxwell in Off Limits?",
        "response": "nearly 80 years",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American artist who was part of a duo that mainly painted on the streets of downtown Manhattan?",
        "response": "Jean-Michel Basquiat",
        "source": "hotpot_qa"
    },
    {
        "query": "Let My Babies Go! A Passover Story was a novelization of the Rugrats episode aired on what date?",
        "response": "April 13, 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "The fourth Salman Rusdie novel was in part responsible for a film-poem created by whom in 1989?",
        "response": "Tony Harrison",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created a sculpture two miles from Horse Thief Lake?",
        "response": "Gutzon Borglum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the attracted which will be replaced by DreamWorks Theatre  is a 4D film at various theme parks around the world?",
        "response": "Shrek 4-D",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the artist who recorded the song \"Give it 2 U in which rapper Kendrick Lamar makes a guest appearance?",
        "response": "Robin Thicke",
        "source": "hotpot_qa"
    },
    {
        "query": "The small resort of Porto Rafael was founded on the North Eastern coast of Sardinia, Italy, by Raphael Neville, Count of Berlanga de Duero, in the late 1950s, the son of Edgar Neville the Hollywood film director, playwright and novelist who became close friends with Sir Charles Spencer \"Charlie\" Chaplin, was an English comic actor, filmmaker, and composer who rose to fame in the era of what?",
        "response": "silent film",
        "source": "hotpot_qa"
    },
    {
        "query": "From what country is the female star of the made-for-television drama Common?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach for whom Orlando Brown played in college was born in what year?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Tim Kaine and Aneesh Chopra have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Nogometno Društvo Črnuče's manager in 1994 born?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "are Peter Segal and Henry Winkler both authors ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach of the opposing team which beat the German football club, based out of Leipzig, in the 1986-87 European Cup Winners' Cup?",
        "response": "Johan Cruyff",
        "source": "hotpot_qa"
    },
    {
        "query": "Which outdoor shopping center in Orlando, Florida has a store that was the largest bath shop chain in the United Staes in 1997?",
        "response": "Pointe Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeff Martin and Charlie Dominici both considered singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeux d’eau is a piece for solo piano by a composer born in what year?",
        "response": "1875",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Selman created an action platformer video game based on the animated television series which was released in October of what year? ",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the husband of Nina Petrovna Khrushcheva die?",
        "response": "11 September 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry do Jon Jost and Arline Burks Gant work in?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "John P. Angelos is the elder son of the trial lawyer of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did Simple Plan perform at the award show held at Pauley Pavilion in Los Angeles?",
        "response": "Shut Up!",
        "source": "hotpot_qa"
    },
    {
        "query": "The Moscow Philharmonic Orchestra is an orchestra based in Moscow, Russia, most associated with longtime conductor Kiril Kondrashin under whom it premiered which Russian composer and pianist, Fourth and Thirteenth symphonies as well as other works?",
        "response": "Dmitri Dmitriyevich Shostakovich",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Kissinger currently plays for an outdoor socker team that plays in which region?",
        "response": "Midwest Region",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lysiloma and Peltophorum large tree species?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the 1981 CART PPG Indy Car World Series in Avondale Arizona?",
        "response": "Rick Ravon Mears",
        "source": "hotpot_qa"
    },
    {
        "query": "The female heptathlon competitor who medaled at the 2004 Commonwealth Youth Games is also the 2010 world indoor champion in what event?",
        "response": "pentathlon",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Rupert von Trapp father born? ",
        "response": "4 April 1880",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first name of the person who recorded the size of the Brigantia territory in the 2nd century AD?",
        "response": "Claudius",
        "source": "hotpot_qa"
    },
    {
        "query": "The Missionary is a 1982 British comedy film starring Maggie Smith and an actor that was a member of what comedy group?",
        "response": "Monty Python",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is was the 50th governor of Indiana and is founder of the Great America Committee?",
        "response": "Mike Pence",
        "source": "hotpot_qa"
    },
    {
        "query": "The Politician: An Insider's Account of John Edwards's Pursuit of the Presidency and the Scandal That Brought Him Down is a 2010 tell-all book, chronicling over a decade working behind the scenes with former North Carolina senator and presidential candidate John Edwards, which American actress and film producer, did he have an extramarital affair with?",
        "response": "Rielle Hunter",
        "source": "hotpot_qa"
    },
    {
        "query": "The Clemson Tigers competed in the 2015 Orange Bowl in what city?",
        "response": "Glendale, Arizona",
        "source": "hotpot_qa"
    },
    {
        "query": "Boise State University and Carleton University, are located in Canada?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Berthold Viertel and Tony Scott, share which occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Crossing the Line was directed by Peter Jackson, and had an additional director who was what South African film director who is best known for District 9?",
        "response": "Neill Blomkamp",
        "source": "hotpot_qa"
    },
    {
        "query": "Ardleigh Reservoir supplies water to what company that is regulated under the United Kingdom Water Industry Act 1991?",
        "response": "Anglian Water",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Goldy is a guitarist in what American heavy metal band that was formed in 1982?",
        "response": "Dio",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the top speed of the faster roller coaster, when comparing Green Lantern and The Riddler's Revenge?",
        "response": "65 mph",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the indirect tax at which Navin Kumar served as the first chairman introduced in India? ",
        "response": "1 July 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "A custom motorcycle is the style created by which lifestyle brand company out of Newburgh, New York?",
        "response": "Orange County Choppers",
        "source": "hotpot_qa"
    },
    {
        "query": "What building has an Art Deco style and was appraised by Robert Von Ancken?",
        "response": "Chrysler Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Hibiscus waimeae, is a species of flowering plant in the okra family, Malvaceae, that is endemic to the island of Kauaʻ i in Hawaii, H. arnottianus\" of Oʻ ahu and Molokaʻ i and \"H. waimeae\", have white flowers, and are the only of how many species of hibiscus, regarded as native to Hawaii?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryan Brown performed in what 1984 British musical drama that was directed by Peter Webb?",
        "response": "Give My Regards to Broad Street",
        "source": "hotpot_qa"
    },
    {
        "query": "This actress stars in the 2015 series The Menu Who was the second runner-up in 1990 in what?",
        "response": "Miss Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "What  is one of the five ranger districts of the Chattahoochee National Forest that has a mountain located in the Chattahoochee National Forest on the border of Fannin and Gilmer counties in the district, along with a portion of the Toccoa River? ",
        "response": "Toccoa Ranger District",
        "source": "hotpot_qa"
    },
    {
        "query": " Evan Jones was in the 2002 American drama film written by whom?",
        "response": "Scott Silver",
        "source": "hotpot_qa"
    },
    {
        "query": "Alec Baldwin guest starred in which 2004 \"The Fairly Oddparents\" television film? ",
        "response": "Channel Chasers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed and co-wrote the film \"Forget to Remember\" was first featured in?",
        "response": "Darren Lynn Bousman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which political ideology was the premise of The National Action Party?",
        "response": "Nationalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Seoul Train and Making North America are both films in what style of cinema or film making genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "About Time is a  British romantic comedy-drama film that stars an Irish actor and writer who recieved a Bachelor of Arts from where?",
        "response": "Dublin Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of communication medium does The Playboy Club and Laura Benanti have in common?",
        "response": "television",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the actor who, along with Seth MacFarlane, Alex Borstein,  Lacey Chabert and Mila Kunis, provides voices for the show Family Guy ? ",
        "response": "Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town that Feura Bush is along it's town line?",
        "response": "33,656",
        "source": "hotpot_qa"
    },
    {
        "query": "Battle of Logiebride took place among the Bain family that inhabited the castle in what Scottish town?",
        "response": "Dingwall",
        "source": "hotpot_qa"
    },
    {
        "query": "What American astronaut from Hawaii has a United States Air force Test Pilot Scool award named after him?",
        "response": "Ellison Onizuka",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the host for which \"Winner Take All\" is best known?",
        "response": "\"Dean of Game Show Hosts\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the football club that Robin Himmelmann is a goalkeeper for based?",
        "response": "Hamburg",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Kevin McCallister in \"Home Alone\" was a member of what New York City rock band?",
        "response": "The Pizza Underground",
        "source": "hotpot_qa"
    },
    {
        "query": "The Korean program Homo Academicus was narrated by the child actor that achieved fame in which 2002 film?",
        "response": "The Way Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was founded earlier, Lehigh University or University of Iowa?",
        "response": "University of Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Mann and Maurice Pialat, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "While Tom Selleck is known for starring as private investigator Thomas Magnum in the television series \"Magnum, P.I.\", what role did Larry Manetti, play on \"Magnum, P.I.\"?",
        "response": "Orville Wilbur Richard \"Rick\" Wright",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the primary position that Giovanni Drenthe's older brother player?",
        "response": "left winger",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American senior operations officer for the Central Intelligence Agency for 30 years and worked for Eclipse Group?",
        "response": "Duane \"Dewy\" Clarridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Vera Lynn 100 is a compilation album that features collaborations with a an English tenor and actor, notably performing in what?",
        "response": "musical theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state is Upper and Lower Marlboro located?",
        "response": "Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Iowa State University wrestling coach beat Elmadi Zhabrailov at the Olympics?",
        "response": "Kevin Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Trivor and Rakaposhi in Pakistan?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "For which team does the player who performs rap parts on the single We are Ajax play ? ",
        "response": "Beşiktaş",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 196 wildlife refuge is located in a hamlet on the South Shore of Long Island?",
        "response": "Seatuck National Wildlife Refuge",
        "source": "hotpot_qa"
    },
    {
        "query": "Intelligent Thought is a book co written by this famous American theorectical physicist?",
        "response": "Lee Smolin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked on the origins of Mickey Mouse and created Oswald the Lucky Rabbit?",
        "response": "Ub Iwerks",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Acanthophoenix and Alder a genus of flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tennis and PC Gamer the same kind of publication?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the winter games held in which Sabastien Toutant won a silver medal?",
        "response": "Aspen, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these two restaurant chains is based in Oakhurst, California, Pizza Factory or Pagliacci Pizza?",
        "response": "Pizza Factory",
        "source": "hotpot_qa"
    },
    {
        "query": "Nic Offer and Grant Hart are considered to be which type of artist?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What company operates in Switzerland and is part of the name of an award Gene Hobbs won?",
        "response": "Rolex",
        "source": "hotpot_qa"
    },
    {
        "query": "Abeliophyllum and Brillantaisia, are types of what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2009 film features an actor that also started in Bad Samaritan?",
        "response": "Cherrybomb",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 242-acre waterfront casino resort in Louisiana will be the home of a fourth Vic & Anthony's steakhouse in late 2014?",
        "response": "Golden Nugget Lake Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Francisco 49er who performed backup for \"I Know What I Like\" played college footbal for the University of Southern California?",
        "response": "Ronnie Lott",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  college football stadium was 2014 Boca Raton Bowl played ",
        "response": "FAU Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What literary style describes the 1968 book that features a 1939 international Harvester school bus?",
        "response": "the growing literary style called New Journalism",
        "source": "hotpot_qa"
    },
    {
        "query": "In what War did the father of Princess Christina Margarethe of Hesse die?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "President's Choice Financial is a financial service division to a supermarket chain with how many regional and market segment banners?",
        "response": "22",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016 UCF Knights football team represented the University of Central Florida in the 2016 NCAA Division I FBS football season, they were led by first-year head coach, and former player, Scott Andrew Frost, he was previously the offensive coordinator at which organization?",
        "response": "University of Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "My Sentimental Friend was performed by which English beat rock band?",
        "response": "Herman's Hermits",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus contains more species, Philadelphus or Sarracenia?",
        "response": "Philadelphus",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Migliazzo was drafted to which NFL team in 1987 under coach Mike Ditka?",
        "response": "Chicago Bears",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person, William Blake Herron or John Carpenter, held more diverse roles in the movie industry?",
        "response": "musician, editor and composer.",
        "source": "hotpot_qa"
    },
    {
        "query": "Bagalwad is a village in an Indian state formed the passage of the States Reorganisation Act on what date?",
        "response": "1 November 1956",
        "source": "hotpot_qa"
    },
    {
        "query": "Author Kurt Vonnegut, who is most famous for his novel Slaughterhouse-Five, created Granfalloon, which is defined as a \"false karass\" in the fictional religion of what?",
        "response": "Bokononism",
        "source": "hotpot_qa"
    },
    {
        "query": "One of Marcia Gay Harden's notable acting roles was in \"The Mist\" in 2007, based on a story by which famous author?",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "A British officer of the Royal Navy best known for his 1791-95 expedition first charted what in 1793?",
        "response": "Cascade Inlet",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional boxer has a father who's also a boxer and a former circus performer?",
        "response": "Azriel Páez",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill Richardson pardoned Eliadah McCord after being convicted of what?",
        "response": "smuggling heroin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played in The Hunchback of Notre Dame and born 1936?",
        "response": "Charles Kimbrough",
        "source": "hotpot_qa"
    },
    {
        "query": "The UK single \"Anyone Can Fall in Love\" was written by an actress who gained early exposure on what TV sitcom?",
        "response": "Up the Elephant and Round the Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Keegan-Michael Key star in first, \"Key & Peele\" or Let's Be Cops?",
        "response": "\"Key & Peele\"",
        "source": "hotpot_qa"
    },
    {
        "query": "According to the 2010 census what was the population of the town which Free Jim Mine is located?",
        "response": "5,242",
        "source": "hotpot_qa"
    },
    {
        "query": "Rillington Place is a three-part biographical crime drama about the case of a serial killer that lived in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of physical activity does Red, White & Crüe and Mike Tyson have in common?",
        "response": "fight",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Cloudy with a Chance of Meatballs and Lascars animated films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Derrick Green and Pete Stewart are both what?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two artists, Threes Anna and Willard Huyck, whose country of residence is closest to Germany?",
        "response": "Threes Anna",
        "source": "hotpot_qa"
    },
    {
        "query": "What day was the season finale broadcast live that announced Park Woo-jin was one of the final 11 members?",
        "response": "June 16, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor that starred the Comedy Central sketch series Key and Peele also appeared in Fargo as FBI agent Pepper?",
        "response": "Keegan-Michael Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-created this American variety television series about children demonstrating talents and engaging in conversation broadcast by NBC along with the host of \"Family Feud?\"",
        "response": "Ellen DeGeneres",
        "source": "hotpot_qa"
    },
    {
        "query": "What series does the American character actor best-known for playing General Hammond star in the first episode?",
        "response": "Twin Peaks",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in the park was the 3D science fiction film starring Michael Jackson located?",
        "response": "Disneyland Space Stage",
        "source": "hotpot_qa"
    },
    {
        "query": "What English dancer, judge, and coach was featured as a judge on Strictly Come Dancing on season 14 with Bruno Tonioli, Craig Revel Horwood and Darcey Bussell?",
        "response": "Leonard Gordon Goodman",
        "source": "hotpot_qa"
    },
    {
        "query": "What other occupation is shared by English writer and visual artist Clive Barker and English comedian, actor and author Will Hay?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which correspondent of Frederick Goddard Tuckerman was an American essayist, lecturer, and poet who led the transcendentalist movement of the mid-19th century?",
        "response": "Ralph Waldo Emerson",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a cartridge developed for the Browning .50 caliber machine gun in the late 1910, was banned in California which led to the adoption of a French rifle cartridge developed by Eric Danis? ",
        "response": ".50 Browning Machine Gun",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker focused on a more eastern global region, Tomás Gutiérrez Alea or Fruit Chan?",
        "response": "Fruit Chan",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Köstritz is a town in the district of Greiz, in Thuringia, Germany, which brewery, founded in 1543, is one of the oldest producers of Schwarzbier (black lager)?",
        "response": "Köstritzer",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1993–94 NBA season was the 6th season for the Charlotte Hornets in which organization, the team would soon struggle as Larry Johnson injured his back?",
        "response": "National Basketball Association",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Daniel Ekman (March 17, 1845 – November 3, 1904) was a Swedish chemical engineer who invented the form of the sulfite process of wood pulp manufacturing which was first established on a firm commercial basis, helping to replace rags as the main raw material of paper with wood pulp, he opened the Ekman Pulp and Paper Company mill in Northfleet, Kent near the mouth of the Thames River in 1886, Kent is a county in South East England and is how many of the home counties?",
        "response": "one",
        "source": "hotpot_qa"
    },
    {
        "query": "Which playlist was released by OVO Sound with a song co-written with Adam Feeney? ",
        "response": "More Life",
        "source": "hotpot_qa"
    },
    {
        "query": "Utterby is situated on the road that is in what English region?",
        "response": "East Midlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ITV2 documentary series did the band made up of Lee Brennan, Jimmy Constable and Simon Dawbarn reform for in 2012?",
        "response": "\"The Big Reunion\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Udo Proksch was born in a city that had how many residents on 1 January 2017 ?",
        "response": "320,587",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of David Hayman's mobster role?",
        "response": "Gabriel",
        "source": "hotpot_qa"
    },
    {
        "query": "Joshua T. Mendell and Victor A. McKusick are both experts in what field of medicine?",
        "response": "genetics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Fine Young Cannibals or Kent?",
        "response": "Kent",
        "source": "hotpot_qa"
    },
    {
        "query": "The group that owns the luxury watch company Longines was founded in which year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "The county where Benjamin Van Keuren House Ruin is located named after what?",
        "response": "the Irish province of Ulster",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of accent does David Tennant use in \"DuckTales\"?",
        "response": "Scottish accent",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the films Barbie and the Three Musketeers and Summer Wars released in different years?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Once Upon a Time in Shanghai is a 2014 Hong Kong-Chinese martial arts film directed by Wong Ching-po, and stars include Philip Ng, a Hong Kong-born American actor, martial artist and action choreographer, currently based in which location?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "What opera starring Mary LeSawyer had its premiere in Philadelphia in 1946?",
        "response": "Street Scene",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist does Thank You Baby! and Up! have in common?",
        "response": "Shania Twain",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the architect who designed the building whose grounds Hancock Manor would now stand on?",
        "response": "Charles Bulfinch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the actor who voiced the robot barber in short film Modern Inventions ?",
        "response": "Avon",
        "source": "hotpot_qa"
    },
    {
        "query": "The person that wrote Pursuit of Honor as served as a story consultant for what television series?",
        "response": "24",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Carol Kane or Andy Kaufman?",
        "response": "Andy Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Longhaired Redneck\" is a song co-written and recorded by American country music artist David Allan Coe, an American songwriter, outlaw country music singer, and guitarist who achieved popularity in the 1970s and 1980s, born on which date?",
        "response": "September 6, 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the South Korean boy band Super Junior will appear in the television series Revolution?",
        "response": "Choi Si-won",
        "source": "hotpot_qa"
    },
    {
        "query": "Bet That features, on the remix, the rapper who hails from what city?",
        "response": "Queens, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Hearst Television subsidiary of the Hearst Corporation owns an NBC-affiliated television station located near which supplier of ore?",
        "response": "Sloss Mines",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Christopher Buckley related to the founder of \"National Review\" magazine?",
        "response": "son",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Mike Figgis and Patrick Rea directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of Dog is a hunting dog breed developed in Bosnia, Bosnian Coarse-haired Hound or Bouvier des Flandres?",
        "response": "Bosnian Coarse-haired Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star in Beneath the Valley of the Ultra-Vixens is a Mexican American film actress, exotic dancer, and porn star?",
        "response": "Kitten Natividad",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the luxury hotel and casino where Caesars Palace is located between located ",
        "response": "Paradise, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was the actor, who also appeared in \"The Hellions,\" nominated for the BAFTA Award for Best Supporting Actor?",
        "response": "Equus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand belongs to the elder brother of the owners of Adidas ?",
        "response": "Puma",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the technical device made by the british aeronautical engineer during the second world war do? ",
        "response": "counter engine cut-out",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book was written by an atheist salon owner and explicitly denies the existence of God?",
        "response": "The System of Nature",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the King of Wessex from 839 to 858 whose father, King Egbert, defeated Beornwulf of Mercia and who himself led the Battle of Aclea between the West Saxons and the Danish Vikings?",
        "response": "Æthelwulf",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English military advisor on the \"Mayflower\" had a fort named after him on Lovell's Island, Massachusetts?",
        "response": "Myles Standish",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1952 comedy-drama film did American cinematographer Karl Struss work on?",
        "response": "Limelight",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many years did the animal who had a role in 2010 FIFA world cup as Sonny Wool in 2011 Rugby world cup live ?",
        "response": "(26 January 2008 – 26 October 2010)",
        "source": "hotpot_qa"
    },
    {
        "query": "The DUX-53 and DUX-59 were submachine guns designed at the Oviedo Arsenal in which country, a large number of these weapons were produced for the West German Border Guard, and was later licensed to be produced by Anschütz and Mauser, a German arms manufacturer?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ranking among pharmacy schools in 2015 for the college to which Pharmaceutical Research Institute is associated?",
        "response": "58th-ranked",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsey Oil Refinery lies to the north of a British oil refinery in South Killingholme, that is situated south of the railway line next to what?",
        "response": "the A160",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the current star of Belarusian football born?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What character was portrayed by Yang Xuwen in a television series adapted from a Novel by Louis Cha and directed by Jeffrey Chiang?",
        "response": "Guo Jing",
        "source": "hotpot_qa"
    },
    {
        "query": "Who leads the editorial team for the New York Observer, one of whom is an American film critic and co-host of the television show 'At the Movies'?",
        "response": "Ken Kurson",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is this person born who is currently a Principal and Vice President of a privately held company that invests in real estate, and was instrumental in the formulation and growth of the Live! brand?",
        "response": "Baltimore, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Donker Mag is an album by what African hip hop group?",
        "response": "Die Antwoord",
        "source": "hotpot_qa"
    },
    {
        "query": "What NIFL Premier Intermediate League team did Sean Connor play for?",
        "response": "Distillery",
        "source": "hotpot_qa"
    },
    {
        "query": "Adventuredome is located at the casino and RV park located in what city?",
        "response": "Winchester, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Who contributes the sole guest verse on Jay-Z's album that includes the song \"Song Cry\"?",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "What's this Maxey Flat facility about that inspired the documentary film American Threnody ? ",
        "response": "Low Level Radioactive Waste",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wometco Home Theater (WHT) was an early pay television service in the New York City area, that was owned by Miami-based Wometco Enterprises, the signals were broadcast beginning in August 1977, and later on WSNL-TV (channel 67) out of Smithtown, a town in Suffolk County, New York, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actress who appears in both of the movies, \"Warm Bodies\" and \"Hacksaw Ridge\"?",
        "response": "Teresa Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "who publish the  monthly magazine  which John Curran was its editor ",
        "response": "Bloomberg L.P.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the singer of the 2002 album Fight?",
        "response": "Dorothee Pesch",
        "source": "hotpot_qa"
    },
    {
        "query": "Satellite High school was founded in what year and what is on the end of a scorpions tail",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rote Jager was assembled by what World War II fighter ace who served on both the Eastern and Western fronts?",
        "response": "Hermann Graf",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Jones is a competitor in sport where motorcycle riders attempt to impress judges with what?",
        "response": "jumps and stunts",
        "source": "hotpot_qa"
    },
    {
        "query": "Which track from All Shall Perish's third studio album \"Awaken the Dreamers\" contains lyrics that reference songs by the American heavy metal band from Huntington Park, California, formed in 1981 by guitarists Kerry King and Jeff Hanneman? ",
        "response": "\"Songs for the Damned\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize in Physics has the inventor of the heterotransistor, who is the head of the St Petersburg Academic University won?",
        "response": "Nobel Prize in Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "James Watt was a Northern Irish loyalist for which paramilitary group?",
        "response": "The Ulster Volunteer Force",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the traditional Japanese materials for wrapping gifts?",
        "response": "Furoshiki",
        "source": "hotpot_qa"
    },
    {
        "query": "Which U.S. Army specialist convicted in the Abu Ghraib scandal was born in 1968?",
        "response": "Manadel al-Jamadi",
        "source": "hotpot_qa"
    },
    {
        "query": "What distinction was awarded to the Indian Carnatic vocalist, musician, multi-instrumentalist and composer when he won the National Award for a Kannada language film based on the life and teachings of the founder of the Tattvavada philosophy, Madhvacharya?",
        "response": "Best Music Director",
        "source": "hotpot_qa"
    },
    {
        "query": "Where can both Himalayacalamus and Pterocarya be found?",
        "response": "Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "What census-designated place is home to the Geissler Estate?",
        "response": "Fort Salonga",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Lifted by Love was included in the soundtrack of a film directed by who ?",
        "response": "Gus Van Sant",
        "source": "hotpot_qa"
    },
    {
        "query": "South Korean actor Kim Yool-ho starred in what 2016 movie directed by Yeon Sang-ho Yeon Sang-ho and starring actors Gong Yoo, Jung Yu-mi, and Ma Dong-seok?",
        "response": "Train to Busan",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1987 Asian WOmen's Handball Championship took place in a city with this population?",
        "response": "4,007,526",
        "source": "hotpot_qa"
    },
    {
        "query": "Ram Kumar Sharma won the election in which how many people were eligible to vote?",
        "response": "814.5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "How was Ada Lovelace, the first computer programmer, related to Lord Byron in Childe Byron?",
        "response": "his daughter",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the professional athlete play who was the grandson of the man who designed the Los Angelos Rams Logo?",
        "response": "left fielder",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the a Japanese convenience store franchise chain in south korea that has a store accessible inside in Damuqiao Road Station?",
        "response": "CU",
        "source": "hotpot_qa"
    },
    {
        "query": "100 People Who Are Screwing Up America ( Alan Stuart \"Al\" Franken the American writer, comedian, and politician is #37), is a non-fiction book by Bernard Goldberg that was published in which year?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the former Secretary of Transportation at the state government organization in charge of maintaining public roadways of the U.S. state of Kansas?",
        "response": "Deborah Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Katie White and Donnie Munro in the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Major League Baseball team did Rutherford Rennie write for during the time Lou Gehrig played for them?",
        "response": "the New York Yankees",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did \"the king of cool\" play in with Bud Ekins as his stunt double?",
        "response": "\"The Great Escape\"",
        "source": "hotpot_qa"
    },
    {
        "query": "YouPorn was surpassed, in 2013, by competitor sites xHamster, Pornhub, LiveJasmin, and this website that is registered to the Polish company WGCZ Holding? ",
        "response": "XVideos",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed the film that Samuel Pack Elliott played The Caretaker in?",
        "response": "Mark Steven Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2009 Chinese-Korean film resulted in a 2013 prequel called My Lucky Star which featured many of the same actors/actresses?",
        "response": "Sophie's Revenge",
        "source": "hotpot_qa"
    },
    {
        "query": "What video collection by Ian Levine was filmed on Central Drive in the seaside town of Blackpool, Lancashire in Northern England and featured American Rhythm and Blues singer Rose Batiste?",
        "response": "The Strange World of Northern Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "Fun and Galt Aureus both make what kind of music?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more awards for their films, Hal Hartley or Alexander Payne?",
        "response": "Alexander Payne",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew James Matfin Bell, is an English actor and dancer, he's known for his roles in which 2011 3D motion capture computer-animated mystery adventure comedy film based on \"The Adventures of Tintin\", the comics series by Belgian cartoonist Hergé?",
        "response": "The Adventures of Tintin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the cast of The Jungle Captive was born in Maryland?",
        "response": "Rondo Hatton",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides Iggy Pop, which other singer who was known for her partnership with Serge Gainsbourg, contributed to the \"We are the Lillies\" project?",
        "response": "Jane Mallory Birkin",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth year of the skier who returned from her 1976 sabbatical for the 1977 Alpine Skiing World Cup?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Eugene Hargrove is editor-in-chief of Environmental Ethics located in what city?",
        "response": "Denton, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "In which album was American rapper Kendrick Lamar's first number-one single on the US \"Billboard\" Hot 100 included?",
        "response": "\"1989\" (2014)",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Heckert worked with four coaches, including James \"Jimmy\" Johnson, who was a broadcaster in this sport?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played a part in both Give My Regards to Broad Street and Rupert and the Frog Song?",
        "response": "Paul McCartney",
        "source": "hotpot_qa"
    },
    {
        "query": "Randy Jackson has been inducted into both the Louisiana Music Hall of Fame and Long Island Music Hall of Fame. Where is the Long Island Music Hall of Fame located?",
        "response": "Melville, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Time Out's 100 best British films was topped by a film adapted from a short story by which author ?",
        "response": "Daphne du Maurier",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Orangina and Mountain Dew both carbonated?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The quarterback sacked by Trey Flowers in Super Bowl LI went to what college?",
        "response": "Boston College",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chicago Statement on Biblical Inerrancy a stement on Biblical Imerracy was formulated with an American who was best known for eastblishing what community in Switzerland?",
        "response": "L'Abri community",
        "source": "hotpot_qa"
    },
    {
        "query": "International Animal Rescue, also known as IAR, is an animal welfare non-profit organization based in the United Kingdom, it specializes in comprehensive sterilization and vaccination programs, and which is the removal of an animal's reproductive organ, either all of it or a considerably large part, for stray dogs and cats, particularly in developing countries?",
        "response": "Neutering",
        "source": "hotpot_qa"
    },
    {
        "query": "For how long did the author of STAT: Standing Tall and Talented book series have a career in basketball?",
        "response": "15-year",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the artist of the two studio albums \"Some Time in New York City\" and \"Mind Games\"? John Lennon",
        "response": "John Lennon",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are one of the music group from which Freudian production was derived from? ",
        "response": "Toronto, Ontario",
        "source": "hotpot_qa"
    },
    {
        "query": "Santana Row, an outdoor shopping mall, is located near this upscale indoor shopping mall whose western portion is located in which city?",
        "response": "Santa Clara",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Karnig Sarkissian and Robert Philibosian both American citizens",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football club does this English professional footballer born in 1997 who endorses Nike Hypervenom play for?",
        "response": "Manchester United",
        "source": "hotpot_qa"
    },
    {
        "query": "Stuart Chambers succeed what British businessman as chairman of Anglo American plc from 1 November 2017?",
        "response": "Sir John Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Smith University was founded by Dr. Donald Grunewald, who was president of what college in Dobbs Ferry, New York?",
        "response": "Mercy College",
        "source": "hotpot_qa"
    },
    {
        "query": "How Are You Bread stars a singer who is the leader of which boy group?",
        "response": "EXO",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Sanshui District and Rushan, Shandong connected?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seating capacity of the football stadium located in Bill Kinsley birthplace?",
        "response": "54,074",
        "source": "hotpot_qa"
    },
    {
        "query": "What television thriller anthology did the winner of one Golden Globe, two tony Awards and six Primetime Emmy Awards appear on?",
        "response": "Darkroom",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was released first, Saint Petersburg or Figure It Out?",
        "response": "Figure It Out",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the highest ice hockey league in Austria in which Orli Znojmo participate in?",
        "response": "Austrian Hockey League",
        "source": "hotpot_qa"
    },
    {
        "query": "which  fully accredited, degree-granting art college  was  Agnes Bushell  taught literature and writing",
        "response": "Maine College of Art",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Margarethe von Trotta or Mike Nichols?",
        "response": "Mike Nichols",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: What are Marsh v. Chambers and Planned Parenthood v. Casey known for being?",
        "response": "Supreme Court case",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathy Berberian and Marco Khan are both actors, correct?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more pseudonyms, Robert Ludlum or Clement Greenberg?",
        "response": "Robert Ludlum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Iron Will or The Vanishing Prairie?",
        "response": "The Vanishing Prairie",
        "source": "hotpot_qa"
    },
    {
        "query": "What company did the husband of Brynne Edelsten found?",
        "response": "Allied Medical Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Felice Trojani collaborated with Umberto Nobile on which aircraft that was the first to reach the North Pole?",
        "response": "Norge",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the John Lennon album released in 1973, containg the hit song I know, called?",
        "response": "Mind Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by Usher was released as the lead single on his fourth album, pushing back his originally planned lead single, Burn?",
        "response": "Yeah!",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kumi Lizard is similar to what moniter lizard that was part of a megafaunal assemblage that inhabited southern Australia during the Pleistocene?",
        "response": "Megalania",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Bill Ford's football team nicknamed?",
        "response": "Tigers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following stars Jeff Bridges as a computer programmer: Tron or The Million Dollar Duck?",
        "response": "Tron",
        "source": "hotpot_qa"
    },
    {
        "query": "Which quarterly academic journal was owned by a leading global financial services firm from 2004 to 2013?",
        "response": "Journal of Applied Corporate Finance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tabloid, Star or Trump, was founded in 1974?",
        "response": "Star",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the studio analyst win the Southwest Conference with the Texas A&M football team?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the author of who is best known for his children's book series that was first published in 1963 and helped establish Scholastic as a premier publishing company?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monta Bell and Mack Sennett both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian feminist protest punk rock group includes Nadezhda Andreyevna Tolokonnikova?",
        "response": "Pussy Riot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is the United States Air Force Installation where the 49th Air Transport Squadron was last stationed?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a higher world ranking, Robert Seguso or Venus Williams?",
        "response": "Robert Arthur Seguso",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Dutch-British transnational consumer goods company founded in 1886 by William Hesketh Lever along with his brother James?",
        "response": "Unilever",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American rapper and a member of the group A Tribe Called Quest has a guest appearance in Shaq Diesel",
        "response": "Malik Izaak Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "What rock band formed in New York in 1981 worked with Martin Bisi?",
        "response": "Sonic Youth",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the horror film that stars the same actors as the comedy That One Night?",
        "response": "James Wong",
        "source": "hotpot_qa"
    },
    {
        "query": "The fictional Godfather character Moe Greene is based on a mobster born in what year? ",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1992–93 NBA season was which number season for the Charlotte Hornets in the National Basketball Association, the Hornets selected with Muggsy Bogues?",
        "response": "fifth",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Herbert Ross and Denis Villeneuve from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What English Professional ballroom dancer is a judge on Dancing with the Stars?",
        "response": "Leonard Gordon Goodman",
        "source": "hotpot_qa"
    },
    {
        "query": "WHere was one of the actors from Cry of the Innocent born?",
        "response": "Australian-born",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is both the author of \"A Treatise on the Fundamental Principles of Violin Playing\" as well as the father of Wolfgang Amadeus Mozart?",
        "response": "Leopold Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "OTWGBEATS is better known for his work with the American rapper from what city?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Which goes by the common name of Plumbago: Dillenia or Ceratostigma?",
        "response": "Ceratostigma",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathryn Merteuil's rold as Kathryn serves as the primary antagonist in a film released in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "The Knovíz culture was part of which central European Bronze Age culture?",
        "response": "Urnfield culture",
        "source": "hotpot_qa"
    },
    {
        "query": "Which computer was released first, the Orao or the Mattel Aquarius?",
        "response": "Aquarius",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Cornish made his directorial debut in the comedy film that starred whom?",
        "response": "John Boyega, Nick Frost, Jodie Whittaker and Luke Treadaway",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1932 horror film based on the book written by Nina Wilcox Putnam?",
        "response": "Karl Freund",
        "source": "hotpot_qa"
    },
    {
        "query": "This Canadian actor won a Best Picture award for the film River's Edge with which award ceremony?",
        "response": "1986 Independent Spirit Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "who published the  American comic that features in Batman: Fear Itself",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Emily Vance Gordon is best known for her role in what American comedy directed by Michael Showalter?",
        "response": "The Big Sick",
        "source": "hotpot_qa"
    },
    {
        "query": "What types of films are both Station 58 and Bougainville – Our Island Our Fight?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Yasuzo Masumura and Pitof hail from the same country and professional career?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What city that was a leading member of the Hanseatic League is an independent city in North Rhine-Westphalia?",
        "response": "Dortmund",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Garrett is the Athletic Director at what comprehensive university in Los Angeles?",
        "response": "California State University, Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "David Hawker is a member of the Australian House of Representatives from the major party founded in what year?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": "The quarterback successors to Cody Hodges include a 2011 undrafted free agent to the St. Louis Rams and what other person?",
        "response": "Seth Doege",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote more novels, Sandra Dallas or Juan Rulfo?",
        "response": "Sandra Dallas",
        "source": "hotpot_qa"
    },
    {
        "query": "The Riot Club is a 2014 British drama film directed by Lone Scherfig and written by Laura Wade, the Riot Club was often described as a thinly veiled version of which exclusive but unofficial all-male students' dining club based in Oxford, called?",
        "response": "Bullingdon Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of category does Acantholimon and Podranea have in common?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the english name of Émile Verdets editorial?",
        "response": "Annals of Chemistry and of Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the composer of the studio album \"on the rock\" and a Grammy award winner?",
        "response": "Andrés Calamaro",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kathy Jordan and Martin Damm both former tennis players ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the star of the upcoming comedy film Night School ?",
        "response": "Darnell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed 3D scrolling shooter and third-person shooter video game developed that was promoted by an American-based provider of home movie and video game rental services?",
        "response": "Namco",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Proud Twins is a singer, songwriter, actor and entrepreneur?",
        "response": "Nicholas Tse",
        "source": "hotpot_qa"
    },
    {
        "query": "The first university that football caoch Josepth Dalry \"Swede\" Alexander coached at would later become accreddited by the American Bar Association. What is the name of this university?",
        "response": "Lincoln Memorial University",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathy Inglese is the former head coach of the women's basketball team at a university whose main campus is located in the village of Kingston in southern Rhode Island, and which also includes the Feinstein Campus in what city?",
        "response": "Providence",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting of Death's Domain?",
        "response": "a flat disc balanced on the backs of four elephants which in turn stand on the back of a giant turtle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed of dog is extinct, the Bracco Italiano or the St. John's water dog?",
        "response": "St. John's water dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, The Life of Birds or Genghis Blues?",
        "response": "The Life of Birds",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Olve Eikemo or Shagrath born first?",
        "response": "Stian Thoresen (born 18 November 1970)",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Multhopp worked at the Focke-Wulf Flugzeugbau AG with a designer born in which year ?",
        "response": "1898",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the older sister of the Indian actress that starred with Sharan, Vimala Raman and P. Ravi Shankar in the film \"Raja Rajendra\"?",
        "response": "Tanushree Dutta",
        "source": "hotpot_qa"
    },
    {
        "query": "Musicality features covers of songs from a jukebox musical written by who?",
        "response": "Catherine Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Gelatine was an airship piloted on September 19, 1905 by a pioneer American aviator and what?",
        "response": "barnstormer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bell OH-58 Kiowa was based on which model of two-bladed helicopters made in Quebec?",
        "response": "Bell 206",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American  former schoolteacher born who is a subject in a true crime book of Gregg Olsen?",
        "response": "January 30, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Like the Baltoro Kangri, K12 is present in what range of mountains?",
        "response": "Karakoram mountain range",
        "source": "hotpot_qa"
    },
    {
        "query": "C. Scott Vanderhoef was the running mate of the minority leader who is now part of which New York district?",
        "response": "19 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the soccer player who was the head coach of the under-21 football team that has been playing since 1976?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the South Korean film for which Choo Ja-hyun was best known? ",
        "response": "Jeon Yun-su",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Florian Gallenberger and Jackie Chan both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of \"All the Boys Love Mandy Lane\" appeared in a superhero film directed by this director.",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "Al-Sharki was born and raised in Sana'a, a town in old Sanaa, Sana'a, also spelled Sanaa or Sana, is the largest city in which country, and the centre of Sana'a Governorate?",
        "response": "Yemen",
        "source": "hotpot_qa"
    },
    {
        "query": "In \"The Simpsons\"' episode \"I Married Marge,\" Marge thinks she may be pregnant and visits which doctor whose voice is provided by Harry Shearer?",
        "response": "Dr. Hibbert",
        "source": "hotpot_qa"
    },
    {
        "query": "The  Australian pop singer Lee Harding is from what outer-suburb of Melbourne in Victoria, Australia?",
        "response": "Frankston, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle of the Hundred Years' War is the subject of Leslie Barringer's historical novel?",
        "response": "The Battle of Agincourt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which influential composer of piano music was active later in the 20th century: Dmitri Shostakovich or Philip Glass?",
        "response": "Philip Morris Glass",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who researched \"Underground\"?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release date of this 2005 American science fiction-thriller film that featured Mitzi Martin?",
        "response": "July 22, 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays the drums on the band that released \"Barrel of Batteries\" in 2008?",
        "response": "Charlie Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film did Shirley Henderson appear with Tilda Swinton",
        "response": "Okja",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Lewisia and Heliconia connected?",
        "response": "plant",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the relation between Cethlenn (Old Irish) and the king of named Fomorians who is a interpreted as a god?",
        "response": "wife",
        "source": "hotpot_qa"
    },
    {
        "query": "In which century was this colonial province established where Anthony Colve served as Dutch naval captain and the Director-General?",
        "response": "17th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Argentine author, who wrote a novel that was adapted into a broadway musical in 1993 with music by John Kander and Fred Ebb?",
        "response": "December 28, 1932",
        "source": "hotpot_qa"
    },
    {
        "query": "Princess Sophie of Bavaria's eldest son died in which year ?",
        "response": "1916",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who starred in films like \"Splash\" and \"Forrest Gump\" produced which film that also stars Colin Hanks?",
        "response": "The Great Buck Howard",
        "source": "hotpot_qa"
    },
    {
        "query": "What bowl game featured a team coached by Mike Leach in 2012?",
        "response": "Meineke Car Care Bowl of Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reigned for 50 months as lineal champion  and fought Richard Williams?",
        "response": "Sergio Gabriel Martínez",
        "source": "hotpot_qa"
    },
    {
        "query": "The Westinghouse J34 is essentially an enlarged version of a turbojet engine that was the first American-designed turbojet to run, and only the second axial-flow turbojet to run outside of what country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was Hunter Greene drafted into Major League Baseball?",
        "response": "June 12, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Rob Cavallo produced My Chemical Romance album, which included the song \"I Don't Lovee You\"?",
        "response": "The Black Parade",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Beaulieu Mine or the McIntyre Mines yield gold and copper?",
        "response": "The McIntyre also yielded a considerable amount of copper",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Helmut Käutner and Hou Hsiao-hsien from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The movie that featured Nooksack Falls in a hunting scene is set in what Pennsylvania town?",
        "response": "Clairton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the retired professional basketball player and businessman who came out of his retirement and returned to play for the Blazers ",
        "response": "Arvydas Romas Sabonis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Italian bolt-action, magazine-fed, repeating military rifle that Lee Harvey Oswald used to assassinate U.S. President John F. Kennedy?",
        "response": "Carcano",
        "source": "hotpot_qa"
    },
    {
        "query": "The mint julep is a mixed alcoholic drink, or cocktail, consisting primarily of Bourbon whiskey, a whiskey of which nationality, a barrel-aged distilled spirit made primarily from corn?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of one of the Pendle witches?",
        "response": "Elizabeth Southerns",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the magazine that Wallace Hester illustrate for end publication?",
        "response": "1914",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jonas Mekas and Marcel Duchamp both filmmakers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "For what NBC sketch comedy is the creator of 30 Rock best known?",
        "response": "\"Saturday Night Live\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Ode to Billy Joe is a 1976 film with a screenplay by Herman Raucher, inspired by the 1967 hit song by Bobbie Gentry, which 1967 song written and recorded by Bobbie Gentry, a singer-songwriter from Chickasaw County, Mississippi?",
        "response": "Ode to Billie Joe",
        "source": "hotpot_qa"
    },
    {
        "query": "Do GO and Print cover the same topic areas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1995 Australian-American comedy-drama film, features the voice of American voice actress, Christine Cavanaugh?",
        "response": "Babe",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 movie did Darren Aronofsky and Matthew Libatique work together to film?",
        "response": "Mother!",
        "source": "hotpot_qa"
    },
    {
        "query": "The starring actress of the film \"Clandestine Childhood\", was included in what list by \"Esquire\" magazine?",
        "response": "The Sexiest Woman Alive Atlas",
        "source": "hotpot_qa"
    },
    {
        "query": "Cabañeros National Park and Teide National Park are both located where?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Suits connected with Gabriel Macht? ",
        "response": "USA Network series \"Suits\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this Austrian business magnate, engineer and executive whom Hans Dieter Pötsch succeeded as chairman of the supervisory board of Volkswagen born?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "which town in Rensselaer County, New York, United States did  Valley Falls, New York village lies on the boundary",
        "response": "Schaghticoke",
        "source": "hotpot_qa"
    },
    {
        "query": "Maggie was a series that starred the actress who had a minor role in what 1996 comedy?",
        "response": "Multiplicity",
        "source": "hotpot_qa"
    },
    {
        "query": "In which German federal state was did Walter Schlesinger born?",
        "response": "Hesse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist started recording/performing earlier David Donato or Moya Brennan?",
        "response": "Moya Brennan",
        "source": "hotpot_qa"
    },
    {
        "query": "During the winter of 1776-1777, Simonds' Regiment of Militia was at a fort located in which US state ?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "This aircraft carrier served as a recovery ship for this flight which circled the earth how many times?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Heinz Engl specialized in which Humanities are at the University of Vienna?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "1200 Micrograms (also known as 1200 Mics, or 1300 Mics) is a psychedelic trance act from Ibiza, one of the members is which Australian-born musician, and the owner of the United Kingdom record label Tip World?",
        "response": "Raja Ram",
        "source": "hotpot_qa"
    },
    {
        "query": "What Michigan city was the band that released \"Live at Bell's\" founded in?",
        "response": "Kalamazoo",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the stadium at which 1964 Georgia Tech Yellow Jackets football team played their home game located? ",
        "response": "North Avenue at Techwood Drive",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the concert venue which hosted the first US performance of \"Libuše\" located?",
        "response": "Midtown Manhattan in New York City,",
        "source": "hotpot_qa"
    },
    {
        "query": "Which theatrical producer co-created both \"Sunny\" and \"Oklahoma!\"",
        "response": "Oscar Hammerstein II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the President who owned both James Heming and Sarah \"Sally\" Hemings?",
        "response": "President Thomas Jefferson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Gladys Louise Smith's husband, often confused with Charles R. Rogers?",
        "response": "Charles \"Buddy\" Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "What country music duo's song \"Country Line\" earned gold certification?",
        "response": "the single was certified Gold by Music Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is in the Hebei province, Fuxin or Langfang?",
        "response": "Langfang",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alcoholic beverage company sponsored the Martini International professional golf tournament?",
        "response": "Martini & Rossi",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country can both Oplismenus and Aerangis.be found to be growing?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What Golden State Warriors basketball player was sent to the All-Star Game and won NBA Defensive Player of the Year?",
        "response": "Draymond Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Paul Baloff and Nick Hexum American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Im Not Ashamed is a biographical drama film, based on what massacre involving two American spree killers Eric Harris and Dylan Klebold, who killed 13 people and wounded 24 others? ",
        "response": "1999 Columbine High School massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "What Bulgarian Airline took over Hemus Air?",
        "response": "Bulgaria Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters where Hebert O. Fisher was an aviation executive? ",
        "response": "4 World Trade Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Dana White, a former driver for Moy Racing, is now the current president of what mixed martial arts organization?",
        "response": "Ultimate Fighting Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "In what province is the airport that includes a hub for a low-cost alternative Candian Airline founded in 1996 located?",
        "response": "British Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Die Kreuzen and Odds from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine, which was headquartered in San Francisco, California, was Richard Dalton a featured columnist for?",
        "response": "InformationWeek",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the microbiologist who first developed the MMR vaccine born?",
        "response": "1919",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a correspondent for NBC, Janet Shamlian or Mia Tyler?",
        "response": "Janet Shamlian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport's code is CMH, John Glenn Columbus International Airport or University Park Airport?",
        "response": "John Glenn Columbus International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the girl group Miss A under JYP Entertainment also stars in the South Korean television drama While You Were Sleeping?",
        "response": "Bae Suzy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American former professional basketball player was Wizards high school star",
        "response": "Kwame Hasani Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "What British Singer Songwriter wrote a song called Save Me Save Me?",
        "response": "Andy Gibb",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another name for the Okahoma Memorial Stadium?",
        "response": "Gaylord Family - Oklahoma Memorial Stadium, also known as Owen Field or The Palace on the Prairie",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Emory University and The University of Oklahoma both from the same region of the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Master of Ceremonies, Bert Newton or Michael Joseph Farrell, Jr?",
        "response": "Bert Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "DJ Maphorisa has worked with the singer-songwriter and producer of what nationality?",
        "response": "Nigerian",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the American baseball player who was a outfielder and Baseman also nicknamed Stan the Man?",
        "response": "Stan Musial",
        "source": "hotpot_qa"
    },
    {
        "query": "Sunderland Association Football Club is an English professional football club that plays in a championship referred to as the Sky Bet Championship for what reasons?",
        "response": "sponsorship reasons",
        "source": "hotpot_qa"
    },
    {
        "query": "The Colts' first ever draft pick was a halfback who won the Heisman Trophy in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Yannis Philippakis or Joel Pott?",
        "response": "Joel Laslett Pott",
        "source": "hotpot_qa"
    },
    {
        "query": "The double Irish arrangement is a tax strategy, that some multinational corporations used to lower their corporate tax liability, it relies on the fact that Irish tax law does not include transfer pricing rules as does the United States and those of many other jurisdictions, the standard rate of corporation tax is among the lowest in the world at 12.5%, in Ireland there is an income tax, a value added tax (VAT), and various other taxes, is called?",
        "response": "Irish tax law",
        "source": "hotpot_qa"
    },
    {
        "query": "Jules Halfant designed a record for which American folk singer-songwriter?",
        "response": "Tom Paxton",
        "source": "hotpot_qa"
    },
    {
        "query": "During World War II the Chairman of the Red Cross Aid to Russia Fund was a Baroness and wife of who?",
        "response": "Sir Winston Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "What German composer wrote Happy End? ",
        "response": "Kurt Weill",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cullasaja River is a short river that flows from Lake Sequoyah which is fed by Mirror Lake and other creeks and streams originating on the western side of the demarcation of two watersheds of what?",
        "response": "the Atlantic Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2008 British-American black comedy crime film in which Mark Donovan was a actor?",
        "response": "Martin McDonagh",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the editorial stance of the newspaper that featured Paul Rimstead as a page 5 columnist?",
        "response": "populist conservative",
        "source": "hotpot_qa"
    },
    {
        "query": "What programming block are the two shows that Kim Seung-hyun has appeared on?",
        "response": "Sunday Night",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Choisya and Oenothera endemic to the Americas ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which river runs through the Shenandoah National Park and is a tributary of the Potomac River?",
        "response": "Shenandoah River",
        "source": "hotpot_qa"
    },
    {
        "query": "Bret Stafford played what position on a team that competed in the NCAA Division 1 Football Bowl Subdivision?",
        "response": "quarterback",
        "source": "hotpot_qa"
    },
    {
        "query": "WUMM is operated by students of what university campus that has an enrollment of approximately 1,200 students?",
        "response": "The University of Maine at Machias",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Phil Joanou or Tod Browning?",
        "response": "Tod Browning",
        "source": "hotpot_qa"
    },
    {
        "query": "Which newspaper is located in the city known as the \"nest of snakes\"?",
        "response": "Novedades",
        "source": "hotpot_qa"
    },
    {
        "query": "Bethany Beardslee has performed classical music by which Austrian composer and theorist?",
        "response": "Arnold Franz Walter Schoenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Kirsten Dunst was nominated for a Golden Globe Award for Best Supporting Actress for her role in Interview with the Vampire, which was based on the 1976 novel by the same name, and written by who?",
        "response": "Anne Rice",
        "source": "hotpot_qa"
    },
    {
        "query": "What Tony Award winner directed and co-produced Six by Sondheim?",
        "response": "James Elliot Lapine",
        "source": "hotpot_qa"
    },
    {
        "query": "Vice-Admiral Frederick Spencer, 4th Earl Spencer was made a Knight of the Garter, an order of chivalry founded by whom?",
        "response": "Edward III",
        "source": "hotpot_qa"
    },
    {
        "query": "István Javorek is a retired head strength and conditioning coach at college located in what city and state?",
        "response": "Overland Park, Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the man who finished second in the 1985 British Grand Prix?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Thomas Schlamme and Hobart Henley share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "how is University of Minnesota and Georgia Institute of Technology connected?",
        "response": "research",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both James Whale and Jon Paul Puno?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Holger Klose achieve in the 8th largest city in Germany?",
        "response": "His personal best throw",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of films are both Outfoxed and Transparent?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "She's a Woman was credited to the songwriting partnership that published approximately how many songs between 1962 and 1969?",
        "response": "180",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a small network appliance and entertainment device that serves as a the media player for the iTunes Store?",
        "response": "Apple TV",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NBC sitcom is star of the second and final season of ''\" now playing the afterlife \"architect\" Michael?",
        "response": "\"The Good Place.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the company that Harry Crook had worked as a sales representative for?",
        "response": "Alfred Fuller",
        "source": "hotpot_qa"
    },
    {
        "query": "The Church of St Peter in Pertenhall, Bedfordshire, England was added to this register on 13 July 1964.",
        "response": "Statutory List of Buildings of Special Architectural or Historic Interest",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the campaign of political  repression that Mikhail Demichev was arrested during occur?",
        "response": "from 1936 to 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "American duo Daryl Hall & John Oates' song peaked at number 2 on the \"Billboard\" Hot 100 behind which song from Paul McCartney's album, \"Pipes of Peace\"?",
        "response": "\"Say Say Say\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of home entertainment media are Tonka and Meet the Robinsons?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What part of William Shakespeare's career did he write the story that is similar to the story in \"Kuch Tum Kaho Kuch Hum Kahein\"?",
        "response": "early in his career",
        "source": "hotpot_qa"
    },
    {
        "query": "Culcairn is a town in the south-east Riverina region of New South Wales, located in the Greater Hume Shire Council local government area on the Olympic Highway between Albury and Wagga Wagga, a major regional city in the Riverina region of New South Wales, in which country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "How many acres is the state park located closest to Oak Beach Inn?",
        "response": "340",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Valley International Airport and Westerly State Airport airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Polish professional footballer and captain of the Poland national team endorses the Nike Hypervenom football boot?",
        "response": "Robert Lewandowski",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1965 500cc United States Grand Prix was held at a racetrack opened in what year?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What was this major international multi-sport event, with the opening ceremonies taking place on 27 July, and in which the South African field hockey player Bernadette Coston competed for the outh Africa women's national field hockey team?",
        "response": "2012 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "The Strictly the BBC television show featuring the Australian Jason Gilkison is based on what professional partner sport?",
        "response": "ballroom dance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Japanese entertainment company released the game International Superstar Soccer 2?",
        "response": "Konami",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the battle that Merzifonlu Kara Mustafa Pasha participated in take place?",
        "response": "Kahlenberg Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Celastrus and Thunbergia native to the Americas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company produced the 2017 film in which Chanon Santinatornkul starred ?",
        "response": "Jor Kwang Films",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Henry James and Charlotte Perkins Gilman both american writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "On which stock exchange is listed the global business process management, services and IT corporation Genpact, with 77,000 employees in 20 countries and have a campus close to the Singapore Township in India?",
        "response": "New York Stock Exchange",
        "source": "hotpot_qa"
    },
    {
        "query": " Muir Site is located in this region of Kentucky which makes up what part of the state?",
        "response": "northern",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Xavier Malisse and Jana Novotná from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "527 Euryanthe is a minor planet orbiting the Sun, it was discovered in 1904 by Max Wolf and named after the heroine of an opera by which German composer, conductor, pianist, guitarist and critic, and was one of the first significant composers of the Romantic school?",
        "response": "Carl Maria von Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the songwriter for \"The Lion and the Cobra\" and also recorded at The Lodge?",
        "response": "Sinéad O'Connor",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998 Miami Redskins football team played in which Division I athletic conference?",
        "response": "Mid-American Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer produced The Downward Spiral?",
        "response": "Trent Reznor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released first, One Magic Christmas or King of the Grizzlies?",
        "response": "King of the Grizzlies",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier Dario Argento or W. S. Van Dyke?",
        "response": "Dario Argento",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the stadium at which 2006 Commonwealth Games opening ceremony was held located? ",
        "response": "Yarra Park, Melbourne, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "The tv series \"Our Zoo\" is about the creation of a zoo opened in what year?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who is starred in the film \"Meteor\" with Sean Connery born?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Like the Roman: The Life of Enoch Powell is a book whose title is taken from when British Member of Parliament Enoch Powell addressed a meeting of the Conservative Political Centre where?",
        "response": "Birmingham, UK",
        "source": "hotpot_qa"
    },
    {
        "query": "Xi'an International Studies University (XISU), is a public Chinese university, located in the northwestern city of Xi'an, China's ancient capital well known for the Terracotta Warriors, the Terracotta Army, is a collection of terracotta sculptures, depicting the armies of Qin Shi Huang, the first Emperor of which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": " Which species, Cardwellia or Ochagavia, is native to South America?",
        "response": "Ochagavia",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Christophe Dupont is a French film director whose notable works include a French-German fantasy drama film that competed for what at the 2012 Cannes Film Festival?",
        "response": "Palme d'Or",
        "source": "hotpot_qa"
    },
    {
        "query": "Family Jewels is a compilation DVD by the hard rock band AC/DC, the second disc contains material from the era (1980–1991) of which English singer and songwriter? ",
        "response": "Brian Francis Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release year of this American comedy-drama film directed by Jason Reitman, working with Eric Wesley Steelberg, cinematographer?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor Momsen and Craig Mabbitt from Escape the Fate have what in common?",
        "response": "lead singer",
        "source": "hotpot_qa"
    },
    {
        "query": "The university that houses the American Museum of Asmat Art was founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "The younger brother, who became king, of Princess Mafalda of Savoy reigned for how many days?",
        "response": "34 days",
        "source": "hotpot_qa"
    },
    {
        "query": "Moominpappa at Sea is a loose reference to a novel written by what American author?",
        "response": "Ernest Hemingway",
        "source": "hotpot_qa"
    },
    {
        "query": "Kung Fu Panda is a 2008 American computer-animated action comedy starring the voice of a Hong Kong martial artist who is known for what kind of fighting style?",
        "response": "acrobatic",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Hyun-seok, is a South Korean film director and screenwriter, she wrote and directed C'est si bon, a South Korean musical drama film, released on February 5, 2015?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did the Senator run for president, that Mary Alice Mapes reported as having an unacknowledged biracial daughter ?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "What recipient of Karnataka State Film Award had worked with a composer popular for his foot tapping musical scores?",
        "response": "Anuradha Bhat",
        "source": "hotpot_qa"
    },
    {
        "query": "Do writers Gillian Bradshaw and Theodore Dreiser share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Browning Version starred the actress who won an Emmy in what year?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "When I Was Born for the 7th Time features the hit single that was remixed by whom?",
        "response": "Norman Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which region has a larger population, Guangshui or Lüshunkou District",
        "response": "Lüshunkou District",
        "source": "hotpot_qa"
    },
    {
        "query": "Rapper Max B. had a falling out with the founder of ByrdGang Records, who also directed music videos under what pseudonym?",
        "response": "CAPO",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the younger sister of Tanushree Dutta appear in a Kannada comedy film directed by Pon Kumaran?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "John Hansen was a Danish footballer who played which position nearest to the opposing team's goal, and are therefore most responsible for scoring goals?",
        "response": "forward",
        "source": "hotpot_qa"
    },
    {
        "query": "The Silverdome refers to the stadium that opened in what year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voiced the character Barney Gumble in \"The Simpsons Christmas Special?\"",
        "response": "Dan Castellaneta",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the actor who starred in movies like Flyboys, Milk, Pineapple Express and Rise of the Planet of the Apes?",
        "response": "April 19, 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What international Jewish non-governmental organization based in the United States did Frank Zappa deny an apology in 1979(?",
        "response": "The Anti-Defamation League",
        "source": "hotpot_qa"
    },
    {
        "query": "In which record label did the debut studio album of a drummer who replaced Brian Schofield was released?",
        "response": "Geffen",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of second extended play by the artists of the mini-abum Code#01?",
        "response": "Code#02 Pretty Pretty",
        "source": "hotpot_qa"
    },
    {
        "query": "Noor Zehra plays a variation of a stringed instrument that was traditionally used to play what kind of music?",
        "response": "Hindustani music",
        "source": "hotpot_qa"
    },
    {
        "query": "Grodon Willis worked as a cinematographer for which romantic film that stars Woody Allen and Diane Keaton and was produced by Charles Joffe?",
        "response": "Annie Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Pajottenland has historically provided beers that include are fermented through yeasts native to what valley?",
        "response": "Zenne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which famous comic book movie universe features the voice of an Irish-American actor who previously did work on \"Agents of S.H.I.E.L.D\"?",
        "response": "DC",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the stadium where Atlético Madrid home games were held located? ",
        "response": "San Blas-Canillejas district",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the coach of the 1986 Super Bowl champions born?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "The American Writers Association (AWA) was an organization formed in 1946 in opposition to an attempt to introduce a form of trade unionism for authors, its members included writers such as who, she was an American author and journalist, and only had one novel published during her lifetime, the American Civil War-era novel, \"Gone with the Wind\", for which she won the National Book Award for Most Distinguished Novel of 1936?",
        "response": "Margaret Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Saguaro and Schinus both tree-like plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Guster on Ice was recorded at the theatre located at what address in Portland, Maine?",
        "response": "609 Congress Street",
        "source": "hotpot_qa"
    },
    {
        "query": "ishop Gorman High School (also commonly referred to as Gorman High School or BGHS) is a Roman Catholic, private, preparatory school located in Summerlin, Nevada, Summerlin is an affluent planned community in which location of Nevada?",
        "response": "Las Vegas Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which female film director's career spanned more than one film era, Dorothy Arzner or Gurinder Chadha?",
        "response": "Dorothy Emma Arzner (January 3, 1897 – October 1, 1979)",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American film, television and stage actress that starred in The Naughty Flirt born?",
        "response": "August 2, 1905",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Robbie Keane play for after Inter Milan?",
        "response": "Republic of Ireland national team",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the show that Indira Varma plays DS Nina Suresh start broadcasting?",
        "response": "22 September 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is located within the North Coast region and on the Pacific Highway?",
        "response": "Woolgoolga, New South Wales, Australia.",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of magazine is Hakusensha's magazine?",
        "response": "\"shōjo\" manga magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in the northernmost and largest freguesia can we find the Communications Museum?",
        "response": "Macau, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Chas Early is best known for portraying a comedian born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city was the 310th Expeditionary Air Refeuling Flight assigned in 1994?",
        "response": "Plattsburgh, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Which capitol city is also the second largest city in the United States by area?",
        "response": "Juneau",
        "source": "hotpot_qa"
    },
    {
        "query": "How many kilometers of coastline does the land that the Malacoctenus hubbsi is native to have?",
        "response": "approximately 4000",
        "source": "hotpot_qa"
    },
    {
        "query": "What geographical area of England is Leavesden, Hertfordshire located?",
        "response": "southern",
        "source": "hotpot_qa"
    },
    {
        "query": "What series did the author of Teenage Mutant Ninja Turtles co-create with Jim Lawson?",
        "response": "Planet Racers",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Copella juice products and Tizer made purely from fresh fruits?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ca' Pesaro faces what major-water-traffic corridor in Venice, Italy?",
        "response": "Grand Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is this luxury hotel and casino resort in Macau where the winners of 14th IIFA Awards were announced?",
        "response": "39-story",
        "source": "hotpot_qa"
    },
    {
        "query": "An analog board was used in which third model of the Macintosh line?",
        "response": "Macintosh Plus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which superbowl did Scott Green officiate that was between the Carolina Panthers and New England Patriots?",
        "response": "Super Bowl XXXVIII",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American country singer  recorded \"15 Minutes of Shame\"",
        "response": "Kristy Lee Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Wuhai and Yulin, Shaanxi, are located in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"Last Man Standing\" actor also starred in the 2015 American comedy horror film \"Gravy\"?",
        "response": "Molly Ephraim",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Matt and Kim and Jem Welsh musicians?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What form of play does Ouk-Khmer and Sentinels of the Multiverse have in common?",
        "response": "game",
        "source": "hotpot_qa"
    },
    {
        "query": "The single \"Love Can Go to Hell\" from Big Day in a Small Town was nominated for an award which was established in what year?",
        "response": "1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Bob Stoops coached team beat the 2016 Auburn Tigers football team?",
        "response": "2016 Oklahoma Sooners football team",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coached the team that defeated the 2011 team led by Everett Withers to end their season?",
        "response": "Gary Pinkel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Navy facility was next to NAS Quonset Point and is now listedd on the National Register of Historic Places?",
        "response": "Camp Endicott",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many years did Denmark–Norway held colonial possessions in India including the Bungalow on the Beach?",
        "response": "200 years",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game did the author of the e-book \"How to Win at the Sport of Business\" play for charity at Intel Extreme Masters Season X – San Jose?",
        "response": "League of Legends",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Gasland and Staten Island Catapult released in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Greenlight Capital is a hedge fund founded in 1996 by which American investor, hedge fund manager, and philanthropist, born on November 20, 1968?",
        "response": "David M. Einhorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American lobbyist, lawyer and politician was once defeated by Bel Edwards?",
        "response": "David Vitter",
        "source": "hotpot_qa"
    },
    {
        "query": "Luigi Gervasi was nominated for an Academy Award in the category Best Art Direction for a film that came out in which year ?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Manuel Quintas de Almeida, was a lieutenant in the military of São Tomé and Príncipe, a Portuguese-speaking island nation, in which location?",
        "response": "Gulf of Guinea",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miracle at Michigan included a pass that was caught by the player at what position?",
        "response": "wide receiver",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the wide-body twin-engine jet airliner that use the design of Richard Clarkson in its development?",
        "response": "Airbus A300",
        "source": "hotpot_qa"
    },
    {
        "query": "WHO WAS EMINEMS MANAGER WHEN HE RELEASED THE ALBUM THAT WAS GOING TO BE CALLED \"RELAPSE 2\"? ",
        "response": "According to Eminem's manager Paul Rosenberg and music critics, \"Not Afraid\" carries a positive message and depicts Eminem's change in direction from drugs and violence.",
        "source": "hotpot_qa"
    },
    {
        "query": "From what countries are Gauhar Ali and Iftikhar Ahmed from?",
        "response": "Pakistan",
        "source": "hotpot_qa"
    },
    {
        "query": "Christian Gertartsreiter, the subject of the film, Clark Rockefeller was how old when he moved to the United States?",
        "response": "In his late teens",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the footballer who along withOlić, Ribéry, and Schweinsteiger scored when Hayden thrashed Bremen 4-0 in the  2010 DFB-Pokal Final ? ",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the host of Loveline after the show was rebooted?",
        "response": "October 21, 1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Cute Poison are words on the tattoo by which British-American actor and star of Prison Break?",
        "response": "Wentworth Earl Miller III",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Enlglish film director and producer that was born in 1937 that is working on turning John Pearson's novel into a film? ",
        "response": "Ridley Scott",
        "source": "hotpot_qa"
    },
    {
        "query": "Cleopatra Mathis, is an American poet who since 1982 has been the Frederick Sessions Beebe Professor in the English department at Dartmouth College, and is a faculty member at The Frost Place, a museum and nonprofit educational center for poetry located at Robert Frost's former home in Franconia, New Hampshire, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What plane developed for the United States Air Force crashed in 2010 at Elmendorf Air Force Base in Alaska?",
        "response": "Boeing C-17 Globemaster III",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Family Health founded in the same country that the phrase Horn OK Please is commonly found in?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What war did the owner of the Indianapolis 500 Speedway who jeopardized the 1946 AAA Championship Car season fight in? ",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Harold C. Case serve as president before being named acting president of a private liberal arts college in California?",
        "response": "Boston University",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ingaevones and the Istvaeones tribal groups were what kind of group?",
        "response": "Germanic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is rapper Kendrick Lamar, who has his albums produced by Nez & Rio, from?",
        "response": "Compton, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Disneytown is a shopping, dining, and entertainment complex at Shanghai Disney, that is the equivalent of Ikspiari at what theme park resort located in Urayasu, Chiba, Japan?",
        "response": "Tokyo Disney Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Nickelodeon shown did Todd Talbot star as the role of Matt Walker?",
        "response": "Hillside",
        "source": "hotpot_qa"
    },
    {
        "query": "Which world war did Ronald Wallens participate in?",
        "response": "the Second World War",
        "source": "hotpot_qa"
    },
    {
        "query": "Innervision is a song from the studio album released on what date?",
        "response": "November 26, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernhard Stavenhagen and Franz Liszt, share which occupations?",
        "response": "composer and conductor",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released an album on August 15, 2017 and is from Ronkonkoma, New York?",
        "response": "Lil Peep",
        "source": "hotpot_qa"
    },
    {
        "query": "What even aired on TBS in Japan and HDNet in North America with the official commentator being previously known simply as Nozomi during her fashion modeling career?",
        "response": "Dynamite!! 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Watters became the senior coach of the St Kilda Football Club in what year?",
        "response": "2012 to 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Which private, nonsectarian institution has a famous artist featured in major museum solo shows?",
        "response": "Pratt Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "Fred: The Movie included the professional wrestler and actor currently signed to what wrestling company?",
        "response": "WWE",
        "source": "hotpot_qa"
    },
    {
        "query": "Artist FYÜTCH changed his stage name from Future to avoid confusion with a rapper from which state?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first military aviation unit to use an unpowered precision guided munition in a war that involved more than 100 million people from over 30 countries?",
        "response": "Luftwaffe",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the starting quarterback for Penn State Nittany Lions football team who resulted in Terrelle Pryor being benched?",
        "response": "Matt McGloin",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Rhys Meyers, the actor of Tangled, was the face model of which brand?",
        "response": "Hugo Boss",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Thee I Sing: A Letter to My Daughters is a children's book by former United States President Barack Obama, the stories of thirteen Americans are told in the book, including Jackie Robinson, who was an American professional baseball second baseman who became the first African American, to play in which organization?",
        "response": "Major League Baseball (MLB)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sister of Margarita \"Peggy\" Schuyler Van Rensselaer is sometimes called Betsey?",
        "response": "Elizabeth Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "The American Senator from Maryland is in what political party?",
        "response": "Democratic Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Weirdmageddon 3: Take Back The Falls was the series finale of the television program produced by what company?",
        "response": "Disney Television Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "François Roland Truffaut, was a French film director, screenwriter, producer, actor, and film critic, as well as one of the founders of the French New Wave, he also directed such other classics as Day for Night, a French film directed by François Truffaut, released in what year?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": "The title of the Ghosts film is a reference to what Cantonese slang term that is used in Cantonese to refer to Westerners, and applies to European ethnicities in its unmodified form.",
        "response": "Gweilo",
        "source": "hotpot_qa"
    },
    {
        "query": "To which college is the school that Himanshu Roy is an alumni of affiliated with?",
        "response": "University of Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of the Darkness was a film about a serial killer known as what?",
        "response": "Son of Sam and the .44 Caliber Killer",
        "source": "hotpot_qa"
    },
    {
        "query": "Anne Rose Brooks was born in what hamlet and census-designated place, that is located near the North Shore of Long Island in the town of Oyster Bay, in Nassau County, New York? ",
        "response": "Plainview",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do Jan Kodeš and Pablo Cuevas play?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession do both Bob Woodward and Stanley Kunitz have?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the far right French political movement, whose name was given to a journal, and who went on to influence Acción Española, a Spanish cultural association active during the Second Spanish Republic?",
        "response": "Action Française",
        "source": "hotpot_qa"
    },
    {
        "query": "Sands Macao is a hotel that is operated by which company based in Paradise, Nevada?",
        "response": "Las Vegas Sands",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reigned over Duchy of Saxe-Coburg and Gotha from 1844 to his death, and was married to Princess Alexandrine of Badin?",
        "response": "Ernest II",
        "source": "hotpot_qa"
    },
    {
        "query": "The album on which \"If You See Her, Say Hello\" is a song on was released on what date?",
        "response": "January 20, 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pittsburgh Maulers' most prominent player picked during the 1984 USFL draft was born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county of Maine is the town in which the West Lebanon Historic District is located?",
        "response": "York County",
        "source": "hotpot_qa"
    },
    {
        "query": "Are All Time Low and The Raconteurs both American bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Born March 1, 1966 who directed a film written by Chris Terrio and Joss Whedon",
        "response": "Zack Snyder",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the airing date of this American medical-drama television series, developed by David Shore that is produced by 3AD, run by Daniel Dae Kim?",
        "response": "September 25, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "When will Flicker, created by a member of One Direction, be released?",
        "response": "October 20, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is closer to Mexico, Lake Charles Regional Airport or George Bush Intercontinental Airport?",
        "response": "George Bush Intercontinental Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which station airs The Shareef Show Mubarak Ho hosted by Umer Shareef?",
        "response": "Geo TV",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is the company headquartered where Walter van de Vijver was the head of exploration and production until 2004?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "The village of Amissano is where an all-male academic institution was founded in what year?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "Günter Reich interpreted the works of Schoenberg with which French composer?",
        "response": "Pierre Louis Joseph Boulez CBE",
        "source": "hotpot_qa"
    },
    {
        "query": "Leader II is a 1991 studio album by a glam rock singer who sold over how many records?",
        "response": "20 million",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor who appeared in The Bushido Blade born  ",
        "response": "January 17, 1931",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the animation studio which produces the television series that takes place at a school dubbed the \"Worst College in America\"?",
        "response": "Titmouse, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the young U.S. FBI trainee who appears in the novel \"Hannibal\" by Thomas Harris?",
        "response": "Clarice Starling",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both William C. deMille and Andrew Stanton?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What author of Isaac Asimov's Robot City : Cyborg was inspired by Hugo award winner Isaac Asimov's Robot nad Foundation novels?",
        "response": "William F. Wu.",
        "source": "hotpot_qa"
    },
    {
        "query": "What Maeken Trance Project song rendition is sung in Romanian?",
        "response": "Dragostea Din Tei.",
        "source": "hotpot_qa"
    },
    {
        "query": "Chadwick Lee \"Chad\" Bradford a former MLB pitcher, was in which Michael Lewis book?",
        "response": "Moneyball",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American character actor who starred on the television series \"Stargate SG-1\" (1997–2007) and appeared in \"Episode 8\" of \"Twin Peaks\" as a guest star?",
        "response": "Don S. Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was picked last in the NFL draft of 2017 and named Mr. Irrelevant?",
        "response": "Chad Patrick Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine has a wider distribution, Discovery Girls or GO?",
        "response": "Discovery Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a film about a young engaged couple on a sea cruise, with the woman being implicated in the death of her former lover, and also became an American citizen in 1942?",
        "response": "Cary Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "Port Island is an artificial island in a city in japan that is located on the southern side of the main island of Honshu, and is about 30 km from what city?",
        "response": "Osaka",
        "source": "hotpot_qa"
    },
    {
        "query": "The professional ice hockey league that the Peoria Rivermen are part of is based in what state?",
        "response": "North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "What Byrds member served as a guest musician on Rock Salt & Nails",
        "response": "Gene Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do Shane Dowrich and Marlon Samuels both play?",
        "response": "cricket",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the first movie that Garry Elmendorf worked on take place in?",
        "response": "Clairton, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Kappa Mikey and Edgar & Ellen are both shows that play on what network?",
        "response": "Nicktoons",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the producer of Holiday Showdown?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": " Tinker Owens was the younger brother of what running back from the 1970s?",
        "response": "Loren Everett \"Steve\" Owens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Badmaash Company actress won a Filmfare Award?",
        "response": "Anushka Sharma",
        "source": "hotpot_qa"
    },
    {
        "query": " Are Phil Mogg and Dave Peters musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nangpai Gosum and Noshaq in the same mountain range?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current president of the umbrella organization to which all journalists in Ghana belong and to which Gifty Afenyi-Dadzie was the longest serving president?",
        "response": "Mr Affail Monney",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lyricist and composer created the music for the 2013 Bengali film Holud Pakhir Dana?",
        "response": "Surojit Chatterjee",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first official single on Chris Brown's album that is scheduled to release on October 31, 2017?",
        "response": "Party",
        "source": "hotpot_qa"
    },
    {
        "query": " The 1974 Super Outbreak was the second-largest tornado outbreak on record for a single 24-hour period, just behind an outbreak with how many tornadoes confirmed?",
        "response": "362",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1599 play was remade into An Honourable Murder?",
        "response": "Honourable Murder",
        "source": "hotpot_qa"
    },
    {
        "query": "Are tennis players Corina Morariu and Mats Wilander from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the licensed-built version of the American Northrop F-5 Freedom Fighter that the military aviation branch of the Netherlands Armed Forces used?",
        "response": "the NF-5",
        "source": "hotpot_qa"
    },
    {
        "query": "What name did Dennis Cole go by in the 718 studio album by Theodore Unit?",
        "response": "Ghostface Killah",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the fourth son of the lord of the Seventeen Provinces of the Netherlands in 1555?",
        "response": "Diego Félix of Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "After her husband died, what woman is known for her contribution to the completion of a bridge that connects the boroughs of Manhattan and Brooklyn?",
        "response": "Emily Warren Roebling",
        "source": "hotpot_qa"
    },
    {
        "query": "Island in the Sun is a song on which band's quickest-selling album?",
        "response": "Weezer",
        "source": "hotpot_qa"
    },
    {
        "query": "Korn released a compilation album on May 9, 2006, which features a hidden track, from the soundtrack for the 1997 American slasher film written by who?",
        "response": "Kevin Williamson",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Mailer starred in Jean-Luc Godard's adaptation of which play featuring the character Lear, Cordelia and Edgar?",
        "response": "William Shakespeare play \"King Lear\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What were additional names for the Back-to-Africa movement pioneered by Alfred Charles Sam?",
        "response": "Colonization movement or Black Zionism",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession has both Ivan Fesenko and Mark Krein held?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Dave Grohl or Steve Winwood?",
        "response": "Stephen Lawrence \"Steve\" Winwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Prey is a television series that starred an American actor best known as Benny in L.A. Law and the voice of Pops in what show?",
        "response": "Johnny Bravo",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was American professional basketball player Jason Paul Collins drafted onto the Houston Rockets?",
        "response": "Houston",
        "source": "hotpot_qa"
    },
    {
        "query": " Ted Sharks and Carlos Reygadas both worked in what industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Who selected the quarterback in the 1999 NFL draft, two spots after All American Tim Couch?",
        "response": "Cincinnati Bengals",
        "source": "hotpot_qa"
    },
    {
        "query": "The Butte is a census-designated place (CDP) in Matanuska-Susitna Borough, Alaska, it is part of the Anchorage, Alaska Metropolitan Statistical Area, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Daviesia and Rehmannia native to the same countries?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the musician known for his work as frontman and lyricist of the progressive rock band The Mars Volta, who featured in an American rock band from Los Angeles, California, formed in 2013 ?",
        "response": "Grammy Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Are 10 Years and Ash from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthplace of the composer of Griselda?",
        "response": "Venice",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kangchenjunga and Trivor both mountains?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Laizhou and Suixi County, Anhui located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was the location of a a 1990 horror comedy film directed by Claudio Fragasso (under the pseudonym Drake Floyd) and starring Michael Stephenson, George Hardy, Margo Prey, Connie McFarland, Deborah Reed and Jason Wright?",
        "response": "Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "1997 UEFA Champions League Final was held in what country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "which Italian actress featured in  Hardbodies 2",
        "response": "Fabiana Udenio",
        "source": "hotpot_qa"
    },
    {
        "query": "Karta GPS pairs open-source map data from OpenStreetMap with curated content from Yelp and which other local search-and-discovery service app?",
        "response": "Foursquare",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the birth year of the fifth governor of a British colony in north America that existed from 1632 to 1776?",
        "response": "1626",
        "source": "hotpot_qa"
    },
    {
        "query": "Which place, Wall Street Tower or The Collegiate Reformed Protestant Dutch Church has had a variety of church buildings?",
        "response": "The Collegiate Reformed Protestant Dutch Church",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor, screenwriter, director, producer, singer-songwriter and author sang this song from the 1971 movie \"Willy Wonka & the Chocolate Factory\" that was written by British composers Leslie Bricusse and Anthony Newley?",
        "response": "Gene Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "Osie Leon Wood III (born March 25, 1962), is an American former professional basketball player, was a first round NBA draft pick, during the 1984 NBA draft was the 37th annual draft of the National Basketball Association (NBA), held in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Mario Cárdenas Guillén is the brother of the Mexican drug lord who was the former leader of what group?",
        "response": "Gulf Cartel",
        "source": "hotpot_qa"
    },
    {
        "query": "In which American reality television series airing on the History channel  Koker and his staff follows as they restore and modify classic automobiles and motorcycles?",
        "response": "American Restoration",
        "source": "hotpot_qa"
    },
    {
        "query": "Stan Lee's Mutants, Monsters & Marvels, released in which year, is an American documentary film produced by Creative Light Entertainment, the two talk about Lee's life, his marriage with Joan Boocock Lee, was a British-American hat model and voice actress?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie is part of the Indian Bengali language franchise and is produced by SVF Entertainment?",
        "response": "Amazon Obhijaan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released an album named 'Warrior' and has co-written 11 released songs with her own mother?",
        "response": "Kesha",
        "source": "hotpot_qa"
    },
    {
        "query": "Is McGhee Tyson Airport or Bemidji Regional Airport further west?",
        "response": "Bemidji Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2016 NHL Entry Draft, the second overall pick was selected by which team?",
        "response": "Winnipeg Jets",
        "source": "hotpot_qa"
    },
    {
        "query": "Council Rock was a meeting ground for New York Native Americans, who sometimes had this term used for them incorrectly?",
        "response": "Metoac",
        "source": "hotpot_qa"
    },
    {
        "query": "Marvin Cohen created a 1980 play that was first performed at the festival held at which Central Park theater?",
        "response": "Delacorte Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "Racists Anonymous had a first meeting after the murder perpetrated by which white supremacist?",
        "response": "Dylann Storm Roof",
        "source": "hotpot_qa"
    },
    {
        "query": "Edit referenced the Paul and Linda McCartney hit that came from which album?",
        "response": "Ram",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of \"Thank God and Greyhound\" is best known for hosting what nationally televised country variety show?",
        "response": "\"Hee Haw\",",
        "source": "hotpot_qa"
    },
    {
        "query": "How did The President of Uganda from 1971 to 1979, who was known as strongman, die?",
        "response": "a helicopter crash",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 American action comedy film for which James Lew did a choreography?",
        "response": "Robert Luketic",
        "source": "hotpot_qa"
    },
    {
        "query": "How many room did the hotel near  The Fremont Street Experience  have when it opened in 1975?",
        "response": "325",
        "source": "hotpot_qa"
    },
    {
        "query": "Hell on Earth is a series by the author of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "WHo was born first, Peter Furler or Fred Schneider?",
        "response": "Frederick William Schneider",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the for-profit university adjacent to Fort New Salem, and founded by Seventh Day Adventists, founded?",
        "response": "1888",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the author of The Mummy's Foot die?",
        "response": "1872",
        "source": "hotpot_qa"
    },
    {
        "query": "The Airth Old Parish Church is located near what body of water?",
        "response": "River Forth",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state is the manufacturer of Honey Nut Clusters headquartered?",
        "response": "Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did Cevin Fisher write that the singer who sang \"Hit and Run\" do the vocals for?",
        "response": "\"(You Got Me) Burning Up,\"",
        "source": "hotpot_qa"
    },
    {
        "query": "John Elwood Schweitz, is a retired American basketball player in the National Basketball Association (NBA), he played in two NBA seasons, for which American professional basketball team based in Seattle, Washington? ",
        "response": "Seattle SuperSonics",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the natives of Reggiolo was last manager of what German football club?",
        "response": "Bayern Munich",
        "source": "hotpot_qa"
    },
    {
        "query": " The El Hadj Hassan Gouled Aptidon Stadium is located in a country with a total area of how many square miles ?",
        "response": "8958 sqmi",
        "source": "hotpot_qa"
    },
    {
        "query": "The Saratov Approach was released throughout a geographic region of the United States, settled by Mormons beginning in what year?",
        "response": "1850",
        "source": "hotpot_qa"
    },
    {
        "query": "Ira Gruber is known as a military historian for a colonial revolt that took place between what years?",
        "response": "1765 and 1783",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Edward F. Cline and Syed Ali Raza Usama both directors? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Hawking: Master of the Universe is a documentary television series produced by the television broadcaster Channel 4, the series includes interviews with which American theoretical physicist working in particle physics and cosmology, and is a Professor of Science on the physics faculty of Harvard University?",
        "response": "Lisa Randall",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Temple's selection to the All-Championship team in the 2000 Atlantic 10 Men's Basketball Tournament born?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Jackie Chan film released that Gary Daniels was in?",
        "response": "14 January 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the University of Nevada, Reno and the University of Moratuwa in the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a United States Representative from New York, who was born in a hamlet in the town of New Scotland on the southeast corner of the town ?",
        "response": "John I. Slingerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Get Outta My Dreams, Get into My Car was based on a line from which Sherman Brothers song?",
        "response": "You're Sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "What NFL team does 2009 St. Petersburg Bowl mvp Mohamed Sanu play for?",
        "response": "the Atlanta Falcons",
        "source": "hotpot_qa"
    },
    {
        "query": "Jordan-Carmichael Subban, is a Canadian professional ice hockey defenceman for the Utica Comets of the American Hockey League (AHL), and is one of the three Subban brothers to be drafted into the NHL, the other two being Malcolm Subban and who?",
        "response": "P. K. Subban",
        "source": "hotpot_qa"
    },
    {
        "query": "Doug Edwards played basketball for the Hawks and another team established in what year? ",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "The team which Fabio González Estupiñán played for is in the autonomous community of where?",
        "response": "Canary Islands",
        "source": "hotpot_qa"
    },
    {
        "query": "Vashti Cunningham attended what school administered by the Diocese of Las Vegas? ",
        "response": "Bishop Gorman High School",
        "source": "hotpot_qa"
    },
    {
        "query": "The court in which the most important decisions of the \"Black Book of the Admiralty\" where established under a monarch who was also known as the what of Scots?",
        "response": "Hammer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress was named the seventh-greatest female screen legend by the American Film Institute and said \"art lives on forever\" at an AIDS benefit?",
        "response": "Elizabeth Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "MAKO Surgical Corp accepted a deal from Stryker for what amount?",
        "response": "$1.65B",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish actor stars in Untogether, an upcoming American drama film?",
        "response": "Jamie Dornan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two writers focus more on religion, Kenneth Grahame or Mircea Eliade?",
        "response": "Mircea Eliade",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American sportscaster who hosted Dazzling Dunks and Basketball Bloopers in1989?",
        "response": "Marv Albert",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 census of the city which has Fountain Hill, Pennsylvania as a suburb? ",
        "response": "74,982",
        "source": "hotpot_qa"
    },
    {
        "query": "Day by Day stars the American comedienne who was best known for her work in what field?",
        "response": "television comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  castle in the border region of Scotland did Hermitage Water passes through ",
        "response": "Hermitage Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Rainy Day Records produced records for what drummer of the alternative rock band Garbage?",
        "response": "Butch Vig",
        "source": "hotpot_qa"
    },
    {
        "query": "The Leopard, in Italian, The Serval, a 1963 Italian epic period drama film by director Luchino Visconti, the serval (\"Leptailurus serval\"), also known as the tierboskat, is a wild cat found in which continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Gale co-wrote the sci-fi film directed by whom?",
        "response": "Robert Zemeckis",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the county seat for the county that Barclay, the unincorporated community, is in?",
        "response": "Lyndon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was not running in 1895, The American Jewess or First for Women?",
        "response": "First for Women",
        "source": "hotpot_qa"
    },
    {
        "query": "The year 2004 in film included major releases of sequels including the third installment based on a novel by what author?",
        "response": "J. K. Rowling",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country's flag features one of the national symbols, an 11-pointed maple leaf?",
        "response": "Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Yanka Dyagileva or Alexander Bashlachev?",
        "response": "Alexander Nickolaevich Bashlachev",
        "source": "hotpot_qa"
    },
    {
        "query": "The Democratic Majority Leader of the Congressional Friends of Denmark was from what congressional district?",
        "response": "Maryland 's 5 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "Aleksandr Yurievich Domogarov is a singer in a musical genre whose songs are bsed on themes of the ubran underclass and what?",
        "response": "criminal underworld",
        "source": "hotpot_qa"
    },
    {
        "query": "Slipknot frontman Corey Taylor released Bother as solo artist before it was released on what band's self-titled debut album?",
        "response": "Stone Sour",
        "source": "hotpot_qa"
    },
    {
        "query": "What school is located in the southernmost atoll of the archipelago of the Maldives?",
        "response": "Maradhoo Feydhoo School",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the American English name for the Polka Marina merry-go-round in the Netherlands?",
        "response": "A carousel (American English: from French \"carrousel\" and Italian \"carosello\"), roundabout (British English), or merry-go-round, is an amusement ride consisting of a rotating circular platform with seats for riders.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animation programming block did the series American Dad premier inn?",
        "response": "Animation Domination",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Presbyterian University College and Baylor University have in common",
        "response": "partially private & public university",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist worked alongside the South African record producer to assist with production?",
        "response": "Wizkid",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Calothamnus and Grewia belong to the same genus?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahavas Sholem Synagogue has windows that contain the shape that is in what form?",
        "response": "hexagram",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Meets Evil was a duo that formed because of a mutual friend from what city?",
        "response": "Detroit",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did Ladies vs Ricky Bahl actress, Parineeti Chopra win?",
        "response": "Filmfare and National Film Award",
        "source": "hotpot_qa"
    },
    {
        "query": "LaIsha and Gloria are what type of publications?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the production company of Digby Dragon founded?",
        "response": "Founded in 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "Sweet Girl is the sixth mini-album released by which organization, under WM Entertainment, the  title song of the album, \"Sweet Girl\", along with the other songs, was produced by leader   professionally known as Jinyoung, is a South Korean singer, songwriter, record producer, and actor, given name is Jung Jin-young?",
        "response": "B1A4",
        "source": "hotpot_qa"
    },
    {
        "query": "The tract where \"Upstart Crow\" gets its name came out in what year?",
        "response": "1592",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 1990 Los Angeles Rams season, which player from the University of Oklahama made his NFL debut?",
        "response": "Marcus L. Dupree",
        "source": "hotpot_qa"
    },
    {
        "query": "What track by an American progressive bluegrass group from Colorado showed the influence of Deliverance?",
        "response": "\"Comin' Round\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Love in a Wood is a 1915 British silent comedy film directed by Maurice Elvey, the film is a contemporary-set version of the play \"As You Like It\", a pastoral comedy by who?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name given to a fictional race of superhumans appearing in comics published by Marvel and which includes a Royal Family with the fictional character Gorgon in it?",
        "response": "Inhumans",
        "source": "hotpot_qa"
    },
    {
        "query": "In the band ac/dc, which vocalist replaced Bon Scott?",
        "response": "Brian Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the man confined to the American coastal pentagonal bastion fort known for its role in the War of 1812?",
        "response": "Francis Scott Key",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American drama film starring Donna Reed and American actor and film and television producer of \"Shane\" (1953) and \"This Gun for Hire\" (1942) released?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheick Oumar Sissoko and Marc Webb, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Gerry Kissell Or Dale Dye?",
        "response": "Dale Dye",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Some Hearts\" singer collaborated with Keith Urban on Ripcord?",
        "response": "Carrie Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Which print magazine company did Terry Richardson work for while he was in Montreal?",
        "response": "Vice Media",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brewery that owns the 2009 Grand National's sponsorship?",
        "response": "John Smith's Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song from Badfinger's third album is featured in the series finale of AMC's \"Breaking Bad\"?",
        "response": "Baby Blue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this South Korean musician, singer-songwriter, record producer and actor in the rock band CNBLUE, who wrote the song You, My Star?",
        "response": "Jung Yong-hwa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2008 French film was the third of a four-film adaptation?",
        "response": "Asterix at the Olympic Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Country Music Hall of Fame artist known for his song \"Crazy Arms\" also found success with what female artist on their recording titled \"Release Me\"?",
        "response": "Patti Page",
        "source": "hotpot_qa"
    },
    {
        "query": "An icelandic professional strongman plays a character nicknamed \"The Mountain\" in what series of novels?",
        "response": "A Song of Ice and Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, The Caribbean Pioneer or Cook's Illustrated, is an American cooking magazine published every two months by the America's Test Kitchen company in Brookline, Massachusetts?",
        "response": "Cook's Illustrated",
        "source": "hotpot_qa"
    },
    {
        "query": "The single  \"Dangerous Game\" was produced by a man that has sold approximately how many singles in the United Kingdom?",
        "response": "21 million",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Something There\" is a song written by lyricist Howard Ashman and composer Alan Menken for Walt Disney Pictures 30th animated feature film \"Beauty and the Beast\" (1991), it features which American actor and singer, described at the time of his death as \"one of the last\" bona fide\" leading men of the Broadway musical and global celebrity on television\" and a \"versatile stage and film actor\"?",
        "response": "Jerome Bernard \"Jerry\" Orbach",
        "source": "hotpot_qa"
    },
    {
        "query": "Benjamin Mouton plays Mr. Manus in a 1990 film shot on what campus?",
        "response": "Loyola University",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Candy\" is a duet with Iggy Pop and Kate Pierson, an American vocalist, lyricist, and one of the singers and founding members of what group?",
        "response": "The B-52's",
        "source": "hotpot_qa"
    },
    {
        "query": "What Georgian-born dictator did Georgy Flyorov direct a letter to?",
        "response": "Joseph Stalin",
        "source": "hotpot_qa"
    },
    {
        "query": "Wavves and Jimmy Eat World, are American bands of what type music?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What Victoria's Secret Angel did Anna Kaiser personal train?",
        "response": "Karlie Elizabeth Kloss",
        "source": "hotpot_qa"
    },
    {
        "query": "Among Miriam Toews and Heiner Müller who was dramatist?",
        "response": "Heiner Müller",
        "source": "hotpot_qa"
    },
    {
        "query": "In what MTV comedy series did Julia Fletcher's second son work on?",
        "response": "Faking It",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the comedian born who hosted a show showcasing advertisements and weird video footage that lasted from 1999 to 2001?",
        "response": "16 November 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006 NPF Senior Draft is the third annual NPF Draft, the first selection was Cat Osterman, from the Texas Longhorns softball team represents which organization, in NCAA Division I intercollegiate softball competition?",
        "response": "The University of Texas at Austin",
        "source": "hotpot_qa"
    },
    {
        "query": "What municipality host the John Paul Johns House in the Seacoast Region",
        "response": "Portsmouth",
        "source": "hotpot_qa"
    },
    {
        "query": "Judy Clarke defended an American domestic terrorist convicted for a series of anti-abortion and anti-gay-motivated bombings across the southern United States know as what?",
        "response": "the Olympic Park Bomber",
        "source": "hotpot_qa"
    },
    {
        "query": "A jazztronica band from Manchester features bass player Sneaky and what visual artist?",
        "response": "Chris Cavetroll Drury",
        "source": "hotpot_qa"
    },
    {
        "query": "Which takes place farther east, The Mosuo Sisters or The Silent Historian?",
        "response": "The Mosuo Sisters",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of the two directors, Andrzej Bartkowiak and Hugh Schulze, who is also a cinematographer",
        "response": "Andrzej Bartkowiak",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star from The Ghazi Attack won the State Nandi Award for Best Special Effects in 2006?",
        "response": "Ramanaidu Daggubati",
        "source": "hotpot_qa"
    },
    {
        "query": "The trainer for the #7 UFC bantamweight is also a police officer for which department?",
        "response": "Albuquerque Police Department Gang Unit",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the TV series which showed the episode Nepotism start on NBC ? ",
        "response": "March 24, 2005,",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 South Korean comedy-drama film \"Papa\" stars which South Korean actress and model who also appeared in \"Reply 1994\" (2013) ?",
        "response": "Go Ara",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist, Raymond Queneau or Peter Straub, has received the Bram Stoker Award?",
        "response": "Peter Francis Straub",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joplin Regional Airport and Antonio Rivera Rodríguez Airport both located on the US mainland?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1993 movie featured the actor of Imperial Japanese Army Major Yamauchi?",
        "response": "Son of the Pink Panther",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry is the official resident cat of whom?",
        "response": "Prime Minister of the United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Strandloper was based on the story about an English convict who was transported to what country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more awards for their work, Darren Benjamin Shepherd or Lilibet Foster?",
        "response": "Lilibet Foster",
        "source": "hotpot_qa"
    },
    {
        "query": "John Pollow, of Exeter, was an English politician, Exeter is a cathedral city in Devon, in which UK country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Dyess Air Force Base is close to a major city with what population size?",
        "response": "117,063",
        "source": "hotpot_qa"
    },
    {
        "query": "How many games did Mel Tucker replace Jack Del Rio for?",
        "response": "five games",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the number two pick in the 1992 draft play most of his career for?",
        "response": "the Miami Heat",
        "source": "hotpot_qa"
    },
    {
        "query": "How many National Film Awards did the main actor in Awaargi win?",
        "response": "two National Film Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor and comedian who starred in \"The Shaggy Dog\" born? ",
        "response": "June 13, 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the choreographer of \"Salome, Where She Danced\" born?",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the second book by the author that won the Booker Prize in 1997?",
        "response": "The Ministry of Utmost Happiness",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Couples and \"Heroes\"?",
        "response": "albums",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a British film director who worked for Hammer Films, Terence Fisher or Bruce Dellis ?",
        "response": "Terence Fisher",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is mathematical, Acronymble or Rithmomachy?",
        "response": "Rithmomachy",
        "source": "hotpot_qa"
    },
    {
        "query": "How many studio albums does the English band White Lies have?",
        "response": "four studio albums",
        "source": "hotpot_qa"
    },
    {
        "query": "François Ignace Schaal, born and baptized on 5 December 1747 in Colmar (Alsace) and died on 30 August 1833 at Sélestat (Bas-Rhin), was a French general and statesman of which titled series of sweeping military conflicts, lasting from 1792 until 1802, resulting from the French Revolution?",
        "response": "French Revolutionary Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founder of Alcatraz East was born on March 31, 1956?",
        "response": "John Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Carl Sandburg or Lawrence Durrell?",
        "response": "Lawrence George Durrell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plant contains more species, Coronilla or Fascicularia?",
        "response": "Coronilla contains about 20 species of flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What German state was Karl Julius Perleb born in?",
        "response": "Baden-Württemberg",
        "source": "hotpot_qa"
    },
    {
        "query": "U.S. Route 27 (US 27) in Kentucky runs how many miles from the Tennessee border to the Ohio border at Cincinnati, Ohio, it crosses into the state in the Lake Cumberland area, Lake Cumberland, is a reservoir in Clinton, Laurel, McCreary, Pulaski, Russell, and Wayne counties in Kentucky?",
        "response": "190.785",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sukhoi/HAL Fifth Generation Fighter Aircraft is a derivative of another Russian plane thats international name is what?",
        "response": "T-50",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Hurricane Heist also appeared in Fantastic Four in 2015?",
        "response": "Toby Kebbell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Edward Dmytryk or Otto Preminger?",
        "response": "Otto Ludwig Preminger",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sisters stars a Canadian-American actor who is known for his role as Will Truman in what sitcom?",
        "response": "Will & Grace",
        "source": "hotpot_qa"
    },
    {
        "query": "Kō Nishimura had a supporting role in this film by Akira Kurosawa that came out in what year?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Felicity de Jager Cunningham's husband inducted into the College Football Hall of Fame?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What black comedy crime film was awarded the Palme d'Or at the 47th Cannes Film Festival in 1994?",
        "response": "Pulp Fiction",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Pakistani cricket umpire who won 3 consecutive ICC umpire of the year awards in 2009, 2010, and 2011 will be in the ICC World Twenty20?",
        "response": "Aleem Sarwar Dar",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2011, what is the population of the parish that lies to the west of Temple Bruer with Temple High Grange?",
        "response": "356",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the debut album of the Hertfordshire-based rock band was signed to record label Infectious Music?",
        "response": "Young for Eternity",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did the actress, who co-stars with Nicolas Cage in the 2004 heist film, play in \"Baby Blues\"?",
        "response": "Melinda Bitterman",
        "source": "hotpot_qa"
    },
    {
        "query": "Ugo Falena wrote the libretto for the opera \"L'ultimo Lord which is by an Italian composer and pianist who is known for having completed Puccini's opera Turandot in what year?",
        "response": "1926",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Prológica CP-400 and Atari ST both personal computers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Seminary Hill School was located in this community that hosts what airport?",
        "response": "Lebanon Municipal Airport",
        "source": "hotpot_qa"
    }
]