[
    {
        "query": "Bernhard Wicki and Craig Schlattman, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the daughter of the man whom in 1992 created a not-for-profit  organization dedicated to finding adoptive homes for children waiting in North America's foster care system born?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Which railway is on Hill Street?",
        "response": "Angels Flight",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the author of The Future of Assisted Suicide and Euthanasia born?",
        "response": "August 29, 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ingaevones and the Istvaeones tribal groups were what kind of group?",
        "response": "Germanic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Broken Social Scene or Daniel Amos?",
        "response": "Broken Social Scene",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the comedian and actor, who stars in the British comedy Taskmaster, born?",
        "response": "St Asaph, Denbighshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Kappa Mikey and Edgar & Ellen are both shows that play on what network?",
        "response": "Nicktoons",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the voice actress who sang \"Do the Bartman\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What brand owns both the Dommelsch Brewery and the Companhia Cervejaria Brahma brewery?",
        "response": "Anheuser-Busch InBev",
        "source": "hotpot_qa"
    },
    {
        "query": "What form of play does Ouk-Khmer and Sentinels of the Multiverse have in common?",
        "response": "game",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006 NPF Senior Draft is the third annual NPF Draft, the first selection was Cat Osterman, from the Texas Longhorns softball team represents which organization, in NCAA Division I intercollegiate softball competition?",
        "response": "The University of Texas at Austin",
        "source": "hotpot_qa"
    },
    {
        "query": "The Browning Version starred the actress who won an Emmy in what year?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Outrageous Fortune\" got its name from a play that is based in what country?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "In what ocean is the island where Mount Hobson is located?",
        "response": "Pacific Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor and comedian who starred in \"The Shaggy Dog\" born? ",
        "response": "June 13, 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Agrippa Postumus and Tiberius have in common?",
        "response": "son",
        "source": "hotpot_qa"
    },
    {
        "query": "The Eighth Happiness stars this actor, regarded as one of four what?",
        "response": "Heavenly Kings",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous landmark in York, Maine is also the burial place of Mi'kmaq Chief St. Aspinquid?",
        "response": "Mount Agamenticus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American rapper and a member of the group A Tribe Called Quest has a guest appearance in Shaq Diesel",
        "response": "Malik Izaak Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "What former LSU Tigers defensive coordinator led the 2015 Youngstown State Penguins football team?",
        "response": "Bo Pelini",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the Scottish king who exiled John forbes die?",
        "response": "27 March 1625",
        "source": "hotpot_qa"
    },
    {
        "query": "The American Senator from Maryland is in what political party?",
        "response": "Democratic Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release year of this American comedy-drama film directed by Jason Reitman, working with Eric Wesley Steelberg, cinematographer?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Gelatine was an airship piloted on September 19, 1905 by a pioneer American aviator and what?",
        "response": "barnstormer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarter of an American restaurant holding company who's chairman and chief executive officer was Jon L. Luther?",
        "response": "Canton, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Do writers Gillian Bradshaw and Theodore Dreiser share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2008 City Theatre Dublin ran productions of a play by who?",
        "response": "Oscar Wilde",
        "source": "hotpot_qa"
    },
    {
        "query": "Which reality show is responsible for forming the band that sings \"Like Ohh-Ahh\"?",
        "response": "Sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "what kind of business was Elmer Lucille Allen the first African-American Chemist at?",
        "response": "spirits and wine business",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Germany's large-scale, low strength fortification unit, disbanded in 1919, named after? ",
        "response": "Menges",
        "source": "hotpot_qa"
    },
    {
        "query": "Eugene Hargrove is editor-in-chief of Environmental Ethics located in what city?",
        "response": "Denton, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Spicoluk played bass with another Canadian singer who has been often referred to as what?",
        "response": "Pop Punk Queen",
        "source": "hotpot_qa"
    },
    {
        "query": "David Wayne Hull (born 1962 or 1963) is a leader of which group that originated in Mississippi in the early 1960s under the leadership of Samuel Bowers, its first Grand Wizard?",
        "response": "White Knights",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Lafzon Ki Kahani is a remake of the 2011 Korean movie directed by who?",
        "response": "Song Il-gon",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the man that Tony Lopez defeated by decision in the 1988 \"The Ring\" Fight of the year born?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2013 American comedy film that premiered in the Special Presentation section at the 2013 Toronto International Film Festival, and co-starred  a French singer-songwriter, musician, actress and model?",
        "response": "John Turturro",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a small network appliance and entertainment device that serves as a the media player for the iTunes Store?",
        "response": "Apple TV",
        "source": "hotpot_qa"
    },
    {
        "query": "A former lawyer and entrepreneur filed a civil suit against the Clintons for making him pay for what?",
        "response": "Gala Hollywood Farewell Salute to President Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English former professional footballer played non-league football for the Gainsborough Trinity Football Club?",
        "response": "Ian Robert Bennyworth",
        "source": "hotpot_qa"
    },
    {
        "query": "WUMM is operated by students of what university campus that has an enrollment of approximately 1,200 students?",
        "response": "The University of Maine at Machias",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Elstree and Watling Street run through?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team picked Rod Strickland's godson in the 2011 NBA draft?",
        "response": "Cleveland Cavaliers",
        "source": "hotpot_qa"
    },
    {
        "query": "the current executive producer of The Gong Show was born in which year ?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "What were these letters from World War I authored by British High Commissioner to Egypt on the political status of lands under the Ottoman Empire that came to attention during the Cairo Conference?",
        "response": "the McMahon letters",
        "source": "hotpot_qa"
    },
    {
        "query": "This city is known as the \"heart of the Ruby Valley\" and contains Gordon Peak which has an elevation of 8478ft?",
        "response": "Sheridan",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Byron Black and Iván Molina play which sport?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has released more studio albums, 10 Years or Edward Sharpe and the Magnetic Zeros?",
        "response": "10 Years",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of negatives are the Holtermann collection that showed a former gold mining town in New South Wales?",
        "response": "glass-plate",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, Arizona Highways or Adventist World, is published by Herald Publishing Association?",
        "response": "Adventist World",
        "source": "hotpot_qa"
    },
    {
        "query": "Newspapers in Australia: there are 2 national and 10 state/territory daily newspapers, 35 regional dailies and 470 other regional and suburban newspapers, most major metropolitan newspapers are owned either by News Limited, a subsidiary of which American multinational mass media corporation headquartered in ?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "In how many countries did a song written by Rolf Magnus Joakim Larsson go to the number one spot?",
        "response": "25",
        "source": "hotpot_qa"
    },
    {
        "query": "Tony Award winner Abe Burrows wrote the book for the musical Can-Can, which had music and lyrics by whom?",
        "response": "Cole Porter",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the organization that sponsors Acta Astronautica formed?",
        "response": "August 16, 1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population as of the 2010 census of the county in which Pilsen, Kansas is located?",
        "response": "12,660",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did the Salvadorian model born on August 4, 1994 win the Miss Universe pageant?",
        "response": "Las Vegas, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the stadium at which 2006 Commonwealth Games opening ceremony was held located? ",
        "response": "Yarra Park, Melbourne, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "The King in Love starred which South Korean singer and actress?",
        "response": "Im Yoon-ah",
        "source": "hotpot_qa"
    },
    {
        "query": "Which stadium is used by the team that Mark D'Onofrio coaches?",
        "response": "TDECU Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "For how long did the author of STAT: Standing Tall and Talented book series have a career in basketball?",
        "response": "15-year",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of installation does WBCN and WFNX have in common?",
        "response": "radio station",
        "source": "hotpot_qa"
    },
    {
        "query": "At a tournament where Wisoon Wichaya was coaching Thai football in 206, at least 38 teams were playing. How many of those teams were women's teams? ",
        "response": "8 teams",
        "source": "hotpot_qa"
    },
    {
        "query": "Station Casino Reno is a proposed hotel and casino located next to the Reno-Sparks Convention Center in Reno, Nevada, the land is owned by which gaming company based in the Las Vegas suburb of Summerlin, Nevada, founded by Frank Fertitta, Jr.?",
        "response": "Station Casinos",
        "source": "hotpot_qa"
    },
    {
        "query": "Delhi Public School was inaugurated by an Indian politician who became the Union Deputy Minister of Commerce in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "The small resort of Porto Rafael was founded on the North Eastern coast of Sardinia, Italy, by Raphael Neville, Count of Berlanga de Duero, in the late 1950s, the son of Edgar Neville the Hollywood film director, playwright and novelist who became close friends with Sir Charles Spencer \"Charlie\" Chaplin, was an English comic actor, filmmaker, and composer who rose to fame in the era of what?",
        "response": "silent film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the surname of the only man other than Carlos Veri to have played in a World Cup, Olympic Games, Confederations Cup and continental championship final?",
        "response": "Creus",
        "source": "hotpot_qa"
    },
    {
        "query": "What mostly decommissioned nuclear production complex operated by the United States is overlooked by Rattlesnake Mountain?",
        "response": "Hanford Site",
        "source": "hotpot_qa"
    },
    {
        "query": "Author Kurt Vonnegut, who is most famous for his novel Slaughterhouse-Five, created Granfalloon, which is defined as a \"false karass\" in the fictional religion of what?",
        "response": "Bokononism",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NBC sitcom is star of the second and final season of ''\" now playing the afterlife \"architect\" Michael?",
        "response": "\"The Good Place.",
        "source": "hotpot_qa"
    },
    {
        "query": "Marvin Cohen created a 1980 play that was first performed at the festival held at which Central Park theater?",
        "response": "Delacorte Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the historical county, later duchy of the Holy Roman Empire, located in the Low Countries that  Adolf van Nieuwenaar worked for in the  Eighty Years' War?",
        "response": "Guelders",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the Mount Lofty Ranges is part of the Electoral district of Davenport?",
        "response": "Adelaide Hills",
        "source": "hotpot_qa"
    },
    {
        "query": "What English actor appeared in the horror film The Ward?",
        "response": "Jared Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "The Radcliffe Pitches are a premier all-female a cappella singing ensemble at Harvard University, founded in 1975 at the Hasty Pudding Club, a social club for students from where?",
        "response": "Harvard",
        "source": "hotpot_qa"
    },
    {
        "query": "American Hairless Terrier and Northern Inuit Dog are both different specials of the same animal?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lethal game of chance is featured in the 2013 film Roulette?",
        "response": "Russian roulette",
        "source": "hotpot_qa"
    },
    {
        "query": "Where can both Himalayacalamus and Pterocarya be found?",
        "response": "Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "In modern history of Syria this kingdom lasted for only four months, this kingdom surrendered to who?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Natalie Portman plays whom in a film also featuring Stephen Rea?",
        "response": "Evey",
        "source": "hotpot_qa"
    },
    {
        "query": "What current structure was built in 1593 by Clan Barclay, that has a a musician, with links to Fairport Convention and Matthews' Southern Comfort residing there?",
        "response": "Towie Barclay Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musical genre do the bands Eleventh Dream Day and Verona both play?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Meic Stevens is a Welsh singer-songwriter, discovered by which DJ ?",
        "response": "Jimmy Savile",
        "source": "hotpot_qa"
    },
    {
        "query": "What television network did Donald Losby appear on in his role for a Rod Serling anthology series?",
        "response": "CBS",
        "source": "hotpot_qa"
    },
    {
        "query": "Which work of William Shakespeare is thought to be a collaborative effort of himself and Thomas Kyd?",
        "response": "Edward III",
        "source": "hotpot_qa"
    },
    {
        "query": "President's Choice Financial is a financial service division to a supermarket chain with how many regional and market segment banners?",
        "response": "22",
        "source": "hotpot_qa"
    },
    {
        "query": "Culcairn is a town in the south-east Riverina region of New South Wales, located in the Greater Hume Shire Council local government area on the Olympic Highway between Albury and Wagga Wagga, a major regional city in the Riverina region of New South Wales, in which country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the player the Raptors acquired in 2013 in a three-way deal with the Memphis Grizzlies and Detroit Pistons?",
        "response": "6'8\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Swedish author and teacher wrote the 1912 novel Thy Soul Shall Bear Witness! ?",
        "response": "Selma Ottilia Lovisa Lagerlöf",
        "source": "hotpot_qa"
    },
    {
        "query": "What German state was Karl Julius Perleb born in?",
        "response": "Baden-Württemberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What are Sidney Morgan and William Friedkin known for?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Do New York Woman and On Our Backs deal with the same subject matter?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Eddie Flynn, was an Irish professional soccer player who played as a goalkeeper in the League of Ireland during the 1930s and 1940s, Flynn also played for which professional association football league which operates as the highest division of the Northern Ireland Football League – the national league in Northern Ireland?",
        "response": "Northern Ireland Football League Premiership",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name given to a fictional race of superhumans appearing in comics published by Marvel and which includes a Royal Family with the fictional character Gorgon in it?",
        "response": "Inhumans",
        "source": "hotpot_qa"
    },
    {
        "query": "What company's CEO is the Persian voice of Raoul in the French 3-D animation from Bibo Bergeron?",
        "response": "Glory Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Musicality features covers of songs from a jukebox musical written by who?",
        "response": "Catherine Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Pigs of the Roman Empire featured the guitarist from an American rock band from Los Angeles, California, formed in what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was director of the 2015 drama film, \"We Are Your Friends,\" born?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Phillip Ferdinand \"Phil\" Mahre had a  total of 27 World Cup race wins is fourth among Americans, only behind Lindsey Vonn, Bode Miller, and Mikaela Shiffrin, an American World Cup alpine ski racer who specialized  in what?",
        "response": "slalom and giant slalom",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor known as Chandler in \"North Shore\" also stars in the legal drama television series Reckless directed by who?",
        "response": "Catherine Hardwicke",
        "source": "hotpot_qa"
    },
    {
        "query": "What Japanese manga series was Karen Strassman a voice actress in?",
        "response": "Monster",
        "source": "hotpot_qa"
    },
    {
        "query": "Fred Ahern was a graduate of the liberal arts college located in what city?",
        "response": "Brunswick, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel by Charles E. Carryl is a pastiche imitation of Alice's Adventures in Wonderland?",
        "response": "Davy and the Goblin",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryan Brown performed in what 1984 British musical drama that was directed by Peter Webb?",
        "response": "Give My Regards to Broad Street",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernhard Stavenhagen and Franz Liszt, share which occupations?",
        "response": "composer and conductor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American former professional basketball player was Wizards high school star",
        "response": "Kwame Hasani Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "What company operates in Switzerland and is part of the name of an award Gene Hobbs won?",
        "response": "Rolex",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the popular name for the awards ceremony, in 2018 held later than usual and hosted by Jimmy Kimmel?",
        "response": "Oscars",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is a genus of flowering plant, Sinofranchetia or Melaleuca?",
        "response": "Sinofranchetia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer is older, Joseph Epstein or Milan Kundera?",
        "response": "Milan Kundera",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who is starred in the film \"Meteor\" with Sean Connery born?",
        "response": "1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Boise State University and Carleton University, are located in Canada?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What country's social system is commented on is the K-horror film series that began with \"Whispering Corridor's\"?",
        "response": "South Korean",
        "source": "hotpot_qa"
    },
    {
        "query": "Which athletics arena was coveted by three Premier League clubs before one from East London was selected to become its new tenant?",
        "response": "Olympic Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Heckert worked with four coaches, including James \"Jimmy\" Johnson, who was a broadcaster in this sport?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the musician who wrote \"Yesterday's Hero\" with Harry Vanda born?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was produced earlier, The Fighting Prince of Donegal or The Moon-Spinners?",
        "response": "The Moon-Spinners",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the fairy Queen Mab orginate?  ",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both James Whale and Jon Paul Puno?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Hurricane Heist also appeared in Fantastic Four in 2015?",
        "response": "Toby Kebbell",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession do both Bob Woodward and Stanley Kunitz have?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Emory Nusz was born in the city that is the county seat of what county?",
        "response": "Frederick County",
        "source": "hotpot_qa"
    },
    {
        "query": "The  Australian pop singer Lee Harding is from what outer-suburb of Melbourne in Victoria, Australia?",
        "response": "Frankston, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Norigae is a film based on the story of a South Korean actress who had been staring in what television drama series?",
        "response": "Boys Over Flowers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this disease related to abnormality in the oxygen-carrying protein haemoglobin that Chukwuedu Nwokolo is carrying out research on?",
        "response": "Sickle-cell disease",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Anthony Green and Suggs have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What international Jewish non-governmental organization based in the United States did Frank Zappa deny an apology in 1979(?",
        "response": "The Anti-Defamation League",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the far right French political movement, whose name was given to a journal, and who went on to influence Acción Española, a Spanish cultural association active during the Second Spanish Republic?",
        "response": "Action Française",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miller oilfield was discovered by an oil and gas company headquartered in which city ?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the codifier of LaVeyan Satanism die?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  castle in the border region of Scotland did Hermitage Water passes through ",
        "response": "Hermitage Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Enlglish film director and producer that was born in 1937 that is working on turning John Pearson's novel into a film? ",
        "response": "Ridley Scott",
        "source": "hotpot_qa"
    },
    {
        "query": "What Georgian-born dictator did Georgy Flyorov direct a letter to?",
        "response": "Joseph Stalin",
        "source": "hotpot_qa"
    },
    {
        "query": "Udo Proksch was born in a city that had how many residents on 1 January 2017 ?",
        "response": "320,587",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did Simple Plan perform at the award show held at Pauley Pavilion in Los Angeles?",
        "response": "Shut Up!",
        "source": "hotpot_qa"
    },
    {
        "query": "What distinction was awarded to the Indian Carnatic vocalist, musician, multi-instrumentalist and composer when he won the National Award for a Kannada language film based on the life and teachings of the founder of the Tattvavada philosophy, Madhvacharya?",
        "response": "Best Music Director",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Florian Gallenberger and Jackie Chan both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Mickey Rooney or Wilfred Lucas work in vaudeville? ",
        "response": "Mickey Rooney",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Thornton Wilder and Richard Llewellyn have in common?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "The Children Act is a film, released in which year, directed by Richard Eyre based on the novel, \"The Children Act\", it stars Stanley Tucci, an American character actor, writer, producer and film director?",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "The fourth Salman Rusdie novel was in part responsible for a film-poem created by whom in 1989?",
        "response": "Tony Harrison",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the actor whose son starred in \"The Son of Captain Blood\" become a U.S. citizen?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "Head Smash a graphic novel by writer Vlad Yudin, who was born in what country?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this hamlet and census designated place with a zip code of 11553, where The New York Express soccer team was based?",
        "response": "Uniondale, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "The Saratov Approach was released throughout a geographic region of the United States, settled by Mormons beginning in what year?",
        "response": "1850",
        "source": "hotpot_qa"
    },
    {
        "query": "What television show brought together director Coky Giedroyc and executive producer John Logan?",
        "response": "Penny Dreadful",
        "source": "hotpot_qa"
    },
    {
        "query": "Raymond Palmer co-wrote The Coming of the Saucers with an American aviator and businessman who made what is considered the first widely reported unidentified flying object sighting when?",
        "response": "June 24, 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the team Bill Fennelly coaches play their home games?",
        "response": "Hilton Coliseum",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Poor Kid\" is the fifteenth season finale of a series created by who ?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "The Council of Forty-four was one of how many central institutions of traditional Cheyenne Indian tribal governance, the other being the military societies such as the Dog Soldiers,  Cheyenne military societies are one of the two central institutions of traditional Cheyenne Indian tribal governance, the other being the Council of Forty-four?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "The Forde Inquiry was an inquiry into child abuse in a state bordered by the Coral Sea and what ocean?",
        "response": "Pacific Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "How did the son of the eldest child of the first U.S. Secretary of the Treasury die?",
        "response": "in a duel",
        "source": "hotpot_qa"
    },
    {
        "query": "Women from Yongduuni are known for production of a fat that is extracted from which tree ?",
        "response": "the African shea tree (\"Vitellaria paradoxa\")",
        "source": "hotpot_qa"
    },
    {
        "query": "One of Marcia Gay Harden's notable acting roles was in \"The Mist\" in 2007, based on a story by which famous author?",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does English footballer Jack King play home games?",
        "response": "Broadhall Way",
        "source": "hotpot_qa"
    },
    {
        "query": "What war did the owner of the Indianapolis 500 Speedway who jeopardized the 1946 AAA Championship Car season fight in? ",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "The philosopher that wrote How Are We to Live? is known for what 1975 book that argues in favor of vegetarianism?",
        "response": "\"Animal Liberation\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more awards for their work, Darren Benjamin Shepherd or Lilibet Foster?",
        "response": "Lilibet Foster",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the studio that released \"Dru Hill\" founded?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the founder of Tensor Trucks called?",
        "response": "Father of Street Skateboarding",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Garrett is the Athletic Director at what comprehensive university in Los Angeles?",
        "response": "California State University, Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Araya and Marcus Mumford were both what?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Victor Amaya and Mark Woodforde both former professional tennis players ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What series has 80 episodes confirmed for season 1 and stars an actress from the series \"La rosa de Guadalupe?\"",
        "response": "Soy Luna",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mimosa and Sidalcea both genus of plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the soccer player who was the head coach of the under-21 football team that has been playing since 1976?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "At what military reservation did Fred Ogilvie serve as captain, which also covers 101733 acre in Geary and Riley counties?",
        "response": "Fort Riley",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ralph Ceder and Norman Foster a film director?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What author, who Tom Wolfe called a \"writer to watch\" in a speech in 2010, wrote a book detailing the efforts by the governments on United States and Colombia to stop the illegal activities committed by drug lord Pablo Escobar?",
        "response": "Mark Bowden",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of communication medium does The Playboy Club and Laura Benanti have in common?",
        "response": "television",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is one other client that is represented by the same person that also represents a barrister at Doughty Street Chambers?",
        "response": "Angelina Jolie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who s the original and current lead singer of the Japanese heavy metal band, Loudness, Dave Matthews or Minoru Niihara?",
        "response": "Minoru Niihara",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie starring Jane Seymour depicted the response of Danish citizens to Hitler's order regarding Danish Jews?",
        "response": "The Only Way",
        "source": "hotpot_qa"
    },
    {
        "query": "Which three-time Olivier Award winning English actress starred in the 1981 BBC television serial, Sons and Lovers?",
        "response": "Dame Eileen June Atkins",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was formerly known as something else, Women's Running or Playgirl?",
        "response": "Women's Running",
        "source": "hotpot_qa"
    },
    {
        "query": "The Norman Conks (or Norman Conquerors) were a large Catholic sectarian street gang active in Glasgow, they were often involved in street fighting with which Protestant group, from Bridgeton, and is also a loyalist song, with a title of its same name, from Glasgow?",
        "response": "Billy Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Fast Lane was a 1987 game by a company from what country?",
        "response": "Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who controls the Under-21 Team where Maceo Rigters used to play?",
        "response": "Royal Dutch Football Association",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Rigoletto and Die tote Stadt have the same number of acts?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1995 Australian-American comedy-drama film, features the voice of American voice actress, Christine Cavanaugh?",
        "response": "Babe",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the starring basketball player in the movie that Ryan Woodward worked on that was about basketball?",
        "response": "Michael Jordan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is a hunting dog, the Pudelpointer or the Chinese Imperial Dog?",
        "response": "The Pudelpointer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2017 comedy loosely based on the real-life relationship between Kumail Nanjiani and Emily Gordon, played by Zoe Kazan?",
        "response": "Michael Showalter",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Rafael Nadal and Kimberly Po known for playing tennis? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Stuss or Jewish Faro is a card game, a variant of which late 17th-century, French gambling card game?",
        "response": "Faro",
        "source": "hotpot_qa"
    },
    {
        "query": "English actor John Alderton plays Thomas Watkins in which British TV drama series?",
        "response": "Upstairs, Downstairs",
        "source": "hotpot_qa"
    },
    {
        "query": "Scott Watters became the senior coach of the St Kilda Football Club in what year?",
        "response": "2012 to 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Wuhai and Yulin, Shaanxi, are located in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "A custom motorcycle is the style created by which lifestyle brand company out of Newburgh, New York?",
        "response": "Orange County Choppers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who appeared in the 1979 Italian-American science fiction horror film, The Visitor, who also is an American author, attorney, and former libertarian radio host?",
        "response": "Neal A Boortz, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": " The Reach Foundation is a youth foundation established by an Irish-born footballer who converted from Gaelic football to what?",
        "response": "Australian rules football",
        "source": "hotpot_qa"
    },
    {
        "query": "Pajottenland has historically provided beers that include are fermented through yeasts native to what valley?",
        "response": "Zenne",
        "source": "hotpot_qa"
    },
    {
        "query": "Going for Broke is a 1984 album by Eddy Grant, it featured the U.S. hit \"Romancing the Stone\",was intended for the 1984 feature film of the same name, in fact was announced by Casey Kasem, Kasem was an American disc jockey, music historian, radio personality, voice actor, and actor, known for being the host of several music radio countdown programs, most notably for which program series?",
        "response": "American Top 40",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that had \"No Reason\" as its main track?",
        "response": "John Mallory Asher",
        "source": "hotpot_qa"
    },
    {
        "query": " Kenneth Anderson served under the General who was which President of the United States?",
        "response": "34th",
        "source": "hotpot_qa"
    },
    {
        "query": "What was this major international multi-sport event, with the opening ceremonies taking place on 27 July, and in which the South African field hockey player Bernadette Coston competed for the outh Africa women's national field hockey team?",
        "response": "2012 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2014 Tollywood romantic comedy produced by Manchu Vishnu which starred a Canadian born actress born in 1981 who was a former pornstar?",
        "response": "G. Nageswara Reddy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actors starred in Curly Sue is an American comic actor, voice actor, comedian, singer and musician?",
        "response": "Jim Belushi",
        "source": "hotpot_qa"
    },
    {
        "query": "Last Dinosaurs and Uverworld are both what?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born later, Jerry Garcia or Joe Gooch?",
        "response": "Joe Gooch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 1996 British drama film written and directed by Mike Leigh, that was produced by a man who formed the film production company Thin Man Films in 1988?",
        "response": "Secrets & Lies",
        "source": "hotpot_qa"
    },
    {
        "query": "What national historic district is located near a village in the town of Philipstown, New York?",
        "response": "Valhalla Highlands Historic District",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are one of the music group from which Freudian production was derived from? ",
        "response": "Toronto, Ontario",
        "source": "hotpot_qa"
    },
    {
        "query": "who published the  American comic that features in Batman: Fear Itself",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Sandra Sdraulig, executive coach and owner of Through the Roof, is chairman of an international film festival held over two weeks in mid October where?",
        "response": "Adelaide, South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Negusie, claimed he was forced to assist in the mistreatment of prisoners in a country that has an area of how many square Kilometers ?",
        "response": "117600 km2",
        "source": "hotpot_qa"
    },
    {
        "query": "The screenplay for Alain Resnais' second film is who?",
        "response": "Alain Robbe-Grillet.",
        "source": "hotpot_qa"
    },
    {
        "query": "After working for DC Comics, Roy Thomas then became editor-in-chief at which comic book company?",
        "response": "Marvel Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Innervision is a song from the studio album released on what date?",
        "response": "November 26, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-created this American variety television series about children demonstrating talents and engaging in conversation broadcast by NBC along with the host of \"Family Feud?\"",
        "response": "Ellen DeGeneres",
        "source": "hotpot_qa"
    },
    {
        "query": "John Williams Stoddard's cousin served in which American war?",
        "response": "He served as a general in the Union Army during the American Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city where Sree Kulathoor Kolathukara Shiva Temple is located?",
        "response": "957,730",
        "source": "hotpot_qa"
    },
    {
        "query": "Which German-based group followed ABBA's lead in the early 90s by issuing a greatest-hits compilation called Gold?",
        "response": "Boney M.",
        "source": "hotpot_qa"
    },
    {
        "query": "What British made dance competition television series franchise did Claudia Albertario appear on?",
        "response": "\"Dancing on Ice\" around the world",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Consumers Digest and Antic both computer magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Ted Sharks and Carlos Reygadas both worked in what industry?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, The Life of Birds or Genghis Blues?",
        "response": "The Life of Birds",
        "source": "hotpot_qa"
    },
    {
        "query": "Plymouth Regional High School is located in what county?",
        "response": "Grafton County",
        "source": "hotpot_qa"
    },
    {
        "query": "Elymus and Nicandra, are types of what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "The movie that featured Nooksack Falls in a hunting scene is set in what Pennsylvania town?",
        "response": "Clairton",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the title of the memoir that the daughter of the \"Washington Post\" newspaper publisher and Federal Reserve Chairman wrote?",
        "response": "Personal History",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lydia Zimmermann and Miranda July Canadian film directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Anthony John Abbott has been a member of parliament for an Australian division in which state ?",
        "response": "New South Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Ki-duk (born December 20, 1960) is a South Korean filmmaker noted for his idiosyncratic art-house cinematic works, major festival awards include Golden Lion at 69th Venice International Film Festival for \"Pietà\", Pietà is a South Korean film, in which year?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the member of Country Flavour was born on October 20, 1942?",
        "response": "Philomena Begley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the singer of one of the songs that \"Just the Two of Us\" was behind on the \"Billboard\" Hot 100?",
        "response": "Kim Carnes",
        "source": "hotpot_qa"
    },
    {
        "query": "The recording of a musical released as an album on April 2 starred an English actress, singer, and what?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Karen Carpenter and Mark Mothersbaugh both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Port Island is an artificial island in a city in japan that is located on the southern side of the main island of Honshu, and is about 30 km from what city?",
        "response": "Osaka",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was Hunter Greene drafted into Major League Baseball?",
        "response": "June 12, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Just the Way You Are is a 1984 American comedy-drama film starring which American actress and singer?",
        "response": "Christina Ann McNichol",
        "source": "hotpot_qa"
    },
    {
        "query": "Mario Cárdenas Guillén is the brother of the Mexican drug lord who was the former leader of what group?",
        "response": "Gulf Cartel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are All Time Low and The Raconteurs both American bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the city where American mixed martial artist Micah Miller trains?",
        "response": "Butterfly Capital of the World",
        "source": "hotpot_qa"
    },
    {
        "query": "who played Thomas Andrews in Titanic",
        "response": "Victor Joseph Garber",
        "source": "hotpot_qa"
    },
    {
        "query": "Do GO and Print cover the same topic areas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stuff (also known as Larry Cohen's The Stuff) is a 1985 American satirical science fiction horror film written, produced, and directed by Larry Cohen and stars included is which American comedian and actor, he was part of the original cast of the sketch comedy program \"Saturday Night Live\", appearing from 1975 to 1980?",
        "response": "Garrett Morris",
        "source": "hotpot_qa"
    },
    {
        "query": "Gerhard Thiele and Patrick Baudry, have which occupation in common?",
        "response": "astronaut",
        "source": "hotpot_qa"
    },
    {
        "query": " \"I Am What I Am\" is a song performed by the character of Albin Mougeotte, first played by an actor of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boar's Nest is the local restaurant and tavern in an American action-comedy television series that aired for how many seasons?",
        "response": "seven seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Which region has a larger population, Guangshui or Lüshunkou District",
        "response": "Lüshunkou District",
        "source": "hotpot_qa"
    },
    {
        "query": "SAVAK was dissolved during the outbreak of the overthrow of which dynasty?",
        "response": "Pahlavi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the vocalists which performed Geary Lanier Faggett's song was born in December 5, 1931?",
        "response": "James Cleveland",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of films are both Outfoxed and Transparent?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Kamala Chakravarty was married from 1967 to 1981 to a musician born in what year?",
        "response": "1927",
        "source": "hotpot_qa"
    },
    {
        "query": "The Silverdome refers to the stadium that opened in what year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant, Ferocactus or Bellium, is native to the Mediterreanean?",
        "response": "Bellium",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American artist who was part of a duo that mainly painted on the streets of downtown Manhattan?",
        "response": "Jean-Michel Basquiat",
        "source": "hotpot_qa"
    },
    {
        "query": "The explosive Pyrotol was known for being used in a 1927 bombing commited by who?",
        "response": "Andrew Kehoe",
        "source": "hotpot_qa"
    },
    {
        "query": "Ardleigh Reservoir supplies water to what company that is regulated under the United Kingdom Water Industry Act 1991?",
        "response": "Anglian Water",
        "source": "hotpot_qa"
    },
    {
        "query": "MAKO Surgical Corp accepted a deal from Stryker for what amount?",
        "response": "$1.65B",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Glenn Gregory and Jeffrey Steele co-collaborators on the hit song \"Temptation?\"",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "How many pop standards does on of the musical that Broadway Worldwide has captured and distributed, havs songs written by songwriters Jerry Leiber and Mike Stoller?",
        "response": "39",
        "source": "hotpot_qa"
    },
    {
        "query": "Sophia King was appointed to the Chicago City Counsel by the 44th and current mayor of Chicago, who was born on what day?",
        "response": "born November 29, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the location of the state secondary school Agnes Body was the founding head of (Apart from Queen Margaret's School)?",
        "response": "on \"Wragby Road\" in Lincoln, Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the town where Chet Chadbourne was born?",
        "response": "843",
        "source": "hotpot_qa"
    },
    {
        "query": "Is McGhee Tyson Airport or Bemidji Regional Airport further west?",
        "response": "Bemidji Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the younger sister of Tanushree Dutta appear in a Kannada comedy film directed by Pon Kumaran?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the canal on the south east side of which Canoe Place opened?",
        "response": "4700 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Not About Angels was used in the film adaptation of what novel by John Green?",
        "response": "The Fault in Our Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the founder of the Friend of Ireland born?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ANA motorcycle engine is named after a dragon in Norse mythology?",
        "response": "Fafnir became a dragon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the largest city in Trego County?",
        "response": "1,862",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the composer of \"Anthem\" born?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in  Suffolk County in Nw York that houses a subsidiary of Anheuser-Busch InBev?",
        "response": "Patchogue",
        "source": "hotpot_qa"
    },
    {
        "query": "S Voice is an intelligent personal assistant and knowledge navigator, which is only available as a built-in application for the Samsung Galaxy S III, and  Samsung Galaxy Note 4 is an Android phablet smartphone, developed and produced by which organization?",
        "response": "Samsung Electronics",
        "source": "hotpot_qa"
    },
    {
        "query": "In which district of Boston is the flagship station of the Boston Bruins Radio Network located?",
        "response": "Allston",
        "source": "hotpot_qa"
    },
    {
        "query": " Jordan's Furniture is a furniture retailer with a location in an enclosed shopping mall on the north side of Interstate 295 near what?",
        "response": "the junction with Interstate 95",
        "source": "hotpot_qa"
    },
    {
        "query": "Someone Like You is a collection of stories by a notable author who sold how many copies of his books?",
        "response": "250 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What Austrian composer of Um Mitternacht was best known for his symphonies, masses, and motels?",
        "response": "Anton Bruckner",
        "source": "hotpot_qa"
    },
    {
        "query": "Southwest Airlines Flight 1763 left which primary commercial airport serving Las Vegas?",
        "response": "McCarran International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alcoholic beverage company sponsored the Martini International professional golf tournament?",
        "response": "Martini & Rossi",
        "source": "hotpot_qa"
    },
    {
        "query": "What cover song by hard rock/blues rock band AC/DC was included on the 1.22.03 Acoustic EP?",
        "response": "Highway to Hell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was produced first, Gay Sex in the 70s or Listen to Britain?",
        "response": "Listen to Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "Love stars which Taiwanese actress and model?",
        "response": "Shu Qi",
        "source": "hotpot_qa"
    },
    {
        "query": "Spice Girls Live at Wembley Stadium is the DVD of pop band Spice Girls' tour, \"Spiceworld Tour\", in which year, the show was recorded after Geri Halliwell left the band?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "From 1985 to 1988 Jack Burns served as offensive coordinator at the University of Louisville under a football coach that won a national championship with Miami in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Born March 1, 1966 who directed a film written by Chris Terrio and Joss Whedon",
        "response": "Zack Snyder",
        "source": "hotpot_qa"
    },
    {
        "query": "What electronic attack squadron is permanently stationed on two pieces of land near Oak Harbor?",
        "response": "Black Ravens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Steven Fonti movie features songs by Carly Simon?",
        "response": "Pooh's Heffalump Movie",
        "source": "hotpot_qa"
    },
    {
        "query": "What Tony Award winner directed and co-produced Six by Sondheim?",
        "response": "James Elliot Lapine",
        "source": "hotpot_qa"
    },
    {
        "query": "What character played by Gary Dubin in a 1978 American thriller film directed by Jeannot Szwarc?",
        "response": "Eddie Marchand",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these two pizzerias has had the same owners for longer, Regina Pizzeria or Pietro's Pizza?",
        "response": "Regina Pizzeria",
        "source": "hotpot_qa"
    },
    {
        "query": "The family that James Roosevelt was a part of was descended from what nationality of immigrants?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Cabañeros National Park and Teide National Park are both located where?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "In what countries was the FIFA World Cup held during which Bruno Metsu coached Senegal into the quarter-finals?",
        "response": "South Korea and Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Canadian-American actor, voice actor, comedian, screenwriter, and graphic artist, who was part of the cast of NewsRadio, in his final regular role before his death?",
        "response": "September 24, 1948May",
        "source": "hotpot_qa"
    },
    {
        "query": "What team and sport was played by Juaquin Iglesias and coached by Lincoln Riley?",
        "response": "Oklahoma Sooners football",
        "source": "hotpot_qa"
    },
    {
        "query": "Once Upon a Time in London is an upcoming British crime film directed by Simon Rumley, the film is about the notorious gangsters Billy Hill and which English gangster, that died on 12 March 1996?",
        "response": "Jack Comer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Carol Kane or Andy Kaufman?",
        "response": "Andy Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "Do No Harm was an episode of what series that was on ABC from 2004 to 2010?",
        "response": "Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "The fictional Godfather character Moe Greene is based on a mobster born in what year? ",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two English musicians, Baz Warne or Dave Wakeling, who was born first?",
        "response": "David Wakeling",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the politician Ed Rollins was the national campaign chairman for?",
        "response": "Michael Dale Huckabee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Elizabeth Peña co-star in alongside Tim Robbins and Danny Aiello?",
        "response": "Jacob's Ladder",
        "source": "hotpot_qa"
    },
    {
        "query": "The Westinghouse J34 is essentially an enlarged version of a turbojet engine that was the first American-designed turbojet to run, and only the second axial-flow turbojet to run outside of what country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 196 wildlife refuge is located in a hamlet on the South Shore of Long Island?",
        "response": "Seatuck National Wildlife Refuge",
        "source": "hotpot_qa"
    },
    {
        "query": "C. Scott Vanderhoef was the running mate of the minority leader who is now part of which New York district?",
        "response": "19 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many years did the animal who had a role in 2010 FIFA world cup as Sonny Wool in 2011 Rugby world cup live ?",
        "response": "(26 January 2008 – 26 October 2010)",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of the founder of MAD Symposium?",
        "response": "16 December 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Becca album features a guest appearance by a Ghanaian traditional musician known for his unique style of music alongside the kologo?",
        "response": "\"Time 4 Me\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the star actor of The Getaway?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "how is University of Minnesota and Georgia Institute of Technology connected?",
        "response": "research",
        "source": "hotpot_qa"
    },
    {
        "query": "Jules Halfant designed a record for which American folk singer-songwriter?",
        "response": "Tom Paxton",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Nogometno Društvo Črnuče's manager in 1994 born?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Which univerisity was founded 1838, Virginia Commonwealth University or Stevens Institute of Technology?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was the actor, who also appeared in \"The Hellions,\" nominated for the BAFTA Award for Best Supporting Actor?",
        "response": "Equus",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in the film \"Thillana Mohanambal\" is associated with a double reed wind instrument?",
        "response": "Shanmugasundaram",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the American baseball player who was a outfielder and Baseman also nicknamed Stan the Man?",
        "response": "Stan Musial",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is located within the North Coast region and on the Pacific Highway?",
        "response": "Woolgoolga, New South Wales, Australia.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the 1996 American science fiction Western film in which the actress who played Kelly Gaines on \"Cheers\" stars?",
        "response": "Sam Irvin",
        "source": "hotpot_qa"
    },
    {
        "query": "Temple University and University of Oklahoma, are located in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Focus Brands, owner of Moe's Southwest Grill informally known as Moes, based?",
        "response": "Sandy Springs, Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to having research and development facilities for Fila, Montebelluna also is the place where Geox is based, what is Geox?",
        "response": "an Italian brand of shoe and clothing",
        "source": "hotpot_qa"
    },
    {
        "query": "The Korean program Homo Academicus was narrated by the child actor that achieved fame in which 2002 film?",
        "response": "The Way Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man was a comedian, Harry Stephen Keeler or Bob Monkhouse?",
        "response": "Robert Alan \"Bob\" Monkhouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Gale co-wrote the sci-fi film directed by whom?",
        "response": "Robert Zemeckis",
        "source": "hotpot_qa"
    },
    {
        "query": "The WEMF AG für Werbemedienforschung collects figures on what in Switzerland?",
        "response": "media usage",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the fruit, part of the flowering plant species in the palm family Arecaceae, most popular?",
        "response": "Malta",
        "source": "hotpot_qa"
    },
    {
        "query": "Which So You Think You Can Dance Contestant trained at the sister school of the Arts Educational School, London?",
        "response": "Charlotte \"Charlie\" Bruce",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that is loosely based on Mahavir Singh Phogats life?",
        "response": "Nitesh Tiwari",
        "source": "hotpot_qa"
    },
    {
        "query": "What college did The 1992 San Diego State Aztecs represent in the WAC?",
        "response": "San Diego State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sister of Margarita \"Peggy\" Schuyler Van Rensselaer is sometimes called Betsey?",
        "response": "Elizabeth Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "WHo was born first, Peter Furler or Fred Schneider?",
        "response": "Frederick William Schneider",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played the brother of the character in The Wind That Shakes the Barley that was portrayed by the actor of Lord George Boleyn in Showtime's \"The Tudors\"?",
        "response": "Cillian Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was the location of a a 1990 horror comedy film directed by Claudio Fragasso (under the pseudonym Drake Floyd) and starring Michael Stephenson, George Hardy, Margo Prey, Connie McFarland, Deborah Reed and Jason Wright?",
        "response": "Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the University of Groningen where the famous neuroscientist Andre Aleman is a professor?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the licensed-built version of the American Northrop F-5 Freedom Fighter that the military aviation branch of the Netherlands Armed Forces used?",
        "response": "the NF-5",
        "source": "hotpot_qa"
    },
    {
        "query": "The Clemson Tigers competed in the 2015 Orange Bowl in what city?",
        "response": "Glendale, Arizona",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the  motto of the college where Daniel Julius Bernstein is a mathematics and computer science professor?",
        "response": "\"Mens agitat molem\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Among Miriam Toews and Heiner Müller who was dramatist?",
        "response": "Heiner Müller",
        "source": "hotpot_qa"
    },
    {
        "query": "Rani was best known for the song that was actually sung by a woman who is from what South Indian state?",
        "response": "Tamil Nadu",
        "source": "hotpot_qa"
    },
    {
        "query": "which  fully accredited, degree-granting art college  was  Agnes Bushell  taught literature and writing",
        "response": "Maine College of Art",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band members remained in the band Devil Wears Prada after their \"Dead Throne US Tour\"?",
        "response": "Mike Hranica (vocals, additional guitar), Jeremy DePoyster (rhythm guitar, vocals), Kyle Sipress (lead guitar, backing vocals), and Andy Trick (bass)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Gladys Louise Smith's husband, often confused with Charles R. Rogers?",
        "response": "Charles \"Buddy\" Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahavas Sholem Synagogue has windows that contain the shape that is in what form?",
        "response": "hexagram",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the moth found in a country bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by Rwanda, and to the south by Tanzania?",
        "response": "Scythris sciochalca",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Eyes is a 2014 American biographical film directed by Tim Burton, and starring which Austrian-German actor?",
        "response": "Christoph Waltz",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine, which was headquartered in San Francisco, California, was Richard Dalton a featured columnist for?",
        "response": "InformationWeek",
        "source": "hotpot_qa"
    },
    {
        "query": " Elkhan Mammadov is the project leader for the bid for which quadrennial competition?",
        "response": "UEFA Euro 2020",
        "source": "hotpot_qa"
    },
    {
        "query": "Retired pro wrestler John \"Bradshaw\" Layfield created The Cabinet as a pro wrestling stable as part of what WWE brand?",
        "response": "SmackDown",
        "source": "hotpot_qa"
    },
    {
        "query": "Akumadan is the capital of Offinso North, the Offinso North District is one of the twenty-seven (27) districts in the Ashanti Region of Ghana, and its capital is which location?.",
        "response": "Akomadan",
        "source": "hotpot_qa"
    },
    {
        "query": "Dove c'è musica (\"Where There Is Music\") is the seventh studio album by Italian pop/rock singer Eros Walter Luciano Ramazzotti, released in 1996 on which label , he has released most of his albums in both Italian and Spanish?",
        "response": "BMG label",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  college football stadium was 2014 Boca Raton Bowl played ",
        "response": "FAU Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kangchenjunga and Trivor both mountains?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What suicide attack was located inside the Forward Operating Base Chapman? ",
        "response": "Camp Chapman attack",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the the Trinity College Quirks sung with a collegiate a cappella singing group established at Yale University?",
        "response": "Infinity Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the laboratory where yttralox was first produced located ?",
        "response": "Schenectady, New York.",
        "source": "hotpot_qa"
    },
    {
        "query": "Was InStyle or Spin founded first?",
        "response": "Spin is an American music magazine founded in 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the 2002 American superhero horror film, based on a fictional Marvel Comics character, written by David Goyer, which is a sequel of the first film, and whose third and subsequent film called Trinity stars Wesley Snipes?",
        "response": "Blade II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more titles, Kathy Jordan or Stan Smith?",
        "response": "Kathryn \"Kathy\" Jordan",
        "source": "hotpot_qa"
    },
    {
        "query": "At which convention in Atlanta does A. J. Hartley regularly present?",
        "response": "Dragon Con",
        "source": "hotpot_qa"
    },
    {
        "query": "To which college is the school that Himanshu Roy is an alumni of affiliated with?",
        "response": "University of Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Bryniarski starred in which Michael Bay classic film remake?",
        "response": "The Texas Chainsaw Massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Social Suicide is a 2015 British romantic drama thriller which reunited Olivia Hussey and an English actor and singer touted as a star in the making, the next Laurence Olivier and the next what?  ",
        "response": "great British actor",
        "source": "hotpot_qa"
    },
    {
        "query": "What Manhattan school did the American filmmaker Sebastian Sommer study at?",
        "response": "Tisch School of the Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the club founded that played Manchester City in the 1972 FA Charity Shield",
        "response": "1874",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the architect who in 1905 designed the wing of By-the-Harbor containing a ballroom born?",
        "response": "1853",
        "source": "hotpot_qa"
    },
    {
        "query": "Earth Sound Research was located in what New York county?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "François Roland Truffaut, was a French film director, screenwriter, producer, actor, and film critic, as well as one of the founders of the French New Wave, he also directed such other classics as Day for Night, a French film directed by François Truffaut, released in what year?",
        "response": "1973",
        "source": "hotpot_qa"
    },
    {
        "query": " The 1974 Super Outbreak was the second-largest tornado outbreak on record for a single 24-hour period, just behind an outbreak with how many tornadoes confirmed?",
        "response": "362",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of NASA when a United States Marine Corps aviator circled the Earth three times?",
        "response": "Dyer Brainerd Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Bridge Day is an annual one-day festival in Fayetteville, Fayette County, West Virginia, United States The event is coordinated by the New River Gorge Bridge Day Commission, the event, held on the third Saturday every October, commemorates the 1977 completion of which steel arch bridge 3030 ft long over the New River Gorge near Fayetteville, West Virginia, in the Appalachian Mountains?",
        "response": "New River Gorge Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Which theme park in Perth, Western Australia is Abyss located at",
        "response": "Adventure World",
        "source": "hotpot_qa"
    },
    {
        "query": "Sweating Bullets is from which 1992 Megadeth album?",
        "response": "Countdown to Extinction",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport did Emmanuel Adebayor play?",
        "response": "The song was endorsed by African footballers Emmanuel Adebayor and Samuel Eto'o.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed and co-wrote the film \"Forget to Remember\" was first featured in?",
        "response": "Darren Lynn Bousman",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the company with which Tashi Dorje performs as a soloist formed?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Laura Dern or Peggy Feury?",
        "response": "Peggy Feury",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2016 American drama film stars an American actress best known for her roles in the films \"The Unborn\" (2009) and \"Beautiful Creatures\" (2013) and for portraying Rachel Posner in the Netflix series \"House of Cards\"?",
        "response": "Burn Country",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Rector of an evangelical Anglican church in the city of Adelaide, South Australia from 1957-1973 born?",
        "response": "Elsternwick, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "What film genre links Baghdad ER and Olympia?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was The Struggle for Mastery in Europe, by A. J. P. Taylor, published by the Clarendon ",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Who became a tobacconist in Stratford-upon-Avon and Judith Shakespeare's husband?",
        "response": "Thomas Quiney",
        "source": "hotpot_qa"
    },
    {
        "query": "What American astronaut from Hawaii has a United States Air force Test Pilot Scool award named after him?",
        "response": "Ellison Onizuka",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Helmut Käutner and Hou Hsiao-hsien from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor, screenwriter, director, producer, singer-songwriter and author sang this song from the 1971 movie \"Willy Wonka & the Chocolate Factory\" that was written by British composers Leslie Bricusse and Anthony Newley?",
        "response": "Gene Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "From what country is the female star of the made-for-television drama Common?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of category does Acantholimon and Podranea have in common?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "What character does Alexis Knapp play in the series of movies about Barden University's singing group, Pitch Perfect?",
        "response": "Stacie Conrad",
        "source": "hotpot_qa"
    },
    {
        "query": "What manufacturer was founded by the husband of Moya Lear?",
        "response": "Lear Jet Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Weirdmageddon 3: Take Back The Falls was the series finale of the television program produced by what company?",
        "response": "Disney Television Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Leeland Road station has a line that runs 1522 miles from New York City to what other major hub?",
        "response": "Miami, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county of Maine is the town in which the West Lebanon Historic District is located?",
        "response": "York County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wometco Home Theater (WHT) was an early pay television service in the New York City area, that was owned by Miami-based Wometco Enterprises, the signals were broadcast beginning in August 1977, and later on WSNL-TV (channel 67) out of Smithtown, a town in Suffolk County, New York, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Church of St Peter in Pertenhall, Bedfordshire, England was added to this register on 13 July 1964.",
        "response": "Statutory List of Buildings of Special Architectural or Historic Interest",
        "source": "hotpot_qa"
    },
    {
        "query": "Old Rectory is in a small town and civil parish where?",
        "response": "North Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "This aircraft carrier served as a recovery ship for this flight which circled the earth how many times?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of second extended play by the artists of the mini-abum Code#01?",
        "response": "Code#02 Pretty Pretty",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the institution headed by \"The Last Universalist\" during the 19th century charged with?",
        "response": "the improvement of nautical navigation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Acanthophoenix and Alder a genus of flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both the Small Münsterländer and Grand Anglo-Français Tricolore dog breeds?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "JoBeth Williams starred in the tv miniseries Murder Ordained, What was the name of her 1994 short film?",
        "response": "On Hope",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Margarethe von Trotta or Mike Nichols?",
        "response": "Mike Nichols",
        "source": "hotpot_qa"
    },
    {
        "query": "What recipient of Karnataka State Film Award had worked with a composer popular for his foot tapping musical scores?",
        "response": "Anuradha Bhat",
        "source": "hotpot_qa"
    },
    {
        "query": "Which grouping of the Conquest was the founder of Dieulacres Abbey described as being almost the last relic of?",
        "response": "the great feudal aristocracy",
        "source": "hotpot_qa"
    },
    {
        "query": "What code was named after the man who also had Fort Kearny named after him?",
        "response": "The Kearny code",
        "source": "hotpot_qa"
    },
    {
        "query": "Which private, nonsectarian institution has a famous artist featured in major museum solo shows?",
        "response": "Pratt Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Ruscus and Oxalis, which one has more number of known species?",
        "response": "Oxalis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is located nearer to a major city, Albuquerque International Sunport or Barkley Regional Airport?",
        "response": "Albuquerque International Sunport",
        "source": "hotpot_qa"
    },
    {
        "query": "The Leopard, in Italian, The Serval, a 1963 Italian epic period drama film by director Luchino Visconti, the serval (\"Leptailurus serval\"), also known as the tierboskat, is a wild cat found in which continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was picked last in the NFL draft of 2017 and named Mr. Irrelevant?",
        "response": "Chad Patrick Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the current stadium for the team Andy Rincon started his professional career with?",
        "response": "Busch Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Osie Leon Wood III (born March 25, 1962), is an American former professional basketball player, was a first round NBA draft pick, during the 1984 NBA draft was the 37th annual draft of the National Basketball Association (NBA), held in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What Mexican drug lord know as \"El Más Loco\" (English: \"The Craziest One\") preached his organization's divine right to eliminate their enemies?",
        "response": "Nazario Moreno González",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Karnig Sarkissian and Robert Philibosian both American citizens",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2016, how many locations does the barbeque restaurant that was founded by a former Assistant Secretary - Indian Affairs have?",
        "response": "170 locations",
        "source": "hotpot_qa"
    },
    {
        "query": "Family Jewels is a compilation DVD by the hard rock band AC/DC, the second disc contains material from the era (1980–1991) of which English singer and songwriter? ",
        "response": "Brian Francis Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which park in Manhattan can be seen from the San Remo, the 27-floor apartment building opened in 1930?",
        "response": "Central Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bidens and Browningia both types of barbed plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a television commercial with Chief Zee and also attended Indiana University?",
        "response": "Antwaan Randle El",
        "source": "hotpot_qa"
    },
    {
        "query": "Prem Granth is a Hindi movie which was released in India, which star of the movie, is also known by her married name Madhuri Dixit Nene?",
        "response": "Madhuri Dixit",
        "source": "hotpot_qa"
    },
    {
        "query": "Which outdoor shopping center in Orlando, Florida has a store that was the largest bath shop chain in the United Staes in 1997?",
        "response": "Pointe Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the tutor of the person San Casimiro is named after?",
        "response": "Johannes Longinus",
        "source": "hotpot_qa"
    },
    {
        "query": "What film, directed by Bryan Singer, has a video game released by Paradox on the Game Boy Color and PlayStation?",
        "response": "X-Men",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is bigger, Griffon Bruxellois or English Mastiff?",
        "response": "English Mastiff",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1599 play was remade into An Honourable Murder?",
        "response": "Honourable Murder",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress who, along with Laurence and Lydia Fox, is a grandchild of Robin Fox born?",
        "response": "1974",
        "source": "hotpot_qa"
    }
]