[
    {
        "query": "What town did the 2013 Maine Black Bears football team play their home games in?",
        "response": "Orono, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Yup'ik or Yupiaq, etc, are are the indigenous peoples who have traditionally inhabited the northern circumpolar region from eastern Siberia (Russia), across Alaska (United States), Canada, and Greenland, people of western and southwestern Alaska, the people are traditionally called?",
        "response": "Eskimo",
        "source": "hotpot_qa"
    },
    {
        "query": "Night Convoy is a 1932 German drama film directed by which Austrian film and theatre actor, who went on to work in Germany, Britain and America, born on 12 August 1898?",
        "response": "Oskar Homolka",
        "source": "hotpot_qa"
    },
    {
        "query": "Potassium bitartrate, sugar, water, colourings and flavorings can be combined to make which Scottish confection?",
        "response": "Edinburgh rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a presidential nominee and praised Rober Pape's \"Dying to Win\"?",
        "response": "Ron Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the French name of the bay into which the Big Salon River flows?",
        "response": "Baie de Fundy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hanafuda and Okey both card games?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player is second in line behind the keeper who plays for FC Barcelona and the Netherlands national team?",
        "response": "Diederik Boer",
        "source": "hotpot_qa"
    },
    {
        "query": "The movie\"Fortress\" takes its name from what iconic bomber in the Second European War? ",
        "response": "Boeing B-17",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant genus is part of a family with a longer name, Morning glory or Rothmannia?",
        "response": "Morning glory",
        "source": "hotpot_qa"
    },
    {
        "query": "Which major mid-20th century film director lived longer, Philip Ford or Julien Duvivier?",
        "response": "Philip Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played in a 1996 film as Queen of Denmark?",
        "response": "Gertrude",
        "source": "hotpot_qa"
    },
    {
        "query": "What doctor survived the massacre that took place March 27, 1836, during the Texas Revolution?",
        "response": "Jack Shackelford",
        "source": "hotpot_qa"
    },
    {
        "query": "The Game of Life and Game of the Goose are both what?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the magazine that Dr. Eugene B. Habecker is the chairman of get founded?",
        "response": "1956",
        "source": "hotpot_qa"
    },
    {
        "query": "The Football League Super Cup was formed in response to an incident when escaping fans were pressed against a collapsing wall in what stadium?",
        "response": "Heysel Stadium in Brussels",
        "source": "hotpot_qa"
    },
    {
        "query": "who wrote the screen play for the opening night film at the 2013 Deauville American Film Festival ?",
        "response": "Richard LaGravenese",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Mike Shinoda and Shannon Hoon of the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of LL Cool J's co-host during the one-hour TV special to announce nominations for the 55th Annual Grammy Awards?",
        "response": "Alison",
        "source": "hotpot_qa"
    },
    {
        "query": "Which organization held the European championships that Maxime De Zeeuw played in in 2011?",
        "response": "FIBA Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "Us Conductors accounts the relationship between  Clara Rockmore and this inventor who is most famous for his invention of what?",
        "response": "theremin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the single-player adventure game created by Scott Benson and Alex Holowka?",
        "response": "Night in the Woods",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998–99 Utah Jazz season Most Valuable Player was a player known by what nickname",
        "response": "\"The Mailman\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the singer of the song \"Rain\" during her middle school years?",
        "response": "Starlight Academy",
        "source": "hotpot_qa"
    },
    {
        "query": "Holme Moss is a moor in a region of England containing what forest in the west?",
        "response": "Forest of Rossendale",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did the attacks occur in which Ma Anand Sheela was found guilty for her role in?",
        "response": "Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "How many films did the star of Tum Milo Toh Sahi appear in? ",
        "response": "110",
        "source": "hotpot_qa"
    },
    {
        "query": "The Song of Iowa is set to the tune of what German Christmas Song?",
        "response": "O Tannenbaum",
        "source": "hotpot_qa"
    },
    {
        "query": "the Tacca and the Zenobia are both native to South America?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Dolly Teen Choice Awards was held at the park located at what area?",
        "response": "Milsons Point",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Seiya: Next Dimension is published in which Akita Shoten-published manga magazine?",
        "response": "Weekly Shōnen Champion",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Astrantia and Lime a genus of plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth name of the ex-slave abolitionist featured in the art installation The Dinner Party?",
        "response": "Isabella (Belle) Baumfree",
        "source": "hotpot_qa"
    },
    {
        "query": "What State did the Congressman who introduced the Federal Reserve Transparency Act represent?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "By what name was the city, in which the company Prior Radiofabrikk was located, known from 1877 until 1925 ?",
        "response": "Kristiania",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lintong District included the sculptures that depicted the armies of which first Chinese emperor?",
        "response": "Qin Shi Huang",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Australian professional women's basketball team has an American playing in it?",
        "response": "Adelaide Lightning",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does Chelsea Walls and Hotel Chelsea have in common?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the largest county by area where the Dick Conner Correctional Center is located?",
        "response": "Osage County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sisters of Mercy frontman had a side project called what?",
        "response": "The Sisterhood",
        "source": "hotpot_qa"
    },
    {
        "query": "Sendapperuma Archchige Rasanjali Chandima de Alwis, is a Sri Lankan cricketer who played one women's test match and 22 women's one-day internationals including the 1997 Women's Cricket World Cup in India and the 2000 Women's Cricket World Cup in New Zealand, one of only three married couples along with the Australians Mitchell Starc, and Alyssa Starc, a cricketer who plays for New South Wales and the Australian women's team, born in which year?",
        "response": "24 March 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth year of this English film director and producer best known for directing blockbuster action films, including When a Stranger Calls?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Diya Aur Baati Hum was replaced by a romantic drama series that premiered on what date?",
        "response": "12 September 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Cox and Yannis Smaragdis are both involved in which aspect of filmmaking?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the band of Confederate army deserters in the 2016 movie starring Matthew McConaughey, Gugu Mbatha-Raw, and Keri Russell?",
        "response": "the Knight Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish singer-songwriter hosted Who's Doing the Dishes from September 2014?",
        "response": "Brian McFadden",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris O'Donnell starred in a movie with which American actor who died on February 25, 2017.",
        "response": "Bill Paxton",
        "source": "hotpot_qa"
    },
    {
        "query": "Vic is a 2006 American short film staring an actor who co-starred with  William H. Bonney in what television series?",
        "response": "The Tall Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the team coached by Bob Stoops play in the 2008 Dr. Pepper Big 12 Championship Game?",
        "response": "Missouri Tigers",
        "source": "hotpot_qa"
    },
    {
        "query": "During what decade did J.R.R. Tolkien use mythopoeia in his literary works?",
        "response": "1930s",
        "source": "hotpot_qa"
    },
    {
        "query": "Hayuya was a chief from a group that was found in what general location on Earth?",
        "response": "Western Hemisphere",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathryn M. Drennan is an American writer, having worked for Carl Sagan, she also contributed articles to several magazines, including Starlog, a monthly science fiction magazine that was created, in which year?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Seung-woo, is a South Korean actor, he is best known for his leading roles in Inside Men, released in which year, is a South Korean neo noir political crime action film written and directed by Woo Min-ho based on Yoon Tae-ho's webtoon \"The Insiders\"?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Which house in London was destroyed by the Luftwaffe in 1940?",
        "response": "Montagu House",
        "source": "hotpot_qa"
    },
    {
        "query": "In what region of Nevada is the Unmanned Aerial Vehicle Battlelab located?",
        "response": "southwestern",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Fitness and Stylist catered to men?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the country that the Recilia dispar is endemic to?",
        "response": "4,503,000",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lake of Death is a fantasy novel by a fantasy and science fiction author and editor who has worked on Dragonlance and Forgotten Realms, and who was born on June 19th in what year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Purbanchal University and California State University, Northridge, both public universities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The movement that inspired  Weusi Artist Collective was prominent in what year?",
        "response": "1960s and early 1970s.",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Taylor Swift videography and Picture to Burn have in common?",
        "response": "song",
        "source": "hotpot_qa"
    },
    {
        "query": "This 2003 best-selling novel by Lauren Weisberger became the basis for a film starring an actress whose breakthrough debut film role was as Mia Thermopolis in what Disney comedy?",
        "response": "The Princess Diaries",
        "source": "hotpot_qa"
    },
    {
        "query": "What German theoretical physicist has a chemistry rule named after him?",
        "response": "Arnold Johannes Wilhelm Sommerfeld",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Jones is an English dancer, choreographer and film producer who has been a member of the English National Ballet since 1992, Career highlights include performing which fictional character, and main antagonist in William Shakespeare's play \"Romeo and Juliet\", at the Rod Laver Arena in Melbourne, Australia?",
        "response": "Tybalt",
        "source": "hotpot_qa"
    },
    {
        "query": "EXIT : E is the first extended play by a South Korean boy group that was originally what?",
        "response": "a five-piece group",
        "source": "hotpot_qa"
    },
    {
        "query": "Mireille Perrey featured in the 1964 musical film directed by whom?",
        "response": "Jacques Demy",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the university at which Ian Irving Mitroff was Professor Emeritus of two different schools founded?  ",
        "response": "1880",
        "source": "hotpot_qa"
    },
    {
        "query": "What other name is the Act from which tribes has been previously exempt under the The Curtis Act of 1898 known as?",
        "response": "Dawes Severalty Act of 1887",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the visual effects supervisor and director notable for his work on the 2004 American action superhero film based on the DC Comics character and starring Halle Berry and Sharon Stone?",
        "response": "Comar",
        "source": "hotpot_qa"
    },
    {
        "query": "Who planned the strategic bomber which is meant to replace the only acknowledged aircraft that can carry large air-to-surface standoff weapons in a stealth configuration?",
        "response": "United States Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "The Toccata in D minor, Op. 11 is a piece for solo piano, written by Sergei Prokofiev in 1912 and debuted by the composer on December 10, 1916, other composers of well-known toccatas include who, which was a Soviet Armenian composer and conductor, and is considered one of the leading Soviet composers?",
        "response": "Aram Khachaturian",
        "source": "hotpot_qa"
    },
    {
        "query": "John Lennon was apart of which band that wrote \"Rain\"?",
        "response": "the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the sobriquet of the woman who hired Joyce Beber?",
        "response": "Queen of Mean",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1939 New York World's Fair was exceedd in expanse only by another fair which was held in St. Louis , Missouri during what dates?",
        "response": "April 30 to December 1, 1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, Sojourners or Science News?",
        "response": "Science News",
        "source": "hotpot_qa"
    },
    {
        "query": "What part of Australia is Alice River and Rupertswood in?",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the stars from \"Getting Played\" also co-hosted a talk show on what network?",
        "response": "Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band The Neighbourhood or Orgy was formed first ?",
        "response": "Orgy",
        "source": "hotpot_qa"
    },
    {
        "query": "Land of the Lustrous is published on a magazine whose first issues has a cover date of what?",
        "response": "January 25, 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "The Garrick Club is a gentlemen's club in the heart of London founded in 1831, since its conception has catered to members such as which English actor and theatre manager, that died on 2 July 1917?",
        "response": "Sir Herbert Beerbohm Tree",
        "source": "hotpot_qa"
    },
    {
        "query": "Which nephew of Wade Watts also played professional football in the Canadian Football League?",
        "response": "Julius Caesar \"J. C.\" Watts Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Chef voiced by in the episode Cartman's Mom Is Still a Dirty Slut?",
        "response": "soul singer Isaac Hayes",
        "source": "hotpot_qa"
    },
    {
        "query": "Den Dover was born in a suburb with what total resident population?",
        "response": "6,396",
        "source": "hotpot_qa"
    },
    {
        "query": "In regards to the Mexican American country music artist who signed with Columbia Nashville in 1993, what was his only number one single on the Billboard Hot Country Singles & Tracks chart?",
        "response": "Running Out Of Reasons To Run",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these are found only on a single continent, Pamianthe or Bombax?",
        "response": "Pamianthe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building is located at the center of City Hall Park in the Civic Center area of Lower Manhattan and was designed by Joseph-François Mangin?",
        "response": "New York City Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is older, Melody Time or Old Yeller?",
        "response": "Melody Time",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other name for François Leterrier's debut film?",
        "response": "The Wind Bloweth Where It Listeth",
        "source": "hotpot_qa"
    },
    {
        "query": "The Todd Bertuzzi–Steve Moore incident, was a highly controversial event in ice hockey, that happened during a National Hockey League (NHL) game between the Vancouver Canucks and the Colorado Avalanche on March 8, 2004, in the first period, which Canadian former professional ice hockey center who played in parts of three National Hockey League (NHL) seasons with the Colorado Avalanche, fought Vancouver player Matt Cooke and served a 5-minute major penalty for fighting?",
        "response": "Steve Moore",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation is shared by both Marge Piercy and Richard Aldington?",
        "response": "poet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which space flight carrying the first American to orbit the Earth was launched by T.J. O'Malley? ",
        "response": "Mercury-Atlas 6",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the singer of Mamo known for?",
        "response": "her deep contralto",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Rhianna's eighth studio album, released on January 28, 2016, which she promoted on a 75-show tour that began in March, 2016 and ended in November, 2016?",
        "response": "Anti",
        "source": "hotpot_qa"
    },
    {
        "query": "Tal-Borg Battery was an artillery battery near  Southern European island country consisting of an archipelago in what sea?",
        "response": "Mediterranean Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus was named after Saverio Manetti, Manettia or Rhododendron?",
        "response": "Manettia",
        "source": "hotpot_qa"
    },
    {
        "query": "What descendant of KTHML was developed by Apple?",
        "response": "Safari",
        "source": "hotpot_qa"
    },
    {
        "query": "What position was played by the man who, along with Emmanuel Petit, was purchased by Joan Gaspart using funds taken from the sale of Luis Figo?",
        "response": "winger",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie staring Ben Foster was released in 2009 and directed by Christian Alvart?",
        "response": "Pandorum",
        "source": "hotpot_qa"
    },
    {
        "query": "What Pakistani actor and writer from Islamabad helped write for the 2012 Pakistani comedy drama sitcom, \"Coke Kahani\"?",
        "response": "Yasir Hussain",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Zaira Tatiana Nara's sister who works as an Argentine media personality and football agent?",
        "response": "Wanda Nara",
        "source": "hotpot_qa"
    },
    {
        "query": "When Louie R. Guenthner, Jr was a member of the Kentucky House of Representatives, what was one of the affluent areas he represented?",
        "response": "Indian Hills",
        "source": "hotpot_qa"
    },
    {
        "query": "Mount Garfield is flanked to the southwest along Garfield Ridge by a 5249 ft. mountain that lies in what town in Grafton County?",
        "response": "Franconia",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the Australian pioneer aviator who owned the Lady Southern Cross monoplane and made a flight from Austraia to London in a record 10.5 days??",
        "response": "Smithy",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor starred both in the movie \"The Culling\" and the HBO series \"The Deuce?\"",
        "response": "Christopher James \"Chris\" Coy",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of vegetation does Cerastium and Pavonia have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Waddani in the country officially known as  the Republic of Somaliland",
        "response": "political party",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one did Roger Nilsson work with is a Swedish melodic death metal band?",
        "response": "Arch Enemy",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Stephen Burke (born 4 November 1969) is a Labor member of the House of Representatives, in the Australian Parliament representing which Australian electoral division, in the state of New South Wales?",
        "response": "Division of Watson",
        "source": "hotpot_qa"
    },
    {
        "query": "Cindy Williams is an award-winning news anchor for a tv station whose trasmitter is located on what mountain?",
        "response": "Winn Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Shaheed Udham Singh is a movie based on what massacre that took place on 13 April, 1919?",
        "response": "Jallianwala Bagh massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of Erika Mitchell's novel that reached number 1 on the \"USA Today\" best seller list?",
        "response": "Fifty Shades Darker",
        "source": "hotpot_qa"
    },
    {
        "query": "Nangpai Gosum and Shishapangma are both mountains located in which state?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Steve Sekely and Willian King Baggot known by multiple names or nicknames?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Perakh who helped write The Panda's Thumb, was a professor at what university?",
        "response": "California State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Jeff  Wadlow martial arts film did \"Twilight\" actor Cam Gigandet star in?",
        "response": "Never Back Down",
        "source": "hotpot_qa"
    },
    {
        "query": "The Missouri attorney general election of 2012 ended in a loss for which attorney and CNN contributor?",
        "response": "Edward Robert Martin Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Cumberland Gap, Tennessee is surrounded on all sides by a park named after a natural break in what mountains?",
        "response": "Appalachian Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "What channel did Gordon Burns host?",
        "response": "BBC",
        "source": "hotpot_qa"
    },
    {
        "query": "Henry Huggins has been published as an audiobook read by an American actor known for playing Barney Stinson on what television series?",
        "response": "How I Met Your Mother",
        "source": "hotpot_qa"
    },
    {
        "query": "Mircea Chivu Stadium is a multi-purpose stadium, located in Reșița, Romania, the stadium is named after Mircea Chivu, the father of which Romanian soccer player?",
        "response": "Cristian Chivu",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of animal are the Korean Sapsali and the German Spitz, which can refer to a category or type?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "My Lovely Girl stars which outh Korean singer-songwriter, actor, and music producer born on June 25, 1982?",
        "response": "Rain",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game has been released in more versions, Mall Madness or Halma?",
        "response": "Mall Madness",
        "source": "hotpot_qa"
    },
    {
        "query": "Heath bar is a candy bar made by a company that is one of the largest chocolate manufacturers in the world, and is headquarted where?",
        "response": "Hershey, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "James Hillier had a role in Seasons 1 and 2 of the Netflix series created and written by whom?",
        "response": "Peter Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who son of Bruce Lee starred in Showdown in Little Tokyo",
        "response": "Brandon Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in Greek mythology was the father of Benthesikyme venerated as a chief deity?",
        "response": "Pylos and Thebes",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did a popular song release that was accompanied by dancing by a famous American dancer?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the male star of the film Houseboat become an American citizen ?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Blue Grass Airport and Knox County Regional Airport both located in the state of Maine, United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the film inspired by the remake of Sang-ok Shin's Godzilla held in North Korea? Pulgasari",
        "response": "Pulgasari",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person who was shot down and killed by Manfred von Richthofen, the \"Red Baron\" during an air battle of which Robert Saundby was present, born?",
        "response": "30 December 1890",
        "source": "hotpot_qa"
    },
    {
        "query": "The Empire Award winning black comedy crime film Shallow Grave was the directorial debut of which director?",
        "response": "Danny Boyle",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor starring in the Longshot was the voice of what cartoon?",
        "response": "Barnacle Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Best Of...\" was a compilation almbum by which Australian singer-songwriter?",
        "response": "Sia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the former British Leyland companies is best know for it's two-seat open sports cars?",
        "response": "MG Car Company Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of the suspected U.S.-born Mexican drug lord Rubén Oseguera González?",
        "response": "Nemesio Oseguera Cervantes",
        "source": "hotpot_qa"
    },
    {
        "query": "LinkBike has a station at the largest mall in what Malaysian city?",
        "response": "Penang",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Theodor Dreyer and John Sturges have what career in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What pornographic star is a member of the XRCO Hall of Fame and co-hosted the 13th AVN Awards Ceremony?",
        "response": "Julia Ann",
        "source": "hotpot_qa"
    },
    {
        "query": "Stratton is a brand of powder compacts, lipstick holders and other devices and containers for cosmetics, made in a city that had a population of how many in 2014 ?",
        "response": "1,101,360",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the band who released the single The Heart Never Lies formed ?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What college did the wide receiver responsible for the Miracle at Michigan go to?",
        "response": "University of Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British writer played  a star acting role in the documentary, \"People Like Us\"?",
        "response": "Chris Langham",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was founded first, Virginia Commonwealth University or Batangas State University?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "What commentator and author questioned the validity of CORE's non-profit status?",
        "response": "Rachel Anne Maddow",
        "source": "hotpot_qa"
    },
    {
        "query": "Which location where 25th Infantry Division was located was a United States Army installation in the U.S. state of Alaska, adjacent to the city of Anchorage?",
        "response": "Fort Richardson",
        "source": "hotpot_qa"
    },
    {
        "query": "How many caps did Helen Svedin's husband win?",
        "response": "127",
        "source": "hotpot_qa"
    },
    {
        "query": "Alf Ellison was the chairman of operations at what farm implement maker in the United Kingdom?",
        "response": "Blackstone & Co.",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of gesture does Donets-Krivoy Rog Soviet Republic and have in common?",
        "response": "signed",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county is the company that KZQD is licensed to located?",
        "response": "Seward County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a professional racing driver and won the first race of the 2015 Monaco GP2 series?",
        "response": "Stoffel Vandoorne",
        "source": "hotpot_qa"
    },
    {
        "query": "Times Square is a major commercial intersection, tourist destination, entertainment center and neighborhood in the Midtown Manhattan section of New York City, one of the world's busiest pedestrian areas, it is also the hub of where, which refers to the theatrical performances presented in the 41 professional theatres with 500 or more seats located in the Theater District and Lincoln Center along Broadway, in Midtown Manhattan, New York City?",
        "response": "Broadway theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which president appointed the justice who wrote for a unanimous court in Smiley v. Citibank?",
        "response": "Ronald Reagan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the serial killer that the film Pulan Visaranai is loosely based on?",
        "response": "Gowri Shankar",
        "source": "hotpot_qa"
    },
    {
        "query": "What indie rock group features Alan Sparhawk and formerly Zak Sally?",
        "response": "Low",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is also an actor, Luis Llosa or Ron Howard?",
        "response": "Ronald William Howard",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the book written by a co-host of the replacement show for \"The Five\"?",
        "response": "Wake Up America",
        "source": "hotpot_qa"
    },
    {
        "query": "Eileen Sheridan is a perceived associate to a gang in East London known for the murders of what two men?",
        "response": "Jack \"the Hat\" McVitie and George Cornell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British Grammy-nominated record producer has worked with both Tom Jones and the Brazilian metal band led by Rafael Bittencourt?",
        "response": "Christopher Andrew \"Chris\" Tsangarides",
        "source": "hotpot_qa"
    },
    {
        "query": "Bangles  is the eponymous first EP by this American Pop rock band form in what year?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie caused the use of the word  \"Beldam\" to become more popular in 2009?",
        "response": "Coraline",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American singer, songwriter, fashion designer, actress, and television personality of the band No Doubt wrote the song \"Happy Now?\"?",
        "response": "Gwen Stefani",
        "source": "hotpot_qa"
    },
    {
        "query": "Both \"Jett Jackson the Movie\" and \"The Famous Jett Jackson\" are centered around what type of character?",
        "response": "teenage secret agent",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2005 proposed federal law was authored by the Republican nominee in the 2017 special election to fill the United States Senate seat vacated by Jeff Sessions?",
        "response": "Constitution Restoration Act",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor is best known for staring in Four Boys and a Gun and also acting as a Gunnery Sergeant in Gomez Pyle, U.S.M.C.?",
        "response": "Frank Sutton",
        "source": "hotpot_qa"
    },
    {
        "query": "What castle is a maternity home in nazi Germany with a goal of raising the birth rate of \"Aryan\" children?",
        "response": "Wégimont Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what State was the politician featured in the book Reagan's War, the Governor ?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Did K-Michel Parandi and John Biddle both make a career in the film industry? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Barefoot to Herat and Second Skin, are films of which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1946–47 Ashes series consisted of five cricket Test matches, each of six days with five hours play each day and eight ball overs, Hammond lost 3-0 to Don Bradman's Australian team which had only two other pre-war players - Lindsay Hassett and Sidney George Barnes, an Australian cricketer and cricket writer, who played 13 Test matches between 1938 and which year?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "The 50th Law is a book that includes lessons and anecdotes from an American writer and social critic whose unfinished manuscript was adapted into what film?",
        "response": "I Am Not Your Negro",
        "source": "hotpot_qa"
    },
    {
        "query": "which Aerospace and transportation company hired Bruno Bianchi as an engineer?",
        "response": "Bombardier Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress starred alongside an actor known for portraying gangsters in a 1940 film?",
        "response": "Joan Bennett",
        "source": "hotpot_qa"
    },
    {
        "query": "What sports team did Chet Moeller play defensive back for, whose mascot is Bill the Goat?",
        "response": "The Navy Midshipmen football team represents the United States Naval Academy in NCAA Division I FBS",
        "source": "hotpot_qa"
    },
    {
        "query": "Gregory Nava and Jim McBride, are American with which occupations in common?",
        "response": "film director, producer and screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Shenzhou City and Longchang are located in provinces in what country? ",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which chain store in Holiday Village Mall is is headquartered in North Dakota?",
        "response": "Scheels All Sports",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Mark Tuinei or Emmitt Smith?",
        "response": "Mark Pulemau Tuinei",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the 15th pick of the 2011 NFL born ?",
        "response": "July 24, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a judge on The X Factor and is also married to Ozzy Osbourne?",
        "response": "Sharon Osbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "The band US5 originated on which reality show and then debuted on Lou Pearlman's Transcontinental label?",
        "response": "\"Big in America\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 53 metre high Corinthian order triumphal column modelled on a Roman triumphal column in Rome, Italy, that commemorates Roman emperor Trajan's victory in the Dacian Wars ?",
        "response": "Column of the Grande Armée",
        "source": "hotpot_qa"
    },
    {
        "query": "A Concert: Behind Prison Walls is the fifty-fourth overall album and a live album recorded by Johnny Cash in the Tennessee Prison 1974, Cash's conceptual series of live albums recorded before an audience of prison inmates, At San Quentin is which ordinal numeral, overall album by Johnny Cash, recorded live at San Quentin State Prison on February 24, 1969?",
        "response": "31st",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Beyond Hatred and That's Dancing! French documentary films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "How many annual visitors did Mexico location of \"Terminator X: A Laser Battle for Salvation\" have? ",
        "response": "2.5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "J.E.B. v. Alabama ex rel. T.B. extended precedent in which 1986 case regarding race-based peremptory challenges in criminal trials?",
        "response": "Batson v. Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Radio Iodine and Talk Talk both from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Bergen Arches is located in this city that is the second most populous after which city within the state?",
        "response": "Newark",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 CONSUR Women's Sevens Championships is an Olympic qualification tournament for Rugby sevens at the 2016 Summer Olympics which will be held during which time span, Santa Fe de la Vera Cruz (usually called just Santa Fe) is the capital city of the province of Santa Fe, Argentina?",
        "response": "5-7 June 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What British academic philosopher has this quote attributed to him regarding the principle of charity \"it constrains the interpreter to maximize the truth or rationality in the subject's sayings.\"?",
        "response": "Simon Blackburn",
        "source": "hotpot_qa"
    },
    {
        "query": "Knowledge Nation was launched at the university that is what type of institution?",
        "response": "dual-sector tertiary institution",
        "source": "hotpot_qa"
    },
    {
        "query": "The Royal Yacht \"Norge\" was the Norwegian people's gift to a king that died in this year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie studio produced The Benchwarmers, which starred Rob Schneider and Napoleon Dynamites lead actor, Jon Heder?",
        "response": "Revolution Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1820 UK general election produced the first parliament under the reign of the King from what house?",
        "response": "Hanover",
        "source": "hotpot_qa"
    },
    {
        "query": "How many variants are there of the military transport aircraft that the Mercedes-Benz Zetros truck was designed to be compatible with?",
        "response": "Over forty",
        "source": "hotpot_qa"
    },
    {
        "query": "Which co-founder of Instagram was born December 30, 1983?",
        "response": "Kevin Systrom",
        "source": "hotpot_qa"
    },
    {
        "query": "Remember Me Ballin' is a CD single by Indo G that features an American rapper born in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What company publishes a Star Trek game that has gone through two different incarnations?",
        "response": "Amarillo Design Bureau",
        "source": "hotpot_qa"
    },
    {
        "query": "Will Durant wrote a book in 1926 about what subject?",
        "response": "Western philosophers",
        "source": "hotpot_qa"
    },
    {
        "query": "How many men were killed by Schutzstaffel death squads in Lygumai?",
        "response": "70-80",
        "source": "hotpot_qa"
    },
    {
        "query": "Which successful American immigrant was born most recently, Varaz Samuelian or Samuel Der-Yeghiayan?",
        "response": "Varazdat Samuel \"Varaz\" Samuelian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director has won 9 primetime emmy awards Paul Sloane or Gregory Hoblit?",
        "response": "won nine Primetime Emmy Awards for directing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which candidate did Edward Timpson defeat, Laura Smith or Tamsin Dunwoody? ",
        "response": "Laura Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "What music genre that Peavey Bandit 112 is designed for has been called \"one of America's original art forms\"?",
        "response": "jazz",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the original play which was later turn into a 1944 film about King Henry V and starred and was directed by an English actor born in 1907?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "Rowan Atkinson's album, Live in Belfast, was released directly after his participation in what event?",
        "response": "The Secret Policeman's Ball",
        "source": "hotpot_qa"
    },
    {
        "query": "What divided by historians into four main parts is the pre-Columbian time or early history,  the colonial period , the period of nation-building , and the history of modern Argentina, that has a 2010 Argentine TV miniseries of six telefilms about these key events?",
        "response": "history of Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film came out first American Pimp or U2 3D ?",
        "response": "American Pimp",
        "source": "hotpot_qa"
    },
    {
        "query": "The Countess of Monte Cristo starring Reginald Owen is what type of film?",
        "response": "American comedy film",
        "source": "hotpot_qa"
    },
    {
        "query": "who was the Band that made the Album that beat out \"Paranoid\" for top of the UK Albums Chart in 2013?",
        "response": "Black Sabbath",
        "source": "hotpot_qa"
    },
    {
        "query": "Måns Andersson was a pioneer in a colony known as what in latin?",
        "response": "Nova Svecia",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is DerpyCon held in?",
        "response": "Morris County",
        "source": "hotpot_qa"
    },
    {
        "query": "What date was the movie released that the song \"I'm Still Here\" was written for?",
        "response": "November 27, 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pratt & Whitney J58 was a jet engine that powered a long-range, Mach 3+ strategic reconnaissance aircraft operated by who?",
        "response": "United States Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Joyride included a song used in what 1990 American romantic comedy film?",
        "response": "Pretty Woman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American actress born in February 1989, who starred in I Saw the Light with Hank Williams?",
        "response": "Elizabeth Olsen",
        "source": "hotpot_qa"
    },
    {
        "query": "Folie à Deux is a studio album by the American rock band formed in which city?",
        "response": "Wilmette",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, The Wolfgang Press or Powerman 5000?",
        "response": "The Wolfgang Press",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand shop in Beverly Center is based in Maranello ?",
        "response": "Ferrari",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the Rockstar games that used the RAGE engine was released on 17 September 2013 for PlayStation 3 and Xbox 360?",
        "response": "Grand Theft Auto V",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 for the town that holds Newfound Lake?",
        "response": "1,613",
        "source": "hotpot_qa"
    },
    {
        "query": "The USS \"Phelps\" along with the cruiser \"Chester\", escorted a vessel that served as the flagship for the commander of what?",
        "response": "Scouting Force 1",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this Irish singer-songwriter, musician, venture capitalist, businessman, and philanthropist, who wrote \"Love Is Blindness\" on the piano?",
        "response": "Bono",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the event that closed down John F. Kennedy High School and became one of the costliest and fifth deadliest natural events of its kind?",
        "response": "Hurricane Katrina",
        "source": "hotpot_qa"
    },
    {
        "query": "What football position did Lopes' former boyfriend play?",
        "response": "wide receiver",
        "source": "hotpot_qa"
    },
    {
        "query": "Approximately how far is WURC from Memphis Tennessee ?",
        "response": "35 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the executive producer of the Home soundtrack from?",
        "response": "Barbadian singer Rihanna",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these programs has already launched, Astron or James Webb Space Telescope?",
        "response": "Astron",
        "source": "hotpot_qa"
    },
    {
        "query": "India, Pakistan, Sri Lanka and Bangladesh appeared at what Championship match in 2001?",
        "response": "Asian Test Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Del Amitri and Cloud Control both from Australia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Nigerian president appointed the Managing Director of the NPA in 2016?",
        "response": "Muhammadu Buhari",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film \"Nobody Rides For Free\" was taken from?",
        "response": "Kathryn Bigelow",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released the 2015 animated short film which is a inspiration Frozen Ever After in Epcot at the Walt Disney World Resort?",
        "response": "Walt Disney Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won Wimbledon more times, Menno Oosting or Goran Ivanišević?",
        "response": "Goran Ivanišević",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county is this airport located to which Pinnacle Airlines Flight 3701 was bound?",
        "response": "Hennepin County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Venetian Resort Hotel Casino is a five-diamond luxury hotel and casino resort located on the Las Vegas Strip in Paradise, an unincorporated town and census-designated place (CDP) in Clark County, Nevada, adjacent to the city of Las Vegas, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both magazines Diva and Cleo founded in the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Electrical Engineer appeared in writer and director Farhan Akhtar's first film?",
        "response": "Suchitra Pillai",
        "source": "hotpot_qa"
    },
    {
        "query": "2010 WPS All-Star Game had what top US vote-getter who is six-time winner of the U.S. Soccer Athlete of the Year award as a captain",
        "response": "Abby Wambach",
        "source": "hotpot_qa"
    },
    {
        "query": "Ludwig Göransson is a Swedish composer best known for his work on U.S. TV sitcoms, he's best known for composing the music for which 2011 American comedy film?",
        "response": "30 Minutes or Less",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth name of the character originally voiced by Zack Shada who helps rescue Princess Bubblegum in \"Adventure Time\"?",
        "response": "Finn Mertens",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the man whom Daniel Goodenow studied law under noted for his involvement in?",
        "response": "Treaty of Ghent",
        "source": "hotpot_qa"
    },
    {
        "query": "Heythrop Park was designed for the English politician who was part of what group?",
        "response": "Immortal Seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Dobson voiced which character, an adversary of the X-Men, originally depicted as obese?",
        "response": "The Blob",
        "source": "hotpot_qa"
    },
    {
        "query": "Phoebe Ruguru created a 2014 film on a smartphone marketed by what company?",
        "response": "Apple",
        "source": "hotpot_qa"
    },
    {
        "query": "Which nationality is the UFC fighter who defeated Josh Haynes in \"The Ultimate Fighter\"?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the location that the film \"Free State of Jones\" based on?",
        "response": "Jones County, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Amazon Prime Air is a cargo airline that contracts through ABX Air, Inc., formerly known as what, is a cargo airline headquartered at Wilmington Air Park near the City of Wilmington, Ohio, USA?",
        "response": "Airborne Express",
        "source": "hotpot_qa"
    },
    {
        "query": "What character does Deborah Joy Winans play in the American television drama series, created by Craig Wright?",
        "response": "Charity",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Azadirachta and Maihuenia part of the cactus family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer created this fictional character in American comic books published by Marvel Comics, who is an ally of Martin Soap and appeared in \"The Amazing Spider-Man?\"",
        "response": "Gerry Conway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2002 film starring David Clayton Rogers premiered at Sundance Film Festival on the 16th on January and set in Derry, Northern Ireland?",
        "response": "Bloody Sunday",
        "source": "hotpot_qa"
    },
    {
        "query": "Just Before I Go stars an actress who plays what character in the series \"24\"?",
        "response": "Kim Bauer",
        "source": "hotpot_qa"
    },
    {
        "query": "What British comedy show was the Russian sketch show co-created by Semyon Sergeyevich Slepakov based on?",
        "response": "Little Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did the explorers that the film Glory & Honor was based on originate from?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Anne-Marie Duff, star of \"The Waiting Room,\" also played which Queen of England in \"The Virgin Queen\"?",
        "response": "Elizabeth I",
        "source": "hotpot_qa"
    },
    {
        "query": "\"You Can Close Your Eyes\" was covered by which artist born in 1974?",
        "response": "Natalie Maines",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Chicago Bear's coach that was also the head coach of the University of Pittsburgh football team from 2005 to 2010?",
        "response": "Dave Wannstedt",
        "source": "hotpot_qa"
    },
    {
        "query": "Onika Tanya Maraj is a judge on a television show hosted by whom? ",
        "response": "Ryan Seacrest",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nikolai Rimsky-Korsakov and Giovanni Paisiello both composers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "X-15 Flight 3-65-97 was piloted by an American aviator who was the first what?",
        "response": "American space mission fatality",
        "source": "hotpot_qa"
    },
    {
        "query": "What friends star's wedding was photographed by Robert Evans?",
        "response": "Jennifer Aniston",
        "source": "hotpot_qa"
    },
    {
        "query": "Swearnet: The Movie actor Mike Smith is best known for his role in the tv series \"Trailer Park Boys\" as a character named what?",
        "response": "Bubbles",
        "source": "hotpot_qa"
    },
    {
        "query": "Rokdim Im Kokhavim has, as a guest, which Canadian-American actress and model?",
        "response": "Pamela Denise Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "Other the Celts, name other ways people from Poland are identified.",
        "response": "Germanic, Baltic and Thracian tribes",
        "source": "hotpot_qa"
    },
    {
        "query": " Mijenjam is the sixth studio album by a singer born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Dee Brown and Edwin Arlington Robinson American writers? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the address of the home of the 38th President of the United States from 1955 to when he assumed the presidency?",
        "response": "514 Crown View Drive",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Swedish rock star, Max Carl or Anders Fridén?",
        "response": "Anders Fridén",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2016 film that Partizan Midi-Minuit produced?",
        "response": "Antoine Bardou-Jacquet",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998–99 NBA season was the Wizards' 38th season in the National Basketball Association, the Wizards continued to under achieve as which American basketball.head coach was fired after a 13–19 start?",
        "response": "Bernard Tyrone Bickerstaff",
        "source": "hotpot_qa"
    },
    {
        "query": "What sports drama film starring Ha Ji-won was Choi Yoon-young also in?",
        "response": "As One",
        "source": "hotpot_qa"
    },
    {
        "query": "Più che puoi\" (\"As Much As You Can\") is a duet by Italian singer Eros Ramazzotti and American singer-actress Cher, is an American singer and actress, sometimes referred to as who?",
        "response": "Goddess of Pop",
        "source": "hotpot_qa"
    },
    {
        "query": "The THSR 700T, is the high-speed electric multiple unit trainset derived from the Japanese Shinkansen family for Taiwan High Speed Rail (THSR), the trains were manufactured in Japan by various companies, including which Japanese multinational conglomerate company headquartered in Chiyoda, Tokyo, Japan, marking the first time Japanese Shinkansen trains have been exported overseas?",
        "response": "Hitachi, Ltd.",
        "source": "hotpot_qa"
    },
    {
        "query": " Andy Donato was the former art director for a tabloid newspaper known for what daily feature?",
        "response": "Sunshine Girl",
        "source": "hotpot_qa"
    },
    {
        "query": "Ha Jung-woo made a directorial appearance in what 2015 South Korean film adaptation of a novel by Yu Hua?",
        "response": "Chronicle of a Blood Merchant",
        "source": "hotpot_qa"
    },
    {
        "query": "Prince Alexander von Fürstenberg's parents got divorced in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Donald Spoto, is an American biographer and theologian, and is best known for his best-selling biographies of film and theatre celebrities such as which Swedish actress who starred in a variety of European and American films, and is best remembered for her roles as Ilsa Lund in \"Casablanca\" (1942)?",
        "response": "Ingrid Bergman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which top-selling luxury automobile was the body of Robert Donati found in?",
        "response": "Cadillac",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2008 SAP Open-Singles, the defending champion was what British professional tennis player who is a three-time Grand Slam tournament winner?",
        "response": "Sir Andrew Barron Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Noah Hawley's Legion cable series based on?",
        "response": "Marvel Comics character David Haller",
        "source": "hotpot_qa"
    },
    {
        "query": "What group did Marketa Irglova's \"Once\" co-star perform in?",
        "response": "The Frames",
        "source": "hotpot_qa"
    },
    {
        "query": "Arundel Castle was damaged during a war between which two groups?",
        "response": "Parliamentarians (\"Roundheads\") and Royalists (\"Cavaliers\")",
        "source": "hotpot_qa"
    },
    {
        "query": "Patterdale Terrier and St. Bernard, are a breed of what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the party of which Vydas Gedvilas is a member?",
        "response": "Viktor Uspaskich",
        "source": "hotpot_qa"
    },
    {
        "query": "during Finnish presidential election, 1946 the parliament passed a law that enabled what  Finnish military leader and statesman born in 1867 to serve a six-year term",
        "response": "Carl Gustaf Emil Mannerheim",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, Oh Comely or Take a Break, has more issues per month?",
        "response": "Take a Break",
        "source": "hotpot_qa"
    },
    {
        "query": "Live from Planet X is a live album by British-American rapper/producer MF Doom, his debut album was titled?",
        "response": "Madvillainy",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the official title of the murder case involving NFL player Orenthal James Simpson that involved jury sequestration?",
        "response": "People of the State of California v. Orenthal James Simpson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film by an American director, born on December 18, 1946, won an Oscar?",
        "response": "Schindler's List",
        "source": "hotpot_qa"
    },
    {
        "query": "Which motorcycling magazine was founded in 1962 and listed the ZX-10R bike as \"Best Superbike\" in 2004?",
        "response": "Cycle World",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Not Ready to Die\" is a song by a band from what California city?",
        "response": "Huntington Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed first, Classic Case or Panic! at the Disco?",
        "response": "Classic Case",
        "source": "hotpot_qa"
    },
    {
        "query": "What city did the book for which the Democratic candidate in  the 1934 California gubernatorial election was known took place?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Melissa and Darmera vegatables",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "A famous sexual harassment class-action lawsuit of the 1980s occurred in what ore mining district in 1866?",
        "response": "Mesabi Range",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man would be more likely to have more stamps in his passport from visiting foreign countries:  Hrach Gregorian or Steven Zaillian?",
        "response": "Hrach Gregorian",
        "source": "hotpot_qa"
    },
    {
        "query": "What collegiate football conference started in July 1999, and was home to the winners of the 2011 Rose Bowl?",
        "response": "Mountain West Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "James R. Handy served in which upper house of the Maine legislature from 1992-94?",
        "response": "Maine Senate",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Petrophytum and Townsendia both in the rose family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Mads Bødker participated in seven Ice Hockey World Championships as a member of this national who holds a record for the largest loss when they where defeated by what score?",
        "response": "47–0",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1962 Kentucky Wildcats football team represented the University of Kentucky, in the Southeastern Conference during the 1962 college football season, the winning margin was provided by a field goal by Clarkie Mayfield, one of the heroes of the game, who later died in which event that occurred on the night of May 28, 1977, during the Memorial Day holiday weekend, at which location event, in Southgate, Kentucky, is the third deadliest nightclub fire in U.S. history?",
        "response": "Beverly Hills Supper Club fire",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shopping mall did the company owned by Hunter Moss and James W. Rouse open in August, 1982",
        "response": "Burlington Center Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Orlando Maturana made several appearances for the senior Colombia national football team, his success in the national team was hampered by the availability of several more successful strikers such as which Colombian retired footballer who played as a striker?",
        "response": "Adolfo José Valencia Mosquera",
        "source": "hotpot_qa"
    },
    {
        "query": "What American senior operations officer for the Central Intelligence Agency (CIA) ran the Eclipse Group?",
        "response": "Duane \"Dewy\" Clarridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer recorded the song \"Go Now\" before Denny Laine with Moody Blues?",
        "response": "Bessie Banks",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did Edward VIII proposed to marry a divorced American which is dramatized in the movie Wallis & Edward?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "Born on 6 March 1937, this man was also a citizen of the United Kingdom.",
        "response": "Alistair Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "William Andrew Moffett was a librarian at the research institution located in what city?",
        "response": "San Marino, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is loosley based off the Brother Grimm's \"Iron Henry\"?",
        "response": "The Frog Prince",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the English nobleman and favourite of Elizabeth I, who was played by Hugh Dancy in the 2005 historical drama television miniseries?",
        "response": "Robert Devereux",
        "source": "hotpot_qa"
    },
    {
        "query": "The Riegelmann Boardwalk is in what southwestern borough in New York City? ",
        "response": "Brooklyn",
        "source": "hotpot_qa"
    },
    {
        "query": "George Llewelyn Davies was the inspiration for which character created by JM Barrie?",
        "response": "Peter Pan",
        "source": "hotpot_qa"
    },
    {
        "query": "Susan B. Landau's credits include a comedy sports film that was the last to be released during the life of who?",
        "response": "John Candy",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent is the Balls Head Reserve and Sydney Harbour Bridge located?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Swiss professional footballer who currently plays as a midfielder for a Swiss football team from the Bernese Oberland town of Thun ?",
        "response": "Nicola Sutter",
        "source": "hotpot_qa"
    },
    {
        "query": "Professional rugby player Greg Johnson plays for the Salford Red Devils which is a rugby team in England formed in what year?",
        "response": "1873",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of George White's Scandals referred to his nose as what?",
        "response": "the Schnozzola",
        "source": "hotpot_qa"
    },
    {
        "query": " Which was made first The Monkey's Uncle or The Strongest Man in the World?",
        "response": "The Monkey's Uncle",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Bernard McEveety and Jean-Jacques Beineix both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Foul papers are often used in the study of the plays of the poet who created approximately how many plays?",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is part of the Guangdong Province, Tumen, Jilin or Chaoyang District, Shantou?",
        "response": "Chaoyang District",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal is longer, Shinnecock Canal and Warren County Canal?",
        "response": "Warren County Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this Canadian American actress and model who appeared on the American action/comedy-drama series \"V.I.P.\" and \"Home Improvement\" inducted into Canada's Walk of Fame",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The TT-30 pistol was developed in the early 1930's as a replacement to a revolver designed by who?",
        "response": "Léon Nagant",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the French general that was born in 1856 and had a biography written about him by Guy Pedroncini?",
        "response": "Philippe Pétain",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Micheal Feinstein's album which was a tribute to a composer whose best-known works were orchestral compositions?",
        "response": "Pure Gershwin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant genus, Rudbeckia or Securinega, is in the sunflower family?",
        "response": "Rudbeckia",
        "source": "hotpot_qa"
    },
    {
        "query": "What dance competition television series features host and NFL reporter Erin Andrews?",
        "response": "Dancing with the Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "Immortals, released in which year, is an American epic fantasy action-adventure film, the film also stars Isabel Lucas, an Australian actress, and model?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Eero Pekka Sakari Markkanen, is a Finnish footballer who plays as a striker for which organization, he is the son of former basketball player Pekka Markkanen and the older brother of Chicago Bulls player Lauri Markkanen, a Finnish basketball player for the Chicago Bulls of the National Basketball Association (NBA)?",
        "response": "Dynamo Dresden",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Yucca or Dipteryx?",
        "response": "Yucca",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Danyang, Jiangsu and Dongfang, Hainan both cities in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock group was formed earlier, Beastie Boys or The Shins?",
        "response": "Beastie Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of music are Hard-Fi and OK Go classified as?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former athlete managed both Macabi Tel Aviv and Cruyff Football?",
        "response": "Jordi Cruyff",
        "source": "hotpot_qa"
    },
    {
        "query": "Nano Cabrera is the cousin of the golfer who the Masters in what year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "A sucessful auditionee for The Saturdays, whom also was in another girl band, appeared on what reality tv show?",
        "response": "\"The X Factor\"",
        "source": "hotpot_qa"
    },
    {
        "query": "A 2001 Japanese horror film directed by Takashi Shimizu is based on a manga by an artist who is known for Uaumaki, and was born in what year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Thomaz Koch or Peter Fleming?",
        "response": "Thomaz Koch",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the role that one of the voice artists in Bottersnikes and Grumbles played in the movie Harry Potter?",
        "response": "Professor Sprout",
        "source": "hotpot_qa"
    },
    {
        "query": "The World's Best Prom and A Summer in the Cage are both what type of movie?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "The Semalea sextilis appears in an area, which name means \"Warrior King\", located along which gulf and ocean?",
        "response": "Gulf of Guinea and Atlantic Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Zuffa, LLC, is an American sports promotion company specializing in mixed martial arts, founded in January of which year, in Las Vegas, Nevada, by Station Casinos executives Frank Fertitta III and Lorenzo Fertitta?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "The Valley Jr. Warriors play in a city that had what population as of the 2010 census?",
        "response": "60,879",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters for the company for which Gary Kovacs served as CEO?",
        "response": "Amsterdam, Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Which high energy particle collider was completed first, the Tevatron or the Large Hadron Collider? ",
        "response": "The Tevatron",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Claude Debussy or Gian Carlo Menotti?",
        "response": "Claude Debussy",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Ngezi Platinum F.C. play in?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "The fast food sandwich chain Subway Israel is an international franchise of this American fast food restaurant franchise that has stores in how many countries?",
        "response": "100 countries",
        "source": "hotpot_qa"
    },
    {
        "query": "This British record producer/engineer born in 1947  was involved with the production of Supertramp's Crime of the Century and various songs with David Bowie was born in which year?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "The former Vice-President of the Executive Council in the Second Rudd Ministry established an initiative to raise the profile of Australian wine to the world at what location in 2009?",
        "response": "Sydney Opera House",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain is located mostly in America's longest linear park?",
        "response": "Tomkins Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Busby Berkeley or Billy Bob Thornton ?",
        "response": "Busby Berkeley",
        "source": "hotpot_qa"
    },
    {
        "query": "Pearle Vision stores in North America are owned by a company based in what European city?",
        "response": "Milan, Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred as Mary in the film 2017 film about an intellectually gifted 7-year-old who becomes the subject of a custody battle between her uncle and grandmother?",
        "response": "Mckenna Grace",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director lived longer, Lowell Sherman or Jonathan Kaplan?",
        "response": "Jonathan Kaplan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the bar opened which was beaten by the Club Moderne in 2016?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Archibald MacLeish and L. Ron Hubbard both writers ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Tom Gullikson or Cara Black?",
        "response": "Tom Gullikson",
        "source": "hotpot_qa"
    },
    {
        "query": "Wilhelm Batz shot down 46 of one type of aircraft. How many of these aircraft were made during World War 2?",
        "response": "36,183",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Monster\" is a song by American rapper Eminem, featuring guest vocals from Barbadian singer Rihanna, taken from Eminem's album \"The Marshall Mathers LP 2\" (2013), it marks the fourth collaboration between Eminem and Rihanna, following \"Love the Way You Lie\", its sequel \"Love the Way You Lie (Part II)\" (2010), and which song by Barbadian singer Rihanna from her seventh studio album \"Unapologetic\" (2012)?",
        "response": "Numb",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British rock musician moved to Polydor Records in 1966",
        "response": "Pete Townshend",
        "source": "hotpot_qa"
    },
    {
        "query": "Olaudah Equiano known as Gustavus Vassa was a slave freed by Sons of Africa",
        "response": "Olaudah Equiano",
        "source": "hotpot_qa"
    },
    {
        "query": "What €30.6 billion company was sued by Pennsylvania beer distributor, Shangy's?",
        "response": "InBev",
        "source": "hotpot_qa"
    },
    {
        "query": "Western culture depicts cockroaches as vile pests and was popularized by a traditional folk song from which country?",
        "response": "Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Barnes v. Glen Theatre, Inc. and Terry v. Ohio decisions made by the same court?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the coach of the 1967 Penn State Nittany Lions football team die?",
        "response": "January 22, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Cliff Potts, and the actor who was nominated for the Academy Award for Best Supporting Actor for \"Coming Home\", both appear in? ",
        "response": "\"Silent Running\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What chart did Happy Home hit number 1 on Denmark?",
        "response": "Hitlisten",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the magazine with which Matsuko Deluxe began his work established? ",
        "response": "November 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What Gordon and Mildred Gordon novel was made into a movie in which a character named Agent Zeke Kelso was portrayed?",
        "response": "\"Undercover Cat\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the nephew of George Alexander born?",
        "response": "11 December 1956",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the war in which the 4th Infantry Regiment of the Imperial Japanese Army fought the Republic of China from July 7, 1937 to September 9, 1945?",
        "response": "Second Sino-Japanese War",
        "source": "hotpot_qa"
    },
    {
        "query": "In between John Millington Synge and Alan Paton, who was a South African author and anti-apartheid activist?",
        "response": "Alan Stewart Paton",
        "source": "hotpot_qa"
    },
    {
        "query": "During the reign of Louis XIII of France, another of his kingdoms was merged with the French crown, making him the last King of where?",
        "response": "Navarre",
        "source": "hotpot_qa"
    },
    {
        "query": "What football player was a member of the Bulgarian national team competing in the 1994 FIFA World Cup and related to Antoniy Balakov?",
        "response": "Krasimir Balakov",
        "source": "hotpot_qa"
    },
    {
        "query": "Oosaravelli, is a 2011 Telugu romantic thriller film directed by Surender Reddy, this film is inspired from which  2009 Chinese-French thriller film, directed by who?",
        "response": "Johnnie To",
        "source": "hotpot_qa"
    },
    {
        "query": "What boxer who was born in 1966 was Pam Pinnock in an abusive relationship with?",
        "response": "Mike Tyson",
        "source": "hotpot_qa"
    },
    {
        "query": "What animated shorts were both worked on by Irven Spence and distributed by an American media company?",
        "response": "Tom and Jerry",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the town as of 2012 where Alexander Jacob Betts Goss born?",
        "response": "2,121",
        "source": "hotpot_qa"
    },
    {
        "query": "Hugh Milburn Stone stared ina tv series created by what writer?",
        "response": "John Meston",
        "source": "hotpot_qa"
    },
    {
        "query": "The 5th season of Game of Thrones, premiering in the spring of 2015, ends with \"Mother's Mercy\", which landmark episode in total?",
        "response": "50th",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published a young adult high fantasy novel by Sarah J. Mass?",
        "response": "Bloomsbury",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published the movie in which Cillian Murphy is best known for as Scarecrow?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "The village church of Derrybrien is dedicated to a fifth-century Romano-British Christian missionary known as what?",
        "response": "Apostle of Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Son of Batman was released as a digital download on April 22, 2014, as part of what direct-to-video film projects being created by Warner Premiere, Warner Bros. Animation, and DC Comics?",
        "response": "DC Universe Animated Original Movies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which supreme court ruling contained references to more individual rights,  In re Gault or United States v. Jones?",
        "response": "In re Gault",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry Lance is associated with which member of the Justice League of America?",
        "response": "Black Canary",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Howard wrote for what daily newspaper owned by Postmedia Network in Ottawa, Ontario?",
        "response": "The Ottawa Citizen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, John Fitzgerald or Andy Murray?",
        "response": "John Basil Fitzgerald",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the second single of Snoop Dogg's only album released under his reggae persona?",
        "response": "Lighters Up",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Central Nebraska Regional Airport and Brunswick Golden Isles Airport which one is owned by  the Hall County Airport Authority?",
        "response": "Central Nebraska Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What cover band was the vocalist in the Anthrax album Live: The Island Years later the drummer and vocalist for?",
        "response": "Chief Big Way",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the release date of the Kanye West album made before \"Late Registration\"?",
        "response": "February 10, 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What is almost entirely composed of aerial shots of various places on Earth, Human or Home?",
        "response": "Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Who made the 1989 comic book, the film version of which Jon Raymond Polito appeared in?",
        "response": "James O'Barr",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state contains both The Venetian Resort and Madame Tussauds wax museum?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Nichole Mead lost out to Mallory Hagan in which national competition?",
        "response": "Miss America 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Mary Tyler Moore, was an American actress, known for her roles in the television sitcoms, including on which American television sitcom that initially aired on CBS from October 3, 1961 to June 1, 1966, with a total of 158 half-hour episodes spanning over five seasons?",
        "response": "The Dick Van Dyke Show",
        "source": "hotpot_qa"
    },
    {
        "query": "Elvera Sanchez worked along side of whom at Club Harlem?",
        "response": "Wild Bill Davis and his swing and jazz quartet were featured summer performers from 1950 through the mid-1960s, and Elvera M. \"Baby\" Sanchez, mother of Sammy Davis, Jr., worked at the bar.",
        "source": "hotpot_qa"
    },
    {
        "query": "What region of Europe does the mob boss known as Erricone and the boss born January 222, 1862- known as the \"boss of bosses\"- hail from?",
        "response": "Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "From what country is the movie that Rocky Handsome is based on from?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of Mark Rankin and Mark Mothersbaugh?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the lead vocalist and guitarist for the heavy metal band Machine Head, Robb Flynn or Rome Ramirez ?",
        "response": "Robert Conrad \"Robb\" Flynn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which TV show parodies \"The Bachelor\" and \"The Simpsons\" in season six?",
        "response": "South Park",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former American football player born who coached the 1974 Nebraska Cornhuskers football team?",
        "response": "February 23, 1937",
        "source": "hotpot_qa"
    },
    {
        "query": "What band released their debut album on 2 September 2013 featuring the single “Settle Down”?",
        "response": "The 1975",
        "source": "hotpot_qa"
    },
    {
        "query": " Spittal is a hamlet or small village in East Lothian, Scotland, UK, on the B1377, it is close to which ruined tower house castle, 2 km east of Longniddry, East Lothian, Scotland?",
        "response": "Redhouse Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Claudia and Women's Running, are what type of media?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Min Yoon-gi is managed by a company established by who?",
        "response": "Bang Si-hyuk",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of the actor who starred in \"Romolo e Remo\" opposite Gordon Scott and Virna Lisi?",
        "response": "Lester",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the settlement Joseph Smith was en route to when he died first built?",
        "response": "1684",
        "source": "hotpot_qa"
    },
    {
        "query": "Gopichand Badminton Academy is a badminton training facility in Hyderabad, Telangana, the facility trains several badminton players such as P. V. Sindhu, an Indian professional badminton player, who is currently world no 2 in which organization ranking?",
        "response": "BWF World Ranking",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the last name of the singer behind Southern Child?",
        "response": "Penniman",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Victor Oladipo and NBA All-Rookie Team connected?",
        "response": "basketball",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Matthias Egger's university in German?",
        "response": "Universität Bern",
        "source": "hotpot_qa"
    },
    {
        "query": "When was one of the casts in \"High School Musical 2\" born? ",
        "response": "December 14, 1988",
        "source": "hotpot_qa"
    },
    {
        "query": "The Widower is a series that portrays the life and crimes of a convicted murderer born in which year ?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Hobbycraft and it's competitor, High Street, are located where?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "When will the election be held that includes democrat Jay Gonzalez as a candidate?",
        "response": "November 6, 2018",
        "source": "hotpot_qa"
    },
    {
        "query": "How many films did the studio Iosif Boyarsky produce in 2017?",
        "response": "1528",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cathedral of St Michael and St George, Aldershot and All Saints' Church, Newcastle upon Tyne both located in England?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "On what campus did the chemist that won the 1951 Nobel Prize in Chemistry make his discovery?",
        "response": "University of California, Berkeley",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael C. Frank, a developmental psychologist at Stanford University, studied which indigenous language of the Amazonas in Brazil?",
        "response": "Pirahã language",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2004 zombie movie Life After Beth features Aubrey Plaza, who is well known as a star of which NBC sitcom?",
        "response": "Parks and Recreation",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American swimmer, coached by Ray Looze, won a bronze medal in the men's 100 meter breaststroke at the 2016 Summer Olympics?",
        "response": "Cody Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that published Shipwrecker also published what popular game series?",
        "response": "The Settlers of Catan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more acts, Hans Heiling or La favorite?",
        "response": "La Favorite",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was \"Paper Angels\" by Jimmy Wayne released?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a sequel to a movie with Drake Bell based on \"The Fairly OddParents\"?",
        "response": "A Fairly Odd Summer",
        "source": "hotpot_qa"
    },
    {
        "query": "Disney Dreams! was conceived by the creator of which nighttime show at the Disneyland Resort?",
        "response": "World of Color",
        "source": "hotpot_qa"
    },
    {
        "query": "What Person is known for his various comedic and dramatic film roles, including \"Splash\", Norman Jewison, or Tom Hanks?",
        "response": "Thomas Jeffrey Hanks",
        "source": "hotpot_qa"
    },
    {
        "query": "What Pakistan Super League team plays at the stadium where Aftab Ahmed played against Hyderabad in November 1964",
        "response": "Karachi Kings",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed in Seattle, Washington, Pop Will Eat Itself or Soundgarden?",
        "response": "Soundgarden",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novel championed by the man who wrote \"The Corrections\" was given the title \"Time 100 Best English-language Novels from 1923-2005\"?",
        "response": "The Man Who Loved Children",
        "source": "hotpot_qa"
    },
    {
        "query": " Did Manoel de Oliveira and Donald Crisp ever have similar jobs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Mangoplah mean in the traditional language of the people of Austalia?",
        "response": "Kooris singing",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does the 2005 Oregon Ducks football team quarterback currently play for?",
        "response": "Los Angeles Chargers",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahmad Bustomi idolizes the football player who played for what US club?",
        "response": "New York City FC",
        "source": "hotpot_qa"
    },
    {
        "query": "The district that the village of Asamang is located in was split on what date?",
        "response": "November 12, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Asbjørn Hróbjartsson received his Ph.D. in June 2001 from a univeristy founded in what year?",
        "response": "1479",
        "source": "hotpot_qa"
    },
    {
        "query": "What are both Mesquite and Bruckenthalia?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Saiful Azam was with what warfare branch of the Pakistan Armed Forces?",
        "response": "Pakistan Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "What other attorney was along with  the attorney who specializes in constitutional law litigation and was Senior Trial Counsel at the Ann Arbor-based Christian, conservative, nonprofit, public interest law firm based in Ann Arbor, Michigan?",
        "response": "David Yerushalmi",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of the player who broke Babe Ruth's 34-year-old single-season record for home runs?",
        "response": "Eugene",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Czech tennis player was born first, Lucie Šafářová or Renáta Tomanová?",
        "response": "Renáta Tomanová",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2011 census what was the population of suburban area in which BA Connect is headquartered ?",
        "response": "26,788",
        "source": "hotpot_qa"
    },
    {
        "query": "Jake Roberts is an English film editor best known for his works on a British drama film based on what 2010 play?",
        "response": "Posh",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeremy Theobald and Christoper Nolan share what profession?",
        "response": "producer",
        "source": "hotpot_qa"
    },
    {
        "query": "What team does Magnus Christensen play for that is located in Aalborg?",
        "response": "AaB Fodbold",
        "source": "hotpot_qa"
    },
    {
        "query": "In what part of England do the young actors, Withnail and I, find a weekend to be less recuperative than they planned?",
        "response": "Cumbria",
        "source": "hotpot_qa"
    },
    {
        "query": "Joan Guzmán was a Dominican former professional boxer, and two-weight world champion, from which sanctioning boxing organization?",
        "response": "World Boxing Organization",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of this county located in the Eastern Coalfield region of the U.S. state if Kentucky, in which the unincorporated community of Stay is located?",
        "response": "4,755",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor who appeared in The Wesley's Mysterious File has performed in more than 160 films while maintaining a successful singing career?",
        "response": "Andy Lau",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Douglas C-47 Skytrain carrying in the 1951 French crime film directed by Jacques Daniel-Norman?",
        "response": "a shipment of gold",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first name of the author who wrote the play in which Rønnaug Alten made her stage debut at Den Nationale Scene in 1930 as \"Viola\"?",
        "response": "William",
        "source": "hotpot_qa"
    },
    {
        "query": "Musical artist Diabolic and Vinnie Paz, who was featured on Diabolic's second studio album Fightin' Words, are both what type of musicians?",
        "response": "rapper",
        "source": "hotpot_qa"
    },
    {
        "query": "Which editor of Progress in Materials Science also taught metallugy at Harvard University?",
        "response": "Bruce Chalmers",
        "source": "hotpot_qa"
    },
    {
        "query": "What United States television channel aired the film about a man who died on September 11, 2001 and led hundreds out of the South Tower before dying in its collapse?",
        "response": "The History Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "\"A Rickle in Time\" is the first episode in the second season of a tv sitcom that originally aired on what network?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American hip hop duo from Port Arthur, Texas did Mean Green feature?",
        "response": "UGK",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Jocelyn Moorhouse and Stuart Rosenberg have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band first found success in Canada and included Michael Derosier on drums and percussion?",
        "response": "Heart",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Howard Hawks a screenwriter of more productions than Arthur Berthelet",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were OK Go and Ozma both from the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": " Harlequin is the first novel in The Grail Quest series by an English author who  is best known for his novels about what Napoleonic Wars rifleman?",
        "response": "Richard Sharpe",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the motto of a musical group who performed Dark Adventure Radio Theatre: The Call of Cthulhu?",
        "response": "Ludo Fore Putavimus",
        "source": "hotpot_qa"
    },
    {
        "query": "What prehistoric animated adventure film did Walt Disney Pictures produce in 2000, led by the editor who worked on Aladdin and Pocahontas?",
        "response": "Dinosaur",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the man, who authored a self-help and meditation program that claims to increase an individual's abilities through relaxation and development of higher brain functions, born?",
        "response": "1914",
        "source": "hotpot_qa"
    },
    {
        "query": "How was Fridlevus II related to Halfdan?",
        "response": "brother",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university founded independently, Victoria University of Wellington or The Northcap University?",
        "response": "The NorthCap University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Malephora or Kirengeshoma?",
        "response": "Malephora",
        "source": "hotpot_qa"
    },
    {
        "query": "Fight Life is a feature-length documentary on the sport of mixed martial arts, featuring Miesha Tate, an American Mixed Martial Arts Pundit and former mixed martial artist who is a champion in what fighting weight?",
        "response": "Bantamweight",
        "source": "hotpot_qa"
    },
    {
        "query": "Contempo Magazine and Girls' Life are both from what nationalities media?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "This single-decker bus body was built for the VDL SB200 lightweight single-decker bus chassis by a coachbuilder that was established in what year?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "NCS: Manhunt is a British television crime drama series, starring David Suchet, the series notably starred which Irish actor, whose feature film debut was in the fantasy war epic \"300\" (2007)?",
        "response": "Michael Fassbender",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation Grapple helped fix something with the United States, which was used by which notable person in a speech?",
        "response": "Winston Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fifth oldest surviving film studio in the world produced the 1936 film And Sudden Death ?",
        "response": "Paramount Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "When were the astronauts for the first manned space program of the United States announced? ",
        "response": "April 9, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the lead actor in the British television period drama series that also featured English actress Joanna Horton?",
        "response": "Mark Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth name of the actress who co-starred with Fred Astaire in \"Royal Wedding\"?",
        "response": "Suzanne Lorraine Burce",
        "source": "hotpot_qa"
    },
    {
        "query": "John Sebastian is an American-born singer-songwriter, guitarist, harmonicist, and autoharpist,  best known as a founder of The Lovin' Spoonful, that did an impromptu appearance where in 1969? ",
        "response": "Woodstock",
        "source": "hotpot_qa"
    },
    {
        "query": "A Very Crappy Christmas was an episode in season four of South Park, which began airing on what date?",
        "response": "April 5, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the mathematician in whose enumeration of the Archimedean solids the elongated square gyrobiculopa may have been discovered born?",
        "response": "1571",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress best known for her roles in the West End and Oliver frequented a Music Hall registered for what?",
        "response": "registered theatre charity and non-profit",
        "source": "hotpot_qa"
    },
    {
        "query": "You Got It All was written by the artist who was more famous for a song that was penned for what album?",
        "response": "Partners in Crime",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is this American drummer currently member of, whom Annihilator's album \"All for You\" featured for the second time?",
        "response": "Dream Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "Sofia Airport serves as a base for an Irish low-cost airline founded in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Country is Sul America Esporte Clube in?",
        "response": "Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Italian former footballer who inspired 2001–02 Bologna F.C. 1909 season midfield born",
        "response": "24 August 1973",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the third collaboration open by Richard Rodgers  and Oscar Hammerstein II , The form began to flourish in the late 1960s?",
        "response": "Broadway",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Iresine and Echinacea which genus contains 20 to 25 species?",
        "response": "Iresine",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the smallest country subdivision that contains both Greenrow and Wigton?",
        "response": "Allerdale",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American biographical sports drama film directed by Craig Gillespie and featuring the song \"We Could Be Kings\"?",
        "response": "Million Dollar Arm",
        "source": "hotpot_qa"
    },
    {
        "query": "Millie Brady had a role in the 2015 French-British crime film directed by whom?",
        "response": "Brian Helgeland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who passed away first, Claudio Monteverdi or Gaspare Spontini ?",
        "response": "Claudio Giovanni Antonio Monteverdi",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Australian television and feature film producer born who voiced in Johnny Swank for the  secret agent's sidekick K2?",
        "response": "25 November 1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Fight Life included which MMA fighter from the lightweight division?",
        "response": "Michael Keith Chiesa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a role in Survival of Dana and played a character who had a younger sister named Laura?",
        "response": "Melissa Sue Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward George \"Ed\" Skrein, is an English actor and rapper, outside his rap career, he is best known for his roles including as Frank Martin Jr., in The Transporter Refueled, is a 2015 French action film directed by who?",
        "response": "Camille Delamarre",
        "source": "hotpot_qa"
    },
    {
        "query": "The 99p Challenge is presented by an English comedian who was born in East Dulwich, south London, and who came to prominence through her comedy partnership with Mel Giedroyc in what?",
        "response": "Mel and Sue",
        "source": "hotpot_qa"
    },
    {
        "query": "What luxury jeweler decorated the ceiling of  The Pantages Theatre?",
        "response": "Tiffany & Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What team appeared in the 2008 Alamo Bowl against the Missouri Tigers coached by Gary Pinkel?",
        "response": "Northwestern Wildcats",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hold the record of being the only driver to ever win the street circuit event held in one of China's Special Administrative Regions in which both car and motorcycle races are held?",
        "response": "Felix Rosenqvist",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir Andrew Wood of Largo died in 1515, while James III of Scotland dies before him in which year?",
        "response": "1488",
        "source": "hotpot_qa"
    },
    {
        "query": "Link richness is the quality, possessed by some websites, of having many hyperlinks, classified advertising sites like Craigslist, of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What American composer born in 1895 was married to his frequent collaborator Verna Arvey?",
        "response": "William Grant Still",
        "source": "hotpot_qa"
    },
    {
        "query": "The director who wrote the science-fiction horror comedy Bad Taste was born in which country?",
        "response": "New Zealand",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Matty Mullins and Andy Kuntz.from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sceptical Chymist: or Chymico-Physical Doubts & Paradoxes is the title of a book, by which Anglo-Irish chemist?",
        "response": "Robert Boyle",
        "source": "hotpot_qa"
    },
    {
        "query": "NGC 7301 was discovered by an American astronomer in what year?",
        "response": "1886",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio album by childish gambina is produced by Glover and contains the song \"redbone\"?",
        "response": "\"Awaken, My Love!\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Gaslight Anthem and No Devotion both from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Combat boots are military boots designed to be worn by soldiers during combat or combat training, as opposed to during parades and other ceremonial duties, today, many combat boots incorporate technologies originating in civilian hiking boots, such as what, which  is a waterproof, breathable fabric membrane and registered trademark of W. L. Gore and Associates?",
        "response": "Gore-Tex",
        "source": "hotpot_qa"
    },
    {
        "query": "The passage of the General Survey Act followed the landmark Supreme Court ruling, Gibbons v. Ogden, which was argued by what exiled Irish patriot?",
        "response": "Thomas Addis Emmet",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles McHugh served on the town council of which Adelaide, South Austrialia suburb?",
        "response": "Thebarton",
        "source": "hotpot_qa"
    },
    {
        "query": "What Colombian singer have the members of Lo-Fi worked with?",
        "response": "Shakira",
        "source": "hotpot_qa"
    },
    {
        "query": " JJ Project was formed by JYP Entertainment and debuted as a part of a seven member group whose first EP peak at number one on which \"Billboards\" chart?",
        "response": "World Albums Chart",
        "source": "hotpot_qa"
    },
    {
        "query": "Corey Feldman, who was an actor in the horror comedy film The Lost Boys, was also the voice of Copper a hound dog in what animated film?",
        "response": "The Fox and the Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "Yunost, is a Russian language literary magazine created in which year, in Moscow (initially as a USSR Union of Writers' organ) by Valentin Kataev, was a Russian and Soviet novelist and playwright who managed to create penetrating works discussing post-revolutionary social conditions without running afoul of the demands of official Soviet style?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Bilkent University and University of Texas at El Paso both aim to support what?",
        "response": "research",
        "source": "hotpot_qa"
    },
    {
        "query": " \"I Saw Her Again\" was co-written by what Canadian singer born in 1940?",
        "response": "Dennis Gerrard Stephen Doherty",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, if any, was a member of more than one band, Ric Ocasek or Pepper Keenan?",
        "response": "Corrosion of Conformity and Down.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actor, born in 1959, that played the role of Isaac Chroner in the 1984 American horror film adaptation of Stephen King's \"Children of the Corn\"",
        "response": "John Franklin",
        "source": "hotpot_qa"
    },
    {
        "query": " Developing Unconventional Gas (DUG) is a series of annual regional conferences of the oil industry, which notable key note speaker, was born on May 22, 1928?",
        "response": "T. Boone Pickens",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 2003 biographical crime drama film directed by Wonder Woman director Patty Jenkins?",
        "response": "Monster",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the punk rock band, Zebrahead, formed after the alternative rock band, Violent Soho?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the castle that John Crabbe defended located?",
        "response": "Berwick-upon-Tweed, Northumberland, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Vulpes qiuzhudingi is believed to be the ancestor of which small fox native to the Northern Hemisphere?",
        "response": "Arctic fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Californian band, formed in Modesto in 1992, once wrote a song about an android who drinks himself to death?",
        "response": "Grandaddy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a racer of midget cars, Arto Tunçboyacıyan or Fred Agabashian?",
        "response": "Levon \"Fred\" Agabashian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the teams title in 2007 Formula 3 Euro Series the year Romain Grosjean won the driver's title?",
        "response": "ASM Formule 3",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the defending champion Julia Görges defeated during the 2012 Dubai Tennis Championships semifinals?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Which single from Portishead's second studio album was #25 in the UK charts at the time if it's release?",
        "response": "Over",
        "source": "hotpot_qa"
    },
    {
        "query": "George Britton is known for playing the rold of Emile de Becque succeeding the actor who passed away in which year ?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of Gerald Ford's 1976 running mate?",
        "response": "Joseph",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year wasEdward Severin Clark's exclusive New York City apartment building built?",
        "response": "It was built in 1884",
        "source": "hotpot_qa"
    },
    {
        "query": "Maudlands railway station, was the original Preston terminus of the Preston and Wyre Joint Railway to Fleetwood, railway station in Fleetwood, Lancashire, in which UK country?  ",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "McKids was a chain of clothing stores marketed to children and operated by an American hamburger and fast food restaurant chain founded in what year?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Adriano Panatta and Gabriela Sabatini, have which mutual occupation?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did Guy Morrison coach baseball in?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game, Polarity or Indigo has been published by the most companies?",
        "response": "Polarity",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series created by Roger King gained Phil McGraw his celebrity status?",
        "response": "The Oprah Winfrey Show",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of entertainment does Four Star Playhouse and David Niven have in common?",
        "response": "performance",
        "source": "hotpot_qa"
    },
    {
        "query": "The mayor whose tenure marked the end of the 1900-1942 era in the history of Albany, New York was what political party?",
        "response": "Democrat",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the Egyptian melodrama featuring the debut of the actress known as Yolanda Cristina Gigliotti?",
        "response": "Niazi Mostafa",
        "source": "hotpot_qa"
    },
    {
        "query": "Crash is similar to what 16th century British card game in the sense that there is no betting?",
        "response": "In Crash, there is no betting, as in Brag",
        "source": "hotpot_qa"
    },
    {
        "query": "Who stars as a jazz pianist in the film that features the song \"Audition (The Fools Who Dream)\"?",
        "response": "Ryan Gosling",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1977 drama film The creature (Spanish: La criatura ) and the 1975 film The Beast (French: \"La Bête\" ) feature what relationship?",
        "response": "between a beast (monster) and a woman",
        "source": "hotpot_qa"
    },
    {
        "query": "What are people lacking when they have a condition called Alexithymia, which leads to unempathic and ineffective emotional responses?",
        "response": "Empathy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was made first, Toby Tyler or The Rocketeer?",
        "response": "Toby Tyler",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an area managed by the Bureau of Land Management as part of its National Landscape Conservation System, and protected as a National Conservation Area, it also is home to a mountain located in the Spring Mountain range that is the highest peak there?",
        "response": "Red Rock Canyon National Conservation Area",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the man with whom Hans Loewald studied philosophy? ",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the group supported by the actress that starred in A Time To Remember?",
        "response": "United Activists for Animal Rights",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the photographer who took the picture featured on the back of the Cramps' album \"Psychedelic Jungle\"?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "The Convention People's Party (CPP) () is a socialist political party in Ghana based on the ideas of Kwame Nkrumah,the first prime minister and president of Ghana, having led it to independence from Britain in what year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the given name of the American ultrarunner from Boulder, Colorado who started the Ultra Caballo Blanco?",
        "response": "Michael Randall Hickman",
        "source": "hotpot_qa"
    },
    {
        "query": "how old was the victim of Lori Drew?",
        "response": "13-year-old",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the college where Keggy the Keg is the mascot founded?",
        "response": "1769",
        "source": "hotpot_qa"
    },
    {
        "query": "Oxleys Wood is located in a settlement of what origin?",
        "response": "Saxon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English musician from the English rock band Deep Purple apeared on the English television show Gastank?",
        "response": "Ian Paice",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Geranium and Fargesia belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "What year were the singers of Be the First to Believe formed?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Nikos Kazantzakis and Thomas Sigismund Stribling, who had more diverse job experiences?",
        "response": "Thomas Sigismund Stribling",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Korean actress appeared in an omnibus of four short horror films directed by 5 South Korean directors in 2012 and also appeared in \"My Daughter Seo-young\"?",
        "response": "Choi Yoon-young",
        "source": "hotpot_qa"
    },
    {
        "query": "The largest gift of private land ever given to a government in South America was donated by the a family closely connected to which outdoor gear company?",
        "response": "Patagonia, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the basketball player who holds the most points scored during the Nike Hoops Summit game?",
        "response": "Turkish",
        "source": "hotpot_qa"
    },
    {
        "query": "Susan Killsby is the chairperson for a company located where?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Who built the resort that Kathy Griffin recorded Look at My Butt Crack at?",
        "response": "developer Steve Wynn",
        "source": "hotpot_qa"
    },
    {
        "query": "BD Performing Arts is the corporate entity that manages several performance groups for young people in Concord, the largest city in Contra Costa County, California, founded in which year?",
        "response": "1869",
        "source": "hotpot_qa"
    },
    {
        "query": "The founder of Imperial Academy of Arts was the first Russian Minister of what?",
        "response": "Education",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the \"Diary of a Wimpy Kid\" actress who starred with Kodi Smit-McPhee, Elias Koteas, and Richard Jenkins in the film \"Let Me In\" born?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Alan Chipp is the younger brother who was the inaugural leader of what party?",
        "response": "Australian Democrats",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie is a British musical adaptation of \"A Christmas Carol\" and stars Laurence Naismith?",
        "response": "Scrooge",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the author of A Yellow Raft in Blue Water the first Chair of the Native American Studies program?",
        "response": "Dartmouth",
        "source": "hotpot_qa"
    },
    {
        "query": "The lead singer of Faith No More also founded which band?",
        "response": "Mr. Bungle",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Friedrich Dürrenmatt and Joseph Heller's most famous works dramatizations of events in World War II?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the founders of BALR was a Dutch professional football player who played right back for which Italian club?",
        "response": "Cagliari",
        "source": "hotpot_qa"
    },
    {
        "query": "Snoop Dogg's Doggystyle and Snoop Dogg's Hustlaz: Diary of a Pimp are hip-hop music videos that feature what film genre?",
        "response": "hardcore pornography",
        "source": "hotpot_qa"
    },
    {
        "query": "What is formed through a reaction of (CH)C(CHOH) and Carbonyl Chloride?",
        "response": "Polycarbonate",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Republican representative considered running for US Senate after fellow Republican John Warner vacated in 2009?",
        "response": "Thomas Milburn \"Tom\" Davis III",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Three Fish and Live which one is from American rock band from York?",
        "response": "Live",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Hall and his Gang is a 1911 film about which Australian bushranger, played by John Gavin, who also directed?",
        "response": "Ben Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more popular in Norway, Volvic or Solo?",
        "response": "Solo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release date of this 2010 American black comedy that was a spin off/ sequel to Forgetting Sarah Marshall?",
        "response": "June 4, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "What division I-AA university football team represented the Southern Conference in the 1924 season?",
        "response": "South Carolina Gamecocks",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Donatos Pizza and Extreme Pizza what is the only country to have one of these restaurants besides the United States?",
        "response": "Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Boy Next Door\" is a popular song in a musical film about what family?",
        "response": "Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Antenen was born in what Swiss city  located in the Jura mountains at an altitude of 1000 m",
        "response": "La Chaux-de-Fonds",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the expedition led by the explorer buried at Grinder's Stand?",
        "response": "the Lewis and Clark Expedition",
        "source": "hotpot_qa"
    },
    {
        "query": "From which neighbourhood of New York City hails Azealia Banks, a rapper who performed uncredited vocals on a pop song by the band Scissor Sisters called 'Shady Love'?",
        "response": "Harlem",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the magazine that once covered an actress who starred in the CW show \"Hidden Palms\" created?",
        "response": "University of Southern California",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Tagetes and Tetradium which one was described as a genus by Linnaeus in 1753?",
        "response": "Tagetes",
        "source": "hotpot_qa"
    },
    {
        "query": "Nancy Massie Meadows spent time living in a West Virginia town that is also the county seat of which county?",
        "response": "Kanawha County",
        "source": "hotpot_qa"
    },
    {
        "query": "Christian Cantamessa contributed to  a video game about a death row prisoner forced to participate in a series of snuff films by doing what?",
        "response": "co-writing and directing",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of group does 1946 National League tie-breaker series and 1946 Brooklyn Dodgers season have in common?",
        "response": "teams",
        "source": "hotpot_qa"
    },
    {
        "query": "Love in the Moonlight starred what South Korean actor who is the leader and vocalist of the South Korean boy group B1A4 under WM Entertainment?",
        "response": "Jung Jin-young",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tama Maru No. 2 was damaged by what World War II American naval scout plane and dive bomber that was manufactured by Douglas Aircraft?",
        "response": "Douglas SBD Dauntless",
        "source": "hotpot_qa"
    },
    {
        "query": " Paul Dudley Sargent was baron in a town in which county ?",
        "response": "Hancock County",
        "source": "hotpot_qa"
    },
    {
        "query": "Glory is the debut extended play (EP) by an Australian rapper born in what city?",
        "response": "Sydney",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sun Tiantian and Gene Mayer both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these, Human Events or The New York Review of Books, is a conservative American political news and analysis website?",
        "response": "Human Events",
        "source": "hotpot_qa"
    },
    {
        "query": "James Edward Franco, is an American actor, director, screenwriter, and producer, he voiced characters in the animated film Sausage Party, an American adult computer-animated comedy film, released in which year, directed by Greg Tiernan and Conrad Vernon?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Year was Tori Spelling's Academy Award Winning Co-Star from Mother, May I Sleep with Danger? born?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Orfeo ed Euridice and Königskinder, are which type of performance?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Former Colonial Penn Life Insurance Company endorsers include a former professional gridiron football player who was inducted into what in 2003?",
        "response": "College Football Hall of Fame",
        "source": "hotpot_qa"
    },
    {
        "query": "Russian former professional boxer Nikolai Valuev first won in 2005 the heavyweight champion title from this American former professional boxer of which ethnicity?",
        "response": "Latino",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1st National Television Awards was hosted by which journalist and broadcaster?",
        "response": "Eamonn Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Alabama Crimson Tide football team's first Heisman Trophy winner plays for what NFL team?",
        "response": "New Orleans Saints",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Craig Ball record the sound track for a comedy film based on a 1930's comic strip? ",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first album of the singer that was featured along with Laura Dern in the music video for  Widespread Panic's song \"Aunt Avis\"?",
        "response": "\"Little\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film screenplay was based on the book that consisted of oral reminiscences fro American physicist Richard Feynman?",
        "response": "Infinity",
        "source": "hotpot_qa"
    },
    {
        "query": "Which individual from the silent film era, Enrico Cocozza or Robert F. Hill, mainly filmed in Scottland?",
        "response": "Enrico Cocozza",
        "source": "hotpot_qa"
    },
    {
        "query": "What song first recorded by a man who was the bass player for the Jimi Hendrix Experience was later recorded by a band that split up in 1972?",
        "response": "My Friends",
        "source": "hotpot_qa"
    },
    {
        "query": "The Texas Theatre is a movie theater and Dallas Landmark located in the Oak Cliff neighborhood of Dallas, Texas, it gained historical significance on November 22, 1963 as the location of Lee Harvey Oswald's arrest, and the killing of which Dallas police officer, who was an 11-year veteran with the Dallas Police Department, and died on November 22, 1963?",
        "response": "J.D. Tippit",
        "source": "hotpot_qa"
    },
    {
        "query": "The real father of Maggie from \"The Simpsons\" is revealed in \"Starship Poopers\". He is also an alien voiced by Harry Shearer. Which planet is he from?",
        "response": "Rigel VII",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Scott Pembroke and Eugeniusz Bodo die in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Efrem Flaks was the original performer of songs composed by which other Soviet film composer?",
        "response": "Matvei Isaakovich Blanter",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French term coined in 1968 by Jacques Pictet could the controversial Midtown Walmart be referred to as?",
        "response": "hypermarket",
        "source": "hotpot_qa"
    },
    {
        "query": "Setti David Warren, is the current Mayor of Newton, Massachusetts, and a former Democratic candidate for United States Senate, in which election is he currently running for Governor of Massachusetts?",
        "response": "Massachusetts gubernatorial election, 2018",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Helmut Käutner and Momina Duraid a filmmaker?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Seongho Cha is a dancer with what classical Chinese dance-performing troupe based out of New York City?",
        "response": "Shen Yun Performing Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "Eldorado Mountain is a summit in a mountain range that stretches how many miles?",
        "response": "more than 3000",
        "source": "hotpot_qa"
    },
    {
        "query": "Henryville Jr/Sr High School is located in Henryville,  a census-designated place (CDP) in Monroe Township, Clark County, in which U.S. state?",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "What Mega Shark Versus Crocosaurus star also does the voice of Sonic the Hedgehog for the animated series?",
        "response": "Jaleel White",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did one of the judges on \"Your Face Sounds Familiar\" win the Celebrity Big Brother 10?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Alain Tanner and Wolfgang Becker share a profession? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which monthly women's interest magazine has featured the author of \"Hormone Revolution\"?",
        "response": "Real Simple",
        "source": "hotpot_qa"
    },
    {
        "query": "Is At the Drive-In or Black Stone Cherry from further north?",
        "response": "Black Stone Cherry",
        "source": "hotpot_qa"
    },
    {
        "query": "What McMOnagle, Perri & McHugh attorney is notable for representing a hip hop artist with a stage name from a street in South Philadelphia",
        "response": "Fortunato Natale Perri Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "The hamlet containing the hospital at which Richard Angelo murdered several patients had what population in the 2010 census?",
        "response": "28,335",
        "source": "hotpot_qa"
    },
    {
        "query": "Which, or both, originated in Turkey and Central Asia; Tulips or Virgilia trees?",
        "response": "Tulips",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2014 Pittsburgh Steelers season This American was the coach, what year did he win Super Bowl XLIII?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film other than Harry Brown that Bad Ass is based on?",
        "response": "Clint Eastwood",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer and songwriter who recorded \"Treat You Better\" was born on what day?",
        "response": "August 8, 1998",
        "source": "hotpot_qa"
    },
    {
        "query": " Vítor Vianna is a Brazilian mixed martial artist, who has competed in mixed martial arts events in Brazil, Holland, and in the United States, this ranking is due to certain fights, of which type, that he has participated in which term used in combat sports such as boxing and mixed martial arts to describe a weight limit for odd class fights?",
        "response": "Catchweight",
        "source": "hotpot_qa"
    },
    {
        "query": "Getting Married in Buffalo Jump stars an actor who was born in what city?",
        "response": "Calgary, Alberta",
        "source": "hotpot_qa"
    },
    {
        "query": "Captain Holly Short is a character created by an author born in what year?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the hijacked plane rammed by Heather Penney crash? ",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Magical Halloween is a version of what type of pinball-like game?",
        "response": "Pachinko",
        "source": "hotpot_qa"
    },
    {
        "query": "On which television network did Joe Penny play an investigator named Jake Styles?",
        "response": "CBS",
        "source": "hotpot_qa"
    },
    {
        "query": "University of Peradeniya and University of Arizona, are located in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Fenriz was one half of the Norwegian heavy metal band that formed in 1986 under what name?",
        "response": "Black Death",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Samantha Cristoforetti or Vladimír Remek?",
        "response": "Vladimír Remek",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the singer of That's My Pa play in High Noon?",
        "response": "Ben Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the host of Fast Friends often make jokes about?",
        "response": "his mother-in-law and wife",
        "source": "hotpot_qa"
    },
    {
        "query": "Howard Van Doren Shaw AIA (May 7, 1869 – May 7, 1926) was an American architect, he designed Clayton Mark's urban planned worker community in in East Chicago, in which US state?",
        "response": "Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Ventimilia co-wrote the teleplay of the episode that was part of which season of The Simpsons?",
        "response": "sixth season",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Orlando Melbourne International Airport and Golden Triangle Regional Airport both US airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What city hosts an annual convention devoted to a line of toys manufactured by a company based in Denmark?",
        "response": "Seattle",
        "source": "hotpot_qa"
    },
    {
        "query": "Blue Vinyl and Man on Wire are both what?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "Aftermath was based on a real life midair plane collision that happened on what date?",
        "response": "1 July 2002",
        "source": "hotpot_qa"
    },
    {
        "query": "This player has played for both Paris Saint Germain F.C. and Genora C.F.C.",
        "response": "Thiago Motta",
        "source": "hotpot_qa"
    },
    {
        "query": "The District of Alaska was initially commanded by a general known for killing a superior officer in what year?",
        "response": "1862",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2007 action comedy film was Edgar Howard Wright  best known for ",
        "response": "Hot Fuzz",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the next replacement for the French football player nicknamed Le Roi during the 1987-88 Juventus F.C. season?",
        "response": "Ian Rush",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Ezra Koenig or Tori Amos?",
        "response": "Tori Amos",
        "source": "hotpot_qa"
    },
    {
        "query": " Miss You is a track by UK rock band Feeder that received its first radio play as part of a segment by a music radio presenter who was named what at the 2007 Sony Radio Academy Awards?",
        "response": "Music Broadcaster of the Year",
        "source": "hotpot_qa"
    },
    {
        "query": "With whom did the lead singer of Bleachers collaborate on the song \"Liability\"?",
        "response": "Lorde",
        "source": "hotpot_qa"
    },
    {
        "query": "The Neil Modular Tracker, a Free Software project to create a Jeskola Buzz clone for Linux, which was based on a currently unmaintained deprogram called \"Aldrin\", is named after a wordplay on Neil Armstrong and what former American astronaut?",
        "response": "Buzz Aldrin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first Russian composer to make a lasting impression internationally, Alessandro Scarlatti or Pyotr Ilyich Tchaikovsky?",
        "response": "Pyotr Ilyich Tchaikovsky",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American comedian, actor and musician died who was best known for his \"intense energy and raucous attitude\" and also worked with  Layne \"Shotgun\" Britton?",
        "response": "March 5, 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sky Kings' John Cowan was also the lead vocalist and bass player for which band?",
        "response": "New Grass Revival",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a higher world ranking, Peter Fleming, or Oliver Marach?",
        "response": "As a singles player, he peaked at World No. 8",
        "source": "hotpot_qa"
    },
    {
        "query": "Pécs Brewery or Brewery of Pécs, is of the four big breweries in Hungary and the biggest in the Southern Transdanubia located in Pécs, the capital of Baranya County in southwestern Hungary, Beer in Hungary has been brewed for well over which number of years?",
        "response": "thousand",
        "source": "hotpot_qa"
    },
    {
        "query": "Adriana Ocampo has led six research expeditions to study what geological formation that is more than 180 km in diameter and 20 km in depth",
        "response": "The Chicxulub crater",
        "source": "hotpot_qa"
    },
    {
        "query": "What portable media player was distributed through HP?",
        "response": "iPod+HP",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the operatic soprano who starred in One Night of Love?",
        "response": "Tennessee Nightingale",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full meaning of the graphic editor used in creating Propaganda?",
        "response": "GNU Image Manipulation Program)",
        "source": "hotpot_qa"
    },
    {
        "query": "Are William Witney and Frederick Wiseman both documentarians?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Brazilian racing driver died in an accident during the 48th season of FIA Formula One motor racing?",
        "response": "Ayrton Senna",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is both the site of the Staples Center and the hometown of Motley Crüe?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who took over the role of hostess on \"Wheel of Fortune\" when Susan Stafford left the show?",
        "response": "Vanna White",
        "source": "hotpot_qa"
    },
    {
        "query": "Cenotaph is the ninth studio album released by an English musician who became known as the founder of what band?",
        "response": "Porcupine Tree",
        "source": "hotpot_qa"
    },
    {
        "query": "Walker Evans' photographs that inspired The Tender Land were intended to document what?",
        "response": "effects of the Great Depression",
        "source": "hotpot_qa"
    },
    {
        "query": "Maryland Jockey Club operates a race track in the largest municipality in which Maryland county?",
        "response": "Prince George's County",
        "source": "hotpot_qa"
    },
    {
        "query": "The John N. and Mary L. (Rankin) Irwin House in Keokuk, Iowa, is a historic house that was listed on the National Register of Historic Places in 1999, John N. Irwin, who bought the house and raised his family there with his wife Mary, was a five-term mayor of Keokuk who went on to serve as the territorial governor of the Idaho Territory and the Arizona Territory, are in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the actor responsible for playing Callan in a British television series?",
        "response": "Edward Albert Arthur Woodward",
        "source": "hotpot_qa"
    },
    {
        "query": "Has the monthly city magazine \"Baltimore\" been in publication longer than the Washington, D.C. based Christian magazine \"Sojourners\"?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 1996 American crime drama film in which the actor, known for his role as Harry Senate on David E. Kelley's Fox drama series \"Boston Public\", played a role?",
        "response": "Joel Schumacher",
        "source": "hotpot_qa"
    },
    {
        "query": "Florida State Road 535 ends at which Orange County city?",
        "response": "Lake Buena Vista",
        "source": "hotpot_qa"
    },
    {
        "query": "What NBA team did Stan Love's son win a championship with?",
        "response": "Cleveland Cavaliers",
        "source": "hotpot_qa"
    },
    {
        "query": "Arrow Dynamics started designing roller coasters with which pair of intertwined steel coasters at Disneyland?",
        "response": "Matterhorn Bobsleds",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English stage and film actress appeared in \"Gone with the Wind\" (1939) and \"Things Are Looking Up\" (1935)?",
        "response": "Vivien Leigh",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of the song whose lyrics are also credited to Bo Diddley and Willie Cobbs, which was released a few decades after the beginning of the singer's career?",
        "response": "You Don't Love Me",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fox and the Hound and The Apple Dumpling Gang, are produced by which organization?",
        "response": "Walt Disney Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "Genealogy is an Armenian supergroup that competed in a 2015 singing contest in what city?",
        "response": "Vienna, Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Richard C. Sarafian and Ara Parseghian from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": " Live on Earth features songs from the other musical project of which record producer?",
        "response": "Arjen Anthony Lucassen",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Petroselinum and Phyllostachys belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "Who served at the record office of the Queen of the United Kingdom of Great Britain and Ireland in the 1800's?",
        "response": "John James Bond",
        "source": "hotpot_qa"
    },
    {
        "query": "What position in the Janata Party did the man who inaugurated Academic Hinduphobia hold?",
        "response": "President",
        "source": "hotpot_qa"
    },
    {
        "query": "What direction does U.S. Route 123 and U.S. Route 23 have in common?",
        "response": "north",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Oakland University and Cape Peninsula University of Technology located in the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Errol Sitahal played Dr. Patel in a film directed by who?",
        "response": "Danny Leiner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Indian English-language daily newspaper and one of the oldest Indian newspapers still in circulation listed Anuvab Pal as one of India's top comedians?",
        "response": "The Times of India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member played Kyle Reese and also played Pavel Chekov in three \"Star Trek\" films?",
        "response": "Anton Viktorovich Yelchin",
        "source": "hotpot_qa"
    },
    {
        "query": "Vince Velasquez made his MLB debut with a team that plays their home games at what park?",
        "response": "Minute Maid Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Which king of Denmark and Norway had harsh restrictions imposed on him due to his close ties with Germany?",
        "response": "Frederick III",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Danish politician elected to the parliament of Denmark represented the \"Radical Left\"?",
        "response": "Christian Friis Bach",
        "source": "hotpot_qa"
    },
    {
        "query": "Waiting for Guffman included the actress and comedian of what dual nationality?",
        "response": "Canadian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do E. Elias Merhige and Jean-Pierre Jeunet have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The woman who wrote and storyboarded \"Incendium\" was born in what year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor on \"Gash\" was born on January 30, 1974?",
        "response": "Olivia Colman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cynodon and Claytonia both species of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Ruth Copeland, is an English-born former singer, based in the United States since the 1960s and known for her collaborations with George Clinton and, which accompanying band?",
        "response": "Parliament-Funkadelic",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Jackie Harris on \"Roseanne\" also appeared with John Candy and Amy Madigan in a 1989 comedy film directed by who?",
        "response": "John Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "The census-designated place of Woodland is located in a town named for what man?",
        "response": "Ezekiel Bailey",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2016 of the city that includes Callala Beach?",
        "response": "99,650",
        "source": "hotpot_qa"
    },
    {
        "query": "William C. deMille and Harry Keller were both what nationalities? ",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American magician that hosted Penn Radio?",
        "response": "Penn Jillette",
        "source": "hotpot_qa"
    },
    {
        "query": "Niki is scheduled to operate where?",
        "response": "European and North African leisure destinations from Vienna, Salzburg, Graz and Innsbruck",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the last Audio Adrenaline album on which lead singer Mark Stuart performed?",
        "response": "Adios: The Greatest Hits",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the song by The Flys featured in the 2001 American teen crime comedy film directed by Francine McDougall?",
        "response": "She's So Huge",
        "source": "hotpot_qa"
    },
    {
        "query": "What British series did the actor star in who also had a role in the 2014 American dystopian science fiction action film directed by Neil Burger?",
        "response": "\"Skins\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"Parks and Recreation\" and \"Legion\" actor will star in an upcoming American comedy film directed by Jim Hosking?",
        "response": "Aubrey Plaza",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Davide di Lernia and Radio Monte Carlo related?",
        "response": "radio",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state did Thomas W. Simpson earn his Master of Theological Studies degree from?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, George Kuchar or Arthur Penn?",
        "response": "Arthur Hiller Penn",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the director of \"The New World\"?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Televised Morality is a publication related to a spinoff of what series?",
        "response": "Buffy the Vampire Slayer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the band that released the song\"A Love Like War\" formed ? ",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Isaia is an Italian menswear brand founded in Naples in 1920, Italy is considered the birthplace of what and a cultural superpower?",
        "response": "Western civilization",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer wrote more essays, David James Duncan or Edwidge Danticat?",
        "response": "David James Duncan",
        "source": "hotpot_qa"
    },
    {
        "query": "Little Miss Sunshine co-produced David T. Friendly was nominated for what Academy Award?",
        "response": "Best Picture",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novel was the opera at which Artyom Melikhov has his first appearance based?",
        "response": "\"War and Peace\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jackson Crossing enclosed shopping mall hosts a chain department store from what country?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which single was recorded in 1989 at the first Tubronegro rehearsal by the Norwegian punk rock band, initially active from 1989 to 1998, whose style is \"deathpunk\"?",
        "response": "Computech",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school was founded first, Kasetsart University or Holy Cross of Davao College?",
        "response": "Kasetsart University",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the fifth season of the television show which Alex Saxon appeared in from 2013-2015 renewed?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the band which was one of the pioneers of  new genre of rock with Rekuiem formed? ",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Mandolyn Wind Ludlum toured and recorded with an alternative hip hop group from where?",
        "response": "Oakland, California",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the composer honored by the Silent Night Chapel born?",
        "response": "1787",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Hae-young (born 1973) is a South Korean film director and screenwriter, his third feature is a mystery genre film, in which 2015 film written and directed by Lee Hae-young, starring Park Bo-young and Uhm Ji-won?",
        "response": "The Silenced",
        "source": "hotpot_qa"
    },
    {
        "query": "Eat to Live is a book that was written bt Dr, Joel Fuhrman which advocates what diet?",
        "response": "micronutrient-rich diet",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people live in the popular tourist town located 6 km south of Preila, Lithuania?",
        "response": "1,650",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the Camelot musical and wrote the screenplay for the Camelot film adaptation? ",
        "response": "Alan Jay Lerner",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Dan II of Denmark's father, also known as the legendary king of the Angles?",
        "response": "Offa of Angel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which computer was listed the highest selling computer model of all time, Commodore 64 or Aamber Pegasus?",
        "response": "Aamber Pegasus",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Kent created which 2014 Australian horror film?",
        "response": "The Babadook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which training facility did the wrestler, who won the WWE Tag Team Championship once with Vladimir Kozlov, found?",
        "response": "Battle Arts Academy",
        "source": "hotpot_qa"
    },
    {
        "query": "Mackenzie Davis appeared in the 2013 Canadian romantic comedy film directed by whom?",
        "response": "Michael Dowse",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did Barathea win at Churchill Downs in 1994?",
        "response": "Breeders' Cup Mile",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Metro 2033 released in 2013?",
        "response": "It was released in 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other name for the area at which Ranney Hill, Northwest Territories anomaly  rose? ",
        "response": "Laurentian Plateau",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of programs does the the host Institute of the Council on Tall Buildings and Urban Habitat offer?",
        "response": "engineering, science, psychology, architecture, business, communications, industrial technology, information technology, design and law",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was formed first, LCD Soundsystem or Days of the New?",
        "response": "Days of the New",
        "source": "hotpot_qa"
    },
    {
        "query": "What multinational banking and financial services corporation sponsored the 2007 Lexus Cup?",
        "response": "DBS Banks",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Selena Gomez song did Filous release a remix of?",
        "response": "Same Old Love",
        "source": "hotpot_qa"
    },
    {
        "query": "Philip Stanley Abbot was a graduate of Harvard, class of 1889, and of Harvard Law School, class of 1893, he practiced law until 1894 with Samuel D. Warren and Louis Dembitz Brandeis, was an American lawyer and associate justice on the Supreme Court of the United States from 1916 to what year?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Which elementary cafeteria worker, also known as Chef, in South Park Colorado rushed Mephesto to Hell's Pass Hospital in \"Cartman's Mom Is Still a Dirty Slut?\"",
        "response": "Jerome \"Chef\" McElroy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is included in the tourist attraction Dinosaur Kingdom and was an American politician and lawyer?",
        "response": "Abraham Lincoln",
        "source": "hotpot_qa"
    },
    {
        "query": "The Un-Americans contained which wrestler who also went by what TNA Wrestling name?",
        "response": "Andrew Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "What American animated series is composed by James L. Venable, garnering an Emmy nomination for Main Title Theme Music?",
        "response": "Foster's Home for Imaginary Friends",
        "source": "hotpot_qa"
    },
    {
        "query": "The man who Co-directed the film where Zac Effron can be found as a character named ted, and had a job at pixar, now works for what company?",
        "response": "Illumination Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Hanzhong and Pingliang in the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The King of England, who William Scott presided over trials resulting from this purge of the administration, reigned for how long?",
        "response": "50 years",
        "source": "hotpot_qa"
    },
    {
        "query": "Fallout 4: Far Harbor is an expansion pack for the 2015 video game \"Fallout 4\" published by an American video game publisher founded in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel did the American short story writer who also wrote Losing Battles wrote ",
        "response": "American South",
        "source": "hotpot_qa"
    },
    {
        "query": "Gymnocalycium and Haemanthus, are native to South America?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the film for which Finn Carter is best known for playing a role?",
        "response": "Ron Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Lady Margarita Elizabeth Rose Alleyne Armstrong-Jones is the only daughter of an English furniture maker who is the grandson of who?",
        "response": "King George VI",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Ann Wilson and Keith Morris have in common?",
        "response": "American musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Carleton Ultimate Team plays in a city mostly in which county?",
        "response": "Rice County",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Roger Hodgson and Max Green both from England?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did Adam J. Yeend have a role in that premiered on November 25, 2012?",
        "response": "Liz & Dick",
        "source": "hotpot_qa"
    },
    {
        "query": "Bethesda Game Studios has studios in which two cities?",
        "response": "Montreal, Quebec",
        "source": "hotpot_qa"
    },
    {
        "query": "What river is the castle that a stone was taken from to build the L-plan tower for Barscobe Castle on?",
        "response": "River Dee",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the only town that starts with an \"E\" that Nokomis Regional High School accepts students from?",
        "response": "1,246",
        "source": "hotpot_qa"
    },
    {
        "query": "Where the University of California, San Francisco and University of Washington founded in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the chemical waste site Hooker Chemical Company is best known for located?",
        "response": "Niagara Falls, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song, by the man who played guitar for most of the performances on Let It Rock, was number 5 on the US \"Billboard\" Hot chart sometime in the 1980s or 1990s?",
        "response": "Angel Eyes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is most of the compound used in the topical application of magnesium found in North America?",
        "response": "Great Salt Lake brine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which composer from Rhode Island named her ensemble the LSI Philharmonic?",
        "response": "Wendy Carlos",
        "source": "hotpot_qa"
    },
    {
        "query": "Billy Henry played for Manchester City and which other current Premier League club?",
        "response": "Leicester City",
        "source": "hotpot_qa"
    },
    {
        "query": "In 135 BC, a second campaign was sent to intervene in a war between Minyue and another ancient kingdom established at the collapse of whom?",
        "response": "the Qin dynasty",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthplace of the 23rd United States Secretary of War?",
        "response": "Fairview",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Yizheng and Wuchang District in different provinces of China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In Irish and Scottish mythology, Uathach was the daughter of a warrior woman associated with which Isle ?",
        "response": "Isle of Skye",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Korean romance film written and directed by Lee Yong-ju was Han Ga-in in?",
        "response": "Architecture 101",
        "source": "hotpot_qa"
    },
    {
        "query": "Where should I visit in Turkey, Endem TV Tower or Boğaziçi University?",
        "response": "Boğaziçi University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which chain currently has more stores, Pietro's Pizza or Pizzeria Venti?",
        "response": "Pizzeria Venti",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animal races annually for a national title as part of a post-season NCAA Division I Football Bowl Subdivision college football game?\\",
        "response": "Dachshunds",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2016 episode of the series Black Mirror was directed by the director of Be Right Back?",
        "response": "San Junipero",
        "source": "hotpot_qa"
    },
    {
        "query": "Who lived longer- Bernard-Marie Koltès or Philip José Farmer?",
        "response": "Philip José Farmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir John Oldcastle, was an English Lollard leader, he escaped from which historic castle located on the north bank of the River Thames in central London, and it lies within the London Borough of Tower Hamlets?",
        "response": "Tower of London",
        "source": "hotpot_qa"
    },
    {
        "query": "How many members are in the band that includes Woo Ji-ho under a stage name?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members, Semisonic or Cake?",
        "response": "Cake",
        "source": "hotpot_qa"
    },
    {
        "query": "J. W. Eddy built this funicular railroad in Los Angeles, California which has two cars known by what names?",
        "response": "\"Sinai\" and \"Olivet\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Ennio Morricone composed the score for the 1986 British period drama written by whom?",
        "response": "Robert Bolt",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the fantasy books by American writer Ursula K. Le Guin featuring the fictional people, The Kargs, called?",
        "response": "Earthsea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French actress starred in the 1995 comedy A Feast At Midnight?",
        "response": "Julie Dreyfus",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the small town with an Air Force Base 7 mi northeast of Sacramento, California?",
        "response": "743",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006 United States Grand Prix ended with the driver of what nationality in third?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2003, James Beaumont joined a professional football football club in West Bridgford, England, which plays their home matches where?",
        "response": "City Ground",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of AFL medium-sized forward Tory Dickson?",
        "response": "Glenn Dickson",
        "source": "hotpot_qa"
    },
    {
        "query": "The Holy Trinity, an episode of British motoring series \"The Grand Tour\" was produced by which  independent television production company founded in 2015 in the UK?",
        "response": "W. Chump and Sons",
        "source": "hotpot_qa"
    },
    {
        "query": "Paris By Night 83 is shot in an amusement park that features how many rides ?",
        "response": "35",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band contained more members, Two Door Cinema Club or Cowboy Junkies?",
        "response": "Cowboy Junkies",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Razorlight and Joywave play the same genre of music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Christianity in Irleand is the largest religion. Specifically, the Religion in Northern Ireland is comprised in percentage to those regularly attending church?",
        "response": "45%",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a set of annual international awards bestowed in several categories by Swedish and Norwegian institutions in recognition of academic, cultural or scientific advances, who has a recipient who has won two of these awards who founded the Radium Institute?",
        "response": "The Nobel Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Do musicians Robert Fleischman and Jimmy Barnes have the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band that formed in Athens, Georgia, in 1980 had its albums produced by Mitch Easter from 1981 through 1984?",
        "response": "R.E.M.",
        "source": "hotpot_qa"
    },
    {
        "query": "What country serves as the northern boarder to the country in which Monnechroma tibialis inhibits?",
        "response": "Nicaragua",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the Jaguar R2 driver, Eddie Irvine?",
        "response": "British racing driver",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more recent, Rick Rosenthal or Gary Nelson?",
        "response": "Richard L. \"Rick\" Rosenthal, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was from the United States, Donald Barthelme or W. B. Yeats?",
        "response": "Donald Barthelme",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the tragic play which also has a 1968 film with a soundtrack by Nino Rota?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "DVB Bank SE is part of which second largest bank in Germany by asset size and the central institution for more than 1,000 co-operative banks and their 12,000 branch offices?",
        "response": "DZ Bank AG",
        "source": "hotpot_qa"
    },
    {
        "query": "Giuseppe Canale was instructed by which member of the Minnesota Democratic-Farmer-Labor Party?",
        "response": "Jacob Frey",
        "source": "hotpot_qa"
    },
    {
        "query": "The viola organista is a musical instrument designed by Leonardo da Vinci, was an Italian Renaissance polymath whose areas of interest included invention, painting, sculpting, architecture, science, music, mathematics, engineering, literature, anatomy, geology, astronomy, botany, writing, history, and cartography, he died in which year?",
        "response": "1519",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the political party of the president that Eugene V. Rostow served under?",
        "response": "Democrat",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine dubbed  a former American-Israeli basketball player a reference to the principal owner and chairman of the Charlotte Hornets of the National Basketball Association?",
        "response": "Sports Illustrated",
        "source": "hotpot_qa"
    },
    {
        "query": "What first water park at Walt Disney World is near Bay Lake, Disney's Wilderness Lodge. and Disney's Fort Wilderness Resort & Campground?",
        "response": "Disney's River Country",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was published in more countries: \"Arthur's Lady's Home Magazine\" or \"Costume\"?",
        "response": "Costume",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the supernatural drama that stars Zoie Palmer?",
        "response": "Jay Firestone",
        "source": "hotpot_qa"
    },
    {
        "query": "The Prince of Wales Glacier was named for what individual who was the oldest person to be next in line to the throne since Sophia of Hanover?",
        "response": "Charles, Prince of Wales",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was directed by Spike Lee, When the Levees Broke or When Brummies Met Sindhis?",
        "response": "When the Levees Broke",
        "source": "hotpot_qa"
    },
    {
        "query": "What president was assassinated and had Worthy Stevens Streator as one of his pallbearers?",
        "response": "James Abram Garfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Southern Style Tour was headlined by which lead vocalist from Hootie and the Blowfish?",
        "response": "Darius Carlos Rucker",
        "source": "hotpot_qa"
    },
    {
        "query": "Jerry Atkin is the Chairman of which company that has its headquarters in Utah?",
        "response": "SkyWest, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show was co-produced by an actor who has won two Golden Globe Awards from eight nominations?",
        "response": "\"The Runner\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What railroad company acquired the Johnsonburg, Kane, Warren and Irvine Railroad?",
        "response": "The JKWI was the designated operator of the Irvine, Warren, Kane & Johnsonburg Railroad, that was a partnership of Brock Railroad (a wholly owned subsidiary of Warren Car Company), Irvine Railroad (a wholly owned subsidiary of National Forge Company) and Struthers Wells Inter-American Corporation (a subsidiary of Struthers Wells), all three being Pennsylvania corporations, and had acquired from Conrail the following railroad line segments: MP 58.52 to MP 66.7 (Irvine to Warren) and MP 92.5 to MP 111.0 (Kane to Johnsonburg).",
        "source": "hotpot_qa"
    },
    {
        "query": "Cory Rooney wrote, produced, and developed many successful songs and careers for this American singer, songwriter, record producer, and actress who rose to fame in 1990 with the release of which album?",
        "response": "Vision of Love",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music features Geetam, created by a devotee of Lord Krishna?",
        "response": "Carnatic",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Missio or Cute Is What We Aim For formed first?",
        "response": "Cute Is What We Aim For",
        "source": "hotpot_qa"
    },
    {
        "query": "What band Formed in 1983 under the name Legacy has a member of an American jazz music trio comprising the guitarist Alex Skolnick, Matt Zebroski on drums, and Nathan Peck on bass?",
        "response": "Testament",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"Pennsylvania\"-class battleship was sunk in 1941?",
        "response": "USS \"Arizona\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What television network features a reality show that stars a former American football and baseball player who now works as an analyst for CBS sports?",
        "response": "Oxygen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these mines is more important to Canadian mining history, Hermiston-McCauley Mine or the McIntyre Mines?",
        "response": "The McIntyre mine",
        "source": "hotpot_qa"
    },
    {
        "query": "What former astronaut was a character in the 1995 film Apollo 13, as well as Jim Lovell and Jack Swigert?",
        "response": "Fred Wallace Haise Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Prince Consort of the Netherlands who was husband to Queen Beatrix and also officially opened the Wisseloord Recording Studio in 1978?",
        "response": "Prince Claus",
        "source": "hotpot_qa"
    },
    {
        "query": "The carriages for the New South Wales Xplorer were built in a suburb of what Australian city? ",
        "response": "Melbourne, Victoria, Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Alessandro is an opera composed by George Frideric Handel, who composed in what style?",
        "response": "baroque",
        "source": "hotpot_qa"
    },
    {
        "query": "What Actor is known for his role in Love Machine and Tony Rome? ",
        "response": "Shecky Greene",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the director of Blackball born? ",
        "response": "3 December 1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Wrexham Cathedral and Newport Cathedral located in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a ficitional superhero that appeared in DC Comics and had Rama as a potential love interest?",
        "response": "Wonder Woman",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this family-owned business that publishes mail order magazine \"Comfort\" founded?",
        "response": "1921",
        "source": "hotpot_qa"
    },
    {
        "query": "What Northern Ireland town founded in 1620 is the birthplace of one of the final four contestants from the seventh UK series of \"The Apprentice\"?",
        "response": "Cookstown",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the Sacramento Deep Water Ship Channel or the Contra Costa Canal completed in an earlier year?",
        "response": "Contra Costa Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film directed by Alice Winocour starred Matthias Schoenaerts?",
        "response": "Disorder",
        "source": "hotpot_qa"
    },
    {
        "query": "Delbert Mann and Stuart Heisler, have which mutual occupations?",
        "response": "television and film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American playwright born in April 1945, who wrote Joe Turner's Come and Gone?",
        "response": "August Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "John Boorman and John Edward Heys, share which common occupation?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Academy Awards nominations has this actress, who accepted a tribute award at the Gotham Independent Film Awards 2016,received?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Meryl Poster executive produced the 2000 movie based on the novel by whom?",
        "response": "Joanne Harris",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a small genus of flowering plants in the family Cannabaceae, Sagina or Humulus ?",
        "response": "Humulus",
        "source": "hotpot_qa"
    },
    {
        "query": "The American security consultant whom Aaron Tveit portrayed on stage did what after serving time in prison?",
        "response": "work for the federal government",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Aglaia belongs to Mahogany family and Valeriana belongs to Caprifoliaceae family?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the role of the man, who the Province of Georgia is named after, in the Holy Roman Empire?",
        "response": "Prince-elector",
        "source": "hotpot_qa"
    },
    {
        "query": "Meng Jia is a Chinese singer and actress mostly active in South Korea and China, and part of what South Korean girl group based in South Korea formed by JYP Entertainment in 2010?",
        "response": "Miss A",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper recorded the song \"Saint Pablo\" featuring the vocals of Sampha?",
        "response": "Kanye West",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry did both John Grierson and Sam Raimi work in?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Joywave and Third Dayare both what?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "What major local business located in the city of Masan was established in 1933?",
        "response": "Hite Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of George J. Gruen emigrated to the United States during what decade?",
        "response": "1860s",
        "source": "hotpot_qa"
    },
    {
        "query": "Daryl Morey's philosophy on Basketball was dubbed \"Moreyball\" after what book by Michael Lewis?",
        "response": "The Art of Winning an Unfair Game",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Into Temptation\" is a song that was created by a band which formed in what city?",
        "response": "Melbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Russian city is the studio which employs Konstantin Eduardovich Bronzit?",
        "response": "Saint Petersburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has appeared in more films, Jon Paul Puno or Vincent Ward?",
        "response": "Jon Paul Puno",
        "source": "hotpot_qa"
    },
    {
        "query": "Stacey Guerin represents a portion of the Maine county with a population of what figure as of 2010?",
        "response": "153,923",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Trevor McNevan and Leslie West both citizens on the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is Sailing He's university located in?",
        "response": "Sweden",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the movie that starred a British-American actor and singer in the 1979 release?",
        "response": "Tobe Hooper",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the father of George V of Hanover born?",
        "response": "1771",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the highest-charting single of the American country music group formed in Paw Paw, West Virginia that covered \"I'm Gonna to Be a Wheel Someday\" ?",
        "response": "\"The Letter That Johnny Walker Read\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ski and snowboard resort has its base 3,441 meters to the north of the highest mountain in both the Spring Mountains and Clark County, Nevada?",
        "response": "Lee Canyon",
        "source": "hotpot_qa"
    },
    {
        "query": "Ulysses in Nighttown starred the actor who played what character in \"Fiddler on the Roof\"?",
        "response": "Tevye",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American Athletic complex was renovated in 1997 and hosted several events during the Goodwill Games the follwing year?",
        "response": "Mitchel Athletic Complex",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this fourth studio album by an English rock band, released in May 1969, whose lyrics were adapted from Sonny Williamson's lyrics?",
        "response": "Tommy",
        "source": "hotpot_qa"
    },
    {
        "query": "Bari Lurie serves as chief of staff to a woman that was a special correspondent for what news station from 2011 to 2014?",
        "response": "NBC News",
        "source": "hotpot_qa"
    },
    {
        "query": "The city where Shahid Sachindra Paul Road is in is the headquarters of what district?",
        "response": "Cachar",
        "source": "hotpot_qa"
    },
    {
        "query": "Be Yourself Tonight is the fifth album by a group formed in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What network did the America drama television series, which the owner of Spitfire Studio was involved in, air on?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was casual friday adopted?",
        "response": "Western countries",
        "source": "hotpot_qa"
    },
    {
        "query": "Which publication was published first The Artist's Magazine or Details ? ",
        "response": "Details",
        "source": "hotpot_qa"
    },
    {
        "query": "WLMW is licensed to a city in which county?",
        "response": "located in Hillsborough County",
        "source": "hotpot_qa"
    },
    {
        "query": "An Cat Dubh / Into the Heart is a song from the U2 album released on what date?",
        "response": "20 October 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the closing date of the casino located next the \"World's Largest Gift Shop\" and owned by the Stockbridge Real Estate?",
        "response": "Q3 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What Small native cat to North and South America did Carl B. Koford make studies on in the 50's and 70's?",
        "response": "Jaguarundi",
        "source": "hotpot_qa"
    },
    {
        "query": "At what facility did a prison riot occur in response to the death of the man charged with the murder of John Vincent Mills?",
        "response": "Attica Correctional Facility",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a prolific and influential composer of the Classical era; Pietro Mascagni or Wolfgang Amadeus Mozart?",
        "response": "Wolfgang Amadeus Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "In what political party is Lady Dorothy Macmillan's husband?",
        "response": "Conservative Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Christopher \"Chris\" Fairbank provided voice talent for which 2006 British-American computer-animated action-adventure comedy film directed by David Bowers and Sam Fell?",
        "response": "Flushed Away",
        "source": "hotpot_qa"
    },
    {
        "query": "Which noted film director and producer was involved in the production of the medical drama House?",
        "response": "Bryan Singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the movement that August Brancart published literature from centerd?",
        "response": "Western Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "Mis Romances was a studio album by the singer who is often referred to with what nickname?",
        "response": "El Sol de México",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coaches the University team for which Morenike Atunrase played",
        "response": "Gary Blair",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American television, film, and stage actress born who joins cast of Season 3 of Being Human series as the witch Donna who is responsible for bringing back Sally?",
        "response": "March 20, 1957",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the terrorist hostage-rescue mission took place based on which Raid on Entebbe was made?",
        "response": "4 July 1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Scamp is a Disney canine cartoon and comics character, the son of Lady and the Tramp from the movie \"Lady and the Tramp\", which was released in what year?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "The driver know for doing backflips off his car lost to which driver in the 2009 NASCAR Nationwide Series?",
        "response": "Kyle Busch",
        "source": "hotpot_qa"
    },
    {
        "query": "What Memphis Grizzlies player was picked 38th in 2011 by Houston?",
        "response": "Chandler Parsons",
        "source": "hotpot_qa"
    },
    {
        "query": " The 1983 Masters Tournament was held at a golf club founded by what two men?",
        "response": "Bobby Jones and Clifford Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of the tv film \"The Comrades of Summer\" got his first credit as an art director on what film?",
        "response": "\"Dark Star\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Evil is an American horror film, released in which year, and directed by Gus Trikonis and includes Victor Charles Buono, an American actor and comic and briefly a recording artist?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the role-playing game that featured a version of the Phoenix Command system released?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is from the west coast, Edward Sharpe and the Magnetic Zeros or Jack Off Jill?",
        "response": "Edward Sharpe and the Magnetic Zeros",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the singles in Tim McGraw's Two Lanes of Freedom album features Taylor Swift on vocals and Keith Urban on guitar?",
        "response": "Highway Don't Care",
        "source": "hotpot_qa"
    },
    {
        "query": "Who received more nominations for the Academy Award Oscar, Stephen Frears or Mario Monicelli?",
        "response": "Mario Monicelli",
        "source": "hotpot_qa"
    },
    {
        "query": "In which format, introduced in 1948, was the album Showcase released in?",
        "response": "LP record",
        "source": "hotpot_qa"
    },
    {
        "query": "Beauty for the Asking starred what American actress who was best known as the star of I Love Lucy?",
        "response": "Lucille Désirée Ball",
        "source": "hotpot_qa"
    },
    {
        "query": "What vessel was first flown around the world by the man who owned the catamaran \"Cheyenne\"?",
        "response": "balloon",
        "source": "hotpot_qa"
    },
    {
        "query": "Philip Despencer's brother was a favorite of which king who was deposed in January of 1327?",
        "response": "King Edward II",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a member of the group Sistar, Alex Kapranos or Hyolyn?",
        "response": "Hyolyn",
        "source": "hotpot_qa"
    },
    {
        "query": "Bhikkhu Cintita was born in what city known as the cultural, commercial, and financial center of Northern California?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Australian hard rock band that covered Kate Bush's debut single?",
        "response": "Wolfmother",
        "source": "hotpot_qa"
    },
    {
        "query": "Hampton Beach is home what top 100 worldwide club venue?",
        "response": "Hampton Beach Casino Ballroom",
        "source": "hotpot_qa"
    },
    {
        "query": "What genres of music was Mose Allison, famous for his album \"The Word from Mose,\" know for?",
        "response": "blues and modern jazz",
        "source": "hotpot_qa"
    },
    {
        "query": "The world premiere of the movie starring a co-founder of United Artists film studio was shown at a theatre in what city?",
        "response": "Ottawa",
        "source": "hotpot_qa"
    },
    {
        "query": "Bally's & Paris station is on the monorail that is of what length?",
        "response": "3.9 mi",
        "source": "hotpot_qa"
    },
    {
        "query": " \"I Miss You\" a song from an album that was released in the United Sates by what record label?",
        "response": "Elektra Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Walt Disney film premiered first, Secretariat or The One and Only, Genuine, Original Family Band?",
        "response": "The One and Only, Genuine, Original Family Band",
        "source": "hotpot_qa"
    },
    {
        "query": "Wild Horses included the bassist who was known for a long stint in what other band?",
        "response": "Dokken",
        "source": "hotpot_qa"
    },
    {
        "query": "Sam Liu is a director who has worked with Marvel Entertainment, what company owns Marvel Entertainment?",
        "response": "The Walt Disney Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Among Jimi Hendrix and Preston who officially reunited The Ordinary Boys and in 2015?",
        "response": "Samuel Dylan Murray Preston",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coached the future Indianapolis Colts 2014 NFL Draft third round draft pick while the wide receiver played at the University of Mississippi? ",
        "response": "Hugh Freeze",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county is the Maine School Administrative District 6 located?",
        "response": "York County",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Lincoln Patterson served during World War I in a branch of the Armed Forces that dates its institutional inception to what year?",
        "response": "1775",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor born in 1987 stared in a film with Adam Scott, Brittany Snow, and J.K. Simmons?",
        "response": "Alexander Richard \"Alex\" Frost",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was in a band that worked with Alan Edwards?",
        "response": "John Entwistle",
        "source": "hotpot_qa"
    },
    {
        "query": "Minken Fosheim had success writing books for children about which Norwegian Composer ?",
        "response": "Grieg",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Promociones Gutiérrez\" 1st Anniversary Show, was a professional wrestling supercard event promoted by which organization, the focal point of the event was a \"Ruleta de la Muerte\",Spanish for Roulette of Death, Roulette is a casino game named after the French word meaning \"little wheel\"?",
        "response": "Consejo Mundial de Lucha Libre",
        "source": "hotpot_qa"
    },
    {
        "query": "Two years after the Coupe de France Final where Olympique de Marseille defeats AS Monaco, what honor did the man with the most goals that match receive?",
        "response": "European Footballer of the Year",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie, starring Simon Pegg and Nick Frost, did Gregory J. \"Greg\" Mottola produce?",
        "response": "Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more species, Pitcher plant or Iresine?",
        "response": "Iresine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Extreme Centre: A Warning was a book by the activist who studied at which college?",
        "response": "Exeter College",
        "source": "hotpot_qa"
    },
    {
        "query": "Hanjin Group chairman Cho Yangho founded what airline alliance in June 2000 that consists of 20 carriers from five continents?",
        "response": "SkyTeam",
        "source": "hotpot_qa"
    },
    {
        "query": "Gerardo Lopez was once the CEO of a company that has the largest share of the American theater market; what company is it?",
        "response": "AMC Entertainment Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played Dick in the television adaptation of the series of children's adventure novels written by English author Enid Blyton?",
        "response": "Paul Child",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do Jay T. Wright and Aaron Kozak have in common?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Marvel Comic adversary of the X-Men, has a son named Shinobi Shaw?",
        "response": "Sebastian Shaw",
        "source": "hotpot_qa"
    },
    {
        "query": "VA-873 is based at a Naval Air Station located next to what body of water?",
        "response": "San Francisco Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Mimosa and Whisky Mac are both what?",
        "response": "cocktail",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owned the record company during which time Ritchie Valens sung the song most notably covered by Los Lobos?",
        "response": "Bob Keane",
        "source": "hotpot_qa"
    },
    {
        "query": "Were John Wain and Ödön von Horváth both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Stromanthe and Salvia in different plant families",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What college founded in 1881 did Keith Rasmussen work for?",
        "response": "Bethany College",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the debut novel by Indian writer Arundhati Roy set?",
        "response": "Aymanam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these is a nature documentary, The Living Desert or Brother Bear?",
        "response": "The Living Desert",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the lab located in Moscow, Russia that Alisa Shevchenko worked at after she dropped out of college?",
        "response": "Kaspersky Lab",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band's sixth studio album features both the only return appearance of Robbie Williams as well as the final appearance of Jason Orange?",
        "response": "Take That",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the  \"I'm Alan Partridge\" writers was born in 1963?",
        "response": "Armando Iannucci",
        "source": "hotpot_qa"
    },
    {
        "query": "What part of Oklahoma does the 2nd congressional district, represented by  MarkWayne Mullin, include?",
        "response": "eastern part of the state outside of Tulsa",
        "source": "hotpot_qa"
    },
    {
        "query": "Are plants belonging to the genus Astragalus and the genus Malva both native to temperate regions?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professor of evolutionary anthropology at Duke University is the director of the Jane Goodall Institute, founded by Jane Goodall the British primatologist?",
        "response": "Anne Elizabeth Pusey",
        "source": "hotpot_qa"
    },
    {
        "query": "Abe Carver has been played by the American actor who debuted it since what year?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played a role in both Half Moon Street and Ghostbusters?",
        "response": "Sigourney Weaver",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 18th President of the United States was present at the Battle of Young's Point?",
        "response": "Ulysses S. Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wanderpreis Cup was contested by the football club that plays in what league?",
        "response": "Campeonato Brasileiro Série A",
        "source": "hotpot_qa"
    },
    {
        "query": "Agnieszka Lal started working at what American mass media company in 2008?",
        "response": "Viacom Media Networks",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the decisive for Crassus's disastrous defeat in the most crushing defeats in Roman history ?",
        "response": "mounted archers",
        "source": "hotpot_qa"
    },
    {
        "query": "What do United States v. Nixon and Lone Wolf v. Hitchcock have in common?",
        "response": "Supreme Court case",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the largest subaerial volcano in the Hawaiian - Emperor seamount chain?",
        "response": "Mauna Loa",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the husband of the woman who had a biography written by Erika Rosenberg?",
        "response": "Oskar Schindler",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the wife of Holy Roman Emperor which  German royal election, 1002 held after his death ",
        "response": "Theophanu.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor and musician, born 16 May 1990, was in which 2014 American dystopian science fiction action thriller film?",
        "response": "Thomas Brodie-Sangster",
        "source": "hotpot_qa"
    },
    {
        "query": "What episode of \"The Simpsons\" did the co-creator of the animated series \"The Critic\" write first",
        "response": "Kamp Krusty",
        "source": "hotpot_qa"
    },
    {
        "query": "What was need in order to diverge from the chinese ritual uniting spouses by pre-arrangement between families?",
        "response": "constant support from propaganda campaigns",
        "source": "hotpot_qa"
    },
    {
        "query": "Arena is a documentary series that has aired a show chronicling which Canadian filmmaker?",
        "response": "Mary Harron",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Kurt Cobain and Glenn Frey work in the music industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "At what stadium did Mychal George Thompson play home games with the San Antonio Spurs?",
        "response": "AT&T Center in San Antonio",
        "source": "hotpot_qa"
    },
    {
        "query": "Neil Hudson won what premier motocross championship in 1981?",
        "response": "Motocross World Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession, Mark Salzman or Gabriel García Márquez?",
        "response": "Gabriel José de la",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the fort commanded by George Armistead during the Battle of Baltimore first built?",
        "response": "1798",
        "source": "hotpot_qa"
    },
    {
        "query": "The University in Pullman, Washington is named after whom?",
        "response": "Edward R. Murrow",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer song writer born on December 13, 1989 wears jewelry from Porter Lyons?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is a chess variant, Ubongo or Ouk-Khmer?",
        "response": "Ouk-Khmer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Procuratie are historic buildings the last of them completed under the occupation of a political leader who rose to prominence during which revolution?",
        "response": "French Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of fils are the Blue Vinyl and Girl 27?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the composer of The Fairy-Queen from?",
        "response": "an English composer.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are TEC-1 and Dubna 48K are based on the same processor?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The western border of Rankin County is formed by a river that flows through which US states ?",
        "response": "Mississippi and Louisiana",
        "source": "hotpot_qa"
    },
    {
        "query": "What other  movie  did Ezra Miller star in,  in 2015.",
        "response": "the comedy \"Trainwreck",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Minnesota county was Jeff Nielsen born?",
        "response": "Itasca County",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of category does Hohenbergiopsis and Zamioculcas have in common?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the British TV show that featured an English actor, singer, and model, released?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Who constructed and operated Basin F at the Rocky Mountain Arsenal through late 20th century?",
        "response": "United States Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Young-kwang, is a South Korean actor and model, as an actor, Kim has starred in which 2012 South Korean action comedy film, starring Kang Ji-hwan and Sung Yu-ri and directed by Shin Tae-ra?",
        "response": "Runway Cop",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Ray Wilson and Nick Carter, who has released more solo albums?",
        "response": "Nick Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who passed away first Richard Strauss or Béla Bartók ?",
        "response": "Béla Viktor János Bartók",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published in 16 different languages: Mothering or Burda Style?",
        "response": "Burda Style",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the owner of Straight Blast Gym Ireland's birthday?",
        "response": "January 18, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Uncle Maddio's Pizza Joint and Gino's East both serve pizza, salads and sandwiches, but which one includes soups on their menu?",
        "response": "Gino's East",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the actress who starred in the loose sequel to the film \"An American Werewolf in London\" study filmmaking?",
        "response": "Tisch School of the Arts",
        "source": "hotpot_qa"
    },
    {
        "query": "What American director, born Joseph McGinty Nichol, directed the pilot episode of \"Chuck\"?",
        "response": "McG",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lawson and Minutemen from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Frederick and Louis Upton founded what American multinational manufacturer and marketer of home appliances, headquartered in Benton Charter Township, Michigan, United States, near Benton Harbor, Michigan?",
        "response": "Whirlpool Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Al Jolson who stared in a 1927 \"talkie\" was once dubbed what?",
        "response": "\"The World's Greatest Entertainer.\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which video game did Alexey Pajitnov design that was the inspiration for the game WildSnake?",
        "response": "Tetris",
        "source": "hotpot_qa"
    },
    {
        "query": "The Smith and Wesson Model 22 series is a refined commercial version of a U.S. six-shot revolver of .45 ACP caliber adopted by the U.S. Army in 1917 durring what war?",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Ayodele Casal was an American tap dancer and choreographer, she was the only woman to be member of who's Not Your Ordinary Tappers?",
        "response": "Savion Glover",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is known for its forage and dairy industries, Yumen City or Anda, Heilongjiang?",
        "response": "Anda",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal, the Conewago Canal or the Orleans Canal is longer ?",
        "response": "The Orleans Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in the 1966 film that Beatrice Welles is known for acting in as a child?",
        "response": "Orson Welles",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did the man who beat John Williams in the 1823 Senate election die?",
        "response": "June 8, 1845",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the television series in which Madison Wolfe made her television debut ?",
        "response": "Nic Pizzolatto",
        "source": "hotpot_qa"
    },
    {
        "query": "A Taste for Killing marked the debut role for an American actress and producer  named Hasty Pudding's Woman of the Year in what year?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did John Stevenson, or better known by his screen name Steve Brodie, star in the film Desperate?",
        "response": "1947",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the studio album by the British musician around whose vocals \"Swagga Like Us\" was constructed?",
        "response": "\"Kala\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The 16th annual Webby Awards was hosted by an American actor known for role as Spencer Olchin on what sitcom?",
        "response": "The King of Queens",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the man who derived the Einstein–Rosen metric with Albert Einstein?",
        "response": "American-Israeli",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is from farther South, The Spinone Italiano or the Whippet?",
        "response": "The Spinone Italiano",
        "source": "hotpot_qa"
    },
    {
        "query": "Limahl and Justin Pierre, share which mutual occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "What country are both Tánaiste and Frances Fitzgerald from?",
        "response": "Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the French motor racing circuit located in central France, near the towns of Magny-Cours and Nevers, and which hosted the 1994 French Grand Prix, a 72-lap race which was the seventh round of the Formula One Season?",
        "response": "Circuit de Nevers Magny-Cours",
        "source": "hotpot_qa"
    },
    {
        "query": "Wind Cave bison herd are of which subspecies of the Americaon bison?",
        "response": "Plains bison",
        "source": "hotpot_qa"
    },
    {
        "query": " Rand is a small village and civil parish in the West Lindsey district of Lincolnshire, England and Wragby is a small town and civil parish located where?",
        "response": "East Lindsey",
        "source": "hotpot_qa"
    },
    {
        "query": "The song All Lies by hip hop artist Charlie Baltimore features which rapper on the final recording?",
        "response": "Maino",
        "source": "hotpot_qa"
    },
    {
        "query": "Crazy Love and Give Us Our Skeletons are from what film genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-directed the eight-episode Danish television mini-series that the American paranormal hospital drama, All Souls, was based on?",
        "response": "Lars von Trier and Morten Arnfred",
        "source": "hotpot_qa"
    },
    {
        "query": "Gilbert F. Casellas is a director of a financial firm that operates in how many other countries outside the US?",
        "response": "over 30",
        "source": "hotpot_qa"
    },
    {
        "query": "What American biochemist wrote an essay for Grand Canyon: A Different View?",
        "response": "Duane Gish",
        "source": "hotpot_qa"
    },
    {
        "query": "What band is based in Los Angeles, California, Youngblood Hawke or Starset?",
        "response": "Youngblood Hawke",
        "source": "hotpot_qa"
    },
    {
        "query": "Southrey is a village in the civil parish of which village in the West Lindsey district of Lincolnshire, England?",
        "response": "Bardney",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the college from which Page Hopkins graduated founded?",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "The Last Flight of Noah's Ark and Dumbo, have which mutual genre?",
        "response": "adventure",
        "source": "hotpot_qa"
    },
    {
        "query": "In the screenplay Sweethearts, Victor Herbert's play was was used. What type of performance was this?",
        "response": "“play within a play”",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was Mark Knopfler in before releasing th Princess Bride soundtrack?",
        "response": "Dire Straits",
        "source": "hotpot_qa"
    },
    {
        "query": "The real-life version of the song by Jim Croce was a professional what?",
        "response": "wrestler",
        "source": "hotpot_qa"
    },
    {
        "query": "What husband and wife country music and pop songwriting team were well known for a song associated with the Tennessee Volunteers of the University of Tennessee (UT)?",
        "response": "Felice and Boudleaux Bryant",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheshire Phoenix, who last contracted Devan Bailey, was founded in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which district of Lancashire, England contains the village that lies between Langho and a village that is on the banks of the River Calder?",
        "response": "Ribble Valley district",
        "source": "hotpot_qa"
    },
    {
        "query": "Who illustrated the American espionage comic book which is well known for its creater who is also known for his portrayal of a teen pop star in the Disney Channel Original Movie \"Stuck in the Surburbs\"?",
        "response": "Kevin Sharpe",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of University are both Wayne State University located in Detroit, Michigan and the University of Alabama in Tuscaloosa?",
        "response": "public research university",
        "source": "hotpot_qa"
    },
    {
        "query": "Dan in Real Life stars a British-American actor who also played what character on \"Frasier\"?",
        "response": "Martin Crane",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coined the term Terminological inexactitude and  led the Conservative Party for fifteen years from 1940 to 1955.",
        "response": "Winston Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of energy does a plasma weapon produce?",
        "response": "electromagnetic field",
        "source": "hotpot_qa"
    },
    {
        "query": "Bugatti Gangloff is a virtual concept car, the concept takes many cues from the which mid-engined sports car, designed and developed in Germany by the Volkswagen Group and manufactured in Molsheim, France, by Bugatti Automobiles S.A.S., named after the racing driver Pierre Veyron?",
        "response": "Bugatti Veyron",
        "source": "hotpot_qa"
    },
    {
        "query": "What crime did Frederick John Fulton's most notorious convicted criminal commit?",
        "response": "stagecoach robbery",
        "source": "hotpot_qa"
    },
    {
        "query": "The university that Tramaine Brock attended is in which state?",
        "response": "Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the band who made My Mind from?",
        "response": "Wasilla, Alaska",
        "source": "hotpot_qa"
    },
    {
        "query": "Erling Christian Foss was a Danish civil engineer, famous for his contributions to the underground insurgency to resist which nation's occupation of Denmark?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Jon Rudkin is currently Director of Football for a football club based at what stadium?",
        "response": "King Power Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the company that Saturday Primetime presented by DirecTV appears on?",
        "response": "Bill Rasmussen along with his brother Scott and Ed Egan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American rapper from Atlanta, Georgia born who's song is \"Sneakin'\"?",
        "response": "October 22, 1992",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the Miss Universe pageant that Miss Ecuador 1969 competed in?",
        "response": "Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current governor of the state whose 10th territorial governor was one of its first senators?",
        "response": "David Ige",
        "source": "hotpot_qa"
    },
    {
        "query": "Prior to 1997, what was the name of the League in which The Basin Football Club affiliated in Division 3?",
        "response": "Eastern Districts Football League",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won a Grand Slam singles title first, Thomas Muster or Goran Ivanišević?",
        "response": "Thomas Muster",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of \"Fingerprints\" was born in Denver, Colorado?",
        "response": "Kristin Cavallari",
        "source": "hotpot_qa"
    },
    {
        "query": "the book Hidden Figures: The American Dream and the Untold Story of the Black Women Who Helped Win the Space Race follows the lives of which African american mathematician born in 1910 ?",
        "response": "Dorothy Vaughan",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of industry does Patty Jenkins and Derek Yee and have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the wrestling magazine headquartered that, in 2012 featured Del Rey on its list of top 500 wrestlers in the world?",
        "response": "Blue Bell, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2009 British-American war parody comedy film starring the actor who won an Academy Award for Best Actor for midlife crisis-themed drama \"American Beauty\"?",
        "response": "Grant Heslov",
        "source": "hotpot_qa"
    },
    {
        "query": "The union Eric of Pomerania was king of joined how many kingdoms under a single monarch?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the NBA's process of jumping directly from high school to the professional level which was adopted in 2006?",
        "response": "prep-to-pro",
        "source": "hotpot_qa"
    },
    {
        "query": "What private research university in California is Anne Howland Ehrlich is the associate director of the Center for Conservation Biology?",
        "response": "Stanford University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Romanian former football striker who scored 4 goals in the 1994 World Cup also played for AS Monaco?",
        "response": "Florin Răducioiu",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization founded by Albus Dumbledore did Snape become a double agent for in the series \"Harry Potter\"?",
        "response": "Order of the Phoenix",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the game which  High Rollers Casino is a type been played ",
        "response": "outside of casinos",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the book that was released in 1959 that was a follow up to another book sharing the same character?",
        "response": "Giant Eagle",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Dick Crealy and Jack Sock play the same sport?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bernard Malamud and Harry Turtledove both American novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What English writer starred in Attracta?",
        "response": "Wendy Hiller",
        "source": "hotpot_qa"
    },
    {
        "query": "Tettigoniidae belongs to which phylum?",
        "response": "arthropod phylum",
        "source": "hotpot_qa"
    },
    {
        "query": "what city and state are both Lakewood church and Joel Osteen located in?",
        "response": "Houston, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Merely Mary Ann starred Janet Gaynor, recipient of the first Academy Award for Best Actress, which is awarded to honor what?",
        "response": "an actress who has delivered an outstanding performance in a leading role while working within the film industry",
        "source": "hotpot_qa"
    },
    {
        "query": "An actor on Time's list of 100 most influencial poeple stared in a movie directed by who? ",
        "response": "James Gunn",
        "source": "hotpot_qa"
    },
    {
        "query": "Hong Kong Human Rights and Democracy Act is proposed by Chris Smith, who is the chairman of Congressional-Executive Commission on China, Christopher Henry Smith (born March 4, 1953) is the U.S. Representative for New Jersey 's 4 congressional district , serving since which year?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2000 Southwest Georgia tornado outbreak caused extensive damage to neighborhoods of which city in George that had about 5000 population as of 2010?",
        "response": "Camilla",
        "source": "hotpot_qa"
    },
    {
        "query": "Randolph \"Randall\" or \"Ole Ran'l\" McCoy was involved in what war between two rural families of the West Virginia–Kentucky area?",
        "response": "The Hatfield–McCoy feud",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2001 film that won Russell Crowe multiple awards for his portrayal of the mathematician John Forbes Nash Jr?",
        "response": "A Beautiful Mind",
        "source": "hotpot_qa"
    },
    {
        "query": "De Dietrich Remeha, is one of Europe's biggest manufacturers and distributors of domestic and commercial water and space heating systems, in July 2009, when heavily laden with debt, which of Europe's largest manufacturers and distributors of domestic and commercial water and space heating systems, agreed to merge with them? ",
        "response": "Baxi",
        "source": "hotpot_qa"
    },
    {
        "query": "When was trhe Maxican actress born who wasa star during the 1940s and 1950s with Pedro Armendáriz and one of the most beautiful faces of the cinema in her time?",
        "response": "August 3, 1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Christmas Day in the Morning, is the first of several Christmas albums by the folk singer Burl Ives, this album includes \"Jesous Ahatonia\" is better known as which name, a Canadian Christmas hymn (Canada's oldest Christmas song), written probably in 1642 by Jean de Brébeuf, a Jesuit missionary at Sainte-Marie among the Hurons in Canada?",
        "response": "Huron Carol",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monster Beverage and Gilead Sciences both American companies?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played both in the films Encino Man and See Girl Run? Robin Tunney",
        "response": "Robin Tunney",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1991 NCAA Men's Volleyball Tournament was the 22nd annual tournament to determine the national champion of NCAA men's collegiate volleyball, the tournament was played in Honolulu, during May of 1991, at the Neal S. Blaisdell Center, a community center for the City & County of Honolulu, near downtown Honolulu in which state?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Cooper MacNeil is a racing driver who operates a car under the high performance division of what company?",
        "response": "Mercedes-Benz",
        "source": "hotpot_qa"
    },
    {
        "query": "What rollercoaster, next to Drachen Fire, was opened in 1984?",
        "response": "Big Bad Wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "The birth city of Kunto Ojansivu is the administrative capital of what province?",
        "response": "Lapland",
        "source": "hotpot_qa"
    },
    {
        "query": "What book is the seventh and final novel of the series about a young wizard that attends Hogwarts School of Witchcraft?",
        "response": "Harry Potter and the Deathly Hallows",
        "source": "hotpot_qa"
    },
    {
        "query": "Adolfo Diaz negotiated with Germany and Japan to resurrect what planned shipping route through Nicaragua to connect the Caribbean Sea (and therefore the Atlantic Ocean) with the Pacific Ocean?",
        "response": "Nicaragua Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "What series did Tom Mandrake collaborate on that was based on a fictional superhero?",
        "response": "Martian Manhunter",
        "source": "hotpot_qa"
    },
    {
        "query": "What location is common to Knýtlinga saga and Cnut the Great?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the only reigning Scottish Queen?",
        "response": "King Alexander III",
        "source": "hotpot_qa"
    },
    {
        "query": "Coe-Brown Northwood Academy has agreements for students in which town with a population of 4,785 as of 2010?",
        "response": "Nottingham",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the presenter of Copa Movistar which is one of the latgest surfing company in Australia? ",
        "response": "Rip Curl",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Great Pyrenees and Terceira Mastiff both dog breeds?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show that influenced the one which Samanta Tina participated in?",
        "response": "John de Mol",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of the singer that wrote all lyrics for the album \"The Wonder Show of the World\"?",
        "response": "Bonnie 'Prince' Billy",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Codiaeum and Quesnelia native to the same geographical area?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band whose co-founder was later a keyboardist for the Beach Boys, had a song which reached #13 on the \"Billboard\" Hot 100?",
        "response": "King Harvest",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Mark Methodist Church is one of the few remaining Gothic Revival granite churches in Atlanta, Georgia, the architecture is notable for its use of which quartz monzonite dome monadnock and the site of Stone Mountain Park in Stone Mountain, Georgia?",
        "response": "Stone Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Nick Pollotta, was an American author, he is best known for his humorous novels, including which science-fiction novel, with Phil Foglio, an American cartoonist and comic book artist best known for his humorous science fiction and fantasy art?",
        "response": "Illegal Aliens",
        "source": "hotpot_qa"
    },
    {
        "query": "Disappearance of Renee MacRae, Britain's longest running missing persons case, is as notorious as the murder cases of this serial killer involved with how many people? ",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the formation of the Finnish metal band that wrote the song \"I'm Not Jesus\"",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "which company deals with the highest number of Natural Resources Pioneer Natural Resources or TransDigm Group:",
        "response": "Pioneer Natural Resources",
        "source": "hotpot_qa"
    },
    {
        "query": "What political party does the National Football League Players Association engage with through their membership with the AFL-CIO?",
        "response": "Democrats",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a member of more bands, Geoff Rickly or Denis Bélanger?",
        "response": "Geoffrey William \"Geoff\" Rickly",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Daniel Mann and Todd Solondz both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What late model stock car automobile race did Wayne Anderson win in 2001?",
        "response": "The Snowball Derby",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the the German composer whose compositions are in The Individualism of Gil Evans die?",
        "response": "1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Which unitary authority area in Yorkshire houses the RAF North Killingholme just west of it?",
        "response": "North Lincolnshire",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chengdu J-20 is what type of aircraft that is designed to avoid detection, and whose technology likely began in Germany during World War II?",
        "response": "Stealth aircraft",
        "source": "hotpot_qa"
    },
    {
        "query": "Billy Montana was born in a village within the town of New Scotland, in what county in New York?",
        "response": "Albany County",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the English actor, comedian, screenwriter, and producer who starred in a 2016 American fantasy adventure film based on the characters created by Lewis Carroll born?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of Whistl's competitors was originally known as the Home Delivery Network?",
        "response": "Yodel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hatchback small family car will be the car of the category during the 2011 Super Copa Telcel?",
        "response": "SEAT León",
        "source": "hotpot_qa"
    },
    {
        "query": "who voiced the  cartoon character in the animated television series which , Pablo Aurrecochea wears kits adorned with its cartoon characters",
        "response": "Dan Castellaneta",
        "source": "hotpot_qa"
    },
    {
        "query": "Where crushed limestone trail trail  follow the Chicago, Rock Island and Pacific Railroad, also known as Rock Island Line or The Rock?",
        "response": "The Hoover Nature Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "What astronomer and nobleman is associated with Uraniborg?",
        "response": "Tycho Brahe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did Charles Leavitt write that had Leonardo DiCaprio, Jennifer Connelly and Djimon Hounsou as part of the cast?",
        "response": "Blood Diamond",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2000 ICC KnockOut Trophy was the debut of a Jamaican cricketer who is a right-handed what?",
        "response": "middle order batsman",
        "source": "hotpot_qa"
    },
    {
        "query": "Il promo d'oro marked the wedding between Leopold I and what relation of Kind Philip IV?",
        "response": "Daughter",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the corporate sponsor of the Melbourne Park Multi-Purpose Venue based? ",
        "response": "Qingdao, Shandong province, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Earnest Lee Ross Jr., is an American-Guamanian professional basketball player for the Super City Rangers of which organization, he played college basketball for the University of Missouri, the Missouri Tigers men's basketball team?",
        "response": "New Zealand National Basketball League (NZNBL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hotel, the Palms Casino Resort or Gold Coast Hotel and Casino, has a recording studio and is located near the Rio All Suite Hotel and Casino?",
        "response": "Palms Casino Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the only manufacturers of immersion lithography systems is a Dutch company that is a component of what stock market index?",
        "response": "Euro Stoxx 50",
        "source": "hotpot_qa"
    },
    {
        "query": "Keala Settle's Tony-nominated musical was commissioned by what playhouse?",
        "response": "La Jolla Playhouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Maurice Ravel and Ambroise Thomas French composers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Mental Floss paragraph related to the Dr. Dobb's Journal paragraph? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Superchunk and Our Lady Peace, these groups have what mutual characteristics?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Psilotum or Austrocylindropuntia?",
        "response": "Austrocylindropuntia",
        "source": "hotpot_qa"
    },
    {
        "query": "For what television show co-created by Richard Appel featured a pilot episode in which the main character visits his hometown of Stoolbend, Virginia?",
        "response": "\"The Cleveland Show\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What life member of The Actors Studio often portraying military or authority figure roles stared in a film that  was directed by Richard Wilson?",
        "response": "Robert F. Simon",
        "source": "hotpot_qa"
    },
    {
        "query": "The Blond Knight of Germany is a book dedicated to the most successful fighter ace who flew how many combat missions?",
        "response": "1,404",
        "source": "hotpot_qa"
    },
    {
        "query": "The This Is What the Truth Feels Like Tour concluded at an arena that opened in what year?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the most important player of a Dutch professional football club that Bozidar Sencar played 3 years in before his retirement?",
        "response": "Antoon 'Rat' Verlegh",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Fazoli's and Papa John's Pizza based out of Kentucky?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Holland Roden was part of an MTV drama series developed by which producer?",
        "response": "Jeff Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was from Canada and was who The Shape I'm In was about?",
        "response": "Richard Manuel",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote \"This ole House\" the popular song sung by platinum-selling British rock and roll singer Michael Barratt?",
        "response": "Stuart Hamblen",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the sergeant which the M247 is named after win?",
        "response": "Medal of Honor",
        "source": "hotpot_qa"
    },
    {
        "query": "Gunmen from Laredo starred which narrator of \"Frontier\"?",
        "response": "Walter Darwin Coy",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Metropia and McDull, Kung Fu Kindergarten both English language films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which monorail used to begin the monorail that is a 3.9 mile long monorail mass transit system?",
        "response": "Mark IV monorail",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university founded in 1818 is the oldest university west of the Mississippi River: Saint Louis University or Marquette University? ",
        "response": "Saint Louis University",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by American musician Trey Anastasio debuted live on July 24, 2005, at the 10,000 Lakes Festival in Detroit Lakes, a city in the State of Minnesota and the county seat of Becker County?",
        "response": "Shine",
        "source": "hotpot_qa"
    },
    {
        "query": "What stock exchange lists a competitor of Ladbrokes?",
        "response": "London Stock Exchange",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film where Susan May Pratt played Mandella?",
        "response": "Gil Junger",
        "source": "hotpot_qa"
    },
    {
        "query": "Which shopping center is located in the fifth-largest city in the State of Oregon?",
        "response": "Shute Park Plaza",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Fuzhou, Jiangxi and Malipo County located in the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which football club appeared in the 2015 FA Community Shield Cup, as well as, the 2014–15 Premier League championship?",
        "response": "Chelsea",
        "source": "hotpot_qa"
    },
    {
        "query": "A symphony of Three Orchestras was dedicated to someone who died in what year?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the radio station where Scott Allen Miller has recently been the morning drive host and program director ?",
        "response": "Pamal Broadcasting",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the older brother of the man who promoted a beer by a brewing company based in Louisville, Kentucky?",
        "response": "Jimmy",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of the 16th Lumieres Awards tells the tale of nine what?",
        "response": "Trappist monks",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in \"Guardians of the Galaxy\" did the actress that joined Anthony Hopkins in the cast of \"Transformers: The Last Knight\" play?",
        "response": "Meredith Quill",
        "source": "hotpot_qa"
    },
    {
        "query": "What album was released by UMG Recordings and contains the single \"Shades of Cool?\"",
        "response": "Ultraviolence",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the film that the actress who plays Dr. Arizona Robbins on Grey's Anatomy co-stars in?",
        "response": "Valentine",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2001 movie, directed by Stephen Chow, influenced the movie Kung Fu Dunk?",
        "response": "Shaolin Soccer",
        "source": "hotpot_qa"
    },
    {
        "query": "David Thewlis had a performance in the film Macbeth as which father of Malcolm and Donalbain?",
        "response": "King Duncan",
        "source": "hotpot_qa"
    },
    {
        "query": "Rick Mahorn is currently a radio analyst for the team playing its home games at which location?",
        "response": "Little Caesars Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "What formerly known as the American International Building, 60 Wall Tower and originally as the Cities Service Building, 70 Pine Street or 40 Wall Street?",
        "response": "70 Pine Street",
        "source": "hotpot_qa"
    },
    {
        "query": "The music with which Rihanna spent ten weeks at number one at 2007 in British music charts was part of which album? ",
        "response": "Good Girl Gone Bad",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Gerry Sikorski or Rod Grams?",
        "response": "Rodney Dwight \"Rod\" Grams",
        "source": "hotpot_qa"
    },
    {
        "query": "Who carried the Olympic torch the year Dieter Bakeloh finished fourth in the individual large hill event in Innsbruck?",
        "response": "Joseph Rieder",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the class guided missile destroyer named for the female who was a pioneer of computer programming responsible for inventing one of the first compiler related tools?",
        "response": "USS \"Hopper\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What position at a university was held by the coach working with the Texas Longhorns during the 1932–33 season?",
        "response": "athletics director",
        "source": "hotpot_qa"
    },
    {
        "query": "what are T.I. and Sam Martins ethinic background?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who lived longer, Alejandro Jodorowsky or Philip Saville?",
        "response": "Alejandro Jodorowsky Prullansky",
        "source": "hotpot_qa"
    },
    {
        "query": "Stormborn is an episode whose title refers to the character in whose novels?",
        "response": "George R. R. Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Dhaulagiri and Khunyang Chhish high mountains?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who constructed Auburn the Antebellum mansion and was accused of the Manhattan Well Murder?",
        "response": "Levi Weeks",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Nahaolelua served under the reigns of five monarchs: Kamehameha III, Kamehameha V, Lunalilo and Kalākaua, and Kamehameha IV, whose full Hawaiian name was what?",
        "response": "Alekanetero ʻIolani Kalanikualiholiho Maka o ʻIouli Kūnuiākea o Kūkāʻilimoku",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the administrative centre of the island of Svalbard where Fridtjovbreen is located?",
        "response": "Longyearbyen",
        "source": "hotpot_qa"
    },
    {
        "query": "Marilyn: The Untold Story, stars what actor as Marilyn's Russian-American talent agent?",
        "response": "Richard Basehart",
        "source": "hotpot_qa"
    },
    {
        "query": "In which movie in 1983 did this American actor, producer, director, and screenwriter who appeared in \"Glengarry Glen Ross\" (1992) and \"Paris Trout\" (1991) star?",
        "response": "The Right Stuff",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is an American rock band, Jimmy Eat World or Morrissey?",
        "response": "Jimmy Eat World",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Erigeron and Catalpa native to Asia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper to feature on The Documentary 2 is from Carson, Califronia?",
        "response": "Ab-Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "How many national championships are claimed by the team that played the Georgia Tech Yellow Jackets in the 1985 All-American Bowl?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked with a singer-songwriter known for his blend of poetry and alternative hip hop?",
        "response": "Alan Moulder",
        "source": "hotpot_qa"
    },
    {
        "query": "What company produced the 1978 movie based on a book written by a radio playwright and children's book author born in 1900?",
        "response": "Walt Disney Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "Teşvikiye Mosque and Abdi İpekçi Arena, are both located in which city, in Turkey?",
        "response": "Istanbul",
        "source": "hotpot_qa"
    },
    {
        "query": "What sort of art did Herbert Abrams complete using the Chief of Staff of the United States Army from 1968 to 1972 as a subjecy?",
        "response": "portrait",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital has been operating longer, Providence Hospital or MedStar National Rehabilitation Hospital? ",
        "response": "Providence Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "Muse - is the first studio album of who, the authors of the songs in the album are very well known poets and composers, including Vladimir Shainsky?",
        "response": "Valery Leontiev",
        "source": "hotpot_qa"
    },
    {
        "query": "To satisfy what dynasty, did the Duchy of Pomerania get partitioned several times who was later granted as a whole and the Principality of Rügen as a fief to the dukes of both Pomerania-Stettin and Pomerania-Wolgast, by a King of Bohemia and the first King of Bohemia to also become Holy Roman Emperor?",
        "response": "House of Pomerania dynasty",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was George Sellars fatally wounded at the Battle of Messines in West Flanders, Belgium?",
        "response": "1917",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the politician who represented the electoral district in Sydney's West resign from his political party?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Labour party politician who participated in Tower Block of Commons  Chair of?",
        "response": "Labour Euro-Safeguards Campaign",
        "source": "hotpot_qa"
    },
    {
        "query": "Matthias Sention Sr. was a founding settler of a historic neighborhood founded by Puritans who emigrated in what year?",
        "response": "1630",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 film Jessica Paré was in?",
        "response": "Steve Pink",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Bengali Indian music director provided assistance in the composition of music to the film Karodpati?",
        "response": "Pankaj Mullick",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the slogan of Magic Circle Music's founder Joey DeMaio's band?",
        "response": "Death to false metal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a group of food stores, Lam Research or Darden Restaurants?",
        "response": "Darden Restaurants",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the off-kilter cover for which  The Raincoats album is best known? ",
        "response": "Ray Davies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Centre did the author of \"The Strange Death of Europe\" found?",
        "response": "Centre for Social Cohesion",
        "source": "hotpot_qa"
    },
    {
        "query": "What silent film adapted from the novel \"The Clamsman\" did Elmer Clifton appear in?",
        "response": "The Birth of a Nation",
        "source": "hotpot_qa"
    },
    {
        "query": "Ammo is an American record producer that produced songs by an American pop rock band featuring what lead singer?",
        "response": "Adam Levine",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the book published that first talks about biopower?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, Jay Gordon or Darren Hayes, is best known as the lead singer and original member of the alternative metal and electropunk band Orgy?",
        "response": "Jay Gordon",
        "source": "hotpot_qa"
    },
    {
        "query": "Berthold Louis Ullman died in a country that is approximately how many acres?",
        "response": "110",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this drag queen character of the host of Outtake TV?",
        "response": "Lily Savage",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is located 20 km south of Marano sul Panaro and on the south side of the Po Valley?",
        "response": "Modena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of tree, Dracaena or Cypripedium?",
        "response": "Dracaena",
        "source": "hotpot_qa"
    },
    {
        "query": "Marlon King was a striker and stop scorer for Watford which played in what league?",
        "response": "Premier League",
        "source": "hotpot_qa"
    },
    {
        "query": "Homer & Langley is a novel by American author E. L. Doctorow, an American novelist, editor, and professor, best known internationally for his works of historical fiction, published when?",
        "response": "September 2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song written by the American musical duo, The Weather Girls, sold over 6 million copies worldwide?",
        "response": "\"It's Raining Men\", which sold 6 over million copies worldwide",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Ani DiFranco and Self solo artists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Season of Love is a 2013 Hong Kong TVB romance drama that explores the complexity of human love, the Summer segment featured which  Hong Kong actress, who is best known for her work with Television Broadcasts Limited (TVB), and to an extent, for her film work?",
        "response": "Kate Tsui Tsz-shan",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress and singer who played a starring role in \"Grease\" was a special guest during the Mormon Tabernacle Choir's 2015 Christmas shows? ",
        "response": "Laura Ann Osnes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team that Charles Oakley played for had a 52-30 record in the 1988-89 season?",
        "response": "New York Knicks",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of 13Hrs was born on September 22, 1987?",
        "response": "Tom Felton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person was born first, Svetlana Kuznetsova or Peter Fleming?",
        "response": "Peter Blair Fleming",
        "source": "hotpot_qa"
    },
    {
        "query": "Which satellite was operational for longer, International Ultraviolet Explorer or EXOSAT?",
        "response": "International Ultraviolet Explorer",
        "source": "hotpot_qa"
    },
    {
        "query": "The composer of La Scala Concert trained at what school?  ",
        "response": "Conservatorio Verdi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1953 film Robert Karnes appeared in?",
        "response": "Fred Zinnemann",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Peter and the Wolf and Sergei Prokofiev have in common?",
        "response": "Russian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older Keanu Reeves or Rolf de Heer?",
        "response": "Rolf de Heer",
        "source": "hotpot_qa"
    },
    {
        "query": "What honor did a famous Northern Irish singer-songwriter, instrumentalist and producer in Northern Ireland receive, who worked together with the American trumpet and flugelhorn player Bill Atwood?",
        "response": "he was knighted",
        "source": "hotpot_qa"
    },
    {
        "query": "The World Hunger Relief si an annual campaign by a company centered around what?",
        "response": "American fast food",
        "source": "hotpot_qa"
    },
    {
        "query": "Which area, known for gambling, was the 2015 Miss Universe Pagent held?",
        "response": "Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rivers Cuomo and Peter Cox both from England?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick McCabe and Thomas B. Costain, are in the literary industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "This fort in the Winter Island in Salem saw combat in this war between the Dutch and English?",
        "response": "Fort Pickering",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of this town in Aroostook County, Maine, that was the birthplace of Don Voisine?",
        "response": "4,097",
        "source": "hotpot_qa"
    },
    {
        "query": "What band formed first, Shinedown or The dB's?",
        "response": "The dB's",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1988 American comedy film, The Great Outdoors, starred a four-time Academy Award nominee, who received a star on the Hollywood Walk of Fame in what year?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first name of Jack Benny Binion's father?",
        "response": "Lester",
        "source": "hotpot_qa"
    },
    {
        "query": "what 6-story building was listed on the National Register of Historic Places in 1980?",
        "response": "Worcester Cold Storage and Warehouse Co. fire",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink was sold first, Kinnie or Frijj?",
        "response": "Kinnie",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the producer of Leviathan born?",
        "response": "July 2, 1961",
        "source": "hotpot_qa"
    },
    {
        "query": "The Speed of Sound is an all-instrumental album, released in which year, by American rock guitarist Ronnie Montrose, who led the band Montrose?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known for working with Tim Burton; Danny Elfman or Beth Ditto?",
        "response": "Daniel Robert Elfman",
        "source": "hotpot_qa"
    },
    {
        "query": "What Rock and Roll Icon starred in a 1958 film with Walter Matthau and an actress who died in 1983 and is best known for her role of Morticia Adams in 'The Adams Family' ?",
        "response": "Elvis Presley",
        "source": "hotpot_qa"
    }
]