[
    {
        "query": "Innovative Life: The Anthology 1984-1989, is a compilation album released in 2008 by who, which American rapper, singer-songwriter, record producer and DJ?",
        "response": "Arabian Prince",
        "source": "hotpot_qa"
    },
    {
        "query": " Melvern, Kansas is along a river that is notorious for what ?",
        "response": "flash flooding",
        "source": "hotpot_qa"
    },
    {
        "query": "Marco Edward Beltrami is best known for his work scoring an American science fiction teen horror film directed by who?",
        "response": "Robert Rodriguez",
        "source": "hotpot_qa"
    },
    {
        "query": "How much money did, Rick Salomon, known for his 2003 sex tape, win in the 2014 World Series of Poker's Big One for One Drop event?",
        "response": "$2.8 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cartel holds one of Mexico's most-wanted drug lords and is fighting against the Zetas for control of Jalisco and its surrounding territories?",
        "response": "Jalisco New Generation Cartel",
        "source": "hotpot_qa"
    },
    {
        "query": "Aljamain Sterling and Raphael Assunção share what profession? ",
        "response": "mixed martial artist",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous family summered where Walter S. Franklin died?",
        "response": "Rockefeller family",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Henry Kolker or Ulrike Ottinger?",
        "response": "Henry Kolker",
        "source": "hotpot_qa"
    },
    {
        "query": "Snowmasters products were used in the Back to December video by an American singer-songwriter who is one of the leading contemporary recording artists, and was born on December 13th in what year?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "which  American guitaris was Famous Monsters last to feature ",
        "response": "Doyle Wolfgang von Frankenstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Commonwealth Railways DR class was a locomotive built by the industrial equipment manufacturer based in what city?",
        "response": "Lincoln, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company is leasing the Moffet Federal Airport in Mountain View, California for the next 60 years?",
        "response": "Google",
        "source": "hotpot_qa"
    },
    {
        "query": "The King who opened Newcastle Civic Center in 1968 was born in what year?",
        "response": "1903",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Swedish indie pop band formed in 2007 is part of the roster of Downtown Records?",
        "response": "Miike Snow",
        "source": "hotpot_qa"
    },
    {
        "query": "Prasutagus is best known as the husband of a queen who led an uprising against the occupying forces of what?",
        "response": "the Roman Empire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who distributed a American-Indian-Irish computer-animated comedy-adventure film starring an Irish actor known for playing Miles O'Brien?",
        "response": "Lionsgate",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of music is the radio station that broadcast Honeyman: Live 1973?",
        "response": "contemporary Christian",
        "source": "hotpot_qa"
    },
    {
        "query": "What film is the actor, who played in the 1991 American action comedy film directed by Tony Scott, best known for?",
        "response": "Predator",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book was written following the first of ten books of the Stormlight Archive by Brandon Sanderson?",
        "response": "Words of Radiance",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Vice-Chancellor of the Australian National University, who was also part of the High-Z Supernova Search Team?",
        "response": "24 February 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Pietro Mascagni and Ambroise Thomas both best known for their contrabution to theatre? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What job/title do Mark Hunter and Jeffrey Walker have in common?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Joel Madden and Paul Baloff American pun rock singers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event that occured second, Charles Le Grice was born, or Samuel Coleridge was born?",
        "response": "1773",
        "source": "hotpot_qa"
    },
    {
        "query": "Still Reigning was filmed at a venue in which city?",
        "response": "Augusta, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the name of the artists that released an album called Some Gave All?",
        "response": "Billy Ray Cyrus",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 1975 American-Australian family adventure film produced by Walt Disney Production, directed by Don Chaffey , Alice in Wonderland or Ride a Wild Pony ?",
        "response": "Ride a Wild Pony",
        "source": "hotpot_qa"
    },
    {
        "query": "Assassin's Creed is a 2016 American science fiction action adventure film based on the video game franchise of the same name, and starts Marion Cotillard, a French actress, singer-songwriter, musician, environmentalist and spokesperson for Greenpeace who achieved international fame with the film \"La Vie en Rose\" in what year?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What album was released first \"Started with a Song\" or \"Red\"?",
        "response": "Red",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more members, Imogen Heap or Squirrel Nut Zippers?",
        "response": "Squirrel Nut Zippers",
        "source": "hotpot_qa"
    },
    {
        "query": "What Emmy-nominated actress and former SNL cast member appeared in a holiday comedy film with Jason Bateman?",
        "response": "Vanessa Bayer",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the age requirement of one of the group which run  The Co-operative Travel as a joint venture ",
        "response": "aged 16",
        "source": "hotpot_qa"
    },
    {
        "query": "Marg Ralston, the Australian sports journalist, is currently Ministerial Adviser to which Australian Labor Party politician? ",
        "response": "Leon William Kennedy Bignell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the British-American novelist and playwright whose novel inspired this Japanese anime series produced by Nippon Animation in 1988 and broadcast on the \"World Masterpiece Theater\"?",
        "response": "Frances Hodgson Burnett",
        "source": "hotpot_qa"
    },
    {
        "query": "How many personnel does the Navy that had Gilliam-class atttack transports have on active duty?",
        "response": "322,421 personnel on active duty",
        "source": "hotpot_qa"
    },
    {
        "query": "June Martino served as bookkeeper for the man who revolutionized what company?",
        "response": "McDonald's",
        "source": "hotpot_qa"
    },
    {
        "query": "What character in \"Deadpool\" did an American actress born in 1996 who starred in Tragedy Girls portray?",
        "response": "Negasonic Teenage Warhead",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 comedy film You Again which stars Canadian actor Victor Garber?",
        "response": "Andy Fickman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another name for  a defunct standard gauge freight railroad line that operated in the Black Hills that ran from the second-largest city in South Dakotafor a distance of 36.043 miles? ",
        "response": "Crouch Line",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Charles Borromeo Church is located on which Native American tribe's land?",
        "response": "The Sioux",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the documentary \"The Bluffs Butcher\" based on James Tillis, the boxer who was known as \"Quick\" due to his fast hand speed or Ron Stander, who challenged Joe Frazier for the heavyweight championship in 1972? ",
        "response": "Ron Stander",
        "source": "hotpot_qa"
    },
    {
        "query": "What job does the man traded midseason in the 2011–12 Los Angeles Lakers to the Cleveland Cavaliers have with the Lakers?",
        "response": "head coach",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the idealist metaphysician that wrote an argument published as a journal article in Mind in 1908?",
        "response": "John McTaggart Ellis McTaggart",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Hammond's Engineering Connections is a documentary series originally broadcast on the National Geographic Channel, and later on BBC2, the show's format is very similar to that of  which 10-episode documentary television series, and 1978 book, created, written, and presented by science historian James Burke?",
        "response": "Connections",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Caribbean Blue\" is a song by which Irish musician, singer, songwriter, and producer, and began their music career when she joined her family's Celtic band Clannad in 1980?",
        "response": "Enya",
        "source": "hotpot_qa"
    },
    {
        "query": "Who came after Terry Labonte in the first race of 1990 Winston Cup Series but won in 1987?",
        "response": "Bill Elliott",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Krishnan–Panju and Randal Kleiser have the same profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "One Plus One is One is the fourth studio album by what English indie singer-songwriter and multi-instrumentalist, who was born in Dunstable, Bedfordshire?",
        "response": "Badly Drawn Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "Afrikan tähti and Mutant Meeples, are what specific form of entertainment?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is known by more names, Catahoula Cur or Pumi?",
        "response": "Catahoula Cur",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this casino game named after a French word for Little wheel, which you can also play on Lynx Casino?",
        "response": "Roulette",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the founder and head of brewing company based in Milton, Delaware?",
        "response": "Sam Calagione",
        "source": "hotpot_qa"
    },
    {
        "query": "Sparks Fly is a song written and recorded by American singer-songwriter Taylor Swift for her third studio album, that was released on October 25, 2010, the album's title?",
        "response": "Speak Now",
        "source": "hotpot_qa"
    },
    {
        "query": "Club Moderne beat out another bar, located in what Montana city, for \"America's Favorite Historic Bar\" in 2016?",
        "response": "Great Falls",
        "source": "hotpot_qa"
    },
    {
        "query": "What major port founded in 1533 was Nicolas De la Hoz born in?",
        "response": "Cartagena",
        "source": "hotpot_qa"
    },
    {
        "query": "Once More was the album by the band that won what MTV Asia honor?",
        "response": "Viewer's Choice Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the future wife of the producer of the song in which Yannick re-imaged in 2000? ",
        "response": "Judy Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "This novel is most noteable for its apparent condoning of sex tourism and anti-Muslim feelings was by the same author who published a book of poems called what?",
        "response": "The Art of Struggle",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Wolfe and Michael Connelly, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the man dubbed  \"the most influential private citizen in the America of his day\" hire Elmo Roper?",
        "response": "1935",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Anna Is a Stool Pigeon\" is a single from a band formed in what city and state?",
        "response": "Gainesville, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the magazine that voted Steven Smith #1 All-Around Summer five years in a row feature?",
        "response": "interviews, equipment reviews, and columns offering advice on technique, as well as information for the general public",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was considered more popular, Louis L'Amour or William Faulkner?",
        "response": "Louis Dearborn L'Amour",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the inaugural festival for the the famous festival for mature musica fans at Caisteal Inbhir Aora? ",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American record label released the single, \"Coffee Shop?\"",
        "response": "Bad Boy Records",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person who wrote \"Affirmative Action Around the World: An Empirical Study\" born?",
        "response": "June 30, 1930",
        "source": "hotpot_qa"
    },
    {
        "query": "What company released the on demand version of a 2015 horror film starring an American actor born on September 5, 1976?",
        "response": "Scream Factory",
        "source": "hotpot_qa"
    },
    {
        "query": "Rhodes Brothers was a department store located in Lakewood Mall had been a replacement for which outdoor location?",
        "response": "Villa Plaza Shopping Center",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times has the team Jack McKeon managed won the World Series?",
        "response": "two World Series championships",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the Salford City Stadium, home to the Salford Red Devils professional rugby club?",
        "response": "Barton-upon-Irwell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who both inflated the Florentine Republic and was born on May 3, 1496?",
        "response": "Niccolò Machiavelli",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band originated in a country further south, Bodyjar or Go Radio?",
        "response": "Bodyjar",
        "source": "hotpot_qa"
    },
    {
        "query": "Ekaterini Thanou, also known as Katerina Thanou, is a Greek former sprinter, in which year, Marion Jones, who won in the 100 metres at the 2000 Olympics leaving Thanou in the second place?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What footballer was part of Ray Callahan's defensive line who eventually ranked the 8th greatest pass rusher in NFL History?",
        "response": "Mark Gastineau",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the member of Toheart from Shinee born?",
        "response": "Daegu, South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which stock car automobile race held in December did Dave Mader III win?",
        "response": "The Snowball Derby",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is French, Jean Renoir or Rolf de Heer?",
        "response": "Jean Renoir",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the animated series Kent Scott wrote end after beginning in September of 2002 on \"Nick on CBS\"?",
        "response": "November",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American jazz pianist and organist died who's album is Back with Basie?",
        "response": "April 26, 1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which son of V. Lakshminarayana was a notable Indian violinist?",
        "response": "Dr. Lakshminarayana Subramaniam",
        "source": "hotpot_qa"
    },
    {
        "query": "Where most notably did the Chancellor who's death resulted in the first election for Oxford Chancellor, held several senior ministerial posts? ",
        "response": "Viceroy of India",
        "source": "hotpot_qa"
    },
    {
        "query": "Ylvis recorded the music video for the song that was the top trending video on YouTube for which year?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the Cartoon Network series that starred Jessie Usher as Lyle premiere?",
        "response": "January 24, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the light rail station on the MAX Blue line 7 mi west of Portland, Oregon?",
        "response": "Beaverton Creek",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeremy Bates and Tony Roche both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Sydney Mervin \"Merv\" Batt was a frequent opponent for many foreign wrestlers travelling overseas including NWA World Heavyweight Champions such as one who was called, \"probably the greatest champion of the 20th century.\" by who?",
        "response": "Don Leo Jonathan",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of classical music does the song Ovvoru Pookalume belong to?",
        "response": "Hindustani and Carnatic classical music",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor better known as Chilam in a movie by Ringo Lam?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pappas house is the largest of the Usonian Automatics built after a house located in what village?",
        "response": "Amberley Village",
        "source": "hotpot_qa"
    },
    {
        "query": "The subsidiary who owns Cathay Pacific has how many airbuses on its fleet?",
        "response": "41",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, American Standards or Sugar Ray?",
        "response": "Sugar Ray",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Shikoku breed of dog or the German Longhaired Pointer breed of dog used as a multipurpose gundog?",
        "response": "The German longhaired pointer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the original play that was inspired by a passion for a Vienne composer, and was the base for the opera Orpheus und Eurydike?",
        "response": "Oskar Kokoschka",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Buffalo Bills quarterback lost the Super Bowl twice in his 11 seasons with the Bills?",
        "response": "James Edward Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Tennessee county was primary location of the armed uprising that marred John Price Buchanan's term as Governor?  ",
        "response": "Anderson County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Australian rules footballer dubbed Mick Nolan as  \"The Galloping Gasomete",
        "response": "Lewis Thomas Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Lithuanian poem concerning everyday life of Lithuanian peasants dedicated to?",
        "response": "Wilhelm von Humboldt",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Stone Temple Pilots frontman collaborated with members of Julien-K on the song \"Inside of Me\"?",
        "response": "Chester Bennington",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jerome Storm and Andrés Wood from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a Sri Lankan political party associated with the aim of developing a national identity based on shared characteristics and preserving the nation's culture?",
        "response": "The Sri Lanka Freedom Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the board games, Clans and Drunter und Drüber, both created by Leo Colovini?",
        "response": "Drunter und Drüber is a multiplayer board game invented by Klaus Teuber",
        "source": "hotpot_qa"
    },
    {
        "query": "Stoke Newington Central is a ward in the London Borough of Hackney, it corresponds roughly to Stoke Newington in London, UK and forms part of the Hackney North and Stoke Newington constituency of which British Labour Party politician, who was appointed Shadow Home Secretary, in October 2016?",
        "response": "Diane Julie Abbott",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English musician released a fourth studio album entitled Uptown Special?",
        "response": "Mark Daniel Ronson",
        "source": "hotpot_qa"
    },
    {
        "query": "What TV series features character James Steinbeck, played by American actor Anthony Herrera?",
        "response": "As the World Turns",
        "source": "hotpot_qa"
    },
    {
        "query": "which american actor is one of the stars in marry me ",
        "response": "Ken Marino",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dan McCafferty and Eddie Vedder both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which commander-in-chief of the Hellenic Army also instituted The Royal Order of George?",
        "response": "Constantine I",
        "source": "hotpot_qa"
    },
    {
        "query": "What intelligence agency was the subject of the drama film Sarbjit a spy for?",
        "response": "Indian Research and Analysis Wing",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean-Jacques Favier and Klaus-Dietrich Flade, both flew in space as which occupation ?",
        "response": "astronaut",
        "source": "hotpot_qa"
    },
    {
        "query": "Lizan Mitchell had a television role in the sitcom created by whom?",
        "response": "Tina Fey and Robert Carlock",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Billy Corgan's band The Smashing Pumpkins or Greek Fire originate in a more southern location?",
        "response": "Greek Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American rapper which Underground Volume 16: For da Summa is his first solo album born",
        "response": "October 13, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Ernst John von Freyend was adjutant to which Chief of the Armed Forces High Command during WWII?",
        "response": "Wilhelm Keitel",
        "source": "hotpot_qa"
    },
    {
        "query": "Andranik Eskandarian and Ken Davitian, share which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which monument in Oberndorf bei Salzburg is dedicated to a Christmas carol that Franz Xaver Gruber is best known for composing? ",
        "response": "The Silent Night Chapel",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the saxophonist that released the album The Gilded Hawk?",
        "response": "Bean",
        "source": "hotpot_qa"
    },
    {
        "query": "Which associate of George Popham was known as, the \"Father of English Colonization in North America,\"? ",
        "response": "Sir Ferdinando Gorges",
        "source": "hotpot_qa"
    },
    {
        "query": "Burkhard von Weisbriach was an ecclesiastical principality whose capital was the former city of what?",
        "response": "Iuvavum",
        "source": "hotpot_qa"
    },
    {
        "query": "Lynn Whitfield played a French Resistance agent in a biographical film in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "John Fish unsuccessfully chaired an effort to have Boston host what forthcoming international event?",
        "response": "2024 Summer Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which \"boss of bosses\" Mafia member was behind the murder of New York City police sergeant Joseph Petrosino?",
        "response": "Vito Cascioferro",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the following, Robert Greenwald or Jan Kounen, is the founder of Brave New Films?",
        "response": "Robert Greenwald",
        "source": "hotpot_qa"
    },
    {
        "query": "Cinnamon sugar is a spice used to flavor this traditional Spanish and Portugese fried pastry.",
        "response": "Churros",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of hotel is Sands China Limited located in?",
        "response": "luxury hotel and casino resort",
        "source": "hotpot_qa"
    },
    {
        "query": "Which type of dance originating as part of the bounce music scene of New Orleans in the late 1980s is American comedian Jessica Vanessa DeLeon known for?",
        "response": "Twerking",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the consigliere to the boss of the Bonanno crime family born?",
        "response": "Castellammare del Golfo, Sicily",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Arrows\" is a song by American indie rock artist Fences, nom de plume of singer Christopher Mansfield, the song features American hip hop duo Macklemore & Ryan Lewis, formed in which year, from Seattle, Washington?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Arthur Gerald Wellesley, Earl of Mornington, is the great-great-grandson of what  last German Emperor (\"Kaiser\") and King of Prussia?",
        "response": "Wilhelm II",
        "source": "hotpot_qa"
    },
    {
        "query": "The Best: Make the Music Go Bang! album included liner notes by an American skateboard legend most prominently known as a pioneer of what?",
        "response": "vertical skateboarding",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Making Today a Perfect Day\" is a song from which 2015 Walt Disney Animation Studios computer-animated short film?",
        "response": "Frozen Fever",
        "source": "hotpot_qa"
    },
    {
        "query": "Doniphan is an incorporated community in Kansas within a larger County with most populous city?",
        "response": "Wathena",
        "source": "hotpot_qa"
    },
    {
        "query": "Both the Pyrenean Mastiff and the Braque d'Auvergne are what?",
        "response": "dogs",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the English-French actress born, that starred in the 1975 film \"Sept morts sur ordonnance\", who had a prolific career as an actress in British and French cinema?",
        "response": "14 December 1946",
        "source": "hotpot_qa"
    },
    {
        "query": " SNCI Tower and 80 South Street are both what?",
        "response": "skyscraper",
        "source": "hotpot_qa"
    },
    {
        "query": "Charlotte Perkins Gilman wrote The Yellow Wallpaper after a severe bout of postpartum in this magazine?",
        "response": "The New England Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the host of Wall of Fame known for his partnership with?",
        "response": "Matt Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the publishing house that printed Sarah Gerard's \"Binary Star\"?",
        "response": "Columbus, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Chan was a geomancer of a philosophical system that translates to what in English?",
        "response": "\"wind-water\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Jason Isaacs, who also starred in the Jackie Chan film The Tuxedo, played which character in the Harry Potter movies?",
        "response": "Lucius Malfoy",
        "source": "hotpot_qa"
    },
    {
        "query": "What song performed by Lea Salonga was written for a 1998 film directed by Tony Bancroft and Barry Cook?",
        "response": "Reflection",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Kubat is a Canadian television writer and story editor, he's worked on such animated series as which  computer-animated series that ran on Cartoon Network, from March 7, 2008 until January 31, 2010?",
        "response": "Chop Socky Chooks",
        "source": "hotpot_qa"
    },
    {
        "query": "What Dmitri Shostakovich opera (Opus 29) was attacked under direct orders from Joseph Stalin?",
        "response": "Lady Macbeth of Mtsensk",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Anderson (born August 15, 1970) is an American actor, comedian, writer, and game show host who stars in Black-ish, an American sitcom broadcast on what television network?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of place is St James Church one of only some 2,500 of?",
        "response": "National Historic Landmark",
        "source": "hotpot_qa"
    },
    {
        "query": "Free dance is a 20th-century dance form, that preceded modern dance, rebelling against the rigid constraints of classical ballet, assisting was Loie Fuller, was an American dancer who was a pioneer of both modern dance and theatrical lighting techniques, she passed away on which date?",
        "response": "January 1, 1928",
        "source": "hotpot_qa"
    },
    {
        "query": "D'spraye and Doctor Strange are both fictional characters in what comic series?",
        "response": "Marvel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which court case occurred first, Reynolds v. United States, or Terry v. Ohio?",
        "response": "Reynolds v. United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Dysfunctional Friends starred this American actress, model and humanitarian Los Angeles who has portrayed who on the legal drama series \"suits\"",
        "response": "Rachel Zane",
        "source": "hotpot_qa"
    },
    {
        "query": "The ancestral home of George Henry Moore was burned down during a conflict that ended on what date?",
        "response": "24 May 1923",
        "source": "hotpot_qa"
    },
    {
        "query": "In what month was the album containing Genesis released?",
        "response": "January",
        "source": "hotpot_qa"
    },
    {
        "query": "What do E. B. White and Dan Masterson have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Buckets of Rain was a track on this Bob Dylan album recorded for which record company?",
        "response": "Columbia Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides Little Rock, Arkansas, what city are the offices of the Clinton Foundation located where Bari Lurie serves as chief of staff to Chelsea Clinton?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the movie that is an adaption of The True Meaning of Smekday?",
        "response": "DreamWorks Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "The Black Mountains are a mountain range in western North Carolina, the range takes its name from the dark appearance of the red spruce and which species of fir native to the Appalachian Mountains of the Southeastern United States, that form a spruce-fir forest on the upper slopes which contrasts with the brown (during winter) or lighter green (during the growing season) appearance of the deciduous trees at lower elevations? ",
        "response": "Fraser fir",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Hans Pfitzner or Sergei Prokofiev?",
        "response": "Hans Erich Pfitzner",
        "source": "hotpot_qa"
    },
    {
        "query": "The football club once managed by Chris Turner and formed in 1883 was originally known by what name?",
        "response": "Heaton Norris Rovers",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in the 2010 census of the County in which the city of Hogansville is located ?",
        "response": "67,044",
        "source": "hotpot_qa"
    },
    {
        "query": "Valkarkay is the site of a polar weather station established in 1932 and was the primary location used in the 2010 Russian drama film directed by who?",
        "response": "Alexei Popogrebski",
        "source": "hotpot_qa"
    },
    {
        "query": "What show does Lori Grener appear in, that gives an investment in the sixth season to a company named Roominate?",
        "response": "Shark Tank",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is the maker of Turbo Drop located in?",
        "response": "Utah",
        "source": "hotpot_qa"
    },
    {
        "query": "What French mathematician, whose father was a tax collector in Rouen, did Oleg Khoma do research on?",
        "response": "Researcher of Blaise Pascal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first,  Fambul Tok or American Hardcore?",
        "response": "American Hardcore",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the biographical-comedy-crime film directed by Steven Soderbergh about the highest-level corporate executive whistleblower come out?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of animal does Bullenbeisser and Doberman Pinscher have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the northern rivals of the professional rugby union club whom Will Chudley made his debut game for Exeter against?",
        "response": "Newcastle Falcons",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the composer of Alzira die?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case had a larger majority ruling, Stromberg v. California or United States v. Wheeler?",
        "response": "United States v. Wheeler",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor born who starred in Nambia: The Struggle for Liberation and played Roger Murtaugh in the \"Lethal Weapon\" film series?",
        "response": "July 22, 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Syed Noor and Simon West, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to his role in When Strangers Appear, what role did Barry Watson play in \"7th Heaven\"?",
        "response": "Matthew \"Matt\" Camden",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university has more undergraduate students, University of Delaware or Lehigh University?",
        "response": "University of Delaware",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Mikio Naruse and Raoul Peck have in common",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Which high school hired the head coach of the 1996 Oklahoma State Cowboys football team in 2013?",
        "response": "Boulder High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary film won more awards, King Gimp or Streetwise?",
        "response": "King Gimp",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was created more recently, The Mad Magazine Game or Qin?",
        "response": "Qin",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Broken Bells and Cast considered rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "American Grit is an American reality television series that premiered on Fox, the series stars which American professional/ WWE wrestler?",
        "response": "John Felix Anthony Cena",
        "source": "hotpot_qa"
    },
    {
        "query": "Johnny Chung Lee is working on the Project Tango platform at an American multinational technology company that was founded in what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was Chinese out of Monsters vs. Aliens and Storm Rider Clash of the Evils?",
        "response": "Storm Rider Clash of the Evils",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian actor starred in a supernatural thriller released in 1998 by Warner Bros.?",
        "response": "Elias Koteas",
        "source": "hotpot_qa"
    },
    {
        "query": "which scheduled monument within the town of Ellon, Aberdeenshire.did  Michaela Reid moved into",
        "response": "Ellon Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "In which states did Pietro's Pizza and LaRosa's Pizzeria serve in",
        "response": "throughout the Cincinnati, Greater Dayton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book by one of the leading \"muckrakers\" of the progressive era of the late 19th and early 20th centuries, is an exposé about the Standard Oil Company?",
        "response": "The History of the Standard Oil Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another name for the NIR flag?",
        "response": "Ulster Banner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant is widelt cultivated as an herb, Cotula coronopifolia or Parsley?",
        "response": "Parsley",
        "source": "hotpot_qa"
    },
    {
        "query": "What Award did The acress who starred in a 2004 American live-action/animated comedy film based on the Nickelodeon television series \"SpongeBob SquarePants\" whohifted to adult roles with her performances in \"Girl with a Pearl Earring\"?  ",
        "response": "BAFTA Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retail department stores at which  Romeo Records was exclusively  sold was established by Samuel Henry Kress?",
        "response": "S. H. Kress & Co.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the premiere date for the series that Keith Crofford has the role of executive in charge of production?",
        "response": "February 16, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut was born first, Christer Fuglesang or Philippe Perrin?",
        "response": "Christer Fuglesang",
        "source": "hotpot_qa"
    },
    {
        "query": "Vladimir Bure is what",
        "response": "freestyle swimmer and a fitness coach",
        "source": "hotpot_qa"
    },
    {
        "query": "From 1924 to 1954 the DeWare Field House was the home to a team that currently plays at what arena?",
        "response": "Reed Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Big East championship team defeated the Florida Gators in the 2013 Sugar Bowl with a overall record of 11-2??",
        "response": "Louisville Cardinals",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this type of European forms of electronic dance music combining elements of pop, new wave and rock that Elton John's album Victim of Love is a good example of?",
        "response": "Euro disco",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the oldest partner of the 2015 Russian national champion ice dancers born?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sandman stars a Spanish ballet dancer who is the artistic director of what?",
        "response": "English National Ballet",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Amélie Mauresmo and Gabriela Sabatini earn the same number of olympic medals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the American celebrity chef who is both owner of Carlo's Bakery and host of Latin American television series \"Next Great Baker: Latin America\"?",
        "response": "Buddy Valastro",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Tangerine Confectionery's sweet Flump made of?",
        "response": "marshmallow",
        "source": "hotpot_qa"
    },
    {
        "query": "Karen R. Hitchcock worked at SUNY or The State University of New York, when was the university established?",
        "response": "1844",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chicago Boys were a group of Chilean economists prominent around the 1970s and 80s, the majority of whom trained at the Department of Economics of which organization, under Milton Friedman, was an American economist who received the 1976 Nobel Memorial Prize in Economic Sciences for his research on consumption analysis, monetary history and theory, and the complexity of stabilization policy?",
        "response": "University of Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was captured by a middle child in Treehouse of Horror III?",
        "response": "King Homer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2012 film was written by the screenwriter who also wrote Armageddon?",
        "response": "Savages",
        "source": "hotpot_qa"
    },
    {
        "query": "Which medal did the writer of \"Smile\" earn?",
        "response": "2004 Carnegie Medal",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2006–07 Four Hills Tournament was a series of ski jumping competitions held in the traditional venues of Oberstdorf, Garmisch-Partenkirchen, Innsbruck and Bischofshofen, located in Germany and Austria, before the tournament started on which date, the World Cup leader was Simon Ammann, a Swiss ski jumper?",
        "response": "28 December 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Allen Drury and John Gardner win a Pulitzer Prize?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "For which role the Israeli actress was known for who also portrayed Gisele Yashar?",
        "response": "Wonder Woman",
        "source": "hotpot_qa"
    },
    {
        "query": "Professional cyclist Sara Symington competed in which Olympic Games held in Sydeney, Australia?",
        "response": "2000 Summer Olympic Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was from a country closer to Canada, J. Searle Dawley or Lionel Ngakane?",
        "response": "James Searle Dawley",
        "source": "hotpot_qa"
    },
    {
        "query": "Kelly Reno was cast in a film based on a novel from what year?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the railway line that provides services in Woodford, New South Wales extend to? ",
        "response": "Victoria, Queensland and the Australian Capital Territory",
        "source": "hotpot_qa"
    },
    {
        "query": "The medieval fortification Castle Hill was builty by this noble man who was also known as King of which country (after the 1250s)?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following magazines accepts no advertising: Red Herring or Cook's Illustrated?",
        "response": "Cook's Illustrated",
        "source": "hotpot_qa"
    },
    {
        "query": "Kimberly Beck (born January 9, 1956) is a former American actress and model, her other film roles include Alfred Hitchcock's Marnie, is a 1964 American psychological thriller film, the was based on the 1961 novel of the same name, by who?",
        "response": "Winston Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actress that starred with Colin Farrell and Samantha Morton in the film \"Miss Julie\" born?",
        "response": "March 24, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first name the founders of Hotel Baxter and Ted's Montana Grill have in common?",
        "response": "George",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character was played by Rupert Grint in all 8 Harry Potter films, including at age 13 in Harry Potter and the Chamber of Secrets?",
        "response": "Ron Weasley",
        "source": "hotpot_qa"
    },
    {
        "query": "WGKA has a host who is an American conservative and nationally syndicated radio talk show host, columnist, author and publich speaker. Who?",
        "response": "Dennis Prager",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the former manager of Lee Young-pyo play?",
        "response": "midfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director also worked as a make-up artist, Josh Trank or D.W. Kann?",
        "response": "D.W. Kann",
        "source": "hotpot_qa"
    },
    {
        "query": "What was founded first, Das Damen or Lo-Pro?",
        "response": "Das Damen",
        "source": "hotpot_qa"
    },
    {
        "query": "The man who succeeded John Robert Marks as Mayor of Tallahassee in 2014 has declared his candidacy for which position in the 2018 election?",
        "response": "Governor of Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the genre of contemporary electronic music that GoGo Penguin plays?",
        "response": "Nu jazz",
        "source": "hotpot_qa"
    },
    {
        "query": "Bawls and Dr Pepper, are a type of ?",
        "response": "drink",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the closest relative to the whale located?",
        "response": "sub-Saharan Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two mines, Discovery Mine or Big Dan Mine, produced more gold?",
        "response": "Discovery Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Like It Like That is the fifth album by Australian singer Guy Sebastian that has three tracks with an American singer-songwriter who won a Grammy Award in 2003 for what single?",
        "response": "Your Body Is a Wonderland",
        "source": "hotpot_qa"
    },
    {
        "query": "Rosaleen was a name that was possibly taken from the unseen character in which 1597 play?",
        "response": "Romeo and Juliet",
        "source": "hotpot_qa"
    },
    {
        "query": " CustomMade is an online custom jeweler aquired by a company founded in 2002 and formerly known as what?",
        "response": "CSN Stores",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is taller, Masherbrum or Haramosh Peak?",
        "response": "Masherbrum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Elan produced series was hosted by Chris Harrison?",
        "response": "The Bachelor",
        "source": "hotpot_qa"
    },
    {
        "query": "Iris Murdoch and William Goyen were both what?",
        "response": "novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  American actor which Jimmy Gresham played in his band born ",
        "response": "July 14, 1932",
        "source": "hotpot_qa"
    },
    {
        "query": "What album was also the name of a tour and film directed by Albert Magnoli?",
        "response": "Purple Rain",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Sif in the film \"Thor\" also starred in a 2016 American psychological thriller that was directed by who?",
        "response": "Bram Coppens",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of Method of Fluxions was born in what year?",
        "response": "1642",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the voice of the title character in 1992 American animated comedy musical romantic fantasy adventure film produced by Walt Disney Feature Animation?",
        "response": "Scott Weinger",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeon Mi-seon starred in the 2013 directorial debut of which director?",
        "response": "Huh Jung",
        "source": "hotpot_qa"
    },
    {
        "query": "when is the American actor who was the son of  Margaret Pellegrini born ",
        "response": "born January 24, 1920",
        "source": "hotpot_qa"
    },
    {
        "query": "Adnan Oktar wrote which series of creationist books under the pen name \"Harun Yahya\"?",
        "response": "The Atlas of Creation",
        "source": "hotpot_qa"
    },
    {
        "query": "The Most Excellent Order of the Golden Ark is a Dutch order of merit established by a prince born in which year ?",
        "response": "1911",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Martha Maria Twisleton-Wykeham-Fiennes's brother first achieve success?",
        "response": "Royal National Theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Curtis Allina added heads to the design while he was executive of a company of what nationality?",
        "response": "Austrian",
        "source": "hotpot_qa"
    },
    {
        "query": "Around the World in 80 Ways follows the exploits of the driver of which monster truck?",
        "response": "Grave Digger",
        "source": "hotpot_qa"
    },
    {
        "query": "What two Royal concerts were performed by Sir Richard Henry Simpson Stilgoe collaborator Romany Wood?",
        "response": "Royal Charity Gala",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession is practiced by both Craig Serling and Zhang Yimou?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this town located on the larger of the two Fox Islands in Maine, where Philip Jamison's summer home is located?",
        "response": "Vinalhaven, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed first Cha Cha Cohen or Swervedriver?",
        "response": "Cha Cha Cohen were a band formed in 1994",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is WLTN's transmitter located in?",
        "response": "Grafton County",
        "source": "hotpot_qa"
    },
    {
        "query": "Which winner of the 2010 National Book Awards lifetime achievement award wrote a book about the story of Joey Coyle?",
        "response": "Mark Bowden",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Maurice, the monster under the bed and  is a Canadian comedian?",
        "response": "Howie Mandel",
        "source": "hotpot_qa"
    },
    {
        "query": "Rick Dancer covered which 1998 event committed by expelled student Kip Kinkel?",
        "response": "Thurston High School shooting",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Ellis Orrall and Brandon Boyd, have which mutual occupations?",
        "response": "singer, songwriter,",
        "source": "hotpot_qa"
    },
    {
        "query": "What management award was given to former shortstop of the Detroit Tigers, Boston Red Sox, St. Louis Browns and Cincinnati Reds in 1967?",
        "response": "Manager of the Year",
        "source": "hotpot_qa"
    },
    {
        "query": "Which part of the Seattle-based Discovery Institute obbies for the inclusion of creationism in the form of intelligent design?",
        "response": "The Center for Science and Culture",
        "source": "hotpot_qa"
    },
    {
        "query": "A railway constructed along aqueducts in north west England from Heywood to Rawtenstall was built in response to the growing population of what time period?",
        "response": "Industrial Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "Carroll County, Ohio is named after the only Catholic signatory to the Declaration of Independence, who is he?",
        "response": "Charles Carroll of Carrollton",
        "source": "hotpot_qa"
    },
    {
        "query": "The Birthday of the World: and Other Stories was written by what fantasy and sci-fi author?",
        "response": "Ursula Kroeber Le Guin",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Michael Casey and Zach Bogosian, who is an ice hockey defenseman?",
        "response": "Zachary M. Bogosian",
        "source": "hotpot_qa"
    },
    {
        "query": "The Gooden Grant House is located in what bay in Maine? ",
        "response": "Penobscot Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band debuted first, Fake Problems or L'Arc-en-Ciel?",
        "response": "L'Arc-en-Ciel",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Carolina Panther play against that led to the nickname No Fly Zone?",
        "response": "Denver Broncos",
        "source": "hotpot_qa"
    },
    {
        "query": "\"I'm So Sick\" is a song by which American rock band, formed in the Belton and Temple, Texas regions in 2002?",
        "response": "Flyleaf",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Albee and Oliver La Farge both won this award, one for a novel and one for a play?",
        "response": "Pulitzer Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "who was the actress in \"who's the boss\" Alyssa Milano or Jamie Luner?",
        "response": "Alyssa Milano",
        "source": "hotpot_qa"
    },
    {
        "query": "How many students are in the high school for the school district headquartered in Delphi, Indiana?",
        "response": "more than 500",
        "source": "hotpot_qa"
    },
    {
        "query": "AH Basic was introduced to replaced a Dutch supermarket chain founded in what year?",
        "response": "1887",
        "source": "hotpot_qa"
    },
    {
        "query": "Krzysztof Zimnoch holds a win over the boxer who has held the WBC heavyweight title since what year?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "What place is not only a capital city but also located near Tillya Tepe?",
        "response": "Sheberghan",
        "source": "hotpot_qa"
    },
    {
        "query": "State Route 209 (SR-209) is a state highway in the U.S. state of Utah, following 9000 South and other east–west streets south of Salt Lake City, It connects I-15 in Sandy with the ski areas of Little Cottonwood Canyon, and, once an extension is complete, with which mine, more commonly known as Kennecott Copper Mine among locals, is an open-pit mining operation extracting a large porphyry copper deposit southwest of Salt Lake City, Utah?",
        "response": "Bingham Canyon Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Daphne du Maurier or James Jones have more skills in the arts?",
        "response": "Daphne du Maurier",
        "source": "hotpot_qa"
    },
    {
        "query": " The 2017 East–West Shrine Game was held at a stadium that has been the home of what MLB team since 1998?",
        "response": "Tampa Bay Rays",
        "source": "hotpot_qa"
    },
    {
        "query": "The album Different Strokes was produced by an American rhythm-and-blues singer who died in which year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Were J. Searle Dawley and Peter Yates both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Chernobyl Heart or Lake of Fire ?",
        "response": "Chernobyl Heart",
        "source": "hotpot_qa"
    },
    {
        "query": "Main Tera Boyfriend is a dance song recorded in part by an Indian singer who competed on what television reality show in 2006?",
        "response": "Indian Idol",
        "source": "hotpot_qa"
    },
    {
        "query": "What interstate does Interstate 15 cross after Butte, Montana?",
        "response": "Interstate 115",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actress who played both the jaded aristocrat in \"The Roman Spring of Mrs. Stone\" and the murderous Colonel Rosa Kleb in \"From Russian with Love\".",
        "response": "Lotte Lenya",
        "source": "hotpot_qa"
    },
    {
        "query": "Scottish actor and voice actor, David Tennant, is the voice of Scrooge in what new show that premiered on August 12, 2017 with a 44 minute special entitled \"Woo-oo!\"?",
        "response": "DuckTales",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rebellion which began on 10 May 1857 did  Frederick Haines  served in India during the period",
        "response": "The Indian Rebellion of 1857",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the flag carrier of Ireland who previously sponsored the Corkscrew Hill ride?",
        "response": "Aer Lingus",
        "source": "hotpot_qa"
    },
    {
        "query": "In which place the  Madchester scene of 1989 -1991 developed?",
        "response": "Manchester area",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in Turkey are the Kuleli Military High School and the Atik Valide Mosque located?",
        "response": "Istanbul",
        "source": "hotpot_qa"
    },
    {
        "query": "which was released first \"Do I Sound Gay?\" or \"Walking with Cavemen\" ?",
        "response": "Walking with Cavemen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released the song before \"Out of the Woods\" on the album \"1989\" to radio? ",
        "response": "Republic Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the actress that played Sue Knight in Puberty Blues who also wrote the Rainbow Cubby House?",
        "response": "Brenna Harding",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession did Alan Crosland and Kurt Voss both hold?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "what medieval Scottish castle was build during the same period as the chapel Dedicated to the Virgin Mary?",
        "response": "The Castle of Rattray",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays a teenage prostitue in \"Taxi Driver\" co-stars with Abigail Breslin and Gerard Butler in what 2008 film? ",
        "response": "Nim's Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wide scope of profession, Floor Jansen or Ian McCulloch?",
        "response": "Floor Jansen",
        "source": "hotpot_qa"
    },
    {
        "query": "What famous movie series did the star of BBC's One Child play a supporting role in?",
        "response": "Harry Potter",
        "source": "hotpot_qa"
    },
    {
        "query": "John Peterson wrote the novel \"The Secret Hide-Out\" as well as this series of children's novels which were adapted into a TV series that aired from 1983-1985?",
        "response": "The Littles",
        "source": "hotpot_qa"
    },
    {
        "query": "Love. Angel. Music. Baby. included a collaboration with which American producer and actor?",
        "response": "André Lauren Benjamin",
        "source": "hotpot_qa"
    },
    {
        "query": "After the \"Anschluss\" with Nazi Germany, the right-wing paramilitary group in Austria, Ostmärkische Sturmscharen, was replaced in Nazi Propaganda by which name? Answer: Ostmark",
        "response": "Ostmark",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Ulrich Walter and Léopold Eyharts both from Germany?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which river separates the city of Albury on its northern side and the city of Wodonga?",
        "response": "Murray River",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor starred in Surrogates ",
        "response": "James Oliver Cromwell",
        "source": "hotpot_qa"
    },
    {
        "query": "Fader said that the breakout \"stoner\" was a tribute to Fabo by an American hip hop artist who is from what U.S. State?",
        "response": "Georgia",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2006, Will Finn directed \"Hammy's Boomerang Adventure\", a computer-animated short film based on which film?",
        "response": "Over the Hedge",
        "source": "hotpot_qa"
    },
    {
        "query": "When was aerial skier born who was the first time a woman to be the chef de mission of any Australian Olympic team?",
        "response": "10 November 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Savings Bank of South Australia is a division of the bank that has headquarters in what city?",
        "response": "Sydney",
        "source": "hotpot_qa"
    },
    {
        "query": "Death of a Soldier is a film based on the life of an American serial killer known by what nickname?",
        "response": "\"Brownout Strangler\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician, Ciaran Gribbin or Brett Scallions, is a member of the post-grunge band Fuel?",
        "response": "Brett Allen Scallions",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Max Green and Cherie Currie females?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Fitz and The Tantrums or The Contortionist?",
        "response": "The Contortionist",
        "source": "hotpot_qa"
    },
    {
        "query": "The Polar Bears featuring the voice of Armie Hammer, is also the same voice actor for which character in Cars 3?",
        "response": "Jackson Storm",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand of Tennessee whiskey distilled in a dry county was allegedly used by \"Super Joe\" Charboneau as an anesthetic when he fixed a broken nose with a pair of pliers?",
        "response": "Jack Daniel's",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the men's Twenty20 cricket team based in for which Aaron Keith Heal played after he played for Western Australia?",
        "response": "Australian state, Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "what did Volunteer Groundcrew of the Army Air Corps use in isolated areas.",
        "response": "is a type of rotorcraft",
        "source": "hotpot_qa"
    },
    {
        "query": "In the WEC 38, WEC Lightweight Champion Jamie Varner defended his title against a mixed martial artist born in this year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the party Dan Keating was patron of take its present form?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "What American character actor starred in \"Beneath the Planet of the Apes\" and The Big Caper",
        "response": "James Gregory",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has a smaller distribution, Barklya or Illicium?",
        "response": "Barklya",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is a key component to 7th least corrupt economy in the world?",
        "response": "Aviation in Singapore",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the show \" The day the Universe Change\" about and What did James Burke do? ",
        "response": "The series' primary focus is on the effect of advances in science and technology on western society in its philosophical aspects.",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Mark Krikorian responsible for the immigration of Harout Pamboukjian?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The album The Days of Our Nights by alternative rock band Luna includes a cover of a song by an American rock band and featured on their debut album titled what?",
        "response": "Appetite for Destruction",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Stainton first gained recognition with what English singer and musician who was known for his gritty voice?",
        "response": "Joe Cocker",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the album released for which Lady Gaga used for material for her Super Bowl LI halftime show?",
        "response": "October 21, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city in Veneto, northern Italy is home to Codevigo?",
        "response": "Padua",
        "source": "hotpot_qa"
    },
    {
        "query": "The Robey-Peters Gun-Carrier was built at a commuter village with at population of what at the 2001 census?",
        "response": "4,530",
        "source": "hotpot_qa"
    },
    {
        "query": "The special division's constitutionality was upheld by which 1988 United States Federal Court Case?",
        "response": "Morrison v. Olson, 487 U.S. 654 (1988)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has two acts, Genoveva or Il matrimonio segreto?",
        "response": "Il matrimonio segreto",
        "source": "hotpot_qa"
    },
    {
        "query": "What January 30, 1972 event led to the Whidgery Tribunal?",
        "response": "Bloody Sunday",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ricky Ross and Jeon Ji-yoon both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How many members did Joseph Yablonski's union have in 2014?",
        "response": "35,000",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the singer of No One Knows How to Love Me Quite Like You Do born?",
        "response": "January 16, 1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the actor who voiced an anthropomorphic retired race car in the 2006 Pixar film \"Cars\" as a medical doctor and a local judge born?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from the United States, Radek Štěpánek or Brian Gottfried?",
        "response": "Brian Edward Gottfried",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine Snowboard Magazine or Art of the West was founded first ?",
        "response": "Art of the West",
        "source": "hotpot_qa"
    },
    {
        "query": "Robinsons and Pocari Sweat are both what kind of product?",
        "response": "drink",
        "source": "hotpot_qa"
    },
    {
        "query": "Performers that have played at the L.B. Amphitheatre include an American rock band that originally formed in Jacksonville, Florida, in 1964, as who?",
        "response": "My Backyard",
        "source": "hotpot_qa"
    },
    {
        "query": "What British science fiction television series had it's episode entitled \"Smile\" written by the winner of the 2012 Guardian Prize for \"The Unforgotten Coat\"?",
        "response": "Doctor Who",
        "source": "hotpot_qa"
    },
    {
        "query": "Roald Amundsen disappeared during a rescue mission to the North Pole in search of an aviator born in which year ?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the company founded that Timothy Goeglein became the Vice President of External Relations for in January 2009?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Durring what war did an American restaurateur and the owner/operator of a landmark museum and restaurant in New York City, situated at 54 Pearl Street at the corner of Broad Street provide for prisoners held during the seven-year British occupation of New York City ?",
        "response": "Revolutionary War",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first play written by the screenwriter of Danny Boyle's directorial debut?",
        "response": "Collaborators",
        "source": "hotpot_qa"
    },
    {
        "query": "Azul Linhas Aéreas Brasileiras S/A, is a Brazilian carrier based in Barueri, a suburb of São Paulo, it was established on which date, by Brazilian-born David Neeleman?",
        "response": "May 5, 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "White Teeth is a 2002 British four-part television drama miniseries based on the novel of the same name written by which English novelist, essayist, and short-story writer, and was elected a fellow of the Royal Society of Literature in 2002?",
        "response": "Zadie Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "As of the 2010 United States Census, what was the population of the the city located 3 miles southwest of Winn Airport?",
        "response": "54,462",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this crime novel written by Italian American author Mario Puzo published where Don Anthony \"Black Tony\" Stracci first appeared?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary Hurlstone (born 25 April 1963) is an English former professional footballer who played as a Striker in the Football League for York City, and in non-League football for which football club based in Gainsborough, Lincolnshire, England?",
        "response": "Gainsborough Trinity Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What 9,500 seat arena is located in the largest urban agglomeration in Nevada?",
        "response": "The Orleans Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the first year reports of Aaron Burr's ghost appearing at One If By Land, Two If By Sea could have started?",
        "response": "1836",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actress and musician appeared on the television series \"Veronica Mars\" and in the 2009 American drama film \"Mississippi Damned?\"",
        "response": "Tessa Thompson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist is from England, Kim Dong-jun or Alison Goldfrapp?",
        "response": "Alison Elizabeth Margaret Goldfrapp",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was released earlier, Moana and Jagga Jasoos?",
        "response": "Moana",
        "source": "hotpot_qa"
    },
    {
        "query": "What male actor starred in a 2014 superhero sequel alongside the actor who shot Brandon Lee in \"The Crow?\"",
        "response": "Andrew Garfield",
        "source": "hotpot_qa"
    },
    {
        "query": "A Face of War was favorably reviewed by which film critic and historian?",
        "response": "Roger Joseph Ebert",
        "source": "hotpot_qa"
    },
    {
        "query": "What Academy Award nominated actress  starred in a movie along side Burt Reynolds?",
        "response": "Lotte Lenya",
        "source": "hotpot_qa"
    },
    {
        "query": "Do athletes Thomaz Koch and Jack Sock play the same professional sport?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dylan Dresdow has mixed songs for which American rapper known in the west coast hip-hop scene?",
        "response": "Jayceon Terrell Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "Gadsden Mall is anchored by Belk and a company founded in what year?",
        "response": "1886",
        "source": "hotpot_qa"
    },
    {
        "query": "Broxbourne is a constituency represented in the House of Commons of the UK Parliament since 2005 by which British Conservative Party politician, who has been the Member of Parliament (MP) for Broxbourne since the 2005 general election?",
        "response": "Charles Walker",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the hotel casino in which Madame Tussauds Las Vegas is located?",
        "response": "475",
        "source": "hotpot_qa"
    },
    {
        "query": "which films has the highest numbers of stars Davy Crockett and the River Pirates: or A Bug's Life:",
        "response": "A Bug's Life",
        "source": "hotpot_qa"
    },
    {
        "query": "The airport that serves as the home base for the largest airline of Belgium is home to approximately how many companies?",
        "response": "260",
        "source": "hotpot_qa"
    },
    {
        "query": "What upcoming American erotic romantic drama film did Robinne Lee star in?",
        "response": "Fifty Shades Freed",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer's eighth studio album got released later than expected due to their work on the 2008 American-German action thriller film loosely based on the comic book miniseries of the same name by Mark Millar and J. G. Jones?",
        "response": "Common",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress born in 1951 starred next to Hart Bochner and Robert Carradine in the 1984 film \"The Sun Also Rises\"?",
        "response": "Jane Seymour",
        "source": "hotpot_qa"
    },
    {
        "query": "Sergei Rachmaninoff's Symphony No. 1 was influenced by what Georgian doctor?",
        "response": "Alexander Porfiryevich Borodin",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1978 Coupe de France Final was a football match that saw AS Nancy defeat OGC Nice 1–0 thanks to a goal by a player nicknamed what ?",
        "response": "Le Roi",
        "source": "hotpot_qa"
    },
    {
        "query": "Bradford Cox stars is what movie about Ron Woodroof?",
        "response": "Dallas Buyers Club",
        "source": "hotpot_qa"
    },
    {
        "query": "On which Island would you have found the 'Loop the Loop', a roller coaster consisting of two tracks and of which there are only three types?",
        "response": "Coney Island",
        "source": "hotpot_qa"
    },
    {
        "query": "The McCrory Waterworks is a historic site that contains an elevated steel water tower built by a company that specializes in projects for who?",
        "response": "oil and gas companies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player from the University of Texas 1994 Sun Bowl team was later signed to the Baltimore Ravens?",
        "response": "Priest Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Darryl Stonum play in the 2012 Holiday Bowl?",
        "response": "Baylor accepted a berth in the 2012 Holiday Bowl",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2010, what was the census of the town in which Marjorie Spock passed away in. ",
        "response": "1,236",
        "source": "hotpot_qa"
    },
    {
        "query": "Muz-TV was launched before the 24-hour music channel that was operated by what company?",
        "response": "Prof Media",
        "source": "hotpot_qa"
    },
    {
        "query": "Hartford Hawks women's basketball team plays in a conference whose members are located in which part of the United States ?",
        "response": "the Northeastern United States",
        "source": "hotpot_qa"
    },
    {
        "query": "James Nicholas Callis, is an English actor, he is known for playing Bridget Jones' best friend in \"Bridget Jones's Diary\", released in which year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the world’s first-ever pilsner type blond lager, the company also awarded the Master Homebrewer Competition held in San Francisco to an award-winning brewer who won the prestigious American Homebrewers Associations' Homebrewer of the Year award in 2013?",
        "response": "Pilsner Urquell",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Video Watchdog and Rays from the Rose Cross both esoteric magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Regarding the academy that a renowned Hungarian composer born in 1950 studied, when was that composer born?",
        "response": "25 March 1881",
        "source": "hotpot_qa"
    },
    {
        "query": "The band that created the album Live at Bell's comes from what city and state?",
        "response": "Kalamazoo, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Beyazıt Tower and Miniatürk both in Istanbul, Turkey?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2004 French action film for which Tony D'Amario is best known?",
        "response": "Pierre Morel",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Thumb Food & Pharmacy is part of the southern division of a grocery company based in what city?",
        "response": "Boise",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the film released in the United States, that is directed by a famous Australian film director and features Hugh Jackman in a leading role?",
        "response": "December 25, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the geniuses Olsynium and Eriobotrya native to the same parts of the world ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "David W. Petegorsky as author of an acclaimed book on which English Protestant religious reformer, political philosopher, and activist, and and the Diggers organization  ?",
        "response": "Gerrard Winstanley",
        "source": "hotpot_qa"
    },
    {
        "query": "\"In Siberia\" is a travel book that was selected as one of the books of the year by a trio of people including a British novelist born in what year?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Dobi-III and Kaunas Airport have in common?",
        "response": "Lithuania",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the genus Elodea and Pinellia native to the same areas of the world ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Victorian era castle is to the east of Marybank, Lewis?",
        "response": "Lews Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which church is the university, who manufactured the Boston Camera for the United States Air Force, affiliated with?",
        "response": "United Methodist Church",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times does the song writer of \"Love or Leave\" have participated in the Eurovision Song Contest?",
        "response": "18 times",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir Ralph Lilley Turner MC created what type of book based on Proto-Indo-Aryan language also known as Proto-Indic language?",
        "response": "Indo-Aryan comparative dictionary",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the debut single of the \"Babooshka\" singer and Larry Adler collaborator?",
        "response": "Wuthering Heights",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the treaty that disestablished Karasi Sanjak as one of the first sanjaks of the Ottoman Empire signed?",
        "response": "Palais de Rumine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university,  Université Laval or Clarkson University is a private research university with its main campus located in Potsdam, New York, and additional graduate program and research facilities in New York State's Capital Region and Beacon, N.Y.?",
        "response": "Clarkson University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the the \"Billboard\" 200 where \"Vice Verses\" debuted at number 8?",
        "response": "record chart ranking the 200 most popular music albums",
        "source": "hotpot_qa"
    },
    {
        "query": "2-year-old Paul Flatley of Northwestern University was named the NFL's Rookie of the Year by what press organization?",
        "response": "Associated Press",
        "source": "hotpot_qa"
    },
    {
        "query": "Darel McKinney was among the U.S. Marines decorated for his actions during the Battle of Belleau Wood in the spring of 1918. In which country did it take place?",
        "response": "France",
        "source": "hotpot_qa"
    },
    {
        "query": "Eagle Food Centers operated under which name, owned by Lucky Stores?",
        "response": "Gemco",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the collaborator of Owen Chamberlain in the work for which he received his Nobel prize ?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Demetress Carte Bell, is the alleged son of a former basketball star that played for the Utah Jazz and went by what nickname?",
        "response": "The Mailman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the bands \"Halestorm\" and \"Say Anything\" from different states?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Maggie O'Neill appeared in the 1988 drama film directed by whom?",
        "response": "Michael Apted",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the keyboardist and songwriter who formed the electronic music group whose fifth studio album was Invaders Must Die?",
        "response": "Liam Howlett",
        "source": "hotpot_qa"
    },
    {
        "query": "What Irish footballer joined Pacific Films in 1950?",
        "response": "John Francis O'Shea",
        "source": "hotpot_qa"
    },
    {
        "query": "Oasys Mobile develops games for a former Dominican-American baseball player under which brand name?",
        "response": "A-Rod",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the English footballer and manager who scored for Everton in 1970 FA Charity Shield born? ",
        "response": "22 May 1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of category does Obregonia and Cymbidium have in common?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Emeric Pressburger and Richard C. Sarafian in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Gummibar is most notable for a novelty dance song that was first released in Hungary, and was written by who?",
        "response": "Christian Schneider",
        "source": "hotpot_qa"
    },
    {
        "query": "Erich Kempka burned the remains of what tyrant and his wife?",
        "response": "Adolf Hitler",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Brian Hunter play for that had a home ballpark called Safeco Field?",
        "response": "Seattle Mariners",
        "source": "hotpot_qa"
    },
    {
        "query": "Does David Winning, or Takashi Miike have a wider range of genre for film?",
        "response": "Takashi Miike",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is Big Cass' girlfriend?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What band was formed by Oregon native Kat Bjelland, Joanna Newsom or Babes in Toyland?",
        "response": "Babes in Toyland",
        "source": "hotpot_qa"
    },
    {
        "query": "Brenda VanLengen is the primary analyst for which basket ball team coached by Brandon Schneider?",
        "response": "Kansas Jayhawks",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a Spanish professional footballer who plays a right winger for a Spanish football team based in Madrid?",
        "response": "Juan Moreno Fernández",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Luke Tasker's father begin his college career?",
        "response": "Dodge City Community College",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the series that Samuel Nascimento  is known for filmed?",
        "response": "Buenos Aires, Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actress was a young star of the BBC's \"The Lady Vanishes,\" and appears in the Netflix series Sense8?",
        "response": "Tuppence Middleton",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Prime Minister of the United Kingdom whose book a thesis by John F Kennedy alludes to?",
        "response": "Winston Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "Are these both in the Üsküdar district of Istanbul, Fethi Paşa Korusu and Yeni Valide Mosque?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Arcus Foundation is a charitable foundation focused on issues related to, which laws, affecting lesbian, gay, bisexual, and transgender (LGBT) people vary greatly by country or territory—everything from legal recognition of same-sex marriage or other types of partnerships, to the death penalty as punishment for same-sex romantic/sexual activity or identity?",
        "response": "LGBT rights",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary film was released first, Super High Me or Quantum Hoops?",
        "response": "Quantum Hoops",
        "source": "hotpot_qa"
    },
    {
        "query": "This 72-78 passenger aircraft has parking spaces at Nakhon Si Thammarat Airport, which is how many square meters?",
        "response": "Total space, 2,902,400 square meters",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Basil Dean and Francis Ford Coppola both alive at some point in time?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What writer-artist created the character who is trying to amass Infinity Stones in Avengers: Infinity War?",
        "response": "Jim Starlin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2009 British thriller film starring the actor who is best known for playing Robert Crawley in \"Downtown Abbey\"?",
        "response": "Anthony Hickox",
        "source": "hotpot_qa"
    },
    {
        "query": "What company introduced a digital music workstation in 1992 and is the world's largest piano manufacturing company? A: Yamaha Corporation ",
        "response": "Yamaha Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What airline operates United Club as well as a regional airline?",
        "response": "United Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seat of the county where Sugarloaf Regional Airport is located?",
        "response": "Farmington",
        "source": "hotpot_qa"
    },
    {
        "query": "Jolanta Dickute's party includes which Russian-born businessman?",
        "response": "Viktor Uspaskich",
        "source": "hotpot_qa"
    },
    {
        "query": "Tell Me You Love Me Deluxe Version features an acoustic version of this song",
        "response": "Sorry Not Sorry",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did Kathryn Grayson star in with Frank Sinatra the 4 years before \"The Kissing Bandit?\"",
        "response": "Anchors Aweigh",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of this German multinational automotive corporation, which includes Mercedes-Benz buses?",
        "response": "Stuttgart",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays a stockbroker in a film that Claire Simpson was an editor for?",
        "response": "Charlie Sheen",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Andre Agassi and Piet Norval both tennis players?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How many golden also did Jan Tauren win at the Far eastern Championship games?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show which aired on NBC from September 22, 1994, to May 6, 2004, has the fifteenth episode entitled, \"The One with the Girl Who Hits Joey\"?",
        "response": "Friends",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the influential singer who co-released an album with the Band born?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Durolevum was a Roman settlement in which country, the only surviving mention of it from antiquity appears in the Antonine Itinerary, where it forms part of the Roman equivalent of Watling Street, a route in England and Wales that began as an ancient trackway first used by the Britons, mainly between the areas of modern Canterbury and St Albans using a natural ford near Westminster?",
        "response": "Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Pseudo-Ingulf write that is an important primary source for English medieval history, particularly the late 15th century?",
        "response": "Croyland Chronicle",
        "source": "hotpot_qa"
    },
    {
        "query": "What word is in both paragraphs?",
        "response": "in",
        "source": "hotpot_qa"
    },
    {
        "query": "Jingming Garden is an imperial garden on the Jade Spring Hill west of a palace that covers how many kilometers ?",
        "response": "2.9 km2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American rapper worked with Dr. Dre on a song with a similar theme to \"Forgot About Dre?\"",
        "response": "Snoop Dogg",
        "source": "hotpot_qa"
    },
    {
        "query": "The Flower Boy album by rapper Tyler featured what Norwegian artist known for her \"soft, soul-bearing electro-pop\"?",
        "response": "Anna of the North",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an Italian film and stage director of literate sensibility, known for his masterly handling of period subject matter, Frank Miller or Mauro Bolognini ?",
        "response": "Mauro Bolognini",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Queen of Katwe and The Odd Life of Timothy Green have the same director?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 90 runs along which east-west limited-access toll highway in the U.S. state of Ohio?",
        "response": "Ohio Turnpike",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Pakistani singer sun the Theme Song 'Agar Shukk Dil Mein Ajaye' ",
        "response": "Nabeel Shaukat Ali",
        "source": "hotpot_qa"
    },
    {
        "query": "The 357th Fighter Squadron (357 FS) is part of the 355th Fighter Wing at Davis-Monthan Air Force Base, Arizona, it operates which The 357th Fighter Squadron (357 FS) is part of the 355th Fighter Wing at Davis-Monthan Air Force Base, Arizona??",
        "response": "Fairchild Republic A-10 Thunderbolt II",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who won the competition that names the Miss USA representative from Hawaii in 1993 first starred on what American soap opera?",
        "response": "Sunset Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the musician who was photographed on the day he was assassinated by Annie Leibovitz shot dead?",
        "response": "1980",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does PJ Harvey and The Last Shadow Puppets have in common?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": " Éanna Ryan was born in a county situated in which Irish province ?",
        "response": "Connacht",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the editor of US Tatler take American citizenship",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born in 1936 and committed the Massacre of Braybrook Street?",
        "response": "Harry Roberts",
        "source": "hotpot_qa"
    },
    {
        "query": "Sophie Turner made her debut as the character from the A Song of Ice and Fire series created byt whom?",
        "response": "George R. R. Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Jörg Schelling served under which chairman of the Social Democratic Party of Austria?",
        "response": "Werner Faymann",
        "source": "hotpot_qa"
    },
    {
        "query": "What tribal president of the Northern Cheyenne founded the community college named after Miniconjou Lakota chief Lame Deer?",
        "response": "John Woodenlegs",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the father of Maurizio D'Ancora born?",
        "response": "1881",
        "source": "hotpot_qa"
    },
    {
        "query": "The Curse of the Cat People is the sequel to the 1942 film directed by whom",
        "response": "Jacques Tourneur",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the rank of the incumbent that RJ Harris challenged in 2010?",
        "response": "the fourth-ranking Republican leader in the House",
        "source": "hotpot_qa"
    },
    {
        "query": "5 fold diffraction pattern symmetries were discovered in 1982 by dan shechtman when he discovered this phase which opened new field of study in quasiperiodic crystals",
        "response": "icosahedral phase",
        "source": "hotpot_qa"
    },
    {
        "query": "Italian professional dancer, Flavia Cacace, performed on \"Strictly Come Dancing\" with her partner who was born on what day?",
        "response": "born 15 March 1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed first Tame Impala or The Darling Buds ?",
        "response": "The Darling Buds",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of the Ordinary was a book by the author whose 2004 nonfiction work was a companion to a TV series broadcast on what British network?",
        "response": "Channel 4",
        "source": "hotpot_qa"
    },
    {
        "query": "The Westside Pavilion is anchored by a Macy's, formerly and later called which subsidiary of The May Department Stores Company, having been acquired with Federated's takeover of The May Department Stores Company on August 30, 2005?",
        "response": "Robinsons-May",
        "source": "hotpot_qa"
    },
    {
        "query": "First opened in 1988, the Wolvering Wildcat is a wooden roller coaster located within which 250 acre amusement park in Muskegon County, Michigan?",
        "response": "Michigan's Adventure",
        "source": "hotpot_qa"
    },
    {
        "query": "Who currently publishes the American science fiction magazine in which Impossible Dreams by Tim Pratt was first published?",
        "response": "Penny Publications",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the director of Pretty Ugly People born? ",
        "response": "June 3, 1969",
        "source": "hotpot_qa"
    },
    {
        "query": "The Boeing 377 Stratocruiser was a large long-range airliner developed from the C-97 Stratofreighter military transport, itself a derivative of which four-engine propeller-driven heavy bomber designed by Boeing, which was flown primarily by the United States during World War II and the Korean War?",
        "response": "Boeing B-29 Superfortress",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sania Mirza and Michaël Llodra both professional tennis players ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is still living, Martin McDonagh or Ingmar Bergman?",
        "response": "Martin McDonagh",
        "source": "hotpot_qa"
    },
    {
        "query": "AKS Lytham was formed from the merger of King Edwards VII and Queen Mary School and which independent school in Blackpool, Lancashire, England?",
        "response": "Arnold School",
        "source": "hotpot_qa"
    },
    {
        "query": "What movement was the the person referred to as Mumia part of?",
        "response": "black nationalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Waylon Smithers, often referred to as Mr. Smithers, debuted in the January 21, 1990 episode of The Simpsons as the personal assistant to which Springfield Nuclear Power Plant owner?",
        "response": "Mr. Burns",
        "source": "hotpot_qa"
    },
    {
        "query": "Not Alone, is Zhang Liyin's which number overall single, Zhang held a showcase to support the release of the single, which was held at the Century Theater in Beijing, EXO members Tao and Chen were guests, Exois a South Korean-Chinese boy group based in Seoul? ",
        "response": "fourth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a genus of Australian shrubs, Anemonopsis or Westringia? ",
        "response": "Westringia",
        "source": "hotpot_qa"
    },
    {
        "query": "Sylvania is a fictional land of dark forests in the \"Warhammer Fantasy\" which is home to vampires, ghouls, and other beings, Warhammer Fantasy is a high fantasy fictional universe created by who?",
        "response": "Games Workshop",
        "source": "hotpot_qa"
    },
    {
        "query": "Carlos Kasuga Osaka is the founder of the Mexican division of which probiotic dairy product made by fermenting a mixture of skimmed milk with a special strain of the bacterium \"Lactobacillus casei\" Shirota?",
        "response": "Yakult",
        "source": "hotpot_qa"
    },
    {
        "query": "Who lived a longer life Hampar Kelikian or Arthur T. Gregorian?",
        "response": "Arthur T. Gregorian",
        "source": "hotpot_qa"
    },
    {
        "query": "Strangers' Meeting stars an actress born in what year?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first publication date for the journal that Tom Baehr-Jones was published in?",
        "response": "4 November 1869",
        "source": "hotpot_qa"
    },
    {
        "query": "Which form of entertainment is offered by Regina Spektor, a Russian-American and Bombay Bicycle Club, consisting of Jack Steadman, Jamie MacColl, Suren de Saram and Ed Nash, from London?",
        "response": "music",
        "source": "hotpot_qa"
    },
    {
        "query": "How long did it take to write the album \"Physical Graffiti\"?",
        "response": "over a period of three years",
        "source": "hotpot_qa"
    },
    {
        "query": "What military officer and later de facto ruler of Panama was pen pal of Sarah York?",
        "response": "Manuel Noriega",
        "source": "hotpot_qa"
    },
    {
        "query": "Both The Devil and Daniel Johnston and Anvil! The Story of Anvil are films about what type of people?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Do theflowering plants Hypoxis and Monarda belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Fritz Johann Hansgirg worked with an American industrialist who established the Kaiser Shipyards, which build Liberty ships during what war?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What 147 mile long river is dammed by the Apalachia Dam?",
        "response": "Hiwassee River",
        "source": "hotpot_qa"
    },
    {
        "query": "The word Consigliere was popularized by a novel written by which author ?",
        "response": "Mario Puzo",
        "source": "hotpot_qa"
    },
    {
        "query": "Elaeocarpus and Hardenbergia, are found in which mutual country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": " Which Restoration Movement leader was born in 1796 and was closely affiliated with Mahoning Baptist Association?",
        "response": "Walter Scott",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the scientist who invented in Tribometer?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie starring Russell Crow was about the world heavyweight boxing champion from 1935 to 1937?",
        "response": "Cinderella Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Phil Regan was nicknamed \"The Vulture\" by the pitcher who played 12 seasons for which teams?",
        "response": "Brooklyn/Los Angeles Dodgers",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Arvid E. Gillstrom and Nagisa Oshima both film director and screenwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The team Scott Marr coaches is in what University Division?",
        "response": "NCAA Division I",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Libocedrus and Helianthus both types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town where Joy Far is?",
        "response": "2,502",
        "source": "hotpot_qa"
    },
    {
        "query": "Ocean's 11 co-starred the American who was a member of what New York-based group of entertainers?",
        "response": "Rat Pack",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the polar region that Purcell Bay is located?",
        "response": "the northernmost part of Earth",
        "source": "hotpot_qa"
    },
    {
        "query": "A movie about an elderly man named Carl Fredricksen was directed by a director who has been nominated for how many Oscars?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "What son of Grand Duke Lithuania Kęstutis went on to defeat Švitrigaila and his Livonian allies?",
        "response": "Sigismund Kęstutaitis",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in the 1991 American action comedy film The Hard Way and was featured on the roster of Rawkus Records?",
        "response": "Mos Def",
        "source": "hotpot_qa"
    },
    {
        "query": "Who stared in \"How to Marry a Billionaire: A Christmas Tale\" and \"Full House\"?",
        "response": "John Stamos",
        "source": "hotpot_qa"
    },
    {
        "query": "The Root–Takahira Agreement involved the lawyer who served as Secretary of State under which President?",
        "response": "Theodore Roosevelt",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is located farther south in China, Lingwu or Changsha?",
        "response": "Changsha",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 TCU Horned Frogs football team won a share of the Big 12 title with who?",
        "response": "2014 Baylor Bears football team",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the tour for Ariana Grande's album originally titled \"Moonlight\" conclude?",
        "response": "Hong Kong.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Albany International Airport and Louisville International Airport both public airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which National Football League was Brian Smith a member of that conducts summer training camp at St. John Fisher College?",
        "response": "Buffalo Bills",
        "source": "hotpot_qa"
    },
    {
        "query": " Which band, Mayday Parade or Killing Joke, is an American rock band?",
        "response": "Mayday Parade",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bangor and Aroostook Railroad brought rail service to which state?",
        "response": "in northern Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did the 23rd overall pick of the 2015 NHL Entry Draft helped the United States national junior team win a bronze medal?",
        "response": "Helsinki, Finland",
        "source": "hotpot_qa"
    },
    {
        "query": "Gen. John Stark House was acquired by what textile manufacturer which founded Manchester, New Hampshire",
        "response": "Amoskeag Manufacturing Company",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the german songwriter, singer, musician and producer born who produced X-Ten?",
        "response": "7 February 1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Ryo Kawakita and Dave Peters are both what?",
        "response": "guitarist",
        "source": "hotpot_qa"
    },
    {
        "query": "When was American actress and producer who featured inThe Titan on the Tracks born ",
        "response": "October 11, 1976",
        "source": "hotpot_qa"
    },
    {
        "query": "Brutus is a pioneering funny car driven by a drag racer known as what?",
        "response": "Jungle Jim",
        "source": "hotpot_qa"
    },
    {
        "query": "The England cricket team visited Ireland on 8 May 2015 for a single tournament, titled what, in February 2015, the England and Wales Cricket Board (ECB) confirmed that the current Irish cricketer who captains the England cricket team?",
        "response": "One Day International (ODI)",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor from Northern Ireland born in 1983 starred in Whole Lotta Sole?",
        "response": "Martin \"Marty\" McCann",
        "source": "hotpot_qa"
    },
    {
        "query": "Leonardus (Leo) Petrus Beukeboom, is a signpainter and lettering artist from De Pijp, in which country, after completing his courses in 1962, Beukeboom worked trivial jobs until 1967 when he began working as a freelance signpainter, almost exclusively for Heineken International, an Amsterdam-based group which owns a worldwide portfolio of over 170 beer brands, mainly pale lager, though some other beer styles are produced?",
        "response": "Amsterdam",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one is belonging to the genus of plants in the grass family, Ginseng or Cynodon?",
        "response": "Cynodon",
        "source": "hotpot_qa"
    },
    {
        "query": "Ponte Punta Penna Pizzone was named in honored of an assassinated Italian politician who died in what year?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical instrument did Jasen Rauch play for the band he left?",
        "response": "drummer",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress, born on June 22, 1949 stars in the television series \"Thicker than Water\"?",
        "response": "Lindsay Wagner",
        "source": "hotpot_qa"
    },
    {
        "query": "On which Expedition did Clayton Anderson replace Sunita Williams? ",
        "response": "Expedition 15",
        "source": "hotpot_qa"
    },
    {
        "query": "What system was used to form the Uppiliyapuram constituency in India in 1996?",
        "response": "system of reservation in India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which award David Hersey had got for Equus a play by Peter Shaffer ?",
        "response": "Outstanding Lighting Design",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Woolcott, is an Australian public servant and diplomat and the designated Chief of Staff to the 29th, and current Prime Minister of Australia Malcolm Turnbull, commencing on which date?",
        "response": "4 September 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Akihiro Gono is one of only four men to defeat the Mixed Martial Artist who has what nationality?",
        "response": "Cuban-Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did a Gold Diggers of 1933 actress, Ruby Keeler, make a comeback on Broadway in? ",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do Fran Healy and Jung Yong-hwa have in common?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Tina in the Sky with Diamonds\" is the second episode of the fifth season of a television series created by who ?",
        "response": "Ryan Murphy, Brad Falchuk, and Ian Brennan",
        "source": "hotpot_qa"
    },
    {
        "query": "Bertha \"Beatrice\" Alexander Behrman, known as Madame Alexander, was an American dollmaker, among her notable creations were which doll of a fictional character and the main protagonist in Margaret Mitchell's 1936 novel \"Gone with the Wind\" and in the later film of the same name?",
        "response": "Scarlett O'Hara",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Tracy led this American World Cup alpine ski racer born in what year to medals in the Vancouver winter olympics",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which songwriting duo composed music for \"La La Land\", and created lyrics for \"A Christmas Story: The Musical\"? ",
        "response": "Pasek & Paul",
        "source": "hotpot_qa"
    },
    {
        "query": "Parramatta State School is located on Mulgrave Road and Cairns is a city in the Cairns Region, Queensland are located in what country?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Who built the both the Union Church of Pocantico Hills and and Kykuit?",
        "response": "John D. Rockefeller",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of first contractor of the oldest railroad in the United States' son, who became a pioneer in American Baseball?",
        "response": "Arthur Pue Gorman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building is taller Bertelsmann Building or 432 Park Avenue?",
        "response": "432 Park Avenue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of this 1961 American musical romantic drama film directed by Robert Wise and Jerome Robbins whose songs were used in Oscar Peterson and his trio's 1962 album of the same name?",
        "response": "West Side Story",
        "source": "hotpot_qa"
    },
    {
        "query": "who did Hillary Rodham Clinton run against in her last senate election ?",
        "response": "John Spencer",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to Donalbain, who else is a son of King Duncan in Shakespeare's Macbeth?",
        "response": "Malcolm",
        "source": "hotpot_qa"
    },
    {
        "query": "Lost Kingdom Adventure is a dark ride located at four Legoland theme parks, including which park, which is the original Legoland park, that was opened on June 7th, 1968?",
        "response": "Legoland Billund",
        "source": "hotpot_qa"
    },
    {
        "query": "How many novels did Cecelia Ahern write before \"Where Rainbows End,\" a book made adapted into the movie \"Love, Rosie?\"",
        "response": "1",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the part of the Marquis de Sade in the film for which Martin Childs was nominated for an award at the 74th Academy Awards?",
        "response": "Geoffrey Rush",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed first,  The Rockfords or Radio Iodine?",
        "response": "Radio Iodine",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Anglo-Français de Petite Vénerie and Hawaiian Poi Dog extinct breeds of dogs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of film was the film who featured Auli'i Cravalho?",
        "response": "3D computer-animated musical fantasy-adventure film",
        "source": "hotpot_qa"
    },
    {
        "query": "Grand Canyon Scenic Airlines operates sightseeing flights from an airport in what county?",
        "response": "Clark County",
        "source": "hotpot_qa"
    },
    {
        "query": "During what date range was the Cannes Film Festival held when the French drama film \"Mercenary\" won the Europa Cinemas Label Award?",
        "response": "11 to 22 May 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Claude Debussy and Emmanuel Chabrier have in common?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "Hong Kong Macau cultural exchange was a trip that tested which law who's purpose was to fulfil Article 23 of the Macau Basic Law?",
        "response": "Macau national security law",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hot Rock is the fourth studio album by a band that formed in what year?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Sapsali and Staffordshire Bull Terrier a breed of dog?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the regional airline based that Jim French is the former chairman and CEO of?",
        "response": "Exeter",
        "source": "hotpot_qa"
    },
    {
        "query": "When was British television journalist, newsreader and host of the current affairs programme Real Story, born?",
        "response": "born 25 April 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the New Brunswick band that Mike Crossey has produced records for form?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What comedy troupe are the stars of Sweet part of?",
        "response": "Mighty Boosh",
        "source": "hotpot_qa"
    },
    {
        "query": " \"With a Little Help from My Friends\" is a song by the Beatles, written by which English singer-songwriter, multi-instrumentalist, and composer, from the album \"Sgt. Pepper's Lonely Hearts Club Band\" issued worldwide in June 1967?",
        "response": "James Paul McCartney",
        "source": "hotpot_qa"
    },
    {
        "query": "Name one of Bob Dylan's most-performed live songs, that is said to be inspired by the Prospect Park Water Tower in Minneapolis.",
        "response": "All Along the Watchtower",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of the event that occurred first, Residual Kid was formed or Peter Murphy was born?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "The North Pacific albatross are the most tropical of the albatrosses with two species one of which primarily lives in the Northwestern Hawaiian Islands with an estimated population of how many?",
        "response": "2.5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Which quarterback born on October 13, 1987 was Cody Hodges predecessor?",
        "response": "Taylor Potts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Tony Crocker's basketball coach at the University of Oklahoma play for when he was in college?",
        "response": "Duke University",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Royal Republic and Alpha Rev both from America?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Golden Hind was captained by which English sea captain and privateer of the Elizabethan era?",
        "response": "Francis Drake",
        "source": "hotpot_qa"
    },
    {
        "query": "What English keyboardist/guitarist was a member of Chicken Shack?",
        "response": "Paul Raymond",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Lewis Mumford and Truman Capote share the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Luigi Cherubini and Antonio Salieri, were Italian of which occupation?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What do German's Klaus-Dietrich Flade and Ernst Messerschmid have in common?",
        "response": "astronaut",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital opened first, Walter Reed Army Medical Center or St. Elizabeths Hospital?",
        "response": "St. Elizabeths Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "In \"The Brotherhood\" Anthony Marciona played the godson of an an actor that had his debut appearance in what film?",
        "response": "The Strange Love of Martha Ivers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Those Calloways or The Happiest Millionaire?",
        "response": "Those Calloways",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wisconsin Badgers football team has had a Heisman winner in the player with what nickname?",
        "response": "The Iron Horse",
        "source": "hotpot_qa"
    },
    {
        "query": "What racer won a race at the 2001 Target Grand Prix of Chicago survived one of the racing sport's biggest accidents in Fort Worth Texas, in 2003?",
        "response": "Kenny Bräck",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both  Trey Anastasio and Terri Nunn an American musician?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer is from Chile, Pablo Neruda or Lincoln Steffens?",
        "response": "Pablo Neruda",
        "source": "hotpot_qa"
    },
    {
        "query": "Which institution is women only: Texas Christian University or Wellesley College?",
        "response": "Wellesley College",
        "source": "hotpot_qa"
    },
    {
        "query": "From what Tehuelche word does the name of the province where Bahía Bustamante is located derive from?",
        "response": "chupat",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director and screenwriter, André Berthomieu or Derek Yee, was formally an actor?",
        "response": "Derek Yee",
        "source": "hotpot_qa"
    },
    {
        "query": "The winning jockey of the 1997 Cheltenham Gold Cup held a record for winner of what award 20 consecutive times?",
        "response": "Champion Jockey",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of dramatic work does Tom Bosley and Fiorello! have in common?",
        "response": "musical",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is about Iraq, The Ten-Year Lunch or Gunner Palace?",
        "response": "Gunner Palace",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the University that Clive Baldock received his Masters of Tertiary Education Management degree from founded?",
        "response": "1853",
        "source": "hotpot_qa"
    },
    {
        "query": "Zoop is a puzzle game developed by Hookstone Productions and published by Viacom New Media, official \"Zoop\" games have been released, including for the Macintosh ( ; (branded as Mac since 1998) is a series of personal computers (PCs) designed, developed, and marketed by who?",
        "response": "Apple Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the original name of the wrestler who was featured in the Extreme Championship Wrestling that had won ECW Tag Team Champion?",
        "response": "Jonathan Rechner",
        "source": "hotpot_qa"
    },
    {
        "query": "To Kingdom Come: The Definitive Collection is an anthology by Canadian-American rock band the Band, released in which year, the group's better-known song, is \"The Weight\"?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "When was actor who portrayed the owner of the Southfork Ranch in the soap opera, \"Dallas,\" born?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Mariya Matveyevna Stepanova created the leading soprano role in which opera based on a 1820 poem?",
        "response": "Ruslan and Lyudmila",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the early theologian who has rejected the idea of no-limit omnipotence ?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "In what War was Prince Christoph of Hesse accidentally killed?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What American Baptist minister and activist led a movement organized in early 1963 by the Southern Christian Leadership Conference?",
        "response": "Martin Luther King Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas \"Tom\" John Ypsilantis was known for the co-discovery of the antiproton along with an Italian physicist who was awarded what in 1959?",
        "response": "Nobel Prize in Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "What Korean film-maker was known for writing and directing \"2046\"?",
        "response": "Wong Kar-wai",
        "source": "hotpot_qa"
    },
    {
        "query": "The Carl Albert Congressional Research and Studies Center is located in a city that had how many inhabitants in 2015 ?",
        "response": "120,284",
        "source": "hotpot_qa"
    },
    {
        "query": "The North Bolivar Consolidated School District is headquartered in what city in Bolivar County, Mississippi that had a population of 1533 at the 2010 census?",
        "response": "Mound Bayou",
        "source": "hotpot_qa"
    },
    {
        "query": "How much area does the complex that housed Librairie de France, in New York City, cover?",
        "response": "22 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Alan Alda and Raoul Walsh both actors and directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How far by road is Chris Nielsen's birth city from Frederikshavn?",
        "response": "64 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Harold von Braunhut was the creator and marketer of a group of crustaceans that undergo what process?",
        "response": "cryptobiosis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Mike Coffman's title after being replaced as secretary of state by Bernie Buescher?",
        "response": "U.S. Representative for Colorado 's 6 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus is native to western North America, Purshia or Bulbinella?",
        "response": "Purshia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the financial group which created the Sporting Portugal Fund?",
        "response": "Espírito Santo Financial Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper featured as a guest on the song \"Bandz a Make Her Dance\" joined the label Cash Money Records at the age of nine?",
        "response": "Lil Wayne",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the four-piece indie rock band, that joined The Killers on the Christmas song ¡Happy Birthday Guadalupe! formed?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years did the subject of the album Nude hold out after World War II ended?",
        "response": "29 years",
        "source": "hotpot_qa"
    },
    {
        "query": "A wide receiver for the Toronto Argonauts played college football for a team that represents the University of Oklahoma, which belongs to what conference?",
        "response": "Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "13th Age is a d20 fantasy tabletop role-playing game produced by Pelgrane Press Ltd, a British role-playing game publishing company based where?",
        "response": "in London",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Larry Baker and Lionel Trilling from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Papercutz has begun publishing English translations of what Belgian comic franchise?",
        "response": "The Smurfs",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Balsamorhiza and Moltkia flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is older the University of Jordan or Virginia Commonwealth University?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "Queen are a British rock band that formed in London, which British singer, songwriter and record producer, was known as the lead vocalist?",
        "response": "Farrokh \"Freddie\" Mercury",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this performer, who studied at CAP21 through New York University's Tisch School of the arts before dropping out, and whose video Poker Face was featured on WH1's Top 40 Videos of the Year?",
        "response": "Lady Gaga",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the person played by Phillip Bullock in Jersey Boys born?",
        "response": "1927",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger Stanley Kwan or Atom Egoyan?",
        "response": "Atom Egoyan",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the church St James railway station is named after first consecrated?",
        "response": "February 1824",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor tha plays Jules Maigret in the ITV serial \"Maigret\" plays a supporting role in a 2003 film starring Dylan Moran that was directed by who?",
        "response": "Conor McPherson",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Elm or Draba part of the cabbage family?",
        "response": "Draba",
        "source": "hotpot_qa"
    },
    {
        "query": "The president that signed a new Railway Labor Act in 1926 was a lawyer from what state?",
        "response": "Vermont",
        "source": "hotpot_qa"
    },
    {
        "query": "What science fiction novel about the murder of a major Union politician and scientist was written by Carolyn Janice Cherry?",
        "response": "Cyteen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an astrophysicist for the European Space Agency, Dirk Frimout or Georgi Ivanov?",
        "response": "Dirk Dries David Damiaan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Busitema University and Alexandria University both public universities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What author died at an earlier time, Mary McCarthy or Henry Miller?",
        "response": "Henry Valentine Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American journalist and has been Literary Editor of \"The Weekly Standard,\",  Philip Terzian or Derek Sherinian",
        "response": "Philip Henry Terzian",
        "source": "hotpot_qa"
    },
    {
        "query": "The pianist, music critic, and teacher Olga Samaroff married for the second time this English conductor of Jewish-Polish and Irish descent who appeared in which film?",
        "response": "Fantasia",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the chancellor of the State University System of Florida E.T. York born in?",
        "response": "1922",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these Disney productions was released earlier--The Three Caballeros or The Monkey's Uncle?  ",
        "response": "The Three Caballeros",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the writer of the 2003 Indian erotic thriller film who sequel is Jism 2?",
        "response": "Mahesh Bhatt",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the player who made his debut for the Los Angeles Rams against the New York Giants on November 11, 1990 born ?",
        "response": "May 22, 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the international airport which Eagle Aviation wet lease operations were based in located ",
        "response": "France.",
        "source": "hotpot_qa"
    },
    {
        "query": "German Hound and Samoyed are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who murdered 12 year old Tina Marie Harmon in 1981 and was convicted in 2010 because of DNA evidence from her rape matching this individual and whom also murdered 11 year old Krista Lea Harrison and was convicted of her murder on July 17, 1982?",
        "response": "Robert Anthony Buell",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Kendall plays Lauren Turner on a soap opera created by who?",
        "response": "Reg Watson",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the author, who wrote \"The Weapon Master's Choice\" publish his first series?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "What do King Roger and La donna del lago have in common?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Noah Lomax played the part of Lewis in a film directed by who ?",
        "response": "Gabriele Muccino",
        "source": "hotpot_qa"
    },
    {
        "query": "The western suburbs near a coastal suburb of Adelaide, South Australia located in the City of Charles Sturt, is home to what ?",
        "response": "Royal Adelaide Golf Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport was played by both František Čermák and John Austin?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Jamshed Bharucha is President Emeritus of a privately funded college in Manhattan, that origimanally granted each admitted student a full tuition scholarship, but abandoned that when?",
        "response": "Fall of 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Olympic Gold Medal did the player who is featured in the documentary More Than a Game win ?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rippling Blossom features an actress who works under what Hong Kong entity?",
        "response": "Television Broadcast Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "What fictional universe is aired on the CW for The Flash?",
        "response": "Arrowverse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played roles in Three's Company and One Summer Love?",
        "response": "Ann Wedgeworth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building has more stories, the MetLife Building or the General Motors Building?",
        "response": "MetLife Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Young Sheldon, the tv series that follows the character Sheldon Cooper at the age of 9, is a spin-off from what prequel?",
        "response": "\"The Big Bang Theory\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the family the writer of The Beastly Bombing  made a documentary about from?",
        "response": "Boone County, West Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which structure currently operates as a \"virtual fence:\"  Boarder Wall or Mexico-United States Barrier?",
        "response": "Mexico–United States barrier",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Actor stared in \"Revenge of the Ninja\" and was a former Golden Gloves boxing champion? ",
        "response": "Virgil Frye",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of both Cassadee Pope and Park So-yeon?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "What carrier did the ship whose mast is in The Eastern Promenade support during the initial phase of the Guadalcanal Campaign?",
        "response": "Enterprise",
        "source": "hotpot_qa"
    },
    {
        "query": "Bill McCollum took a leadership role in the Senate trial that began on which date?",
        "response": "December 19, 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer first published their work, Emma Goldman or Peter Straub?",
        "response": "Emma Goldman",
        "source": "hotpot_qa"
    },
    {
        "query": "The hit single \"The Best Is Yet To Come\" was featured on which motion picture soundtrack starring Kim Basinger?",
        "response": "9½ Weeks",
        "source": "hotpot_qa"
    },
    {
        "query": "Mmm Papi has a Latin pop influence, similar to what song by Madonna that was co-written and co-produced by her and Patrick Leonard?",
        "response": "La Isla Bonita",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Australian Legal Information Institute founded in its current form?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfred Wegener, the German polar researcher, had an impact crater named after him where?",
        "response": "Mars",
        "source": "hotpot_qa"
    },
    {
        "query": "What years did the hotel and casino operated that Jack Entratter manage positions for in Las Vegas?",
        "response": "1952 to 1996",
        "source": "hotpot_qa"
    },
    {
        "query": "Which indoor arena located on the corner of North 4th and West State Streets in Milwalkee, Wisconsion hosed the 2008 McDonald's All-American Boys Game?",
        "response": "Bradley Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the book from which the movie was adapted that Elliot Goldenthal won the Academy Award for Best Original Score in 2002 for?",
        "response": "Hayden Herrera",
        "source": "hotpot_qa"
    },
    {
        "query": "On which street is the sister venue of Plowright Theatre in Scunthorpe, North Lincolnshire located?",
        "response": "Doncaster Road",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Memorial Stadium located in Columbia, Missouri, United States where Missouri Tigers football team played their home game in 2003?",
        "response": "Faurot Field",
        "source": "hotpot_qa"
    },
    {
        "query": "The novel version of the film in which Reece Thompson appeared as \"Craig\" was released in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "The eastern terminus of Grand Junction Road is in the suburb of Hope Valley, at the intersection of Hancock Road and Lower North East Road, just before the latter proceeds into the Adelaide Hills, past a park managed by a what volunteer group? ",
        "response": "The Friends of Anstey Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Are University of Maryland, College Park and Lipscomb University in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "During what years did the american comedian who starred with Greta Gerwig, Ethan Hawke, Maya Rudolph, Travis Fimmel, Wallace Shawn, Ida Rohatyn, Monte Greene, and Julianne Moore in \"Maggies's Plan\", appear on \"Saturday Night Live\"?",
        "response": "2005–2013",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hawaiians thought an extinct breed of pariah dog, other than human consumption of the flesh and other edible parts derived from dogs, were what ?",
        "response": "spiritual protector",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years was the man who was the new head coach of the St. Louis Rams in 2006, a college assistant coach ?",
        "response": "13 seasons.",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Simone de Beauvoir and Bob Monkhouse both comedians?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Arvid E. Gillstrom or Herbert Achternbusch?",
        "response": "Arvid E. Gillstrom",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Klassen, a self-described white separatist and an American religious leader who founded the Church of the Creator, founded what pantheistic white separatist new religious movement which has been classified as a hate group by the Southern Poverty Law Center?",
        "response": "Creativity",
        "source": "hotpot_qa"
    },
    {
        "query": "Dartmouth Big Green men's ice hockey play their games at the arena in what New Hampshire city?",
        "response": "Hanover",
        "source": "hotpot_qa"
    },
    {
        "query": "Kurt Fuller from Stockton, CA appeared in which American Detective Comedy Drama television series created by Steve Franks?",
        "response": "Psych is an American detective comedy-drama",
        "source": "hotpot_qa"
    },
    {
        "query": "What league, which is also known as the Barclays Premier League, had its start date pushed back?",
        "response": "The 2013–14 Premier League",
        "source": "hotpot_qa"
    },
    {
        "query": "The battle in which Engenulf, Lord of Laigle died was fought against which Anglo-Saxon king?",
        "response": "King Harold Godwinson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the director and actor with success that led to work on a film which follows a group of friends who discover an alien invasion during an epic pub crawl?",
        "response": "Cal McCrystal",
        "source": "hotpot_qa"
    },
    {
        "query": "What relationship did the inventors of the technique through which plywood can be bent in three dimensions have?",
        "response": "husband and wife",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Call Me Mañana\" is a song by a group that has sold how many records?",
        "response": "over 30 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the punter for the Dallas Cowboys in the 1980s play college football?",
        "response": "Arizona State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Holston River joins up at Knoxville with which river that begins in Transylvania County, North Carolina? ",
        "response": "French Broad River",
        "source": "hotpot_qa"
    },
    {
        "query": "Wild Horses was a band that originally featured former Buster Brown and two Montrose members, the band went through at least two bassists: Chris Lester and which American multi-instrumentalist, best known for his long stint in the band Dokken?",
        "response": "Jeffrey Steven Pilson",
        "source": "hotpot_qa"
    },
    {
        "query": "In which park will you find Melbourne Cricket Ground which was the scene of the Grand Final for the 2010 AFL finals series which had to replayed after St Kilda and Collingwood drew the match?",
        "response": "Yarra Park",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1933, Mott's introduced a product that is consumed in the same manner as Tab Energy. What product was it?",
        "response": "prune juice",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2014 Kamala Devi Harris was elected as what number Attorney General to serve California?",
        "response": "32nd",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the cartographer, that the Américo Vespucio Avenue is named after, die?",
        "response": "1454February 22, 1512",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the star of Ghost Whisperer born?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American pulp and paper company with approximately 55,000 employees, which acquired Temple-Inland in 2012?",
        "response": "International Paper",
        "source": "hotpot_qa"
    },
    {
        "query": "1 New York Plaza and Tower 49, are in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which came out first, \"Hollywood Chinese\" or \"The Truth According to Wikipedia\"?",
        "response": "Hollywood Chinese",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian shopping center won an award in 2016 and is under the jurisdiction of Pataliputra police station?",
        "response": "P&M Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film stars Justin Timberlake, Mila Kunis, and Bryan Greenberg?",
        "response": "Friends with Benefits",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Rashida Jones announce the nominees for during the 2011 Golden Globe Awards?",
        "response": "The Artist\" which won three awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band released more albums, Forest for the Trees or Jon Spencer Blues Explosion?",
        "response": "Jon Spencer Blues Explosion",
        "source": "hotpot_qa"
    },
    {
        "query": "Juanito plays for Xerez CD in which town in Andalusia, known for its racetrack and sherry?",
        "response": "Jerez de la Frontera",
        "source": "hotpot_qa"
    },
    {
        "query": "The fourth place Australian professional men's basketball team is the only one in the league to represent what area?",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a type of ribbon pasta, long like Spaghetti, two to three mm or roughly a tenth of an inch wide, similar to tagliatelle, but thin like a very thin variety of Italian pasta, with a diameter between 0.85?",
        "response": "Taglierini",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Jack's Mannequin or Chvrches?",
        "response": "Jack's Mannequin",
        "source": "hotpot_qa"
    },
    {
        "query": "What theory was developed by a member of the Department of Social Relations for Interdisciplinary Social Science Studies?",
        "response": "personology",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American professional basketball player for the Turkish Basketball Super league played under the former head coach of Virginia Commonwealth University and University of Oklahoma?",
        "response": "Antonio Lamar \"Tony\" Crocker",
        "source": "hotpot_qa"
    },
    {
        "query": "Spalding is an unincorporated community in Nez Perce County, Idaho, United States, ten miles east of Lewiston, on the Clearwater River close to the intersection of U.S. Routes 12 and 95, U.S. Route 95 (US 95) is a north–south U.S. highway in the western part of which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Ian Young wrote Continuum that was a magazine publsuhed by a group that denied the existence of what?",
        "response": "HIV/AIDS",
        "source": "hotpot_qa"
    },
    {
        "query": "What clan lived in the castle where Flora Harris competed at the Young Rider European Eventing Championships in 2007?",
        "response": "Clan Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Florence and the Machine or Terrible Things first to recieve the Brit award?",
        "response": "At the 2009 Brit Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the grandfather to Frederick II and was the Holy Roman Emperor until death?",
        "response": "Frederick I",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Miniter is an investigative journalist who wrote for a liberal American magazine which was owned by who in 2014?",
        "response": "Chris Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "Killer Films produced what 2015 British-American romantic drama film directed by Todd Haynes?",
        "response": "Carol",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the aunt of Andrea Begley who is an Irish country music singer born?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the group who released the album Vigil formed?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Mark Christopher a cast in that was a 1997 American science fiction action film directed by John Woo?",
        "response": "Face/Off",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor the Latte Boy's singer is also known for having a role in which NBC show?",
        "response": "\"The West Wing\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the 2010 population of the city at where Nate DiCasmirro grew up? ",
        "response": "61,481",
        "source": "hotpot_qa"
    },
    {
        "query": "Are U.S. Lady and Croissant both military magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Albert Einstein and Neil Gaiman from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Captain D'Agoust was an officer of the group of Swiss soldiers what have served as guards at European courts since when?",
        "response": "late 15th century",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played the role of Professor Sprout in the \"Harry Potter\" films and also played in Botternikes and Gumble, an animated series that originally aired in Australia and the U.K., but later came re-dubbed to Netflix in the United States?",
        "response": "Miriam Margolyes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker's family emigrated permanently to the United States when he was fourteen, Masaki Kobayashi or Josef von Sternberg?",
        "response": "Josef von Sternberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Bursera or Ipomoea?",
        "response": "Ipomoea",
        "source": "hotpot_qa"
    },
    {
        "query": "At what college did the current free agent and 2011 Minnesota Vikings rookie starter play?",
        "response": "Florida State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American animated television series has C. H. Greenblatt worked on",
        "response": "The Grim Adventures of Billy",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the city where Irwin Stadium is located ?",
        "response": "2,045",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the priest known for his work with migrants during the 2015 European refugee crisis, where migrants sought asylum from militant groups?",
        "response": "Mussie Zerai",
        "source": "hotpot_qa"
    },
    {
        "query": "Lynn D. Stewart opened the first Hooters in what Florida county?",
        "response": "Pinellas",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the city where Lockport Industrial District is located?",
        "response": "21,165",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the movie released that starred an American male actor born on February 28, 1923 and was written by Christopher Knopf?",
        "response": "December 23, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "What city has a Polynesian-themed resort that was built by developer Steve Wynn and hosted the 2013 Mosconi Cup?",
        "response": "Las Vegas, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "A 2011 film directed by Tom Owens is based on what franchise?",
        "response": "How to Train Your Dragon",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the award for scientific acomplishments won by Soviet scientist Mikhail Borisovich Golant and named after an infamous Soviet ruler created?",
        "response": "June 23, 1925",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer lived longer, Marion Zimmer Bradley or Ernesto Sabato?",
        "response": "Ernesto Sabato",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahmed Brahim had supposed contacts with the professor of Contemporary Islamic Studies at what institution?",
        "response": "St Antony's College",
        "source": "hotpot_qa"
    },
    {
        "query": "Emet is a small unincorporated community where what Oklahoma Hall of Fame inductee was born?",
        "response": "Mary Frances Thompson",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Schalke 04's top scorer's nickname?",
        "response": "The Hunter",
        "source": "hotpot_qa"
    },
    {
        "query": "The Big Three were a trio of basketball players for the San Antonio Spurs of the National Basketball Association (NBA) from 2002–2016, it consisted of Tim Duncan, Tony Parker, and Manu Ginóbili, an Argentine professional basketball player for the San Antonio Spurs, of which organization?",
        "response": "National Basketball Association (NBA)",
        "source": "hotpot_qa"
    },
    {
        "query": "Rob Halford and Brad Delp are both what?",
        "response": "singer and songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this subfamily within the cat family Felidae named by Reginald Innes Pocock that is descendant of Pseudaelurus?",
        "response": "Pantherinae",
        "source": "hotpot_qa"
    },
    {
        "query": "Aaron Heal took over as head cricketer and primary spinner from Australian cricketer born on what day?",
        "response": "6 February 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was named DJ Funk and produced house music within Chicago?",
        "response": "Charles Chambers",
        "source": "hotpot_qa"
    },
    {
        "query": "What author was an ealdorman and had his poems edited by Alistair Campbell? ",
        "response": "Æthelweard",
        "source": "hotpot_qa"
    },
    {
        "query": "Transparent and Gates of Heaven, have which mutual genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Hiking trail starts in the Town of Brookhaven?",
        "response": "Paumanok Path",
        "source": "hotpot_qa"
    },
    {
        "query": "Eldon P. Wyman was an ensign on the USS Oklahoma when the Japanese attacked what lagoon harbor that is the headquarters of the United States Pacific Fleet?",
        "response": "Pearl Harbor",
        "source": "hotpot_qa"
    },
    {
        "query": "What film, written by Dana Olsen, stars Matthew Broderick as the title character?",
        "response": "Inspector Gadget",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the wife of the character that Stephen Boxer played in the Royal Shakespeare Company production of \"The Taming of the Shrew\"?",
        "response": "Kate",
        "source": "hotpot_qa"
    },
    {
        "query": "When was English lawyer and judge who delivered judgment in Candler v Crane, Christmas & Co became judge",
        "response": "in 1944",
        "source": "hotpot_qa"
    },
    {
        "query": "The writer of \"And She Was\" was the found member, principal songwriter, and lead singer of this band?",
        "response": "Talking Heads",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cathedral has the tallest spire, Wakefield Cathedral or Shrewsbury Cathedral?",
        "response": "Wakefield Cathedral",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the movie for which Laura Weissbecker win the Chinese Huading award for \"best new actress\" released?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "This singer of A Rather Blustery Day also voiced what hedgehog?",
        "response": "Sonic",
        "source": "hotpot_qa"
    },
    {
        "query": "Kenneth Cortsen is a researcher at the research university, founded in 1928, located in what country?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer known as \"Ballad Prince\" co-hosted what 2013 award ceremony?",
        "response": "MBC Drama Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Arjun Kapoor worked on a 2003 film directed by whom?",
        "response": "Nikkhil Advani",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Matt Heafy and Jonny Craig both American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2002 American black comedy film in which the actress, who made her film debut in the satire \"Divorce American Style\", starred?",
        "response": "James Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter E Murphy, is an American businessman and founder of Wentworth Capital Management, he was chief strategic officer of Disney and President, Strategy & Development of which American gaming corporation based in Paradise, Nevada that owns and operates over 50 casinos and hotels, and seven golf courses under several brands?",
        "response": "Caesars Entertainment Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a borough in Lehigh County, Pennsylvania  located 20 miles north of a city in Lehigh and Northampton counties in the Lehigh Valley region of the eastern portion of the U.S. state of Pennsylvania?",
        "response": "Slatington",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director was born first, John D. Hancock or Richard Rush?",
        "response": "Richard Rush",
        "source": "hotpot_qa"
    },
    {
        "query": "Alt for Damerne and Hia are both what type of magazine?",
        "response": "women's magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Allan Smart played as what position for Burscough Football Club?",
        "response": "Striker",
        "source": "hotpot_qa"
    },
    {
        "query": "Loalwa Braz gave lead vocals for the first single from which debut album?",
        "response": "Worldbeat",
        "source": "hotpot_qa"
    },
    {
        "query": "Imiliya is a town located in what pilgrimage site?",
        "response": "Lumbini",
        "source": "hotpot_qa"
    },
    {
        "query": "What seventh studio albums first song was released on 27 June 2014 by an Australian hip hop group that formed in 1994 in Blackwood, Adelaide, South Australia?",
        "response": "\"Walking Under Stars\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The romantic comedy film Hairshirt, starring Katie Wright, was released in what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Santa Fe Railway Depot is along which railway chartered in February 1859?",
        "response": "Atchison, Topeka and Santa Fe Railway",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American-Canadian actress and poker player stars in the 2009 historical epic film Empire of Silver?",
        "response": "Jennifer Tilly",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the genre of the 2015 film that Harvey Keitel starred in?",
        "response": "comedy-drama",
        "source": "hotpot_qa"
    },
    {
        "query": "Jaren Johnston, is an American country music and rock singer and songwriter, and is a member of the group The Cadillac Three, of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the team that Luke Clark plays either right back or central midfielder for founded?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Cascades, Tasmania is home to what oldest operating brewery in Australia?",
        "response": "Cascade Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "Only the Brave is a film about an infantry battalion with what motto?",
        "response": "\"Remember Pearl Harbor\"",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Brassia and Comesperma connected?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "What  Academy Award nominee starred in Miracle of the White Stallions?",
        "response": "Edward Albert Heimberger",
        "source": "hotpot_qa"
    },
    {
        "query": "The Newman house is dedicated to which rector?",
        "response": "John Henry Newman",
        "source": "hotpot_qa"
    },
    {
        "query": "On what topic did James Watson and Alex Stokes have papers published in \"Nature\" on 25 April 1953?",
        "response": "the structure of DNA",
        "source": "hotpot_qa"
    },
    {
        "query": "Radioland Murders is a 1994 comedy mystery film directed by Mel Smith and co-written and produced by George Lucas, the film stars includes which American actor, writer, producer and director, born in 1971 ?",
        "response": "Scott Michael Campbell",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Malkit Singh move to the city where Oriental Star Agencies is based?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "How is the namesake of The Mountbatten Institute related to Elizabeth II?",
        "response": "second cousin once removed",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport, Yeager Airport or St. George Regional Airport,  is a public airport three miles (6 km) east of downtown Charleston, West Virginia?",
        "response": "Yeager Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 South Korean drama film The Crucible starred an actor who was best known for what two movies in 2016?",
        "response": "\"The Age of Shadows\" (2016), and \"Train to Busan\" (2016)",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pick Motor Company Limited is located in a town on which river ?",
        "response": "the River Welland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the real name of the mentor that is joining Vishal-Shekhar and Sajid-Wajid?",
        "response": "Daler Singh",
        "source": "hotpot_qa"
    },
    {
        "query": "Hot is the debut album of a South Korean singer that appeared in what Jinusean music video?",
        "response": "A-yo",
        "source": "hotpot_qa"
    },
    {
        "query": "National Route A006 connects Las Cuevas to what monument that literally translates to Cristo Redentor de los Andes?",
        "response": "Christ the Redeemer of the Andes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin John Crease (8 May 1936 – 12 April 2007) was a South Australian television presenter and news presenter, he was most noted for presenting South Australian edition of the Nine Network's\" National Nine News\", between 1987 and which year, with Rob Kelvin, (born 20 September 1944) is a former television news presenter, who lived in Adelaide, South Australia?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "The director of \"Spanglish\" grew up in what New Jersey city?",
        "response": "North Bergen",
        "source": "hotpot_qa"
    },
    {
        "query": "Cabalva made three voyages for which English and British joint-stock company?",
        "response": "East India Company",
        "source": "hotpot_qa"
    },
    {
        "query": "What was geared toward children, Glamour or Disney Adventures?",
        "response": "Disney Adventures",
        "source": "hotpot_qa"
    },
    {
        "query": " Robert Smith founded the multinational company headquartered in what city?",
        "response": "Golden Valley, Minnesota,",
        "source": "hotpot_qa"
    },
    {
        "query": "At the 12th Lumieres Awards Ceremony, the award for best film went to a 2006 French thriller film that was directed by Guillaume Canet, and was based on the novel by who?",
        "response": "Harlan Coben",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is twice monthly, Reason or CCM Magazine?",
        "response": "CCM Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Castle of Frankenstein and Modern Drummer both magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the year the band was founded that \"Aqui, Ali, Em Qualquer Lugar\" is composed of covers of?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was the reign of the king whose court Paon de Roet became attached to?",
        "response": "50 years",
        "source": "hotpot_qa"
    },
    {
        "query": "What wide receiver of the Oakland Raiders was a cover athlete for the game NCAA Football 10?",
        "response": "Michael Crabtree",
        "source": "hotpot_qa"
    },
    {
        "query": "What character was voiced by Lou Romano in the 2006 comedy film produced by Pixar Animation Studios?",
        "response": "Snot Rod",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country is the parent company of Tween Brands based in?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What guitarist known for his back to basics rock style produced the Album Sin? ",
        "response": "Wayne Kramer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company headquarters is located in Texas, American Airlines Group or Illumina?",
        "response": "American Airlines Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Riegert is best known for his role as newspaper editor Delbert McGinty in a family comedy-drama film loosely based on a memoir by who?",
        "response": "Benjamin Mee",
        "source": "hotpot_qa"
    },
    {
        "query": "Mother and daughter duo Indian actresses appear in which type of films",
        "response": "Malayalam movies",
        "source": "hotpot_qa"
    },
    {
        "query": "What role in the creation of music is filled by both Frank Sinatra and Ed Robertson?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Charles Everett Lively assassinate during a series of armed labor conflicts in the United States, roughly between 1890 and 1930?",
        "response": "Sid Hatfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Robotron: 2084 is what type of video game released by WMS Industries, an American electronic gaming and amusement manufacturer?",
        "response": "arcade",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director has won an Oscar, Ron Shelton or Ken Mora?",
        "response": "Ronald Wayne \"Ron\" Shelton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Library is located near The Henry Ford and the Glass House in Michigan?",
        "response": "Dearborn's Henry Ford Centennial Library",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Australian actress whose voice was featured on the movie Rise of the Guardians?",
        "response": "Isla Fisher",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is related to John Alexander and plays as a right-back for Premier League club Liverpool?",
        "response": "Trent Alexander-Arnold",
        "source": "hotpot_qa"
    },
    {
        "query": "What team holds the contract for the former team captain of the Union Dutchmen?",
        "response": "Tampa Bay Lightning",
        "source": "hotpot_qa"
    },
    {
        "query": "Which home computer was produced first, Amiga or Aamber Pegasus?",
        "response": "The Aamber Pegasus",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the 1998 Olympics and was couched by Richard Callaghan?",
        "response": "Tara Lipinski",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2006, Keith Slettedahl appeared in an episode of \"How I Met Your Mother\" that originally aired on which date ?",
        "response": "May 1, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University has more locations, Carnegie Mellon University or the University of Texas System?",
        "response": "University of Texas System",
        "source": "hotpot_qa"
    },
    {
        "query": "What purposes does Adailiya's public works park likely serve?",
        "response": "the distribution of potable water, and to provide emergency storage for fire protection",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Missouri city made the Money magazine list of best cities to live in the U.S. and has an office of a natural gas company that serves 155 Missouri communities?",
        "response": "Lee's Summit",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who presented the first series of \"Kitchen Burnout\"?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Kamarinskaya was a folk dance that shares a name with the composer who was the first in his country to be recognized for what type of music?",
        "response": "classical",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1991 American action gangster film based upon an original story is co-produced by George Jackson?",
        "response": "New Jack City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these cases established the idea of \"informed consent\" to medical procedures: Canterbury v. Spence or Obergefell v. Hodges?",
        "response": "Canterbury v. Spence",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the film in which an Indian film actress born on 4 October 1978 has a part?",
        "response": "Sudhir Mishra",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the job title of this American engineer and former astronaut aboard Apollo 11, who inspired the musical Moon Landing?",
        "response": "Lunar Module Pilot",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both American Hairless Terrier and Northern Inuit Dog native to the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hanging Gardens collaborations from which artist that performed under  the name \"Senior\", Jeppe was the lead vocalist of the pop duo Junior Senior?",
        "response": "Jeppe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer was also a comic writer, Ann Wilson or Gerard Way?",
        "response": "Gerard Arthur Way",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2005 biographical war drama which Damion Poitier starred in?",
        "response": "Sam Mendes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author has won more Pulitzer Prizes, Thomas Friedman or Henri Bergson?",
        "response": "Thomas Loren Friedman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director, Jacques Demy or Jack Clayton, appeared in the wake of the French New Wave alongside contemporaries like Jean-Luc Godard and François Truffaut?",
        "response": "Jacques Demy",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Mackenzie is an Australian supervising sound editor, he is known for which critically acclaimed biographical war-drama film, directed by Mel Gibson and written by Andrew Knight and Robert Schenkkan?",
        "response": "Hacksaw Ridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a common ingredient for both a Mimosa cocktail and a Bronx cocktail?",
        "response": "orange juice",
        "source": "hotpot_qa"
    },
    {
        "query": "The Austrian band that released War of Ages in 2013 was originally formed when?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Inger Stender earned the description of being Denmark's version of what German actress?",
        "response": "Marlene Dietrich",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor/actress from Overnight Delivery was born in New Orleans?",
        "response": "Reese Witherspoon",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2017, what was the estimated value of the basketball team that Luke Theodore Walton coaches?",
        "response": "$3.0 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "In which English city does the company that owns The Classic Malts of Scotland have its headquarters?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "China Bio-Immnunity has developed a vaccine for which viral disease that causes brain inflammation?",
        "response": "Rabies",
        "source": "hotpot_qa"
    },
    {
        "query": "Shemuel Pagan is training at the gym of the boxer who fights in what weight class?",
        "response": "welterweight",
        "source": "hotpot_qa"
    },
    {
        "query": "What highway otherwise known as CR 85  and meets up with County Road 97 in Bayport? ",
        "response": "Montauk Highway",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Race to Witch Mountain and The Gnome-Mobile both in some way related to Disney?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Billy & Mandy: Wrath of the Spider Queen first aired on the cable network that launched on what date?",
        "response": "October 1, 1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Toni Morrison and Nicholas Christopher both professor emerita at Princeton University?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Krew, formerly named 'Kidz Crewe KC5 is an American Band formed in which city, in California in 2013, the band  has also made national television appearances on Kris Jenner's show?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "New Documents presented photographs by what American photographer who is noted for photographs of marginalized people?",
        "response": "Diane Arbus",
        "source": "hotpot_qa"
    },
    {
        "query": "The Renault–Nissan–Mitsubishi Alliance is a Franco-Japanese strategic partnership between automobile manufacturers Renault, it controls which automobile brand owned by Nissan?",
        "response": "Datsun",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film based on the rock opera 5:15 appeared in?",
        "response": "Franc Roddam",
        "source": "hotpot_qa"
    },
    {
        "query": "What former member of the Upright Citizens Brigade hosted the 71st Golden Globe Awards with Tina Fey? ",
        "response": "Amy Poehler",
        "source": "hotpot_qa"
    },
    {
        "query": "How often does the news journal that inducted Thomas Spota into their Power List Hall of Fame publish journals?",
        "response": "monthly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which record producer wrote \"Love Story\"?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the English translation of the tier four league that TSV Schilksee was promoted to in 2014, following a league championship in the Schleswig-Holstein-Liga?",
        "response": "Regional League North",
        "source": "hotpot_qa"
    },
    {
        "query": "Joyce Beber's campaigns promoted what woman known as \"Queen of Mean\"?",
        "response": "Leona Helmsley",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Ashcroft has played at club level for the rugby league club that competes in what stadium?",
        "response": "Halliwell Jones Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does Sigourney Weaver play in the movie for which Anna Hamilton Phelan was nominated for an Oscar?",
        "response": "Dian Fossey",
        "source": "hotpot_qa"
    },
    {
        "query": "The lead single of Thomas Rhett's third studio album reached what position of the Hot Country and Country Airplay charts latter?",
        "response": "No. 1",
        "source": "hotpot_qa"
    },
    {
        "query": "What song from Burning Angel was a cover of the third studio album by an English heavy metal group?",
        "response": "Starbreaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Male' Sports Complex is located in the capital of which city at the southern edge of Kaafu Atoll?",
        "response": "Malé",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the composer of \"Music for Electric Metronomes\" born?",
        "response": "1933",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1989 American action thriller film that starred an actor known for starring in \"Full Metal Jacket\" ?",
        "response": "John Irvin",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the former American professional baseball player born in 1962, who was a client of Greater Talent Network?",
        "response": "Billy Beane",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Morasky is an American composer best known for his work for a video game developer headquartered in which city ?",
        "response": "Bellevue, Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Is David Allen or Dillian Whyte older?",
        "response": "Dillian Whyte",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did the actress who starred in the film Twilight, with Paul Newman, Gene Hackman, Reese Witherspoon, Stockard Channing and James Garner, get in 2006 ?",
        "response": "the Action Against Hunger Humanitarian Award",
        "source": "hotpot_qa"
    },
    {
        "query": "American actor Dylan McDermott played with Kristen Stewart in supernatural horror film The Messengers, which was released in what year?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Princess Louise of Belgium's mother born?",
        "response": "23 August 1836",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer used more names to write, Annie Proulx or René Crevel?",
        "response": "Annie Proulx",
        "source": "hotpot_qa"
    },
    {
        "query": "Cornelia Meigs won the Newbery Medal for her 1933 biography of a novelist of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Rob Renzetti the supervising producer for Gravity Falls?",
        "response": "June 15, 2012 to February 15, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Who reversed the Sixth Circuit's decision, paving the way for same-sex marriage to become legal in places like Ohio?",
        "response": "U.S. Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Caribbean the homeland of both Jean Rhys and Adolfo Bioy Casares?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What war was this major conflict which included the Battle of Ravenna in?",
        "response": "Italian Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "Dior Alexandros Lowhorn played college basketball for a team that was coached by who until April 2016?",
        "response": "Tubby Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Dan Brown or Henry Roth?",
        "response": "Henry Roth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which park in Spain is bigger Guadarrama National Park or Atlantic Islands of Galicia National Park?",
        "response": "Sierra de Guadarrama National Park (in Spanish: \"Parque Nacional de la Sierra de Guadarrama\") is a national park in Spain, covering nearly 34,000 hectares, the fifth largest in Spain's national parks system.",
        "source": "hotpot_qa"
    },
    {
        "query": "How many records did the boy band who released \"Said and Done\" sell worldwide as of 2013?",
        "response": "25 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What fictional character appearing in American comic books was played by Aytekin Akkaya in a Turkish cult action film?",
        "response": "Captain America",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation \"Panchai Palang, or Panther's Claw\" was part of the war with the public goal to dismantle what organization? ",
        "response": "al-Qaeda",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was also known as P.T. Anderson, is an American filmmaker, Gaspar Noé or Paul Thomas Anderson ?",
        "response": "Paul Thomas Anderson",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the brewing company which David G. Yuengling founded established  ",
        "response": "1829",
        "source": "hotpot_qa"
    },
    {
        "query": "What British historian wrote about Sonnet 154?",
        "response": "A. L. Rowse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following malls has over 120 stores as well as a large food court: Mall of New Hampshire or Pheasant Lane Mall?",
        "response": "The Mall of New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the airline created that has its headquarters in the Torre Bouchard skyscraper ?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the theatre located where Olesya Novikova is a first soloist ballet dancer?",
        "response": "Saint Petersburg, Russia",
        "source": "hotpot_qa"
    },
    {
        "query": "Stan Lee was an editor, film executive producer, and publisher, but what other title did he hold that he has in common with Susan Straight?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "What American horror comedy film did Consumed use excerpts from on their album?",
        "response": "Army of Darkness",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was a scheme to increase Culture spawned by the reading of an American classic set in Monroeville, Alabama?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the South Park season that contains the animated sitcom's 223rd episode aired?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "the record label that released  the song \"Cold Turkey\" was founded by which English band ?",
        "response": "the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the city that Ingrida Ardišauskaitė was born in located in Lithuania?",
        "response": "a city in north-east Lithuania.",
        "source": "hotpot_qa"
    },
    {
        "query": "What anchor store appear at Shops at Billerica besides Market Basket and the store that was acquired by Bain Capital in a take-private transaction?",
        "response": "Kmart",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the American alternative rock bands Anberlin and The Mowgli's, which one came from the west coast?",
        "response": "The Mowgli's",
        "source": "hotpot_qa"
    },
    {
        "query": "Damsel stars which English actor?",
        "response": "Robert Douglas Thomas Pattinson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who started their musical career first Julian Cope or Screaming Trees?",
        "response": "Julian David Cope",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2005 film did the Austrian director, who directed the Austrian psychological thriller film about two men who hold a family hostage, also direct?",
        "response": "Caché",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  private university located in Laie, Hawaii, did The BYU–Hawaii Seasiders men's basketball team represent ",
        "response": "Brigham Young University–Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Which drink was created first Grapette or Ricqlès ?",
        "response": "Ricqlès",
        "source": "hotpot_qa"
    },
    {
        "query": "which solo studio album by Paul McCartney did Temporary Secretary  featured on",
        "response": "McCartney II",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Henry Feinberg and Sergei Eisenstein who is noted for his silent films \"Strike\" (1925)?",
        "response": "Sergei Mikhailovich Eisenstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Abdelhalim Ouradi qualified for the Summer Olympics in what city?",
        "response": "Beijing",
        "source": "hotpot_qa"
    },
    {
        "query": "Cleland Conservation Park is a protected area located in the Adelaide Hills, South Australia about 22 km south-east of the Adelaide city centre, it includes the popular tourist destination of Mount Lofty, the highest point in the southern Mount Lofty Ranges, in which country? ",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the desiner for the further developments of Aquila which became 14-cylinder two-row radial aircraft engine?",
        "response": "Sir Roy Fedden",
        "source": "hotpot_qa"
    },
    {
        "query": "Zwan and Noir Désir, have which genre in common?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Who Killed the Electric Car? and Listen to Britain, are documentary films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of group is Kodaline and Cracker?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "What superstore located at the Handforth Dean retail park accounts for 28.4% of the UK grocery market?",
        "response": "Tesco",
        "source": "hotpot_qa"
    },
    {
        "query": "Central Scientific Instruments Organisation is situated in a city governed by who?",
        "response": "Union Government",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the largest town on Kaua' i?",
        "response": "10,699",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both If and Dungeon published magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Grandtheft remixed the Rhianna song released on what date?",
        "response": "March 26, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the course of the road race that Bob Hodges won in 1979 ?",
        "response": "7.46 mi long.",
        "source": "hotpot_qa"
    },
    {
        "query": "To which event where three Roman legions were distroyed is the phrase The German Forest sometimes used to refer to?",
        "response": "Battle of the Teutoburg Forest",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut was born first Franco Malerba or Michael Foale?",
        "response": "Franco Egidio Malerba",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Remington Arms Company related to Remington Spartan 100?",
        "response": "It is marketed and distributed by Remington",
        "source": "hotpot_qa"
    },
    {
        "query": "Kete Krachi is a town in what region?",
        "response": "Volta",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has been the host of ITV game shows Cash Trapped and Spin Star?",
        "response": "Bradley Walsh",
        "source": "hotpot_qa"
    },
    {
        "query": "Dipteryx and Cephalotaxus, are a species of what?",
        "response": "trees",
        "source": "hotpot_qa"
    },
    {
        "query": "Mutants in Orbit is a role-playing game authored by which British designer/publisher? ",
        "response": "James Wallis",
        "source": "hotpot_qa"
    },
    {
        "query": "How many individuals are in the senate wherein Barbara Allen resided?",
        "response": "40",
        "source": "hotpot_qa"
    },
    {
        "query": "From where the American rock band evolve who's fourth studio album is Interpol?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "What film directed by Valerie Red-Horse Mohl was based on the life of the first woman elected to serve as chief of the Cherokee Nation?",
        "response": "Mankiller",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the plant that Hina dye is prepared from?  ",
        "response": "Lawsonia inermis",
        "source": "hotpot_qa"
    },
    {
        "query": "All Signs Point to Lauderdale is the second single from the album What Separates Me from You, which is by what band from Ocala, Florida, that was founded in 2003?",
        "response": "A Day to Remember",
        "source": "hotpot_qa"
    },
    {
        "query": "Air Italy is a subsidiary of what privately owned Italian airline?",
        "response": "Meridiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew James Stockdale was featured on the 2010 single \"By the Sword\" by what British-American musician and songwriter who is best known as the lead guitarist of Guns N' Roses?",
        "response": "Slash",
        "source": "hotpot_qa"
    },
    {
        "query": "What essay, written in 1919, was considered a part of the New Criticism movement?",
        "response": "Hamlet and His Problems",
        "source": "hotpot_qa"
    },
    {
        "query": "Loch Shiel is part of the river that drains into the sea near the castle that sits west of what town?",
        "response": "Acharacle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Red Hot Chili Peppers or UB40?",
        "response": "UB40",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lathyrus and Lyonothamnus both types of legume?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The American Prairie Foundation is a public charity located in the U.S. state of Montana, the foundation's objective is to build one of the largest wildlife reserves in the continental United States through a combination of new land acquisition and public land integration into the American Prairie Reserve (APR), an independent non-profit organization that has privately undertaken a project in which northeastern U.S. state, to create a wildlife conservation area of over three million contiguous acres through a combination of both private and public lands?",
        "response": "Montana",
        "source": "hotpot_qa"
    },
    {
        "query": "In Harry Potter and the Deathly Hallows – Part 2 which fictional character and the main antagonist is Harry trying to find and destroy?",
        "response": "Lord Voldemort",
        "source": "hotpot_qa"
    },
    {
        "query": "The artist who composed K.365/316a, better known as Piano Concerto No. 10, was the son of whom?",
        "response": "Leopold and Anna Maria Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns an English evening newspaper based in Blackpool, Lancashire?",
        "response": "Johnson Press",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Jermaine Jackson's famous musical family group originate?",
        "response": "Gary, Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the producer of the album \"Less Deep Inside Keeps\" born?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two plants. Menziesia or Consolida, can be found in Europe and Asia?",
        "response": "Consolida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which war occurs first, Battle of Peleliu or the Battle of the Ch'ongch'on River?",
        "response": "Battle of Peleliu",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the composer of Choir of Sidney Sussex College, Cambridge born?",
        "response": "1970",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Perry Hall counties ranking in terms of population?",
        "response": "third-most",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American physician, poet, and polymath based in Boston died who wrote Lord of All Being, Throned Afar?",
        "response": "October 7, 1894",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian actress played the lead role in the 2013 American film based on Isaac Marion's novel of the same name?",
        "response": "Teresa Mary Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Eduardo Montes-Bradley and Frank Borzage direct films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Albert Lee Ueltschi was enshrined at Dayton, Ohio along with which American pilot who served in the United States Air Force and test pilot for the North American X-15 program?",
        "response": "Joe Engle",
        "source": "hotpot_qa"
    },
    {
        "query": "The movie Freaks of Nature starring Joan Cusack is what genre?",
        "response": "comedy horror film",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the William R. Fairchild International Airport or the Chico Municipal Airport in California?",
        "response": "Chico Municipal Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the team that Federico Agliardi plays for based?",
        "response": "Romagna",
        "source": "hotpot_qa"
    },
    {
        "query": "Which valley does the Arenales River flow through?",
        "response": "Lerma Valley",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Madeleine Doran, who was born in the capital city of Utah, Salt Lake City graduate with her B.A. and her Ph.D.?",
        "response": "Stanford University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of Scared to Death, Irvin Kershner or William Malone?",
        "response": "William Malone",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Amanda Crew's role in the movie Sex Drive?",
        "response": "stars",
        "source": "hotpot_qa"
    },
    {
        "query": "Long Live the Pimp was a studio album from which group from Port Arthur, Texas?",
        "response": "UGK",
        "source": "hotpot_qa"
    },
    {
        "query": "Noshaq and Apsarasas Kangri, are mountains?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American author, young earth creationist, and intelligent design proponent who co-wrote \"Of Pandas and People?\"",
        "response": "Percival Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Rocko's Modern Life is an American animated sitcom created by Joe Murray for Nickelodeon, the series centers on the surreal life of an anthropomorphic Australian-immigrant wallaby named Rocko as well as his friends: the gluttonous steer Heffer, Heffer Wolfe is a fictional character on the cartoon \"Rocko's Modern Life\" and the comic book series of the same name, who provided the voice of the anthropomorphic steer.?",
        "response": "Tom Kenny",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date did the tragedy that resulted in an estimated 80 deaths, and lead to Nicholas Paget-Brown stepping down as leaderof the Kensington and Chelsea London Borough Council occur?",
        "response": "14 June 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts Der Freischütz or Il trovatore",
        "response": "Il trovatore",
        "source": "hotpot_qa"
    },
    {
        "query": "What county town of 26,000 does the A414 road run through?",
        "response": "Hertford",
        "source": "hotpot_qa"
    },
    {
        "query": "How many residential states is the town, located near Orford and Cinnamon Brow, divided into?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Angela Rivera-Parr is an American born Australian female kickboxer and mixed martial artist, and wife of which Australian kickboxer and boxer, fighting out of Boonchu Gym in Gold Coast, Queensland?",
        "response": "John Wayne Parr",
        "source": "hotpot_qa"
    },
    {
        "query": "David Leon appeared in the Guy Ritchie film released on what date?",
        "response": "5 September 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "With what British-American Dame, journalist and editor does Lauren Weisberger have former professional ties?",
        "response": "Anna Wintour",
        "source": "hotpot_qa"
    },
    {
        "query": "This Zimbabwean singer/songwriter co-wrote a song recorded by a Barbadian singer for her fourth studio album named what?",
        "response": "Rated R",
        "source": "hotpot_qa"
    },
    {
        "query": "Make Your Move is a \"Romeo and Juliet\"-inspired film choreographed a married couple known together as what?",
        "response": "Nappytabs",
        "source": "hotpot_qa"
    },
    {
        "query": "HP sauce is produced by a company in which city in Pennsylvania?",
        "response": "Pittsburgh",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song did Metallica release in 1991 from their fifth album that is one of their most well known?",
        "response": "Enter Sandman",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter C. Harvey was the first African American to serve as New Jersey Attorney General, Harvey was appointed by  New Jersey Governor Jim McGreevey as Acting Attorney General, on what date?",
        "response": "February 15, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film drama did Nancy Reagan star in?",
        "response": "Shadow in the Sky",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides the Holy Roman Emperor, who was also considered the a universal power or the pontifex Maximus?",
        "response": "Pope",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the film that Shuna Harwood was nominated for an Academy Award for adapted from?",
        "response": "William Shakespeare's play",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American death metal band formed in who's album is The Wretched Spawn?",
        "response": "December 1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: Which opera has more acts, L'amico Fritz or Elektra?",
        "response": "L'amico Fritz",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founder and retired chief executive of The Vanguard Group was hired by Walter L. Morgan in 1951 and became his heir at his company?",
        "response": "John Clifton \"Jack\" Bogle",
        "source": "hotpot_qa"
    },
    {
        "query": "What band had their album Groovy, Laidback and Nasty released by a record label founded by the Carl Lindström Company?",
        "response": "Cabaret Voltaire",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of \"I Love Lucy\" also starred in \"DuBarry Was a Lady\"?",
        "response": "Lucille Ball",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was Night Owl filmed in that starred John Leguizamo, who also starred in Land of the Dead, a 2005 post-apocalyptic horror film?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Bauer was nominated for two Grammy Awards for his work on an album released on August 30, 2005 for what artist?",
        "response": "Kanye West",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a compilation album of previously unreleased songs and alternate takes recorded 1969–1980 by American singer-songwriter, who was one of the most popular acoustic artists of the decade and one of its best-selling artists?",
        "response": "Forever, John",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was produced first, Target for Tonight or Amy?",
        "response": "Target for Tonight",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county in Michigan did Rayan Hawili go to high school?",
        "response": "Wayne County",
        "source": "hotpot_qa"
    },
    {
        "query": "What heavy metal band is known for their song \"Sweating Bullets\" on the 1992 album Countdown to Extinction?",
        "response": "Megadeth",
        "source": "hotpot_qa"
    },
    {
        "query": "The album Powerage was the first time to feature a bassist born in which year ?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did the actress who played Samantha Carter in the \"Stargate\" television series play in the show \"Sanctuary\"?",
        "response": "Helen Magnus",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Everett Lively played a role in the wars that lasted between what period?",
        "response": "1890 and 1930",
        "source": "hotpot_qa"
    },
    {
        "query": "At what school did Nat Dye's brother serve as athletic director from 1981 to 1991?",
        "response": "Auburn",
        "source": "hotpot_qa"
    },
    {
        "query": "The history journal published quarterly by Wiley-Blackwell on behalf of the Economic History Society established in 1927 by a British economic historian and medievalist was originally edited by these peers.",
        "response": "E. Lipson and R. H. Tawney",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Billiken Child?",
        "response": "television actor",
        "source": "hotpot_qa"
    },
    {
        "query": "What country are Jiaozuo and Yunfu located in?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Levon Mkrtchyan of the same Nationality as Richard C. Sarafian?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tight end who played for the Denver Broncos and Baltimore Ravens is among those who grace the cover of NFL Street?",
        "response": "Shannon Sharpe",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the Precision Medicine Initiative announced?",
        "response": "January 20, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has has filled more film industry job titles, Dorothy Arzner or Herbert Ross?",
        "response": "Herbert David Ross",
        "source": "hotpot_qa"
    },
    {
        "query": "Martina Iñíguez wrote about the history of what dance that began in the working-class neighborhoods of Montevideo?",
        "response": "Tango",
        "source": "hotpot_qa"
    },
    {
        "query": "What town does Bucklow and Trafford have in common?",
        "response": "Partington",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the president died who's advisor was Edward Mandell House?",
        "response": "February 3, 1924",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes does the South Korean television series at which Jung Eui-chul reached the peak of his career have? ",
        "response": "25 episodes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the creator of the American anthology black comedy–crime drama television series whose principal cast consists of the actor who played Sam Malone on the NBC sitcom \"Cheers\"?",
        "response": "Noah Hawley",
        "source": "hotpot_qa"
    },
    {
        "query": "In which college Stephen Earl attended which was affiliated with the Presbyterian Church?",
        "response": "Hanover College",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the author of the 1987 novel The Enigma of Arrival: A Novel in Five Sections?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan V. Last works as a senior writer at  a magazine the is published how many times per year ?",
        "response": "48",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of living organisms are represented by the genus Mandragora, whose members are known as mandrakes, and Physostegia or the lionshearts native to North America?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary film was released first, Streetwise or The Last Lions?",
        "response": "Streetwise",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Lauri Markkanen and Jimmy Butler III, who was taken higher in their respective draft year?",
        "response": "he was taken by the Minnesota Timberwolves with the 7th overall pick",
        "source": "hotpot_qa"
    },
    {
        "query": "The Who is the former husband of fellow entrepreneur Anne Wojcicki, who both support the Breakthrough Prize in Life Sciences award? ",
        "response": "Sergey Brin",
        "source": "hotpot_qa"
    },
    {
        "query": "When can the earliest records be found of \"London Bridge is Falling Down,\" the basis for Newtrament's record?",
        "response": "seventeenth century",
        "source": "hotpot_qa"
    },
    {
        "query": "New Zealand DSJ class locomotive was first assembled by what company that produced diversified products like information technology and communications equipment and systems, electronic components and materials, power systems, industrial and social infrastructure systems, consumer electronics, household appliances, medical equipment, office equipment, as well as lighting and logistics.? ",
        "response": "Toshiba Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Titanic Days is which English singer and songwriter's fourth studio album?",
        "response": "Kirsty Anna MacColl",
        "source": "hotpot_qa"
    },
    {
        "query": "Yaropolk II of Kiev is the son of Vladimir II Monomakh and what woman who was one of several daughters of Harold Godwinson?",
        "response": "Gytha of Wessex",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the exact date of the accident that Miracle landing is based on?",
        "response": "April 28, 1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tropical storm has been present in the Central Pacific Ocean but not in the western north Pacific Ocean?",
        "response": "Ana",
        "source": "hotpot_qa"
    },
    {
        "query": "Inked is a tattoo lifestyle digital media company that bills itself as the outsiders' insider media, Katherine von Drachenberg, known as Kat Von D, born on which date, a tattooed woman,tattoo artist, model, musician, entrepreneur, and television personality, have appeared on \"Inked\"'s cover? ",
        "response": "March 8, 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the actor that plays Sean Tully defeat in a dancing contest?",
        "response": "Jodie Prenger",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American singer-songwriter and actress born who's 1993 song is  \"I Can See Clearly\"?",
        "response": "July 1, 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "The musician also known as \"Braddah Iz\"  is a member of what Hawaiian musical group?",
        "response": "Mākaha Sons",
        "source": "hotpot_qa"
    },
    {
        "query": "Azul Brazilian Airlines was founded in 2008 by an entrepreneur of what nationality?",
        "response": "Brazilian-American",
        "source": "hotpot_qa"
    },
    {
        "query": "What instrument did Nigel Walley play in John Lennon's band formed in 1956, which would later become the Beatles?",
        "response": "tea-chest bass",
        "source": "hotpot_qa"
    },
    {
        "query": "Which small town in the Tema Metropolis District was originally a small fishing village?",
        "response": "Sakumono",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music were vocalists Billie Joe Armstrong and Frank Iero involved with?",
        "response": "punk rock",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the cast in The Guardians born that is a South Korean singer, actor, fashion designer and television presenter?",
        "response": "September 23, 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is the smaller dog,  Dalmatian or Norfolk Terrier?",
        "response": "Norfolk Terrier",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state did Charles Manson, American convicted mass murderer and developer of ATWA, originate from and ultimately sentenced to life in prison in?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Ferrari's 488 was introduced to replace what European sports car?",
        "response": "458",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the biography of the convicted murderer who was born on February 21, 1961?",
        "response": "Frank Girardot",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the sporting director of Parma born who was key signing before 2002–03 Atlético Madrid season?",
        "response": "Besana in Brianza",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2011 post-apocalyptic dystopian science fiction action horror film did actor Cam Gigandet appear in?",
        "response": "Priest",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two artists, Yannis Philippakis and Dorothee Pesch, whose country of origin is geographically closer to Austria?",
        "response": "Dorothee Pesch",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Bacon composed the film score for which 2011 film based loosely one of William Shakespeare's plays?",
        "response": "Gnomeo & Juliet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which work was created first, Manon Lescaut or La liberazione di Ruggiero?",
        "response": "La liberazione di Ruggiero",
        "source": "hotpot_qa"
    },
    {
        "query": "Coddingtown Mall and Santa Rosa Plaza are the only two enclosed shopping malls in Santa Rosa, which is a city in what state?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Sofia Kovalevskaya and Maxim Kontsevich, who held a faculty position at more universities?",
        "response": "Maxim Lvovich Kontsevich",
        "source": "hotpot_qa"
    },
    {
        "query": "Kajol is a forerunner for what award that started in 2001?",
        "response": "Star Screen Award Jodi No. 1",
        "source": "hotpot_qa"
    },
    {
        "query": "This British-Australian singer was a member of a rock duo which became associated with the members of what band?",
        "response": "Bee Gees",
        "source": "hotpot_qa"
    },
    {
        "query": "The destroyed royal fortress of Marchmont is situated across the river from which Scottish town?",
        "response": "Kelso",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was first seen in \"Making the Band 2\" and continued on to host a reality show focused on taking 14 young men and teaching them how to be gentlemen?",
        "response": "Fonzworth Bentley",
        "source": "hotpot_qa"
    },
    {
        "query": "The sitcom that Nancy Travis starred in as Vanessa Baxter in had how many episodes total?",
        "response": "130",
        "source": "hotpot_qa"
    },
    {
        "query": "According to the 2010 census, what was the population of the city in which Vince Genna Stadium is located?",
        "response": "76,693",
        "source": "hotpot_qa"
    },
    {
        "query": "the aborignal group who traditionally lived in the area contiguaous with Coffs Harbour, New South Wales speak what language?",
        "response": "Gumbaynggir language",
        "source": "hotpot_qa"
    },
    {
        "query": "Foster & McElroy have had their music sampled by the American singer and actress who signed a recording contract with Columbia Records at what age?",
        "response": "sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Weihui and Weinan have in common?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former professional Australian was warded the Norm Smith Medal in 2013 AFL Grand Final",
        "response": "Brian Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, featuring a song written by Reg Presley, was directed by Richard Curtis in 2003?",
        "response": "Love Actually",
        "source": "hotpot_qa"
    },
    {
        "query": "Club Moderne was chosen as \"America's Favorite Historic Bar\" over which tiki bar in Great Falls, Montana?",
        "response": "Sip 'n Dip Lounge",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the album released that included a song that speaks about a woman who regrets cheating on her partner?",
        "response": "April 10, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What does \"All Together Now\" and \"Love\" share in common?",
        "response": "Cirque du Soleil",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Solenopsis and Arbutusnative to the same continent?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical stars Sean Ryan Fox from \"Henry Danger\" and is based on the famous book that tells the story of a mischievous yet innocent little boy who can fly, and has many adventures on the island of Neverland?",
        "response": "Jake and the Never Land Pirates",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the painting Michael Hayden was commissioned for on the Far Northwest Side of Chicago?",
        "response": "Sky's the Limit",
        "source": "hotpot_qa"
    },
    {
        "query": "Tressie Souders and Padmarajan, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band originated in Los Angeles, California and was previously called Kara's Flowers?",
        "response": "Maroon 5",
        "source": "hotpot_qa"
    },
    {
        "query": "Casa Amarilla, A railway in La Boca, is located in which country capital?",
        "response": "Argentine capital, Buenos Aires",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did author Bram Stoker write his Gothic novel that established many conventions of subsequent vampire fantasy?",
        "response": "1897",
        "source": "hotpot_qa"
    },
    {
        "query": "Patty Hill is perhaps best known for co-writing, with her sister Mildred Hill a song that was translated into how many languages ?",
        "response": "18 languages",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Scottish actor sang \"Come What May\"?",
        "response": "Ewan McGregor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which compact crossover SUV, which has been assembled at the Tahara plant?",
        "response": "Toyota RAV4",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, George Piranian or Colton Ford?",
        "response": "Colton Ford",
        "source": "hotpot_qa"
    },
    {
        "query": "Amit Singhal is the former senior vice president of engineering at what company under CEO Travis Kalanick?",
        "response": "Uber",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor honored with a bronze plaque at the Shakespeare Memorial Theatre at Stratford-upon-Avon and is, himself, subject of a play?",
        "response": "Ira Aldridge",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Acércate Más\" is a 1946 hit song by who, it was covered by Perry Como?",
        "response": "Osvaldo Farrés",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie based on an animated feature film features the song \"Days in the Sun\"?",
        "response": "Beauty and the Beast",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the net worth of the founder of Open Society Archives as of May 2017?",
        "response": "$25.2 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "2008 European Vacation Tour was a concert tour by American heavy metal band Metallica, an American heavy metal band based in San Rafael, in which U.S. State?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "How did Pre's Trail's namesake die?",
        "response": "in an automobile accident",
        "source": "hotpot_qa"
    },
    {
        "query": "Is it true Marc Caro is a French cartoonist and filmmaker and Nikos Koundouros is a Greek director?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the genuses Anemone and Arachniodes belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Glenrowan Affair is a 1951 movie about an Australian bushranger born when?",
        "response": "December 1854",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town along the B5300 road is 32 miles East of Carlisle?",
        "response": "Workington",
        "source": "hotpot_qa"
    },
    {
        "query": "What University of Oklahoma football coach, whom announced his retirement on June 7, 2017, represented the University of Oklahoma in the 2000 NCAA Division I-A football season?",
        "response": "Bob Stoops",
        "source": "hotpot_qa"
    },
    {
        "query": "The MV Kooringa was built by a company formed by a group of businessmen in what year?",
        "response": "1875",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Armenian Gampr dog or The Chihuahua the smaller breed?",
        "response": "The Chihuahua",
        "source": "hotpot_qa"
    },
    {
        "query": "George Walker was an English footballer, who played for which professional football club based in Selhurst, London?",
        "response": "Crystal Palace Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What Happens in Vegas, an American comedy film starring Lake Bell, was released in what year?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "What group had a music video directed by F Gary Gray from their second album \"CrazySexyCool\"?",
        "response": "TLC",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Russian physician originally proposed the death drive in her paper \"Destruction as the Cause of Coming into Being\"?",
        "response": "Sabina Nikolayevna Spielrein",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of one of the actors in Beuty Knows No Pain?",
        "response": "Mai Suet",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the composer of \"Ave Maria\" born?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Laws of Deception\" was written by the older brother of what famous actor?",
        "response": "John Travolta",
        "source": "hotpot_qa"
    },
    {
        "query": "which census-designated place (CDP) in Lincoln County, Nevada, United States.is  Crystal Springs a popular destination forits passersby ",
        "response": "Rachel",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the catchphrase of the presenter of the first two episodes for the Eastern Cabaret?",
        "response": "Pin back your lugholes",
        "source": "hotpot_qa"
    },
    {
        "query": "Remo Giazotto is mostly known through his systematic catalogue of the works of a composer that died in what year?",
        "response": "1751",
        "source": "hotpot_qa"
    },
    {
        "query": "Hilton Als was the former editor-at-large for a magazine founded by what producer?",
        "response": "Quincy Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Anna Jagiellon, was Queen of Poland and Grand Duchess of Lithuania in her own right from 1575 to 1586, she was a daughter of Polish King Sigismund I the Old and his Italian wife, which member of the powerful House of Sforza, which ruled the Duchy of Milan since 1447?",
        "response": "Bona Sforza",
        "source": "hotpot_qa"
    },
    {
        "query": "Which player won a French Open final, Tatiana Golovin or Albert Costa?",
        "response": "Tatiana Golovin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the co-founder of the magazine in which many of Poe Ballantine's essays appear?",
        "response": "Sy Safransky",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsey Buckingham and Dallas Taylor both fulfill which identical role in each of their respective acts?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Herek and Lester James Peries, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The Maynard carbine was a breech-loaded carbine used by cavalry in the American Civil War, about 3,000 Maynard carbines were in Confederate hands during the war; 5,000 in .35 caliber were purchased by Florida, 650 in .50 by Georgia, and 325 in .50 and 300 in .35 by which was the second southern state to declare its secession from the United States of America, on January 9, 1861?",
        "response": "Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Tango & Cash is a 1989 American buddy cop action comedy film that was mainly directed by Andrei Konchalovsky, the film was released in the United States on December 22, 1989, and alongside which 1989 American romantic comedy-drama film directed by Steven Spielberg and starring Richard Dreyfuss, was the final film to be released in the 1980s?",
        "response": "Always",
        "source": "hotpot_qa"
    },
    {
        "query": "Gareth Edwards worked on In the Shadow of the Moon in 2007 which led to his directing of which 2014 American monster film?",
        "response": "Godzilla",
        "source": "hotpot_qa"
    },
    {
        "query": " Jaroslav Seifert and John McGahern were both part of what shared profession? ",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "Broadview TV produces documentaries for what American digital cable and satellite television network that is a joint venture between the Hearst Corporation and Disney–ABC Television Group subsidiary of the Walt Disney Company?",
        "response": "A&E",
        "source": "hotpot_qa"
    },
    {
        "query": "What mountain was both the site of the Sloss Mines and Altamont School?",
        "response": "Red Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Steven Eisenberg or Jenna Bush Hager?",
        "response": "Steven Eisenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Shari McEwen admires a civil rights activist born in what year?",
        "response": "1913",
        "source": "hotpot_qa"
    },
    {
        "query": "American film actor, Dana Andrews, starred in the 1943 American Western film The Ox-Bow Incident, however, he is most famous for his role as war veteran Fred Derry in what film?",
        "response": "The Best Years of Our Lives",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Audi vehicle debuted first, the Audi Steppenwolf or the Audi TT?",
        "response": "Audi TT",
        "source": "hotpot_qa"
    },
    {
        "query": "Violated Angels is a film based on a mass murder spree which took place when?",
        "response": "night of July 13-14, 1966",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the second leader of La Familia Michoacana born?",
        "response": "8 March 1970",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the stage name of the singer who qualified to perform in the final round of Lithuania in the Eurovision Song Contest 2015, along with  Monika Linkytė and Vaidas Baumila?",
        "response": "Mia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a sound film first Béla Gaál or Millard Webb ?",
        "response": "Millard Webb",
        "source": "hotpot_qa"
    },
    {
        "query": "What Kansas city has a name that is a portmanteau and is located on Interstate 70?",
        "response": "Kanorado",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mutual building society, based in Leek, merged with a mortgage lending subsidiary of the cooperative bank in 2009?",
        "response": "Britannia Building Society",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Giuseppe Tornatore and Syed Noor film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Indian city are the films produced in the industry that includes films such as Blast 2?",
        "response": "Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "What country are the Chittagong Vikings in 2016 and Tamim Iqbal from?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "The Maryland Democratic Party has a state chair of the former public affairs officer for what company?",
        "response": "Marriott International",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the political consultant who has promoted Roger Stone's tweets born?",
        "response": "August 27, 1952",
        "source": "hotpot_qa"
    },
    {
        "query": "What Scottish nobleman was the subject of a 1934 British short documentary and was the first man to fly over Mount Everest?",
        "response": "Douglas Douglas-Hamilton, 14th Duke of Hamilton",
        "source": "hotpot_qa"
    },
    {
        "query": "The World Owes Me a Living is a 1945 British Second World War drama film, it stars who,which was an English actress and playwright, widely known to be Noël Coward's muse?",
        "response": "Judy Campbell",
        "source": "hotpot_qa"
    },
    {
        "query": "What street named after a British parliamentarian and social reformist runs to the west of Rundle Mall?",
        "response": "Hindley Street",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the category of the hurricane that damaged the Hanapepe Town Lot No. 18?",
        "response": "Category 4",
        "source": "hotpot_qa"
    },
    {
        "query": "The human rights campaigner who was the subject of an unauthorized biography by Jerry Oppenheimer is the widow of what politician?",
        "response": "Robert F. Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "Warren Motte is a professor at which flagship university of the University of Colorado system?",
        "response": "University of Colorado Boulder",
        "source": "hotpot_qa"
    },
    {
        "query": "Tuskegee University is a private, historically black university (HBCU) located in Tuskegee, Alabama, the university was home to scientist George Washington Carver, was an American botanist and inventor, and died on which date?",
        "response": "January 5, 1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song on the A-side of the song \"Rain\"?",
        "response": "Paul McCartney and John Lennon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the band with which Joe Payne played  is an American heavy metal band that was formed in 1989?",
        "response": "Fear Factory",
        "source": "hotpot_qa"
    },
    {
        "query": "Doug Jones appeared in what comedy film based on a story by Mick Garris and David Kirschner?",
        "response": "Hocus Pocus",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Anyone Can Fall in Love\" is a song, released in 1986, by an \"EastEnders\" actress born in which year ?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Tchaikovsky featured an actor acclaimed as what?",
        "response": "\"king of Soviet actors\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts, Boulevard Solitude or L'amico Fritz?",
        "response": "L'amico Fritz",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Dirrell is the brother of which super-middleweight title holder?",
        "response": "Andre Dirrell",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the proper name of the husband of Lollia Paullina?",
        "response": "Gaius Julius Caesar Augustus Germanicus",
        "source": "hotpot_qa"
    },
    {
        "query": "How many podiums has the driver who placed third in the 1999 San Marino Grand Prix scored?",
        "response": "68",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a district of Buenos Aires, Argentina and the southernmost barrio in Capital Federal, and contains the Autódromo Juan y Oscar Gálvez, home of the Argentine Grand Prix, a round of the Formula One championship?",
        "response": "Villa Riachuelo",
        "source": "hotpot_qa"
    },
    {
        "query": " Elisabeth Gürtler is the managing director of what Austrian hotel, featuring an art gallery?",
        "response": "The Hotel Sacher",
        "source": "hotpot_qa"
    },
    {
        "query": "Kewanee is how many miles west of the only east-west Highway connecting Mexico and Canada?",
        "response": "one mile",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was an American Novelist, Roberto Bolaño or Terry Southern?",
        "response": "Terry Southern (May 1, 1924 – October 29, 1995) was an American novelist",
        "source": "hotpot_qa"
    },
    {
        "query": "What character is a parody of the Joe Simon and Jack Kirby hero that first appeared in March 1941?",
        "response": "Capitão Brasil",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the most prestigious watch manufacturers founded by a French horologist is located where? ",
        "response": "Geneva, Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the films Vanishing of the Bees and National Bird have the same director?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What diet Solo and Diet Rite have in common?",
        "response": "soft drink",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more education relating to the medical field, John Najarian or Seth Rollins?",
        "response": "John S. Najarian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seating capacity of the theatre, that along with the King's has Stephen Barry as chief executive ? ",
        "response": "1,915",
        "source": "hotpot_qa"
    },
    {
        "query": "What Guatemalan Latin pop singer and songwriter  and writer of \"El amor es un fantasma\" shared a stage with Cristian Sáez Valdés Castro?",
        "response": "Shery",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Isles who were led by Aonghus Mór and covered a total land area of over 8300 km2?",
        "response": "Kingdom of the Isles",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the headquarters of Sky's rival?",
        "response": "Hook, Hampshire, United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Justin Shenkarow voices Harold Berman, a character from a television series that aired on what station?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "Blast Vegas starred the actor and musician who played the title character on what sitcom?",
        "response": "Malcolm in the Middle",
        "source": "hotpot_qa"
    },
    {
        "query": "Caste starred what English character actress who was nominated for an Academ Award for her performance in Room at the Top?",
        "response": "Hermione Baddeley",
        "source": "hotpot_qa"
    },
    {
        "query": "From when was the father of Ernst Gunther pretender to the throne of Schleswig-Holstein?",
        "response": "1863",
        "source": "hotpot_qa"
    },
    {
        "query": "Bates County Courthouse has a statue, erected in 1927, of what informal term for a member of the US Army?",
        "response": "Doughboy",
        "source": "hotpot_qa"
    },
    {
        "query": "General Mills markets what ice cream brand that opened their first retail store in Brooklyn, New York? ",
        "response": "Häagen-Dazs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man who presented the Australia 2022 FIFA World Cup bid was born on October 22, 1930?",
        "response": "Frank Lowy",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the phrase used to espouse a higher level of nationalism than the Irish's dominant 1870 political movement?",
        "response": "Sinn Féin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor, performance artist, and filmmaker directed  an American short slasher film That was released on October 31, 2011?",
        "response": "Shia LaBeouf",
        "source": "hotpot_qa"
    },
    {
        "query": "The NBC-affiliated television station, owned by an American telecommunications company whose founder is Julian Sinclair Smith, called WJAR is more commonly known as what?",
        "response": "NBC 10",
        "source": "hotpot_qa"
    },
    {
        "query": "What show other than Hello Ross did Chelsea Handler appear on in January of 2016",
        "response": "Chelsea Does",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Darren Hayes and Ben Jorgensen who is best known as the lead singer of Armor for Sleep?",
        "response": "Ben Jorgensen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which wrestling style was innovated by the fighter to whom the 2007 WWC Aniversario dedicated to?",
        "response": "brawling",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was based on adult life events of the composer Giuseppe Verdi, and released theatrically in the USA as The Life and Music of Giuseppe Verdi and on video as Verdi, the King of Melody, is a 1953 Italian biographical film starring Pierre Cressoy and directed by Raffaello Matarazzo?",
        "response": "Giuseppe Verdi",
        "source": "hotpot_qa"
    },
    {
        "query": "The Plymouth City Airport was officially opened by a man that was King of the UK until what year?",
        "response": "1936",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the occupation of the creator of The Cabinet?",
        "response": "American color commentator and retired professional wrestler",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Kniphofia and Cabomba genus of flowering plants?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What platform was used to build both both the midsize Pontiac G6 and a compact executive car manufactured by a Swedish automaker?",
        "response": "GM Epsilon platform",
        "source": "hotpot_qa"
    },
    {
        "query": "George Hamilton served as the constable of the police force that is the successor of what?",
        "response": "the Royal Ulster Constabulary",
        "source": "hotpot_qa"
    },
    {
        "query": "USS \"Halloran\" is a destroyer escort, of the United States Navy, named for William Ignatius Halloran, who died where, on 7 December 1941?",
        "response": "Pearl Harbor",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the musician that interpreted the work of Joe South's 1970 Grammy Awarded Song of the Year?",
        "response": "Ray Stevens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released second, Charley and the Angel or Planes?",
        "response": "Planes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the 1999 British comedy-drama film starring Jimi Mistry set?",
        "response": "Salford, Lancashire",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Dong-won's directorial debut was a film that is a sequel to which 2001 film ?",
        "response": "My Boss, My Hero",
        "source": "hotpot_qa"
    },
    {
        "query": "Which custom motorcycle manufacturer did Paul Teutul Jr. and Paul Teutul Sr. co-found?",
        "response": "Orange County Choppers",
        "source": "hotpot_qa"
    },
    {
        "query": "What project is a rail infrastructure project that includes a twin rail tunnel and the building of the Arden railway station?  ",
        "response": "Melbourne Metro Rail Project",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2014 film in which Isobelle Molloy had her film debut?",
        "response": "Robert Stromberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a breed of gundog, of rustic appearance, sometimes with a short tail, with a coat ticked with liver or fawn, Braque d'Auvergne or Braque du Bourbonnais ?",
        "response": "Braque du Bourbonnais",
        "source": "hotpot_qa"
    },
    {
        "query": "What English singer-songwriter co-hosted the 2015 MMVAs?",
        "response": "Ed Sheeran",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did David Lane try and promote Social conservatism?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Temple of Diana in ancient Rome was a Roman temple which, according to the early semi-legendary history of Rome, was built in the 6th century BC during the reign of the king Servius Tullius, the regal period, also called what, was the period of the ancient Roman civilization characterized by a monarchical form of government of the city of Rome and its territories?",
        "response": "Roman Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "\"These Are the Times\" is the second single released from the second album of Dru Hill, an American singing group, most popular when?",
        "response": "late 1990s",
        "source": "hotpot_qa"
    },
    {
        "query": "To what family does Kleinia and Rudbeckia belong to?",
        "response": "the sunflower family.",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Watkins and Albert de Courville, are of which nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which businessman, born in 1853, made his fortune in Kimberley, South Africa?",
        "response": "Cecil John Rhodes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the American former basketball player who was named MVP of the 1978 NBA Finals?",
        "response": "Sissel",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that acquired ARM Holdings plc headquartered?",
        "response": "Tokyo, Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the head of government of Albania officially mandate his 9th Cabinet?",
        "response": "September 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Who writes poetry such as Glaring Through Oblivion as well as leading the heavy metal band System Of A Down?",
        "response": "Serj Tankian",
        "source": "hotpot_qa"
    },
    {
        "query": "Deadline Games A/S was a video game developer based in Copenhagen, Denmark, operating between 1996 and 2009, its last published game, was based on \"Watchmen\", atchmen is an American comic-book limited series, published by which organization?",
        "response": "DC Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Canadian actress, who won a Canadian Screen Award nomination and starred in Tully?",
        "response": "April 1, 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Casa Valentina's author inducted into the American Theater Hall of Fame?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a type of food traditionally eaten at an event before a funeral, typically called a viewing in the United States and Canada?",
        "response": "A dead-cake",
        "source": "hotpot_qa"
    },
    {
        "query": "The 37th National Hockey League All-Star Game was held in the Olympic Saddledome in Calgary, Alberta, home of the Calgary Flames, on February 12, 1985, the game's most valuable player was which Canadian former professional ice hockey player and current owner of the Pittsburgh Penguins team?",
        "response": "Mario Lemieux",
        "source": "hotpot_qa"
    },
    {
        "query": "Orlando Brown is best known for his role as 3J Winslow in an American sitcom that was a spin-off of what?",
        "response": "Perfect Strangers",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Juliet Ibrahim and 4 Play connected?",
        "response": "Ghanaian",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Yogi Berra gain his reputation as one of the greatest catchers in history, the Yankee Stadium or Jellystone Park?",
        "response": "Yankee Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "What date did the show premier on that Jacob Bertrand is known for playing the titular character?",
        "response": "October 20, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Ray Wilson and Leo have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Elizabeth at 90: A Family Portrait is narrated by the longest-serving heir apparent in what?",
        "response": "British history",
        "source": "hotpot_qa"
    },
    {
        "query": "The Little Brown Stein is an example of a type of beer mug made out of what material?",
        "response": "stoneware",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Saraca indica and Saraca asoca, the sorrow-less\" plant, which is know for its non-clasping bracteoles, lower number of ovules, smaller pods, and more eastern geographic distrubution?",
        "response": "Saraca indica",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Governor Of New York helped found the American Bison Society?",
        "response": "Theodore Roosevelt",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the football team in which Ridha Rouatbi played for in the 1960 Summer Olympics?",
        "response": "Les Aigles de Carthage",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that plays Bernadette Rostenkowski-Wolowitz on  \"The Big Bang Theory\" stars with Gary Cole and Cecily Strong in what 2015 sports comedy-drama film?",
        "response": "The Bronze",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant is larger, the Pterocarya or the Cotula?",
        "response": "Pterocarya",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Fabio Fognini and Byron Black tennis player?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Abdisalam Aato and Curtis Hanson both considered to be American film-makers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "which  American professional basketball player was given the Dave Gavitt Trophy ",
        "response": "Jeffrey Lynn Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Agua de Valencia and Four Horsemen both cocktails?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Manor of Scrivelsby, in the East Lindsey district, lies in which eastern English county?",
        "response": "Lincolnshire",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor provides the voice of Mike Wazowski in the \"Monsters inc\" franchise?",
        "response": "Billy Crystal",
        "source": "hotpot_qa"
    },
    {
        "query": "The Naga Chili, closely related to the Bhut jolokia, also known as ghost pepper, ghost chili, U-morok, red naga, naga jolokia and ghost jolokia, is an interspecific hybrid chili pepper cultivated in the Indian states of Arunachal Pradesh, Assam, Nagaland and Manipur, and is closely related to the Naga morich, of which country?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "A Wind in the Door is part of a series written by who?",
        "response": "Madeleine L'Engle",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the county where Mike Horse, Montana is located?",
        "response": "Edgerton County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1976 British-American supernatural horror film for which Jerry Goldsmith composed the theme song \"Ave Satani?\"",
        "response": "Richard Donner",
        "source": "hotpot_qa"
    },
    {
        "query": "Were BBMak and Bikini Kill active at the same time?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Haywire is a 2011 film starring Bill paxton was directed by who?",
        "response": "Steven Soderbergh",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the daughter of the man who founded Sam's Club?",
        "response": "Alice Louise Walton",
        "source": "hotpot_qa"
    },
    {
        "query": "Clone of clones played alongside a band from where? ",
        "response": "Cleveland, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "who has more skill  Serj Tankian or  Layne Staley",
        "response": "Serj Tankian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which coming-of-age drama film filmed in Pittsburgh did Logan Lerman act in in 2012?",
        "response": "Perks of Being a Wallflower",
        "source": "hotpot_qa"
    },
    {
        "query": "Who now plays for the Atlanta Hawks of the National Basketball Association (NBA)?",
        "response": "Michael Joseph Dunleavy Jr. (born September 15, 1980) is an American professional basketball player who last played for the Atlanta Hawks",
        "source": "hotpot_qa"
    },
    {
        "query": "How many versions of a decree issued at Memphis, Egypt was the key to deciphering Egyptian hieroglyphs for the French historian in the early attempts?",
        "response": "three versions",
        "source": "hotpot_qa"
    },
    {
        "query": "Katharine McPhee gained fame from working with Susan Marshall in what season of American Idol?",
        "response": "fifth season",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed first, Portishead or The Darling Buds.?",
        "response": "The Darling Buds",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was founded first, Oingo Boingo or Sleater-Kinney?",
        "response": "Oingo Boingo",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1996 Australian Grand Prix was a Formula One motor race held on 10 March 1996, at Melbourne, this was the debut race of the future world champion Jacques Joseph Charles Villeneuve, a Canadian professional auto racing driver and amateur musician, and is the son of which Formula One driver?",
        "response": "Gilles Villeneuve",
        "source": "hotpot_qa"
    },
    {
        "query": " Which American Heavy metal band worked with producer Terry Date and released four albums during the 1980's?",
        "response": "Pantera released four albums during the 1980s.",
        "source": "hotpot_qa"
    },
    {
        "query": "What Scottish castle, lying one quarter mile south of Miltion of Finavon village, is named after the Scottish laird Thomas Gardyne of Middleton and Finavon?",
        "response": "Finavon Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the compatriot of Memphis Depay who plays for Bayern Munich born?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "The Acer beTouch E110 is a smartphone manufactured by a company headquartered in what location?",
        "response": "Xizhi, New Taipei City, Taiwan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who composed the BQF and afrofuturist movement blueprint with Camae Ayewa?",
        "response": "Rasheedah Phillips",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the Beatles release Long Tall Sally and Something New?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Green and Han Seung-yeon share what occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Known for his role in Bone Tomahawk, Evan Jonigkeit is also known for which series that is set in Chicago?",
        "response": "Easy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Spanish actress and model who made her acting debut at 16, and starred in the 2009 romantic musical drama film Nine, was signed by an agent at what age?",
        "response": "15",
        "source": "hotpot_qa"
    },
    {
        "query": "Bruce C. McKenna was a researcher on the miniseries that premiered in the US on what date?",
        "response": "March 14, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kaep in the nickname of what Maerican football quarterback?",
        "response": "Colin Kaepernick",
        "source": "hotpot_qa"
    },
    {
        "query": "Which two Swiss attractions were the cause of the \"grand hotels\" in which Jakob Ragaz worked on? ",
        "response": "skiing and mountaineering",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these cities has the most inhabitants as of 2010; Liaoyang or Liuzhou?",
        "response": "Liuzhou",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pierre Bouvier and Chantal Claret both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Catherine Wheel and Gas Huffer, share which genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the band whose member stars in the new South Korean television series Just in Love?",
        "response": "2PM",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Sky Witch\" is the twenty-ninth episode of the fifth season of which American animated television series created by Pendleton Ward for Cartoon Network?",
        "response": "Adventure Time",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is mainly found in Africa, Sloughi or Old English Sheepdog?",
        "response": "Sloughi",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company located that launched the audio for Hatamari Hennu Kiladi Gandu?",
        "response": "south India",
        "source": "hotpot_qa"
    }
]