[
    {
        "query": "The Man in the Iron Mask is considered a sequel to a historical novel by Alexandre Dumas that translates to what in French?",
        "response": "Les Trois Mousquetaires",
        "source": "hotpot_qa"
    },
    {
        "query": "Gene Schaerr served as law clerk for which former President of Baylor University?",
        "response": "Kenneth Winston Starr",
        "source": "hotpot_qa"
    },
    {
        "query": "Is James Bourne a band member of both McBusted and The Auteurs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two games, Amun-Re and Löwenherz, which game was published in 2003?",
        "response": "Amun-Re",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does South Carolina National Bank of Charleston and Andrew Jackson have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Lou Pai is a former executive of an energy company that went bankrupt in what year?",
        "response": "2001",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Tritonia and Degarmoara genuses comprised of hybrids?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "David Gwillim is known for playing Prince Hal in a series of British television adaptations of plays created by who?",
        "response": "Cedric Messina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Broadway musical with music by Barbara Anselmi was directed by Dennis Courtney in 2016?",
        "response": "It Shoulda Been You",
        "source": "hotpot_qa"
    },
    {
        "query": "Which private Roman Catholic four-year research university did Jerome Michael \"Jerry\" Trupiano graduate from?",
        "response": "Saint Louis University",
        "source": "hotpot_qa"
    },
    {
        "query": "P. J. O'Rourke and N. Scott Momaday both changed history and earned many awards and degrees. Who had more degrees than the other, P.J. O",
        "response": "N. Scott Momaday",
        "source": "hotpot_qa"
    },
    {
        "query": "Containing 498 shops, what shopping centre marks the beginning of the Westfield Sydney to Melbourne Ultramarathon?",
        "response": "Westfield Parramatta",
        "source": "hotpot_qa"
    },
    {
        "query": "For which conflict did the Canadian Government award the Canada General Service Medal for attacks by an Irish Republican organization based in the United States against British army forts and custom posts in Canada?",
        "response": "Fenian raids",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the two members of the due who released Hurt Feelings?",
        "response": "Bret McKenzie and Jemaine Clement",
        "source": "hotpot_qa"
    },
    {
        "query": "What team did Boom Boom captain in 2016?",
        "response": "Peshawar Zalmi",
        "source": "hotpot_qa"
    },
    {
        "query": "For what purpose was the oldest canal in England initially constructed?",
        "response": "connected it to the River Trent",
        "source": "hotpot_qa"
    },
    {
        "query": "Who, Leos Carax or Emeric Pressburger, is noted for his poetic style and his tortured depictions of love?",
        "response": "Alex Christophe Dupont",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is Morris Mac Davis from known for his song \"A Little Less Conversation\"?",
        "response": "Lubbock, Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert B. Radnitz was the producer of the 1974 film adaptation of the novel by whom?",
        "response": "Bill and Vera Cleaver",
        "source": "hotpot_qa"
    },
    {
        "query": "Live Acoustic America features a cover of a Beatles song that peaked at what number in the United Kingdom?",
        "response": "4",
        "source": "hotpot_qa"
    },
    {
        "query": "Army of Anyone and the Goo Goo Dolls played what genre of Music?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seating capacity of the stadium that is the home of the baseball team owned by Drew Weber?",
        "response": "4,000",
        "source": "hotpot_qa"
    },
    {
        "query": "The fourth Baron Derwent served in the Conservative administration of which British statesman of the Conservative Party who served as Prime Minister from October 1963 to October 1964?",
        "response": "Sir Alec Douglas-Home",
        "source": "hotpot_qa"
    },
    {
        "query": "Ali Awni al-Harzi was a suspect in a coordinated attack against two United States government facilities in which country?",
        "response": "Libya",
        "source": "hotpot_qa"
    },
    {
        "query": "DVD version of Living Things + includes live versions from an album that was certified what?",
        "response": "diamond",
        "source": "hotpot_qa"
    },
    {
        "query": "What common characteristic does the Pulmonaria and Bursera genuses have?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film distribution company who released \"A Violent Prosecutor\" founded?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What civil parish has three residential estates (Gorse Covert, Oakwood, and Locking Stumps) and sits near Risley Moss?",
        "response": "Birchwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Greyia and Calibanus, which genus contains more species?",
        "response": "Greyia",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Clark-Rouire is best known as being the perennial alternate for someone who won gold where?",
        "response": "2014 Sochi Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the founder of the company that produced White Ox?",
        "response": "Douwe Egberts",
        "source": "hotpot_qa"
    },
    {
        "query": "In the genre of Kanniyin Kaddhali, characters usually appear what? ",
        "response": "stereotyped.",
        "source": "hotpot_qa"
    },
    {
        "query": "What series is the author of the novelized Bases Loaded II: Second Season game known for?",
        "response": "\"Seven Wonders\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What class of ship is the destroyer named after this lieutenant commander embarked on the sixth aircraft carrier of the United States Navy and killed in action?",
        "response": "\"Buckley\"-class",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress from the film \"Jumper\" is also Dr. Zoe on \"Hart of Dixie\"?",
        "response": "Rachel Bilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiroaki Sato fought which Japanese mixed martial artist born on July 21, 1981?",
        "response": "Yushin Okami",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Louis XIV and Cocteau Twins both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How many participants did the person who shot Adrian Pracon kill at a summer camp?",
        "response": "69",
        "source": "hotpot_qa"
    },
    {
        "query": "Unveiled in 1991, the Avalon was a concept vehicle does not appear to have any direct relation to the full-size car produced by Toyota in what country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Adapted from a comic of the same name, what year was the South Korean film Fashion King?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Mick Jones and Frank Iero, have which occupation in common?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Choi Ri (born June 29, 1995) is a South Korean actress, she won the New Rising Award, for her role debut in which 2016, South Korean period drama film written and directed by Cho Jung-rae?",
        "response": "Spirits’ Homecoming",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the star of the controversial striptease revue \"The House of Love\" which took place at the Dunes Hotel on the Las Vegas Strip?",
        "response": "Jayne Mansfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Debbie Burton is best known for dubbing the singing voice of the young Baby Jane Hudson in a 1962 film directed by who?",
        "response": "Robert Aldrich",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Peter Lincoln's brothers had an acting career?",
        "response": "Eden Kane",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the author of the source material for the 1992 American legal drama film directed by Rob Reiner in which Cuba Gooding Jr. appeared?",
        "response": "Aaron Sorkin",
        "source": "hotpot_qa"
    },
    {
        "query": "Stillness was the final albulm of Sergio Mendes. He also co wrote which song for the 2012 Best Original Song for what movie?",
        "response": "Real in Rio",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns a 2,640-room hotel, casino and shopping promenade on the Las Vegas Strip that has a casino located within it that includes beer pong tables, a stage, a dance floor and a pit with games including blackjack, roulette, and craps?",
        "response": "Caesars Entertainment Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation is shared by  Mikhail Romm and John Quigley?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Las Vegas Festival Grounds is north of the hotel that is owned by which company?",
        "response": "MGM Resorts International",
        "source": "hotpot_qa"
    },
    {
        "query": "how is The One... and Matt Lucas connected?",
        "response": "television",
        "source": "hotpot_qa"
    },
    {
        "query": "How high on the US \"Billboard\" Hot 100 chart did Dan Smith's song reach in 2013?",
        "response": "number 5",
        "source": "hotpot_qa"
    },
    {
        "query": "Nothing Has Changed, is a compilation album by English musician David Bowie, it is the first album to showcase Bowie's entire career and includes a new composition, which was later re-recorded for his final album, which twenty-fifth and final studio album by the English musician David Bowie?",
        "response": "Blackstar",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Ettore Majorana's profession?",
        "response": "theoretical physicist",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the names of the brothers that directed a film that included Jon Raymond Polito?",
        "response": "Joel and Ethan Coen",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the arena in which the 2011–12 Missouri Tigers men's basketball team played their home games open?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What Institute Founded in 1969 and with approximately 130 campuses in 38 states of the United States had an American actor sidelined his acting career and became an education supervisor?",
        "response": "ITT Technical Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "Raymond Andrew \"Ray\" Winstone, is an English film and television actor, he has appeared in which 2005, French-British computer-animated adventure fantasy film?",
        "response": "The Magic Roundabout",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Lindfield plays as a Winger for a football club that plays their home games at what park?",
        "response": "Broadhurst Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Gérald Genta, a Swiss jewelllery designer, worked with what luxury Swiss watch manufacturer which was founded by American Watch,aker Florentine Ariosts Jones?",
        "response": "International Watch Co.",
        "source": "hotpot_qa"
    },
    {
        "query": "what does The Dig and Industrial Light & Magic have in common?",
        "response": "Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Swiss military-trained pilot and an aviation enthusiast had very successful attempt at powered skydiving?",
        "response": "Yves Rossy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the drummer for the Goo Goo dolls when their sixth album, Dizzy Up The Girl was released?",
        "response": "Mike Malinin",
        "source": "hotpot_qa"
    },
    {
        "query": "The Toccata and Fugue in D minor, BWV 538, is an organ piece by Johann Sebastian Bach, like the better-known BWV 565, the Toccata and Fugue in D minor, BWV 565, is a piece of organ music written, according to its oldest extant sources, by who?",
        "response": "Johann Sebastian Bach",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French-British film starring Mark Rylance and Kerry Fox received the award for The Golden Bear?",
        "response": "Intimacy",
        "source": "hotpot_qa"
    },
    {
        "query": "How much money has been given away by the Irish-American businessman who assisted Professor Perry Bartlett establish the Queensland Brain Institute?",
        "response": "more than $8 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Jenny Wiley Theatre alumnus who won the Tony Award  for Best Featured Actor in a Musical won it for playing what role?",
        "response": "John Wilkes Booth",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the university at which Margaret White served as a law lecturer primarily located?",
        "response": "Brisbane",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, Reason or Ladies' Home Journal, is an American magazine published by the Meredith Corporation?",
        "response": "Ladies' Home Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "Lakeland, New York derived its name from the lake located northwest of what major city?",
        "response": "Syracuse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company was founded by the designer of Risk Godstorm ?",
        "response": "Lone Shark Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is Laurel Park in?",
        "response": "Prince George's County",
        "source": "hotpot_qa"
    },
    {
        "query": "What band has a Golden Globe Award and Screen Actors Guild Award  winner featured on its album?",
        "response": "Babybird",
        "source": "hotpot_qa"
    },
    {
        "query": " U.S. Route 60 in Oklahoma runs through a city that is the county seat of what county?",
        "response": "Osage County",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that built the Southern Pacific 2706 went out of business in what year?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a film that the actor of \"Out of the Past\" made that was based on the memoirs of Norwegian resistance soldier Knut Haukelid?",
        "response": "The Heroes of Telemark",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the county seat of the county that incldes Four JG's Orchards & Vineyards?",
        "response": "Freehold Borough",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a protected area located in the Adelaide Hills, South Australia which conserves a significant area of natural bushland and which forms a boundary to the east of Waterfall Gully near the foothills of the Mount Lofty Ranges?",
        "response": "Cleland Conservation Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university did the third pick by the Philadelphia 76ers in the 2014 NBA draft attend before he was drafted?",
        "response": "University of Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that owns Mount Keith Mine was founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English county is one of the home counties and the birthplace of Clive Needle?",
        "response": "Essex",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the first disc in the album the residency show I Am... Yours was held in support of?",
        "response": "\"I Am...\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the more formal name of the history museum complex in which Mitt Romney announced his candidacy for the Republican nomination for president in 2008?",
        "response": "Edison Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "Chain Gang of Love is an album by the duo that is by a band in what genre?",
        "response": "indie rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Diane English is best known for creating the television show \"Murphy Brown\" and writing and directing the 2008 feature film, \"The Women\", an updated version of the George Cukor-directed 1939 film of the same name based on a 1936 play by what author?",
        "response": "Clare Boothe Luce",
        "source": "hotpot_qa"
    },
    {
        "query": "When Demetrius Jackson was drafted, who had the No.1 Pick?",
        "response": "Philadelphia 76ers",
        "source": "hotpot_qa"
    },
    {
        "query": "Nickerson Mountain is a mountain located in Carroll County, New Hampshire, in which location of mountains, just south of the White Mountains of New Hampshire, United States?",
        "response": "Ossipee Mountains",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the author of the book Dark Slayer ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2003 election followed the death of a man who was a British Labour Party, SDP and Liberal Democrat politician?",
        "response": "The 2003 University of Oxford election",
        "source": "hotpot_qa"
    },
    {
        "query": "William Sadler had a role in the sci-fi comedy film by which director?",
        "response": "Pete Hewitt",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of profession does Net.art and Alexei Shulgin have in common?",
        "response": "artist",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manufactured the line of vehicles below the Mercedes-Benz CLK-Class?",
        "response": "Daimler-Benz",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the character who has a son named Louis and has been played by the same actor since the series' inception?",
        "response": "Charlie Fairhead",
        "source": "hotpot_qa"
    },
    {
        "query": "What state did the United States House Committee on Oversight and Government Reform chairman and Geolocation Privacy and Surveillance Act sponsor act as a representative for?",
        "response": "Utah",
        "source": "hotpot_qa"
    },
    {
        "query": "Jim Reid and Justin Pierre, have which occupation in common?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Wycliffe Hall is named after a philosopher who passed away in which year ?",
        "response": "1384",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1997 independent slapstick comedy film Snowboard Academy stars this Danish-Italian actress, model, singer and reality television personality who began her career modelling for whom?",
        "response": "Greg Gorman and Helmut Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is name of the show that was replaced by the Nickelodeon series that starred Larisa Oleynik in the mid-1990s?",
        "response": "Clarissa Explains It All",
        "source": "hotpot_qa"
    },
    {
        "query": "Who sponsors the league in which Roberto Orlando Affonso Júnior plays ?",
        "response": "BOC Life",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Gregory Nava and John Rawlins have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What 'instrument' do both Sigurd Wongraven and Tina Turner play/use to perform?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what county is the city 7 miles east of Trace State Park the seat?",
        "response": "Lee County, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Carfagno, was an art director who established himself in the 1950s with his Oscar-winning work on such films as which 1953 epic Metro-Goldwyn-Mayer film adaptation of the play by Shakespeare, directed by Joseph L. Mankiewicz, who also wrote the uncredited screenplay, and produced by John Houseman?",
        "response": "Julius Caesar",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist sings Before He Cheats and Blown Away? ",
        "response": "Carrie Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Star Wars Epic Duels and Camel Up, are which specific form of entertainment?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the best known work by the composer of La Cetra?",
        "response": "\"The Four Seasons\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Price and Rob Schneider are both what profession? ",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the nationality of the signer whose vocals were used for tilted?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "The Man Who Sued God is a 2001 Australian comedy film starring Billy Connolly, a Scottish comedian, musician, presenter and actor from Glasgow, in which UK country?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "The Nuclear Fuel Cycle Royal Commission is a Royal Commission into South Australia's future role in the nuclear fuel cycle, the Commissioner was which former Governor of South Australia, a retired Royal Australian Navy officer who was the 34th Governor of South Australia?",
        "response": "Kevin Scarce",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the United Football League team for which former NFL player Edgerton Hartwell payed?",
        "response": "Las Vegas Locomotives",
        "source": "hotpot_qa"
    },
    {
        "query": "Who curates the site of the castle for whose construction Thomas Maclellan of Bombie was responsible?",
        "response": "Historic Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which boxing division was the man who had a film written about him which Mark Walhberg starred and co-produced?",
        "response": "Welterweight",
        "source": "hotpot_qa"
    },
    {
        "query": "The Italian professional racing driver and paracyclist born October 23, 1966 races for which car company?",
        "response": "BMW",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American actor in theatre, television, and film from \"Peter and the Starcatcher\" who played a song writier in the  musical TV series \"Smash?\"",
        "response": "Christian Borle",
        "source": "hotpot_qa"
    },
    {
        "query": "William John Macquorn Rankine, was a Scottish mechanical engineer who also contributed to civil engineering, physics and mathematics, who was a founding contributor to the science of thermodynamics, which German physicist and mathematician is this?",
        "response": "Rudolf Julius Emanuel Clausius",
        "source": "hotpot_qa"
    },
    {
        "query": "Which gulf touches both Anna Maria Island and Anna Maria the city?",
        "response": "Gulf of Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Memotech MTX and TEC-1 single-board kit computers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both Chernobyl Heart and Bridegroom win an award at the Academy Awards?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Manit Noywech, is a Thai footballer, and is also known as who, of Thailand?",
        "response": "Rivaldo",
        "source": "hotpot_qa"
    },
    {
        "query": "Seein' Red, White 'N' Blue was a short that included which cartoon fictional character?",
        "response": "Popeye",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is older, Stevens Institute of Technology or Drexel University?",
        "response": "Stevens Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the American-Chinese psychological film in which Lauren Cohan starred in?",
        "response": "William Brent Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day aired the last episode of a children's Indian television series starring the Indian actor Keval Vora on SAB TV?",
        "response": "4 November 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Who scored a film based on a 1961 science fiction novel by Stanislaw Lem?",
        "response": "Cliff Martinez",
        "source": "hotpot_qa"
    },
    {
        "query": "What port city and administrative center is several hours of ride from Nemetsky Peninsula?",
        "response": "Murmansk",
        "source": "hotpot_qa"
    },
    {
        "query": "Vestfold and Telemark each border what other Norwegian county?",
        "response": "Buskerud",
        "source": "hotpot_qa"
    },
    {
        "query": "Sorry is a 1966 song that was written by Stevie Wright and another Australian musician who moved to Australia with his family as a teenager, but was born where?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "American Gangster is fictionally based on an American former drug trafficker, who operated where in the late 1960s and early 1970s?",
        "response": "Harlem",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Joseph Kosinski and Harold Young have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the last monarch under which Robert Waterton was a trusted servant of the House of Lancaster born?",
        "response": "1421",
        "source": "hotpot_qa"
    },
    {
        "query": "The Haverhill Historical Society Historic District is located in what county?",
        "response": "Essex County",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the active years of this American rock band, in which John Fogerty was a member?",
        "response": "late 1960s and early 1970s",
        "source": "hotpot_qa"
    },
    {
        "query": "Who suggested that the duo form who recorded \"Hard Workin' Man\"?",
        "response": "Tim DuBois",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Andy Ram or Andre Agassi?",
        "response": "Andre Kirk Agassi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Michael Powell, or Ralph Bakshi?",
        "response": "Michael Latham Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "What British games manufacturer publishes \"White Dwarf,\" a magazine which gave Dragons of Mystery a middling review?",
        "response": "Games Workshop",
        "source": "hotpot_qa"
    },
    {
        "query": "Which prefecture is the city where the Japanese actor Akiji Kobayashi passed away the capital of?",
        "response": "Kanagawa Prefecture",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1998 Detroit Tigers drew 1,409,391 fans to a baseball park located in what neighborhood?",
        "response": "Corktown neighborhood",
        "source": "hotpot_qa"
    },
    {
        "query": "Astro Boy and The Secret of Kells share which genre of film?",
        "response": "Animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Aram Chobanian and Vic Darchinyan have the same profession ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which county in New York held the fourth PGA Championship?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Schultz is a senior advisor to former President Barack Obama and is the founder of Schultz Group, after White House Deputy Press Secretary Josh Earnest replaced Jay Carney to become White House Press Secretary, Joshua Ryan Henry Earnest, is an American political aide who served as White House press secretary under President Barack Obama, from which time span?",
        "response": "2014 to 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the sea-going vessel used by the Royal Australian Army during 1945 but also use as early as 2nd century AD  and developed rapidly during the Song Dynasty? ",
        "response": "Junk",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fictional charactor from \"Saved by the Bell\" is played by Mark-Paul Harry Gosselaar?",
        "response": "Zack Morris",
        "source": "hotpot_qa"
    },
    {
        "query": "Danny Wallace won one cap for which team, controlled by The Football Association?",
        "response": "England national football team",
        "source": "hotpot_qa"
    },
    {
        "query": "The animated star of Hot Cross Bunny was originally created in what year?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Julie Wagner or Julia Roberts?",
        "response": "Julie Anne Wagner",
        "source": "hotpot_qa"
    },
    {
        "query": "Guelphs and Ghibellines supported the Pope during which time frame?",
        "response": "9th and 15th centuries",
        "source": "hotpot_qa"
    },
    {
        "query": "By 1938, Harry McEvoy had established a large factory in Greater Manchester, what is the population of that city?",
        "response": "37,500",
        "source": "hotpot_qa"
    },
    {
        "query": "How many candidates were run by the political party tasked solely with stopping the relocation of South Australia's largest hospital?",
        "response": "11",
        "source": "hotpot_qa"
    },
    {
        "query": "Catamount Recording Studio has worked with what American heavy metal band formed in Des Moines?",
        "response": "Stone Sour",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Archduke of Austria-Este was assassinated by Bosian Serb, Mihajlo \"Miško\" Jovanović?",
        "response": "Archduke of Austria-Este",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band band released their first album in 2009, Starflyer 59 or Fun?",
        "response": "Fun",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry does Walt Aldridge and Adam Levine work in?",
        "response": "record producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Francis Key Hunt was named after what American poet who wrote a poem entitled at first \"The Defence of Fort McHenry\"?",
        "response": "Francis Scott Key",
        "source": "hotpot_qa"
    },
    {
        "query": "T-Shirt is a song from an album by Migos that was released on January 27, 2017, by Atlantic Records and who?",
        "response": "Quality Control Music",
        "source": "hotpot_qa"
    },
    {
        "query": "In what administrative category are the cities of Beitun, Xinjiang and Wafangdian?",
        "response": "county-level",
        "source": "hotpot_qa"
    },
    {
        "query": "Leonard Johnson was the cornerback for what college football team who’s home field is the jack trice stadium? ",
        "response": "Iowa State Cyclones football",
        "source": "hotpot_qa"
    },
    {
        "query": "WHat star of The Twins Effect used the first name \"Dior\" early in his career?",
        "response": "Ekin Cheng",
        "source": "hotpot_qa"
    },
    {
        "query": "What roller coaster located in North Rhine-Westphalia, Germany is designed in a western style?",
        "response": "Colorado Adventure",
        "source": "hotpot_qa"
    },
    {
        "query": "Which universtiy did the Irish composer which  Stainer & Bell Limited publish the works of attended",
        "response": "University of Cambridge",
        "source": "hotpot_qa"
    },
    {
        "query": "In April 2015 Fuganto Widjaja revealed a surprise takeover bid for a mining company founded by a man that is chairman of what company?",
        "response": "JNR Limited",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Jimmie Ross or Chris Daughtry?",
        "response": "Jimmie Ross",
        "source": "hotpot_qa"
    },
    {
        "query": "Frou Frou and Portishead, are electronic bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Borodin was part of a group of 19th century composers that were known as what \"number\"?",
        "response": "The Five",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the person to whom Ismaël Emelien serves as a special advisor an investment banker?",
        "response": "Rothschild & Cie Banque",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the ballet that Vassilie Trunoff performed when he toured Australia in 1975 & 1977 that derives from revivals staged by Marius Petipa?",
        "response": "Giselle",
        "source": "hotpot_qa"
    },
    {
        "query": "NextGen America's creator was born in what year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the official communication including over 100 emails which contained classified information which was investigated by the 7th director of the Federal Bureau of Investigation?",
        "response": "Hillary Clinton email controversy",
        "source": "hotpot_qa"
    },
    {
        "query": "Arnold Peder Møller's son was born on what date?",
        "response": "13 July 1913",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Alice in Chains and Skin Yard both bands that formed in Seattle?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the public high school at which Freddie James became the head coach located?",
        "response": "Oak Cliff area of Dallas",
        "source": "hotpot_qa"
    },
    {
        "query": "Horizon Pictures had a first release that was taken from the novel written by whom?",
        "response": "C. S. Forester",
        "source": "hotpot_qa"
    },
    {
        "query": "What award does James Franck and Humboldt University of Berlin have in common?",
        "response": "Nobel Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor was from the Silent Era, John Francis Dillon or Morgan Freeman?",
        "response": "John Francis Dillon",
        "source": "hotpot_qa"
    },
    {
        "query": "Adventure Theatre is located in an arts and cultural center that in its former incarnation, was a popular what?",
        "response": "amusement park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who originally hosted the Nickelodeon show that Bill Long was credited in?",
        "response": "Steve Burns",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that  employs approximately 100,000 people and had a merger with a Fortune 500 company headquartered in the Greenspoint district and in unincorporated Harris County, Texas, is the worlds largest what?",
        "response": "world's largest oilfield services company",
        "source": "hotpot_qa"
    },
    {
        "query": "Huascarán is a mountain that is just shorter than what type of formation in La Rioja Province, Argentina?",
        "response": "extinct volcano",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Enblish artist who released her second studio album Fall to Grace in 2012, born?",
        "response": "21 July 1981",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Nipponanthemum or Graptopetalum native to Japan?",
        "response": "Nipponanthemum",
        "source": "hotpot_qa"
    },
    {
        "query": "How many disciplines are combined in the degree that Hector Janse van Rensburg graduated from the University of York with?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Chronicon terrae Prussiae, is a chronicle of the Teutonic Knights, by Peter of Dusburg, finished in 1326, the  manuscript was completed some 100 years after which titled series of 13th-century campaigns of Roman Catholic crusaders, primarily led by the Teutonic Knights, to Christianize the pagan Old Prussians?",
        "response": "Prussian Crusade",
        "source": "hotpot_qa"
    },
    {
        "query": "Ngong Forest is home to which sole member of the genus Crocuta?",
        "response": "spotted hyena",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Bond girl in the twentieth James Bond spy film?",
        "response": "Miranda Frost",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession,  José Echegaray or Graham Swift?",
        "response": "José Echegaray",
        "source": "hotpot_qa"
    },
    {
        "query": "He was born into an ecclesiastical family on 28 April 1912, educated at Shrewsbury and Christ Church, Oxford and ordained in 1937, he was a curate at which Church of England parish church of the city of Lancaster, Lancashire, England, formally the Priory Church of St Mary?",
        "response": "Lancaster Priory",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Andre Dubus III and Boris Pilnyak both known as writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which captain commanded the Dutchman in a film produced by Jerry Bruckheimer?",
        "response": "Davy Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the Air Force base where Terry Lee Gabreski was the Vice Commander, Air Force Material Command?",
        "response": "Dayton, Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is farther north in New York, One57 or 45 Broad Street?",
        "response": "One57",
        "source": "hotpot_qa"
    },
    {
        "query": " IJscolf was a sport popular in coastal regions where?",
        "response": "western Europe",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was released one year before Nicki Minaj's \"Come on a Cone\"",
        "response": "\"Stupid Hoe\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Neil Young or Phil Collins?",
        "response": "Neil Percival Young",
        "source": "hotpot_qa"
    },
    {
        "query": "Which political power nominated Adbul Rashid Dostum?",
        "response": "the President",
        "source": "hotpot_qa"
    },
    {
        "query": "The Checklist Manifesto: How to Get Things Right, released in which year, is a non-fiction book by Atul Gawande?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Broken Bells and Magic Dirt, which band had more members at the time they were formed?",
        "response": "Magic Dirt",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1989 Kiev International Tournament  was played at the stadium located on the slopes of which hill?",
        "response": "Cherepanov Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Jolen is a member of the race of what type of people created by Marvel Comics?",
        "response": "superhumans",
        "source": "hotpot_qa"
    },
    {
        "query": "are Rika Hiraki and Mike Bryan from the same country",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1999 Brazilian Grand Prix took place at a motorsport circuit named after a driver who died in what year?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co- founded one of the stores that bought out some of the Focus DIY chain?",
        "response": "Richard Block and David Quayle",
        "source": "hotpot_qa"
    },
    {
        "query": "Between \"The Devil and Kate\" and \"Martha\" which has more acts?",
        "response": "Martha",
        "source": "hotpot_qa"
    },
    {
        "query": "Who began their career earlier, Jonathan Lethem or George S. Kaufman?",
        "response": "George Simon Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the total inmate population in the state New Hampshire State Prison for Men is located in?",
        "response": "2,791",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the bridge named for that spans the Narrows?",
        "response": "Giovanni da Verrazzano",
        "source": "hotpot_qa"
    },
    {
        "query": "Raoul Duke is the fictional character in which novel, illustrated by Ralph Steadman?",
        "response": "Fear and Loathing in Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, The Believer or Democracy?",
        "response": "The Believer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ali G series star is also an English actor, comedian, screenwriter, and producer?",
        "response": "Sacha Baron Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the professional wrestling tag team \"Doom\" was also a football player?",
        "response": "Butch Reed",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  home rule-class city in Oldham County is  D. W. Griffith House  a historic building in",
        "response": "La Grange",
        "source": "hotpot_qa"
    },
    {
        "query": "Anja Nissen (born 6 November 1995), sometimes known as simply Anja, is a Danish-Australian singer, songwriter, dancer and actress, she lists her influences as Patti LaBelle, an American singer, author, actress, and entrepreneur, born when? ",
        "response": "May 24, 1944",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress was casted in both \"Sex, Lies and Video Tapes\" and \"Michael\" ?",
        "response": "Andie MacDowell",
        "source": "hotpot_qa"
    },
    {
        "query": "Place to Place was a series that was first serialized in what manga magazine?",
        "response": "Manga Time Kirara",
        "source": "hotpot_qa"
    },
    {
        "query": "The Favour, the Watch and the Very Big Fish is a 1991 comedy film directed by Ben Lewin, starring Bob Hoskins, Jeff Goldblum and Natasha Richardson, an English stage and screen actress, born on ?",
        "response": "11 May 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Which story received publication into a movie, Dangal or Ghostopolis?",
        "response": "Dangal",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Sleeper is currently the Director of Orchestral Activities and Conductor of a university in which US state ?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the Australian Stumpy Tail Cattle Dog or the Borzoi most similar to a greyhound in appearance?",
        "response": "The Borzoi",
        "source": "hotpot_qa"
    },
    {
        "query": "how many Infinity Gems must earths heroes seek out? ",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "What institution does 2017 Texas Tech Red Raiders baseball team and Dan Law Field at Rip Griffin Park have in common?",
        "response": "Texas Tech University",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Freddy Adu play in soccer?",
        "response": "primarily as an attacking midfielder, but he is also used as a winger or forward.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was arena  above North Station which is now a hub for MBTA Commuter Rail and Amtrak trains.and was where the 'final four' games of the 1984 ECAC Hockey Men's Ice Hockey Tournament played located?",
        "response": "Boston, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Morgan Forster's novel A Room with a View was set in which two countries?",
        "response": "Italy and England",
        "source": "hotpot_qa"
    },
    {
        "query": "Interpretations of Fight Club is a movie that starred what person know for their roles in low-budget arthouse and independent films?",
        "response": "Helena Bonham Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did the guitarist whose guitar The Demon V was based on die?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Fremontodendron and Mitella both native to the southwestern United States and northwest Mexico?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Kokdala and Dongxing, Guangxi, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Brian Kidd and Mikel Arteta, what year was the older one born?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Mina and the count animated series appeared on two animation show cases Cartoon networks what a Cartoon. Who was the second Animation showcase which appeared on Nickelodeon cable channel ?",
        "response": "Oh Yeah! Cartoons",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American heavyweight boxer born who was active in the 1950s through the 1970s, and was defeated by the former Canadian professional boxer George Chuvalo?",
        "response": "1933",
        "source": "hotpot_qa"
    },
    {
        "query": "What street runs parallel to the street at the heart of the Arbat District of Miscow?",
        "response": "Sivtsev Vrazhek",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one, Boğaziçi University or Basilica Cistern, was built in the 6th century during the reign of Byzantine Emperor Justinian I?",
        "response": "The Basilica Cistern",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the creator of the comic strip character \"Pig-Pen\"?",
        "response": "Sparky",
        "source": "hotpot_qa"
    },
    {
        "query": "Lake Wollumboola lies to the north of a bay that is said to possess what?",
        "response": "the whitest sand in the world",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the author of Freeway Warrior's original occupation?",
        "response": "Originally a musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What person does O'Farrell Community School and It Takes a Village have in common?",
        "response": "Hillary Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus contains the greatest number of species, Lomatia or Delosperma?",
        "response": "Delosperma",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Could I Leave You?\" was a song in Follies, a musical concering what?",
        "response": "a crumbling Broadway theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "What medium-sized bear native to North America can be seen in Harriman State Park?",
        "response": "American black bear",
        "source": "hotpot_qa"
    },
    {
        "query": "The band Antix released an EP in 1984 that was produced by Don Dokken and Jeff Pilson, who are best known for being members of what band?",
        "response": "Dokken",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of bands are Razorlight and The Strokes?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain is higher, Shishapangma or Momhil Sar?",
        "response": "Shishapangma",
        "source": "hotpot_qa"
    },
    {
        "query": " Leandro Firmino played the role of Thiago in \"Trash\" alongside the actress who had a breakout role in which 2009 film?",
        "response": "Tanner Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Tor Troéng is a retired  mixed martial artist previously fighting as a Middleweight for an organization based in what state? ",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the historical name for the fourteenth-century tower found in a suburb of Edinburgh? ",
        "response": "Niddry Seton",
        "source": "hotpot_qa"
    },
    {
        "query": "At what college did the player, who was an inspiration for the goalkeeper Jenna Fife, play ?",
        "response": "University of Washington,",
        "source": "hotpot_qa"
    },
    {
        "query": "Which role did Imogen Poots play in the 2007 British science fiction horror film 28 Weeks Later?",
        "response": "Tammy",
        "source": "hotpot_qa"
    },
    {
        "query": "What fantasy role-play game set in the fictitious world of Mundana was created by Neogames?",
        "response": "Eon",
        "source": "hotpot_qa"
    },
    {
        "query": "In which fictional state in a novel by George Orwell is this language spoken, to which the coinage of \"Fedspeak\" is an intentional parallel?",
        "response": "Oceania",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this longtime companion of Adolf Hitler and, for fewer than 40 hours, his wife, whose dogs were taken care of byb Fritz Tomow?",
        "response": "6 February 1912",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the fourth Italian woman to have reached the top 10 in singles, Lukáš Dlouhý or Roberta Vinci?",
        "response": "Roberta Vinci",
        "source": "hotpot_qa"
    },
    {
        "query": "What position does Presidential Food Service and First Family of the United States have in common?",
        "response": "head",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernard Telsey, is a casting director and co-founder of MCC Theater, shows his company has cast include which 2004 American jukebox musical with Elvis Presley music and with a book by Joe DiPietro?",
        "response": "All Shook Up",
        "source": "hotpot_qa"
    },
    {
        "query": "Sgt. Warren Reed was a fictional character in a movie that was set in what city?",
        "response": "Detroit, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did the actor from the comedy film Table for Three grow up?",
        "response": "Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Rodríguez (born May 24, 1964) is a Puerto Rican American operatic tenor from New York City, this led to an offer of formal training from José Plácido Domingo Embil, a Spanish tenor, conductor and arts administrator, commonly known as who?",
        "response": "Plácido Domingo",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle did the man whose name was used for Bowie County, Texas, die at?",
        "response": "Battle of the Alamo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was one of the earliest colonists of the \"Father of Texas and after who's name the Bellville city named?",
        "response": "Thomas B. Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the host of Pressure Pad born?",
        "response": "Glasgow, Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "which American supernatural horror film was composed by Joseph Bishara",
        "response": "The Conjuring",
        "source": "hotpot_qa"
    },
    {
        "query": "Stanley Milgram was influenced for his experiments by the trial of which German Nazi lieutenant colonel?",
        "response": "Otto Adolf Eichmann",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Patricio Guzmán Lozanes or Gil Kenan?",
        "response": "Gil Kenan",
        "source": "hotpot_qa"
    },
    {
        "query": "What Italian Baroque composer composed Nulla in mundo pax sincera?",
        "response": "Antonio Vivaldi",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Gray worked as a bassist alongside Andrew Ridgeley and which other founding member of Wham!?",
        "response": "George Michael",
        "source": "hotpot_qa"
    },
    {
        "query": "The 'Taj Mahal' represents the finest and most sophisticated example of Mughal architecture, an architectural style developed by who, in the 16th, 17th and 18th centuries throughout the ever-changing extent of their empire in Medieval India?",
        "response": "Mughals",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the hotel which was the site of Robert F. Kennedy's speech \"On the Mindless Menace of Violence\" on April 5, 1968?",
        "response": "Hotel Cleveland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed a 2014 drama that featured the actor that played Patrick Kuby in \"Breaking Bad\"?",
        "response": "Mike Binder",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 SEC Championship Game was played on which date, the game featured the Georgia Bulldogs, the 2012 Georgia Bulldogs football team represented the University of Georgia in the 2012 NCAA Division I FBS football season?",
        "response": "December 1, 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "FAQ U is a program that included which British comedian as guest presenter in its second week?",
        "response": "David James Stuart Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Fantastic Beasts\" and J. K. Rowling's Wizarding World were both created based on what fantasy novels?",
        "response": "Harry Potter",
        "source": "hotpot_qa"
    },
    {
        "query": "Alexander Zhulin was the partner of the ice dancer who won the World Championships in what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Forsaken House is a fantasy novel that was written by an Author who has worked on which campaign settings?",
        "response": "Dungeons & Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an annual Christmas tradition celebrated in towns across Europe: in France, Germany, and Austria? ",
        "response": "Christmas market",
        "source": "hotpot_qa"
    },
    {
        "query": "Which causes did Yuri Kochiyama advocate that promoted this subcategory of black nationalism, stemming from the idea of racial solidarity?",
        "response": "Black separatism",
        "source": "hotpot_qa"
    },
    {
        "query": "Rosie Fellner portrayed Joei Harkness with an English actor who passed away in which year ? ",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Who scientifically described the animal that shares its name with Marius Tucă's city of birth?",
        "response": "Johann Christian Daniel von Schreber",
        "source": "hotpot_qa"
    },
    {
        "query": "the town of Kstovo is 22 km southeast of a city that is the capital of which federal district ?",
        "response": "Volga Federal District",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant has more species, Jubaea or Dipsacus?",
        "response": "Dipsacus",
        "source": "hotpot_qa"
    },
    {
        "query": "Hold Back My Heart was a studio album released in 2008 by the singer of what nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Co-Ro Food and Pocari Sweat, which is manufactured in Asia?",
        "response": "Pocari Sweat",
        "source": "hotpot_qa"
    },
    {
        "query": "Elizabeth Austin wrote for a fitness magazine founded by who?",
        "response": "Christine MacIntyre",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Nike Hypervenom\" is a football boot that is manufactured by Nike, it is endorsed/worn by players, notably Harry Edward Kane, an English professional footballer who plays as a forward for Premier League club Tottenham Hotspur and the England national team, born in what year?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor from \"The Cosby Show\" also starred in \"Play'd: A Hip Hop Story\"?",
        "response": "Merlin Santana",
        "source": "hotpot_qa"
    },
    {
        "query": "What city has the greatest population, Tongxiang or Yulin, Shaanxi?",
        "response": "Yulin",
        "source": "hotpot_qa"
    },
    {
        "query": "When will the location that appears in AC/DC's live 2007 concert DVD host the Summer Olympics?",
        "response": "2024",
        "source": "hotpot_qa"
    },
    {
        "query": "African Union was established in a city of Ethiopia with a population of how many?",
        "response": "3,384,569",
        "source": "hotpot_qa"
    },
    {
        "query": "Ora Alexander's musical style was barrelhouse, named after what kind of establishment?",
        "response": "Juke joint",
        "source": "hotpot_qa"
    },
    {
        "query": "Denise Coates was the founder of the gambling company based in what country?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of the English Judge who reaffirmed a class of \"equitable mistakes\" in his judgment, which enabled a claimant to avoid a contract in Solle v Butcher?",
        "response": "23 January 1899",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the UK's first Linux-specific magazine call Qvwm?",
        "response": "an unusually impressive imposter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the head coach on the losing team of the first Sugar Bowl to be broadcast on television?",
        "response": "Johnny Vaught",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came first Miracle of the White Stallions or Bedknobs and Broomsticks?",
        "response": "Miracle of the White Stallions",
        "source": "hotpot_qa"
    },
    {
        "query": "What administration did Mark Everson work for after American statesman and actor Ronald Reagan left office?",
        "response": "administrations of George W. Bush",
        "source": "hotpot_qa"
    },
    {
        "query": "What university was founded in part by the man falsly cited as giving the antisemitic speech known as \"The Franklin Prophecy\"?",
        "response": "University of Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Hansen Clarke ran for which district, located in Wayne, County Michigan? ",
        "response": "Michigan's 13th congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town where Matthew Butturini was born>",
        "response": "population of 8,523 people",
        "source": "hotpot_qa"
    },
    {
        "query": "Are John H. Auer and Jerome Robbins both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "On 30 November 2004, Jakubko made his international debut for Slovakia in the 1–0 victory over Hungary at the 2004 King's Cup, Jakubko played 6 minutes at the 2010 FIFA World Cup against the Netherlands and earned a penalty kick, which was successfully taken by which Slovak football player who currently plays for ŠK Slovan Bratislava?",
        "response": "Róbert Vittek",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Fat Liar is a 2002 American teen comedy film, directed by Shawn Levy, starring which American actress and fashion designer, born on April 3, 1986?",
        "response": "Amanda Laura Bynes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession,  Erle Stanley Gardner or Elizabeth Taylor?",
        "response": "Dame Elizabeth Rosemond Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of Eclipse de Luna is which nationality?",
        "response": "Mexican",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Chris Menges or Mike Newell?",
        "response": "Chris Menges",
        "source": "hotpot_qa"
    },
    {
        "query": "Tumbledown is a 2015 American romantic comedy film directed by Sean Mewshaw, it stars Dianna Elise Agron, an American actress, singer, and dancer, in what year,  Agron made her television debut as Jessica Grant, on which Tumbledown is a 2015 American romantic comedy film directed by Sean Mewshaw, it stars Dianna Elise Agron, an American actress, singer, and dancer, in 2006, Agron made her television debut as who, on CSI: NY?",
        "response": "Jessica Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "Which long-time mistress of King Charles II of England occupied a townhouse in Pall Mall, London?",
        "response": "Nell Gwyn",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the album released in which \"Big Fish\" is a song recorded by American rapper Vince Staples?",
        "response": "June 23, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "The Southern Transitional Council, an autonomous and secessionist body whose 26 members, calls for the separation of southern Yemen, during the term of which former president, Yemeni politician?",
        "response": "Ali Abdullah Saleh",
        "source": "hotpot_qa"
    },
    {
        "query": "Sia recorded a song \"the greatest\" that went in her seventh studio album called what?",
        "response": "This Is Acting",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Stanislav Smirnov or Grigori Perelman awarded the Fields Medal in 2010?",
        "response": "Stanislav Konstantinovich Smirnov",
        "source": "hotpot_qa"
    },
    {
        "query": "What political alignment is the media group organized by Lydia Sargent?",
        "response": "left-wing",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the Battle of Antietam and Operation Undertone both during World War I?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "To which film category are both Call Me Kuchu and That's Dancing! belong?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's husband pitched the idea to release Otro Día Más Sin Verte?",
        "response": "Gloria Estefan",
        "source": "hotpot_qa"
    },
    {
        "query": "Lost Paradise, released in February 1990, is the debut album of which gothic metal band that formed in 1988?",
        "response": "Paradise Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "What chord also known as fifth chord is prominent in Asian Kung-Fu Generation songs?",
        "response": "power chord",
        "source": "hotpot_qa"
    },
    {
        "query": "Donald K. Peterson was the former CFO of a multinational telecommunications equipment company headquartered in what state?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "The term \"ʻ ula-ʻ ai-hāwane\" is a Hawaiian phrase translating to \"red [bird] that eats \"hāwane\", it was only ever reported from the forested mountains of  Kohala, Hawaii, Kohala, is the name of the northwest portion of the island of Hawaiʻ i, in which location?",
        "response": "Hawaiian Archipelago",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American football coach and played the home games at Veterans Memorial Stadium in Troy? ",
        "response": "Neal Brown",
        "source": "hotpot_qa"
    },
    {
        "query": "What channel can you watch George Paul Blagden perform on television on in the U.S.?",
        "response": "Ovation",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2012 award was won by the writer of the \"Smile\" episode of the \"Doctor Who\" television series?",
        "response": "Guardian Prize",
        "source": "hotpot_qa"
    },
    {
        "query": "Sandra Dallas and Dee Brown, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which basketball club located in Alytus, Lithuania does Anatoly Kashirov play for?",
        "response": "BC Dzūkija",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was a side project of New Order bassist Peter Hook, Love Among Freaks or Monaco?",
        "response": "Monaco",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Mikhail Ilyukhin and Quinton Ramone \"Rampage\" Jackson have in common?",
        "response": "mixed martial artist",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Need You Around\" is a song featured in the soundtrack of a coming-of-age comedy film loosely based on a novel by who?",
        "response": "Jane Austen",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capitol of the district that Yapei is a part of? ",
        "response": "Buipe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English rock band's song \"Hand of Doom\" was the inspiration for the cover art on the album Black Science?",
        "response": "Black Sabbath",
        "source": "hotpot_qa"
    },
    {
        "query": "What name of a Canadian rock band formed in 1995 in Hanna, Alberta, Canada for which Robert John \"Mutt\" produced albums for? ",
        "response": "Nickelback",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Elia Suleiman and Wilson Yip from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Sea Life Michigan Aquarium is an interactive aquarium located at Great Lakes Crossing Outlets, an enclosed shopping mall, super-regional in size, located in the city of Auburn Hills, a suburb on the northern outskirts of metro Detroit, Michigan, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "James Cameron's 1986 extra-terrestrial horror film partially inspired Infestation, the 1990 video game published by what company?",
        "response": "Psygnosis",
        "source": "hotpot_qa"
    },
    {
        "query": "New Haven-style pizza is a style of a pizza believed to have evolved from what?",
        "response": "Jeyoun",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of the 1994 film Krantiveer was born January 1, 1951?",
        "response": "Nana Patekar",
        "source": "hotpot_qa"
    },
    {
        "query": "What town and state does the band who created the album \"The New Game\" come from?",
        "response": "Peoria, Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Zero Airport or Ziro Airport, is located at Ziro in the state of Arunachal Pradesh, India, Jet Airways showed interest in flying into the airport from where?",
        "response": "Delhi",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Fastbacks and Hüsker Dü formed in Saint Paul, Minnesota?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What song co-written by Sia was performed by Tokio Myers on Britain's Got Talent in semi-final 3?",
        "response": "Diamonds",
        "source": "hotpot_qa"
    },
    {
        "query": "Baz's Culture Clash was a television series presented by which \"50 Ways to Kill Your Mammy\" radio and tv personality?",
        "response": "Bazil Ashmawy",
        "source": "hotpot_qa"
    },
    {
        "query": "Crave Entertainment was an American video game company that went bankrupt in 2012, its headquarters was in Newport Beach, a seaside city in Orange County, California, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Russian-British physicist who shared the Nobel Prize in Physics in 2010 has established a reserach center dedicated to continuing the work with graphene in what country?",
        "response": "Singapore",
        "source": "hotpot_qa"
    },
    {
        "query": "Were \" Battle Sheep \" and \" Guess Who? \" both developed in the same year ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Marianne Moore and Terry Pratchett both nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "A Swarovski crystal mesh Armani Privé gown was worn by an Australian actress who has what middle name?",
        "response": "Elise",
        "source": "hotpot_qa"
    },
    {
        "query": "Longwall Street runs for about 300 metres along the western flank of a college that had an endowment of how much as of 2014 ?",
        "response": "£180.8 million",
        "source": "hotpot_qa"
    },
    {
        "query": "In what decades was the synthetic stimulant of which Alpha-Pyrrolidinopentiothiophenone is an analogue where the phenyl ring has been replaced by thiophene developed?",
        "response": "the 1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the self-described \"neoceltic pagan folk\" band based in the Netherlands formed?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Gerald McRaney actor in Get Low born?",
        "response": "August 19, 1947",
        "source": "hotpot_qa"
    },
    {
        "query": " Brampton is a hamlet in the West Lindsey district located 1 mi north-east of a small village that had how many inhabitants in 2011 ?",
        "response": "875",
        "source": "hotpot_qa"
    },
    {
        "query": "The home ground stadium for FC Copenhagen hosted a crowd of how many during the 2010 Danish Cup Final?",
        "response": "18,856",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the county in which Kentucky's 20th-largest city is located founded?",
        "response": "1822",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the main occupation of Hiroshi Sakaguchi, founder of Ki Arts, a traditional Japanese company in Northern California and who features in the 2010 documentary film directed by Tao Ruspoli, based on Martin Heidegger's philosophy?",
        "response": "carpenter",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of vegetation does Fothergilla and Clerodendrum have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "William J. \"Willem\" Dafoe has an apperance in American superhero film directed by who?",
        "response": "Zack Snyder",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has recieved a MacArthure Fellowship, Colson Whitehead or John Kenneth Galbraith?",
        "response": "Colson Whitehead",
        "source": "hotpot_qa"
    },
    {
        "query": "Aislinn Claire Paul, is a Canadian actress, she currently stars in which Hulu series, an American television horror series, that premiered on October 10, 2016?",
        "response": "Freakish",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote his ninth novel based on a brittish police officer with scotland yard",
        "response": "Charles Dickens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pizzeria chain is older Russo's New York Pizzeria or Toppers Pizza?",
        "response": "Toppers Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the literal translation of the full name of the gun that replaced the Arsenal submachine gun in Estonian service in 1938?",
        "response": "Machine-pistol Finland",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Johns Hopkins University and Baylor College of Medicine related?",
        "response": "research",
        "source": "hotpot_qa"
    },
    {
        "query": "Andy Duncan was the CEO of the group that operates what scheme?",
        "response": "UK National Lottery",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the publisher based in Farnham and a subsidiary of a multinational events and publishing company based in London established?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the man from Rock City Falls known as the Paper Bag King born in?",
        "response": "1823",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are Sibley Memorial Hospital and Walter Reed Army Medical Center located?",
        "response": "Washington D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": " Infernal Affairs III is a 2003 crime thriller film with a roll by an actor named by CNN as one of what?",
        "response": "Asia's 25 Greatest Actors of All Time",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 Texas A&M football team was led by the former head coach of which team from 2007 to 2011?",
        "response": "University of Houston",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of music do Gene, and The Dodos play?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "The dance double in the Black Swan dance double controversy involved which principal dancer of the American Ballet Theatre?",
        "response": "Sarah Lane",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays for Palmeiras and achieves representation from Juan Figer Svirski's organisation?",
        "response": "Zé Roberto",
        "source": "hotpot_qa"
    },
    {
        "query": "Trevor Carlin has had success in the junior motorsport formulas in a period spanning over 25 years, As Team Manager of Bowman Racing, he assembled a talented group of engineers,  in the team's first three seasons and won the 1989 Macau Grand Prix, a motor-racing event held annually in Macau, one of China's Special Administrative Regions, with who driving?",
        "response": "David Brabham",
        "source": "hotpot_qa"
    },
    {
        "query": "On 1 July 1943 the 3rd Government of Ireland was officially appointed and the new Fianna Fáil government was led by a prominent politician and statesman whose politica career spanned over half a what?",
        "response": "century",
        "source": "hotpot_qa"
    },
    {
        "query": "What defines Downers Grove as a thriller?",
        "response": "by the moods they elicit",
        "source": "hotpot_qa"
    },
    {
        "query": "In what region was Johanna Debreczeni born?",
        "response": "Pirkanmaa",
        "source": "hotpot_qa"
    },
    {
        "query": "Republic Airways Holdings, Inc. is an American airline holding corporation based in Indianapolis, Indiana, that owns which regional airline subsidiary of Republic Airways Holdings that operates service as American Eagle, Delta Connection, and United Express using a fleet of Embraer 170 and Embraer 175 regional jets?",
        "response": "Republic Airline",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the birth date of the actor and bodybuilder who starred in a film directed by Mads Matthiesen?",
        "response": "25 August 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Are James Glickenhaus and Dallas M. Fitzgerald both assocaited with silent films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Four Shores, is an album from the Latvian band Brainstorm, Lonely Feeling\" is dedicated to which Swedish-born American film actress, during the 1920s and 1930s? ",
        "response": "Greta Garbo",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of cells do Eric Kandel and Paul Greengard share a Nobel Prize for their research of?",
        "response": "neurons",
        "source": "hotpot_qa"
    },
    {
        "query": "SW8 (\"Secret Weapon 8\") is the code name for a wooden roller coaster currently under construction at Alton Towers in Staffordshire, United Kingdom, the attraction is set to be the park's first roller coaster constructed from wood and is to be manufactured by which Sunbury, Pennsylvania-based roller coaster manufacturer which has created several award-winning rides since its formation in 1994?",
        "response": "Great Coasters International, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which record company released a Megadeath song which contains instructions for hexes?",
        "response": "Capitol Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Which profession do Kevin Macdonald and Jerry Lewis have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Maxim Kontsevich and Aleksandr Lyapunov both mathematicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The band Salem had a song featured in a 2012 film directed by whom?",
        "response": "Derek Cianfrance",
        "source": "hotpot_qa"
    },
    {
        "query": "Globe Arena is a stadium used by which team that plays in League Two?",
        "response": "Morecambe Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the headquarters of the business that includes Houghton Wines as a subsidiary?",
        "response": "South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the calibre of the controversial rifle invented by Sir Charles Henry Augustus Frederick Lockhart Ross?",
        "response": ".303",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the most notable academic programs in the college whose head football coach from 1949 to 1952 was John Gagliardi?",
        "response": "Pre-Med and Nursing Majors",
        "source": "hotpot_qa"
    },
    {
        "query": "Ferdinand Johann Adam von Pernau was born in a castle now lying where ?",
        "response": "Bavaria, Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Bruce Irons brother?",
        "response": "Andy Irons",
        "source": "hotpot_qa"
    },
    {
        "query": "Dance and Laugh Amongst the Rotten is the fifth studio album by a band from what country?",
        "response": "the Netherlands",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more stage names, Simple Kid or Nic Nassuet?",
        "response": "Nic Nassuet",
        "source": "hotpot_qa"
    },
    {
        "query": "When was father of the Carter Family born?",
        "response": "December 15, 1891",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the other name of the textile mill on which The Mill was based on?",
        "response": "Styal Mill",
        "source": "hotpot_qa"
    },
    {
        "query": "What TV show's fifth season did the man who has earned more number-one albums than any other artist in US jazz chart history guest star on?",
        "response": "Will & Grace",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was published first The Liberator Magazine or Video Watchdog?",
        "response": "Video Watchdog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film written by Chris Coghill starred Jack O'Connell?",
        "response": "Weekender",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person who had a cameo on Caesar's Hour was born Lucille Fay LeSueur?",
        "response": "Joan Crawford",
        "source": "hotpot_qa"
    },
    {
        "query": "The KL-43 was paraded in front of cameras during what political scandal that occurred during the second term of the Reagan administration?",
        "response": "The Iran–Contra affair",
        "source": "hotpot_qa"
    },
    {
        "query": "What country is the man, with whom John Spencer beat in a 2006 primary, slated to become the next United States Ambassador for?",
        "response": "Singapore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one of the original five members of the Mission Mountain Wood Band was born in January, 1948?",
        "response": "Rob Quist",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Curve and Halestorm part of the Rock genre?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Kansas's 1st congressional district is a congressional district in the U.S. state of Kansas, Huelskamp was re-elected twice in 2012 and 2014, but lost the 2016 Republican primary for a fourth term to which obstetrician, and an American politician?",
        "response": "Roger Marshall",
        "source": "hotpot_qa"
    },
    {
        "query": "Barkha Sharma is an Indian fashion designer, in 2010, the duo styled who, which  is an Indian classical musician of Hindustani classical music, he plays santoor and is also a vocalist?",
        "response": "Rahul Sharma",
        "source": "hotpot_qa"
    },
    {
        "query": "Only You is an upcoming American science fiction horror-thriller film,the film stars Alfredo \"Alfred\" Molina, an English-American actor, born on which date?",
        "response": "24 May 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this region highly contested between Poland and Lithuania called in Polish where Lithuanian Education Society Rytas is located? ",
        "response": "Wilno",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older V. S. Naipaul or Margaret Atwood?",
        "response": "Sir Vidiadhar Surajprasad Naipaul",
        "source": "hotpot_qa"
    },
    {
        "query": "Which historical event is known as the Revolution of 1688 and caused the noble in Scotland to lose control over the Church of Scotland parish churches?",
        "response": "Glorious Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chuck Berry House is the former home of Chuck Berry in St. Louis, Missouri, the house was Berry's home when he wrote and first performed the majority of songs with which he is identified, including which 1956 hit single written by Chuck Berry, originally released on Chess Records, with \"Drifting Heart\" as the B-side?",
        "response": "Roll Over Beethoven",
        "source": "hotpot_qa"
    },
    {
        "query": "What English rock band that formed in 1964 worked with Alan Edwards?",
        "response": "The Who",
        "source": "hotpot_qa"
    },
    {
        "query": "What American photographer and photojournalist best known for his work for the Farm Security Administration is part of the \" loosely defined group of photographers who lived and worked in New York City during the 1930s, 1940s and 1950s\"?",
        "response": "Walker Evans",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the writer of the 1970 American romantic drama for which Ali MacGraw received an Academy Award for Best Actress?  ",
        "response": "Erich Segal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was best known for negotiating the agreement that placed a peanut butter candy manufactured by The Hershey Company in with Steven Spielberg's \"E.T. the Extra-Terrestrial\"?",
        "response": "John H. Dowd",
        "source": "hotpot_qa"
    },
    {
        "query": "The Big Green, is a 1995 family sports comedy film, by Walt Disney Pictures starring which English-American actress, singer and songwriter?",
        "response": "Olivia Jane d'Abo",
        "source": "hotpot_qa"
    },
    {
        "query": "Bernardo Sandals was founded in 1946 by architect Bernard Rudofsky and Berta Rudofsky, the core ideas of the designs were those Bertha taught at which school founded in 1933 in Black Mountain, North Carolina (near Asheville, North Carolina), emphasized the study of art as central to a liberal arts education?",
        "response": "Black Mountain College",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the single that the Jamaican reggae singer born in 1952 in Kingston, Jamaica was most known for?",
        "response": "Steely and Clevie",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Aniak Airport and Hoonah Airport have in common?",
        "response": "airport",
        "source": "hotpot_qa"
    },
    {
        "query": "What corporation created the game developed to teach school children about the realities of 19th century pioneer life?",
        "response": "Pressman Toy Corporation",
        "source": "hotpot_qa"
    }
]