[
    {
        "query": "Where the Hell's That Gold? is a Western film starring an actor whose most distinguishing physical quality was what?",
        "response": "his lazy left eye",
        "source": "hotpot_qa"
    },
    {
        "query": "What film trilogy was released during the fifth season of the show?",
        "response": "The Jimmy Timmy Power Hour",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: What town is the one of the ten districts in the Greater Accra Region of Ghana and the capital of Ga East district? A: Abokobi",
        "response": "Abokobi",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Javier Frana and Pavel Složil from Czechoslovakia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Cole is the cousin of a former American football running back who scored how many touchdowns in his career?",
        "response": "145",
        "source": "hotpot_qa"
    },
    {
        "query": "Zach Ville played college football for the Missouri Tigers named for a band of guards called what? ",
        "response": "Fighting Tigers of Columbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Mía Maestro had a role in the 2002 biopic directed by whom?",
        "response": "Julie Taymor",
        "source": "hotpot_qa"
    },
    {
        "query": "Saint Paul, Minnesota, is which of the largest metropolitan areas in the US? ",
        "response": "16th-largest",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Aurél Stromfeld or Georges Clemenceau ?",
        "response": "Georges Benjamin Clemenceau",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of colleges are the University of Wisconsin–Madison and the University of Texas at Austin?",
        "response": "public research university",
        "source": "hotpot_qa"
    },
    {
        "query": "One team in Tallinn refers to a football match scheduled for 9 October 1996, in World Cup qualifying European Group 4 between the national teams of Estonia and Scotland, the replayed match, staged at which stadium located in the Fontvieille district of Monaco?",
        "response": "Stade Louis II",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Standard Schnauzer and Thai Bangkaew Dog from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Juan Perez de Zurita arrived at the capital that lies on which river in 1558?",
        "response": "Dulce",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NBA All-Star MVP also played for the Michigan State Spartans in 1979?",
        "response": "Magic Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Have both Fiorella Bonicelli and Bob Hewitt won Grand Slam tournaments?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Andrei Olhovskiy and Stephen Huss from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Russian advance during the start of the Battle of Kostiuchnówka was also known as what?",
        "response": "June Advance",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the British adventurer who has his portraiture commissioned by Johnny Jonas born? ",
        "response": "7 June 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Taylor v. Louisiana and Rasul v. Bush landmark Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was murdered by Sylvia Raphael Schjødt in what is now considered the Lillehammer affair?",
        "response": "Ahmed Bouchiki",
        "source": "hotpot_qa"
    },
    {
        "query": "ITM University and Pacific Lutheran University, both are located in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both Korematsu v. United States and Chaplinsky v. New Hampshire cases regard the rights of U. S. citizens?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Red Queen is the story of the paternal grandmother of which king?",
        "response": "King Henry VIII",
        "source": "hotpot_qa"
    },
    {
        "query": "This Ghanaian footballer was a notable graduate of SC Bastia Reserves and Academy?",
        "response": "Michael Kojo Essien",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the seventh Disney Vacation Club resort, where the chalet-style building that was designed for small and medium-sized business meetings was formerly situated, open?",
        "response": "May 17, 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 2002 novel written by Alice Sebold?",
        "response": "The Lovely Bones",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city were the People's Choice Awards hosted, at the Nokia theatre, by an american actress who landed her breakthrough role as Bridget Hennessy?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": " The Rev. Dr. J. Lee Hill, Jr., is the Senior Pastor of Christian Fellowship Congregational Church (UCC) in San Diego, California, he has served this congregation since 2010, formerly serving which Christian church in Morningside Heights, Upper Manhattan, New York City?",
        "response": "Riverside Church",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, The Trials of Henry Kissinger or 4 Little Girls, was directed by Spike Lee?",
        "response": "4 Little Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to the 1980 American biographical black-and-white sports drama film, what other film is Andy Albeck most notably linked to?",
        "response": "Heaven's Gate",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film came out first, Olympia or Greetings from Out Here ?",
        "response": "Olympia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retired Spanish professional footballer is currently the co-assistant coach of Manchester City, alongside an English football coach and former player?",
        "response": "Mikel Arteta Amatriain",
        "source": "hotpot_qa"
    },
    {
        "query": "Gregory Kevin \"Bo\" Kimble, is a retired American college basketball player at Loyola Marymount University and professional National Basketball Association (NBA) player with the Los Angeles Clippers and New York Knicks, he led the 11th-seeded Loyola Marymount basketball team on a run to the regional finals of the NCAA Tournament after the death of teammate Hank Gathers, an American college basketball star at which location, who collapsed and died during a game?",
        "response": "Loyola Marymount University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the award named in honor of the English actor who studied at the Royal Academy and had an eight decade career?",
        "response": "Golden Quill",
        "source": "hotpot_qa"
    },
    {
        "query": "Of these two chief executives of the National Football League, Milton P. \"Milt\" Woodard and Allen Davis, who was born first?",
        "response": "Milton P. \"Milt\" Woodard",
        "source": "hotpot_qa"
    },
    {
        "query": "Hedley Marston attended a high school with a peak enrolment in the 1960s of how many students?",
        "response": "2,000",
        "source": "hotpot_qa"
    },
    {
        "query": "What major U.S. airline and the world's largest low-cost carrier headquartered in Dallas, Texas, ended service at Jack Brooks Regional Airport in 1980?",
        "response": "Southwest Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which producer both created the character of Dr. Izzie Stevens and also wrote the Dr. Izzie-focused episode \"Time Has Come Today\"",
        "response": "Shonda Rhimes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star in the Maltese Bippy died in 1987?",
        "response": "Dan Rowan",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series based on a 1988 novel featured Marissa Lee Neitling as Kara Foster?",
        "response": "\"The Last Ship\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Perelandra was a book published by the novelist of what nationality?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case dealt with the 4th Amendment, Schmerber v. California or Michigan v. EPA?",
        "response": "Schmerber v. California",
        "source": "hotpot_qa"
    },
    {
        "query": "The West Gate Bridge and the West Gate Distributor are located in what country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kamov V-80 eventually evolved into that single seat Russian attack helicopter?",
        "response": "Kamov Ka-50",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Cose della vita\" is a song originally released by a musician and singer-songwriter of what nationality?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger O. Egeberg was Assistant Secretary for Health and Scientific Affairs during the administration of a president that served during what years?",
        "response": "1969 until 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Hollywood directors Mike Figgis and Mick Jackson both originally from England?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The winner of season 21 of \"Dancing with the Stars\" (U.S.) is a star of a web series, Where this series was filmed ?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author is from Israel, Yehuda Amichai or Iris Rainer Dart?",
        "response": "Yehuda Amichai",
        "source": "hotpot_qa"
    },
    {
        "query": "What other country was Caroline Amalie's spouse king of besides Denmark?",
        "response": "Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "New Hampshire Wildcats men's ice hockey play at the center that was built for what sum?",
        "response": "$30 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What film was released first, That Darn Cat! or Heavyweights?",
        "response": "That Darn Cat!",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian–American actress stars in Batman: The Killing Joke? ",
        "response": "Tara Strong",
        "source": "hotpot_qa"
    },
    {
        "query": "What plant is part of the mustard family, Callisia or Orychophragmus?",
        "response": "Orychophragmus",
        "source": "hotpot_qa"
    },
    {
        "query": "Harry L. Fraser and George Kuchar, share which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The event known as \"The Show\", held at Adelaide's most popular event center, currently runs how long?",
        "response": "10 days",
        "source": "hotpot_qa"
    },
    {
        "query": "Skandar Keynes had a starring role in the series of fantasy films released by what company?",
        "response": "Walden Media",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Basement and Radiant City are both what?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Onizuka Prop Wash Award was named in memory of the student from what Hawaiian city?",
        "response": "Kealakekua",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were the producers of the album that contained the debut of the song \"Frankie Teardrop\"?",
        "response": "Craig Leon and Marty Thau",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress is married to John Travolta and starred in a 1994 film about a pregnant woman who is stranded at a trading post during the American Civil War?",
        "response": "Kelly Preston",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gynaika Magazine and New! Magazine both tailored to a female audience?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Cumberland Sheepdog and East-European Shepherd, are a breed of what?",
        "response": "Dogs",
        "source": "hotpot_qa"
    },
    {
        "query": "C.J. Hunter was tested positive for which type of injected steroid before he competed in the 2000 Summer Olympic Games?",
        "response": "anabolic–androgenic steroid (AAS)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band released more studio albums, Candlebox or Walt Mink?",
        "response": "Candlebox",
        "source": "hotpot_qa"
    },
    {
        "query": "What popular Indian Hindi lyricist penned the lyrics of Kala Bazar?",
        "response": "Shailendra",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song's video by rapper Paul Wall did Dennis Coles make a cameo appearance in?",
        "response": "\"Sittin' Sidewayz\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are John Dufresne and David Mamet both Pulitzer Prize winners?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeep Gladiator is based on this car that was sold and produced from 1963 to when?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Piers Sellers or Luca Parmitano?",
        "response": "Piers John Sellers",
        "source": "hotpot_qa"
    },
    {
        "query": "How many aerial victories were credited to the World War I flying ace who participated in a dogfight with the man who had claimed 44 victories before his death?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "Mythos Brewery's parent company's headquarters is located in what country?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "What song, by English singer, songwriter and model born 22 August 1995, was written by Caroline Ailin, Emily Warren and Ian Kirkpatrick?",
        "response": "New Rules",
        "source": "hotpot_qa"
    },
    {
        "query": "Israel Theo Hicks and August Wilson were involved with plays depicting what ethnicity?",
        "response": "African-American",
        "source": "hotpot_qa"
    },
    {
        "query": "Glaube Feitosa fought full bouts against the Dutch kickboxer who won the K-1 World Grand Prix how many times?",
        "response": "four",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Aksel Sandemose and Anne Rice both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "On which continent are both Halimium and Parkinsonia native?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent of origin does Mouille Point and Victoria & Alfred Waterfront have in common?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "History is the twelfth studio album by which American singer-songwriter, who was the father of folk singer Loudon Wainwright III, and singer Sloan Wainwright?",
        "response": "Loudon Snowden Wainwright Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Alana de la Garza starred as Connie Rubirosa in what long-running NBC drama?",
        "response": "\"Law & Order\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Cliff Bennett and the Rebel Rousers are a 1960s British rhythm and blues, soul and beat group who had two Top 10 hits, one being, Got to Get You into My Life, a song by who, first released in 1966 on the album \"Revolver\"?",
        "response": "Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor and YouTube personality born who's alongside Jennifer Veal was best known for her work on YouTube?",
        "response": "August 29, 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine has been published since 1899: Teen or Stanford Chaparral? ",
        "response": "Stanford Chaparral",
        "source": "hotpot_qa"
    },
    {
        "query": "Amy Fisher, the American woman who became known as \"the Long Island Lolita\", was paroled in what year, after shooting the wife of her lover, auto body shop owner from Long Island, in the face?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "The Samsung F480 is available from which holding company for Deutsche Telekom AG?",
        "response": "T-Mobile",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Heathens\" is a song by American musical duo Twenty One Pilots, released on which date, \"Heathens\" peaked at number two on the US \"Billboard\" Hot 100, tying with \"Stressed Out\"?",
        "response": "June 16, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the form of music played by Die Rhöner Säuwäntzt originate?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Which biblical figure is engraved upon the gem named for the son of King Lohair I?",
        "response": "Susanna",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the date of birth of the actress, who starred in the film Days of Being Wild alongside Leslie Cheung, Andy Lau, Maggie Cheung, Jacky Cheung and Tony Leung Chiu-wai?",
        "response": "8 December 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the awards ceremony that was hosted in 2007 by an American commercial broadcast television network headquartered on Pico Boulevard hosted?",
        "response": "Shrine Auditorium",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Charles Brabin and Nicola Black both from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In which town is maker of the Delemont collection located?",
        "response": "Ibach",
        "source": "hotpot_qa"
    },
    {
        "query": "What are some other areas that share a common deer species with the forests of Mara and Mondrem?",
        "response": "New Zealand, Canada, the United States, the Falkland Islands, and Peru.",
        "source": "hotpot_qa"
    },
    {
        "query": "By what nickname was the star of the film Alien 51 referred to? ",
        "response": "\"Hollywood Madam\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Aaron Goodwin is a sports agent who represented a client who was born when?",
        "response": "August 7, 1989",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1990 United States elections occurred in the middle of the presidential term of an American politician who was father to what man who was the 43rd president of the United States?",
        "response": "George W. Bush",
        "source": "hotpot_qa"
    },
    {
        "query": "USS \"Elrod\" (FFG-55), an \"Oliver Hazard Perry\"-class frigate, is a ship of the United States Navy named after Captain Henry T. Elrod (1905–1941), a Marine aviator who was posthumously awarded the Medal of Honor in World War II, for his heroism in the defense of which coral atoll in the western Pacific Ocean in the northeastern area of the Micronesia subregion, 1,501 mi east of Guam, 2,298 mi west of Honolulu and 1,991 mi southeast of Tokyo?",
        "response": "Wake Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Get Your Phil includes which song written by Bruce Springsteen and Patti Smith?",
        "response": "Because the Night",
        "source": "hotpot_qa"
    },
    {
        "query": "Le Chatelier's principle is sometimes named after what German inventor, physicist and Nobel laureate in physics? ",
        "response": "Karl Ferdinand Braun",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pantages Theatre hall's ceiling was decorated with a skylight by what American luxury jewelry and specialty retailer?",
        "response": "Tiffany & Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Adolph Louis Camilli, was an American first baseman in Major League Baseball who spent most of his career with the Philadelphia Phillies and Brooklyn Dodgers, his brother, who boxed under which name, was an Italian-American boxer who fought professionally as a heavyweight, died of cerebral hemorrhaging following a 1930 match with Max Baer?",
        "response": "Frankie Campbell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie that won Best Asian Film at the 21st Hong Kong Film Awards?",
        "response": "Hayao Miyazaki",
        "source": "hotpot_qa"
    },
    {
        "query": "Which manager of Premier League club Crystal Palace unveiled a statue in 2013 at St. Georges Park?",
        "response": "Roy Hodgson",
        "source": "hotpot_qa"
    },
    {
        "query": "Dead Space 2 and Dead Space 3 are both science fiction survival horror games, but when was Dead Space 3 re;esed internationally?",
        "response": "February 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "Barry Keoghan, is an Irish actor, he has appeared in which 2017 psychological horror-thriller film directed by Yorgos Lanthimos, from a screenplay by Lanthimos and Efthymis Filippou?",
        "response": "The Killing of a Sacred Deer",
        "source": "hotpot_qa"
    },
    {
        "query": "What Hospital serves as a teaching hospital for Georgetown University School of Medicine,  MedStar Washington Hospital Center or Walter Reed Army Medical Center?",
        "response": "MedStar Washington Hospital Center",
        "source": "hotpot_qa"
    },
    {
        "query": "What former Mexican drug lord is the nephew of the former leader of the Gulf Cartel (Spanish: \"Cártel del Golfo\" ) and Los Zetas?",
        "response": "Rafael Cárdenas Vela",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Gert Bo Jacobsen and Greg Haugen were professionals at what sport?",
        "response": "boxer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in Smurfs: The Lost Village and was also in The Office?",
        "response": "Ellie Kemper",
        "source": "hotpot_qa"
    },
    {
        "query": "3D Bomb Alley has gameplay that refers to the battle that took place between what dates?",
        "response": "21 to 25 May 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "What game was created by Klaus Teuber and published by Kosmos in German and Mayfair Games in English, The Kids of Catan or Scattergories?",
        "response": "The Kids of Catan",
        "source": "hotpot_qa"
    },
    {
        "query": "What documentary was narrated by an actor from the film \"Howard's End\"?",
        "response": "Horror in the East",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2001, what was the population of the town where John Cotton served as a minister?",
        "response": "35,124",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the establishment year of this military base north of the city of Concord, California at the shore of the Sacramento River and adjacent to Shore Acres, California?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "Worst Bakers in America is a cooking competition television series presented by Lorraine Pascale and an executive chef of what Baltimore-based shop?",
        "response": "Charm City Cakes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did The Who release the double album rock opera that preceded the Who's Next studio album?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Texas v. White and United States v. Curtiss-Wright Export Corp. were argued in what court?",
        "response": "The Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "What is  Lauri Ylönen and Kim Jong-hyun's main occupation?",
        "response": "singer-songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Aspen Creek Grill (formerly Aspen Creek) is a restaurant chain previously owned by which American chain restaurant that specializes in steaks and promotes a Western theme, and is headquartered in Louisville, Kentucky?",
        "response": "Texas Roadhouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain in the Alps between Switzerland and Italy was created by marine sedimentary rocks folding into mountain peaks?",
        "response": "Matterhorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Yarmouk University and University of New Haven located in the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Trials of Nikki Hill is a legal thriller written by Dick Lochte and which American lawyer, author, actor, lecturer, and practicing attorney?",
        "response": "Christopher Allen \"Chris\" Darden",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the star of Zabardast, who is a member of the Kapoor family, born?",
        "response": "25 August 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "What four-engine turboprop military transport is operated by No. 84 Wing?",
        "response": "Lockheed Martin C-130J Super Hercules",
        "source": "hotpot_qa"
    },
    {
        "query": "What writer dida reworking of an Enrest Hemingway novel about a group of American and British expatriates who travel from Paris to the Festival of San Fermín in Pamplona to watch the running of the bulls and the bullfights?",
        "response": "Robert Antoni",
        "source": "hotpot_qa"
    },
    {
        "query": "Nico Constantine is an American music director that is known for his work with this rock band from Atlanta, Georgia?",
        "response": "Biters",
        "source": "hotpot_qa"
    },
    {
        "query": "Lexie Grey is a part of the ABC medical drama series that began airing on what date?",
        "response": "March 27, 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul David Hewson co-wrote what song with Johnny Hallyday?",
        "response": "I Am the Blues",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Lost in Florence also starred in Master of None?",
        "response": "Alessandra Mastronardi",
        "source": "hotpot_qa"
    },
    {
        "query": "League of My Own II is a studio album by which English rapper?",
        "response": "Chip",
        "source": "hotpot_qa"
    },
    {
        "query": "Which county did Iran compete in during the 2016 Winter Youth Olympics",
        "response": "Oppland county",
        "source": "hotpot_qa"
    },
    {
        "query": "Actor Sylvester Stallone's younger brother starred in what 1991 American action comedy film?",
        "response": "Hudson Hawk",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Colombian-Canadian electronic musician incorporates a variety of styles and influences and released the album La Papessa, which won the 2017 Polaris Music Prize?",
        "response": "Lido Pimienta",
        "source": "hotpot_qa"
    },
    {
        "query": "Which hospital has more wrongful death lawsuits, Howard University Hospital or MedStar Washington Hospital Center?",
        "response": "Howard University Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Cate Shortland or Aaron Katz ?",
        "response": "Cate Shortland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who became the 2nd head coach since 1948 to win the national championship in his first season and was the head coach of the University of Miami during the 2006 NCAA Division I FBS football season?",
        "response": "Larry Edward Coker",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former CEO of Enron Corporation.who had a case in theUnited States Supreme Court born ",
        "response": "November 25, 1953",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of where WJKK studios are located in ",
        "response": "24,047 at the 2010 census",
        "source": "hotpot_qa"
    },
    {
        "query": "Irving Pichel and Luigi Comencini both worked in the film industries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Unidentified Flying Oddball is a 1979 film adaptation of a book by the American writer who also wrote Adventures of Huckleberry Finn which is often called what?",
        "response": "The Great American Novel",
        "source": "hotpot_qa"
    },
    {
        "query": "Roughlee is located located at the foot of the hill that has a summit of what elevation?",
        "response": "557 m",
        "source": "hotpot_qa"
    },
    {
        "query": "The English land owner and politician from a small town and civil parish on the River Calder sat in which branch of government?",
        "response": "House of Commons",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won 18 races driving Watson cars and an American race driver with 26 victories in top echelon open-wheel racing?",
        "response": "Rodger Ward",
        "source": "hotpot_qa"
    },
    {
        "query": "What retired professional basketball player was Kenny Green selected a spot ahead of during an NBA draft?",
        "response": "Karl Malone",
        "source": "hotpot_qa"
    },
    {
        "query": "Harrelson Boulevard runs near the second-largest mall in what state?",
        "response": "South Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Umi-a-Liloa inherited authority of a kind which is a belief in what?",
        "response": "belief in many deities and spirits",
        "source": "hotpot_qa"
    },
    {
        "query": "Within Four Corners of the United States, which unit of the National Park Service has ruins of the indigenous tribes and is within the boundaries of the Navajo Nation?",
        "response": "Canyon de Chelly National Monument",
        "source": "hotpot_qa"
    },
    {
        "query": "Southeastern Airlines was acquired by a carrier of what regional airline that operates short and medium-haul routes?",
        "response": "Delta Connection",
        "source": "hotpot_qa"
    },
    {
        "query": "Grandma was a film that starred the actree and comedian who had a breakout role on what variety show?",
        "response": "Rowan & Martin's Laugh-In",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the fictional character portrayed in Ragnarok film first appreared?",
        "response": "Journey into Mystery",
        "source": "hotpot_qa"
    },
    {
        "query": "What major city was Eastern Condors, an action film co-starring the winner of Miss Hong Kong 1984, filmed in?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "Henry Ephraim Robins the the eighth President of a college in a state with what capital?",
        "response": "Augusta",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alumni is featured in the Jordan Brand Classic? ",
        "response": "Kevin Durant.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2004 Ecuadorian film produced the The Devil's Backbone creator?",
        "response": "Sebastián Cordero",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1975 FA Cup Final have two former captains of what international football league?",
        "response": "England national football team",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Latina and Electronic Gaming Monthly American magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The soap opera Jasmine Armfield acts in has been broadcast on BBC One since what year?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Sir Edmund Gardner feature Sherlock Holmes arch enemy more or less than Sir Arthur Conan Doyle?",
        "response": "three continuation novels containing Sir Arthur Conan Doyle's fictional villain,",
        "source": "hotpot_qa"
    },
    {
        "query": "What former American football wide receiver played for the Miami Dolphins with Dan Marino?",
        "response": "Mark Clayton",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Guglielmo Marconi and Karl Ferdinand Braun connected?",
        "response": "inventor",
        "source": "hotpot_qa"
    },
    {
        "query": "The SEHK includes the Kingdee International Software Group Limited, which was founded where?",
        "response": "Shenzhen, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Shawnee Mission East High School is in what major school district in the Kansas City area?",
        "response": "Shawnee Mission School District",
        "source": "hotpot_qa"
    },
    {
        "query": "Spider-Man/Black Cat: The Evil That Men Do was published by which company that was bought by Disney?",
        "response": "Marvel Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which championship where Steve Agnew was relegated, is the second highest overall championship in the English football league system?",
        "response": "English Football League Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to the individual born on August 21, who else wrote He's The Great Imposter?",
        "response": "Sharon Sheeley",
        "source": "hotpot_qa"
    },
    {
        "query": "Buried Alive was from the studio album that was released on what date?",
        "response": "October 21, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "NASA's Story is a documentary series by Dangerous Films for the BBC to commemorate 50 years since the formation of NASA, the show includes various interviews with astronauts and NASA personnel such as which American engineer and former astronaut, he was one of the first two humans to land on the Moon, and the second person to walk on it?",
        "response": "Buzz Aldrin",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in Denmark was Heinrich Holk a mercenary?",
        "response": "Helsingør",
        "source": "hotpot_qa"
    },
    {
        "query": "Which comedian that starred in Comedy Central's \"The Awkward Comedy Show\" also starred in \"Nerdland\"?",
        "response": "Hannibal Buress",
        "source": "hotpot_qa"
    },
    {
        "query": "Cypella and Deutzia, are types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What star in Keep It Up Downstairs has played the Artful Dodger?",
        "response": "Jack Wild",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Andy Yorke and David Vincent have in common?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Team2015 was setup by this politician who was former Minister of State at the Department for what?",
        "response": "International Development",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the wealth funds that Knut N. Kjær was the manager of from 1997 to 2008?",
        "response": "the government of Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older Charlie Papazian or John Matoian?",
        "response": "John Matoian",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both John Roecker and Michael Gordon stage actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"Dokkōdō\", is a short work written by Miyamoto Musashi (宮本 武蔵 ) a week before he died in 1645, \"Dokkodo\" was largely composed on the occasion of Musashi giving away his possessions in preparation for death, and was dedicated to his favorite disciple, Terao Magonojō (to whom the earlier \"Go rin no sho\" [\"The Book of Five Rings\"] had also been dedicated), The Book of Five Rings (五輪書 , \"Go Rin no Sho\" ) is a text on kenjutsu and the martial arts in general, written by the swordsman Miyamoto Musashi circa which year?",
        "response": "1645",
        "source": "hotpot_qa"
    },
    {
        "query": "Renee Montagne and Steve Inskeep succeeded what Peabody Award-winning member of the National Radio Hall of Fame, as the host of National Public Radio's weekday morning news program?",
        "response": "Robert Alan \"Bob\" Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the vocal range of the performer on the 2010 album \"Laws of Illusion\"?",
        "response": "mezzo-soprano",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer who recorded the song \"In the Misty Moonlight\" was known as \"Gentleman Jim\"?",
        "response": "James Travis Reeves",
        "source": "hotpot_qa"
    },
    {
        "query": "the eastern terminus of the Tung Chung Line sits underneath an integrated commercial development  located where?",
        "response": "the waterfront of Hong Kong's Central District",
        "source": "hotpot_qa"
    },
    {
        "query": "What program used to classify DNA by autosomal results is National Institute of Standards and Technology certified?",
        "response": "OmniPop",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American actress, singer, and an artists that  uses their voices or bodies, often in relation to other objects, to convey artistic expression? ",
        "response": "Leslie Carrara-Rudolph",
        "source": "hotpot_qa"
    },
    {
        "query": "What Canadian actress starred in an American psychological horror drama television series that aired on A&E from 2013-2017?",
        "response": "Aliyah O'Brien",
        "source": "hotpot_qa"
    },
    {
        "query": "Which other villages the Great Barrington includes except a ski resort located on Warner Mountain in The Berkshires?",
        "response": "Van Deusenville and Housatonic",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the female student of the Swiss psychiatrist who coined the term \"schizophrenia\" born in 1882?",
        "response": "Poland",
        "source": "hotpot_qa"
    },
    {
        "query": "What company, formerly known as Freedom4 Group plc and Pipex Communications plc, acquired Daisy Wholesale, formerly O-bit Telecom, in 2010?",
        "response": "Daisy Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Billy Greer, is the current bass guitarist for the band Kansas, he also was a member of the brief 2009 Kansas side project \"Native Window\" along with David Ragsdale, he has been the violinist for which band, from 1991 to 1997 and from 2006 to the present?",
        "response": "Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What civil parish in Cheshire, England contains Scholar Green, which is located next to the isolated village of Mow Cop, 24 miles south of Manchester and 6 miles north of Stoke-on-Trent?",
        "response": "Odd Rode",
        "source": "hotpot_qa"
    },
    {
        "query": "Tripel was the strongest beer in their range, in 1956, served at a Trappist brewery in what country?",
        "response": "Belgium",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more band members, Grimes or Nickelback?",
        "response": "Nickelback",
        "source": "hotpot_qa"
    },
    {
        "query": "Jean Martinelli was the star of an Alfred Hitchcock film set in what resort location?",
        "response": "French Riviera",
        "source": "hotpot_qa"
    },
    {
        "query": "Home on the Range and Bridge to Terabithia, are films of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is native to farther east, Punch or Chimayó Cocktail?",
        "response": "Punch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the illegitimate daughter of the President involved in the Teapot Dome scandal?",
        "response": "Elizabeth",
        "source": "hotpot_qa"
    },
    {
        "query": "What television series is inspired by the 1998 movie Zakhm replaced Diya Aur Baati Hum?",
        "response": "Naamkarann",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Maya had a international hit based which refrain composed by Azerbaijani musician Eldar Mansurov?",
        "response": "Bayatılar",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the English title for a song written and recorded by an Argentine duo with more than 25 million records sold worldwide?",
        "response": "\"Get Out of My Life, Now!\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played Botswana's first president in A United Kingdom?",
        "response": "David Oyelowo",
        "source": "hotpot_qa"
    },
    {
        "query": "Shaun Cleaver graduated from which bilingual public research university?",
        "response": "University of Ottawa",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the country of origin of the producer from the movie staring Brandon Lee?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Iridescent was the final single from which 2010 Linkin Park album?",
        "response": "A Thousand Suns",
        "source": "hotpot_qa"
    },
    {
        "query": "Theo Green is known for his sound design in Blade Runner 2049, which is a sequel to a movie of the nearly same name, released in what year?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Adiliya has a park based on what type of elevated structure?",
        "response": "water tower",
        "source": "hotpot_qa"
    },
    {
        "query": "Ian Arthur Cawsey (born 14 April 1960) is a British Labour Party politician who was the Member of Parliament (MP) for which organization constituency in Yorkshire and Lincolnshire represented in the House of Commons of the UK Parliament?",
        "response": "Brigg and Goole",
        "source": "hotpot_qa"
    },
    {
        "query": "The Predator is an upcoming film starring an actor known for his role as Roland Burton on what series?",
        "response": "Army Wives",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed first, Paramore or You Am I?",
        "response": "You Am I",
        "source": "hotpot_qa"
    },
    {
        "query": "A 2013 Smurfs moving is based on what short story that was originally published in 1820?",
        "response": "The Legend of Sleepy Hollow",
        "source": "hotpot_qa"
    },
    {
        "query": "What American Media Company owns the video game developer studio founded on October 3, 2012, based in Austin, Texas?",
        "response": "ZeniMax Media",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of this American former professional basketball player, who was voted MVP in the 1994 NBA All Star Game?",
        "response": "September 25, 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther north, Heather Nova or The Delgados?",
        "response": "The Delgados",
        "source": "hotpot_qa"
    },
    {
        "query": "In which prestigious venues did the Pakistani female singer performed who's some songs were written by Riaz-Ur-Rehman Saghar?",
        "response": "Royal Albert Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Hangman stars what actress who began her acting career in \"Campfire Tales\"?",
        "response": "Amy Smart",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and illustrated the book on which the plot of the film \"I'm Here\" is based?",
        "response": "Shel Silverstein",
        "source": "hotpot_qa"
    },
    {
        "query": "The film Darkon follows the Darkon Wargaming Club based in Baltimore, Maryland, a group that participates in an activity with this 4-letter acronym name.",
        "response": "LARP",
        "source": "hotpot_qa"
    },
    {
        "query": "Massenet Festival is a festival of music by which Romantic Era composer?",
        "response": "Jules Émile Frédéric Massenet",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the Irish author of the book about the adventures of the skeleton detective and a teenage girl born?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "Laminacauda insulana is a species of sheet weaver found in Tristan da Cunha, colloquially Tristan, is the name of both a remote group of volcanic islands in the south Atlantic Ocean and the main island of that group, the nearest continental land, is which country  ?",
        "response": "South Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Mustafa Badreddine was a military leader of a militant group that is now headed by what man?",
        "response": "Hassan Nasrallah",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the book about which Paul R. Gross written with Barbara Forrest in 2004?",
        "response": "the origins of intelligent design",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is this American singer, banjo player, guitarist and a prominent figure in Appalachian folk music who performed the song The Moonshiner from?",
        "response": "Kentucky",
        "source": "hotpot_qa"
    },
    {
        "query": " Baoan Coleman was the voice of a Vietnamese immigrant in an American animated television series created by who?",
        "response": "Craig Bartlett",
        "source": "hotpot_qa"
    },
    {
        "query": "Whom did Ron Lyle and Oscar Bonavena both box?",
        "response": "Muhammad Ali",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the film that connects An Elephant Called Slowly to Born Free?",
        "response": "Open Road Films Ltd. and Columbia Pictures",
        "source": "hotpot_qa"
    },
    {
        "query": "Telegraph City is located on the telegraph line between Sonora and the city that was founded by who?",
        "response": "Captain Charles Maria Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "What son of a Chinese fencer is an entertainer and is fluent in 6 languages?",
        "response": "Jackson Wang",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Santarpia, began his career as an amateur boxer and made it all the way to the semi finals in the New York Golden Gloves, on that team was three time world champ Carlos Ortiz, of which nationality?",
        "response": "Puerto Rican",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the singer who was born April 12, 1987 and was part of the band who released the single \"I Write Sins Not Tragedies\"?",
        "response": "Brendon Urie",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kiki's Delivery Service and The Jungle Book both fantasy novels and films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Maximum Chase is a 2002 action video game with one of the licensed cars being an automobile designed to compete with what?",
        "response": "Ford Mustang",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the address of the building that houses the Chicago Sports Museum?",
        "response": "835 North Michigan Avenue",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Academy Award nominated screenwriter worked on a 2004 film directed by Terry George?",
        "response": "Keir Pearson",
        "source": "hotpot_qa"
    },
    {
        "query": "Ard Crags and Newlands Valley are both located where?",
        "response": "Cumbria, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the teams park based in Miami, Florida, who's pitcher previously played in Major League Baseball  for the Arizona Diamondbacks and Detroit Tigers?",
        "response": "Marlins Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2008 film starring a co-host on the Fox News talk show \"Outnumbered\"?",
        "response": "Robert Townsend",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Czech born American physicist was the author of several works on optics and edited the a series of books called, Progress in Optics?",
        "response": "Emil Wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "Paranoia 1.0 includes an actor who began acting as what character in \"My Little Girl\"?",
        "response": "Arthur",
        "source": "hotpot_qa"
    },
    {
        "query": "Which f beer brewed in the Pajottenland region  American wild ale similar to ",
        "response": "Lambic",
        "source": "hotpot_qa"
    },
    {
        "query": "The title character in Jason Reitman's comedy film \"Juno\" also starred in a 2005 drama written and directed by who?",
        "response": "Alison Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "Which novelist, Malcolm Lowry or Joseph Wambaugh, was born first?",
        "response": "Malcolm Lowry",
        "source": "hotpot_qa"
    },
    {
        "query": "Louie R. Guenthner, Jr. represented the 48th District in Jefferson COunty from 1973 to 1988 including an affluent area with what population as of the 2000 U.S. Census?",
        "response": "2,882",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014–15 Southampton F.C. season was the club's 16th season in the Premier League and their 38th in the top division of English football, i t was also the club's first season with Dutch manager Ronald Koeman, who replaced Mauricio Roberto Pochettino, an Argentine former footballer who played as a central defender, and is the current manager of which Premier League club?",
        "response": "Tottenham Hotspur",
        "source": "hotpot_qa"
    },
    {
        "query": "Scholar and educator  Isaac S.D. Sassoon is a member of the Sassoon family because of their great wealth they accumulated they are also called what?",
        "response": "\"Rothschilds of the East\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Pyotr Ilyich Tchaikovsky and Giuseppe Verdi have this profession in common.",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "Brittany Force is the daughter of which 16-time champion in Funny Car?",
        "response": "John Harold Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was invented by David Change, Operation or Ghettopoly?",
        "response": "Ghettopoly",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2015 MTV Video Music Awards featured the music video premier of a song off of Taylor Swift's fifth studio album, which was called what?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the hip hop album that was released by Universal Motown Records but includes guest appearances by many artists including an indie pop duo (consisting of David-Andrew Wallach and Maxwell Drummey? ",
        "response": "Asleep in the Bread Aisle",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Steve Dildarian and Mia Tyler both former advertising copywriters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2011, what television network featured the marquee matchup for the 2009 John Wooden Award winner?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the early prominent German Nazi official and politician born who was murdered during the Night of the Long Knives and who stars as Gregor Strasser in  Hitler (1962)? ",
        "response": "31 May 1892",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American author that caused a reprint of the originally published 1987 book \"Jenny and the Jaws of Life\" in 2002?",
        "response": "David Sedaris",
        "source": "hotpot_qa"
    },
    {
        "query": "Why We Broke Up was written by the author who has what pseudonym?",
        "response": "Lemony Snicket",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the American ventriloquist who's voice was featured in The Nut Job 2: Nutty by Nature born?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "What is an alternate name for the language that uses the word 'Mitumba'?",
        "response": "Kiswahili",
        "source": "hotpot_qa"
    },
    {
        "query": "Meg, a science fiction action horror film, is set to be released on August 10th, 2018 that has a star actress born on what date?",
        "response": "June 17, 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "This specialism of 19th-century academic art was among the special interests of this academic who taught at which University?",
        "response": "University of Glasgow",
        "source": "hotpot_qa"
    },
    {
        "query": "Edelweiss Broking Limited registered with what stock exchange known for being the first exchange in India to offer a modern and fully automatic electronic trading system?",
        "response": "National Stock Exchange of India",
        "source": "hotpot_qa"
    },
    {
        "query": "What Big 12 Conference basketball team did Myles Turner play for?",
        "response": "Texas Longhorns men's basketball",
        "source": "hotpot_qa"
    },
    {
        "query": "Which location hosts both the Throne of Jahangir and the UNESCO World Heritage site?",
        "response": "Agra Fort",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following cities is situated at the confluence of the Tuo River and the Yangtze River: Luzhou or Xianning?",
        "response": "Luzhou",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian aquatic aquarium displays more than 700 species and serves as a commuter wharf?",
        "response": "Aquarium ferry wharf",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cathedral of St Michael and St George, Aldershot and Manchester Cathedral located in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie out of the \"Naked\" Hongkong film series starred the actress Maggie Q?",
        "response": "Naked Weapon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach for the team that won the 2004 Sugar Bowl?",
        "response": "Nick Saban",
        "source": "hotpot_qa"
    },
    {
        "query": "Birch Point is a peninsula that is located in what county of Maine?",
        "response": "Washington County",
        "source": "hotpot_qa"
    },
    {
        "query": "Now That's What I Call Music! 56, is the 56th edition of the \"Now!\" series in the United States, it features which song by Taylor Swift featuring Kendrick Lamar, from her fifth studio album \"1989\" (2014)?",
        "response": "Bad Blood",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the house that Nathaniel Hawthorne was born in built for?",
        "response": "Captain John Turner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the guest stars in The Paul Lynde Halloween Special was born in December 15, 1933?",
        "response": "Tim Conway",
        "source": "hotpot_qa"
    },
    {
        "query": "What geography do both Paolo Nespoli and Soyuz TMA-20 have in common?",
        "response": "International Space Station",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sovereign Arab state in Western Asia did Fahad Al-Harifi Al-Bishi play for?",
        "response": "Saudi Arabia",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor has appeared in the films \"Hamlet\", \"The Woodlanders\" and \"The Holiday\"?",
        "response": "Rufus Frederik Sewell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book, which is described by the author on its cover as a \"thumping good detective-ghost-horror-who dunnit-time travel-romantic-musical-comedy-epic, was turned into a comic science fiction television series called Dirk Gently?",
        "response": "Dirk Gently's Holistic Detective Agency",
        "source": "hotpot_qa"
    },
    {
        "query": "Hiba Michel Tawaji, is a Lebanese soprano coloratura singer, actress, and director, and also participated in the fourth season of France's version of \"The Voice\", in which she was coached by which Lebanese and English singer and songwriter?",
        "response": "Mika",
        "source": "hotpot_qa"
    },
    {
        "query": "What duo  was an American rapper and record producer apart of , who had a guest appearance in  the second album by American hip hop duo 1982 ?",
        "response": "Mobb Deep",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the group, which organised the Mexican referendums, 1989, based?",
        "response": "Chiapas",
        "source": "hotpot_qa"
    },
    {
        "query": "Fourmile Creek is a tributary of which  fourth-largest lake of the five Great Lakes in North America?",
        "response": "Lake Erie",
        "source": "hotpot_qa"
    },
    {
        "query": "Who established himself as the acclaimed host of televisions show and was in a Austrian-West German musical comedy film?",
        "response": "Peter Alexander",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who inspired the movie Partner was born in what year?",
        "response": "1968",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American rapper, songwriter, record producer, record executive, director, actor, and model, who collaborated with Overdoz?",
        "response": "October 3, 1988",
        "source": "hotpot_qa"
    },
    {
        "query": "Preston Catholic College closed after one of its classes merged with two other schools to form what Catholic sixth form college near Preston?",
        "response": "Cardinal Newman College",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is published in a bigger city, Kennebec Journal or Portland Press Herald?",
        "response": "Portland Press Herald",
        "source": "hotpot_qa"
    },
    {
        "query": "The USS Constellation is a supercarrier in this country's armed forces which has how many uniformed services?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "The International Movement for an Imaginist Bauhaus was a small European avant-garde artistic tendency that arose out of the breakup of a movement active between which years ?",
        "response": "1948 to 1951",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company whose stores were the sole manner the physical version of American Dream was made available headquartered?",
        "response": "Richfield, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kabru and Mount Everest both on the border between Nepal and India?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this themed land run by Walt Disney Company that contains the restaurant Hakuna Matata?",
        "response": "Adventureland",
        "source": "hotpot_qa"
    },
    {
        "query": "Reg Mountford played football that for a team that competes in which league?",
        "response": "the Premier League",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mirpur University of Science and Technology and University of Debrecen both Universities located outside of the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Hollywood\" was a rock song made famous by which band headed by the Irish musician and singer songwriter Dolores O'Riordan?",
        "response": "The Cranberries",
        "source": "hotpot_qa"
    },
    {
        "query": "Which recording artist is from the United States, Alex Clare or Audioslave?",
        "response": "Audioslave",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the structure located across from what used to be occupied by Canadian Tire? ",
        "response": "Wallman Clewes Bergman Architects",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fridge had booked such acts as the English singer and DJ who was the lead singer of what pop band?",
        "response": "Culture Club",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Pearl Jam album which Brendan O'Brien never worked on released? ",
        "response": "August 27, 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "What war was Operation Lucid and Operation Sea Lion planned during?",
        "response": "Second World War",
        "source": "hotpot_qa"
    },
    {
        "query": "Sweet Noise is a Polish alternative metal band, Mohamed is the singer, musician, performer, producer and conceptual artist,  M.T.void is a musical outfit run by Mohamed and Justin Gunnar Walter Chancellor,  an English musician formerly in the band Peach but best known as the bass player for which rock band ?",
        "response": "Tool",
        "source": "hotpot_qa"
    },
    {
        "query": "Randall Cunningham II was a multi-sport athlete at the high school located in what Nevada city?",
        "response": "Summerlin",
        "source": "hotpot_qa"
    },
    {
        "query": "When is the election held for the position former policy director Krishanti \"Krish\" Vignarajah is running in?",
        "response": "November 6, 2018",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the National Hockey League team, in which Melville Vail played two seasons with, founded?",
        "response": "1926",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist performed at Stand Up to Cancer, and had the highest grossing tour in the world in 2015",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the company that owns the IWGP Tag Team Championship founded?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released first, The Greatest Game Ever Played or Hot Lead and Cold Feet?",
        "response": "Hot Lead and Cold Feet",
        "source": "hotpot_qa"
    },
    {
        "query": "Willie Louis, previously Willie Reed, was a witness to the murder of which 14-year-old African-American who was lynched in Mississippi in 1955, after a white woman said she was offended by him in her family's grocery store?",
        "response": "Emmett Till",
        "source": "hotpot_qa"
    },
    {
        "query": "Aliens of the Deep and The One and Only, Genuine, Original Family Band are what kind of entertainment? ",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Adelaide, South Australia's biggest and most popular event, attended by up to half a million people every year, held in the Adelaide Showground?",
        "response": "Royal Adelaide Show",
        "source": "hotpot_qa"
    },
    {
        "query": "are the magazines In Touch Weekly and Genre both aimed at the same readership?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is larger, Sierra Nevada National Park, or Tablas de Daimiel National Park?",
        "response": "Sierra Nevada National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the city where I-15, the only Interstate highway in this city, meets four other highways at an intersection known as the Spaghetti Bowl.",
        "response": "Las Vegas",
        "source": "hotpot_qa"
    },
    {
        "query": "Refuge Robert Blanc is a refuge in the Alps located on the route of a popular walk that is roughly how long?",
        "response": "170 km",
        "source": "hotpot_qa"
    },
    {
        "query": "Mick Betancourt has been a scriptwriter for the police procedural drama created by whom?",
        "response": "Dick Wolf and Matt Olmstead",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of The Merchanter novels born?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": " Maya Kazan is the younder sister of an actress who portrayed Emily Gardner in what film?",
        "response": "The Big Sick",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator of the animated television series that its fourteenth episode of season three's title is \"Time Keeps on Slippin\"?",
        "response": "Matt Groening",
        "source": "hotpot_qa"
    },
    {
        "query": "Rob Kardashian and Andy Serkis, are American?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 480 is named for the first American to do what?",
        "response": "orbit the Earth",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the county seat of a county located in the U.S. state of Nevada where the Sheep Range is found?",
        "response": "Pioche",
        "source": "hotpot_qa"
    },
    {
        "query": "Which family does the writer particularly discussed about their political activities in his book Dark Money?",
        "response": "Koch family",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the position of Yehia Emam in the Alexandria games?",
        "response": "Goalkeeper",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Ram Barat, what is the custom for the bridegroom to travel on to the wedding venue?",
        "response": "it is customary for the bridegroom to travel to the wedding venue (often the bride's house) on a mare",
        "source": "hotpot_qa"
    },
    {
        "query": "The wildlife refuge named after the author of \"Silent Spring\" is located in what county?",
        "response": "York County",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lok Sabha and Loktantrik Jan Samta party are a part of which country's political system?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "What political party does the head of the Department of International Development belong to?",
        "response": "member of the Conservative Party",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the episode \"Eastwatch\" from HBO's \"Game of Thrones\" air? ",
        "response": "2017",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the Games that Rifda Irfanaluthfi completed for Indonesia in take place? ",
        "response": "Kuala Lumpur, Malaysia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Branford Price Millar Library is the library of a public research university founded in what year?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Sorry! and Aladdin's Dragons which is a reimplementation of his 1998 game \"Keydom\"?",
        "response": "Aladdin's Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was founded first, Asia Pacific College or Bulacan State University?",
        "response": "It was established in 1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player has achieved a higher ranking in doubles play, Bob Bryan or Jonathan Marray?",
        "response": "Robert Charles Bryan",
        "source": "hotpot_qa"
    },
    {
        "query": "Reagan and Give Us Our Skeletons were both which kind of films?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "That Darn Cat! was a 1965 thriller comedy film starring an English actress who won a BAFTA Award for Most Promising Newcomer for her performance in what 1959 film?",
        "response": "Tiger Bay",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Puyang and Pu'er City located in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What product does QST and Entrepreneur supply?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by Rihanna from \"Good Girl Gone Bad\" did The Oxford Belles create a mash-up of?",
        "response": "Disturbia",
        "source": "hotpot_qa"
    },
    {
        "query": "What zoo is found in the same park as ElCid Campeador?",
        "response": "San Diego Zoo",
        "source": "hotpot_qa"
    },
    {
        "query": "Benjamin Sulsky plays poker under the aliases Sauce123 and Sauce1234 on Full Tilt Poker on PokerStars an online poker cardroom owned by what group?",
        "response": "The Stars Group",
        "source": "hotpot_qa"
    },
    {
        "query": "The former sheriff of Maricopa County, who was trolled by Duke St. Rollins, lost the re-election to which person?",
        "response": "Paul Penzone",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Man in the Shadow\" star Orson Welles also directed and starred in what film?",
        "response": "Citizen Kane",
        "source": "hotpot_qa"
    },
    {
        "query": "What careers doMichael Ritchie and Derek Estlin Purvis have in common? ",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Youtiao are typically served with a rice dish that is a type of what?",
        "response": "rice porridge",
        "source": "hotpot_qa"
    },
    {
        "query": "What building, at one time, housed the MLB Astros, NFL Oilers, NBA Rockets and hosted the UCLA Bruins men's basketball team when they won the Championship in 1971?",
        "response": "The Astrodome",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor born who appeared in both Assault on Precinct 13 and every Rocky installment?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "What landmark is located in North East Lincolnshire, England and designed by James William Wild?",
        "response": "Grimsby Dock Tower",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1999 animated film, was created by one of Hollywood's \"Bix Six\" film studios, and based on a title character who's wife is named Jane?",
        "response": "Tarzan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Elinor Lipman and Ernst Toller German?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which leading US university is longer established: University of Chicago or University of Iowa?",
        "response": "University of Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which modern day Libyan city has its origins in the times of Ancient Greece that helped form the Pentapolis of Cyrenaica along with the cities of Ptolemais, Tauchira, Apollonia and Euesperides?",
        "response": "Cyrene",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the writer for an American teen sitcom created by Kim Bass for Nickelodeon?",
        "response": "Wayne Conley",
        "source": "hotpot_qa"
    },
    {
        "query": "Homogentisic Acid  is found in Arbutus unedo , which is also know as what?",
        "response": "strawberry tree",
        "source": "hotpot_qa"
    },
    {
        "query": "The songs from the sountrack to \"When Harry Met Sally\" are performed by a singer that has had how many top 20 US albums?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "What position in their bands did both Christopher Amott and Johnny Edwards have in common?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the British documentary that covered the killing of the wife of the 1970s punk rock scene?",
        "response": "Alan G. Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Ghanaian footballer born who graduated from the SC Bastia Reserves and Academy?",
        "response": "3 December 1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Shepherd with a flute is a painting displayed in a palace in what country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that Morganna May Bridgers was in in 2013?",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "What dates will the games preceded by the 2017 games scheduled in Fokuoka, Japan occur?",
        "response": "August 24 to 31, 2019",
        "source": "hotpot_qa"
    },
    {
        "query": " Nomad: From Islam to America: A Personal Journey Through the Clash of Civilizations was written by an author who is a former what?",
        "response": "Dutch politician",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1958 Argentine Grand Prix was a Formula One motor race held at a motor racing circuit built in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "The Breeze broadcasts to a city in southwest England with a population of what, as of 2017?",
        "response": "454,200",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Jesus in \"Godspell\" had his first starring tv role in a series that aired on what network?",
        "response": "CBS",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts, Der Zwerg or Billy Budd?",
        "response": "Billy Budd, Op. 50, is an opera by Benjamin Britten to a libretto by the English novelist E. M. Forster and Eric Crozier, based on the short novel \"Billy Budd\" by Herman Melville. Originally in four acts, it was first performed at the Royal Opera House, London, on 1 December 1951; it was later revised as a two-act opera with a prologue and an epilogue.",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the man who inspired the experimental work of the inventor of Moseley's law",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Nishabd appeared in three Hindi films from 2007 to 2010?",
        "response": "Jiah Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "How old is the fossil record of the order that contains the only strictly marine herbivorous mammal?",
        "response": "50-million-year-old fossil record",
        "source": "hotpot_qa"
    },
    {
        "query": "Sean O'Neal played Sam Anders in a television show created by which person?",
        "response": "Mitchell Kriegman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is influenced by their faith, The Polyphonic Spree or Deas Vail?",
        "response": "Deas Vail",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the best known song of the female singer who co-recorded, with Dan Seals, a song written by Paul Davis?",
        "response": "Paper Roses",
        "source": "hotpot_qa"
    },
    {
        "query": "The Equestrian statue of Marshal Mannerheim was erected as a monument to the leader of the Whites during what event?",
        "response": "Finnish Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was Joe Anderson in that Daniel Radcliffe was also in?",
        "response": "Horns",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the genuses Hyacinthoides and Mikania belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who discovered the scattering of which Thomson scattering is just the low energy limit ?",
        "response": "Arthur Holly Compton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which town near the county border with North Yorkshire was this Lancashire mill (closed in 1979 and demolished) located?",
        "response": "Barnoldswick",
        "source": "hotpot_qa"
    },
    {
        "query": "How much revenue did the manufacturer of the Mercurial Vapor bring in during fiscal year 2012?",
        "response": "in excess of US$24.1 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "SAS Commuter operated bases in what international airport located at Flesland in Bergen",
        "response": "Bergen Airport, Flesland",
        "source": "hotpot_qa"
    },
    {
        "query": "Megan Kathleen Hilty, is an American actress and singer, she rose to prominence for her roles in Broadway musicals, including her performance as Glinda the Good Witch in which play?",
        "response": "Wicked",
        "source": "hotpot_qa"
    },
    {
        "query": "After Russell D. Moore served at the Southern Baptist Theological Seminary he became the President of The Ethics & Religious Liberty Commission (ERLC) in what year?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Mad Over You and Runtown have in common?",
        "response": "Nigerian",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1998 album is William Orbit known for working on?",
        "response": "Ray of Light",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the Japanese multinational conglomerate with which HP Pavilion competes headquartered?",
        "response": "Tokyo, Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "The \"To You I Belong\" singers broke up when when which member decided to leave?",
        "response": "Sinéad O'Carroll",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Tinsley is a physicist whose wife made fundamental contributions to the astronomical understanding of how galaxies what?",
        "response": "evolve, grow and die",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the supplement that the newspaper where Siobhán Creaton is a business journalist publishes?  ",
        "response": "Seachtain",
        "source": "hotpot_qa"
    },
    {
        "query": "What band consisting of a member John Hendy released a single called Betcha Can’t Wait?",
        "response": "East 17",
        "source": "hotpot_qa"
    },
    {
        "query": "What part is an actor in The Ferryman best known for playing in Les Misérables?",
        "response": "Courfeyrac",
        "source": "hotpot_qa"
    },
    {
        "query": "The Isla Vizcaíno is an island in Uruguay located on the estuary of the Yaguarí creek, the northern arm of the estuary of the Río Negro (Uruguay) of which river in South America, that flows from north to south and forms parts of the boundaries of Brazil, Argentina, and Uruguay, separating some of the Argentine provinces of La Mesopotamia from the other two countries?",
        "response": "Uruguay River",
        "source": "hotpot_qa"
    },
    {
        "query": "Silvano Martina works for a reitred professional footballer who was part of what national team from 2002 to 2011?",
        "response": "Serbia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pingdingshan and Huadu District both located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an Argentine film producer, editor and director, Jean Yarbrough or Pablo Trapero?",
        "response": "Pablo Trapero",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the band behind Catfish Rising form?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of Quintessence Films produced the film \"Kids\"?",
        "response": "Larry Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "Lazard and RHB Bank, are both in which type of industry?",
        "response": "financial",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Jack Burditt connected to Unbreakable Kimmy Schmidt?",
        "response": "Producer",
        "source": "hotpot_qa"
    },
    {
        "query": "The band who made the single \"Hard Charger\" were formed in what California city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth name of the Chinese singer that recorded the single \"Lose Control\"?",
        "response": "Zhang Yixing",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Australian singer-songwriter, record producer and music video director, who recorded the song \"Cheap Thrills\" for her seventh studio album, born?",
        "response": "born 18 December 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "A song written by John Schweers was recorded by an American country music artist who became the best-selling performer since Elvis Presley for what company?",
        "response": "RCA Records",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tv show which Max Ehrich played a computer hacker was based on a novel written by who?",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "While Crepis is of the genus annual and perennial flowering plants, what genus is Talinum?",
        "response": "herbaceous succulent plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Jeff Mangum and Zack de la Rocha in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Foreigner universe is a fictional universe created by an author that has written approximately how many books?",
        "response": "60",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fantasy film was released earlier, Return to Oz or Tuck Everlasting? ",
        "response": "Return to Oz",
        "source": "hotpot_qa"
    },
    {
        "query": "James Howard Mitcham was known for specializing in what potato-based cuisine?",
        "response": "cook best known for his books on Louisiana's Creole and Cajun cuisines and that of New England, with an emphasis on seafood.",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor stared in both \"A Bright Shining Lie\" and \"The Tao of Steve?\"",
        "response": "Donal Francis Logue",
        "source": "hotpot_qa"
    },
    {
        "query": "What town is the centerpiece of a family-owned amusement park in Lakeside Originally named White City, located?",
        "response": "Lakeside, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "When the Ohrid Summer Festival  became one of the members of the European Festivals Association?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released more recently, Make Mine Music or Old Dogs?",
        "response": "Old Dogs",
        "source": "hotpot_qa"
    },
    {
        "query": "The town where Franz Rumpler died is home to a historically important monastery that was established in what year?",
        "response": "1114",
        "source": "hotpot_qa"
    },
    {
        "query": "Off the Wall was a film that starred which actor known for roles in musical theatre?",
        "response": "Patrick Cassidy",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Jahnke was part of the activist group that took what German name?",
        "response": "Widerstand",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Beanland Mine and Salmita Mine in Canada?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2017 American 3D film was written by Cinco Paul and Ken Daurio?",
        "response": "Despicable Me 3",
        "source": "hotpot_qa"
    },
    {
        "query": "What Scottish film did Andrea Arnold direct that starred Katie Dickie?",
        "response": "Red Road",
        "source": "hotpot_qa"
    },
    {
        "query": "Lake Winnepesaukah's Boat Chute is the oldest type of ride that originated when? ",
        "response": "late 19th century",
        "source": "hotpot_qa"
    },
    {
        "query": "St James Street appears as a segment of Whitecross Street on the 1610 map of the Monmouth by an English historian best known as a mapmaker of what perior?",
        "response": "Stuart period",
        "source": "hotpot_qa"
    },
    {
        "query": "Which First Lady of the United States died in the first decade of the 20th century and gave birth to a son in May 1850?",
        "response": "Julia Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "A Talk is an EP by which South Korean singer and dancer?",
        "response": "Hyuna",
        "source": "hotpot_qa"
    },
    {
        "query": "What film starring Matthew Broderick also became the third-longest-running musical in Broadway history, garnering six Tony Awards including Best Musical? ",
        "response": "The Lion King",
        "source": "hotpot_qa"
    },
    {
        "query": "The Winter of His Content was an episode of The Simpsons written by which Married with Children writer?",
        "response": "Kevin Patrick Curran",
        "source": "hotpot_qa"
    },
    {
        "query": "Coleotechnites blastovora is a moth found in a continent entirely within what Hemisphere?",
        "response": "Northern Hemisphere",
        "source": "hotpot_qa"
    },
    {
        "query": "Gentleman's Intermission included a cameo appearance by the photojournalist who has specialized in reportage on what two topics?",
        "response": "human suffering in war zones and natural disasters",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Tibetan mountain range has more peaks, Karjiang or Labuche Kang?",
        "response": "Karjiang",
        "source": "hotpot_qa"
    },
    {
        "query": "A guitar player called Noodles is a longtime member of which band, The Smashing Pumpkins or The Offspring?",
        "response": "The Offspring",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town where RBx Capital, LP is located? ",
        "response": "1,567,872",
        "source": "hotpot_qa"
    },
    {
        "query": "This American actor born in 1926 starred in Malibu Run, which aired in what year?",
        "response": "1960-1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kyo and Olve Eikemo both Norwegian?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Chamillionaire song's music video features cameo appearances by Joseph Wayne McVey? ",
        "response": "Turn It Up",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Kenji Mizoguchi or Alain Tanner?",
        "response": "Kenji Mizoguchi",
        "source": "hotpot_qa"
    },
    {
        "query": "The Last Fighter Pilot documented the last combat mission in WWII, flown by which Air Force pilot?",
        "response": "Jerome \"Jerry\" Yellin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the vocalist for the song Shattered?",
        "response": "Marc Roberge",
        "source": "hotpot_qa"
    },
    {
        "query": "Which single by Billy Joel was released first, The Entertainer or Piano Man?",
        "response": "Piano Man",
        "source": "hotpot_qa"
    },
    {
        "query": "The Crocs River is a tributary of a river given what nickname?",
        "response": "\"Rhine of North America\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Matt Brookens and Fielder Cook, who had more diverse job experiences?",
        "response": "Fielder Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "The Prussian Acting Interior Minister that gave Hitler control of the German police was the last commander of what fighter wing?",
        "response": "Jagdgeschwader",
        "source": "hotpot_qa"
    },
    {
        "query": "what nationality was ludwig van beethoven?",
        "response": "German composer",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1981 the European School, Munich moved to its current location in a borough that was built starting in what year?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did Arnór Guðjohnsen and Eiður Guðjohnsen play football for",
        "response": "Iceland",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Blast Off\" was featured on the original motion picture soundtrack of an American action film directed by who?",
        "response": "James Wan",
        "source": "hotpot_qa"
    },
    {
        "query": "Figure 2 Ranch Airport supports launch operations of what aerospace manufacturer and space flight services company?",
        "response": "Blue Origin",
        "source": "hotpot_qa"
    },
    {
        "query": "Name a bandmate of Keith Duffy that has appeared as a judge on \"The All Ireland Talent Show\"?",
        "response": "Shane Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Echinocactus and Nymphaea from the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wilton Circle were an influential group of 16th-century English poets, led by a poet born in what year ?",
        "response": "1561",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Alexander Razborov and Jakow Trachtenberg who was a Jewish mathematician?",
        "response": "Jakow Trachtenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "10 Years of Hits – Newly Recorded is a compilation album by a country music artist known by what nickname?",
        "response": "\"The Voice\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Live & Louder is the first live album by a band formed in what year?",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "Since when did this annual Christmas-themed entertainment program exist that attracts more views than its rival Google Santa Tracker around the holiday season?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the children's Indian television series in which Anushka Sen was popularly known started to broadcast? ",
        "response": "8 October 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "how is I Miss You and Ron Cyrus connected?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Anthony Richard Powell is a British fashion designer who has gained a celebrity clientele with custom from an English actor who made his acting debut in what television film?  ",
        "response": "David Copperfield",
        "source": "hotpot_qa"
    },
    {
        "query": "KDGZ-LP (98.3 FM) is a radio station licensed to a city that had how many inhabitants in 2010 ?",
        "response": "1,878",
        "source": "hotpot_qa"
    },
    {
        "query": "What high school is named after an inventor who is credited with creating and building the world's first liquid-fueled rocket?",
        "response": "Robert H. Goddard High School",
        "source": "hotpot_qa"
    },
    {
        "query": "During his studies in Harvard Benjamin Darrow gained membership to a club founded in what year ?",
        "response": "1770",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Lionel Friedberg and Peter Duffell direct the same kind of films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Ron Arthun is a member of what 150 member group?",
        "response": "Montana Legislature",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the director of the Miami Vice episode No Exit become a British citizen ?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What city does Thomas Keell and Freedom have in common?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist has worked with King Crimson and also released a solo album in 2011?",
        "response": "Steven Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "What was Sophia Dallas' husbands name who served under the 11th president of the United States?",
        "response": "Vice President George",
        "source": "hotpot_qa"
    },
    {
        "query": "Garth Jennings and Lee Cheol-ha shared what occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Submarine Squadron 7 is a squadron of submarines of the United States Navy based at Joint Base Pearl Harbor-Hickam,Pearl Harbor, a lagoon harbor on what island?",
        "response": "Oahu",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the first draft pick made in the The Tampa Bay Buccaneers 35th season  play college football?",
        "response": "Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Brown Hill Creek is part of the river that is located in what Australian state?",
        "response": "South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population according to the 2010 census of the town the Connor-Bovie House is located?",
        "response": "6,735",
        "source": "hotpot_qa"
    },
    {
        "query": "What Ann Arbor Michigan publishing house published the works of Vladimir Nabokov?",
        "response": "Ardis Publishing",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the head of state of the territory where the Ibrahim-al-Ibrahim Mosque is located??",
        "response": "the British monarch (Elizabeth II)",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the approximate population of the town where Émile Cammaerts died?",
        "response": "8,000",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie is the 72 stone steps before the entrance of the Philadelphia Museum of Art, whose theme song is properly entitled, \"Gonna Fly Now\"?",
        "response": "\"Rocky\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Erica Packer was the second wife of what Australian businessman?",
        "response": "James Packer",
        "source": "hotpot_qa"
    },
    {
        "query": "The airline that now operates to Wanganui airport with a Saab 340A and a Metroliner III was established in which year ?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 FA Community Shield annual football match saw Manchester United win the game 3-2 with goals from Nani and this English professional footballer who played as a center-back?",
        "response": "Chris Smalling",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1988 film starred an English actor, voice actor, comedian, and singer?",
        "response": "Pass the Ammo",
        "source": "hotpot_qa"
    },
    {
        "query": "What film directed by the director of Jade and The Excorcist stars Ashley Judd and Michael Shannon?",
        "response": "Bug",
        "source": "hotpot_qa"
    },
    {
        "query": "Andover, located in Essex County, Massachusetts, is an example of a basic unit of local government and local division of state authority in each of the six New England states, commonly referred to in other states as what?",
        "response": "cities",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the guitar player Rob Davis' band formed?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Justin Timberlake and Andrew Montgomery both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film where Meshach Taylor played Hollywood Montrose?",
        "response": "Michael Gottlieb",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Bedknobs and Broomsticks or Blank Check?",
        "response": "Bedknobs and Broomsticks",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the American populizer of a tile-based game that originated in China during the Qing dynasty born?",
        "response": "Lafayette, Indiana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that features \"Lost Stars\" by Nick Southwood on its soundtrack?",
        "response": "John Carney",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Soviet sniper and a Hero of the Soviet Union during World War II became the source material for a character from \"Enemy at the Gates?\"",
        "response": "Vasily Zaytsev",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the  current commissioner of World TeamTennis, Ross Case or Ilana Kloss?",
        "response": "Ilana Sheryl Kloss",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the film in which Jimmi Harkishin was featured is a 1999 British comedy-drama film written by Ayub Khan-Din and directed by Damien O'Donnell?",
        "response": "East Is East",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former stage name of the artist that sings Ignite?",
        "response": "DJ Walkzz",
        "source": "hotpot_qa"
    },
    {
        "query": "Vortex Garten is a garden that alludes to the discovery of levitational force by the naturalist of what nationality?",
        "response": "Austrian",
        "source": "hotpot_qa"
    },
    {
        "query": "91.3 Capital FM broadcasts from a city divided into how many boroughs?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the husband of Margit Fischer born? ",
        "response": "9 October 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, The Black Keys or Beastie Boys?",
        "response": "Beastie Boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Which current member of Turkish club Antalyaspor played for Kadji Sport Academies as a youth?",
        "response": "Samuel Eto'o",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor most recognized for his role as Lt. Colonel Henry Blake on the TV series \"M*A*S*H\" was initially a host on an American lifestyle and variety talk show that aired weekday afternoons in syndication during the 1985-86 television season?",
        "response": "Edgar McLean Stevenson Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary that used 9 North was directed by Stephen Low?",
        "response": "Volcanoes of the Deep Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film, When I Came Home or The Queens of Comedy, won the \"New York Loves Film Best Documentary\" award in 2006?",
        "response": "When I Came Home",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor best known for her role as Donna Stern in \"Obvious Child\", stars in a 2011 American live action/computer animated musical family comedy adventure film directed by Mike Mitchell ?",
        "response": "Jenny Sarah Slate",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Stepanek plays Magnifo on a Cartoon Network series that first aired in what year?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Oak Hill High School serves students from Litchfield, Wales, and what town that is in Androscoggin County, Maine, with a population of 4,876, and was formerly known as Webster?",
        "response": "Sabattus",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2005 film in which Leanne Rowe portrayed Nancy?",
        "response": "Roman Polanski",
        "source": "hotpot_qa"
    },
    {
        "query": "Before moving to Boston to play at the New England Patriots, in which city did Dean Caliguire play his college and NFL football?",
        "response": "Pittsburgh",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer and songwriter is English, Nate Ruess or Beth Gibbons?",
        "response": "Beth Gibbons",
        "source": "hotpot_qa"
    },
    {
        "query": "Khalid bin Sultan AL Qasimi is an Emirati fashion designer, what indie rock band vocalist has worn his his fashion label?",
        "response": "Florence Welch",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the village of the town, with the same name, in Saratoga County, New York near a lake?",
        "response": "Galway",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Humulus and Kohleria both in the family Cannabaceae?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played bass guitar for the band that sang It's Not the End of the World?",
        "response": "Guto Pryce",
        "source": "hotpot_qa"
    },
    {
        "query": "What son of Queen Mary died on the August 1942 Dunbeath Air Crash?",
        "response": "Prince George, Duke of Kent",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Phil Rosen and Paul Bogart American film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Mike Huckabee took part in the most recent Republican Presidential primaries, which began on what 2016 date?",
        "response": "February 1",
        "source": "hotpot_qa"
    },
    {
        "query": "The Adventure of the Red Widow, is a murder mystery by Adrian Conan Doyle, about what fictional private detective?",
        "response": "Sherlock Holmes",
        "source": "hotpot_qa"
    },
    {
        "query": "How much area of George Washington and Jefferson National Forests is designated  as wilderness areas?",
        "response": "139,461 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Emigrant Peak and Gardiner, Montana have in common?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Joint is a showroom located in a town with what population as of the 2010 census?",
        "response": "223,167",
        "source": "hotpot_qa"
    },
    {
        "query": "SLS station was just south of those that were designed to give access to the RV park and casino in what Nevada suburb?",
        "response": "Winchester",
        "source": "hotpot_qa"
    },
    {
        "query": "The Book of All Flesh is the first of three Zombie anthologies edited by man born in what city and state?",
        "response": "Quincy, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "What is name of younger brother of the director Joey Travolta who directed film Mel in 1998?",
        "response": "John Travolta",
        "source": "hotpot_qa"
    },
    {
        "query": "What series did Miranda Tapsell star in with John Jarratt?",
        "response": "Wolf Creek",
        "source": "hotpot_qa"
    },
    {
        "query": "What river does Waterloo Bridge and London Eye have in common?",
        "response": "Thames",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Noijin Kangsang and Gasherbrum II both tall mountains in Asia?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What state park is Ireland's Great Hunger Museum located by?",
        "response": "Sleeping Giant State Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tim Kurkjian and Ben Bagdikian both baseball analysts?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hall Bartlett and Izu Ojukwu are what?",
        "response": "was an American film producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Though Cherrie Ireland was born in Darwin, the capital city of the Northern Territory of Australia, she was on holiday in which city when she became paralysed by polio?",
        "response": "Melbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the girl played by Linda Blair in the Exorcist?",
        "response": "Regan",
        "source": "hotpot_qa"
    },
    {
        "query": "The concept of treason can be dated back to the early Roman republic, but was defined by nebulous criteria, it would be the common laws of this time period which would most directly influence those customary in the court of King Arthur, a legendary British leader who, according to medieval histories and romances, led the defence of Britain against which invaders in the late 5th and early 6th centuries AD?",
        "response": "Saxon",
        "source": "hotpot_qa"
    },
    {
        "query": "What bi monthly magazine based in Topeka featured the photographs of Scott Vlaun?",
        "response": "Mother Earth News",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the author of Aleph most famous for writing?",
        "response": "The Alchemist",
        "source": "hotpot_qa"
    },
    {
        "query": "McLemore Avenue is to Booker T. & the M.G.s as what road in the city of Westminster in London is to the Beatles?",
        "response": "This road is best known for the Abbey Road Studios and the 1969 album, \"Abbey Road\", by The Beatles.",
        "source": "hotpot_qa"
    },
    {
        "query": "Jérôme Kircher (born 21 November 1964) is a French actor known for which 2004 French romantic war film, co-written and directed by Jean-Pierre Jeunet, and starring Audrey Tautou?",
        "response": "A Very Long Engagement",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Barbara Adams involved in an investigation. ",
        "response": "1990s",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Schwartzwalder trained the halfback who was the first African-American to win the Heisman, doing so in which year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "Slackers starred which Canadian actor?",
        "response": "Devon Edward Sawa",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one of the three landmarks located near the border in Colotado?",
        "response": "Point of Rocks",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do both Jacoby Ellsbury and the 2013 Boston Red Sox season have in common?",
        "response": "baseball",
        "source": "hotpot_qa"
    },
    {
        "query": "What legionary fortress located on the site of the modern city of Chester is a popular landmark to photograph?",
        "response": "Deva Victrix",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pharmaceutical company has its headquarters in McKesson Plaza?",
        "response": "McKesson Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of frequency does Discovery Family and Discovery Communications have in common?",
        "response": "Channel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university has the most campuses, University of Richmond or Georgia Institute of Technology?",
        "response": "Georgia Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": " Joel Edgerton appeared in a film by a director whose films also include what 1995 science fiction action thriller?",
        "response": "Strange Days",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in the Philippines is home to the Robinsons Galleria and the 4th largest shopping mall in the world?",
        "response": "Metro Manila",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays for a Spanish football club based in Vitoria-Gasteiz, Álava, as a left winger?",
        "response": "Juan Antonio \"Juanan\" Entrena Gálvez",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the college that has the DeVos Fieldhouse opened?",
        "response": "1851",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Datsuns and The Black Crowes both rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a 2005 French-British computer-animated adventure fantasy film based on the television series \"The Magic Roundabout, that had an English film and television actor well known as a voice over actor ? ",
        "response": "The Magic Roundabout",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession, Christopher Guest or  Roman Karmen?",
        "response": "Christopher Haden-Guest",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the women's basketball team that is based the suburb of Melbourne, Australia, situated on the Dandenong Creek?",
        "response": "The Dandenong Rangers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country are a Real Vermeer and Han van Meegeren from?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfred Charles Kinsey, was an American biologist, professor of entomology and zoology, and sexologist who in 1947 founded the Institute for Sex Research at Indiana University, now known as the Kinsey Institute for Research in Sex, Gender, and Reproduction, he is well known for which scale, that is used in research to describe a person's sexual orientation based on their experience or response at a given time? ",
        "response": "Kinsey scale",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician, Edwyn Collins or Jimmie Ross, played the bass guitar?",
        "response": "Jimmie Ross",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the release date of Seal's album that was produced by the Chairman of Verve Records from 2012 to 2016?",
        "response": "20 September 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the author of Samarkand born?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1989 movie did James Scott Bumgarner appear in?",
        "response": "My Name Is Bill W.",
        "source": "hotpot_qa"
    },
    {
        "query": "What month does Reloaded and The Sims 3 have in common?",
        "response": "March",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was created first, About Time or Java?",
        "response": "Java",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack and Jill and Forbes are both what?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "This British Territorial Army general was succeeded by his son who is estimated to be worth what?",
        "response": "US$13 billion",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed the 2009 film in which Audrey Giacomini played Jeanne?",
        "response": "Jaco Van Dormael",
        "source": "hotpot_qa"
    },
    {
        "query": "In My Arms contains samples from which song written and composed by Donna Weiss and Jackie DeShannon?",
        "response": "Bette Davis Eyes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what university did the game composer of the sequel of Seiken Densetsu get a degree?",
        "response": "Kansai University",
        "source": "hotpot_qa"
    },
    {
        "query": "For One Night Only was hosted by the man most well-known for hosting what show from 1962 until 1999?",
        "response": "The Late Late Show",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American actor portray Steve Urkel in \"Family Matters\"",
        "response": "Jaleel Ahmad White",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the play, The Anarchist involving Kathy Boudin first opened?",
        "response": "New York on Broadway",
        "source": "hotpot_qa"
    },
    {
        "query": "What Chinese Actor played a role from Louis Cha's 2017 novel?",
        "response": "Yang Xuwen",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mayfield Brewery produced a highly effervescent beer made by fermenting lager yeasts at warmer what?",
        "response": "ale yeast fermentation temperatures",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert B. Laughlin won a share of the 1998 Nobel Physics prize along with which Chinese-American physicist?",
        "response": "Daniel Chee Tsui",
        "source": "hotpot_qa"
    },
    {
        "query": "What global supplier of filtration, separations and purification products, was founded by chemist David Pall?",
        "response": "Pall Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Huffam was a producer on a spy comedy film parodying what secret agent?",
        "response": "James Bond",
        "source": "hotpot_qa"
    },
    {
        "query": "What film did the mother of Karan Kapoor star in in 1970?",
        "response": "Bombay Talkie",
        "source": "hotpot_qa"
    },
    {
        "query": "Back to the Future will include hits Johnny B. Goode and what other?",
        "response": "The Power of Love",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is WJKX located?",
        "response": "Ellisville, Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "Careers and Capitol, are which type of entertainment?",
        "response": "game",
        "source": "hotpot_qa"
    },
    {
        "query": "Sun Hung Kai & Co is a financial services firm with a focus on what Region that includes  Mainland China, Hong Kong, Macau and Taiwan",
        "response": "Greater China",
        "source": "hotpot_qa"
    },
    {
        "query": "The Whizzard of Ow features a coyote who is often what?",
        "response": "getting injured in slapstick fashion.",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Michael Hirsh call the president of the National Policy Institute?",
        "response": "a Nazi",
        "source": "hotpot_qa"
    },
    {
        "query": "What tabloid in Adelaide had a strong sporting focus",
        "response": "News",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the band formed that wrote and performed \"Show Me a Leader\"?",
        "response": "Orlando, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "On which year, on St Patrick's Day, was the Kansas City Irish Center first opened?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What company is the male star of By the Sea a producer for?",
        "response": "Plan B Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member of \"A Very Murray Christmas\" is known for his frequent collaborations with Wes Anderson ?",
        "response": "Jason Schwartzman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are K6 and Skil Brum both located in Pakistan?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What model/singer has covered the song \"Santa Maria\"?",
        "response": "Samantha Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film, in which this actress who played Lady Rose Aldridge in the ITV period drama \"Downton Abbey\" appeared alongside Kevin Spacey?",
        "response": "Edgar Wright",
        "source": "hotpot_qa"
    },
    {
        "query": "What car was launched at the 2012 Paris Auto Show following the model unveiled at the 2008 Paris Auto Show?",
        "response": "Volkswagen Golf Mk7",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Argentine actress won the Best Actress award at the Moscow International Film Festival in 1977 for her role in Crazy Women?",
        "response": "Mercedes Carreras",
        "source": "hotpot_qa"
    },
    {
        "query": "What Fox television series, based on the television series \"Star Trek\", features the actor Scott Richard Grimes?",
        "response": "The Orville",
        "source": "hotpot_qa"
    },
    {
        "query": "Not So Quiet is a parody of the film based on the novel written by whom?",
        "response": "Erich Maria Remarque",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the Bee Gees Line up was born on 22 December 1949 ?",
        "response": "Maurice Gibb",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2013 Bollywood romance film that was produced by an Indian music company founded by Gulshan Kumar ?",
        "response": "Mohit Suri",
        "source": "hotpot_qa"
    },
    {
        "query": "MERSI protocol was used by the computer that was a fourth generation of what type of processors?",
        "response": "32-bit PowerPC",
        "source": "hotpot_qa"
    },
    {
        "query": " Lisa Smith-Batchen was the first American to win  Marathon des Sables a six day marathon that spans how long of a distance?",
        "response": "251 km ultramarathon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team that played in the Super Bowl XXXV was coached by Brian Billick?",
        "response": "Baltimore Ravens",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicholas P. Samios (born on March 15, 1932) is an American physicist and former director of the Brookhaven National Laboratory (BNL) is a United States Department of Energy national laboratory located in Upton, New York, in which location?",
        "response": "Long Island",
        "source": "hotpot_qa"
    },
    {
        "query": "At what military installation between Junction City and Manhattan Kansas did Fred Lee Ogilvie serve during World War I?",
        "response": "Fort Riley",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Shrimp on the barbie\" is an often-quoted phrase that originated in a series of television advertisements by the Australian Tourism Commission starring a comedian born in which year ?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Which director is American, Jorge Olguín or Philip Kaufman?",
        "response": "Philip Kaufman",
        "source": "hotpot_qa"
    },
    {
        "query": "What record company was founded by the Beatles in 1968?",
        "response": "Apple Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nickname of the princess that signed the Lei Áurea law?",
        "response": "\"the Redemptress\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the last Russian manager of FC Jurmala?",
        "response": "Andrei Kanchelskis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which high school did the second overall pick of the 2004 Bobcats NBA draft attend?",
        "response": "Bellaire High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian and American film actress and inventor starred in the 1958 American CinemaScope film The Female Animal alongside Jane Powell, Jan Sterling, and George Nader?",
        "response": "Hedy Lamarr",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Millard Webb and Philippe Garrel from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Akmerkez mall and Haseki Sultan Complex of mosques are landmarks in which ancient city?",
        "response": "Istanbul",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Forrester is a fictional character from the CBS Daytime soap opera \"The Bold and the Beautiful\", he has two twin sisters, one of them being Steffy, played by Jacqueline MacInnes Wood, is a Canadian actress, disc jockey, singer and television host, born on which date?",
        "response": "17 April 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "P. Vijay won the National Film Award for Best Lyrics in India for a song performed by who?",
        "response": "K. S. Chithra",
        "source": "hotpot_qa"
    },
    {
        "query": "The writer, director, and host of \"The Awful Truth\" also directed and produced what 2004 documentary?",
        "response": "Fahrenheit 9/11",
        "source": "hotpot_qa"
    },
    {
        "query": "The King of the Gospel Singers is a studio album from a musician that was born in this year?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "How many sqm is the Mexico City outdoor shopping center who has an anchor tenant whose name means \"City of Cinema\"?",
        "response": "56000",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the current name of the shopping mall in Skokie developed by Philip M. Klutznick?",
        "response": "Westfield Old Orchard",
        "source": "hotpot_qa"
    },
    {
        "query": "Illich Guardiola is an American voice actor who has worked for what entertainment, anime, and foreign licensing company known popularly for its Dragon Ball Z license?",
        "response": "Funimation",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Brigitte and Nesf El Donya both women's magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What HBO original series featured an actor who also starred in the 2016 film \"The Pass\"?",
        "response": "\"Looking\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What driver won the 53 lap race, who was part of one of the most successful teams in Formula One history, having won 182 races, 12 drivers' championships and eight constructors' championships?",
        "response": "Denny Hulme",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the  Lambda 8300 and Aamber Pegasus both technology devices?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What American road racing cyclist lost to  Jens Voigt for the second year in a row?",
        "response": "Levi Leipheimer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the founder of the Free Presbyterian Church of Ulster from?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1994 action film was also directed by the director of Twister?",
        "response": "Speed",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the first African-American students admitted to the University of Georgia is an American journalist and former foreign correspondent for National Public Radio?",
        "response": "Charlayne Hunter-Gault",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the improv partner of the director of Postcards from the Edge?",
        "response": "Elaine May",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other company that produces the 2017 film that Jordan Roberts is known for co-writing the screenplay for other than 20th Century Fox Animation?",
        "response": "Blue Sky Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Der junge Lord and Giasone have in common?",
        "response": "an opera",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of the movie in which the Japanese movie \"Whiteout\" is made in the style of?",
        "response": "John McTiernan",
        "source": "hotpot_qa"
    },
    {
        "query": "How far away is the headquarters of the Eastern Air Defense Sector from Panama City, Florida?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "John Cabess played a role in the wars in which kingdom of Ghana?",
        "response": "Eguafo Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Fitzroya or Bletilla have more species?",
        "response": "Bletilla",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor who was part of \"Billion Dollar Babies\" born?",
        "response": "February 4, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacob Miller is from Weston, Florida which is a master planned suburban community in what county? ",
        "response": "Broward County",
        "source": "hotpot_qa"
    },
    {
        "query": "What opened as the first federally operated psychiatric hospital in the United States, Psychiatric Institute of Washington or St. Elizabeths Hospital?",
        "response": "St. Elizabeths Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the racing team that developed the Toro Rosso STR6 ?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Simpson's episode where the character Dr. Hibbert first appeared, the Simpsons go to a Monster Truck rally that features what daredevil?",
        "response": "Lance Murdock",
        "source": "hotpot_qa"
    },
    {
        "query": "Allen Fieldhouse and the Kansas Jayhawks women's basketball team are both apart of what university?",
        "response": "University of Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the structure whose operation was engaged by Great Wheel Corporation consist of? ",
        "response": "rotating upright wheel",
        "source": "hotpot_qa"
    },
    {
        "query": "What journal published a Vedic Sanskrit text listed as number 2 in the Muktikā, the canon of the 108 Upanishads of Hinduism?",
        "response": "Journal of the American Oriental Society",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Campanula and Caesalpinia part of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the 2016 Fox Sports Cup-esque football club in West Bromwich Albion (England) formed?",
        "response": "1878",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose 2004 album contained a version of a song introduced by Judy Garland in Meet Me in St. Louis?",
        "response": "LeAnn Rimes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Hamlet of Suffolk County, New York contains the Conscience Point National Wildlife Refuge?",
        "response": "North Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Staten Island Catapult and Jackass Number Two both films made in the 21st century?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Alex Wolff and Michael Wolff have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the rapper whose fifth studio album was \"Welcome To Haiti: Creole 101\" born?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "When did The Rocket retire?",
        "response": "in 1960",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor Michel Momsen,  frontwoman of The Pretty Reckless, played Jenny Humphrey on what CW series?",
        "response": "Gossip Girl",
        "source": "hotpot_qa"
    },
    {
        "query": "Colquhounia and Burretiokentia, have six species each?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the crime thriller film in which the British singer who made her debut in \"Scratchy & Co.\" starred released?",
        "response": "7 April 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the novel that featured the most famous peak in the Great Balsam Mountains published?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television station broadcasted the NBA draft selection of a Greek professional basketball player in 2006? ",
        "response": "ESPN",
        "source": "hotpot_qa"
    },
    {
        "query": "Beatrice Helen Beckett was the first wife of a politician who served three periods as what?",
        "response": "Foreign Secretary",
        "source": "hotpot_qa"
    },
    {
        "query": "Love is a 2006 theatrical production by what?",
        "response": "Cirque du Soleil",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the Portuguese footballer who kicked the winning goal in the 2004 Coupe de France Final?",
        "response": "Pedro Miguel Carreiro Resendes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the signing policy for Athletic Club Femenino players?",
        "response": "only sign players who were born in the Basque Country, or who learned their football skills at a Basque club.",
        "source": "hotpot_qa"
    },
    {
        "query": "The Little Prince, first published in 1943, is a novella, the most famous work of which French writer, poet, aristocrat, journalist, and pioneering aviator?",
        "response": "Antoine de Saint-Exupéry",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the difference in genre between The Fighting Prince of Donegal and The Graveyard Book?",
        "response": "children's fantasy novel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player received a higher world singles ranking, Fabio Fognini or Marin Čilić?",
        "response": "Marin Čilić",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the league, in which Wayne Wood played 104 games in, founded?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Rosario Isabel Dawson is an American actress who starred in Love in the Time of Money, a 2002 American romantic comedy-drama film written and directed by who?",
        "response": "Peter Mattei",
        "source": "hotpot_qa"
    },
    {
        "query": "Xifeng District and Genhe are both located in which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music can be heard at Fisk, the historically black university, based in Nashville, Tennessee?",
        "response": "Smooth Jazz",
        "source": "hotpot_qa"
    },
    {
        "query": "After being named a tournament  mvp Buddy  Hield was picked by what NBA team?",
        "response": "New Orleans Pelicans.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film, for which Thomas Bangalter  supplied compositions as a solo artist ? ",
        "response": "Gaspar Noé",
        "source": "hotpot_qa"
    },
    {
        "query": "Hardware is a fictional character created by an American comics artist and television what?",
        "response": "producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Chester Bennington and The Birds of Satan involved with rock music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Orson Scott Card and James Agee who won the author a posthumous 1958 Pulitzer Prize?",
        "response": "James Rufus Agee",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Jaspan was the co-founder of what not-for-profit media outlet?",
        "response": "The Conversation",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the nationality of the author of \"The Sunlight on the Garden\"?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this monarch of three kingdoms of England, Scottland, and Ireland, who attempted to escape from Carisbrooke Castle?",
        "response": "19 November 1600",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Les Six\", is a name given to a group of six French composers who worked in which location, their music is often seen as a reaction against the musical style of Richard Wagner and the impressionist music of Claude Debussy and Maurice Ravel, was a French composer, pianist and conductor?",
        "response": "Montparnasse",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American music star appeared as a guest in a Will & Grace episode called \"Back Up, Dancer\"?",
        "response": "Janet Damita Jo Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Deschampsia and Lardizabala have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What animal with only four extant species was the name borne by four ships of the Royal Navy",
        "response": "Hyena",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times has the star of the BBC play \"Secrets\" won the Laurence Olivier award?",
        "response": "twice",
        "source": "hotpot_qa"
    },
    {
        "query": "The movie franchise in which Bruce Davidson plays antagonist Senator Robert Kelly is based on a superhero team appearing in what company's comic books?",
        "response": "Marvel Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known as an American film director, Irvin Willat or Ted Kotcheff? ",
        "response": "Irvin Willat",
        "source": "hotpot_qa"
    },
    {
        "query": "Forman Christian College and Rice University, have which university type in common?",
        "response": "research",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American director worked with animation for Disney, John Musker or Irwin Winkler?",
        "response": "John Musker",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose motion picture debut was in a film based on a screenplay by Ken Nolan?",
        "response": "Tom Hardy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1942 film that Hal B. Wallis produced?",
        "response": "Michael Curtiz",
        "source": "hotpot_qa"
    },
    {
        "query": "Nickajack Dam is one of nine dams on the Tennessee River owned and operated by which federally owned corporation in the United States created by congressional charter on May 18, 1933?",
        "response": "Tennessee Valley Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "2012: Time for Change is a 2010 feature-length documentary film that features a Canadian actress who won the Austin Film Critics Association's Award for Best Actress in what film?",
        "response": "Hard Candy",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Jim Diamond and Paul Westerberg American?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Bottle Shock starred which American actor who played Capt. Kirk in the Star Trek reboot?",
        "response": "Christopher Whitelaw Pine",
        "source": "hotpot_qa"
    },
    {
        "query": "Twisted Colossus was featured in which 1983 American road comedy?",
        "response": "National Lampoon's Vacation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who writes children's and young adult fiction,John Fowles or Judy Blume?",
        "response": "Judy Blume",
        "source": "hotpot_qa"
    },
    {
        "query": "WPRK is owned and operated by a college founded in what year?",
        "response": "1885",
        "source": "hotpot_qa"
    },
    {
        "query": "Mr. Snowman was released by a country music artist who used to be one-half of what country duo?",
        "response": "Montgomery Gentry",
        "source": "hotpot_qa"
    },
    {
        "query": "The field tensor was introduced by a mathematician and professor who had taught at which three universities?",
        "response": "Königsberg, Zürich and Göttingen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first  Hendrik Johannes \"Johan\" Cruijff or Marinus Jacobus Hendricus \"Rinus\" Michels?",
        "response": "Marinus Jacobus Hendricus \"Rinus\" Michels",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the director of a 1996 film starring Leonardo DiCaprio and Claire Danes born?",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Anthony Powell or Nancy Mitford?",
        "response": "Nancy Mitford",
        "source": "hotpot_qa"
    },
    {
        "query": "The Humphries Ministry was the seventh ministry of the Government of the Australian Capital Territory, and was led by Chief Minister Gary Humphries, of which major political party in Australia, and founded in 1945 to replace the United Australia Party (UAP)?",
        "response": "Liberal Party of Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Hero and the Terror is an action film written by a man born in what year?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1995 film did Bridgette Wilson star in?",
        "response": "Billy Madison",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Stefan Mihajlović's father born?",
        "response": "19 November 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Harry A. Pollard and Janez Lapajne both film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The United States presidential election of 1920 included which Republican Senator who was later exposed for scandal under Teapot Dome?",
        "response": "Warren Gamaliel Harding",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the director of the film \"What Planet Are You From?\" born?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "Mi México is an album by a singer who recorded her first song at 21 titled what?",
        "response": "Compréndeme",
        "source": "hotpot_qa"
    },
    {
        "query": "Geraldine \"Gerry\" Cowper, is an English actress who is best known for playing Rowan Morrison in The Wicker Man, a 1973 British mystery horror film directed by who?",
        "response": "Robin Hardy",
        "source": "hotpot_qa"
    },
    {
        "query": "How much acre does the complex on which the Timeline of the Watergate scandal occurred covered? ",
        "response": "10 acre",
        "source": "hotpot_qa"
    },
    {
        "query": "Padmanav Bordoloi and Papon are both from what state of India?",
        "response": "Assam",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the state history museum that presents, what historian Carl L. Becker a century ago, reflects American ideals from the prehistoric to modern eras in 30000 sqft of exhibits ?",
        "response": "Kansas Museum of History",
        "source": "hotpot_qa"
    },
    {
        "query": "Biloxi Bay Bridge is over a city in Jackson County which has a population of how many in 2000?",
        "response": "17,225",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the stars in All the Wilderness was born in 13 June 1996?",
        "response": "Kodi Smit-McPhee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band released their debut album more recently, Godspeed You! Black Emperor or Halestorm?",
        "response": "Halestorm",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released Oh Blue Christmas originally from the 1965 animated television special A Charlie brown Christmas in November 2009?",
        "response": "A Fine Frenzy",
        "source": "hotpot_qa"
    },
    {
        "query": "Woodsia and Cystopteris, are a genus of what?",
        "response": "ferns",
        "source": "hotpot_qa"
    },
    {
        "query": "Timing is the fourth Korean mini-album by the leader and main rapper of what boyband?",
        "response": "SS501",
        "source": "hotpot_qa"
    },
    {
        "query": "Prince Floris Frederik Martijn of Orange-Nassau is the youngest son of a of the Dutch Royal House and currently eighth and last in the line of what?",
        "response": "succession to the throne",
        "source": "hotpot_qa"
    },
    {
        "query": "To whom is the deep tone of this retired American sportscaster, who noted the final game of 1978 NCAA Division I-A football season was  the greatest game he'd ever seen, compared?",
        "response": "Edward R. Murrow",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession did Kurt Voss and Manoel de Oliveira have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dwarves Must Die features a cameo by an American multi-instrumentalist, singer and songwriter best known as a member of what band?",
        "response": "Queens of the Stone Age",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Happy Joe's or Gatti's Pizza founded first?",
        "response": "Gatti's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "Skelewu was endorsed by which Togolese pro footballer?",
        "response": "Sheyi Emmanuel Adebayor",
        "source": "hotpot_qa"
    },
    {
        "query": "Go Soo appeared in a 2009 South Korean mystery thriller that was based on what novel?",
        "response": "Journey Under the Midnight Sun",
        "source": "hotpot_qa"
    },
    {
        "query": "What name is an Art Deco commercial building designed by Robert Law Weed including the style that  principally live in Oklahoma with a minority in Florida, and comprise three federally recognized tribes?",
        "response": "Boulevard Shops",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2000 American comedy directed by Scott Alexander co-starred a Broadway actress that was inducted into the American Theater Hall of Fame in 1995?",
        "response": "Screwed",
        "source": "hotpot_qa"
    },
    {
        "query": "Sunny Mabrey, is an American actress and model, Mabrey played the role of Glinda the Good Witch in the series \"Once Upon a Time\", an American fantasy drama television series that premiered on October 23, 2011, on which channel?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "What American rock band that was founded by singer Debbie Harry and guitarist Chris Stein, also co-headlined the Rage and Rapture tour with the rock band Garbage?",
        "response": "Blondie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which violinist performs the Concertos from My Childhood, a collection of famous student concertos?",
        "response": "Itzhak Perlman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who appeared as what in several roles with that company, including Giannetta in what was first performed at the Opéra Garnier in Paris on 16 March 1894?",
        "response": "operatic soprano",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of an author of Write Excuses best known for the Cosmere universe?",
        "response": "Brandon Sanderson",
        "source": "hotpot_qa"
    },
    {
        "query": "The Albatros L 79 Kobold was a single-seat German aerobatic aircraft of the 1920s and 1930s, the kobold (occasionally cobold) is which type of entity, stemming from Germanic mythology, and surviving into modern times in German folklore?",
        "response": "sprite",
        "source": "hotpot_qa"
    },
    {
        "query": "What self titled album was released by an Indianapolis American Christian music band on January 24th of 2012?",
        "response": "Pioneer",
        "source": "hotpot_qa"
    },
    {
        "query": "Black Holes in the Sand features a cover-version of Diane, by what American rock band?",
        "response": "Hüsker Dü",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country was the man who originally proposed Le Sage's theory of gravitation in 1690 born?",
        "response": "Swiss-born",
        "source": "hotpot_qa"
    },
    {
        "query": "What performer at Redcar Bowl was formed in London in 1969?",
        "response": "Uriah Heep",
        "source": "hotpot_qa"
    },
    {
        "query": "The Environment Act 1995 passed under the tutelage of a politician associated with what political party?",
        "response": "British Conservative Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both directors Mel Stuart and Douchan Gersi American?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the left-handed hitter who hit 28 home runs for the Los Angeles Dodgers in 1991?",
        "response": "March 12, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Michael Howard or Clark Johnson?",
        "response": "Clark Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Yixing and Dezhou the same level of city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Margaret of Huntingdon (died before 1228) was the eldest daughter of David, Earl of Huntingdon (died 1219) and his wife, Maud (died 1233), sister of which earl that died in 1232, was one of the \"old school\" of Anglo-Norman barons whose loyalty to the Angevin dynasty was consistent but contingent on the receipt of lucrative favours? ",
        "response": "Ranulf de Blondeville, 6th Earl of Chester and 1st Earl of Lincoln",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an American film director, Guy Ritchie or Fred Olen Ray?",
        "response": "Fred Olen Ray",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Scucci was the former Assistant Race and Sports Book Manager at what casino resort located on 63 acres along the Las Vegas Strip?",
        "response": "Stardust Resort and Casino",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016 Boise State Broncos football team represented Boise State University during the 2016 NCAA Division I FBS football season, They were invited to the Cactus Bowl where they lost to Baylor, the 2016 Baylor Bears football team represented Baylor University in the 2016 NCAA Division I FBS football season, were coached by which interim head coach, in their 118th football season?",
        "response": "Jim Grobe",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Leigh Nash and Katrina Leskanich in the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was The Desert Inn, which was run by Allard Roen as the managing director?",
        "response": "casino hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "On which coast can the California Aqueduct and the Lake Washington Ship Canal be found?  ",
        "response": "west",
        "source": "hotpot_qa"
    },
    {
        "query": "The head coach of the 1987–88 Kentucky Wildcats men's basketball team is one of only 8 major college men's basketball coaches to have over how many career wins?",
        "response": "800",
        "source": "hotpot_qa"
    },
    {
        "query": "Flowered Up was a band during the Baggy movement during what time",
        "response": "late 1980s and early 1990s.",
        "source": "hotpot_qa"
    },
    {
        "query": "What island immigration station was within the Port of New York and New Jersey district?",
        "response": "Ellis Island",
        "source": "hotpot_qa"
    },
    {
        "query": "The star of the sports film Crooked Arrows grew up in what state?",
        "response": "Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor played a role in both the British sitcom Peep Show and the 2016 horror film Ibiza Undead?",
        "response": "Matt King",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Pachycymbium and Physostegia both a genus of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the town that holds the Garth School originally named?",
        "response": "Lebanon",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the tour of Thea Gilmore's EP that included a traditional Scottish song?",
        "response": "2007 spring",
        "source": "hotpot_qa"
    },
    {
        "query": "California joined the Union due to the passage of a package of how many separate bills?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of Cantopop group Twins makes a special appearance in the film Love on the Rocks?",
        "response": "Charlene Choi",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mall at Wellington Green was opened by the regional mall company based in what city?",
        "response": "Bloomfield Hills, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Get Out\" is 2017 American horror film was written, co-produced, and directed by this man who is best known for starring in which Comedy Central sketch series?",
        "response": "Key & Peele",
        "source": "hotpot_qa"
    },
    {
        "query": "Archibald Bulloch was the great-grandfather of an American socialite, who was thought to be one of the inspirations for whom?",
        "response": "Scarlett O'Hara",
        "source": "hotpot_qa"
    },
    {
        "query": "James Rogers served with what American colonial frontiersman, who was his brother, and who served in the British army during the French and Indian War, and the American revolution?",
        "response": "Robert Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "Which case changed the idea of marriage : Georgia v. Randolph or Loving v. Virginia?",
        "response": "Loving v. Virginia",
        "source": "hotpot_qa"
    },
    {
        "query": "Erin Blunt is an actor best known for his role as Ahmad Abdul-Rahim from what 1976 American sports comedy film?",
        "response": "The Bad News Bears",
        "source": "hotpot_qa"
    },
    {
        "query": "Power was a song from the EXO album that was released on what date?",
        "response": "July 18, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Planet Colors\" is the seventh studio album by a Swiss singer that has solk how many records worldwide?",
        "response": "14 million",
        "source": "hotpot_qa"
    },
    {
        "query": "The Guandi Temple is dedicated to a general that served under what warlord?",
        "response": "Liu Bei",
        "source": "hotpot_qa"
    },
    {
        "query": "Which French boxer defeated Hussein Ishaish at the 2016 Summer Olympics as an amateur?",
        "response": "Tony Yoka",
        "source": "hotpot_qa"
    },
    {
        "query": "Jenny Reece was a member at what university known for public research?",
        "response": "University of Maryland, College Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Borth Walney North and Barrow/Walney Island Airport are located in which country?",
        "response": "the United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "Harold William \"Ace\" Elliott (May 29, 1899 – April 25, 1963) was an American baseball pitcher, he played in Major League Baseball, from 1929 to 1932, in the Philadelphia Phillies, an American professional baseball team based in Philadelphia, in which US state?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Kern Island Canal and Indiana Harbor and Ship Canal are both what? ",
        "response": "canals",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the former fashion model who starred in Beautiful and Twisted born?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of a woman from the book titled \"Their Lives: The Women Targeted by the Clinton Machine \" and was also a former white house intern?",
        "response": "Monica Lewinsky",
        "source": "hotpot_qa"
    },
    {
        "query": "when does the English television presenter of This Time Next Year born?",
        "response": "16 October 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "One Manhattan Square, is a residential skyscraper project being developed by Extell Development Company in Two Bridges, Manhattan, New York City, completed, the building will stand out significantly within the context of the neighborhood, the next highest structure being which suspension bridge that crosses the East River in New York City, connecting Lower Manhattan at Canal Street with Downtown Brooklyn at the Flatbush Avenue Extension, at roughly 30 stories in height?",
        "response": "Manhattan Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Shangzhi and the Zengcheng District in the same province?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What district are the W New York Downtown Hotel and Residences and 70 Pine Street located in New York?",
        "response": "Financial District",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Emmanuel Chabrier and Leoš Janáček have in common?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "Homestead Air Reserve Base, home of the 93d Fighter Squadron is located in which U.S. state?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Steven Cuitlahuac Melendez and Disney are connected by what American animator?",
        "response": "Bill Melendez",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor from the South Korean-Thai drama film Final Recipe debuted as a member of Super Junior-M in 2008?",
        "response": "Henry Lau",
        "source": "hotpot_qa"
    },
    {
        "query": "Edgar Vincent was an American publicist and actor of German birth, He went on to specialize in being a publicist for opera singers, helping shape and forward the careers of major stars like which French-American operatic soprano and actress who had an active career from the late 1920s through the early 1970s?",
        "response": "Lily Pons",
        "source": "hotpot_qa"
    },
    {
        "query": "The Friend and Wired, are which type of publication?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "The soundtrack from the film \"Natural Born Killers\" was produced by a man born in what year?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Rahul Bose (born 27 July 1967) is an Indian film actor, director, screenwriter, social activist, and rugby player, he was named \"the Sean Penn of Oriental cinema\" by \"Maxim\", an international men's magazine, devised and launched in the UK in what year, but based in New York City since 1997, and prominent for its photography of actresses, singers, and female models whose careers are at a current peak?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant’s genus has the most other species, Purshia or Bergerocactus?",
        "response": "Purshia",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the man for whose fiftieth birthday the book Minima Moralia was originally written for ?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "The original score to this soundtrack, released on compact disk in 1991 by MCA, was composed by the father of who?",
        "response": "Francis Ford Coppola",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was created first, Youth in Crisis or Darwin's Nightmare?",
        "response": "Youth in Crisis",
        "source": "hotpot_qa"
    },
    {
        "query": "The commander of the Pensacola Convoy passed away in which year ?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was the career of the host of the game show  Three for the Money ?",
        "response": "approximately 60-year",
        "source": "hotpot_qa"
    },
    {
        "query": "Which famous American actor appears in Chappie, directed by Trent Opaloch?",
        "response": "Hugh Jackman",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dangerous Liaisons included a cast with the opera singer of what nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city is home to the Skyhaven Airport?",
        "response": "Rochester",
        "source": "hotpot_qa"
    },
    {
        "query": "The first woman elected Attorney General of Minnesota, served under what party?",
        "response": "Minnesota Democratic–Farmer–Labor Party (DFL)",
        "source": "hotpot_qa"
    },
    {
        "query": "Pavement and Wilco are both rock bands, which band consisted of Stephen Malkmus?",
        "response": "Pavement",
        "source": "hotpot_qa"
    },
    {
        "query": "Cyberdog is an application based on what software framework?",
        "response": "OpenDoc",
        "source": "hotpot_qa"
    },
    {
        "query": "30 Hudson Yards and Bank of America Tower are both located in which city?",
        "response": "Manhattan",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1996 book was written by the founder of Media Matter for America?",
        "response": "The Seduction of Hillary Rodham",
        "source": "hotpot_qa"
    },
    {
        "query": "What other teams played in the same division that Chad Clements played in?",
        "response": "Los Angeles Xtreme, San Francisco Demons and Memphis Maniax",
        "source": "hotpot_qa"
    },
    {
        "query": "Brown State Fishing Lake is in a country that has a population of how many inhabitants ?",
        "response": "9,984",
        "source": "hotpot_qa"
    },
    {
        "query": "Hard Choices: Moral Dilemmas in Humanitarian Intervention is a non-fiction compilation book with a noteworthy contributor to the book who was a British racing driver who died during what 1973 race?",
        "response": "Dutch Grand Prix",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both  Adolfo Bioy Casares and Iris Rainer Dart authors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Multiply and At. Long. Last. ASAP connected?",
        "response": "American rapper",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was made first,  Prince Among Slaves or The Seafarers?",
        "response": "The Seafarers",
        "source": "hotpot_qa"
    },
    {
        "query": "What bridge is the London Assembly close to in River Thames?",
        "response": "Tower Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Claus Dierksmeier (born May 17, 1971 in Pforzheim) is a German philosopher, since 2002 he was a professor at the Stonehill College, a private, non-profit, coeducational, Roman Catholic, liberal arts college located in Easton, Massachusetts, United States, founded in which year?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English-born Australian singer/songwriter was a judge on season 8 of Australia's Got Talent?",
        "response": "Sophie Charlene Akland Monk",
        "source": "hotpot_qa"
    },
    {
        "query": "Christopher Charles Eric \"Chris\" Woods, is a former England international football goalkeeper, who played in the Football League and Premier League, with the departure of David Moyes, he followed him to Manchester United to replace which former English footballer turned coach, who is currently employed as a goalkeeping coach by the Football Association, working with England's junior teams?",
        "response": "Eric Steele",
        "source": "hotpot_qa"
    },
    {
        "query": "Peter Holmström plays  guitar in which American alternative rock band form the 1990s?",
        "response": "The Dandy Warhols",
        "source": "hotpot_qa"
    },
    {
        "query": "Pasco County, incorporating Jasmine Estates and the county seat Dade City, is in which U.S. state?",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Australian rock band formed in 1978 where a Scottish-born, Australian-American musician and actor performed as lead vocalist?",
        "response": "Men at Work",
        "source": "hotpot_qa"
    },
    {
        "query": "Reinhold O. Schmidt was a UFO contactee in the same era as which Polish-American citizen?",
        "response": "George Adamski",
        "source": "hotpot_qa"
    },
    {
        "query": "Lover Come Back contained the actress who played which part on The Brady Bunch?",
        "response": "Alice Nelson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died first, Paula Fox or Laura Ingalls Wilder",
        "response": "Laura Ingalls Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "Brandon Johnson was drafted by which professional American football franchise based in the Phoenix metropolitan area?",
        "response": "Arizona Cardinals",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the British visual effects artist for the fourth instalment in the \"Harry Potter\" film series?",
        "response": "Sara Bennett",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the temple that Herostratus sought to destroy dedicated to?",
        "response": "goddess Artemis",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the team located that drafted Alexaner Sundstrom?",
        "response": "Newark",
        "source": "hotpot_qa"
    },
    {
        "query": "Charles Helm was part of the Rudd Concession along with which British mining magnate?",
        "response": "Cecil John Rhodes PC",
        "source": "hotpot_qa"
    },
    {
        "query": "Arthur bell as an amateur cricketer player for what league known for employing professional players.",
        "response": "Lancashire League",
        "source": "hotpot_qa"
    },
    {
        "query": "Bayt ʿIṭāb, was a Palestinian Arab village located in which Subdistrict, an ancient tunnel which led to the village spring is associated with story of Samson, who was the last of the judges of the ancient Israelites mentioned in the Book of Judges in the Hebrew Bible (chapters 13 to 16) and one of the last of the leaders who \"judged\" Israel before the institution of the monarchy?",
        "response": "Jerusalem",
        "source": "hotpot_qa"
    },
    {
        "query": "\"This Is Your Song\" previously made appearances as the B-Side to what country song that was written by Paul Overstreet and Don Schlitz?",
        "response": "\"When You Say Nothing at All\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Restrepo and Vanishing of the Bees, which film suggests a link between neonicotinoid pesticides and CCD?",
        "response": "Vanishing of the Bees",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the other name given to the Memorial to the Murdered Jews of Europe which lies directly opposite the Hotel Adlon and is located in Berlin?",
        "response": "Holocaust Memorial",
        "source": "hotpot_qa"
    },
    {
        "query": "Are 7 Up and Tropicana Products both brands held by Dr Pepper Snapple Group in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British Conservative Party politician who serves as editor of the \"London Evening Standard\" contributed to the setting up of The Atlantic Bridge?",
        "response": "George Osborne",
        "source": "hotpot_qa"
    },
    {
        "query": "What retired Argentine footballer is nicknamed \"Cuchu\" and also has an older brother who is a retired Argentine footballer?",
        "response": "Esteban Cambiasso",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a part of The Vaudevillains and performs on the SmackDown brand?",
        "response": "Aiden English",
        "source": "hotpot_qa"
    },
    {
        "query": "Joy Wants Eternity is a five piece post-rock band from which city, it can be surmised that the name of the band is a reference to the philosophical poem Zarathustra's roundelay of Friedrich Nietzsche's Thus Spoke Zarathustra?",
        "response": "Seattle",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator, director, producer, and writer of SpongeBob SquarePants series as well as a co-writter of The SpongeBob SquarePants Movie?",
        "response": "Stephen Hillenburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Douridas is a DJ at the radio station that is based in the beachfront city in what California county?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "What dance company founded in 1958 had Judith Jamison as the Artistic Director?",
        "response": "Alvin Ailey American Dance Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "Giacomo Meyerbeer and Wolfgang Amadeus Mozart shared what occupation?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Barton-Zard scientist, Derek Barton, win a Nobel Prize?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the creator of Bully Boy born?",
        "response": "3 May 1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Co-Dependents' Day is an episode of a tv show season which began when?",
        "response": "Sunday, November 2, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "In what body of water is the small island where Ahdeya Ahmed lives?",
        "response": "Persian Gulf",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was founded first, Collier's or Indianapolis Monthly?",
        "response": "Collier's",
        "source": "hotpot_qa"
    },
    {
        "query": "The novel \"Cress\" is loosely based on a Grimm Brothers' fairytale first published in what year?",
        "response": "1812",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is taller, Mount Everest or Sunanda Devi?",
        "response": "Mount Everest",
        "source": "hotpot_qa"
    },
    {
        "query": "The Winter Line was a series of German and Italian military fortifications in Italy, constructed during World War II by Organisation Todt and commanded by Albert Kesselring,  was a German \"Luftwaffe Generalfeldmarschall\" during which event?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What French luxury fashion house has been worn by the American actress who is the older sister of actor Jake Gyllenhaal?",
        "response": "Chloé",
        "source": "hotpot_qa"
    },
    {
        "query": "Frances de la Tour and Alec Christie both were in a siutation comedy called what?",
        "response": "A Kind of Living",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Disney film came first Amy or The Big Green?",
        "response": "Amy",
        "source": "hotpot_qa"
    },
    {
        "query": "What team drafted the former QMJHL goalie and former Penguins goalie in an expansion draft?",
        "response": "Vegas Golden Knights",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the sci fi movie that Robert Mailet appeared in that was directed by Guillermo del Toro?",
        "response": "Pacific Rim",
        "source": "hotpot_qa"
    },
    {
        "query": "Purple Rain is a song by Prince and The Revolution, it reached number 2 in the United States for how long, behind Wake Me Up Before You Go-Go, a song by the British duo Wham!?",
        "response": "two weeks",
        "source": "hotpot_qa"
    },
    {
        "query": "What is one physical charactertic of a fuchs?",
        "response": "Foxes have a flattened skull, upright triangular ears, a pointed, slightly upturned snout, and a long bushy tail (or \"brush\").",
        "source": "hotpot_qa"
    },
    {
        "query": "Which debut album contained a 1999 mega-hit song created by Maurizio Lobina and Jeffrey Jey?",
        "response": "Europop",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person who helped write Mis'ry's Comin' Aroun born?",
        "response": "July 12, 1895",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Swiss city is the home of Villars-Maitre-Chocolatier?",
        "response": "Fribourg",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state is the company of which Maynards is now a brand based?",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "Superdrag and Tom Morello, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "which former lawyer previously held the seat held by Yuh-Line Niou",
        "response": "Sheldon Silver",
        "source": "hotpot_qa"
    },
    {
        "query": "Cyril P. Callister created what food spread from leftover brewers' yeast extract in 1922?",
        "response": "Vegemite",
        "source": "hotpot_qa"
    },
    {
        "query": "Which college located in Northfield, Minnesota, United States provides employment to Professor Anantanand Rambachan as a Professor of Religion?",
        "response": "St. Olaf College",
        "source": "hotpot_qa"
    },
    {
        "query": "Dale Hey, was an American professional wrestler, better known by his ring name, Buddy Roberts, he was inducted in 2015, into which American professional wrestling hall of fame and museum located in Wichita Falls, Texas?",
        "response": "Professional Wrestling Hall of Fame (PWHF)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who formed the government that had a king that was the last Emperor of India?",
        "response": "Stanley Baldwin",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Gary Danielson play in the National Football League?",
        "response": "quarterback",
        "source": "hotpot_qa"
    },
    {
        "query": "Sigh, is a Japanese extreme metal band from Tokyo, formed in which year, and are credited as being one of the first Japanese black metal bands, producing music in the early 1990s when the majority of black metal came from Scandinavia, a historical and cultural region in Northern Europe characterized by a common ethnocultural North Germanic heritage and mutually intelligible North Germanic languages?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school was founded first, Bahauddin Zakariya University or Cleveland State University?",
        "response": "Cleveland State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professor from Bath Spa University wrote a collection of short stories that inspired an ITV drama called Grantchester?",
        "response": "James Runcie",
        "source": "hotpot_qa"
    },
    {
        "query": "UFC Fight Night: Namajunas vs. VanZant was held at a luxury resort casino and hotel opened on what date?",
        "response": "December 15, 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "The Valachi hearings, also known as the McClellan hearings, investigated organized crime activities across America, the hearings were named after which American gangster, notable as the first member of the Italian-American Mafia to publicly acknowledge its existence,was a major government witness against the American Mafia?",
        "response": "Joseph Michael \"Joe Cargo\" Valachi",
        "source": "hotpot_qa"
    },
    {
        "query": "Craig Staff has had his work displayed in which museum located in the westernmost city of the Florida Panhandle?",
        "response": "National Museum of Naval Aviation",
        "source": "hotpot_qa"
    },
    {
        "query": "Seven Days is directed by whom",
        "response": "Won Shin-yun",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the country that is home to the Larga River?",
        "response": "Bucharest",
        "source": "hotpot_qa"
    },
    {
        "query": "Dubhghall mac Suibhne was a prominent 13th-century noble, the Earl of Menteith also obtained Lochranza Castle, an L-plan tower house situated on a promontory in Lochranza, on the north of the Isle of Arran, in which country?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the 1991 alliance that created the instruction set implemented by the x704 microprocessor?",
        "response": "Apple–IBM–Motorola alliance",
        "source": "hotpot_qa"
    },
    {
        "query": "Josie DeVencenzo appeared as a tattoo artist in an episode of an American sitcom that was created by David Crane and who?",
        "response": "Marta Kauffman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tori Amos and Eric Clapton from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the band that made the album Anthems to the Welkin at Dusk?",
        "response": "Ihsahn",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Velimir Khlebnikov and Rabindranath Tagore both from Russia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died and had his dog wait in Japan for him for 9 years after his death?",
        "response": "Hidesaburō Ueno",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both ConocoPhillips and Cablevision headquartered in New York City?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport Pago Pago International Airport or Chattanooga Metropolitan Airport is closer to the central business district of their local community ?",
        "response": "Chattanooga Metropolitan Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "The terrorist, Valerio Morucci, was a member of which organization that was responsible for numerous violent incidents during the \"Years of Lead\"?",
        "response": "The Red Brigades",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Norman Blake and Bryan Ferry both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie was scored by Danny Cocke's and starred Daniel Craig and Rooney Mara? ",
        "response": "The Girl with the Dragon Tattoo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the writer of the series Agent 327 is named after?",
        "response": "Ian Fleming",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ketel One liquor is the only liquor that can use its name, according to European Union regulations?",
        "response": "Jenever",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Grand Slam champion after winning the 2015 French Open men's doubles title with Marcelo Melo, Fabio Fognini or Ivan Dodig ?",
        "response": "Ivan Dodig",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Jeff Mangum or Rose McDowall?",
        "response": "Rose McDowall",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of the movie \"Yogi Bear\" was born on November 29, 1976?",
        "response": "Anna Faris",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the album that featured the song \"Untitled 03 | 05.28.2013.\" released?",
        "response": "March 4, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Bally Astrocade and NEC PC-100, are related to which entity?",
        "response": "home",
        "source": "hotpot_qa"
    },
    {
        "query": "A vehicle that uses hydrogen as its onboard fuel for motive power is cosidered which, Flex-fuel or Bi-fuel?",
        "response": "bi-fuel vehicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Bertalan Farkas or Umberto Guidoni? ",
        "response": "Bertalan Farkas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who owns the Flobal Rallycross that Scott Speed competes in?",
        "response": "Red Bull",
        "source": "hotpot_qa"
    },
    {
        "query": "What king held Aketorpe in 1086?",
        "response": "William the Conqueror",
        "source": "hotpot_qa"
    },
    {
        "query": "The Creators and Best Boy were both produced before 2000 ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The RATE project has a member who has proposed a theory that resolves what problem with young-earth creationism?",
        "response": "distant starlight",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school was founded first, Virginia Commonwealth University or George Mason University?",
        "response": "Virginia Commonwealth University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the debut movie of Vijayta Pandit, the younger sister of a Filmfare Award winning singer and actor who starred in Phaansi alongside Shashi Kapoor?",
        "response": "Love Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: Which animal which is white in winter and brown in summer lives throughout the Arctic and can trace its roots to an extinct animal that lived in the Himalayas?",
        "response": "Arctic fox",
        "source": "hotpot_qa"
    },
    {
        "query": "During what conflict was much of the economy of Spain put under worker control?",
        "response": "Spanish Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "Where both the Operation Undertone and Battle of the Wilderness fought by the army?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Shin Hye-sun (born August 31, 1989) is a South Korean actress, she acted her first protagonist role in which 2017 South Korean television series, starring Park Si-hoo, Shin Hye-sun, Lee Tae-hwan, and Seo Eun-soo?",
        "response": "My Golden Life",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the county that Cari Roccaro is from?",
        "response": "Suffolk",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the King who made the 1925 Birthday Honours born?",
        "response": "1865",
        "source": "hotpot_qa"
    },
    {
        "query": "The album, The Con, was released by the Canadian indie pop band formed in 1998 in Calgary, Alberta composed of who?",
        "response": "identical twin sisters",
        "source": "hotpot_qa"
    },
    {
        "query": "Luigi Gervasi was nominated for a Best Art Direction Academy Award for a film based on a play by what playwriter?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the controversial event, in which the Toyota TF105 participated, where only 6 of the 20 entrants finished the race?",
        "response": "2005 United States Grand Prix",
        "source": "hotpot_qa"
    },
    {
        "query": "What Australian musician who wrote Whole Lotta Rosie was absent briefly in 1988 from AC/DC?",
        "response": "Malcolm Young",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ford Motor Company Edgewater Assembly Plant was located in the city along which river in New Jersey?",
        "response": "Hudson River",
        "source": "hotpot_qa"
    },
    {
        "query": "Morgan Carroll unsuccessfully ran against Mike Coffman for which of Colorado's congressional district?",
        "response": "Colorado's 6th congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "Which contributor to The Great American Dream Machine was a part of the CBS News program \"60 Minutes\" for over 30 years?",
        "response": "Andy Rooney",
        "source": "hotpot_qa"
    },
    {
        "query": "Which iconic, knighted British actor appears in 2013 heist movie Now You See Me?",
        "response": "Michael Caine",
        "source": "hotpot_qa"
    },
    {
        "query": "The Joke The Aristocrats was used by Gilbert Gottfried to roast this man who was the chief creative officer of what?",
        "response": "Playboy Enterprises",
        "source": "hotpot_qa"
    },
    {
        "query": "The video clip of the song the premiered in the pre-show of 2015 MTV Video Music Awards was released by which record label ?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Not Richard, But Dick was an album by the band formed in what city?",
        "response": "Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Michael Bay and Albert Ray both directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of animation was used in the show created by Arthur Rankin Jr. and an American director, producer, composer, lyricist, and author?",
        "response": "stop motion",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor in Airbag won the Academy Award for his role in \"No Country for Old Men\"?",
        "response": "Javier Bardem",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Major and Commander of the Argentine National Gendarmerie was involved in a special military intelligence service of the Argentine Army that collected information on and infiltrated guerrilla groups, human rights organizations, coordinated killings, kidnappings, and other abuses?",
        "response": "Agustín Feced",
        "source": "hotpot_qa"
    },
    {
        "query": "This 2009 computer-animated science film, starring the voice of Elijah Wood is an adaption of a 2005 student project from which University?",
        "response": "UCLA",
        "source": "hotpot_qa"
    },
    {
        "query": "Mentiras, el musical, is a 2009 Mexican stage musical that uses previously released popular songs as its what? ",
        "response": "musical score",
        "source": "hotpot_qa"
    },
    {
        "query": "Which main antagonist in some of the Sherlock Holmes stories was holmes old arch-enemy, in Sherlock Holmes - The Musical",
        "response": "Professor James Moriarty",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward F. Cline and Mike Hodges, are screenwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Olivia Holt starred in what American teen sitcom that premiered on Disney Channel on January 17, 2014?",
        "response": "I Didn't Do It",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Melicytus and Coix both plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a live-action documentary, All in This Tea or One Big Hapa Family?",
        "response": "One Big Hapa Family",
        "source": "hotpot_qa"
    },
    {
        "query": "What date did the playoff season, resulting in the New England Patriots third overall Super Bowl victory, began?",
        "response": "December 28, 1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What does INS Nipat have to do with the Indian Navy?",
        "response": "have been named INS \"Nipat\":",
        "source": "hotpot_qa"
    },
    {
        "query": "In which theater did Heidi Brunner, a Swiss opera singer, play the role as Annio? ",
        "response": "Estates Theatre in Prague",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Monsters, Inc. and The Good Dinosaur produced by Pixar animation and released by Walt Disney?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which writer was also a translator, Harold Pinter or Fernando Pessoa?",
        "response": "Fernando Pessoa",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is the location of the school, where American football player and coach Condit Woodhull Dibble starred as the halfback?",
        "response": "Mercer",
        "source": "hotpot_qa"
    },
    {
        "query": "Meredith Bergmann, is a U.S. sculptor, poet, and essayist whose work is said to \"forge enriching links between the past and the concerns of the present.\", her memorial to which prominent African-American poet, novelist, children's writer, and playwright during the Harlem Renaissance, is in the collection of the New York Public Library? ",
        "response": "Countee Cullen",
        "source": "hotpot_qa"
    },
    {
        "query": "The author regarded by many as the greatest novelist of the Victoria era would have a first name of Karol in what language?",
        "response": "Polish and Slovak",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was founded first Swarthmore College or George Washington University ?",
        "response": "George Washington University",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the album that \"Santa Claus Is Back in Town\" is a part of recorded?",
        "response": "Radio Recorders in Hollywood",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the magazine that Manjit Kumar was an editor for published?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American artist's studios, known for New Mexico landscapes, is part of the National Trust for Historic Preservation?",
        "response": "Georgia Totto O'Keeffe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these two board games had two designers, Abalone or Elfenland?",
        "response": "Abalone",
        "source": "hotpot_qa"
    },
    {
        "query": "The head coach of the Washington State Cougars football team helped popularize what offensive scheme?",
        "response": "air raid offense",
        "source": "hotpot_qa"
    },
    {
        "query": "Who developed the game in which Judi Beecher provides the voice and facial motion of Madison Paige?",
        "response": "Quantic Dream",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the biggest anmade crater and can be seen from Earth orbit?",
        "response": "The Sedan Crater",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people does the arena across the street from HarborCenter seat?",
        "response": "19,070",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Maher Sabry and Joseph L. Mankiewicz both cartoonist?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Eleven Eleven is the studio album by the folk-rock musician of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which British Conservative Party politician helped set new standards for environmental management?",
        "response": "John Gummer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, The Jungle Book 2 or Kidnapped?",
        "response": "Kidnapped",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the ride that is nearly identical to the Goliath at Six Flags Over Texas?",
        "response": "245 feet",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people cross the border over which the Chamizal dispute  took place?",
        "response": "approximately 350 million legal crossings",
        "source": "hotpot_qa"
    },
    {
        "query": "Yulia Makhalina's fellow member of 'the basketball team' studied at what academy? ",
        "response": "Vaganova Academy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which village and civil parish in Hertfordshire did Watling Chase Timberland Trail passes through",
        "response": "London Colney",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city where J. Press's largest store is located?",
        "response": "862,477",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Through a Blue Lens and There Is No Authority But Yourself have in common?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Both genus of plant, Worsleya and Quince, grow beautiful flowers. Which genus of plant is known to bear pome fruit?",
        "response": "The quince",
        "source": "hotpot_qa"
    },
    {
        "query": "The League of Gentlemen's Apocalypse is a feature film spin-off of the British television comedy series \"The League of Gentlemen\", featuring in guest roles are which English comedian and actor, and in a 2004 poll for the BBC, Kay was named the 46th most influential person in British culture?",
        "response": "Peter Kay",
        "source": "hotpot_qa"
    },
    {
        "query": "What Scottish singer covered \"The Man Who Sold the World\"?",
        "response": "Lulu",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did both Phil Mustard and Adam Gilchrist play in wicket?",
        "response": "wicketkeeper",
        "source": "hotpot_qa"
    },
    {
        "query": "The physicist who won the 1917 Nobel Prize in Physics for the discovery of Characteristic X Rays was of what nationality?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the end date of the season of South Park that includes the episode entitled \"Titties and Dragons\"?",
        "response": "December 11, 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the city where the Versare Car Company was originally based?",
        "response": "\"the Arsenal City\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won 2 Grand Slam doubles titles, Ellis Ferreira or Pavel Složil?",
        "response": "Ellis Ferreira",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film directed by Rovert Wise stars Richard Beymer?",
        "response": "West Side Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Are McG and Nagisa Oshima both record producers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jennifer Lee and Izu Ojukwu both award-winning directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dan Pugh has anchored which Sunday edition of \"SportsCenter\"?",
        "response": "11 p.m. edition",
        "source": "hotpot_qa"
    },
    {
        "query": "The First Minute of a New Day is an album by a musician that died in what year?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the soundtrack movie in which Wild Belle song was featured is directed by directed by Nat Faxon and Jim Rash? ",
        "response": "The Way, Way Back",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the American actor,who owns the school which Tallulah Harlech attended born in",
        "response": "part of Galicia, Austrian Poland,",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Psychiatric Institute of Washington or Howard University Hospital older?",
        "response": "Howard University Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "are Xuanhua District and Yongji, Shanxi are both located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "RL-83 Blindicide was an improved derivative of a wea[on launcher widely fielded by which army ?",
        "response": "the United States Army",
        "source": "hotpot_qa"
    },
    {
        "query": "What American singer and producer does Snoop Dogg's song that includes a stutter edit feature?",
        "response": "Pharrell",
        "source": "hotpot_qa"
    },
    {
        "query": "This Fox News Specialist Host also took over what Fox Business Channel news program in 2013?",
        "response": "Cashin' In",
        "source": "hotpot_qa"
    },
    {
        "query": "The ballistics of the .260 Remington are basically similar to a cartridge developed in what year?",
        "response": "1891",
        "source": "hotpot_qa"
    },
    {
        "query": "RatPac-Dune Entertainment was co-founded by the billionaire of what nationality?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "What company is headquartered at a casino formerly known as Vegas World?",
        "response": "American Casino & Entertainment Properties",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog, the Swedish Lapphund or the Scotch Collie, was used by the Sami people for herding and guarding their reindeer?",
        "response": "Swedish Lapphund",
        "source": "hotpot_qa"
    },
    {
        "query": "Dave King and Jimmie Ross, share which mutual occupation?",
        "response": "vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Die Macher and Quoridor German board games?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "For what reason did Gustavo Rodolfo Mendoza Hernandex resign to the first Jesuit pope?",
        "response": "his age",
        "source": "hotpot_qa"
    },
    {
        "query": "Which representative of the Electoral district of Monaro is the 18th Deputy Premier of New South Wales?",
        "response": "John Barilaro",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper put out an album that featured a guest appearance from a hip hop artist that had won Best Grime Act at the 2014 and 2015 MOBO Awards?",
        "response": "Giggs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary by Arturo Perez Jr. appeared at an university that is part of the 23-campus California State University system?",
        "response": "Where Have All the Flowers Gone?",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the last U.S. commissioned battleship that was shown in a 1945 World War ll documentary?",
        "response": "the USS \"Missouri\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Lynch and Douglas Sirk, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Royal Australian Air Force pilot was also part of the 1949/1950 tour of South Africa? ",
        "response": "Keith Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of film is the film that was based on a 2001 novel with the same name and stars an American actress and director that was nominated twice for a Tony Award?",
        "response": "American comedy-drama film",
        "source": "hotpot_qa"
    },
    {
        "query": "Leonard Norman Wein, was an American comic book writer and editor best known for co-creating DC Comics' Swamp Thing and Marvel Comics' Wolverine, and was the editor for writer Alan Moore and illustrator Dave Gibbons' influential DC miniseries \"Watchmen\", Watchmen is an American comic-book limited series published by DC Comics, in which years?",
        "response": "1986 and 1987",
        "source": "hotpot_qa"
    },
    {
        "query": "The transnational lottery Les Scadding won in 2009 held it's first draw on what date?",
        "response": "13 February 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1960 film was made by someone blacklisted in the McCarthy era?",
        "response": "Never on Sunday",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the first documented appearance of the song Chuck Berry used as the melody in Promised Land?",
        "response": "1882",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the novel that was the basis for the movie that Morfydd Clark played Frederica Vernon in?",
        "response": "Jane Austen",
        "source": "hotpot_qa"
    },
    {
        "query": "Born December 25, 1913 this actor stared in \"Sing and Be Happy\".",
        "response": "Tony Martin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which heavy metal band released As Ugly as They Wanna Be which is a parody of 2 Live Crew's 1989 album?",
        "response": "Ugly Kid Joe",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did Chris Pratt play in the movie in which he starred with Bryce Dallas Howard?",
        "response": "Owen Grady",
        "source": "hotpot_qa"
    },
    {
        "query": "What tribe what American Horse a part of?",
        "response": "American Horse (Oglala Lakota: \"Wašíčuŋ Tȟašúŋke\" in Standard Lakota Orthography) (a/k/a \"American Horse the Elder\") (1830–September 9, 1876) was an Oglala Lakota warrior chief renowned for Spartan courage and honor.",
        "source": "hotpot_qa"
    },
    {
        "query": "What metropolitan statistical area is the Hungerford Vocational Highschool located in?",
        "response": "Orlando–Kissimmee",
        "source": "hotpot_qa"
    },
    {
        "query": "Peltandra and Cyrtanthus, are which type of entities?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was played alongside Morten Suurballe in the three television series \"The Killing\"?",
        "response": "Sofie Gråbøl",
        "source": "hotpot_qa"
    },
    {
        "query": "What country has jurisdicion over one of the fives Arctic Coastal states and had a historian that specialized in aboriginal rights?",
        "response": "Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "The narrator of \"The Legend of Marilyn Monroe\" was born in what year?",
        "response": "1906",
        "source": "hotpot_qa"
    },
    {
        "query": "Titus is the soundtrack to the film that starred which actors?",
        "response": "Anthony Hopkins and Jessica Lange",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Ann Terry won the 80m hurdles event at what Sao Paulo-based event from 1963?",
        "response": "Pan American Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the Mercedes-Benz E-Class, the coupé and convertible versions of the fourth generation Mercedes-Benz E-Class automobile or the Mercedes-Benz CLK-Class the series of mid-size luxury coupés and convertibles produced by German car manufacturer Mercedes-Benz in two generations, sold from 2009 to 2017?",
        "response": "Mercedes-Benz E-Class",
        "source": "hotpot_qa"
    },
    {
        "query": "Name any class of vertebrates within the class of Mammalia that has atleast 2 types of sensors?",
        "response": "Mammals",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Teru or Mike Shinoda?",
        "response": "Teruhiko",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the band artist Sleeping with Sirens or Augie March released more albums during their careers?",
        "response": "Sleeping with Sirens",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this American comedian, actress, and writer, who was a supporting cast remember in Brooklyn Nine-Nine as Gina?",
        "response": "February 20, 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the third member of the trio that  \"The Professor\" a part of on the Atlanta Braves with John Smoltz?",
        "response": "Tom Glavine",
        "source": "hotpot_qa"
    },
    {
        "query": "Up All Night had an executive producer who created what acclaimed comedy series in 2006?",
        "response": "30 Rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the dancer who partnered Tom Chambers in the sixth season of Strictly Come Dancing ?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the novel published which features Dumbledore's Army?",
        "response": "21 June 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Christian Juttner's most famous movies takes its name from a 1963 Beatles song?",
        "response": "\"I Wanna Hold Your Hand\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the mother of the Romance Writers of America's first president?",
        "response": "Rita Gallagher",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cirque de Gavarnie is compared to what oval amphitheatre built of concrete and sand is the largest amphitheatre ever built?",
        "response": "Colosseum",
        "source": "hotpot_qa"
    },
    {
        "query": "In the same NBA Draft where Kwame Brown was the first high school player to be drafted with the first overall pick, Ear Joesph was drafted the Supersonics, what draft was that? ",
        "response": "2001 NBA draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Brigitte Millar starred along side Daniel Craig and Christoph Waltz in a film that was the 24th in what series?",
        "response": "\"James Bond\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was invented first, Halma or Terra Mystica?",
        "response": "Terra",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did american guitarist Darrel Lance Abbott form the band Damageplan?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "Which island is located 240km to the south od Australia and is the birth place of Maxwell Arthur Burr?",
        "response": "Tasmania",
        "source": "hotpot_qa"
    },
    {
        "query": "Adult Beginners is a 2014 film starring an actor known for his recurring role of Officer Vincent \"Vince\" D'Angelo on what comedy series?",
        "response": "Will & Grace",
        "source": "hotpot_qa"
    },
    {
        "query": "Puerto Almanza is a village settlement along the northern shore of a strait located where?",
        "response": "on the extreme southern tip of South America partly in Chile and partly in Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "are Patrick Stump and G.O both singer-songwriters ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the personal assistant to General of the Armies John Joseph \"Black Jack\" Pershing during World War I?",
        "response": "William Corcoran Eustis",
        "source": "hotpot_qa"
    },
    {
        "query": "Were The Dangerous Summer and Archers of Loaf both founded in the same State ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What two, Three letter companies made a series featuring the guy who killed Jesus.",
        "response": "BBC and HBO Films",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the author of Eat to Live born?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "This English actor has a son whose work includes what 2002 film?",
        "response": "The Hours",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player won more doubles titles, Leoš Friedl or Sara Errani?",
        "response": "Sara Errani",
        "source": "hotpot_qa"
    },
    {
        "query": "Paulo Sevciuc, is a Brazilian former volleyball player who competed in the 1972 Summer Olympics, and played on the team which won a silver medal at which event, were held in Winnipeg, Manitoba, Canada, from July 23 to August 6, 1967?",
        "response": "1967 Pan American Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Janez Lapajne and Tony Scott, have which mutual occupations?",
        "response": "film director and producer",
        "source": "hotpot_qa"
    },
    {
        "query": "The Doomsday Flight is a film written by a screenwriter known as the what of Hollywood?",
        "response": "\"angry young man\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of music did the band play that was both founded in 1994, and had an album released in 1994 and reissued in 2000 through InsideOut Music?",
        "response": "progressive metal",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Kennebec river located?",
        "response": "Winslow in Kennebec County, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "The colony Michel Sarrazin immigrated at age 25 to ended with the cession to Great Britain and Spain in what year?",
        "response": "1763",
        "source": "hotpot_qa"
    },
    {
        "query": "What was rushed, for the state that Pat McCarran was from, in order to ensure three electoral votes for Abraham Lincoln's reelection?",
        "response": "Statehood",
        "source": "hotpot_qa"
    },
    {
        "query": "Ross Pople worked with this French dominant figure of the post-war classical music world.",
        "response": "Pierre Louis Joseph Boulez",
        "source": "hotpot_qa"
    },
    {
        "query": "Is a Kumquat a member of the Tetracentron genus?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the film director of the film \"Saw III\" born?",
        "response": "January 11, 1979",
        "source": "hotpot_qa"
    },
    {
        "query": "Ahn Byeong-ki was a director of the 2002 South Korean film starring whom?",
        "response": "Ha Ji-won and Kim Yoo-mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Tim Wheeler and Joe Strummer both been members of a band?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Bigsby & Kruthers was a high profile men's clothier in Chicago for 30 years from 1970 to 2000, another location had opened and closed (or moved), include an outlet store in Gurnee Mills, a Dallas, Texas store that opened in which year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Raiffeisen Zentralbank is the central institution of one a group of co-operative banks in Austria. What is the name of the other group?",
        "response": "Austrian Volksbanks",
        "source": "hotpot_qa"
    },
    {
        "query": "Who participated in the match featuring Jeff Smith as an undercard?",
        "response": "Muhammad Ali and Joe Frazier",
        "source": "hotpot_qa"
    },
    {
        "query": "What film directed bySalvatore Samperi original name was Malizia italian for \" malice\"? ",
        "response": "Malicious",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Roger Christian and Reginald Hudlin in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Francesca \"Frankie\" Rayder appeared in a fashion show by an American designer, manufacturer, and marketer of women's premium lingerie, womenswear, and beauty products that is wholly owned by who?",
        "response": "L Brands",
        "source": "hotpot_qa"
    },
    {
        "query": "The war that included The First Battle of Taku Forts took place in what years?",
        "response": "1856 to 1860",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the aircraft that The Silver Falcons fly introduced?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was Salina Giles in that was directed by James McTeigue?",
        "response": "V for Vendetta",
        "source": "hotpot_qa"
    },
    {
        "query": "Dil Aur Deewar, is a Bollywood film, released in which year,  produced by D. Ramanaidu on Vijaya & Suresh Productions, it has music composed by Laxmikant–Pyarelal, a popular Indian composer duo, consisting of Laxmikant Shantaram Kudalkar (1937–1998) and Pyarelal Ramprasad Sharma?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Pascali's Island is a 1988 British drama film starring an English actor who began her acting career with what company in 1967?",
        "response": "Royal Shakespeare Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of flowering plant, Dieffenbachia or Encephalartos?",
        "response": "Dieffenbachia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tree That Remembers and Client 9: The Rise and Fall of Eliot Spitzer are both what type of movie?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Every Avenue and Parabelle, bands that both originated in the 2000's, have each released three albums. Which of these bands has experienced numerous line-up changes?",
        "response": "Parabelle",
        "source": "hotpot_qa"
    },
    {
        "query": "Runaway Jury is a 2003 American legal thriller film starring an actor who won the  Academy Award for Best Actor in 1980 for what movie?",
        "response": "Kramer vs. Kramer",
        "source": "hotpot_qa"
    },
    {
        "query": "Before the start of the 2014–15 Indiana Pacers season, storm clouds gathered around which American professional basketball player for the Oklahoma City Thunder of the National Basketball Association (NBA)?",
        "response": "Paul George",
        "source": "hotpot_qa"
    },
    {
        "query": "In the Royal Rumble the rock defeated Phillip Jack Brooks also known as what?",
        "response": "CM Punk",
        "source": "hotpot_qa"
    },
    {
        "query": "Vanilla Ice's album Hard to Swallow, features appearances from the lead signer of the band Bloodhound Gang, who was born on what day?",
        "response": "born August 27, 1972",
        "source": "hotpot_qa"
    },
    {
        "query": "What team acquired in 2010 by a former NBA player has a player who previously played college basketball for the North Carolina Tar Heels",
        "response": "Charlotte Hornets",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Adunis and Jonathan Kellerman both psychologists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote The Secret River and The Yearling?",
        "response": "Marjorie Kinnan Rawlings",
        "source": "hotpot_qa"
    },
    {
        "query": "Along side Tom Neal, J. Carrol Naish, Robert Ryan, and Floria Holden, this film star who starred in Behind the Rising sun, had her final role in which tv program?",
        "response": "Perry Mason",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the capital city where the contested 1994 contested games took place?",
        "response": "Hiroshima",
        "source": "hotpot_qa"
    },
    {
        "query": "Robin Sachs had a voice credit in the franchise of sci-fi role-playing games developed by what Canadian company?",
        "response": "BioWare",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Michaël Llodra and Ferdi Taygan from the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who acts as an analyst for a TV network for Kansas Jayhawks women's basketball team?",
        "response": "Brenda VanLengen",
        "source": "hotpot_qa"
    },
    {
        "query": "The trophy given to the winner of the college football game between University of Idaho Vandals and University of Montana Grizzlies is derived from which European culture?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the home ground of the team for  which Alfred Chalkley played ?",
        "response": "London Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Anaganaga O Dheerudu and The Santa Clause 2 both fantasy films?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first The Fall or Miracle Legion?",
        "response": "The Fall",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chanur novels is a series of five science fiction novels, forming three separate stories, written by American author C. J. Cherryh, an American writer of speculative fiction, and published by which organization? ",
        "response": "DAW Books",
        "source": "hotpot_qa"
    },
    {
        "query": "John Paul Ruttan, is a Canadian child actor who is best known for RoboCop, an American cyberpunk superhero action film directed by José Padilha, released in which year?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": " What is Bascom Maple Farms, Inc. through its connection to Acworth?",
        "response": "privately held company",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did the husband of Jean Case of the Case Foundation retire from the company he had co-founded?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of Night at the Museum: Battle of the Smithsonian started as a stand-up comedian in San Francisco?",
        "response": "Robin Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-presented a discussion television programme on Sunday, which replaced the 'Heaven and Earth Show', with a Welsh former sprint and hurdling athlete?",
        "response": "Louise Minchin",
        "source": "hotpot_qa"
    },
    {
        "query": "The Kingdom of the Netherlands, known as the Netherlands. What Caribbean country is part of that?",
        "response": "Aruba",
        "source": "hotpot_qa"
    },
    {
        "query": "At what height does State Route 160 start?",
        "response": "4145 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Pavel Urysohn or Efim Zelmanov?",
        "response": "Pavel Samuilovich Urysohn",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Dromm is a council member from the district that includes which northwestern Queens neighborhood?",
        "response": "Jackson Heights",
        "source": "hotpot_qa"
    },
    {
        "query": "How many constituents does Greg Gianforte's district have?",
        "response": "just over 1 million",
        "source": "hotpot_qa"
    },
    {
        "query": "What Swiss multinational healthcare company, introduced the steroidal progestin, Trengestone, in 1974?",
        "response": "Hoffmann-La Roche",
        "source": "hotpot_qa"
    },
    {
        "query": "Seedley railway station is a disused station located in the Seedley area of Pendleton, is an inner city area of Salford in Greater Manchester, in which country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "Emma Rose Kenney's roll in a Blue Sky Studios produced film earned how much money?",
        "response": "$268 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Indian School and In Search of the Second Amendment both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation do Sidney J. Furie and Charles Vidor have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the career that Sidney Lumet and Albert Ward share in common?",
        "response": "screenwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country was the father of Thorvald Eiriksson born?",
        "response": "Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country can one find the Rundle Mall on Hindley Street in Adelaide?",
        "response": "South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "What Was Me included a duet with the American singer-songwriter who worked with what indie rock band?",
        "response": "Gossip",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author born in 1948 wrote a book that wont he 1979 Hugo Award? ",
        "response": "Vonda N. McIntyre",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did an actor from the ABC TV series \"Roseanne\" appear in We're Back! A Dinosaur's Story?",
        "response": "1993",
        "source": "hotpot_qa"
    },
    {
        "query": "John C. Whitcomb was an author that advocated what interpretation of Biblical accounts of the formation of the earth?",
        "response": "Flood geology",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the flowering plants Ecballium and Elatostema in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The author of the book \"A Place of Execution\" is best know for a series of suspense novels featuring what character?",
        "response": "Dr. Tony Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Who hosted Games People Play and was co-host of NBC's \"Today\"?",
        "response": "Bryant Gumbel",
        "source": "hotpot_qa"
    },
    {
        "query": "Elmer Lincoln Irey (1888 – July 19, 1948) was a United States Treasury Department official and director of the Internal Revenue Service's lead investigative unit during the federal tax evasion prosecution of Chicago mobster Al Capone, Alphonse Gabriel Capone ( ; ] ; January 17, 1899 – January 25, 1947), sometimes known by the nickname Scarface, was an American mobster, crime boss and businessman who attained fame during the Prohibition era as the co-founder and boss, of which organization?",
        "response": "Chicago Outfit",
        "source": "hotpot_qa"
    },
    {
        "query": "What country are Belgravia, and Knightsbridge are located in?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Thumb Wrestling Federation is on a network founded by who?",
        "response": "Betty Cohen",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Clive Dunn's cousin, who was in show business for over eighty years, born? ",
        "response": "Covent Garden, west London",
        "source": "hotpot_qa"
    },
    {
        "query": "Otley is a 1969 British comedy thriller film, starring an English actor who received what in February 2001?",
        "response": "knighthood",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that Meher Vij aced in in 2015?",
        "response": "Kabir Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "Run was covered by what actor and singer from Derry, Northern Ireland, who won the Glee Project on August 21, 2011?",
        "response": "Damian Joseph McGinty Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the star of \"Hank\" born? ",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "the drama series Most Wanted stars this American actress who was born in Los Angeles who also portrayed what character in the 1971 film The Beguiled that seduces Clint Eastwoods character? ",
        "response": "Carol",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the man who was instrumental to the 2016 Australian federal budget become Prime Minister?  ",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "The band that had the album Wrath of the Tyrant was formed in what year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "What offensive was a major part of the final Allied offensive of World War I, Meuse-Argonne Offensive or Korean War?",
        "response": "The Meuse-Argonne Offensive",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Willis second novel is about a theater troupe preparing a performance of a novella written by who?",
        "response": "John Steinbeck",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the guest starring in Time Heist born?",
        "response": "10 February 1976",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city and state is the Jerusalem District No. 5 Schoolhouse located?",
        "response": "Levittown in Nassau County, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "One what date was the battle fought, that Simon Grundel-Helmfelt is most notable for?",
        "response": "December 4, 1676",
        "source": "hotpot_qa"
    },
    {
        "query": "What parody show spoofs Hollywood, as well as Hollywood Stars like Barbara Streisand?",
        "response": "Forbidden Hollywood",
        "source": "hotpot_qa"
    },
    {
        "query": "The Uhrenmuseum Beyer is located in the heart of the city of Zürich, Switzerland, that includes Beyer Watch, and Museum of ?",
        "response": "Clock",
        "source": "hotpot_qa"
    },
    {
        "query": "New York State Route 406 (NY 406) is a state highway in Schenectady County, New York, the western terminus of the route is at an intersection with U.S. Route 20 (US 20) in which town in Schenectady County, New York?",
        "response": "Princetown",
        "source": "hotpot_qa"
    },
    {
        "query": "Nikhil Mathew won a chance to sing a song for music director Harris Jayaraj - \"Enadhuyire\" along with an Indian playback singer and the founder and CEO of a company called what?",
        "response": "Blue Elephant",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the Washington Redskins quarterback who suffered concussion during  the second 2015 preseason game play his college football ?",
        "response": "Baylor",
        "source": "hotpot_qa"
    },
    {
        "query": "Cage the Elephant consists of a lead vocalist who also plays guitar on what bonus track?",
        "response": "Cover Me Again",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of The Children's Hour  was inducted into the International Best Dressed List Hall of Fame?",
        "response": "Audrey Hepburn",
        "source": "hotpot_qa"
    },
    {
        "query": "Ken Ham is president of Answers in Genesis, which operates what evangelical and fundamentalist theme park that opened in Grant County, Kentucky, on July 7, 2016?",
        "response": "Ark Encounter",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Killers and Paul Di'Anno have in common?",
        "response": "Records",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the Battle for Castle Itter fought that is explained in a book by Stephen Harding?",
        "response": "May 5, 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did Scarlett Johansson win from starring in the 2003 film \"Girl with a Pearl Earring\"?",
        "response": "BAFTA Award",
        "source": "hotpot_qa"
    },
    {
        "query": "Thiruvalaputhur T A Kaliyamurthy is an artist that uses what type of instrument?",
        "response": "drum",
        "source": "hotpot_qa"
    },
    {
        "query": "What three time defending female champion has ranked number one in Women's Singles tennis?",
        "response": "Serena Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the chairman of HealthSouth Sports Medicine Council born? ",
        "response": "November 30, 1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the council located in the district that contains the parishes Murton, Hilton, and Brackenber?",
        "response": "Penrith",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine distributed itself through PDF format, Dr. Dobb's Journal or Washingtonian?",
        "response": "Dr. Dobb's Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "Robinson's Onion grows in Ferry County in a specific state; what is the capital of that state?",
        "response": "Olympia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was  the last emperor or last \"Son of Heaven\" of China?",
        "response": "Puyi",
        "source": "hotpot_qa"
    },
    {
        "query": "The Paul and Young Ron Show was, for a time, featured on Sun 99.5 in an island at the southernmost tip of what geographic feature?",
        "response": "Florida Keys",
        "source": "hotpot_qa"
    },
    {
        "query": "Austin S. Miller participated in which part of Operation Gothic Serpent?",
        "response": "The Battle of Mogadishu",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1970–71 DFB-Pokal was the 28th season of the annual German football cup competition, in the final Bayern Munich defeated 2–1, which German association football club based in Cologne, and was formed in 1948 as a merger of the clubs \"Kölner Ballspiel-Club 1901\" and \"SpVgg Sülz 07\"?",
        "response": "FC Köln",
        "source": "hotpot_qa"
    },
    {
        "query": "How many men fought in the battle that the 1981 play, The Accrington Pals, is based on?",
        "response": "More than 3 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an American writer responsible for a dissertation concerning  the towns and districts built near sediment formations around Lake Superior?",
        "response": "Paul Henry Landis",
        "source": "hotpot_qa"
    },
    {
        "query": "Islam Net has a local chapter in the municipality in what Norwegian county?",
        "response": "Nordland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is Cormac McCarthy?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Chocolate Salty Balls (P.S. I Love You)\" is a song from \"South Park\" performed by a character that is voiced by who?",
        "response": "Isaac Hayes",
        "source": "hotpot_qa"
    },
    {
        "query": "Herbert H. Dow founded a company headquartered in which City ?",
        "response": "Midland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who commissioned the series of 12 monuments dedicated to the spirit of pioneer women along the Ocean-to-Ocean Highway?",
        "response": "the National Society of Daughters of the American Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Lookin' After No. 1\" is the first single by The Boomtown Rats,  an Irish rock band that had a series of Irish and UK hits between what years?",
        "response": "1977 and 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrew Stahl was an actor on the CBS drama that aired during which period?",
        "response": "April 1994 to August 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the movie released in 2007 in which \"Let's Go\" song was used?",
        "response": "January 12, 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "John Austin and Mahesh Bhupathi, share which mutual former occupation?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "From which universities did the actress who plays the role of the witch Donna in \"Being Human\" graduate?",
        "response": "Harvard and Yale University",
        "source": "hotpot_qa"
    },
    {
        "query": "ich of the Wilsons, husband Dave or wife Kortney, is a country musician and television personality in Nashville, Tennessee with the singing talent and a licensed real estate professional as well?",
        "response": "Kortney Wilson",
        "source": "hotpot_qa"
    },
    {
        "query": "Spike Island lies in the Sankey Canal at which river?",
        "response": "River Mersey",
        "source": "hotpot_qa"
    },
    {
        "query": "In what way is Pierre Morel different than Harry Lachman",
        "response": "French film director and cinematographer",
        "source": "hotpot_qa"
    },
    {
        "query": "John Eaves worked on the production of Tony Scott's 1986 movie Top Gun, but which sci-fi series is he most associated with?",
        "response": "Star Trek",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the first largest telecoms company in France other than Altice, which is second in France founded by Patrick Drahi?",
        "response": "Orange",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the producer of the 2010 South Korean romantic comedy which was wrote and directed by Kim Hyun-seok and a modern take of \"Cyrano de Bergerac\"?",
        "response": "Myung Films",
        "source": "hotpot_qa"
    },
    {
        "query": "The cast of Bulldog Drummond Comes Back included an English actor who as also an amateur champion of what sport?",
        "response": "boxing",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the bands Hole and Cage9 both American alternative rock bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the stage name of the child actor who played a sidekick to a silent film comedian born Nov. 9, 1889?",
        "response": "Sunshine Sammy",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the previous name of the hotel Bill Cosby recorded his comedy album, For Adults Only, in?",
        "response": "the Las Vegas Hilton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which new intellectual property was released by developer D-Pad Studio?",
        "response": "Owlboy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie genre did both Alexandre Aja and Roy Andersson direct movies in? ",
        "response": "Alexandre Aja (born 7 August 1978) is a French film director best known for his work in various horror films.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Ubisoft's Tetris Ultimate partner based in?",
        "response": "Hawaii",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two American musicians Janet Gardner and Myles Kennedy, who is older?",
        "response": "Janet Patricia Gardner",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Christgau labled The Drifters' Golden Hits as #465 of 500 in Rolling Stone's 500 Greatest Albums of All Time; what did he label himself? ",
        "response": "Dean of American Rock Critics",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the 1970 song by the English singer, pianist and composer released?",
        "response": "The song was released as a single in Britain",
        "source": "hotpot_qa"
    },
    {
        "query": "What Mexican professional boxer in the Super Bantamweight division, was scheduled to face Manuel Roman on February 27, 2015?",
        "response": "Diego De La Hoya",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rob Zombie and Melvin Frank both American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the category of music of the singer who died in 1989 and had a single named \"Turn Me to Love\"?",
        "response": "American country music",
        "source": "hotpot_qa"
    },
    {
        "query": "What artists front his own band, The Fighting Hearts, and also co-founded the hard rock/heavy metal band The Almighty?",
        "response": "Ricky Warwick",
        "source": "hotpot_qa"
    },
    {
        "query": "Carleton School of Information Technology together with Algonquin College, offers an undergraduate academic degree that generally requires how many years of study?",
        "response": "three to five",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Eurya or Syzygium jambos types of animals?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the New Hampshire town drained by the Merrymeeting and represented by Martin C. Harty?",
        "response": "2,638",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the show that aired from 1993 to 2002 on Fox that Steven Maeda has written episodes for?",
        "response": "Chris Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "On which station could you have watched the actor from \"My Fair Lady\" play a character in \"I Can Hear Your Voice\"? ",
        "response": "SBS",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the producer of the telenovela that features songs on its soundtrack from the album Lo mejor que me pasó en la vida?",
        "response": "Angelli Nesma Medina",
        "source": "hotpot_qa"
    },
    {
        "query": " Steven Levert \"Steve\" Clarkson tutored a football quarterback drafted by what team in 2009?",
        "response": "Tampa Bay Buccaneers",
        "source": "hotpot_qa"
    },
    {
        "query": "Jasus paulensis, also commonly known as the St Paul rock lobster, is a species of spiny lobster found in the waters around Saint Paul Island in the southern Indian Ocean and around Tristan da Cunha, colloquially Tristan, is the name of both a remote group of volcanic islands in which Ocean southern region, and the main island of that group?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was in operation longer the Burwash Mine or the Hedley Mascot Mine?",
        "response": "The Hedley Mascot Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator of TFou who went on to do produce dispicable me in July of 2010?",
        "response": "Pierre Coffin",
        "source": "hotpot_qa"
    },
    {
        "query": "A Kiss of Shadows, the first novel in the Merry Gentry series, was created by an American writer born in this year?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the 2000 film for which Julia Stiles received two nominations for Teen Choice Awards?",
        "response": "Kris Isacsson",
        "source": "hotpot_qa"
    },
    {
        "query": "What rank did both Siegfried Westphal and Albert Kesselring achieve in the German armed forces during World War II?",
        "response": "general",
        "source": "hotpot_qa"
    },
    {
        "query": "What television film aired on Cartoon Network in 2006 and featured actress Eunice Cho?",
        "response": "Re-Animated",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Baotou and Siping, Jilin prefecture-level cities?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dianne Hiles is the current Australian Greens candidate for which 1968 federal proclamation? ",
        "response": "Division of Sydney",
        "source": "hotpot_qa"
    },
    {
        "query": "Samfree is a Japanese music producer that using what software to produce his music?",
        "response": "Vocaloid",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Jimmy Eat World studio album was co-produced by Mark Trombino and re-released after September 11, 2001?",
        "response": "Bleed American",
        "source": "hotpot_qa"
    },
    {
        "query": "Townsend Putnam Coleman III, is an American voice actor who performed in many animated series and TV commercials beginning in the early 1980s, he also did additional voices in Catscratch, an American animated television series created by who?",
        "response": "Doug TenNapel",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Callaghan coached which American figure skater and actress?",
        "response": "Tara Kristen Lipinski",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian corporation, founded in March, 1994, is a major tenant of the Station Mall is Sault Ste. Marie? ",
        "response": "Wal-Mart Canada Corp.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who dropped the 1998 comedy film which also inspired  Aamayum Muyalum",
        "response": "Kirk Jones",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of succulent, Hoya or Beschorneria?",
        "response": "Beschorneria",
        "source": "hotpot_qa"
    },
    {
        "query": "Which car, produced by Ferrari from 1962 to 1964 for homologation into the FIA's Group 3 Grand Touring Car category inspired the Vandenbrink GTO?",
        "response": "Ferrari 250 GTO",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Kahn has worked with what Star Search and Mickey Mouse Club singer?",
        "response": "Christina María Aguilera",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of school was named after a professor that fostered the development of alternating current that made possible the expansion of the electric power industry in the US? ",
        "response": "public 4–year high school",
        "source": "hotpot_qa"
    },
    {
        "query": "Which group features more members who play an instrument, Moonbabies or Massive Attack?",
        "response": "Moonbabies",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kenji Mizoguchi and David Wall from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which came first the let me entertain you tour or the pop group take that?",
        "response": "Take That",
        "source": "hotpot_qa"
    },
    {
        "query": "Jimmy Moody had a run-in with one of the foremost perpetrators of crime in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player is older, Olivier Rochus or Byron Black?  ",
        "response": "Byron Black",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Volvo S70 essentially modeled after and was the first all wheel drive Volvo?",
        "response": "Volvo 850",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was elected elected President of Germany in 1925 and whose death led to the referendum on merging the posts of Chancellor and President?",
        "response": "Paul von Hindenburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the movies The Castaway Cowboy and The Straight Story come out in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "During what years were the group of paintings which included \"Almond Blossom\" painted by Vincent van Gogh and made to celebrate the key player in the growth of his fame?",
        "response": "1888 and 1890",
        "source": "hotpot_qa"
    },
    {
        "query": "Express is the second studio album by English alternative rock band Love and Rockets, an English alternative rock band formed in which year, by former Bauhaus members?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": " What fictional character from Shakespeare's play, \"A Midsummer Night's Dream\"  is engaged and loved by a young Athenian man?",
        "response": "Hermia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor has starred in Hardcore as well as directed and acted in over 1,800 pornographic films?",
        "response": "Mr. Marcus",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did the wife of Marc Mezinsky  have from 2011 to 2014 ?",
        "response": "special correspondent",
        "source": "hotpot_qa"
    },
    {
        "query": "Which casino located southeast of mainland china is billed as the largest casino in the world?",
        "response": "The Venetian Macao",
        "source": "hotpot_qa"
    },
    {
        "query": "Pierre Bouvier and Marie Fredriksson are both what?",
        "response": "singer-songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Are André Gide and Ryūnosuke Akutagawa of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What English alternative rock band formed in 1980 and influenced The Numbskulls?",
        "response": "Happy Mondays",
        "source": "hotpot_qa"
    },
    {
        "query": "The revue Putting It Together was devised by Stephen Sondheim and what actress best known as Miss Marple?",
        "response": "Julia McKenzie",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the show Adventure Camp filmed at?",
        "response": "Busch Gardens Tampa",
        "source": "hotpot_qa"
    },
    {
        "query": "\"I Will Go to You Like the First Snow\" is a song recorded by a singer-songwriter signed to which record label ?",
        "response": "YMC Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a research university in Maryland, Massachusetts Institute of Technology or Johns Hopkins University?",
        "response": "Johns Hopkins University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has written three novels and several works of non-fiction about the experiences of Chinese Americans, Maxine Hong Kingston or Booth Tarkington?",
        "response": "Maxine Hong Kingston",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dewarist is a musical television series whose first season featured the rock band Parikrama, whose name means \"orbital revolutions\" in what language?",
        "response": "Sanskrit",
        "source": "hotpot_qa"
    },
    {
        "query": "Does a Pink Gin and Manhattan both contain bitters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "A Life Too Short was a biography about the goalkeeper of what nationality?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "What airline with headquarters in Shinagawa, Tokyo flies from the Nanki-Shirahama Airport to Tokyo International Airport three times a day?",
        "response": "Japan Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Palm Springs International Airport and Provo Municipal Airport both US airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The character Michael Guerin in the tv series \"Roswell\" is played by an actor that plays what role on \"The Night Shift\"?",
        "response": "Dr. Drew Alister",
        "source": "hotpot_qa"
    },
    {
        "query": "What other show did the reality television cast-member known for their role in \"The Real Housewives of New Jersey\" that was sentenced to prison appear on?",
        "response": "The Celebrity Apprentice 5",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the emperor while Prince Sanjō Sanetomi was an Imperial court noble? ",
        "response": "Emperor Meiji",
        "source": "hotpot_qa"
    },
    {
        "query": "Rock'n Rollers were shell shaped crisps made by a British company that has been a wholly owned subsidiary of what company since 2006?",
        "response": "Tayto",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more female musicians, Sahara Hotnights or Social Distortion? ",
        "response": "Sahara Hotnights",
        "source": "hotpot_qa"
    },
    {
        "query": "Confrontation Camp is an American rap rock group consisting of many members, including which American DJ and turntablist?",
        "response": "DJ Lord",
        "source": "hotpot_qa"
    },
    {
        "query": "For what role is the actress, who starred in the film The Things My Father Never Taught Me with  Burleigh Smith and Aiden Papamihail, best known ? ",
        "response": "Tess Silverman McLeod",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Finest Worksong\" is the third and final single, released from American alternative rock band R.E.M., and its fifth studio album, released on September 1, 1987?",
        "response": "Document",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Barks is best known for his comics about the cartoon character created in what year?",
        "response": "1934",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the author of Fish Cheeks born?",
        "response": "February 19, 1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Monroe Regional Airport and Walla Walla Regional Airport are both considered to be?",
        "response": "public airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more campuses, including satellites, Georgia Institute of Technology or University of Missouri System?",
        "response": "Georgia Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the thesis supervisor of Jocelyn Bell Burnell awarded the Eddington Medal?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "What apartheid system opponent is the father of screenwriter Shawn Slovo?",
        "response": "Joe Slovo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the character's name that Alistair Brammer and Hugh Jackman have both played in Les Miserables?",
        "response": "Jean Prouvaire",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the executive producer of Mannix born?",
        "response": "1930",
        "source": "hotpot_qa"
    },
    {
        "query": "On March 11, 2013 what did an artists' community located on a 400 acre estate in Saratoga Springs become designated as, who had a guest that is a playwright born in Roanoke, Virginia who began writing in elementary school, and graduated from New York University Tisch School of the Arts Undergraduate Film Program and Graduate Dramatic Writing Program? ",
        "response": "National Historic Landmark",
        "source": "hotpot_qa"
    },
    {
        "query": "Which former president of the Fédération Internationale de l'Automobile (FIA) cofounded Simtek Research?",
        "response": "Max Rufus Mosley",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach who succeeded Dave Smith as coach of the Southern Methodist University's football team was born in which year ?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a commander that was a prominent politician in Nazi Germany?",
        "response": "Rudolf Hess",
        "source": "hotpot_qa"
    },
    {
        "query": "Ultimate Zone Rating (UZR) is which type of empirical analysis of baseball, especially baseball statistics that measure in-game activity, statistic used to measure fielding?",
        "response": "Sabermetrics",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Indonesian singer Indah Dewi Pertiwi sell in KFC outlets throughout the country, making it the fifth best seller in history?",
        "response": "her first album",
        "source": "hotpot_qa"
    },
    {
        "query": "Were George Melford and Giuseppe Tornatore both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the man who wrote the music for A Chorus Line?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which vocalist has worked under more band names, Jus Oborn or James Dewar?",
        "response": "James Dewar",
        "source": "hotpot_qa"
    }
]