[
    {
        "query": "What happens to water in between boiling and steam?",
        "response": "If you give water at 100 C more energy then you turn some of it to steam. The water molecules need energy to escape the liquid, you increase the potential energy in the system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If electric cars take the place of regular cars, won't the production and disposing of the batteries be an even bigger strain on the environment?",
        "response": "Even if you count the environmental costs of producing and disposing of the battery, electric cars are [still less harmful to the environment than normal cars](_URL_0_). This is because the majority of any car's environmental impact is inflicted in operations, not manufacturing, and the efficiency gains from electrification more than offsets the added impact of the battery.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the Marshall Plan due to American generosity?",
        "response": "I don't think so. I think there were two major factors. The first was the need to stop the flow of communism by making the economies and general power structure of European countries stable. However, I think the second, and possibly more important, factor was that the Americans weren't being generous at all. They knew that this was a great deal for them. They were loaning out money to countries and the money came right back to us. The industrial powers of the world were devastated by WWII. Really, the US was the only one left standing. Europeans were dependent on the US for food, industrial goods, and even the means to begin producing again. This is one of the major causes of the post-war boom in US production and wealth. However, these countries could only afford to do this if they had the money and economy to do so. Basically we were funding a stimulus bill of sorts based on international trade. edit: grammar",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why the US seems to be more Christian than the UK.....?",
        "response": "America had a big propaganda push against the communists. Many communists believe that religion is a tool for oppressing the workers so the US said the opposite, that being Christian is almost a requirement for being a patriotic american. It was in this period that \"In god we trust\" was put on the dollar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is overclocking and how does it help/hurt your computer?",
        "response": "Simple answer: Computers do everything one step at a time and are set to do a certain number of steps per second. The steps per second a computer does is usually written as Gigahertz (GHz), with 1 GHz equal to 1,000,000,000 steps per second. Now overclocking is telling the computer to do more steps per second. That means it gets things done faster, but it also uses more energy and makes it hotter (just like if you try to walk faster).  If you try to force it to go too fast then sometimes the power supply can't give it enough electricity, or it gets too hot, and it crashes. Running a computer hotter for long periods of time can make it wear out faster too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What if a supervolcano erupted sometime in the next ten years?",
        "response": "To expand on this. If any of the Science guys on here have seen [this](_URL_8_) documentary - how accurate a portrayal of a Yellowstone eruption is this? Seems fairly terrifying!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Bob Marley is a cultural icon",
        "response": "He was the the first world-wide superstar to come from a \"developing\" nation, for one thing. That was a big deal to a lot of people. He was the first huge reggae star that most white people heard of.  Just... go listen to \"Three Little Birds.\" Every little t'ing gonna be alright.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the different \"numbered\" circuit courts, or circuit courts-of-appeal in the American judicial system?",
        "response": "They are the appellate courts of the US federal court system. There are 11 \"numbered\" circuits and the District of Columbia Circuit that each have a defined geographical region under their authority. For example, the Seventh Circuit based in Chicago has authority over the US District Courts in Illinois, Indiana, and Wisconsin. There is also the US Federal Circuit Court of Appeals which has authority over the various extra-territorial federal courts and tribunals like the Court of International Trade and the Patent Trial and Appeal Board.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there so much pseudoscience associated with modern veganism?",
        "response": "Pick any diet and find a proponent of it. Ask them to justify it.  You will hear so much nonsense it'll be amazing. Dietary science is difficult. We are at the point where any effects are tiny and take years. There are a few things we know: too much fat is bad, fruits and vegetables good, process sugar bad.  Almost every effect after that is pushing at the margins, and at the margins is where pseudoscience lives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we still have traffic lights based on timers/relays instead of smart lights that account for traffic density, time of day, weather, etc?",
        "response": "[We already have the technology](_URL_0_) - in fact, they are very common in bigger roads. Whether it is implemented at a given intersection depends on whether your governing agency thinks it is worth the cost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did trees not \"take over\" the prairies like they did the rest of Canada?",
        "response": "The current reason for the lack of trees in the southern \"Prairie\" provinces is that most land is under cultivation.  However, the reality is that several species of trees can grow quite well without irrigation even in the Palliser Triangle which is one of the more severe prairie environments. This has been demonstrated by a number of forestry test plots (the one that pops to mind is near Caron, SK). Historically, though (and here I can't provide you with a reference), the fire cycle didn't permit forests from being established in the area since it is semi-arid (as noted in A_1337's response). So, I think it is important to note rainfall is sufficient to establish forests but other environmental factors (high wind, lack of natural fire breaks, high temperature in summer) contribute to a fire cycle frequency which favours grassland ecology over forest ecology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is a ninja and what was it like being one in medieval Japan?",
        "response": "In the FAQ there is this excellent answer by /u/AsiaExpert on ninjas in general _URL_3_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does electricity seek the ground?",
        "response": "Ready for it to get even more confusing? Well the current flow, IE positive potential (IE greater than 0 volts) to ground potential (0 volts potential), is actually opposite the flow of electrons. The ground is the source of the electrons and the higher potential draws them. You can thank Ben Franklin for that bit of confusion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is this statement true? \"as we emit more and more carbon dioxide into our atmosphere, each increment results in less and less warming.\"",
        "response": "Yes, this is true. If you look at the two formulae in [Wikipedia's entry on radiative forcing](_URL_0_), you'll see that temperature change varies linearly with radiative forcing, and radiative forcing for carbon dioxide varies logarithmically. That is why climate scientists often speak of change in equilibrium temperature per **doubling** of CO2. Each doubling increases the equilibrium temperature arithmatically.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Australians have the highest per capita CO2 emissions?",
        "response": "* First-world lifestyle - cars, air conditioning, heating, the lot.  * CO2 heavy energy production. Most of the energy comes from coal plants. No nuclear (unlike US), negligible renewables. Solar is starting to become more popular, but hasn't quite gone big yet.  * Low density. Huge transporting distances between cities. Cities themselves tend to be lower density than European cities - favouring roads and cars over public transport or walking / cycling / other.  That's probably the main factors I would imagine. No source on anything so take it with a grain of salt - I'm sure others have better information / experience.  Source - am Australian, some environmental science experience.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do scientists know the earths tilt changes every 41,000 years?",
        "response": "It was predicted in the 19th century and [was actually measured in '76](_URL_0_) As to why this happens: The Earth's orbit is an ellipse. The **eccentricity** is a measure of the departure of this ellipse from circularity. The shape of the Earth's orbit varies in time between nearly circular (low eccentricity of 0.005) and mildly elliptical (high eccentricity of 0.058) with the mean eccentricity of 0.028. If the Earth were the only planet orbiting our Sun, the eccentricity of its orbit would not perceptibly vary even over a period of a million years. The Earth's eccentricity varies primarily due to interactions with the gravitational fields of Jupiter and Saturn. The inclination of Earth's orbit drifts up and down relative to its present orbit periodically due to these gravitational fields. One of the effects of these cycles is the tilt of the axis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ask Anything Wednesday - Economics, Political Science, Linguistics, Anthropology",
        "response": "Linguistics question, is there a word, phrase, or logical fallacy that describes this situation: Person Y and Person Z are debating online. Y holds a position on a topic that Z disagrees with. Z searches online and actively looks for someone saying something incredibly stupid/insensitive/deplorable who supports Y's argument. Z uses his results from some rando's twitter or facebook to prove they are correct or to attempt to shame Y into agreement along the lines of \"See this stupid person saying this stupid thing in regards to our topic of debate? You aren't stupid like them are you?\". I see this playing out online everyday and it's incredibly aggravating as there is no lack of people saying stupid things online for any side of any topic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When i jump in a moving bus or another long vehicle, why do i not move backwards?",
        "response": "you are part of the system of the bus. you are moving at 40mph too. if the doors and windows are closed, there's nothing to change your velocity. now if you were in a convertible with its top down moving at 40mph and jumped up, the air, which is not moving at 40mph in the same direction, will hit you and reduce your velocity and you will likely fall out of the back of the car.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could animals other than humans get down syndrome?",
        "response": "Trisomy in animals is relatively common but usually fatal. Downs syndrome is notable for being one of the few survivable trisomy disorders that (sometimes) doesn't cause the mother's body to auto-abort. Botany is a rare exception where extra chromosomes can be desirable (to humans, not to plant survival). People must then care for and propagate the otherwise-sterile plants; plants with three(or more) sets of chromosomes are how we get seedless watermelons, grapes, and bananas. Credit: ZombieHoratioAlger",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a point is translated a unit either up, down, left, or right, determined randomly, in a two dimensional cartesian plane every second for an infinite amount of seconds, what position would it approach as the amount of seconds approaches infinity?",
        "response": "The average displacement of a 2D random walk is zero, but the root-mean-square displacement is proportional to the square root of the number of steps. This lets you define a \"radius of gyration\" which tells you the average size of a random walk.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has the quantum entanglement phenomenon \"Spooky Action at a Distance\" been proven, or is it just theoretical? Also, how do particles become entangled in the first place?",
        "response": "Entanglement isn't some super esoteric aspect of quantum mechanics that is only relevant in physics labs, it's a basic feature of quantum mechanics. And quantum mechanics is the basis of most technology of the digital age. Thus it shows up when we look at, for example: -how atoms come together to form bonds to make complex molecules and chemicals, to design materials and medicines, etc. -how electrons flow through a semiconductor channel in a transistor, the basic unit of the computer you're typing on right now -an inextricably part of any other quantum device: a laser (like that in your DVD player or PS4), a solar panel, an MRI machine, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between a photon emitted by something like the sun and a photon that mediates electromagnetic interaction such as electrons repelling?",
        "response": "A photon emitted by the sun is an actual thing you could collect and put in a box etc., the photons which mediate scattering of charged particles are *virtual* photons which means they are more like a mathematical trick. What 'really' happens is that the two charged particles polarize the EM field near them, and they react to the polarization caused by the other charged particle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't more larger animals have stingers like hornets or scorpions do?",
        "response": "Stingers are evolved from ovipositors, which are generally only useful in smaller creatures - once the egg gets to a certain size, it becomes impractical to extrude them like that. And without that underlying structure, larger creatures have no base from which to evolve stingers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the point of money laundering. How does it work?",
        "response": "Say you are a bully and you steal money. Well everyday you Mom (the government) checks your pockets, if they discover you have some money they will ask where you got it from and find out about you being a bully.  So instead, you keep on bullying people, but you also set up a fake lemonade stand. That way when your Mom discovers your money, you can say you got it from selling lemonade and the bullying is never discovered.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the Japanese economy after the bombings of Hiroshima and Nagasaki?",
        "response": "It improved. I know that sounds strange, but the Japanese economy had been shoveling treasure into the maw of War for years.  The *end* of the War, as signified here by the two nuclear bombs, meant that whatever monies were left could be invested in rebuilding the country, instead of literally being sunk by American ships and planes. In effect, there was no place for the Japanese economy to go but up. Having hundreds of millions of US dollars poured into rebuilding Japan sure didn't hurt, either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know/estimate the colour of dinosaur feathers/scales/skin without any real images of them?",
        "response": "As an illustrator (which I believe is what you mean by graphic designer, completely different fields but anyway) I can say that many depictions of dinosaurs use educated guesses based on life that exists today. Most would probably have camouflage of sorts, and typically earthy/green tones would get the job done, since leaves were still green and the earth was still brown, rocks were grey, you get the point. Other more brightly colored dinosaur depictions are probably inspired by colors found in current day birds and how color aids mating rituals. Is it possible that dinosaurs were turquoise? Perhaps, but the most believable color palette is generally the colors found in current day life, which have evolved from prehistoric times by aiding in survival and procreation, so that's what many artists tend to go with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it just a coincidence that both spiders and octopi have 8 legs? Or do they share a common ancestor?",
        "response": "They don't have a common ancestor that also has 8 legs. Spiders are arthropods and octopi are a late brance of molluscs. Basically that means that the common ancestor of arthropods (which also includes crabs for example) and molluscs (also including slugs and bivalves) split way before spiders and octopi (order level) even existed. There were many species in between who do not had 8 legs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are blue eyes more sensitive to sunlight than brown eyes?",
        "response": "Summary: Eye pigmentation is a layer to protect you from light. When eyes have no pigmentation, they are blue, and thus also more sensitive to light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the state of Germany democracy before World War One?",
        "response": "Hi, not to discourage further discussion of this topic but you might find [this thread](_URL_0_) useful, where I and u/kieslowskifan discuss a similar question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do computers interperet infinity?",
        "response": "It's just a special bit pattern. The designers of IEEE 754 (the floating point math standard) just picked two patterns to represent + and - infinity. When you do any calculations with floating point numbers, the CPU will check if one of the numbers matches one of these special patterns and act according to the rules of IEEE 754 (so that it knows not to just blindly add the two numbers together, for example).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the primary arguments *FOR* Affordable Care Act (Obamacare)?",
        "response": "[I think this comic pretty much sums it up](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "American Football Overtime Rules",
        "response": "> whoever wins the coin toss has an enormous advantage YES. This is a constant debate in the NFL. Rules were changed recently that if the first team to score only gets a field goal, then the other team gets the ball and can try to score, but if the first team scores a TD its over. Its controversial, but that's the game and that is just the rules. Previously, first score, even a field goal, and the games was over and done. The team who got the ball first was overwhelmingly the most likely to win. OT in the NFL is designed to reasonably and quickly end the game, not to be \"fair\". college football operates a very different and much more \"fair\" rules, but even that is quite controversial.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do eggs spoil if you freeze them?",
        "response": "I don't see a reason why you wouldn't be able to freeze a raw egg. The only thing you should consider is cracking them before freezing, since the liquids inside are going to expand and break the shell when being frozen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the Vietnam War necessary?",
        "response": "This is quite a loaded question. Perhaps I could help you rephrase it. :) What is it that you'd like to know? For example, your original question is whether or not the Vietnam War is necessary. How would you define a necessary war? Is there such a thing? Is any war necessary?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much does the toothpaste you use really affect your dental hygiene?",
        "response": "Fluoride ions in toothpaste and drinking water intercalate into the enamel that covers the outside of the tooth increasing resistance to decay and acidic erosion. Also, triclosan, a bactericidal agent, is added to some brands to inhibit plaque formation and gingivitis. It also combats bad breath due to bacterial growth. These claims must be supported by extensive clinical evidence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does squinting your eyes work? Specifically when you are looking at something and without closing your eyelids, blur your vision?",
        "response": "This question ask been asked and [answered](_URL_0_/comments/3a6dqa/why_does_squinting_make_my_vision_clearer/) many times before. I'm linking to an [askscience](_URL_0_) answer here since it's good and quite simple, but there have been many other answers in eli5 too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do companies determine barcodes for their products to make sure they are not identical to another product sold at a large retail store?",
        "response": "There is a UPC governing organization called GS1 which assigns ranges to companies (for a fee)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If computer files can be compressed to be a smaller file size (e.g. zipping a file up), how come the file is not originally created to be a smaller file size?",
        "response": "The same reason your clothes could fit vaccuum sealed into a few small moving boxes, but typically we have them hung loose in the closet. They are easier to manipulate, use, and put back away, and you find paying for more closet space a fair trade off to the time and energy of vacuum packing and unpacking your clothes each morning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the US just go to Sheremetyevo Airport and get Snowden themselves?",
        "response": "Because they have no authority to make arrests on Russian territory. And the entire airport is Russian territory. All that stuff about a transit zone being something other than fully a part of Russia is just a diplomatic convenience. It has no real basis in law or custom. Believe me, if a wanted Russian criminal ended up trying to hide in the transit zone at Sheremetyevo, they'd simply go in and arrest him, regardless of which passport he was under. However, only Russia can do this at that airport. In other words, if the US proceeded to arrest Snowden in Moscow, it would be a diplomatic firestorm far beyond anything else we've seen in this whole sorry mess.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do my eyes have a frame rate?",
        "response": "The choppyness you see is your eve moving in discrete steps. Your eye can move continuously when tracking an object, but generally moves in steps other times. Your eye does have limits on how fast it can process information, nerves can't fire constantly, but it's pretty high. Your eyes also average what you see over time, unlike a computer which presents a brand new image every frame.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who exactly were the \"Black Dutch\"?",
        "response": "In my part of the U.S. (Oklahoma) it means your ancestors were mixed Native American. I have no Dutch ancestors at all. Basically to avoid the stigma of being Indian in the late 1800s/early 1900s they said they were \"Black Dutch\" instead.  The story was that they were Dutch but from a family that was the offspring of a Spanish and Dutch person from a Spanish-Dutch war I can't think of. Source: I'm 1/5th Black Dutch!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there so much backlash against Iggy Azalea in the hip-hop community, but not against other white rappers?",
        "response": "Because she doesn't make good music, and she's made it to the mainstream music's Eye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have so many national fast food and casual dining chains but no national super fancy restaurant chains?",
        "response": "The franchise model doesn't really work all that well for fine dining. A good restaurant uses fresh ingredients and constantly experiments with new dishes and new ways to make old dishes.  The whole idea behind franchise restaurants is consistency. An Olive Garden in Miami is exactly the same as an Olive Garden in Seattle. Customers always know what they're getting. That doesn't leave room for using fresh ingredients or creative cooking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I have a blanket that's fuzzy on one side and slick on the other side. When I lay under it fuzzy-side down, is it really keeping me warmer, or is it just my imagination?",
        "response": "An important aspect to heating and insulation is 'dead air' which is trapped air. Air is a pretty good insulator and will trap heat effectively as long as it cannot move around. Comforter blankets are puffy for this very reason. While I can't say anything specific about your blanket, the fuzzy side might on average sit higher above your body allowing more air to act as insulator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't there been more advancement in wireless energy if it was pioneered almost 100 years ago by Tesla?",
        "response": "The [inverse-square law](_URL_0_) is to blame. The power of any electromagnetic field drops off as the square of the distance. So wireless power transfer is inherently **very** inefficient, just because of the physics involved. That said, there have been some interesting developments utilizing resonance that make power transfer somewhat feasible over short distances. But we're talking about inches, maybe a few feet, before the energy loss is large enough to make the whole thing essentially worthless. Transmission over large distances would have to be done using something like a microwave laser. And then you run into the safety problems inherent in having an invisible, high-power laser shooting over long distances. In short, physics is getting in the way, and there's very little that we can do about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Basic Income would work. In the context of an ever automated world.",
        "response": "In an ever automated world, the cost for stuff should go down! Food/medicine/entertainment/housing would be so inexpensive that we could tax workers less while still providing assistance for more people!  This is an eventual ideal. Between now and then there will be a lot of growing pains and shortage of service.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does hydrogen peroxide foam up like shaving cream on a wound, but doesn't react with the unbroken skin?",
        "response": "[Catalase](_URL_0_) is one of the most efficient enzymes known to man, and it decomposes hydrogen peroxide to water and oxygen. Besides this, hydrogen peroxide is a fairly strong oxidizing agent, thus it can oxidize molecules in your wound and decomposing to water and oxygen in the process. Some metals can catalyze this decomposition as well. Hydrogen peroxide is not recommended on wounds because it can cause oxidative damage to your cells as well, so it may slow healing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is a penis transplant possible?",
        "response": "I'm not an expert at all but I found a little info with a quick google search. One has apparently been successfully attempted. The penis was functional as far as urination ~~and sensation~~, but there was no indication of whether or not he could use it sexually. The patient opted to have it removed 15 days later due to psychological trauma. I can't find a whole lot more about it. [Wikipedia article with links to relevent sources](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water expand when it freezes if molecules contract when they get colder/slower?",
        "response": "The molecules don't contract, it has to do with the ordered arrangement of the water molecules when water freezes that takes up a larger volume than when it is in its liquid phase.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sodium Fluoride replenishing phosphorus and calcium in teeth.",
        "response": "It doesn't. The fluoride replaces the calcium, replacing hydroxyapatite (the hard calcium- containing mineral that makes up most of your enamel) with fluorapatite. This is actually a good thing - fluorapatite is much harder than hydroxyapatite, and resists corrosion from acids better. That *does* help protect the calcium you still have left, though. You're not replenishing your calcium, you're replenishing your enamel.  Importantly, this only works as the hydroxyapatite is breaking down. The component chemicals have to be present to reform into enamel, which is why once your enamel is gone, it stays gone. It's a bit like fixing a hole in a brick wall with new, stronger brick, but you didn't bring your own cement so you can only use the cement that's there and when that's gone the hole can't be patched.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we connect a pipe from ocean to a desert and keep pumping sea waters into desert, would it become forest?",
        "response": "The salt gets in the way. However, the surrounding mountains and hills might get enough new precipitation from the evaporation to green up and maybe even be forested. If the surrounding mountains are high enough you could even get freshwater streams running back to the salt lake. For more on this sort of effect, check how tropical islands with hills/mountains create their own rain on the leeward side. Edit: read Thor Heyerdahl's first book about living on a Pacific Island.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When examining one mole samples of different gases under conditions of constant pressure, volume and temperature, do the particles in denser gases tend to slow down in their movement?",
        "response": "The average speed of a particle in an ideal gas is proportional to sqrt(T/m), so at a given temperature, heavier molecules move slower, on average.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Two of my cats are mother and child. They are both adults and interact with each other in the same way that my other cats do. Are they still aware of their maternal bond?",
        "response": "In short - we can't know for sure. We can extrapolate animals' knowledge or awareness of kinship bonds by things like preferential 'kin selection' but it seems like this is easier to ascertain in more strictly social animals.  As for the whole inbreeding thing - if these were wild cats a young male would disperse and *that's* how incest could be averted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is it about spoiled food that makes people get sick?",
        "response": "BACTERIA. Spoiled means bacteria has been able to rule the food, and the food has begun to decay.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come water from the same source feels colder when you wash your hands than when you drink it?",
        "response": "Your mouth is slightly warmer and covered in warm saliva so it warms the water up almost immediately. If you were to put an ice cube in your mouth see how fast in melts as oppose to holding it in your hand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the reason we just don't have rover on all of the planets, besides money?",
        "response": "Besides money there is the problem of having a rover than can survive the more extreme conditions on other planets. The Moon and Mars are pretty tame compared to Venus, Mercury or Jupiter. The distances, as well as the environmental conditions, make control and communications a much bigger problem. Look at the recent problems they had with the Philae lander on a nearby comet. The extra distance to these planets (other than Venus) also presents extra problems with fuel and power while it travels there. A more durable lander/rover would be even more difficult to send. Money and a desire to know can, eventually, overcome a lot of these problems, but they might reach a point where we have better things to spend our money on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are the E-Cat (Rossi/MFMP) and LENR (NASA) cold fusion experiments actually causing fusion at room temperature?",
        "response": "Fusion requires conditions, that are not possible in such low temperatures. Whatever this so called LENR phenomenon is, (if anything) it is NOT fusion. I am sure there are people who are honest in LENR research, but Andrea Rossi's E-cat is obvious scam.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know what our galaxy looks like?",
        "response": "The picture you are linking to is of the majestic Andromeda galaxy, one of our galactic neighbors and the largest of our neighbors.  [This](_URL_3_) is the milky way as seen from within (the only way we can see it). We can see that we live in the same type of galaxy as Andromeda, a flat spinning disc made of billions of stars with a dense stellar bulge in the center (a spiral galaxy). We are clearly not an irregular galaxy like the [Large](_URL_2_) or [Small](_URL_1_) Magellanic Clouds... We're clearly not a [feature less elliptical galaxy](_URL_0_) like the one in the center this picture either either. We are clearly a spiral galaxy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do parking garages keep track of how many days your vehicle has been there?",
        "response": "Most places will make pay the max daily price if you lose your ticket. I guess it could be cheaper to do that if you left your car there for a week.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "can you actually die of old age?",
        "response": "When people get old their bodies break down, resulting in things like organ failure or dementia. This is what people usually refer to as death from old age. No, your body doesn't suddenly decide that it's been around long enough.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "David Deutsch describes a hypothetical hotel in his book \"The Beginning of Infinity\". It has a waste removal system that causes waste to disappear from the universe into a singularity in two minutes. Why does this work and why two minutes?",
        "response": "This is a form of [Zeno's Paradox](_URL_1_). Mathematically, it's the summation of 1/(2^n), from n = 0 to infinity.   So 1 (minute) + 1/2 + 1/4 + 1/8 + ... + 1/(2^n) ... which sums to 2. There's a [proof available here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do non-bipedal animals keep from choking?",
        "response": "this is because humans have their larynx placed above the split between air and food tubes (technical terms ofc.) without the split humans wouldn't be able to speak but that unfortunately leads to increased ability to choke not found in other animals",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do oranges and vitamin C actually help agaisnt colds or is this just one of those wide spread missinformations?",
        "response": "If you are not vitamin deficient, having an excess doesn't really help. Taking lots of vitamin C to make sure you aren't deficient doesn't hurt though, since the immune system really does need it. It's just not really important for people who are wealthy enough to access modern nutritional standards. It was probably more important in (recentish) past when quality of nutrition was less stable or in areas not wealthy enough to have the kind of nutrition we get in richer countries.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do barcodes show whether or not an item has been purchased?",
        "response": "Barcodes are just a number that is easy to scan into a computer. The computer says weather or not the item corresponding to that number has been purchased.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Just had a contrast CT scan on my abdomen, how radioactive am I?",
        "response": "You aren't radioactive. In other imaging modalities like PET or SPECT, a radioactive tracer is injected into the body. In contrast-enhanced CT, an iodine solution (or something similar) is injected into your body. The iodine absorbs much more x-rays than tissue, so it highlights the regions of the body that the iodine travels. But the iodine itself is inert/non-radioactive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My friend says the tides are higher on a full moon. Is he correct? If so, why?",
        "response": "The tides are strongest on a full moon *and* a new moon. This is because of how the moon lines up with the sun - the sun itself creates tides, too, and during those phases the sun and moon's tides line up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there any attempts to revive Carthage as a city and or a culture?",
        "response": "What time period are you referring to? Just to clarify, the destruction of Carthage in 146 B.C. did not really spell the end of Carthaginian civilization; most of the other Phoenician/Punic cities survived, while the Numidian kings seem to have adopted Carthaginian administrative, economic, and religious institutions among other things. The Romans themselves eventually built another Carthage in the first century B.C., and it stood until the Umayyads razed it in 698 A.D. As late as the fifth century A.D., as we know from Saint Augustine, many North Africans continued to speak Punic and identify themselves as Canaanites. I am otherwise unaware of any more recent attempts to culturally \"revive\" Carthage. According to Wikipedia, the area is now a suburb of Tunis. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people get knocked unconscious if they are hit hard enough in the head?",
        "response": "If you mean the immediate why, a blow to the carotid sinus nerves can cause an immediate drop in blood pressure that makes you faint. If you mean the teleological why, what benefit comes from it that evolution selected for this trait, we can only hypothesize: - If you're attacked by a predator / dangerous herbivore, appearing to die may cause the animal to lose interest before doing fatal damage. - If you are relaxed in a physical situation beyond your control, like a rockslide or something, it's less likely you'll go into shock and suffer certain musculoskeletal injuries. - If you're doing something dangerous that may cause brain trauma, a hard reset will prevent you from continuing the stupid thing and possibly convince you to change course of action when you wake up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why haven't the large space rocks in the Asteroid Belt and Kuiper belt coalesced to form large planets due to their gravity?",
        "response": "they're tiny.  and far away.  the total mass of the asteroid belt is like 5% of our moon.  and they're spread out over a much MUCH bigger area.   our asteroid belt is not like the asteroid field in Empire Strikes Back.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are bills lumped together instead of voted on individually.",
        "response": "Because of compromise. I might not be crazy about the tax cut you are proposing. I don't absolutely hate it, but on its own merit, I'd vote no. At the same time, you feel the exact same away about my education bill. But if they are in the same bill, we both get what we really want, with out having to give away too much. The combined bill is stronger than the sum of its parts. Now multiply that by everyone in congress, and you have a lot of extra junk in the bills.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The significance of Jimmy Hoffa and why they are still trying to find his remains.",
        "response": "I have read books and watched all interviews with Richard \"the Ice Man\" Kuklinski. The most notorious mafia hitman of all time. He said in plain english that Jimmy Hoffa was killed days after he went missing and he was put into a barrel and shipped to a junk yard to be crushed, melted down and recycled. I have no reason to doubt him.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is an alloy a compound or a mixture? If it is a mixture, can compounds made of two or more different metals exist?",
        "response": "The Oxford Dictionary of Chemistry defines an [alloy] (_URL_0_) A material consisting of two or more metals (e.g. brass is an alloy of copper and zinc) or a metal and a nonmetal (e.g. steel is an alloy of iron and carbon, sometimes with other metals included). Alloys may be compounds, solid solutions, or mixtures of the components. So the answer to your question is \"yes\" :) Or more accurately: it depends on the alloy in question. You may also be interested in the definition of a [solid solution](_URL_1_) A mixture of elements at the atomic level. Metals used in dentistry which readily form solid solutions with gold are copper, platinum, palladium, and silver. Steel is an example of a solid solution of a small amount of carbon in iron.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Suppose I filled an indestructible container completely with water, then proceeded to increase the temperature through hundreds, thousands and millions of degrees C, what would happen to the water?",
        "response": "it would become superheated water - water that has reached its boiling point but is under too much pressure to vaporize. this is what happens in a pressure cooker.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does alcohol burn as it goes down your throat?",
        "response": "What sort of five year old asks this question?!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How deep would subterranean lunar buildings need to be for sufficient protection from temperature swings, radiation, and meteor strikes?",
        "response": "The depth to be protected from temperature swings depends on the amount of insulation on the building and the heating/cooling capabilities of the HVAC system. If the building is heavily insulated and had powerful heaters and quick cooling, it wouldn't need to be deep at all. If the building had zero insulation, it would have to be very deep. (If you want a number for this case, it can be calculated using the heat transfer coefficient of lunar regolith.) For radiation protection, [it has been shown](_URL_0_) that about [15 to 20 cm of lunar regolith](_URL_1_) is enough to reduce the radiation doses to 22 rem/yr for skin dose equivalent, and 16 rem/yr for organ dose equivalent. Meteor strikes are an infrequent occurrence on the moon, at least on the large scale. (Micrometeorites are constantly bombarding the surface, but this is basically very high-energy dust.) Here, again, a centimeter or two would provide adequate protection for everything except major events. Edit: spellang",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do you, as scientists, consider psychology a valid science?",
        "response": "Psychology is absolutely a science, although the field is somewhat divided. There are some less than scientific ideas and methods however, but they are increasingly becoming more peripheral.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Privatisation of the British railway system, the pros and cons.",
        "response": "The tax pay (in theory) wouldn't fund rail fairs only those who use the railway this hasn't happened.  In theory it would lower prices and create copetiton, this hasn't happend mostly due to franchising the line. If I'm to go form Edinburgh to London I will be on Virgin. If I'm to go from Llanelli to Caerdydd I will be on Ariva.  It was claimed we'd have better trains, we don't. The North-Western English Franchise uses a bus on rails built in the 1980s. Only one other country ever bought this shite, Iran. All of the Iranian owned ones are now rusting away in an Iranian desert.   While national rail won't be the answer I see nothing that counters a nation rail argument with the current form of privatisation.   I'm in favour of the rails being nationalised however so I am biased.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would be a scientifically valid proof for god?",
        "response": "A definition of god would be a start.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given how secretive life in the mafia is and always has been, how do movies (mainly Scorcese films) depict life in the mob so accurately?",
        "response": "What information do you have that leads you to believe that their depictions are accurate, and not merely full of fictional details?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why a critically acclaimed show like Rick and Morty can seemingly be on the chopping block?",
        "response": "Viewership doesn’t mean a show is financially solvent. Just a quick check on Wikipedia showed the season three finale had 2.6 million viewers (compared to say South Park who’s last season ended with .97 million viewers).  The difference lies in which advertisers want their ads running on. I won’t pretend to know what the R & M revenue stream looks like, but if a show is on the chopping block is like 90% advertisers avoiding it. (A made up percentage but money talks and bullshit walks)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the minimum deceleration space to survive a free fall?",
        "response": "I'm not sure if these values are correct, but I'm going to try to give you an answer. Let's suppose that we don't want the faller to be exposed to more than [10 G = 98 m/s^2](_URL_0_). [Human terminal velocity is 56 m/s](_URL_2_). Then v_f^2 = v_0^2 + 2ad  0=(56 m/s)^2 + 2 (98 m/s^2 ) (x) [Solving for x](_URL_1_), we get a value of -16 m. The negative comes from us falling and may be dropped. So let's review our assumptions: We assumed that 10 G's is lethal. I'm really not sure of the actual cutoff, but I believe it's close to there. The value that Wolfram|Alpha gave for human terminal velocity applies to a \"typical case\" and won't cover unusual situations (unusual attire or body positioning). And we used Newtonian physics instead of something more modern, but I hardly think we need something modern here. EDIT: Fix the final \"solve for x\" to not round intermediate values. EDIT2: Use Wolfram|Alpha to compute terminal velocity",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did maths 'look like' in Newtons day? Was it very similar to what we have today?",
        "response": "Well, here is an [online version of a English translation](_URL_0_) or Newton's own *Principia*. Pick a page pretty much at random and you will see a lot more words (originally in Latin), a lot more geometrical figures and lot fewer symbols than you would see in a modern text on mechanics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a person does not get enough protein, can carbohydrates be used to repair and rebuild tissue?",
        "response": "No. We can synthesize 12 out of 22 amino acids, but the other 10 must come from our food. Serious protein deficiency leads to some pretty awful malnutrition - [marasmus](_URL_0_) and [kwashiorkor](_URL_1_) are the best understood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how come that globally hated world leaders dont get shot when they fly out and go meet other world leaders?",
        "response": "Because most people are civilized and don't want to go around killing people they don't agree with. Also, they travel with sophisticated security teams.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does blunting a nail prevent from splitting wood?",
        "response": "A sharp nail seperate a the fibers, pushing between them like the pages of a book. A blunt nail displaces the wood, sort of drilling it's own hole. Square nails do the same thing, and are used for applications that need a stronger hold, since they get friction on all sides, instead of just two.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have nightmares? Do they serve any purpose?",
        "response": "I may not be the most qualified person to answer the question, but I remember reading that they do in fact serve a purpose. IIRC (according to what I read, or so what the author's theory) nightmares prepare your brain to encounter dangerous situation. If a primitive man has a dream about being chased by a bear, he may be more able, more prepared to outrun a bear, or otherwise get away in real life. Your brain is able to process information you gather while conscious without your knowing it. Nightmares in the current world are slightly different, but serve the same purpose. If I have a dream that I forgot my homework, or am giving a presentation in my underwear, the dream serves the same purpose: hopefully if that happens in real life, my brain will be more able to respond in my waking life. I will try to find the article I was talking about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Nazi Germany or any of the other facist states during the 30's and 40's attract any immigrants?",
        "response": "I don't have a comprehensive answer, but I can give you 1 answer. There was a sort of Japanese \"academic tourism\" during that time, and Germany was seen as quite desirable to study in. There were Japanese restaurants and stores in Berlin as well as hotels and tourist places specifically for Japanese visitors. [This article](_URL_1_) credits the strength of the yen in fueling immigration/visits to Germany.  I wrote a bit about Japan-German relations in [this thread](_URL_0_), where I talked about the false idea of \"Honorary Aryan\" status and how it impacted the lives of the Japanese people that immigrated there. According to another poster in that thread, there were also over a thousand Chinese people in Germany in 1935.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the increase in unvaccinated children increase our risk of new mutated diseases that will cause our current vaccines to become useless or less effective?",
        "response": "Short answer, it is a possibility. I am not sure about likelihood, though. Basically, the pathogen that infects unvaccinated individuals gets a foot-hold in the population. Now, what remains is that it changes its structures so that the immune system (post vaccine) does not recognize it.  This is something that has been noted for Bordatella pertussis, where strains that were antigenically different from vaccine strains have been isolated [here] (_URL_0_), [here](_URL_2_) and [here] (_URL_1_).  It has been speculated that this may be caused/promoted by unvaccinated individuals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't anything happen after Telecom companies not build a fiber optic network, even though they got 400 billion from the gov't.",
        "response": "Phone companies: \"Relax rate restrictions. We'll build fiber!\" Government: \\*relaxes rate restrictions\\* Phone companies: ... Government: ... A small, vocal group on the Internet: \"So where's the fiber?\" Phone companies: \"What fiber?\" They built out a little. Mostly, though, the regulators forgot about it, and the phone companies were happy to let them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the whole Pirate Bay is just 90mb. Can I just download the whole site and feast with all the magnet links?",
        "response": "Yes. I'm pretty sure TPB has a TPB torrent. That's the point, anyone can download and host it. It's impossible to shut down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Criminals given multiple life sentences?",
        "response": "Because one is charged and judged for each crime - not all together. Best example: Someone in jail (life sentenced) murders. Now he will have a new court case + judgement",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there so much dishonesty and mistrust in auto repair services?",
        "response": "Because there exists significant difference of information between the parties and a level of desperation on the part of the consumer.  On the first point most people don't know anything about cars and car repair. Mechanics can take advantage of this fact.  On the second part, if your car is in for repairs you need it fixed most likely, so you don't necessarily have the ability to shop around.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "WHY can't we travel at light speed?",
        "response": "Like you're five? It takes energy to make a thing go faster, and the more mass a thing starts with(or the faster it's going), the more energy it takes to make it go any faster... like riding a bike... it's pretty easy to go from a stop to 5mph, but if you're already going fast, it takes a lot more energy to speed up That's all well and good if you keep pouring energy into a thing... but this hits a metaphorical wall at the speed of light where it would take infinite energy to make it go any faster, and since doing infinite things is generally not possible... neither is going faster than light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Comparing rock frozen in near absolute zero and one almost melting, would there be a difference between their shapes?",
        "response": "The most obvious shape change is that it will expand as it is heated. As it gets close to melting point, it will also soften and become slightly malleable, so that might lead the shape to be altered if something touches it. Absent external influences at this point, however, the shape won't change. As it hits the actual melting point edges will start to collapse and so on. You won't see the motion of individual molecules or anything, though, no. They're much too small to be visible. You'd only see major shape changes. It's also worth noting it will glow as it heats up, which will be fairly obvious and may obscure precise shape comparisons...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is the sensation of pins and needles generated, are there special nerve endings?",
        "response": "It's caused by randomly firing neurons. The natural, working, not-signalling state of a neuron is \"charged.\" When oxygen is deprived to the neuron, usually due to lack of blood flow, the neuron can no longer generate energy to keep itself \"charged.\" This causes it to \"discharge\" which is the same thing that happens when the nerve fires naturally. In the meantime, the nerve will keep trying to energize itself which may lead to pulses of the nerve discharging and recharging itself spontaneously.  Hence, your leg neurons will end up getting false readings from sensory neurons because the sensory neurons are discharging due to lack of oxygen as if they had been naturally activated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a country like Switzerland, with 4 national languages function?",
        "response": "Swiss here. What are you touching on? Government? Every-Day problems? School? Well, almost [all daily objects are labeled in at least three languages](_URL_0_). Announcements in trains are held in at least two languages. However, there are seperate parts in the country which speak different languages. **Don't think we all are quadrilingual. If you are, as me, a citizen of the german-speaking part of Switzerland, you will basically never need to speak italian or such.** We have to learn two languages at least in School, though (EN and French for me, EN/FR/IT in the extreme). The main part where all languages meet is national politics. It may help that Switzerland is so small. Our National Council offers simultaneous translations in all languages and the speaker speaks in his mother tongue. The Senate, however, does *not* offer this service. In conclusion. The main solution is translations, translations, translations everywhere. Ama. ^Edit:Grammar",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do retail prices end in .97 or .99?",
        "response": "You see the first number in a price and expect something close to that, so 4.99 seems more like 4 than 5. Retailers want things to feel affordable and to make the most profit so they go for 4.99. However we've been saturated with those prices for a while and our brain can sometimes recognise 4.99 as 5, so they trick your brain with an unfamiliar number like 4.97 or 4.98.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much did America REALLY help in World War I",
        "response": "America's contribution was pretty much vital in terms of the war finishing in 1918. From the point of view of the Western Allies, things were actually looking quite bleak in 1917. For one, the French Army (who had shouldered most of the burden on the Western Front) was nearing breaking point (something that resulted in mutinies amongst the troops) and the British offensive around Passchendaele didn't appear to be getting off to the best of the starts. However, the real strategic problem was that Germany made peace with Russia following the revolution and this freed up enormous amounts of manpower that could then be used to shore up the Western Front. Thankfully for the Allies, this development coincided with America's entry to the war so that most of Germany's strategic advantage was neutralised by the flood of American troops arriving in Europe. Had they not, it's conceivable that the fighting on the Western Front could have carried on grinding away inconclusively for years to come.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are radio frequencies split into radio waves and microwaves?",
        "response": "Both radio waves and microwaves are examples of electromagnetic radiation. The split into various categories is somewhat arbitrary. In reality, there's a continuous spectrum of EM radiation and there are no real \"hard breaks\" between different parts of the spectrum. We group parts of the spectrum together with a specific name because of specific applications. It's worth noting that radio waves and microwaves are quite close together in the EM spectrum. Depending on who you ask, they may even overlap. But it's all a matter of definition, there is no hard rule.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do the physical properties of ice change at different temperatures?",
        "response": "Under the right conditions, ice can take on different crystalline forms called \"solid phases.\" Parameters like [temperature, pressure, and volume](_URL_4_) govern these varying morphological regimes (image from [Wikipedia:Ice/Phases](_URL_2_), which features an excellent summary table). [This University page](_URL_6_) is another good resource for learning about solid phases of ice. With respect to your example, 'hardness' describes resistance to plastic deformation (and it doesn't look like much research has been done to characterize the hardness of different solid phases of ice at comparable conditions). [This AskScience answer](_URL_1_) cites [Nesje and Dahl (2000)](_URL_0_), which claims that ice hardness (for naturally occurring hexagonal ice) increases from 1.5 to 6 on the Mohs scale as it cools from 0 to -70°C. [A different AskScience thread](_URL_3_) contains a similar discussion on ice hardness at different temperatures and references [this 1958 article on single-crystal ice hardness](_URL_5_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do animals with tough, armored backs always have soft underbellies?",
        "response": "Turtles have a tough belly too. Their shell completely encloses them. See for example [this tortoise skeleton](_URL_0_). Same with lobsters and crabs. So there is nothing in particularly stopping animals from evolving tough bellies. The other answers have addressed why doing so may not always be advantageous.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the maximum capability of the strongest missile defence system now? Why is it not enough to stop MAD?",
        "response": "There are several missile defense systems put there, but none are 100% effective against ICBM's, which are the largest and fastest missiles. They are designed for the possibility of some terrorist group or rogue state cobbling together one working missile and launching it, not a full nuclear attack from another superpower. In that situation, they would be completely overwhelmed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is specific information (e.g. Speaker configuration) transmitted via. radio waves?",
        "response": "Essentially, the radio transmission contains two pieces of information: the sum of the left+right audio streams, and a sideband channel producing difference information (left - right). The stereo system uses the second channel to modify the audio being transmitted to the left/right speakers. If you're using digital radio (sattellite, 'HD' radio, etc.), then it's a simple digital encoding of two separate audio channels. One for left, and one for right.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do animals seem to only cross roads when cars are coming?",
        "response": "Because you only observe them crossing the road when cars are coming. If you took a camera and placed it by a road where there is known animal crossings, and taped a years worth, I doubt there would be any difference between animal crossings when cars are coming or when they are not coming",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do animals get water from in the winter in places where everything is frozen over, and there is no snow available to eat?",
        "response": "Funnily enough eating snow is actually very expensive in terms of metabolism. Meaning it's normally a waste of time! (Another reason to not eat the yellow snow) Usually it varies from animal to animal. Polar bears for instance use a chemical process to help break down fat into water. That's why seals are the main course, they strip the blubber off and leave the meat to the scavengers. Penguins on the opposite end are designed with drinking salt water in mind. A gland behind their eyes filters the salt out of their blood and expels it through their nose. So there's no catch all answer, but usually A) they extract enough water from what they eat B) They adapt to drinking saltwater, which usually doesn't freeze in subzero conditions",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a photon has no mass, how can light exert pressure?",
        "response": "Light has no mass, but it still has momentum proportional to its energy. When a photon strikes an object, it will either be absorbed or reflected. In either case, conservation of momentum requires that some momentum be transferred to the object being struck. Thus, a force (change in momentum) is experienced by that object, and pressure is just force per unit area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Protestant Reformation affect the Orthodox Church, if at all?",
        "response": "Very little. Here is a comment thread to a similar question in which /u/VexedCoffee gives a good answer: _URL_0_ Here's a thread with my own answer to a similar question: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it easier not to fall on a moving bike?",
        "response": "The way my father explained it to me was through conservation of momentum. This sounds like a difficult concept, but all it really means is that a fast object (or a heavy object, but that isn't as crucial here) is going really fast, so it takes a lot of effort to stop it or move it, right? This means that you're not likely to fall over, since you're heading in a straight line at a significant speed, but it also makes turning harder. It's easiest to take one's hands off the handlebars when you're going fast rather than slow for this reason (though unless you know what you're doing, don't try it).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do antibiotics lower the effectiveness of birth control?",
        "response": "There are [a couple of antibiotics that do reduce the effectiveness of the contraceptive pill](_URL_0_). The two antibiotics that do so are known as enzyme inducing, meaning they speed up the body's processing of the hormones in the contraceptive pill. However these two antibiotics are not too common. Antibiotics in general affecting contraception is a myth, possibly linked to sexist ideas that women on antibiotics shouldn't have sex (wise advice if it's for treatment of am STI, otherwise not).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are the high-mountain trails built?",
        "response": "There are trail crews, usually park or forest service, that spend full summers building and maintaining trails. you can imagine the fitness required for these jobs. If there are significant material needs (too heavy to carry), helicopters would be dispatched to airlift the materials to a desired location. A lot of the tools (shovels, axe, picks, etc..) are usually stored in locations on the trail to avoid unnecessary daily transport by the workers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the concept of a particle with no mass make any sense?",
        "response": "If you can explain why it doesn't make sense to you, maybe we can address that specifically.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between sugars in pop and sugars in fruit, and the effect on my health",
        "response": "Sugars found in fruit, namely Fructose is no better than the sugar you put in your coffee, cookies etc. The difference is that why you are eating a piece of fruit, the sugar within it also comes with additional beneficial nutrients, vitamins etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "It seems that Hollywood is obsessed with the idea of the \"cursed tomb,\" so booby-trapped that it is nigh impenetrable. Have there actually been tombs where its explorers have perished because of tomb defenses still active after the centuries?",
        "response": "You might be interested in these previous threads - [here](_URL_1_) and [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "On Star Trek, how do they film people being transported, so that it looks like they literally vanished into thin air, sometimes even when there's motion all around them?",
        "response": "Lock up the camera so it doesn't move, film the people entering the transporter. Then they walk away. Leave the camera locked and then dissolve between the footage with people and without people. Add sparkly effects onto the film.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do rovers on Mars transmit information, such as pictures and video, back to Earth?",
        "response": "They send it to an orbiting relay satellite. Today it's the [Mars Reconnaissance Orbiter](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do almost always eat lamb instead of sheep? (Mutton)",
        "response": "People are giving you all kinds of economic reasons. I think the answer is a lot simpler than that. Mutton has a very strong flavor. You know the \"lamb\" flavor that tells you that you aren't eating a piece of beef? Mutton has that same \"lamb\" flavor, but many times stronger. In the US, most people are used to eating relatively bland domesticated grain-fed beef, chicken, pork, etc., and many would find the strong flavor of mutton offensive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do photocopiers actually work?",
        "response": "Printers work by translating digital images into a set of instructions for a printer head to move across a piece of paper, depositing ink where appropriate. Photocopiers often use a different technique, called xerography, where the light/image from the original being copied causes a reaction on a photosensitive plate or roller, this reaction causes toner to stick to the plate in appropriate areas, and is then transferred to the copy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Credit Cards with quarterly 5% back rotating categories require you to \"activate\" each quarter?",
        "response": "These are promotions for the credit card and for other cards by that issuer. If you could get them without doing anything, the issuer would be giving away money for free--most customers barely look at their statements and just pay what's due. By requiring you to interact with the advertisement to get your cashback reward, the advertisement is more cost-effective. This is because you remember the advertisement more and only those people that paid attention to the ad get money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do high-end digital cameras need a physical shutter, while cell phone cameras don't?",
        "response": "Having a physical shutter is *better* than not having one, because the physical shutter can move much faster than a sensor can regulate itself, and so you can achieve higher shutter speeds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What determines a sapphire color?",
        "response": "Sapphire is made up of a lattice of aluminum atoms and oxygen atoms, but it's really hard to get a pure lattice, and sometimes other metal atoms get mixed in. All these metals interact with light in different ways, and the result is a variety of colors. If there's chromium, then the stone will appear red. If there's vanadium, then the stone will appear purple. If there's titanium, then the stone will be colorless. If there's iron, then the stone will be pale yellow to green.  Surprisingly enough, if both titanium and iron impurities are present together in the right proportions, the stone will be deep blue!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Higgs Boson - With all the news lately...",
        "response": "I wondered if there would be a post asking about it. [I stumbled across this video in my own search](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is peripheral blood used in blood test opposed to blood from the arteries?",
        "response": "Arterial blood is in theory more useful (can get important information like [blood gases](_URL_1_) or continuous blood pressures, but comes with the unfortunately downside of risk of downstream hypoperfusion and causing damage to the hand. They are also significantly more painful than venous punctures.  In general, for most of the things we care about in blood ([cbcs](_URL_2_) and [chem-7s](_URL_0_) most frequently), venous blood is as good and carries with it fewer complications. Having a venous line in place also allows for injection of medicines, something that is generally avoided in arterial lines.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far behind a semi-truck would I have to drive to take full advantage of the wind-drag shadow it creates?",
        "response": "Just to build off this idea, while it seems that driving that close to a truck is too dangerous to do in practice, it has become an idea that may allow early integration of robotic driving cars. The truck starts a convoy of cars behind it that are all networked and computer controlled to minimize air resistance and maximize speed. The computer controls are supposed to make up for the dangers of letting humans drive that close together that quickly. I believe it's this [SARTRE](_URL_0_) project.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Outside of Russian speaking Soviet Republics, why is Russia not a major immigrant destination when it has so much land?",
        "response": "Much of Russia's territory is inhospitable land which is why there's so little competition from neighboring countries to claim that land or to immigrate there. You'll notice that the European part of Russia has a much higher population density than the Asian part - Siberia, which makes up 77% of Russia's landmass, only houses 27% of the population.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that, during an eclipse, the moon perfectly blocks out the sun?",
        "response": "The moon is much smaller, but it's much closer and that cancels it out. The apparent size of the moon and the sun and anything else is just the angle of arc that it takes up, which in radians is its diameter divided by its distance. For the moon, that's 3500 km / 400,000 km ~ 0.009 radians ~ 30'. For the sun, that's 1,400,000 km / 150,000,000 km ~ 0.009 radians ~ 30'. For my pinky nail held at arms length, it's 0.01 m / 1 m = 0.01 radians ~ 30'. All the same apparent size. As for why the moon happens to be the same apparent size as the sun (sometimes, when it's not you get an *annular* eclipse instead), that's just a coincidence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans get addicted to trans fat?",
        "response": "Fat in general. Fat has more calories, until recent times humans wanted and needed to eat as much fat as possible to survive because food wasn't an every day thing, the brain rewards us for that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why isn't the female condom more popular?",
        "response": "They're difficult to wear, less attractive to look at, and they're more failure prone than male.condoms. They also get in the way during sex as you have a plastic supporting ring hanging outside the vagina. Horrid devices. There's nothing less sexy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do random meaningless childhood memories stay with you for life, but important moments are easily forgettable?",
        "response": "We really don't know which memories are important. Those \"random\" bits from childhood may have formed us more than we understand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if when you get a shot or something injected to your body, there was an air bubble in it.",
        "response": "It could cause an [air embolism](_URL_0_).  However, it takes quite a bit of air ( > 100mL) to actually cause a problem, so it's mostly to err on the side of caution.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are members of college sports teams students instead of staff?",
        "response": "The overwhelming majority (like, 99%) of college athletes will not be professional athletes, so it absolutely makes sense for them to earn a degree. There's no way to decide which players are good enough to go pro when they're 18 or whatever, so it would be ridiculous to say \"oh yeah you don't have to go to class\" and have the kid be completely fucked over when it turns out he just doesn't have what it takes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do extremely small countries come to exist?",
        "response": "Just a few hundred years ago, large parts of the world did not have a big country governing them. Italy for example was a whole bunch of tiny independent *city-states.* Over time many of these merged into large countries (like Italy!) but there were some leftovers that resisted merging.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does some peoples eye color change over their lifetime?",
        "response": "From wikipedia: \"In humans, melanin is the primary determinant of skin color. It is also found in hair, the pigmented tissue underlying the iris of the eye, and the stria vascularis of the inner ear.\" As you get older, production of melanin (which is responsible for giving your skin, hair and eyes its colour) decreases. So people's eyes will get lighter when there's less melanin, just like their hair does too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Do We Know Krakatoa was the Loudest Sound Ever?",
        "response": "It's just a little bit of hyperbole to emphasize how freakin' loud Krakatoa was. To be technical they should say it's the loudest sound in recent history, and the loudest since it occurred. They don't mean to seriously claim that no event ever before, here or on other planets, has never been louder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a Chinese dictionary work?",
        "response": "In Mainland Chinese dictionaries, there are two indexes, one is sorted by a romanization system called *pinyin*, it's for if you know the pronounciation but not how the character is written. The other one is sorted by the partial and the numbers of strokes in a character, so it's for if you see a character but you don't know how it's pronounced.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are condom wrappers not made from a material that is easily gripped by sweaty hands?",
        "response": "Is it really a problem that people have such sweaty hands before sex that they can't get a condom wrapper open? Now I feel like maybe I'm not sexing hard enough.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who designs and builds the crazy things like the LHC?",
        "response": "It's a lot of collaboration between the research team and various corporations and whatnot. A lot of the design work is done in-house (in my experience), and then the production is farmed out. So yes, if you're an EE, consider seeing if various experiments are hiring in your field, or contact them to see which kinds of companies you should get in touch with to help build the next big new thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes goosebumps?",
        "response": "Goosebumps or piloerection (fun word) is a response of your body to low temperatures, the idea is that it makes your hair stand on end so that it can trap more air underneath it to create a better layer of insulation. Unfortunately because humans don't have a thick coat of fur like a lot of other animals (unless you're greek), this doesn't actually work because the limited hair we have can't actually trap any air underneath it",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the biological purpose of fingerprints?",
        "response": "For gripping things of course. Their particular pattern is basically random because it hardly matters.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a magician never reveals their secret, how do people begin to learn more advanced magic tricks?",
        "response": "A) magicians often reveal their secrets *to other magicians*. Societies like [The Magic Circle](_URL_0_) exist to provide an 'accreditation' system so you know who is a bona fide magician B) people come up with advanced stuff on their own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many old/elderly people drive car brands like Lincoln, Mercury, or Buick?",
        "response": "The same reason that they still wear hair styles from 30-40- years ago. Same reason some kid will want to know why you still drive a Toyota 40 years from now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could viruses cross the boundary from non-living to living?",
        "response": "Based on this hypothetical situation I don't think we could call this new organism a virus at all. We'd need a new classification for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and why does milk help soothe the burning sensation after eating spicy food? Why does water make it worse?",
        "response": "It actually has more to do with the chemical that makes food spicy, capsaicin, being soluble in fat. It dissolves into it and gets pulled away from your pain receptors in your mouth. There are many other fatty and oily foods that work too. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can’t allergies be cured, or at least permanently suppressed?",
        "response": "An allergy is your immune system overreacting to a harmless substance. We can't cure it because we don't know how to reprogram the immune system and you wouldn't want to suppress it because then your immune system wouldn't work as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Help me wrap my head around the fact that 1+2+3+4+5...\"infinity\" = -1/12?",
        "response": "[It doesn't *equal* -1/12](_URL_1_). It's a useful substitution in [analytic continuation](_URL_0_), which is a technique in complex analysis, a branch of mathematics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With China set to relax their one-child policy, what kind of effect will this have on their population, their consumption of the world's resources and their economy over the next 50 years?",
        "response": "China will require more energy and more resources as it grows. If it grows. There's something to be said about the psychological effects of the one-child policy. You have an entire generation of only children, who may be preconditioned to having a single child because of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the most common state of matter on our planet?",
        "response": "According to the wikipedia article on [mantle](_URL_0_) this makes up the majority of earth's volume and is technically solid (which is funny because I always thought it was liquid).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do objects get more massive when they move at higher velocity?",
        "response": "These past posts shed some light on it: 1. [ELI5: why and/or how does mass increase with speed? What is happening? ](_URL_0_) ^(_8 comments_) 1. [ELI5: e=(mc)2 - if objects gain mass as they approach the speed of light... ](_URL_1_) ^(_7 comments_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that when someone's standing beside me in front of the mirror and I look at them on the mirror, their face looks... rather different?",
        "response": "Also, if I am not mistaken, when you see yourself in a common mirror you look bigger than you actually are. So when you see someone else in the mirror they look bigger than you usually perceive them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans almost always have only one child per pregnancy unlike almost all other mammals?",
        "response": "Almost all large sized mammals, like primate sized and above, normally give birth to a single offspring per pregnancy. Smaller mammals, such as cats, do indeed give birth to more than one offspring. It is largely dependent on size, and humans are large enough that we fall into the one offspring per birth event category, although multiple births can happen in almost all species, as an anomaly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do songs sung in foreign languages have lines in English?",
        "response": "For the most part, because the influence of the US in the world's cultural landscape is HUGE. Some words get borrowed by other languages, even when there is an equivalent native word, like \"sexy.\" Some times the English words just fit, or rhyme better. Also, everybody is so exposed to American (and British, to a lesser extent) music, movies, TV shows, that words just get assimilated and end up used in everyday conversation. Some examples of words that I've seen used like that in Brazilian Portuguese are \"cool,\" \"sexy,\" \"bully,\" \"fuck,\" \"gentleman,\" and many others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the japanese rationalize the invasion of china in the second sino japanese war to their own people? How did they motivate their soldiers to be so ferocious?",
        "response": "Posting from a mobile phone, so here is a quick answer. For years before the full scale war started, japan had international treaties with china. They had the right to station troops in china to protect japanese merchants, whom enjoyed special legal status in china. The treaties were based on treaties that other great powers had made china sign.  When war broke out, Japan claimed its troops, who were legally allowed in china, had been attacked by chinese. So Japanese people were told it was a war of self defense.  There was a culture within the military that let atrocities happen. Physical beatings were common punishment in the imperial japanese military. Soldiers were not taught anything about ethical treatment of prisoners.  facing regular guerrilla attacks, they treated every single chinese as an enemy.  And officers rarely punished soldiers who brutalized civilians. It was a situation that allowed soldiers to engage in extreme acts of violence against helpless prisoners and civilians.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do obviously fake facebook profiles sending me a friend request end up making money for the people who make them?",
        "response": "I assume you're talking about the fake \"super attractive girl in revealing clothing\" profile. Most of the time these are run either by webcam girls as advertisement for their own show, or by bots run by the webcam site itself, as advertisement for the site. The girl makes money from you entering a private show with her, and the site gets a cut. The girls prey on younger or technologically illiterate people. It makes it seem more legitimate to have someone on FB send you a friend request, rather than a spam email from Jazmine. They chat you up, get you hooked, give you the link, and take it from there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the \"traffic time to...\" updates on the overhead signs on the freeway get tracked in real time?",
        "response": "Most freeways use induction loops under the asphalt, which trigger every time a vehicle passes overhead. These loops can determine the speed that vehicles are passing by, as well as the traffic density. With a little bit of math it's not too difficult to determine times to different places.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does google store their data?",
        "response": "yes. this is one of hundreds of data centers that google owns. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we so far from a scientific consensus about the best diet?",
        "response": "Here's a starting point in thinking about diet. * 1. Caloric Content of Food * 2. Nutritional Content of Food * 3. Specific benefit from consuming the food (e.g. contains anti-oxidants) * 4. Specific harm (or risk) from consuming the food (e.g. mercury in some fish) * 5. Positive and negative synergistic effects of dietary choices (e.g. certain nutrients being required in order for the body to be able to metabolize other nutrients. * 6 Preparation methods and their effects on 1, 2, 3, 4, 5 * 7. Price Then we need to consider a person's unique biological needs, to include normal differences in natural size, weight, as well specific dietary needs due to illness, genetic disorders, etc.. Suffice it to say, it's a complex endeavor. I hope some people can give an \"answer\" to your post. But any \"system\" that is described needs to have taken into account these factors at the very least.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do toddlers seem to have \"pot bellies\"?",
        "response": "What you're seeing is a type of fat, called brown fat. The main purpose of \"brown fat\" is to regulate internal body temperatures of the baby(s)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is stomach acid formed inside the human body?",
        "response": "Take salt, carbon dioxide and water from blood, then through ion exchange tricks through cell membranes get baking soda in blood and hydrochloric acid in the stomach.  Then take the soda from blood in pancreas and dump it into intestines to neutralize the acid and get back to initial composition absorbed back to blood in intestines.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "two-in-one shampoo/conditioners",
        "response": "Yes you are correct shampoos will strip away the oils in the conditioner. Sometimes these products will contain oils that the shampoo won't strip away, but they wont condition your hair as well. Basically you are right, they are a scam (mostly). You are always better off shampooing, THEN conditioning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Venus maintain such a thick atmosphere without a magnetic field?",
        "response": "Venus's atmosphere is being stripped by solar wind (see here for some recent measurements: _URL_0_). But I think that Mars's atmosphere is also thin because of its lower gravity and lack of an active crust. There's a lot of carbon dioxide and water that's trapped as ice layers, whereas on Venus it's all up in the (thick) atmosphere. And Venus is very likely still volcanically active, which adds more material as well. I would imagine that one good volcanic eruption cancels out quite a bit of solar wind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do eggs go from a liquid to a solid when they are heated up and cooked?",
        "response": "An egg isn't like water, it's mostly protein, made up of ameno acid chains. When you heat it, you're giving it a ton of energy. The chains take this energy, and use it to form stronger bonds with other protein molecules. The result is a solid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does unemployment work? Who pays for it?",
        "response": "Unemployment is an insurance system. Everyone pays an unemployment insurance premium (or their employers do, depending on the location, but it is part of your compensation). Then unemployment gets paid out of the fund of that unemployment insurance that you paid. It is an ante to the gamble that you are terminated wrongfully or without cause, and the payout is some percentage of your wages, as determined by what you paid in. This means that you SHOULD find a job again if you can. This means that taking it is NOT robbing the system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there difference between 2G, 3G, and 4G in terms of power consumption?",
        "response": "AT & T has a [doc](_URL_0_) comparing energy consumption between UMTS (3G) and LTE (4G). It depends. Overall it seems too me that despite of:  > The bottom line is that while LTE is much faster than 3G, it also uses more energy ...when you also regard the much higher data rate it's more energy efficient per transmitted KB.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Hindenburg crash effectively stop the use of airships while the Titanic crash didn't stop the use of ocean liners?",
        "response": "1) because WWII started 2 years after the Hindenburg blew up and civilian air travel stopped for the duration of the war. 2) By the end of the war aircraft and jet engine technology has matured to the point where airplane travel is vastly better than anything Airships can offer. In contrast, when the Titanic went down, people still took ships because there was simply nothing else available for long distance travel. EDIT: Also, operating the Hindenburg is expensive, it can only carry 72 passengers, required a crew of 10 to operate and a trans-atlantic crossing took 4 days. A 1958 Boeing 707 can seat 150 passengers, required a crew of 4, and can fly from New York to London in 12 hours.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about the expanding universe",
        "response": "> Since further away also means further back in time, wouldn't that mean that the speed is actually slowing? Nope -- it doesn't imply that, and actually the opposite condition is true -- the speed is increasing. *At the time the light was emitted*, the object was moving away from us with the observed speed (calculable by the redshift). Due to the [accelerating](_URL_0_) expansion, it is moving even faster away from us right now than it was when the light was emitted. The expansion is actually speeding up, and the velocities of distant galaxies are increasing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does 'getting used' to spicy food actually work?",
        "response": "When you repeated eat spicy food you're over stimulating the receptors that sense heat. The receptors deactivate themselves so they can better handle the heat. It's kind of like having an annoying younger brother who you eventually just decide to start ignoring instead of dealing with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If oxytocin plays a role in breastfeeding and uterine contractions, does a mother's uterus also contract while she is breastfeeding her child?",
        "response": "This is one of the reasons women who breastfeed reach a smaller size sooner. Other reasons include increased calorie output for milk production. I used to feel the cramps as I fed my babies. (please note, I am no doctor- just relaying what my docs told me with each of my kids)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people make money by investing theirs?",
        "response": "I wanna open a lemonade stand. I need $10 for lemons, sugar, and cups. I have $0. You have $10. If you give me that $10 to open my stand, i'll give you a percentage of my profits from every cup. Over the summer you'll make more than your $10, and obviously anything I make is great for me, cause i didnt put in any money. I'm now a businessman, and you are an investor.  Thats the core idea of investment. Obviously it gets more complicated with stocks and other types of different investments, but thats how i would explain it to a 5 year old.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is oxidation and reduction? Why do they cause things like changes of color, fire, rust, etc?",
        "response": "Oxidation and reduction can be defined in a few ways, the easiest being that oxidation is gaining oxygen and reduction is losing oxygen. However you can also define it in terms of electrons, hydrogen or oxidation number and I’m sure there are others but I don’t think I’ll need those to answer the question.  Basically when things are oxidised you are forming a new compound and that new compound will have different properties. To take the example of rust, you take a metal and now have turned it into an ionic compound which will cause it to have a new structure. The new molecule will have a new colour as different wavelengths of light will be reflected (something to do with how the electrostatic forces affect light, I’m no expert). The fire thing is because many redox reactions reactions are exothermic (give off heat) and if enough heat energy is given off you can get fire. Full disclaimer though, I’m not an expert in any of this so take it with a pinch of salt, I’ll probably be corrected",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I just found out that atoms repel. But now I have so many questions.",
        "response": "We're not transparent because light interacts with atoms. Food and liquid does touch us; \"touching\" just means something subtly different than you're used to. It's not true that an atom is 99.9% empty space. The electrons of the atom are spread out over that space. Atoms don't always repel; they can bond with each other too. Those bonds keep you together.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's happening when you \"get the breath knocked out of you\"?",
        "response": "After a blow to the chest your diaphram (a muscle which contracts causing a vaccuum in your chest [pleural space] which causes your lungs to expand creating another vaccum within the lungs which then sucks in air) seizes and you can't breath for a few moments. It's the same muscle that twitches to cause hiccups. A collapsed lung is different and due to air in the chest around the lungs [pleural space again] which prevents the lung from expanding when the diaphram contracts as detailed above.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between a Story, Saga, Epic, Cycle, Novel, etc.",
        "response": "Story, novella and novel are single works of literature in ascending order of length and complexity. A cycle is several novels united by a common setting and protagonists. Epic and saga are cooler words for a cycle. However, epics and sagas tend to be more monolithic than \"normal\" cycles. For example, several novels about Alice and Bob in the world of Mediocre Earth are always a cycle, but if they have a common overarching plot like Lord of the Rings or A Song of Earth and Fire, they are a saga or an epic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do boat sails work if the wind is going the wrong way?",
        "response": "You have to do what’s called tacking, where you zig zag back and forth using some of the wind with sails at 45 degree angle, then swing sail to other side to turn 90 degrees.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the negative consequences of drinking caffeine and alcohol together?",
        "response": "Here is a link to a study about \"Four Loco\" It explains a lot of the issues, including your body forming a link between a flavor (the caffeine part) and the alcohol. You'll find numerous studies on Four Loco. [Click Here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Snopes is considered such a reliable resource.",
        "response": "Basically they have established that reputation over time by being consistently reliable. Snopes puts a lot of effort into ensuring that anything they post is accurate **before** they post it. And in the rare situations where they are wrong they are quick to acknowledge this and correct themselves. Because they've been doing this consistently for a while now, they are considered a reliable resource simply because they ARE a reliable resource.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some moments not feel great at the time, but when you think about them later in life, you really miss them and think those moments were great?",
        "response": "You forget the bad things, basically. Time erases small imperfections and leaves only ideas, things that you can romanticize and over value. I don't have any scientific links for you, but it is well documented in literature: \"Things always seem fairer when we look back at them, and it is out of that inaccessible tower of the past that Longing leans and beckons.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why in every Zombie movie has no one ever heard of Zombies? It's never an issue with other horror monsters (Vampires, Ghosts, Aliens, etc). So what makes Zombies so special?",
        "response": "Because really the zombie plague represents an unknown pathogen that spreads rapidly. Like a pandemic. It is the visual representation of something taking hold and killing many, spreading rapidly, and breaking down modern society.  There are movies that actual deal with real illnesses and uncontrolled spread, but it's far less exciting. The unexpected initial onset is important for the plots because they represent our fear of the government withholding information or trying to reduce panic.  At least, in one of my college classes, that's what we came up with. Like ten years ago.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do scratchy throats happen, and why is it so hard to get rid of them?",
        "response": "They're usually caused by a virus or infection. Takes some time for your body to fight it off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Romans have the capability to sail to and colonize the New World?",
        "response": "hi! you may find something of interest in these related threads * [Why didn't advanced civilizations like the Romans think to travel across the Atlantic?](_URL_1_) * [Could Ancient Romans have sailed to South America in the 5th or 6th century?](_URL_2_) * [Did the Roman Empire, at any Point have knowledge of the continent of North America?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the meaning behind the phrase..Make a B-line?",
        "response": "The proper term is \"bee line\". It refers to how bees will fly in a direct line back to their hive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why North American (or English speakers, not sure) are crazy about abbreviation like ELI5, TL;DR, ASAP?",
        "response": "In the US, our culture values being innovative, quick, and efficient. I believe that acronyms and other shorthand techniques are a byproduct of these values",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If lifting weights is recommended to get lean, then why don't obese people get lean by virtue of carrying hundreds of extra pounds every day?",
        "response": "Yes, that's exactly how it would work **IF** obese people ate fewer calories than they were outputting via moving their colossal rear ends. The problem is that they don't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does PCP make one incredibly strong?",
        "response": "I am not aware of any research that details PCP increasing strength per se. After all, there is a physical limit (i.e. _URL_0_) to the amount of force a muscle can exert. I don't know enough about muscle to be sure that this cannot be altered by drugs that change calcium release or the myosin/actin interaction that causes a muscle unit to contract. What PCP can do, however, is induce severe delusions. People suffering delusions of the severity reported in all the annecdotes about PCP are unlikely to pay the same attention to pain, injury or any of the normal physical and psychological cues that would signal to a normal person: 'hey maybe you should stop now before you damage yourself or something else'. Someone who truly believes they are invulnerable is not going to pay much attention to any muscle tears or physical insult that they might receive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I get completely random flashbacks of obscure dreams I've had many years ago. What could cause this?",
        "response": "To everyone currently commenting: This is not AskReddit. Anecdotes and speculation are not acceptable replies to a question in AskScience. Please read the guidelines on the sidebar -------- >",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your field of vision stay the same as your pupils contract and dilate?",
        "response": "The same reason it crops out your nose, momentary blindness when you blink or move eyes, etc.: your brain auto-corrects the information it is receiving to create a seamless experience.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If drawing Mohammed is disliked in the muslim community because one should not attempt to capture god's work in such a way, how come it is ok for so many to name their children mohammed?",
        "response": "Islam is very against idols. It is okay to name your child in hope that they will share similar attributes, but depiction leads to false idols. So Christianity with their statues of saints would be considered to be promoting gods other than god.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a reason for the order of the English alphabet? Where/when was its earliest appearance in its current form?",
        "response": "/r/linguistics has a great professional community. I bet they'd have some interesting answers for you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is pus? how does it form? and why does it hurt until you get it all out from the wound?",
        "response": "It hurts because its causing swelling and heat. When you squeeze it out it releases the pressure on the surrounding tissues.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does closing your eyes when lying down make you feel like you're resting but lying down with your eyes open you feel no rest? What does closing your eyes trigger in your body?",
        "response": "When your eyes are open your brain is still processing everything you see for information. Whereas when your eyes are closed you're blocking out that sense from your brain to process. That's why people might go in sensory deprivation tanks at a spa or for therapy. In those tanks, it's completely dark taking away your sense of sight. On top of that you float in the salt water at skin temperature, so that lessens your sense of touch and you're enclosed in a tank with minimal smell.  tl;dr: eyes close- > less info processed- > brain rests",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are chocolate and raisins bad for dogs to eat?",
        "response": "\"Theobromine poisoning or chocolate poisoning is an overdose reaction to the alkaloid theobromine, found in chocolate, tea, cola beverages,[1] açaí berries,[citation needed] and some other foods.\" \"In general, the amount of theobromine found in chocolate is small enough such that chocolate can be safely consumed by humans.\" Humans can process enough theobromine so that chocolate is not normally dangerous to us. Dogs cannot do this. _URL_0_ \"Serious poisoning happens more frequently in domestic animals, which metabolize theobromine much more slowly than humans, and can easily consume enough chocolate to cause chocolate poisoning. If large numbers of filled chocolate candies are consumed another serious danger is posed by the fat and sugar in the fillings which can sometimes trigger life threatening pancreatitis several days later. \"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is life insurance sustainable from a business standpoint if everybody is guaranteed to die?",
        "response": "My wife and I each have 10 year term life insurance policies. Our goal is to make sure we have enough money to maintain our children's lifestyle in the event of the untimely death of either or both of us before all our kids graduate High School. After that they're on their own and will rely on themselves and our existing resources. So, in the best case scenario, both of us will pay in for 10 years and then collect nothing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is 911 the phone number to every police station?",
        "response": "It is not the number to the police station. It is the number of the emergency call center. The local phone company knows where your phone is and what ECC serves that area. When you dial 911, they route your call to that location. You can get police, fire, and other emergency services by talking to a trained operator that knows your area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some fluorescent lights flicker on and off for a short while when switched on?",
        "response": "A fluorescent tube is a type of electrical discharge lamp, an electrical arc has to be established between either end of the tube.  In modern lights this is done electronically, which is usually a smoother less dramatic process.  In older lamps, they used what was called a switch start procedure. Power would be applied, which would warm up the electrodes at either end of the lamp, and then when that is disconnected, an electrical ballast would send a blast of power across the tube in an attempt to start the arc. This might go through three or four cycles before a steady arc is established and the light begins properly working. This is why on old lamps you get the typical flick-flick-flick-ping as they light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there any chance for the Central Powers to win WWI?",
        "response": "The Germans were at the height of their power in the beginning months of 1918 - however threw it all away on wasteful offensives which bled them dry by the summer of that year. By the end of summer it was all over when fresh reinforcements from America and Canada were pouring in.  I did a paper on the food crisis in Germany at the time, and there was no shortage of food. The trouble was shipping it to places it needed to be - which left hundreds of thousands of people starving.  Both sides were equally guilty of silly charges and tactics which got many people killed - in the end Germany could afford the losses the least.  edit. So, did they ever have a chance? I suppose - had they not threw everything away in those failed advances in 1918 then they could have bled the others out and they would have had a better chance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get \"Pee shy\"?",
        "response": "1) Our primal instinct is to urinate where we feel safe for we are particularly vulnerable during the process. 2) We do not feel safe in close proximity to others on a primal level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": ". I heard that you burn quite a few calories when you orgasm. Is this true? How or what is burning all those calories? If say someone started masturbating/having sex multiple times a day would they lose weight?",
        "response": "No, it is not true. Sex itself can burn calories, but that's because of the moving around (physical activity), not due to orgasm. If you have vigorous sex several times per day, it will burn calories, but it's unlikely to be enough to lose a significant amount of weight.  As with all of these types of questions: the ONLY way to lose weight is to burn more calories than you consume. Diets, pills, and supplements that claim to be able to boost your metabolism enough to cause you to lose more weight are lying. Your weight is 85% what you eat, and about 15% your exercise. It's quite possible to be thin and sedentary, and it's possible to have a lot of excess fat and still be very strong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wireless electricity, how it works, and why we don't have it.",
        "response": "The biggest problem is inefficiency, unless your transmitter can focus and aim a beam at every target device you need to broadcast it freely in all directions (the way wifi works for example). [When things spread out in all directions, they get exponentially weaker as you get farther away](_URL_0_) whereas copper can carry AC current very efficiently. In short, we do use \"wireless electricity\" in things such as transformers - [the big metal cans you see up on the power poles](_URL_1_) - where 2 coils of wire are simply next to each other and transmit by electromagnetic [induction](_URL_2_), but we haven't worked out a way to do that over great distances effectively yet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do scientists know what dinosaurs sound like?",
        "response": "Scientist's don't know for sure. They only estimate based on the size and shape of their skulls and throats and by comparing it to modern animals with similar features",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between detonating a bomb and destroying one?",
        "response": "Some bombs can be blasted apart with a small explosion that won't set off the bigger explosion. For example, C4 is very stable and takes a blasting cap to set off. There has to be the right combination of both heat and kinetic energy to set off a block of C4. To get rid of a bunch of C4, you can hit it with a powerful blast of water that will (hopefully) tear apart the block of explosive without actually setting it off. You can also (hopefully) blast away the cap so that if it goes off, it's away from the bulk of the high explosive and (hopefully) won't set off much, if any. If there's a complicated trigger on the explosive, depending on how the explosive is detonated, you can put a shaped charge on the trigger and (hopefully) blow up the trigger without setting off the bomb itself. If you have a weak, slow reaction in the bomb, you can even strap a powerful enough explosive that literally blows the bomb apart faster than it can explode.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would Stuxnet and similar worms be reason to (unfortunately) be less keen on Nuclear?",
        "response": "No computer which controls a power plant should ever be directly connected to the Internet. Stuxnet worked because of the incompetency of the operators. Nuclear accidents never happen as acts of god, they _always_ happen because people made layers upon layers of mistakes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During sleep, how does our body know to suddenly wake when there is a disturbance in the environment such as a loud noise?",
        "response": "Because you’re still conscious, to be more specific you’re not full unconscious or unresponsive. The parts of your brain that detect threat and keep your body at the right temperatures are still awake and if they feel like something is wrong they will wake you up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could Earth-origin meteorites be found on the Moon and Mars?",
        "response": "Certainly. You are right in thinking that our atmosphere would slow down all the rocks and magma ejected in a collision event, but for the really large ones it is very likely that some chunks of Earth escaped the atmosphere and the gravitational pull of the Earth. Once they escaped, their getting to Mars would be unlikely, but definitely possible, and the process would not be too different from the way rocks from Mars make it here. As for the Moon, there are undoubtedly chunks of the Earth that that have landed on the Moon. In fact, if I'm not mistaken, the most commonly accepted theory of the moon's formation says that the moon is a chunk of the Earth. The idea is that some proto-planet smaller than the early Earth crashed into the Earth and the collision tore the Earth open, ejecting a bunch of the magma inside out into space. The debris from the collision and the magma ejected out eventually coalesced into the Moon we know today. So, in a weird sense, the Moon IS an Earth origin meteorite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that for some people using the same deodorant after a while it stops being effective?",
        "response": "The cause for odor from your armpits has more to do with the bacteria living there than your own body. If the fauna in your pits change, you may have to change your deodorant as well.  I had to change deodorants around puberty, but it was because my skin under my arms became very sensitive and now I have to use hypoallergenic stuff. Your body and the things living on/in it change all the time. Find what works!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about Quantum Mechanics",
        "response": "Multiple universes are purely speculative, so your question is derailed from its inception.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Japan so controversial in the US from 1991 to 1996 and hugely popular otherwise?",
        "response": "The US entered into a recession in 1990-1993 and just like in the early-mid 1980's, we feared that we were going to be overtaken economically by japan and that japanese exports were destroying american jobs. Then in 1993 the economy started to grow and people didn't care about japan anymore.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we find some of our own bodily odors pleasant (or at least not unpleasant)?",
        "response": "Well, the simplest reason is that we've been with them for so long (the smells). So they're there. Kinda like if you put something prickly on your arm and leave it there - after some time you'll feel as if it is not there - you'll need to move it to re-feel it. Almost the same with them smells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the evolutionary history of mental illness? Do non-human primates show similar illnesses? What about other animals?",
        "response": "**Non-human Primates**: One recent study found that non-human primates displayed behaviors which [\"resemble symptoms associated with psychiatric disorders in humans such as depression, anxiety disorders, eating disorders, and post-traumatic stress disorder\"](_URL_2_). Another showed that chimpanzees [met DSM-IV criteria for PTSD and depression](_URL_1_). **Other Animals**: See [the Wikipedia article on animal psychopathology](_URL_3_) for an informal, \"non-exhaustive list of animal psychopathologies\".    **Controversy**: It is worthwhile to note that [“psychopathology is a somewhat problematic construct\"](_URL_0_) which \"is polymorphic and begs clarity as to which frame of reference is appropriate when using it\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there an abundance of black athletes in sports?",
        "response": "A lot of football and basketball players are black because these two sports are extremely popular in areas with traditionally higher black population (the South and urban areas respectively). On the flip side, there are very few black hockey players, swimmers, golfers, and lacrosse players, because these sports are either popular in areas with a lower population of blacks, or require significant affluence early in life to get into, something that unfortunately is not enjoyed by many black folks in this country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why children need to be \"protected\" from nudity and sexual scenes in media?",
        "response": "Mostly because children do not have the same forward thinking abilities as adults. If you expose a child to sexuality, they will become sexually active at an earlier age. Children however, don't have the foresight to understand how drastically sex can impact their life if they make a poor choice. Also, a lot of it comes from the Christian morality spectrum where sexuality is a deeply private thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the continent of africa seemingly in a perpetual state of war?",
        "response": "As far as I know, Africa on average is now more peaceful, wealthy and stable than at any time in the last ca. 70 years...  FYI: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes bad bacteria bad for your health, and why isn’t it bad anymore once it is killed. (But still in/on your body)",
        "response": "When they are alive they can do what they do to live in your body like feed on you or feed on other stuff in you and poop out poisonous things your body can't handle and also fight with good bacteria for territory in your body for more food. When they are killed they can't do what they do and your body's military, the immune system, can examine the parts and pieces to see how they tick and learn how to kill them better by learning their weaknesses and how to identify them from the other stuff in your body.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a spider successfully navigate a web made by another spider?",
        "response": "Personal anecdotes are discouraged, but as it is a question about the possibility and the thread is 2 days old: I have seen more than one spider move around in a single net. It is certainly possible. I don't know how common it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't HSV-1 transfer to other parts of your lip? Does genital herpes function the same way?",
        "response": "Herpes resides in your nervous system, not your lips. The infection you see as a cold sore is an inflammation response to a newly reactivated bit of virus at the tip of a nerve under the skin that colonizes some minor damaged tissue on the lips. The reason it is reactivated is not clear: herpes is usually dormant for awhile after infection then spontaneously pops up due to signals we don't entirely understand. It can cause sore on just about any place with lots of nerves or weak tissue, so it can get in the eyes or on the fingers.  But as for the reason it doesn't spontaneously shift it is likely the same reason you don't immediately get cold sores after your first infection: newly infectious virus particles don't cause immediate symptoms, and you already have antibodies and a latent infection. This is borne out by the fact that immunocompromised people do get long spreading lesions called \"knife cut\" lesions and potentially life-threatening outbreaks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How, why and when did India change from a culture that produced the Kama Sutra and even had carvings of sex positions on temples, to one in which sex is such a huge taboo to the point where it is so repressed?",
        "response": "As a parallel question, I would be interested in people explaining how much influence, if any, that Victorian moral influence had over South Asia during the period of British rule.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have diseases caused by recessive genes (eg. Cystic Fibrosis) not been evolved out of existence?",
        "response": "Because only having 1 of the recessive gene provided a resistance to Cholera, a very lethal disease. If your parents are carriers of the CF gene but don't have CF, that means they each have a dominant gene and a recessive gene. This would mean if they had 4 children, odds are 2 children are healthy and resistant to cholera. 1 kid has Cystic Fibrosis, and 1 will be susceptible to Cholera.  This is the same with sickle-cell anemia and malaria.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When boxers train by being hit in the abdomen with a medicine ball, does that force eventually tone the abs, or just help the boxers get used to punches?",
        "response": "its two-fold. you have the boxer do some sort of exercise that heavily targets the abdominals such as squats or hanging leg raises, then you hit them in the abs by either punching them or throwing a medicine ball at them while they are resting. this gets the person used to being hit in the stomach, and it forces them to keep their abs tight during these exercises so that they get more out of it. for instance you can squat without a braced core and your abdominal's don't get worked very much, but throw a twenty pound medicine ball at them and your core suddenly becomes very very braced (; source: dad is a retired boxer and on a state boxing commission",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is cancer incurable?",
        "response": "Cancer describes a cell or set of cells that is replicating uncontrollably in a malignant form. This is very hard to cure because there are many dozens, even hundreds, of causes and it can occur in essentially any cell in the body. There can be no single cure because of this nature and finding ways to treat the uncontrolled replication of these cells is difficult because to 'cure' it, every cell that is doing this has to be destroyed. Otherwise it will just return.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Muhammed Ali considered the greatest (or one of the greatest) boxers of all time if he lost five times?",
        "response": "From an article by Max Kellerman.  > The only heavyweight champion in history to beat more than one other great heavyweight in that heavyweight's prime -- and Ali did this several times when he was no longer at his best! Even if you take Joe Frazier and George Foreman and even Sonny Liston off his resume, Ali still has an argument for greatest heavyweight ever. He beat Floyd Patterson twice, Jerry Quarry twice, Ron Lyle, Ernie Shavers, Jimmy Ellis, Doug Jones, Ernie Terrell, Joe Bugner twice, Oscar Bonavena, and George Chuvalo twice. And this isn't even name dropping because I left out old Archie Moore and Zora Folley, and washed up Cleveland Williams and too many others to mention here. Between 1964 and 1967, when Ali was in his prime, he was the untouchable. Between 1970 and 1978, a faded Ali dominated the most talent-rich heavyweight landscape in history. _URL_0_ The ELI5 he beat a lot of the best fighters of all time while in their prime.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it theoretically possible to make a truth serum?",
        "response": "What you want is a drug that shuts down inhibitors that try to filter content. Alcohol already kind of does this along with another drug that I don't recall. It doesn't make you not want to lie, it just makes you see no reason you should be lying about it in the first place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some players of multiplayer videogames pay other people to play the game in their place?",
        "response": "This generally exists in two forms, Boosting and Grinding. With grinding, there is generally something in the game that is desirable but requires a large time investment. If a player doesn't have time, but does have money. He can hire someone to grind for him to get the big reward. This is more something for MMO's and the like. And then there is Boosting.  Boosting is done in competitive games. Where people are ranked on a ladder to show of their skill in comparison to other people. This is frequently tied to a reward every end of season when the ladder resets. Some people want the reward, but lack the skill to get it, so they hire someone that is better, to play for them to get the rank required to get the reward. Other players think they deserve to be placed higher on the ladder but poor teammates keep holding them back, or that it takes to much time to get that high. Other players just want to play with the pro's. so they pay a booster to get them higher on the ladder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question regarding spectroscopy on star light",
        "response": "In almost every single star, you are going to see spectra from Hydrogen atoms, as this is the main fuel source for the star. We already know what spectra it should be, and we also know that it most often will be at a slightly longer wavelength than expected (almost all stars exhibit red-shift) . We then take the difference between expected and known values for the H spectra and correct all the others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference between trade mark and copyright",
        "response": "From _URL_1_: \"Copyright is geared toward literary and artistic works, such as books and videos. A trademark protects items that help define a company brand, such as its logo. For example, Acme Publishing Company can trademark its name and logo, but would copyright books and videos that it created.\" Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Benefits and Risks of Hydrogen Peroxide",
        "response": "35% hydrogen peroxide is toxic if ingested undiluted. At lower concentrations ( > 3%) it is likely to induce vomiting. Other than that, all that will happen is it will decompose to oxygen and water, like the other commenter stated. It's not going to provide any benefits for Parkinsons disease.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain the weird sensation I often have after driving where I literally can't remember how I got to my destination. Is there an actual term for this or am I just crazy?",
        "response": "Yes, it's called highway hypnosis. The theory is that you kind of put your brain on autopilot because there's so little going on and so much of it is muscle memory. Your brain splits its consciousness and assigns just enough to drive and the rest thinks about other \"more important\" stuff. As you can imagine, this is pretty dangerous. You really should be paying attention to driving because unexpected things can and do happen that could put your life (or others) in serious danger. But it's an unconscious thing. Still, you should try to stay focused on the road as much as possible. ~~I have heard, but I can't substantiate, that highways in the US by law must have a gentle curve every so many miles just to try to break the monotony and make highway hypnosis a little less likely to happen.~~ [At least some roads have been designed with highway hypnosis in mind and deliberately built with variation in the road](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are processed carbs like white bread and white rice considered so bad for you?",
        "response": "Processed aka simple carbohydrates are very quickly and easily broken down into simple sugar molecules. Excess sugar is stored as fat. Whole wheat sources have carbohydrates in them, but they also have a lot of fiber. Fiber is what we call the parts of food that your body can't digest. Those calories aren't absorbed by your body. Instead, they are just move through your digestive tract and make it easier to poop. In white bread, a lot of the fiber is removed by a machine in the production process. It costs more energy to break down complex carbohydrates. 1 gram of carbohydrate has 4 calories in it, but you have to spend more calories to break down the complex carbohydrate than you do for simple carbohydrates. Aside from the benefits of fiber, quantity will always trump anything else when it comes to weight loss. There is nothing unnatural about white bread or white rice, it's like eating an apple that has the skin pealed off. As long as you eat a properly sized portion you should be fine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my USMC dad hate Gen MacArthur?",
        "response": "There is a lot of institutional resentment for MacArthur among marines for his actions in the Korean War as well, in particular his placing the First Marine Division under the command of Ned Arnold for the amphibious assault at Inchon, and the series of dubious orders given to it afterwards that led to the Marines being surrounded at the Chosen Reservoir.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are land mines placed without triggering them to go off?",
        "response": "Well there are a number of different forms of mines but I presume you're referring to pressure sensitive or release pressure anti-personnel mines. While the exact nature of it will vary from model to model generally a landmine will have some form of safety pin and/or a cap that is placed over the pressure sensor. The sapper will position the mine, conceal it if deemed necessary/possible and then remove the safety devices. When laying a minefield this will be done systematically while moving across the area with set lanes that are free of mines to allow friendly forces to move through the area where necessary with the pattern of mine distribution being recorded.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can Wikipedia sue the NSA and what are they suing for?",
        "response": "Wikipedia is not suing, but the non-profit Wikimedia (which owns Wikipedia) is. They are not alone either: they are joined by 8 other groups (such as Human Rights Watch) in filing a complaint against the NSA and specifically those who are in charge of the organization. The claim is that the NSA monitors internet traffic from mainstream data lines (like what cable companies use to transport data around the country, as well as between them). If internet data is treated as personal property, the NSA would be in violation of the 4th amendment (unreasonable search and seizure). So why specifically Wikipedia? The knowledge that the government could be receiving data and use that against an individual can prevent that individual from contributing. Obviously, this is against Wikipedia's interests in being a crowd sourced encyclopedia. Edited for forgotten source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people look to government to lead the way in an attempt to halt climate change?",
        "response": "> Is it just that everyone things that the issue is too big for them to do anything about it solo? Yep. The scale of the problem combined with the fact that addressing climate change in a meaningful way means that a lot of people are going to have to pay a lot of money (it's actually more accurate to say that they're unlikely to see the degree of growth they'd like to see) means that it's basically a problem that can only be addressed by the government. It's a classical tragedy of the commons situation: it's more profitable for any individual (or corporation) to continue consuming energy and releasing carbon at current rates than it is for them to transition to more eco-friendly technology, even as the world is being destroyed by everyone doing it. Which means that you can't rely on the free market and the profit motive to fix the problem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the difference nutritionally between artificial and natural sugars, like why are the sugars from my apple any better for me than the sugars from my apple lollipop if it’s all still sugar?",
        "response": "Well there's not a chemical difference between the fructose in the apple and the fructose in the lollipop. There are two reasons the apple is better for you. 1. The apple has some vitamin C and probably others 2. The apple has dietary fiber and other complex carbs, which will lead to a smoother blood sugar curve than if you ate the same number of calories in lollipop form.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are skin tags formed?",
        "response": "Yarr! Yer not alone in askin', and kind strangers have explained: 1. [ELI5 how skin tags are formed & why are they usually found in armpits? ](_URL_4_) ^(_3 comments_) 1. [ELI5 What are skin tags and why do we get them? ](_URL_5_) ^(_33 comments_) 1. [ELI5: What are skin tags, how/why does the body create them, and what's the best way to remove them? ](_URL_0_) ^(_3 comments_) 1. [ELI5: Why do we get things like skin tags and new moles as we get older? ](_URL_1_) ^(_1 comment_) 1. [ELI5: Why do we get skin tags when we're older? ](_URL_2_) ^(_70 comments_) 1. [ELI5: What causes skin tags, moles, and warts? ](_URL_3_) ^(_1 comment_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the human ear have a flat frequency response? Or do we perceive certain frequencies louder than others?",
        "response": "Not very flat. In addition, human perception is scaling differently for lower and higher frequencies, see: _URL_0_.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why don't they just artificially inseminate pandas?",
        "response": "From what I have heard, the lady panda can only have babies when they are ready, kind of like a dog, but it's not something you can put on a calendar. You have to warm her up, light some candles, toss them a few watermelon icey pops, and show her thousands of hours of panda baby-making movies. When she is ready, they carefully attempt an artificial insemination, but sometimes doing that gets her out of the mood. We haven't found a lady panda with an alien abduction fetish, but once we do, we'll be wading in baby pandas. Source: saw a documentary on Netflix about a year ago",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do skyscrapers slow down the earths rotation?",
        "response": "In theory yes, but by an immeasurably small amount which is overshadowed by existing changes to Earth's rotation such as tidal forces. The Earth's moment of inertia about its polar axis is about [8.03e37 kg m\\^2](_URL_0_). The mass of the [Burj Khalifa](_URL_1_) is about 5e8 kg, and its height is 829 m. If we place a similar building at the equator and consider it to be a uniform rod, it increases the moment of inertia by about 2.8e13 kg m\\^2, which is about 24 orders of magnitude smaller than Earth's moment of inertia. This would correspond to a change in rotational period of about 10\\^-20 sec. For reference, the day length is currently lengthening by about 30ns per day due to tidal interactions with the moon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people with british accents seem to lose their accents when they sing?",
        "response": "It's not unique to British people, it happens with basically all accents. An accent is mostly someone putting different stresses on syllables and using a different pacing/rhythm than we're used to. When singing, these (and many other factors that determine accent) are dictated by the song, and deviating can mess up how the lyrics pair with the melody. That means they switch to a more neutral way of speaking, which just happens to be really similar to what we consider to be the standard \"American\" accent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What effects did Charlemagne's rule have on later European history?",
        "response": "Related question, where did the myth that Charlemagne is not dead but actually sleeping, waiting for the rise of the Anti-Christ to awake come from?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Everything about Virtual Water",
        "response": "It's a term used to describe the movement of water as embodied in food and other consumables.  For example, an average beef cow might require about 10,000 gallons of water per year. It's slaughtered at 4 years old, and turned into 500 pounds of meat. Each pound of meat then represents 80 gallons of \"virtual water.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do solar panels turn light into energy?",
        "response": "Solar panels turn light into *electricity.* That's an important distinction. The short answer is something called the *photovoltaic effect.* Put simply, shining light on a particular type of material liberates electrons from the atoms in that material, causing them to move about. Moving electrons is electricity. (Sorry, said \"photoelectric\" originally, should've said \"photovoltaic.\" It's going to be one of those days, apparently.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are Sociopaths inherently malicious?",
        "response": "Sociopathy is not classified in the DSM-V, and is the most misused term in armchair psychology especially when considering it's pervasiveness though out internet culture.  Perhaps what you are looking for is Anti-Social Personality Disorder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't dictionary pronunciation guides use phonetic keys instead of... I don't know what the hell those things they use are.",
        "response": "Can you provide some examples of what you're talking about? I am very confused.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes \"outlet mall\" stores different than regular retail stores?",
        "response": "Historically, outlet stores sold factory seconds. This varied from company to company, but it would usually be a mix of returned merchandise, \"irregular\" items and last-season's/discontinued items. These were all things that the company didn't want associated with their brand, but still wanted to try to recoup some money on. That was a while back, though. Now, outlet mall stores sell merchandise _specifically_ created for those outlet mall stores. You may see a bit of the above categories there from time to time, but most of it is specially created (usually at lower quality) to sell in outlet malls.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does vacuum-energy exist? How can nothing have some energy?",
        "response": "Well any theory that predicts a non-zero vacuum energy also predicts that the vacuum itself has a complex non-trivial structure. Like the vacuum of quantum electrodynamics for example. It can fluctuate, it can interact, it can become polarized. It is also worth pointing out that from this perspective the vacuum isn't \"nothing\" but rather the situation where all quantum fields are in their lowest energy state.  These vacuum states of fields have both energy and fluctuations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What popular language has the most sounds?",
        "response": "It depends a lot on what your definition of 'popular' is. There are a couple of databases that give languages with their segment counts and inventories, but you might check out [PHOIBLE](_URL_0_), the Phonetics Information Base and Lexicon. You can sort languages by the size of their consonant, vowel, and tone inventories (but not, peculiarly, by their total inventory). If you click on a language name, you'll see what sounds it has; you can click on the sounds to see what other languages have them, though you'll have to copy-paste them into your browser's search bar to figure out what they are if you don't have a decent grasp of the International Phonetic Alphabet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do towns have the population listed on road signs?",
        "response": "Depending on where the town is located, that could be the law. It is also a point of civic pride. When the city I live in hit 100,000 people they made a big deal about it everywhere. It can also be helpful information for the traveling public. Town of 500, you'll be lucky they have a gas station. Town of 20,000, they likely have a real emergency room and lots of places to get gas, get something to eat, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people care about the sex lives of politicians?",
        "response": "The most commonly cited reason (besides we don't like people acting ways we consider immoral) is that a politician who isn't even able to meet the trust of their spouse isn't trustworthy enough to respect citizens they don't have to look at face to face. Also, being involved in things you're embarrassed enough about to cover up means that it would be easy for you to be blackmailed, which is definitely not good for the people you are supposed to be representing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Mathematics: Given a set of outcomes, and an infinite number of trials, what can we say about the certainty of at least one trial producing a given outcome?",
        "response": "As long as the probability of each event p1...pN is greater than zero, you can say the probability of each of those events occurring at least once in an infinite number of trials is 1. However, this is not the same as being able to say \"with certainty\" that each outcome will occur at least once. The distinction is between an event happening [almost surely](_URL_0_) and an event happening surely. In short, you can say that it has a 100% probability of happening but not that it is assured to happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Trans Pacific Partnership, and why should I be concerned?",
        "response": "* From what I understand, TPP sets up an international court headed by other corporation heads and former world leaders, that allows corporations to sue nations over laws that effects the suing corporation's profits. If found \"guilty\" the nation may be required to recoup the profits and overturn the laws.  * Another problem is all we (the people) know about TPP is from leaks because the trade agreements are being made behind closed doors.  * Also, in the US, President Obama is trying to fast track the bill passing the trade agreement that some argue that won't give the Congress enough time to read the bill. * Another rumor I've heard this that SOAPA and PIPA are in the trade agreement but I haven't read that. * I have only read a little on in but a TL;DR would be: Smart people are scared of it, it's super shady, only things we heard about it only seem to represent corporate interests.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what does a music producer actually do?",
        "response": "As a guitarist, I know all the licks and how to play them and make them sound good. When I go into the studio, the producer basically tells me which licks he thinks will work on the song and where to put them. He might not be able to play those licks himself (thats why I am there) but he knows what will sound good and fit the song. Thats a very basic explanation of what goes on. Think of it as an architect designing a whole building and telling the painters what color and style he wants the exterior.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Because light has momentum, can it move an object with a defined mass?",
        "response": "Yes. Solar sails have been used to transfer momentum from light to spacecraft. The Mariner 10 used radiation pressure on its solar panels to adjust its attitude, and the JAXA IKAROS spacecraft utilised a solar sail as propulsion.  The amount of propulsion provided is minuscule, but it would be useful for extremely long journeys.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is dust?",
        "response": "Dust is made of fine particles of solid matter. On Earth, it generally consists of particles in the atmosphere that come from various sources such as soil, dust lifted by wind (an aeolian process), volcanic eruptions, and pollution. Dust in homes, offices, and other human environments contains small amounts of plant pollen, human and animal hairs, textile fibers, paper fibers, minerals from outdoor soil, human skin cells, burnt meteorite particles, and many other materials which may be found in the local environment",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does red print appear to move on a blue background?",
        "response": "It's due to chromatic aberration of the lens in the eye. No lens can avoid chromatic aberration entirely: different wavelengths are bent slightly differently by lenses. In human perception, the effect is known as [Chromostereopsis](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some grapes seedless and other seeded? How did they get the seeds out?",
        "response": "You can breed grapes and many other fruits to have no, or only vestigial, seeds. You have to propagate them by cuttings. It doesn't need GM. Bananas are a major example. The variety that most of the world eats have had seed production bred out of them. As such, all plants are clones and if a virus struck, it's going to be very difficult to produce another strain that the virus doesn't affect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people feel chills or get goosebumps while listening to music/singing?",
        "response": "When you reach a bit of a song that gives you chills, your brain is flooded with a chemical called dopamine, which gives you the sensation.  Dopamine is the chemical that's responsible for making you feel good, and it floods into the area of brain known as the striatum, which is responsible for feelings of motivation, and addiction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have the USA and France Ever Been at War?",
        "response": "Not a declared war, but in the very early history of the United States there were substantial tensions between France and the US that resulted in the [Quasi-War](_URL_0_), which mostly played out in encounters between the French Navy and American shipping vessels (and, later, American Navy vessels). The XYZ Affair occurred during the Quasi-War as well. There were other occasions of diplomatic tension between the US and France as well, but I believe that was the most serious.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If HIV is the destruction of white blood cells and leukemia is the overproduction, can't a middle be met to solve both of these illnesses?",
        "response": "Well, it's not that simple. Not all white blood cells are the same. HIV primarily attacks T-cells, thus sabotaging a vital part of the immune system. Making more T-cells would merely result in more virusses, as the virus reproduce in these cells. Leukemia results in the overproduction of white blood cells, but these are damaged and often non-functional, depending on the specific cancer. In addition, various leukemias produce various immune cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the camera on my phone recognize a QR code?",
        "response": "It isn't your camera exactly, it's the software. It starts with a recognition algorithm which recognised all the different types of QR's, it then parses it into a grid whose individual squares equate to a 1 or 0 (black or white, obviously). These individual bits create bytes which, after some decoding, equate to a URL and page index, then the software instructs your browser to access that page. In addition, some QR's contain a command byte which tells your browser to do a certain thing, which could be an instruction to retrieve a certain picture, video, pdf or suchlike.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people hide their license plate when selling their vehicle but not always their VIN?",
        "response": "The VIN number only shows who manufactured the car and what model it is. The licence plate tells you what state the car is in and, if someone is thorough, it can reveal the location. You don't want randoms knowing where you live.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is lean mass and body fat percentage and why is it talked about so much?",
        "response": "Talking about someone's overall weight isn't a good way to measure how healthy they are, or how much fat they're storing, because muscle mass, height, and genetics play a component in how much you're going to weigh. Body fat measurements are important to understanding how overweight someone is because someone who has a lot of muscle mass and very low body fat will still have a high BMI reading because BMI doesn't discriminate between fat and muscle, and is just a product of height and weight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Any Explanation for Göbekli Tepe?",
        "response": "If you are genuinely interested in the epipaleolithic/pre-pottery neolithic transition and the ancient near east, you might want to start with Ancient Turkey, by A. G. Sagona and Paul E. Zimansky, 2009. Of interest might also be J. Cauvin's 2001 The birth of the gods and the beginning of agriculture. More specific to the Natufian culture, you might want to have a look at the various books and articles by Ofer Bar-Yosef. For Gobekli Tepe specifically, the primary reports are by Klaus Schmidt, though his focus on the single site might be less helpful if you are looking for contextualisation. To understand Gobekli Tepe it is also fundamental to look at Nevali Cori (excavated by Harald Hauptmann). This site is more 'complete' in its assemblage, though less famous. Have fun exploring, the earliest neolithic is a fascinating period.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the moon look larger and yellower on some days?",
        "response": "When it's closer to the horizon, it's an optical illusion. It looks really large because there are other objects in the field of view to compare it with. The yellow/orange coloring is just light distortion from the atmosphere. The next time you see that the moon looks large, take a picture of it with your phone and look at the picture. You'll notice that it doesn't look as large as how you see it with your eyes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come colleges can offer degrees that they know are worthless and no one demands these colleges stop this practice?",
        "response": "because no ones mandating that a degree have relevance to a career. If you are independently wealthy and want to learn these things, thats your prerogative.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can the energy of light be turned into mass?",
        "response": "Yes. Very high-energy gamma rays can spontaneously produce a particle-antiparticle pair (usually an electron/positron, but heavier particles are possible too). It has to be energetic enough to have the mass-energy of the resulting particles, so in practice this doesn't happen for visible light (whose photons have less than 1 in 100,000 of the mass-energy of an electron and would have to produce lighter particles like neutrinos).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is a sound made when hitting an open ended pvc pipe?",
        "response": "The pipe is hollow and the plastic itself is thin enough to reverberate when struck. These reverberations are the sound that you hear.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do scientists determine the calorie content of a food item? And the nutrient content?",
        "response": "They literally burn it, as far as I can tell. We got to do this in Chemistry with Pringles and a can of water suspended above the burning Pringles. We used a butt load of foil to direct all the hear towards the can.  _URL_0_ Edit* My guess is that they use lasers to burn a piece and then measure the heat given off. As far as nutrient content I am not sure of the methodology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly happens in the brain during a coma?",
        "response": "The conscious mind (essentially all that is you) shuts down for some reason, be it physical damage or a bodily response to something. Processes tat run in the background (Breathing, heartbeat, digestion, etc) all run normally (most of the time.) It's basically just sleeping, but for longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's at the center of Jupiter?",
        "response": "That's hard to answer because current models are bas on estimations and computer calculations. The best model suggests, that jupiter has a inner solid core made of iron and therefore siderophile metals aswell and sillicate rock. It is surrounded by by an also solid layer of hot ice.  These are the main ingredients. However, as denser material tends to think to the core, you will probably find almost the whole periodic table in the core of jupiter, either the siderophiles combined with the iron and all other others in the rock. Only the noble gases won't be there as the neither tend to combine with metals nor rock.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is \"the right to remain silent\"?",
        "response": "If you are arrested in the U.S., you have the right to not answer any police questions and not be punished. As a matter of fact, it is best to not answer any questions without a lawyer that is working for you present, so that the police don't use your words against you in a court of law.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are hockey fights allowed to happen, but fighting is stopped ASAP in all other sports?",
        "response": "The short answer: Hockey's approach to fighting is to let the combatants unload all of their aggression on each other at once - as opposed to having it draw out for entire game in potentially more dangerous forms such as: head shots, boarding, spearing, clipping, etc..   I won't provide the long answer but it has to do with the speed of the game, adrenaline, the presence of sticks, and the roles of enforcers and super stars.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does Russia (and other countries) gains from being part of the G8?",
        "response": "G8 is basically a meeting of the most important industrial Nations to get together talk strategie make deals... So everyone benefits who is part of. But as far as I know it is less formal than the G20.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does \"points on the back end\" mean when it comes to an actor's salary?",
        "response": "Most of the time an actor gets a flat fee for their work. Taking points on the back end means that instead of only getting that fee they also get a percentage of the profits the project generates. Normally this also means they reduce their upfront fee.  Actors will do this if they think the movie will be very successful, or if they really want to do a project but said project cannot really afford their normal rates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In David Attenborough documentaries, how do they get the camera inside each respective insect/animals home?",
        "response": "If you have the DVD/Blu-Ray sets, watch the behind-the-scenes extras.  These nature photographers spend months and months working to catch the perfect moment (really makes the viewer marvel and appreciate their contributions to public knowledge).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does fluoride strengthen teeth?",
        "response": "Bacteria damage your teeth because their waste products make your saliva slightly acidic. The primary mineral in your teeth, hydroxyapatite, is very durable, but dissolves at those acidities.  Fluoride ions replace the calcium atom in hydroxyapatite, creating fluoroapatite. Fluoroapatite is slightly less durable than hydroxyapatite, but it requires a stronger acid to dissolve. Thus, it's not damaged by the weak acidity in your mouth. Modern diets put much less mechanical stress on your teeth than they're capable of taking (you aren't cracking open bones to eat the marrow, for instance), so somewhat weakening your teeth in exchange for acid tolerance is an overall benefit. [(Source)](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So I know glass is not actually a super-viscous liquid, but are there any liquids that actually exhibit this property?",
        "response": "Some forms of asphalt (much like pitch) appear to be solid but have viscosity. Our materials professor took a chunk of asphalt at room temperature broke it with a hammer into shards then put the shards in a pan on top of a mushroom shaped piece of metal (think a cake stand but about 2 inches tall and 4inches in diameter). We came in the next day and the asphalt had flowed over the metal stand and created basically an asphalt umbrella that felt solid and could be broken again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we track launched missiles yet lose passenger planes?",
        "response": "When a missile is launched there is lots of attention on it but with thousands of planes in the air at any given time you can't have multiple satellite pointed at all of them all the time. If you had a dedicated satellite array that focuses on one plane you wouldn't lose it either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is determinism?",
        "response": "[Determinism](_URL_0_). Simplistically explained, its that every single event (human actions, natural disasters, seemingly random events, *everything*), is the only event that could have happened, and it could not have happened any other way. There is no free will, no room for intervention, and no chance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the moon were to suddenly disappear, how would it affect earth?",
        "response": "[The moon also stabilizes the Earth's axis of rotation](_URL_0_). That's pretty critical, not least of all for keeping climate relatively constant in different parts of the Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it possible for a particle which is quantumly entangled to another particle to \"know\" at FTL speed about a change happening to its twin?",
        "response": "Here is an analogy: Rotate the tires on a bicycle so that the inner tube nozzles are aligned in some way, such as both of them pointing up. As you ride the bike around, you will have no idea where the nozzles are pointing because you can't see them as you ride. As soon as you stop the bike and measure one tire, you will immediately know which orientation the other nozzle has, without looking at it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The meaning of \"Non-Binary, they/them\"",
        "response": "That if you refer to them in the third person, you should use \"they/them\" instead of \"he/him\" or \"she/her\". When they put that in their profiles, they are basically asking you to do that. Before you ask, yes, \"they/them\" is a grammatically acceptable use of a third person singular pronoun. However, it is typically used to refer to a wholly unknown, hypothetical person, for example, \"If a patient walks through your office, guide them to the front desk\". It's unconventional to use it to refer to a particular specific person but not, strictly speaking, incorrect as it is the closest thing English has to a third person singular gender neutral pronoun that could be compared to third person singular gender neutral pronouns found in other languages. Certainly less of a headache for editors compared to recently invented pronouns like 'zhey'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the process of suing work? Can anyone sue anyone for anything?",
        "response": "Technically, yes, you can sue anyone for (almost) anything, but whether or not a judge will actually want to hear it, is another story.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why it is so difficult to pronounce a word in a foreing language even when we are trying to imitate other person?",
        "response": "In my own experience learning to speak Korean was difficult because the Korean language has sounds English doesn't and vice versa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a battery is at 50% will it still output the same voltage? What about amperage?",
        "response": "Every battery chemistry has different discharge characteristics. [Take a look at the discharge curves on this webpage](_URL_0_). Notice how some are 'flatter' and some slope gradually down. But in general, a battery's voltage is roughly constant until it's mostly discharged, at which point its voltage will drop quickly. The reason is that a battery's voltage is a result of the particular chemical reaction that powers it, which will be the same until the reactants are depleted. (Capacitors, on the other hand, have a voltage that is directly proportional to their charge, because they are electrostatic devices, not chemical devices.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans get the urge to urinate when frightened or nervous?",
        "response": "Its not an urge its loss of control over those muscles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the consequences of not ingesting the essential vitamins and minerals the human body needs?",
        "response": "The exact consequences depend on the nutrient. [Wikipedia](_URL_0_) has a good overview of the more common ones. Only a few are fatal, and even then only in chronic, long-term cases, and they're almost all reversible. A professor of mine used to tell a story about raising chromium-deficient rats for a study, and having to handle them with sterile procedures because there was enough chromium on the skin of the researchers to prevent deficiency symptoms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Chile shaped so oddly? ( i.e Why is it so long and narrow?)",
        "response": "It's borders almost exactly match the former captaincy general of Chile. If you look at the former Spanish administrative areas, they almost all have the same shapes as the current nations of South America. When they became independent, they merely kept the same territories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come all Icelandic names seem to end in sson?",
        "response": "Icelandic people don't have last names. They are known as \"(Name), son of (father's name)\" or \"(Name), daughter of (father's name)\". Their population is small enough that they can do this without too much confusion. So if you were Magnus, and your dad was Bjorn, then your full name would be Magnus Bjornsson. And your son Olaf would be Olaf Magnusson.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When an electronic video camera is struck, jolted, or involved in an impact, why is there noticeable distortion?",
        "response": "Without knowing the specifics behind this camera setup I'd say that this camera uses a mechanical rolling shutter. That is, the whole frame isn't exposed at the same time but the the frame is exposed linewise. When the camera gets jolted with enough force the exposure mechanics is unable to properly expose the currently relevant lines, giving them such bad readings that either the camera or the encoder determines that these lines are just noise. The lines are thus filled with placeholder values (the green).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why aren't gas planets with a rocky core (like Neptune is believed to be) considered rocky planets with a giant atmosphere?",
        "response": "The astronomical definition of a \"planet\" does not specify whether the body must be only rocky, only gaseous, or some combination of the two. Neptune's core is much smaller than its atmosphere by volume, so discussions of Neptune tend to focus on its more dominant characteristics, the gas atmosphere and very large ice mantle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do whales and dolphins sleep?",
        "response": "_URL_0_  That episode of radiolab is very interesting and the first section talks directly of how dolphins sleep.  TL;DL - Their brains are a bit more divided than ours (left/right) and they put one hemisphere to sleep at a time, while the other hemisphere functions enough to just keep them surfaced and breathing. They call it logging since they just kinda float there like logs. They then switch hemispheres. Its been a while since I listened to the podcast and I'm sure someone else can come along and give a better/more specific answer, but seeing as its been 4 hours without any responses, I thought I'd take a crack at it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are pelts worn with the fur outside?",
        "response": "Its the same reason that fur on the animal is on the outside. The fur can catch moisture and snow and hold it away from us, so that it doesn't melt and then freeze like it would on cotton or wool clothing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did prehistoric humans do daily hygienic activities?",
        "response": "One of the few things known about prehistoric grooming habits is that people over a wide spread of places and environments used [ochre pigments](_URL_0_) to cover themselves. It provided Sun protection, allowed for tribal and personal decoration, and might have concealed odors to some extent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were we able to work out that a spaceship could travel on top of a Boeing 747 ?",
        "response": "Maths. First you calculate the mass of the orbiter and determine if the structure of the 747 can accept the additional mass. It couldn't, so NASA added strengthening struts to the airframe. Next you use maths to see what the additional drag would be, and that would mean to fuel consumption and altitude restrictions, more fuel needed? Do we need to adjust the Airframe? Once all the modeling has been done you will then have a series of test flights, and proof of concept before you get near a real flight. Edited: mobile spelling mistakes",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do antidepressants such as Prozac help major depressive disorder?",
        "response": "The major theory is that depression is caused by (or results in) an imbalance of chemicals (neurotransmitters) in the brain. All antidepressants work by increasing the levels of these chemicals in the brain, by different mechanisms. Most evidence suggests serotonin is the most important neurotransmitter involved in depression, although there are others such as noradrenaline and dopamine. Prozac (fluoxetine) belongs to group of antidepressants called SSRI's, or 'selective serotonin uptake inhibitors'. This means that is more selective for serotonin than older antidepressants were. It stops serotonin being reabsorbed when it is released, so it hangs around for longer and can have an effect for longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does music/certain songs give you energy?",
        "response": "What you think of as 'energy' is really controlled in your brain by many different chemicals. You can think of these chemicals like gasoline in a car (although some of them are more like the brakes in a car). So when something exciting happens, your brain triggers the gasoline (dopamine, epinephrine, serotonin) to release and it does things like make your heart go faster, make certain parts of your brain responsible for pleasure work harder, etc. We don't really know specifically why certain combinations of musical notes tend to do this for people but it has something to do with association of these combinations with memories that were created when we were very young. We know this because the musical notes that make people in the west feel stimulated are different than those that make people in eastern countries like Afghanistan and China. There is probably SOME genetic factor involved but a lot of it is learned after we are born.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an avocado pit keep an avocado green even when removed and stored loosely in a container. What's the pit doing?",
        "response": "It doesn't. The only way to keep an avocado from going brown is to cut it off from oxygen. Or purge your fridge and fill it with nitrogen.  The pit helps when left in the cut half because it's keeping a percentage of the surface area sealed away from oxygen. The concept of it doing anything to help when left loose nearby is nonsense. You'd be just as well off picking a rock out of your garden, scrawling \"Avocado Preserver\" on it, and keeping that in the container instead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you get cooler/colder when you get wet?",
        "response": "when you get out of the pool, the wind blows on your wet skin and that creates a low pressure area that makes the water evaporate, and any process of evaporation is endotermic, meaning it absorbs energy",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can the President go into a \"war\" when so many people are opposing it?",
        "response": "First off, even if congress votes no, the president can still okay the strike that has been proposed. What he is proposing is not \"war,\" but a limited missile strike. Yes, people have different definitions of what war is, but in terms of the law, the president has the authority to okay limited military action. In terms of the consequences, I am positive he and his advisors have considered every outcome and consequence. He isn't seeing this as a war to get involved in; he sees the chemical weapons use as a blatant disregard to humanity and the wishes of the world (98+% of the world has banned the use of chemical weapons) and that a limited strike against the regime would put an end to the use. Of course, the use of military force could backfire, but not doing anything could also backfire. This is a lose-lose situation for the world, and the president is weighing his options and choosing the options he feels is the best for the Syrian people, US and its allies, and for the world in general.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does washing produce reduce its shelf life?",
        "response": "Produce is often shipped with a thin layer of food grade wax on it. This wax helps inhibit oxygen absorption to slow rotting, and also acts as a barrier to keep out pests.  Once you wash this wax off and the produce is allowed to absorb oxygen it begins to rot quicker. Also, certain things like tomatoes, peppers, and cucumbers give off ethylene gases which can cause surrounding produce to rot quicker.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When Money is Destroyed or Lost (I.E House Fire/Tossed into Ocean) What Happens?",
        "response": "The government prints a certain amount of money every year to account for the money that is lost / destroyed / too damaged to be continued to use. Every government does this. Printing money like this is no problem. It only becomes a problem when you are printing more money than is naturally lost. (which would lead to increasing the money supply which would lead to inflation)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are sportspeople more likely to get injured now compared to decades ago?",
        "response": "Higher speeds and more wear and tear are the two major reasons. Think of this for a young pitcher. Back in the day he'd pitch a couple months during high school and then either go to the minors or college. Now kids have their high school teams and travel teams that play year round. So they're burning through their arms 4 times faster before the games actually mean anything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a second eye provides vision for depth, what would a third eye provide?",
        "response": "A possible use for an extra eye in a human could be as a specialised eye that is different to the other two; an eye that can see well underwater, in low light, as a close-range magnifier, or in a different wavelength to the other eyes. A simple 'motion detector' eye on the *back* of our heads could be useful sometimes. The fact that these kinds of extra eyes are not naturally occurring in mammals would suggest that either they aren't all that useful, or that it's evolutionarily difficult.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are people who are addicted to prescription pain meds addicted to the chemical, or the effect? Could an addict use one to substitute the other, or would their body go into withdrawal?",
        "response": "Opiates are quite interchangeable, the effects of morphine resembles that of heroin, resembles that of oxycotin etc. Where they primarily differ is their length of effect and strength. There are some which are different, like say Tramadol, which is also a mild serotonin released, but generally yes they can substitute and addicts often do, they will try anything to alleviate the craving, from codeine to poppy seed tea. Heroin addicts are treated with methadone, which lasts longer than heroin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do your fingers shrink in the cold?",
        "response": "Your body closes off loops of blood vessels in your skin to prevent heat loss, and redirects blood flow to keep it in your warm insides. With less blood filling the skin, the skin lets a little smaller. This is one of the ways your body keeps your temperature even.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people find sunsets attractive/romantic?",
        "response": "Where I'm from, the sky changes colours quite dramatically during the sunset. There's streaks of pink, orange, red, painted all across a the blue sky in a completely unique way each and every time. These overlapping colours create some of the most beautiful contrasts I've ever seen in nature. While they're sometimes similar, no two sunsets will ever be quite the same, just as no two days will ever be exactly the same. And to make it even better, it takes nothing more than to look outside, no matter where in the world you are, to be able to see it. We all get to see it, every single day.  I suppose there's just some sort of beauty to be found in what is unique. It connects us with the fact that time is constantly flowing, and we're along for the ride whether we like it or not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are genetic/hereditary diseases that prevent people from having children still around? Shouldn't they have been eliminated due to the fact that those who have such diseases are unable to have children of their own to pass the disorder on to?",
        "response": "The key term here is recessive. Recessive disorders have carriers, who hold the gene but do not exhibit the symptoms due to a dominant gene blocking it, but when two carriers have a child, their child has a 25% chance (in the case of a single allele disorder) of receiving the recessive gene from both parents. This causes them to exhibit the symptoms of the disorder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does your body use more or less energy when it is sick?",
        "response": "I know from a physics standpoint that if you have a fever you are burning more energy.  It is also not unreasonable to assume that the inflammatory and immune responses consume more energy than normal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Looking for a citation: Intellectuals in Victorian England loved to classify/categorize EVERYTHING",
        "response": "If you want an example of Victorian classification (though not about 'everything') then maybe have a look at the Pitt Rivers Museum (of anthropology) in Oxford. It's orgainsed as it was in Victorian times, with objects sorted by use, not chronology or place of origin.  I can't help so much with rooms of the house etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What gave Richard I 'The Lionheart' of England an enduring popular reputation when he barely even spent any time in England?",
        "response": "During his 10 year reign, Richard spent only 6 months in England. However, Richard took the cross and joined the Crusades, forever making his mark as a champion of Christianity. Better yet, he secured England's French territories by persuading King Philip II of France to go with him. On top of that, Richard's masterful evasion of John's schemes for the throne made Richard seem politically skilled and set John's course as \"the villain.\" Also, John was hardly a competent administrator. He arranged the murder of his nephew Prince Arthur because he was a threat to his throne, and John lost the Angevin Empire. Honestly, the Magna Carta is really the only significant achievement to come from his reign.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What benefits and disadvantages does Daylight Savings Time provide, economically?",
        "response": "Daylights savings was not created for economic reasons, it was mostly so that people could have daylight time after their work shifts ended. But there have been economic advantages since it's original conception. The biggest being that power consumption is lower if it's light out later, though not as big on an issue now days with LED lighting. And more recently it may help in the aspect that more waking hours are able to be covered by solar power without external storage. The biggest disadvantage is that it is not a global standard, so there are issues with commerce across long distances if times are different. There are actually other ideas to help with commerce in this respect such as a true [Universal Time](_URL_0_). edit: So today it doesn't do much for energy usage, but that was what it WAS used for in the US.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the west coast state lines pretty much straight lines and east coast aren't?",
        "response": "It's very complicated, it's mostly because of natural landmarks like rivers or mountians, but it's also very very political. A great series on History Channel, yes that history channel, called \"how the states got their shapes\" goes into great detail on almost all the states and how they got their shapes. A great watch. I think most are streaming free: [HERE](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many people recommend \"no-kill\" shelters for adopting a pet? Isn't it better to adopt from a \"kill\" shelter - you're actually saving a life?",
        "response": "Because if I went to a kill shelter with the wife, she'd realize all of the animals would die if not adopted, and my house would become a zoo...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is caffeine in coffee different to the caffeine in tea?",
        "response": "The caffeine in tea and coffee (and cola, etc) is the same substance. There are different amounts of caffeine in different types of teas (and different types of coffee drinks, too), however. Some drinks that we call tea are not actually made from tea leaves and have no caffeine at all in them (herbal tea, for example). Perhaps you just drink a weak and heavily diluted tea drink, which when compared to a regular or strong coffee drink might seem like it has much less caffeine (because it does).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some car companies limit the speed of their cars to 250 km/h(155 mph), even though the cars are capable of higher speeds.",
        "response": "As far as I'm aware it's a German gentleman's agreement (an informal and legally non-binding agreement between two or more parties, according to Wikipedia). BMW, Audi and Mercedes-benz (the three manufacturers who created the agreement in the first place) are all German car manufacturers; a country without speed limit on most highways (*Autobahn* in German). The agreement exists to reduce the risks of fatal collisions, according to the car manufacturers. In reality it's to prevent government regulation, and it's probably one of the reasons the Autobahn is still one of the few roads in the world without a speed limit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did early Christians celebrate Mass?",
        "response": "> especially since there was no universally recognized Bible for centuries I don't know much about the rest of your question, but I wanted to address this. While the group of books we consider the canonical Bible is not solidified before the fourth century, that doesn't mean its springs out of a vacuum. The texts that are in the Bible made it into the 'final draft' so to speak because most people *already* thought they were canonical. The texts were being used widely for a long time before, the four canonical gospels from the early second century and the Pauline letters from the mid to late first.  Intro reading: * Bart D. Ehrman, The New Testament. A Historical Introduction to the Early Christian Writings, 5th edition, Oxford: Oxford University 2011 * David E. Aune, The New Testament in Its Literary Environment, Philadephia, PA: Westminster John Knox 1987",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I feel safe once in my bed?",
        "response": "Well how many bad things have happened to you in your bed? Are there many other places you allow yourself to become comfortable enough to sleep? When in bed are you facing the door?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Python why are NumPy operations so much faster than loops?",
        "response": "Imagine you're a head chef and ordering your minions about. Now, you could hover over each minion and tell them exactly what steps to take. \"Now add salt\", \"Now stir\", \"Now put in oven\". That's how an interpreter works - it evaluates each statement independently without any real understanding of the overall scheme. You could alternatively create highly efficient operations and just reference those - \"Now bake a cake\". That's why something like NumPy does. Instead of handling every step of the loop as individual steps, it's a low level routine that does a very specific set of things very efficiently.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has there been any known examples of non-valence electrons being used in a chemical bond?",
        "response": "To be a little pedantic, any electron involved in a chemical bond is by definition a valence electron, so in that sense your question doesn't really make sense - you can't have a non-valence electron in a bond. However, I think you're really asking whether there are examples of bonds formed using electrons not from the s or p orbitals, in which case the d orbitals can certainly be used, depending on the energetics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are websites forcing me to use 'mobile-friendly' websites with increasing frequency at the same time that technology is making full websites more accessible by mobile devices?",
        "response": "The reason is probably so that they can put a huge full screen ad over the page that takes way too long to load. There should be a setting in your browser to emulate a real computer, then it'll send the desktop page.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn’t your immune system fight off the bacteria that causes cavities?",
        "response": "Saliva is there to help protect your teeth and even has some immunoglobulin A in it along with enzymes. So you can make the argument that your immune system DOES fight off bacteria that causes cavities. The constant flow of saliva helps clean food debris from your teeth, and the keep the pH levels slighly basic to cancel out any acids that can wear away at the enamel.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to Non-Japanese Asian Americans during WW2?",
        "response": "I can only speak to the Chinese, who landed a major victory in that timeframe. Due largely in part to China becoming an official ally to the United States, Congress passed (with the help of F.D.R.'s bully pulpit) the Magnuson Act, which repealed the long-lived Chinese Exclusion. It only allowed 105 Chinese to immigrate to the United States each year, which was wholly disproportionate to the numbers that could immigrate from any other country, but it did allow Chinese living in the U.S. already to apply for naturalization, which was a long time coming. While I haven't heard of any Chinese being accidentally interred or anything like that, it wouldn't be implausible, though the U.S. military did make an effort to teach their soldiers the difference between a Chinese person and a Japanese person, using things like [this flyer](_URL_0_). Anti-Chinese racism still existed at this point, but it wasn't like the 'fear' people had towards the Japanese.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people still using Handwritten Signatures to sign checks and contracts when it takes literally less than an hour to forge it?",
        "response": "A signature is not rock solid proof of identity. A signature is more proof of _intent_ - if you can prove (somehow) that I signed the check, it's hard for me to argue that I didn't intend to give you money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come the Saracens during the crusades didn't have famous religious military orders on the lines of the Knights Templar?",
        "response": "Though their duties and nature changed over time, Christian orders such as Knights Templars and others were created by Western European Christians to protect the lives and interests of christians and christian pilgrims in Holy Lands. Since holy lands were essentially foreign lands for western Europeans, these orders were created as institutions to protect their interest in distant lands as response time from europe will be too long if there is urgent need. Saracens in the other hand were native to the region had no need for such orders and institutions and therefore there were no crusade specific institutions on Muslim side.That being said there have always been armed groups throughout Islamic history pursuing one goal or another and all these groups comes under the umbrella term of \"Mujahideen\". Similarly infamous Nizari Ismaili order of Assassins was active during the period of crusades and Syrian branch of the order sided with Saracens and fought against crusaders in 2nd and 3rd crusade.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The USA and UK are very close allies in modern times, but of course their diplomatic relations began in just about the worst possible manner. Is there a key historical event which led to this drastic positive shift in the relationship between the two nations?",
        "response": "There is a [section of the FAQ](_URL_0_) dedicated to the Anglo-American Relations with threads that might contain the answer you're looking for. HTHH :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sanitizing an operation room",
        "response": "This obviously differ from country to country, city to city and even hospital to hospital. But I worked as the guy who did all the dirty work in the OR at a major hospital in Stockholm and one of mu duties was to take care the operation tables right after the patient left it and make it ready for the next operation. Basically, what you do is that you remove the sheets and pillow cases and put them in a bin for things that you wash and use again. And after you thrown away all the things that only get used once (diapers and different other material so soak up blood and other fluids) you clean the whole table with 40% ethanol or if there have been a high risk operation you use stronger stuff. Then you basically make the bed, put the straps in that is used for the patient lift. If there is going to be a special operation you just look at the schedule or the nurses will tell you so you can put the right equipment at the table. So just 40% ethanol and lots of elbow grease.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A question about enthalpy of vaporization:",
        "response": "Firstly, when you supply heat to a substance, the heat is employed to doing two things 1. Increase the temperature of the substance (sensitive heat) and 2. Change the state of that substance (latent heat). This process happens at all temperatures, EXCEPT at the boiling point (which is why water will evaporate even if you place it at room temperature, just a lot slower). At boiling point temperature, ALL the heat supplied will go into changing the state of the substance and this makes it easier to measure. This has other allied applications in chemistry such as calculating the bond energy of the substance. Secondly, boiling point is a temperature-pressure condition, higher pressures entail higher boiling point temperatures (enthalpy is defined at 1 atm). So to define enthalpy of vapourisation as you suggest can have a lot of ambiguity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do porn stars usually appear in horror movies when they're in movies and not porn?",
        "response": "A lot of horror movies have a small budget so they can't get mainstream stars but want a recognizable name. Also low budget horror movies usual don't care if the acting is stilted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does missile \"lock-on\" work?",
        "response": "There are multiple types of tracking systems used for bombs and missiles. The most commonly used type in anti-air missiles is passive homing. This type of homing uses the infrared signature of a jet's engines to direct it to its target. Radar is also used in active homing and semi-active homing. Active homing is where the missile has it's own radar that it uses to track the target(also known as fire and forget). Semi-active is where you 'paint' the target with a radar source and tell the missile to track what's painted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the fine structure constant of 1/137 imply that there are only 136 possible elements that can be formed?",
        "response": "No, although there’s a history of literature about how atomic orbitals behave for elements with such high Z. It’s not entirely clear what the heaviest element that can possibly exist is. We know that the limiting factor is likely spontaneous fission, but we can only rely on extrapolated calculations to predict where the limit will be. We have some FAQ entries going into more detail about this under “Nuclear and Atomic Physics”.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How historically accurate is the show The Last Kingdom on Netflix?",
        "response": "Specific follow up - Does it make any sense at all that King Alfred wears a fleur-de-lis crown before the Norman conquest?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any elemental matter humankind has not managed to transform into gas?",
        "response": "Many elements on the periodic table are only observed for extremely short durations in particle accelerators. These particles can't really be played with and transformed into gas, due to their extremely short lives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that the British and Americans use \"is\" and \"are\" exactly oppositely when referring to plural third parties? e.g. (US: Why is Microsoft doing something, vs: UK: Why are Microsoft doing something)",
        "response": "They're not opposites in most usage.  The difference is in their use with respect to collective nouns (\"team\", \"group\", etc.). In American English, collective nouns are singular: the team *is* going to dinner later. In British English, collective nouns are plural: the team *are* going to dinner later. In some parts of the U.S., especially the northeast, you'll occasionally hear them used interchangeably.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Does Your Breath Smell Bad When You Don't Eat For A Long Time?",
        "response": "What you are smelling is acetone. Your brain is the one organ in your body that cannot use fat as an energy source. When you are eating regularly, your body can maintain the sugar glucose at a high enough level in your blood to provide plenty of energy for your brain. During short times of fasting, such as when you are sleeping, your body breaks down stored sugar in the form of glycogen to provide glucose for the brain. When you undergo prolonged fasting, however, your body runs out of glycogen, and your blood sugar drops. In order to continue providing energy for the brain, your liver converts fat into molecules known as ketone bodies, which your brain can then use as an alternative energy source. Acetone is produced by the breakdown of ketone bodies for energy, and that's where the bad smell comes from.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does an intense yawn/stretch take all the energy out of me?",
        "response": "Because you push out a lot of air in your lungs and ypu limit the blood flow coming to your brain. This makes you feel really tired / think you're gonna pass out ( you actually can)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "i was told that wider tires don't equate to more area of contact with the road. Then why are all high performance tires wider than everyday tires?",
        "response": "What you were told was in fact correct. The people speculating here that a wider tire = larger area of tire touching the road are incorrect. See: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What to do when I go to a strip club.",
        "response": "When you first come in, take your group to a table or booth not right at the stage, order your drinks and get settled in. Once you're settled wait for a change of dancer or song and you can take advantage of the space around the stage. Sometimes there will be chairs, other times it's standing room only. ONLY go up to the stage if you plan to spend money; while not required, it is somewhat disrespectful to not tip (the dancers aren't there to give you a free show). Only make physical contact if the dancer initiates it. While you are there, be prepared to be harassed every few minutes by dancers asking if you want a lap dance or private show. Don't be pressured into blowing your whole stack in a half hour (especially if you aren't there to make it rain). Definitely leave your card locked in the car, ATM fees are around $10 at the few i've visited which is ridiculous. Take a break between songs or dancers as you see fit and pace yourself. You'll have a great time if you can make your dollar go further.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were chariots used effectively in ancient warfare? Why did they start to decline in importance as an element of warfare in the Classical period?",
        "response": "hi! not discouraging other responses, but fyi, you may be interested in these earlier posts  use in warfare * [How were chariots used in Bronze Age warfare?](_URL_2_) * [How could chariots be used militarily?](_URL_4_) * [Why were chariots so effective in ancient warfare?](_URL_0_) * [How did chariot battle tactics differ between the middle-eastern nations (say, at the height of the Persian Empire) and those of the British isles (say, during the Roman invasion)? How were they similar?](_URL_5_) decline * [Were chariots ever used by European powers? If not, when and why did the chariot stop being used in combat?](_URL_6_) * [Why did chariot usage decline?](_URL_7_) * [When did war chariots stop being used ?](_URL_1_) * [Why did people stop using chariots in warfare?](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we like a cat's purr?",
        "response": "It's rhythmic, softer and not threatening.  It's a sign of contentment or love.  A cat purring for you is the sign that they appreciate what you're doing.  It's the way they can communicate happiness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do dehumidifiers work and how do they collect so much water in a seemingly dry room",
        "response": "I'm gonna blow your mind here: Gases can dissolve liquids. Air dissolves a little bit of water into it, which is another way of looking at evaporation. This dissolved water cannot stay dissolved if the air gets cold enough, and when this happens the water forms droplets. This is how rain forms, as well. Now, in a dehumidifier, air is sucked in, cooled down, the water droplets are collected, and then the air is pushed back out. On the way out, the cold air warms up while inside of the machine, and ultimately the room actually gets slightly warmer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Los Angeles flourished despite being built in a desert",
        "response": "In the early 1900's, Los Angeles built a 400 mile long aqueduct to carry water from the north to the city. This allowed the population to boom without any concern for water. Right now, we only have water concerns because the entire state is under a severe drought. But with normal rain and snowpack, and responsible water use, LA is fine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is turbulence? And how do airplane pilots sometimes know when they are about to hit turbulence?",
        "response": "Pilot here...Pilot reports are really the best way to know when it will be bumpy. One plane 100 miles ahead will report turbulence at a certain altitude to ATC and then they will relay the message to other planes. Those other planes can then decide if they want to deviate course or altitude...Also just don't fly into those big puffy white clouds, they are bumpy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "when I feel like I'm about to sneeze, but then I don't, what happened?",
        "response": "Usually a person sneezes due to irritation in the nose, mucus, hair or any irritants that the body (or the nose) wants to expel explosively (hence the sneeze). But as the body is preparing to sneeze, you are inhaling air, inflating your lungs and in general doing the \"aah..aaaaahhh...\" part, if the irritant is moved or is dislodged from it's place - the need and the urge to sneeze vanishes. Hence no sneeze. tl;dr: the preparation to fight the enemy causes the enemy to go away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How accurate is the M-4 Sherman's reputation as a death trap?",
        "response": "More can be written on this ... well, that's the standard wording that people use, but there are currently 8 articles in the FAQ section [\"Sherman Tank and American Armor\"](_URL_3_) . The second one is [\"Was the M4 Sherman a good or bad tank?\"](_URL_3_) by /u/TheHIV123 . It is a relatively short read, and there are child replies with more info. The first one is on [Common myths surrounding the M4 Sherman tank](_URL_3_) by /u/the_howling_cow . It busts a lot of misstatements in its 9 parts of text. Other links in the section cover specific aspects. This is not to discourage discussion. Further questions, data, and debate are always welcome.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would someone who got liposuction get the health benefits of having less fat like someone who worked out/dieted to loss the same amount of weight?",
        "response": "Basically, no.Fat accumulates in several organs in a diffuse way, not just in the subcutaneous. That fat is bad for you and is not sucked. And if I recall correctly there are papers linking liposuction with greater risk of cardiovascular diseases (sorry, I'm on call, can't research that for you, but if you really interest, pm and I can search later)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Need help explain why burn to ashes is not the flawless way to hide a body.",
        "response": "The flaw is that you need to have a very hot fire for a very long time. Vast amounts of smoke, and the smell of burning flesh, tend to raise questions. For reference, crematoriums use temperatures higher than 1600 degrees, and they take at least 2-3 hours to cremate a body. That's in ideal conditions. Doing it yourself, at lower temperatures, would take a huge amount of time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "when and why did people decide that pink is a 'girlish' color?",
        "response": "Initially blue was considered the girly colour, but after Eleanor Roosevelt, who liked pink it became fashionable. Vox did a great segment on exactly this topic _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are un-cut diamonds illegal to have in some countries?",
        "response": "It's not illegal to have uncut diamonds, it is illegal to import conflict diamonds in most western countries however (it's very hard to get a hold of a real conflict diamond these days, especially if you buy them from a legitimate business). Those diamonds however are likely conflict diamonds that are illegal to import and without any paper to prove otherwise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does changing a country's debt from the USD to its local currency benefit that country?",
        "response": "Other countries can't control the value of USD. If they have USD debt and the value of the dollar rises against their local currency, their debt gets bigger. Many emerging markets are having this issue right now. They took out a bunch of USD loans in the aftermath of the 2008 crash, and now that debt is getting harder to service as the dollar gets stronger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does a supernova make a sound? If it does, what would one sound like?",
        "response": "~~Logic~~ Our knowledge of sound waves dictates that: no medium to carry sound waves, so no sound.  But, new computer simulation suggests otherwise. The simulation involves more than a million steps-five times more than typical models--and encompasses a full second or more of stellar death, from core collapse right up to the instant the star goes supernova. Other models typically simulate only the first few hundred milliseconds before the explosion. The team's model shows that after about half a second, **the collapsing inner core begins to vibrate**. After about 700 milliseconds, the vibrations become so energetic that **they create sound waves with audible frequencies in the range of 200 to 400 hertz**, or around middle C. \"Instead of neutrino's heating up the material behind the shock, we had acoustic power doing it,\" Burrows told _URL_0_. \"The material on the inside is oscillating like a very, very strong speaker and sending out energy via sound.\"  [Source](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Martin Luther King Jr, Malcolm X, or any other black leaders of the 50s and 60s ever compare the discrimination of Jews in Nazi Germany to the discrimination of blacks in the American South?",
        "response": "A line from King's famous essay \"Letter from Birmingham City Jail\": \"We should never forget that everything Adolf Hitler did in Germany was 'legal' and everything the Hungarian freedom fighters did in Hungary was 'illegal.' It was 'illegal' to aid and comfort a Jew in Hitler's Germany. Even so, I am sure that, had I lived in Germany at the time, I would have aided and comforted my Jewish brothers. If today I lived in a Communist country where certain principles dear to the Christian faith are suppressed, I would openly advocate disobeying that country's antireligious laws.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the US keeps continuing down the path of rising tuition, healthcare, housing costs, etc., what will happen to the average American? Will we fall into another great depression?",
        "response": "Things go farther than you think they possibly could, gov't steps in and relieves some of the burden from some of the masses, a few people get ridiculously rich from it, the middle class pay for it, life goes on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are kids usually more inclined to like sweet over salty food?",
        "response": "Children under a certain age are hard-wired to consume as much energy as possible, and sweet-tasting things in the wild usually contain a great deal of caloric energy. Presumably, in terms of evolutionary biology, this would optimize a child's chances for growth if they were consuming a lot of calories. An experiment run with young children once had them tell the researchers to stop stirring sugar into their drink when they thought it was too sweet, and most of them never reached that point. Their brains are simply not wired to accept \"too sweet\" as a condition. Here's an [NPR article] (_URL_0_) about your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are my sheets/covers so much more comfortable in the morning when I wake up?",
        "response": "Melatonin. It's a hormone that relaxes your body and by the time you wake up your body is full of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do really hot objects feel cold at first?",
        "response": "Well this is pretty interesting, it has to do with our [Thermoreceptors](_URL_0_). It's pretty simple actually. What's going on is the object you are touch is *so hot* you're *overloading* your receptors, our bodies aren't really equipped to deal with the scorching temperatures of a bowl in the microwave! You actually end up firing both at once. Here's another point you might find interesting. The way our body is designed, the signals that some stimulus that is happening that's dangerous to our cells, like touching something that's very hot, gets sent faster than the signal to our brain that processes the actual pain. This makes us instinctively pull our hand back a little bit before we actually feel the pain, so we minimize damage to our cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the duration of thunder to vary? Why does some thunder only last for a couple seconds while another rumble may last for 10-15 seconds?",
        "response": "It depends what it went between. The duration of the thunder is based off the difference between your distance to the closest and farthest point of the lightning bolt A lightning bolt a few kilometers away between a cloud 400 meters up and the ground will produce a thunderclap that all reaches you at pretty much the same time. A lightning bolt that occurs between two clouds 3.4 kilometers apart will reach you over the course of up to 10 seconds depending on positioning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "confidence intervals in statistics. How can a relatively small sample size provide accurate results for a large group of people?",
        "response": "If you mix your soup well, you only need one spoonful to tell how salty it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In popular TV Show Boston Legal, why do the lawyers from Crane,Pool and Schmidt always give their closing the last(2nd)?",
        "response": "Artistic license. The same goes for some shows/movies when the lawyer in the middle of cross examination suddenly stops questioning and makes an argument to the jury. As an attorney for 20+ years, I've learned to suspend disbelief and grant a certain amount of artistic license.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a psychological reason why people with NO attraction to their own family members, find incest so arousing?",
        "response": "FWIW, saying taboo words has been found to alleviate pain.  _URL_0_  Humans often use the word \"naughty\" as a positive descriptor of sexuality.  This suggests that perhaps it's the actual 'forbidden' quality of profanity or taboo sexuality that some people find positive.   It's a little speculative, but less speculative than the alternative explanation-- 'projected' sexual feelings towards your own family members that your 'conscious' mind rejects.   Lastly, to throw out a question-- perhaps there is some 'quality' to incest-themed pornography that is generally lacking in most porn.  For example, maybe you like extremely \"loving and nurturing\" sexuality that theme is played up in the kind of work you enjoy?  Or something like that-- some unique quality that appeals to you-- forbiddenness or something else.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were military uniforms of the past so ornate and fancy as opposed to focusing on functionality?",
        "response": "There also needs to be a distinction drawn between what you wore when you got your picture taken (or portrait painted) and what you wore when you actually went into battle. Ceremonial uniforms can be pretty [ridiculous](_URL_0_) but they're for wearing to look good, not fight in. Many details of modern uniforms are actually symbolic of some aspect of the uniform that was originally there for function. For instance the quatrefoil (or knot) on top of the hats that US Marines wear was, originally, used so that sharpshooters in the rigging of ships didn't fire on their own marines during boarding. Marine hats still have the knot embroidered onto the top of the hat for this reason.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are so many grown up child actors short?",
        "response": "Child actors are very often small for their age. It allows them to play younger. It's easier to direct an eight year old that looks six than a six year old. It also makes them seem more charming and precocious for the age they're playing. Well, small kids often grow into small adults.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people have no sense of rhythm whatsoever?",
        "response": "As an audio engineer, I've broken this down a few times. There are two types of people: 1. People who dance to the beat (kick drum and snare) 2. People who dance to the vocal melody/lyrics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If clogged pores are holding dirt & oil in your face, then how come squeezing them is bad & not beneficial ?",
        "response": "Well, it's not that it's bad and not beneficial, there are actually tools that help you remove blackheads and whiteheads. The harm is in either compulsively picking, and also when you use your fingers you damage the tissue around the clogged pore.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone explain the behavior of the fish in this video?",
        "response": "Well its hard to tell from the quality of the video but it looks like they are going from deep water to shallow water. Fish will do this to escape predators like dolphins who (for the most part) can't go close to shore without the risk of being beached.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I get negative thoughts the longer I stay up?",
        "response": "Sleep helps recoup the chemicals in your brain that help in happiness. When you deprive yourself of sleep those chemicals are drained, leading to those negative thoughts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the one-time pad method of cryptography not used in modern computing/encryption if we now have secure methods to transfer keys?",
        "response": "OTP has two massive problems. First, a key can never be reused. Ever. Second, the key must be the same length as the message. Both of these problems make it impractical outside of very specific circumstances. If I can safely transmit the key then I could have just safely transmitted the message in the first place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can you \"double\" temperature?",
        "response": "Every substance has a specific heat, defined as the amount of heat required to raise the temperature of a unit mass of that material by one degree. This means that doubling the absolute temperature (i.e. °K) requires twice as much heat. This doesn't work if we're talking in °C, because 0 °C doesn't mean zero heat. However, on an absolute temperature scale a doubling of temperature does correspond to a doubling of the physical quantity of heat present in the material. In reality specific heat can vary with temperature so there isn't a perfect correspondence. Roughly speaking, though, twice the absolute temperature means twice the heat. EDIT: So to your friend's question, I guess 273 °C is twice as warm as 0 °C. You have to convert it to °K and back for the question to make any sense. This also means 4 °C is *not* twice as warm as 2 °C in any physical sense.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a moving electron propagate a magnetic field?",
        "response": "It's ultimately because there is no such thing as the universe's preferred reference frame. Maxwell's equations make the same phenomenon appear to be due to 2 different physical mechanisms, when at a deeper level it is the same effect seen in different reference frames through a Lorentz transformation. [In the electron's reference frame, the same things will happen, but will appear to be due to one of the other Maxwellian laws](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What substance has the lowest known biologically active concentration?",
        "response": "The lethal dose of Botulinum toxin is 90-270 nanograms (10^-9 grams). 4 kg could potentially kill the entire human population. The threshold dose of LSD is 25 micrograms (10^-6 grams).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Copper oxidized to a pretty blue-green color. You get the basically the same color you introduce copper to a flame. Is the same mechanism responsible, and does it apply to all elements? What's going on?",
        "response": "It is not the same process, copper oxidizes to copper(II) carbonate, which has the bluefish green colour. Whereas the green light produced by burning copper is caused by electrons changing energy states.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and when was the decision to orient maps with north at the top made?",
        "response": "The answer can be found in these threads from our [popular questions](_URL_3_) pages: ### Why is north shown as \"up\" on maps? * [How did the European world determine what is North and what is South?](_URL_1_) * [Why have cartographers always pictured north as up and south as down?](_URL_0_) * [Why is the map the way up it is, with north as up and south as down?](_URL_4_) * [Why do maps universally have north as up?](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did the bible become a thing? And who wrote it?",
        "response": "The Bible consists of many different books. While some books were written by the same person (eg. Paul is said to have written many of the new testament books), there were many authors. The old testament books were primarily written by the prophets. Their writings were kept together, forming the Hebrew Bible. The new testament writings were mostly written by the apostles or those close to them. A few centuries after Jesus, the leaders went through and decided on which books would become canon (the books they believed to be inspired by God), and which were not (often called apocryphal writings), forming the new testament. Various councils have been held over the centuries to form what our modern new testament looks like. However, not all churches agree here, thus you'll find more books in the Catholic version of the Bible than its Protestant counterpart. For a general summary of the development of the Christian Bible: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come we had massive drones (helicopters) before small ones ?",
        "response": "Helicopters aren't drones. They have a pilot.  They also have a giant combustion engine.  You can't use a giant combustion engine on a drone because then it's too big (consumer drones, I know Predator drones exist guys). So you have to use small electric motors. Uh oh! the currently existing technology doesn't provide powerful enough motors or long-lasting batteries! Time to get inventing! Hooray! Drones!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Japan's transition from the Empire we fought in WWII to the friendly, efficient, stable (video game/anime factory) they're known for today?",
        "response": "The US also kept intact the Imperial Monarchy. Being vital to the Japanese culture and ethos, the Allies allowed for a constitutional monarchy ( which was arguably in place after the Meiji era anyways).  By having a peaceful occupation and rebuilding, along with respecting the Japanese culture, they became our Ally.  We increased their economy 3x after WWII. Additionally, their governmental system wasn't much different after post-war Japan. Having given them an economic boost, they went about their way.  Also, since Japan is extremely honorific and collectivist, they took it well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does red meat stay in your digestive tract?",
        "response": "I'm a medical student, could use 25% of the winnings to help pay off my loans ;). Having seen a myriad of CTs of very old people (fancy x-rays that give you a good glimpse of different body structures) I can attest this is very very wrong. Nothing sticks around inside the colon walls making them thicker unless the person develops either colon cancer, little outpouchings called diverticula, or inflammation from either autoimmune diseases or infection. The only other thing he might have been referring to is atherosclerosis which has been linked to dietary factors including consumption of red meats. In atherosclerosis blood vessel walls (not intestinal walls) can get thickened with cholesterol plaques. Very common in older people, but I'm fairly certain there's nowhere near 9lbs of these plaques in the average senior citizen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do documents say \"any and all\"? What is covered there that isn't covered by just saying \"all\"?",
        "response": "In the old days legal stuff was written in latin. When writing it in english was new they would put the english word but then always say the latin word too. At some point that mutated into skipping the latin and just writing everything with two different english words. So there is dozens of examples of legal terms that are just the same word twice.   \"any and all\" , \"cease and desist\" , \"terms and conditions\", \"law and order\", \"null and void\", \"will and testament\"   Sometimes the words mean slightly different things, and there is a point to it, but a lot of the time it's just \"this is how legal words are supposed to sound so it's 'breaking and entering' instead of just 'breaking into'\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why's it so easy to become drowsy/fall asleep whilst watching something but then become wide awake in dark silence?",
        "response": "[This is a great explanation by /u/Solid_Waste from a similar thread - ](_URL_0_)  > The brain is like a group of people talking to each other. When you're watching TV, the part of your brain that watches TV says \"Shut up guys, I'm watching TV,\" so you can focus without thinking about cake or math. As a result, the others sit silent, grow bored, and fall asleep, until only the TV watcher part of the brain is left. Left by himself, he too gets bored and falls asleep.  > When you're in bed, assuming you aren't counting sheep or something, the entire brain is kind of in free time mode, and any part of the brain can speak up if it wants to. They start talking to each other, and even if one of them starts to drift to sleep, the others wake it up either by deliberately talking to the sleepyheads or just being noisy. Eventually more and more of the parts of the brain fall asleep from sheer exhaustion no matter how loud the others are, and eventually the last one passes out and you are asleep.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can someone explain why there’s actually no way to basically revive something or someone dead?",
        "response": "Your brain starts dying after about 6 minutes without oxygen. The cells up there need a lot of energy to continue working, so after 6 minutes you start getting brain damage. Ultimately the brain completely dies, and while you maybe can restart/replace some organs, you can't do that with the brain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Hi Historians. I'd like to ask, why wasn't there a American Revolution during the Great Depression?",
        "response": "I'd seriously recommend Tony Badger's *FDR: The First Hundred Days* - it's short, readable, and presents his argument that the entirety of the New Deal was a 'holding operation', designed to keep capitalism afloat until exogenous factors could stimulate a recovery. Although naturally it's a little more complex than that.  Then I'd go into his bibliography, and take it from there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take 3, 5, 10+yrs for some games to come out, such as Fallout New Vegas to Fallout 4 when the games become profitable on mere preorders alone? Halflife 3 would generate billions, yet it is an opportunity no one is pursuing?",
        "response": "Games like Fallout or Halflife are niche genres without much widespread interest, so any additions to the series have to be carefully created and marketed in order to preserve their following while attempting to gather more interest. Games like BF/CoD have a massive following; it doesn't matter if the newest one is good or better than the previous, people will still buy it, and they won't likely ever lose interest in the series. They're also a lot easier to make because those companies don't need to hire historians/story writers to make sure the lore is accurate to the universe and to make compelling stories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do gas station pumps know when to stop?",
        "response": "Taken straight from Wikipedia - \"Most modern pumps have an auto cut-off feature that stops the flow when the tank is full. This is done with a second tube, the sensing tube, that runs from just inside the mouth of the nozzle up to a Venturi pump in the pump handle. A mechanical valve in the pump handle detects this change of pressure and closes, preventing the flow of fuel.\" I think that's a fairly basic explanation.. Unless someone else wants to take a crack at simplifying it further.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I want to learn a language to translate untranslated Ancient texts, which should I choose?",
        "response": "Akkadian cuneiform is certainly a good option. There are thousands of texts untranslated into any language, let alone English. Akkadian cuneiform, in addition to Akkadian/Babylonian/Assyrian, gives you a basis to write other languages written in the same writing system, such as Hittite, Ugaritic, or Urartian. You can see some of these online as well at [CDLI](_URL_0_).  John Huehnergard, *A grammar of Akkadian* is a very comprehensive grammar if you're interested. It will teach you both the writing system and the language, though it might seem like a bit much, and isn't particularly user friendly. I'd also recommend Snell's *A workbook of Cuneiform Signs* or something similar to practice the signs. You could alternatively use this in combination with a simpler, more user-friendly grammar, say Worthington's *Complete Babylonian*, which is actually incomplete because it doesn't teach the signs!  Good luck!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how is there air pollution from cars and vehicles even though catalyst converters exist",
        "response": "Catalytic converters do not magically turn car exhaust into pollution-free unicorn farts.  The exhaust still contains lots of carbon dioxide and there are still some pollutants that make it through the converter substrate. Also, a catalytic converter does not start working fully until it is 100% hot, usually about 5-10 minutes after the engine is started.  & #x200B;",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your vision go black when you are standing up quickly?",
        "response": "Orthostatic hypotension. It takes a moment for your body to compensate for the fact that it needs to get blood up an upright body to the brain. It usually causes just a short bout of light-headedness though - if you're getting to the point that your vision goes black you may want to get your blood pressure checked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't the major media outlets covering the DNC emails leak?",
        "response": "Optimistically; because they're waiting to confirm stories before breaking them, which would be expected under the tenants of journalistic integrity. More realistically; because they're being told not to discuss them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During the U.S. civil war, how did other nations react to the Confederates?",
        "response": "I can't speak for the other European nations, but France and Britain were (officially) neutral through the war. The South was hoping to gain the allegiance of France and Britain through cotton exports. The South thought that a cotton-based economic relationship with Europe would drag Europe into the war, fighting the Union. To the dismay of the Confederacy, Europe didn't really need Southern cotton, since Europe was enjoying a surplus of it at the time. I'd say (but I'm not sure) that European trade favored the Union during the war.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes a temporary blind spot in my vision when I'm having a migraine?",
        "response": "This is called a [Scintillating Scotoma](_URL_0_); not much is really known about it because it's pretty rare, but generally they're known to be caused by migraines. This would be a better question for your doctor if you want a better idea of what could be causing it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Biology] Are there any other species of animal besides humans that will try and regulate the climate they live in? Further questions inside.",
        "response": "Not exactly what you're asking, but the beaver can change entire ecosystems to better suit themselves. On top of dannyboy101's prime example of termites who build pretty amazing systems to regulate airflow and temperature, many do something similar for their eggs instead of themselves. For example some (all?) species of crocodile will build nests for their eggs so that the heat from the rotting of the vegetation keeps the eggs both warm and moist. That's both heat and humidity control.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did old fashioned lamp posts have cross arms?",
        "response": "As you can see from [this picture](_URL_0_) form the Dutch National Archives, when servicing the light the ladder of the lamplighter would be placed against the cross arms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do energy companies push energy conservation?",
        "response": "Because they have a (mostly) fixed capacity and they are a highly regulated industry. If they can push 100 units of power out... and people are demanding 500... that is a pretty big problem for them. In a free market, prices would skyrocket but in the utility market their prices are basically fixed by the government. Since their prices are fixed... and their capacity is fixed... the only thing that can give is the service provided... thus blackouts!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why our body temp is 98 degrees, but 98 degree weather makes us hot.",
        "response": "Because your body is constantly generating heat, and it needs a cooler outside environment into which it can dump the extra heat out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly would happen if I opened an Emergency Exit door of an airplane while flying at 30,000 feet?",
        "response": "You wouldnt be able to, because they way its set up on commercial airlines is that you have to pull the door in before you can open it outwards, and the pressure difference from inside the cabin makes it to where the door will not swing inwards with any amount of force one person could use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are records better than CD's? Why hasn't a higher quality format for CD's been introduced?  downloads.",
        "response": "There has been a [better quality CD introduced](_URL_0_).  It's been around for a decade and nobody's started using it because CDs are good enough. If you think about it, everyone was buying iPods when they had *worse than CD quality sound*. The majority of consumers don't care about quality as long as it's \"good enough\". As for records, it's a funny area. CDs are technically better than records & don't degrade as you use them but the music they've generally had put on them has been of worse quality. I'm not saying that \"modern music is crap, the old stuff is better\" but modern music recording techniques have tried to make things \"louder\". Look around for things on the [loudness war](_URL_1_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Heavy storms here on the West Coast have me wondering: has science/medicine ever determined a confirmed source or mechanism for weather-induced joint pain?",
        "response": "yes--tied to changes in air pressure. [here's one version of the explanation](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "couldn't something similar to TOR be made for cell phones to prevent police from spying? (text message encrypted and sent to various phones before reaching the final destination)",
        "response": "There is! Google is going to redhead a VPN for one of their new phone. Currently in Lolipop 5.1 but disabled. IOS/android also have ebcription now meaning with a pass code it is near impossible to get data.  Also android has secure messengers that encrypt just that. But yeah always have to worry about the other end user and their setup",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wednesday Week in History | July 17-23",
        "response": "On July 18th, 1940, FDR was nominated for an unprecedented third term by the Democratic Party at their convention in Chicago. This went against the unwritten rule that no US President would serve for more than two terms (begun by George Washington, who refused to run for a third term in 1796). FDR later served a, also unprecedented, fourth term in office (although he did not serve much of this term- dying in April, shortly after the term began). To prevent another US President from serving more that two terms, on March 21, 1947 Congress passed the 22nd Amendment to the Constitution, officially limiting the term limit to two.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I just watched Armageddon and it got me thinking, if an apocalyptic-sized asteroid were on a collision course with Earth, does Nasa have any plans in place to destroy it before contact? Or would we actually all be screwed?",
        "response": "You wouldn't want to destroy it, you'd just end up with a big ball of sand coming at you (if it didn't reform), which would impart just as much energy onto earth, just in a different way, and still have catastrophic results.  What you want is a [gravity tractor](_URL_0_), which will slowly deflect it.  Do we have one built right now? No. Do we have finalized plans on how to build one? No. Would we, If we saw one coming, have something out together quickly? I certainly hope so. Our odds at survival would be directly proportional to how much earning we had.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you catch and release a fish does it lead a normal life despite its mouth injury?",
        "response": "Your question has been answered but one thing I feel needs to be added, many people who practice catch and release on big fish unknowingly kill their fish when they show it off to the camera. A large fish's jaw is not made to support its weight out of the water, when an angler holds a fish by the jaw for a picture, if it is large enough, the jaw will break and it will be unable to feed until it starves. The technique for holding a large fish varies from species to species but a mostly safe way is one hand under the body holding the majority of the weight and one hand gripping the jaw (or gills with most toothed fishes). Edit: [Pictures of proper holding](_URL_0_) Although the source is not scientific in nature, it discusses at the top how the study has not been done and demonstrates a proper way to hold large fish.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they take photos of our galaxy if we're in it?",
        "response": "There are no such photographs; only artists renditions occasionally based on actual data or informed by images of other galaxies that we believe to be similar to our own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that animals are able to eat raw meat and not be harmed whereas humans can become very sick?",
        "response": "Humans can eat raw meat too, you know. Ever had a steak tartare? Basically, it depends on the freshness and quality of the meat. Most animals can smell if meat has gone bad, and will avoid it, just like we will.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between nation-state, nation, and state?",
        "response": "From _URL_0_:  > The state is a political and geopolitical entity, while the nation is a cultural and/or ethnic one; the term \"nation state\" implies that the two coincide geographically. State is physical borders and the politics/government, nation is the people and the \"spirit\" behind it. Do note the contrast with a city-state, which is on a smaller scale (of, you guessed it, a city), and a state (technically a federated state) in the sense of the USA, Mexico, Federated States of Micronesia, etc, which are effectively provinces that have some powers of government and some that are deferred to the federal level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when you drive across the border from a country that drives on the right to a country that drives on the left (or vice versa)?",
        "response": "You switch. E.g. when you get off the ferry at Dover, England, you turn off the one-way road from the port into the left lane. When entering Hong Kong from mainland China, the lanes split up into two separate bridges that cross over each other, which is a nifty solution.  It's actually not that common of a problem, because the majority of world drives on the right, and many of the left-drivers are island nations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the deal with the American blue cross with stars on a red background flag?",
        "response": "You mean the Confederate flag? That was the flag of the states that tried to secede in the 19th century, causing the American Civil War. Because the secession had a lot to do with slavery and the southern states' desire to keep holding slaves, it's widely seen as a symbol of racism, white supremacy, and hate. Some people will say that they think it is a symbol of the heritage and history of the southern states, though. EDIT: rewrite to incorporate good points below: You mean the Confederate flag? **That is a flag that today represents the states that seceded in the 19th century, causing the American Civil War.** Because the secession had a lot to do with slavery and the southern states' desire to keep holding slaves, it's widely seen as a symbol of racism, white supremacy, and hate. Some people will say that they think it is a symbol of the heritage and history of the southern states, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What, on the atomic level, causes cooling when a gas is expanding?",
        "response": "In order for the gas molecules to expand, it uses energy to push away the surrounding molecules. It loses energy and will therefore be at a lower temperature than the surrounding molecules. Being at a lower temperature will mean that heat will flow from the hotter surroundings to the cold expanded gas. Also compressing gas doesn't necessarily mean it will increase in temperature. It depends if it is adiabatic compression or isothermal. If it's the former, then it will increase in temperature and then cool down to the same temperature as its surroundings (equilibrium).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes Neptune look blue?",
        "response": "The methane in Neptune’s atmosphere absorbs red light and reflects blue light from the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can atmospheric co2 cause ocean warming?",
        "response": "While heat does indeed rise in an otherwise static volume of gas (what we call convection), a hot air body will warm that which is around it. So if the air around you is 20 C, and the water is 4 , the water will be warmed by the air. You know this - when you're cold and you go into a warm room, you are warmed up by the air. Ambient temperatures will bring everything they are in contact with toward that temperature. If I have a 5 degree coin, a 15 degree coin, and a 10 degree body of air all in a box, the cool coin will warm up, the hot coin will cool down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can every cell phone company claim to have the fastest or strongest network? Why isn't this false advertising?",
        "response": "Each makes slightly different claims, so they can all be right at the same time. For example one is fastest nationwide, one is fastest in your area, one has the strongest signal, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is heat lost from the ISS?",
        "response": "The only mechanism for heat transfer from the space station is through radiation. In general, all of the electrical components on a spacecraft and solar incidence (when in sunlight) produce excess heat which needs to be shed. If you look at a picture of the space station you'll see a series of panels that are perpendicular to the solar panels. While it is generally desirable that solar arrays always face the sun, it's generally desirable to have the radiators edge-on to the sun, facing deep space. Coolant passing through the radiators is cooled and then passed back inside to keep removing heat from the station. If you wanted to heat the station, you could have the radiators face the sun slightly. In this photo, the radiators are the white accordion-like structures: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the evolutionary benefit in having two sexes, as opposed to hermaphroditic reproduction (snails, earthworms, etc.)?",
        "response": "The reason a lot of species evolved into two sexes has to do with specialisation. By optimizing to one sex you will gain advantage over the sub-optimized individuals. Over the course of thousand generations each sex become more distinct from eachother (more female and more male) . This polarisation comes with a price, this is why a lot of species are moving forward and back)  Our body put actually a lot of work in suppressing traits from the other sex.  _URL_1_  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have we been able to create \"Artificial Gravity\" for space exploration missions? If so, How did we go about doing so?",
        "response": "No, there is no such thing as artificial gravity outside of sci-fi. The only thing we have in theory is having a vessel rotate around its own axis and use the centrifugal/centripetal force as a substitution for gravity, but even that we only have in theory. This sort of artificial gravity works best for larger structures, larger than we have built any so far. Also one of the reasons we send people into space in the first place is to have them study zero-g (actually microgravity) creating artificial gravity would sort of defeat the purpose of going there in the first place. If we ever send people to Mars or father away we might make use of that technology, but we haven't really so far.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are tattoo artists not violating copyright laws?",
        "response": "They are, but entertainment companies generally know it's counter productive to fuck with their fan base.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and when did we find out what was written on the hieroglyphs on objects and artefacts, i.e. the ancient Egyptian writing system?",
        "response": "We found a stone the was carved in multiple languages and was able to compare the languages that were known and able to translate the stone was known as the Rosetta stone",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's with Americans referring to the elderly as 'Old Man/Lady' and then their surname?",
        "response": "Why is any modifying adjective used anywhere? It's just a descriptive term. Though, it is somewhat old fashioned. You would be more likely to hear it from 1940-1960 than you would today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we measure the age of the universe if time is relative?",
        "response": "The \"age of the universe\" is the time since the big bang as measured in a specific reference frame, the CMB frame. There is a unique set of observers that see the CMB as isotropic. The CMB frame is a reference frame in which these observers are all at rest. For more details, you can [read any of the references in this post](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Computer Malware so obvious to detect for the victim?",
        "response": "Some malware is obviously visible, like changing your browser's homepage to some ad-riddled horror show. Many casual computer users won't know what to do, so they'll just let it slide, and use the bloated crapshoot as their homepage, making the malware people advertisement money. However, just because you can see some of it doesn't mean you can see all of it. One example is the (until recently) popular torrent program utorrent, which decided to bundle hidden malware in one of its updates, which would use your computer's processor(s) and internet connection to mine bitcoins for them. Had it not been for dedicated savyy people sending out warnings, most people would never have found the reason and would just have cursed the gods for their computer's newfound slowness.  Just because you can see one tiger prowling in the jungle doens't mean there isn't one just behind you in the bushes about to murder you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the relationship between laissez-faire and trickle down economics?",
        "response": "Let's say I have a billion dollars, I can do three things: I can spend some of it, I can save some of it and I can invest some of it. If I buy something, I increase demand for that thing. If demand increases, producers will try to increase production and hire more people. This creates jobs. People benefit. If I save it in a bank, I make credit available to people. People can take loans and start new businesses or they can buy stuff which boosts industry. People benefit. If I invest it, I am hiring people or supporting a new business and helping the economy directly. People benefit. So, ultimately, if I am left to do what I want with my money, I benefit humanity as a whole. So my billion dollars end up helping not just me but other people poorer than me as well. So in a metaphorical sense, the money \"trickles down\". (This is the theory. Whether it works in practice needs to be demonstrated by empirical studies.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the advantage of having five, rather than four or six, fingers?",
        "response": "no reason. Its how evolution went. If someone evolved to have 6 fingers and the brain/dexterity supported it where it had a high level of functionality, that would probably have been an advantage. But such a mutation never happened, so we have 5 fingers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why my door closes much faster and easier when my window is open, even when it is not windy?",
        "response": "Forget air. Imagine your car is full of pudding. When you shove the door closed, you have to squish the pudding inside the car. What if the window is open though? The pudding just slops out the window.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Intense Sadness right after Masturbation",
        "response": "Have you grown up in a Christian or otherwise sexually repressive household? If you've been told your whole life that it is morally wrong to masturbate, than you might be feeling shame. Masturbation is considered perfectly healthy and natural. [95% of men and 89% of women regularly masturbate.](_URL_3_) Once you stop associating masturbation with feelings of guilt, you won't feel any more intense sadness after masturbation.  Many people who have come from sexually repressive households often feel intense sadness after procreative sex too, so it isn't a problem restricted to masturbation. [Source](_URL_0_) It's unfortunate that so many people are taught that there is something wrong with them for following their most basic of instincts. Here is a [link](_URL_1_) to the Stigma section of the Wikipedia article on masturbation. Also [here](_URL_2_) is a very well cited section on the health benefits of masturbation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if we got a bunch of single protons (with no electrons) and compressed them all together?",
        "response": "It’s depends on the energy at which you compressed (or *tried* to compress) them together. Protons repel each other due to their like charges. At very short distances, the (usually) attractive nucleon-nucleon interaction will begin to dominate over the electromagnetic repulsion. However a system consisting of only two protons has no bound states (which clearly remains true for a system consisting only of A protons with A > 2). Even if you press them together really closely so that the nuclear force takes over, you won’t be able to form a bound system unless some of the protons change into neutrons via some weak interaction.",
        "source": "sentence-transformers/eli5"
    }
]