[
    {
        "query": "why is it when it’s super bright outside it’s easy to keep one eye open fully but not both?",
        "response": "The eye (and brain) are overwhelmed by the bright light stimulus until the eye has had time to adjust and enter \"bright mode\". The brain has to process not only the overwhelming light but also the overwhelming discomfort in your eye because you're looking at something that's too bright. Closing one eye helps to alleviate this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the Rothschilds networth an actual thing ? Does this family actually control nearly all the wealth in the world? If not then why are they mentioned so much in online forums and blogs ?",
        "response": "They are rich, but the wealth has shrunk and divided with each other. No 1 member of the family owns it all anymore. As for the hate they often are tied into the conspiracies like the Rockefellers or other wealthy families from the Industrial Revolution. From Illuminati, New World Order, to Reptilian Aliens, the tinfoil hat wearers have pointed to them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "has newtons 3rd law true only been proven true under macroscopic conditions?",
        "response": "Newton's third law is a certain way of stating conservation of momentum, and momentum has been conserved even in the most extreme scenarios like high energy particle collisions. More directly, you can interpret the Mossbauer effect (gamma rays absorbed and re-emmited by a nucleus in a way that depends on the electronic configuration) as the equal-and-opposite force from the attraction between the electron and the nucleus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Republicans' letter to Iran",
        "response": "The letter stated that any deal made with the Obama administration \"may not last\" after he is out of office when his second term expires. If the republicans win the next election there is the possibility that they can revoke any deal made with Obama. (read: If we win the deal is off so don't bother making any plans, just FYI). Basically the republicans went above the president and in violation of the US foreign policy. It goes against the policy as stated in the policy, and it is also not the senates job to do foreign relations work. In a democracy the losers said, \"screw that, we do what we want\", which isn't very democratic.  Moving forward it may give precident for anyone who opposes the president or leading party to just say and maybe even do what they want anyway. Since the president is the head of state it will be his mess to clean up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When transferring money from one bank to another digitally, what exactly is being transferred?",
        "response": "Its trading IOUs All your bank account really is, is the bank saying they 'owe' you your balance whenever you'd like it. And of course, you trust them to pay you when you want it. All this does is shift that. Lets say you transfer $100, the other bank now has an IOU you for $100, and your original bank takes $100 off their IOU to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(x-post from AskReddit) Where did seeds come from to grow the plants we see today? A fundy dropped that one on me and I had nothing to say.",
        "response": "This is a lot like the chicken and the egg; the seed didn't simply pop out of thin air as your fundie friend would assume. The earliest land plants reproduced with using spores which germinated into small gametophytes and produced sperm. This sperm would swim into the soil until it would find an ovule and form an embryo. This embryo would eventually grow into a sporophyte. Heterosporic plants produced spores of 2 sizes, micro and megaspores. Eventually, a single megaspore would get boxed into its sporangium while growing. The growing spore (now a megagametophyte) is contained within a tough outer protective layer. This is only one way that seeds were formed in plant life. There are several different evolutionary paths that ultimately converged into spermatophytes (seed plants). Source: [Paleobotany and the Evolution of Plants](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would it be possible to mine a white dwarf star?",
        "response": "Not with science as we know it. We'd have to have some serious gravity/mass shenanigans to even get close to a dwarf star.  If you could create a powerful enough gravity well in the vicinity of a dwarf star, you could possibly syphon off some of its mass. The problem then would be whether the impossibly-large-to-comprehend energy expenditure would be worth the payoff, in addition to mundane problems like avoiding being sucked in yourself. In short: no way of knowing, with present science.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which region of the United States has the lowest probability of both meteorological and geological natural disasters occurring?",
        "response": "The southwest, like the new Mexico and Western Texas area. Specifically the massive salt flats in New Mexico are so geologically stable that they plan to bury most of the US nuclear waste there. Near White Sands. Their weather is consistent and usually predictable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't two particles with mass exist in the same place at the same time if all particles exist as probability distributions of their position?",
        "response": "They can, if they have an integer spin (they are bosons). Helium-4 is an example of this, if you cool it enough all the atoms condense together and you get a superfluid. This isn't so much as the atoms all being in one spot, but rather that all the indistinguishable atoms are spread out over an area. Particles with half-integer spin (fermions) have a zero probability of being found in the same state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "We've all seen it before, but why does the \"rainbow faucet effect\" happen? [Image in description]",
        "response": "It is same effect as with oil on water: [Thin-film interference](_URL_1_). There is a thin layer of something on the metal. Light goes into this layer and bounces in it. Different wavelengths then interfere with themselves, some [destructively](_URL_2_) and some [constructively](_URL_0_). Wavelengths that interfere constructively are reflected out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the pink buildup on the bathtub/shower floor, and is it dangerous to touch?",
        "response": "It’s bacterial colonies of Serratia. Probably not wise to touch with your bare hand, but harmless enough to clean with some vinegar or other cleaning solutions",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Baptist vs. Methodist vs. Lutheran vs. Presbyterian, etc.",
        "response": "The difference between Baptist and Methodist is a Methodist will talk to you at the liquor store.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why shouldn't I press the popcorn button on my microwave when cooking popcorn?",
        "response": "The popcorn button uses a preset power and time stored in your microwave, usually the microwave manufacturer's best guess as to when the popcorn should be perfectly popped. You'll get consistent results, but the popcorn might be under/over done. Popcorn manufacturers tell you to listen because that's the most accurate method (when it comes to microwave popcorn.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do melting ice caps lead to a rise in sea level?",
        "response": "To add to /u/skratchx explanation, a significant part of the ice in polar regions is on top of land (namely Greenland and the Antarctic continent). We are talking kilometer thick glaciers. When it starts to melt you will get huge influx of water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you have a chiral solute and a chiral solvent, does the solubility depend on which enantiomeric pairs are being combined?",
        "response": "Theoretically, it's possible to find systems where you have differential solubilities in differently \"diastereomeric\" solvent-solute pairs, but in practice it seems to be quite rare.  [_URL_0_](_URL_0_) My guess is that this is because most solvent-solute interactions are much more dependent on weak non-steric interactions (Van der Waals forces, hydrogen bonding, etc.) than they are on any kind of three-dimensional \"molecular fit\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s going on inside soap dispensers that turn the liquid to foam?",
        "response": "Foaming hand soap is a form of liquid soap. It is derived from a diluted form of liquid soap that is infused with air to create a foamy lather as it leaves the dispenser. Some soap is kept in a pressurized container, and some is mixed with air in the dispensing unit when the pump is activated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Jupiter \"protect\" us from stellar debris?",
        "response": "Jupiter is our solar system’s largest planet. And it creates both good and bad conditions for earthly life. On the one hand, Jupiter’s powerful gravity prevented space rocks orbiting near it from coalescing into a planet, and that’s why our solar system has an asteroid belt. Today, Jupiter’s gravity continues to affect the asteroids – only now it nudges them toward the sun, where they have the possibility of colliding with Earth.  On the other hand, Jupiter’s gravity also protects us. Long-period comets enter the solar system from its outer reaches. Jupiter’s gravity slings most of these fast-moving ice balls out of the solar system before they can get close to Earth. So long-period comets are thought to strike Earth only about every 30 million years. Without Jupiter nearby, long-period comets would collide with our planet up to 1000 times more frequently.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do front lawns reduce air pollution?",
        "response": "Other way around.. they add a huge amount of CO2. Most lawns exist where there was once grasslands or forest which have more plant biomass by square foot. Additionally, most people mow their lawns with energy from fossil fuel. Some fertilize their lawns as well which involves more CO2 in production and shipping.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we feel the effects of a drug/medicine for the entire duration of its half-life? Ie diazepam has a half life of up to 100hrs (for active metab) yet why don't we feel its effects for that long?",
        "response": "Drugs have two levels you have to keep the concentration between. You have the effective dose which is the amount of drug required to effect a certain proportion of the population. They also have a lethal dose, a certain dose that will kill a certain percentage of the population. Hopefully with most drugs the ratio between those two, the therapeutic index (ed50/ld50) will be far away from 1 so it's easy to give people the right level of drug. But there may also be a minimum toxic dose, hopefully above the minimum effective dose. If you raise the blood concentration of the drug above the minimum toxic dose then the person will start to have major side effects. Anyway, all of this means you might be given a dose that pushes you just over the effective dose, which gives you a few hours of activity, but which soon drops you down under it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it seems like living in China is kind of rough for citizens? From the edu system to the announced rating system which is on /all frontpage. Is it really as purposeful as it seems from a western point of view? How do Chinese think about it (compared to other countries they visited)?",
        "response": "China is an enormous country so I don't think anyone can say exactly what \"the Chinese\" think about it because their views will run the gamut. However we can observe some things. It absolutely is purposeful. The censorship system put in place by the government is designed such that it allows the expression of views (so there appears to be an outlet) but squashes any attempt of organized protest or attempts to change the status quo. This system is designed to maintain power and control of the government no matter the desires of the people, and it has been quite successful. The Chinese are aware of it, and may not particularly enjoy it, but they have grown up with it all their lives and are convinced that there is really no practical method of changing things (which is probably true). If you are up for seeing a movie try watching the 2002 movie \"Hero\"; the moral is very Chinese.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does my phone have an IP address when I'm using the internet, but not connected to WiFi?",
        "response": "Your phone will certainly have an IP address if it is communicating over IP, and everything that you would typically think of as \"software\" on your phone (aside from the telephone itself and SMS) does so, typically using TCP/IP (web, e-mail, most apps) or UDP/IP (video/audio streaming, VPN, some games). Whether the IP address is reachable from the public Internet, however, depends on your ISP; most mobile ISPs operate a NAT that multiplexes several network-internal IP addresses through a single address visible to the public Internet. The externally visible IP address may change on the fly as you move around from cell tower to cell tower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does metal bend but stone break?",
        "response": "Metals stay together more or less electromagnetically. All of the metal atoms are packed tightly enough their electrons are constantly switching around between them, which makes for a very strong, but also somewhat malleable material. There's not really any specific structure to them at the atomic level.  Rocks on the other hand, tend to have more crystalline matrixes. Their structures are sturdy but very specific at the atmoic level. These matrixes can't really change shape or reaarange themselves, so rather than bending, they break.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know that the Big Bang started from a single point, instead of some larger object? Could it have started as the size of a baseball, the sun, or even an entire galaxy?",
        "response": "When scientist use the term \"single point\" they are referring to the mathematical construct of a \"singularity\". It's a hard concept but try this - Make the smallest dot on a piece of paper. That's where the universe started, but infinitely smaller than what you just drew.  It's hard to understand because in the \"before time\" there was no universe, therefore was no 2nd or 3rd dimension. Not the concept, but the dimension itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is synthesizing a sugar(sweet) that is actually healthy for us a possibility and if so, what are the challenges/limitations keeping us for doing so?",
        "response": "You appear to be under the misconception that sugar and sweets are not healthy, which is understandable given the media and parenting around them. Consumption in excess quantities is unhealthy but it is good to get some sugar in your diet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the probability of the number 3 being the middle square of a sudoku puzzle?",
        "response": "Take any (solved) Sudoku puzzle, check which number is in the center square. If it isn't a 3, proceed to swap all the 3's in the puzzle for whatever number is in the center square and vice versa. Voila, now a 3 is in the center square, but the actual puzzle remains unchanged. The number 3 has no special meaning in a Sudoku puzzle, nor do any of the other numbers. You can swap numbers in the way described above or even replace all numbers by letters or symbols and nothing changes. So the only valid answer is that the chance of the center square of a Sudoku puzzle being 3 is exactly 1/9.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the creators of chess used the queen to represent the most powerful piece, if women were considered property at that time?",
        "response": "> The queen has got the most interesting history of all chess pieces. First, she was a man, the adviser of the king. The figure goes back to the old Persians. The adviser, called \"Firzan\", could move one field diagonally and served for the safety of the king. The figure was taken over by the Arabs and was changed very much. Later, the Europeans called the figure \"Fers\", derived from \"Firzan\". Because they did not know the meaning of the word \"Fers\", they interpreted the figure as queen, because she is standing beside the king. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we try to save species that are going extinct?",
        "response": "it was discussed many times before. 1. natural diversity is needed. and we need to save it, because: 2. we screwed up. many animals are on edge of extinction because of us. we interrupted it by many things, from damaging environment to restless hunting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it bad to 'ride the clutch' on a manual car?",
        "response": "Depends on what you mean by riding the clutch. If you mean leaving your foot on the pedal while driving around you can possibly cause slippage under higher loads and during acceleration which will cause wear on the clutch If you mean having the clutch all the way down while coasting or sitting at a light the clutch is not wearing at all (or shouldn't be). However there is a throw out bearing that the linkage uses to push the clutch away from the pressure plate. The bearing is not really designed for continuous operation. It will wear over time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With Technology growing and what not, why hasn't there been a phone battery that can last a week rather than a day?",
        "response": "Batteries got a lot better when we switched from nickel-cadmium to lithium ion batteries about 15 years ago. That change allowed for a much larger amount of energy to be stored in the same area. The problem now is that we've perfected Li+ battery technology and there's not much more we can do with it. Some sort of alternative energy storage medium will be needed to go much farther, but most people in the tech industry are thinking that's at least 5 years out. As a rule, storing energy is really tough. Storing energy in a compact, portable form for use on demand? Even tougher.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your stomach suddenly hurt from eating after a long period of not eating?",
        "response": "Your stomach expands and contracts to accommodate food. When you don't eat for long periods your stomach contacts. If left in this state for any extended period of time just like any muscle that is not exercised regularly, it begins to atrophy. sudden use (or in this case expansion) will strain the muscles that control expansion and contraction causing extreme discomfort/pain",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do employee owned grocery stores work? Why are they a good thing?",
        "response": "I work for an \"employee owned grocery store\". Basically, when you get hired, you're given stock in the company. Technically you \"own\" a tiny fraction of the company. According to my orientation, if you're employed for 7 years, you can cash out (or whatever it's call when you sell stock back.) As far as being a good thing, usually they are not huge big box stores like Walmart, which means you're supporting a more local economy. My store buys produce from farms within the same state. The closest one I know of is 20 miles away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how can the value of currencies change compared to each other, like during Brexit. Pound:Euro and Pound:USD",
        "response": "Before brexit (June 10th). If you had 100 Pound, and you wanted Euros, you could find someone who would give you 127 or so Euros. You wouldn't find anyone who would give you 130, so the price was 126.79 EUR. After brexit (July 10th).  If you had 100 Pound, and you wanted Euros, you could find someone who would give you 117 or so Euros. You wouldn't find anyone who would give you 120 anymore, so the price was 117.33 EUR. Basically, people wanted Pounds less, so you'd have to pay them more pounds to get euros, so the price changes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the universe really look like a brain cell?",
        "response": "First it should be pointed out that this is not a picture of the universe. This is picture of a dark matter simulation. That being said, if you choose the right scale, on the right simulation, and choose the right colour scheme to compare with, then they do look similar. I can't say much as to the validity of what a brain cell looks like, though. There should, however, be no link made between the similarities of these photos. It is a selective coincidence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any living relatives of Vlad Tepes (Dracula)?",
        "response": "Yes, it seems there are. There are descendants [recorded up to the 1800s](_URL_0_). And more [mentioned in the 1900s](_URL_1_). And... according to [this article](_URL_2_)... > Real descendants of this family still exist today. (I assume you mean direct descendants, rather than collateral relatives. For example, his mother's father [is known to have had 41 children](_URL_3_), legitimate and otherwise - all aunts and uncles of little Tepes.)  *** *Apologies in advance for not being an official historian, just an amateur with an interest, a Google, and some spare time.*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a country like Japan have debts of $10t and FOREX reserves of $1.2t? Why don't they use their reserves to pay down their debt?",
        "response": "Think of it as the equivalent of a mortgage. People will often carry a mortgage and carry investments at the same time. If you can make more interest on the investments than it costs you for the mortgage you are better off not paying off the mortgage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I have to wait for food to cool down before I put it in the refrigerator?",
        "response": "When you put a hot dish in the fridge, it can bring down the ambient temperature of your whole fridge therefore risking bacteria growth on other foods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big of a deal is bacteria on cell phones?",
        "response": "I don't see why wiping your phone off with an alcohol pad wouldn't do the same thing. The major point that is missed here is that these bacteria don't originate from phones. They are placed there by dirty hands/ears/faces. Keep those areas clean and phones should stay relatively clean. And as a note to the germaphobes: Staph aureus (the SA in MRSA) is a normal skin flora bacteria along with hundreds if not thousands of other normal flora bacteria that our bodies rely on to survive. Finding it and other bacteria such as E coli (normal GI bacteria) on things we touch multiple times per day should not be surprising but expected. These bacteria only cause problems when they get into places they don't belong. Ex: E coli in the urinary tract, or Staph aureus in a surgical incision.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do people in Congress bother arguing if they vote by party anyway?",
        "response": "They don't always vote by party. Most of the time, but not always. If you want to pass a bill, you usually need at least a few of the other guys to vote your way in order to get it done.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much mass would an asteroid need to break up the moon and at what velocity?",
        "response": "The better question would be:  \"How much momentum would an object need to break up the moon?\" This would allow you to factor in both mass and velocity as one answer, and then back solve it for different mass and velocity values.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After the American Revolution, was there any movement to rename states and cities named after royals?",
        "response": "[This older thread has several links that might partially answer your question.](_URL_0_)   edit: posts by /u/Yearsnowlost /u/TRB1783 /u/lutzj",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Debate teams, how do they work?",
        "response": "Debate is more or less a \"sport\". Rather then a discussion on a topic, there are many different formats that teams may compete under.  I did debate for a semester in college, British Parliamentary style. In this format, there were 4 teams in the room. 2 teams are assigned to support the topic and 2 teams are assigned against the topic. Teams were rated on the strength of their arguments and the criticisms of their opponents arguments.  All I know is BP, but there are other styles like public policy, where you are given days to prepare (I think), and your points are based off the arguments present in a more fact based approach. (I guess) this is the reason for the speed talking shown in that recent video.  TLDR: debate as an activity is much more structured then dialog between competitors. It has rules and regulations. You are not working towards a solution as much as presenting and defending strong arguments for your own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The UK is currently in middle of a huge heatwave which is hitting Europe. This heat is causing trains to be cancelled or run slowly due to fears of tracks ‘buckling’ from heat. Why is it that in mainland Europe where countries have high heat more often that trains are ok there?",
        "response": "I'm from Belgium. I've just to taken the train to make my daily connection Brussels-Antwerp. On a normal day, it's 45 min. Today it took me 1h45 min., because of trains cancelled or running slowly. So don't worry mate! It's the same in mainland Europe! Edit: grammar I could fix by myself",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sound can be defined as a variance in pressure in a medium (such as air). What is it that causes a saxaphone to sound different than a trumpet?",
        "response": "The unique \"sound\" of an instrument playing a particular note is called the [timbre](_URL_0_). The timbre comes about from the fact that when you play a note on an instrument, you're not actually playing just one frequency. The main frequency excites lots of harmonics and resonances in the instrument. The intensity of sound at these different frequencies is less than the main frequency, but it serves to give the sound a different \"feel.\" Because different instruments are constructed differently, the resonances that get excited are different, and this yields a different timbre.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Lagrange Points on the surface of a planet?",
        "response": "That's not really possible based off of how gravity actually works when you're not treating bodies as point masses. The location of Lagrange points is dependent on the masses of the bodies in the system. Even if you get your masses and orbital radii so that your, say, L2 point is inside the atmosphere of your object, some of your planetary mass is then on the other side of L2, which throws all the gravity off. Furthermore, it would be effectively useless as a stability point- so close to one body, the point would be tiny and the smallest move would send you off into the influence of one of the parent bodies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(2^(n-1)-1) mod n = 0 seems only to work for prime numbers. Can somebody explain?",
        "response": "Unfortunately, it's not true. 2^(340) - 1 = 0 (mod 341) but 341 = 31 * 11 is not prime. However, it is true that if n is prime then 2^(n-1) - 1 = 0 (mod n). Indeed, a^(n-1) - 1 = 0 (mod n) for any a which is not divisible by n. This result is known as Fermat's Little Theorem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do lawyers ever work \"pro bono\"?",
        "response": "The same reason people and companies donate to charity. It makes them feel good, and it's good advertising.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is SRS?",
        "response": "They're a faux-left authoritarian hate group. But they pretend to be a \"circle-jerk\" and/or \"feminist.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it often difficult to stay awake while reading, but as soon as you put the book down and try to sleep, you feel wide awake?",
        "response": "Actually, reading can be the *opposite* of stimulating! And that isn't shade. When you read, you're (hopefully) focusing on only one thing: the book. You're laying down in bed, you're comfortable and relaxed, your body is ready for sleep. When you put your book down, your thoughts don't have the 'filter' that focused reading brings. If you have any anxious or stressed thoughts creeping back in, you are amping yourself back up again and you'll have to calm down all over again before you can sleep.  ETA: if you're reading off a screen, the blue light can mess up melatonin production, which impacts sleep.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any examples of animals practicing medicine in the wild?",
        "response": "There are parrots in the amazon that eat fruit that is toxic to them. Every evening they fly to a riverbank with an exposed clay cliff and eat some of the clay. The minerals in the clay neutralise the poison. I wish I could remember more details, like the species of parrot and the specific type of fruit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The War of the Roses",
        "response": "Before the War of the Roses was the Hundreds' year war, which weakened england. Furthermore, the next king in progression was Henry VI, who had a mental breakdown and was a super weak king. This shitty king made it seem as if this other dude, Richard the Duke of York, had a more legitimate claim to the throne.  Basically, a bunch of people wanted the throne. If you like Game of Thrones, its just the same when everyone wanted the throne after the king died. How it ended: The Lancasters won. This war was primarily fought between the Lancaster family and the York family, both of which had fair claims to the throne. After a few short wars, Henry Tudor of Lancaster killed Richard III of York in battle. After, Tudor married the previous York king's eldest daughter, ending the fight for the throne because both familys had children in power.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do sex scenes in movies work?",
        "response": "They don't really stick it in if thats what you want to know. Its a lot like wrestling, they don't really punch. They kiss and grope but they usually cover up the female genitals, there are lots of way to do that, stringless panties for example. Body doubles are sometimes used if an actor or actress is not hot enough or if they are not willing to or have too many tats and so on.  Usually on a set, there are lots of people standing around, so its not as romantic and hot as it may seem in the actual movie.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is suddenly considered modern to design websites / software in this flat style, even though it's technically less advanced?",
        "response": "Style and technology are not the same thing. Just because you can technically do something doesn't mean it's stylish. We can create shirts with LEDs all over them scrolling words across the front. If you worse such a shirt no one would claim you were stylish. Instead modern styles are more simple using fabrics we've had for many years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does peeing on a jellyfish sting actually help alleviate the pain?",
        "response": "It doesn't. Strictly speaking you're supposed to use vinegar, which uses its acidity to shut down the stinging cells. It doesn't do anything with the pain, but instead switches the stinging cells off so that you don't get a dose of venom. The difference is basically between \"you're stung and it hurts you\" vs \"you're stung and it might kill you\". Urine CAN be acidic (and if it is, it will work...though not as well as vinegar), but there's no way to know how acidic your pee is without a litmus test. Stick to something you KNOW is acidic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I know this may be stupid, but why are the majority of plants green?",
        "response": "The simplest answer is because [chlorophyll](_URL_0_) looks green. Are you asking in a deeper sense, like why aren't plants black (to absorb more wavelengths), or why does the chlorophyll molecule look green?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the imgur link that I click showing up as a blank white page?",
        "response": "I don't know why. My computer at work also does. But if you can see the link when you open the imgur link, then copy it and paste it into a new tab. That works on mine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is fire actually made of?",
        "response": "Fire isn't really a thing. It's more like a process or an action than it is a physical thing. It is basically rapid oxidation through combustion. What you might be referring to is the visible part of the fire or the flames. Flame is pretty much a gas consisting of byproducts of fire. Things like carbon dioxide, water vapor, nitrogen, or oxygen. If the fire is hot enough to ionize these gases, then the flame may become a plasma.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any actual reported cases of someone being forcibly tied to railroad tracks like you see in old movies? If so, did anyone actually die that way?",
        "response": "hi! you may be interested in these posts * [Did criminals from the West in the 19th century actually tie women to train tracks or is this just a trope from tv shows and cartoons?](_URL_0_) * [Back in the old west, were people actually tied to train tracks, or is this concept just created by Hollywood?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the difference between brown and white eggs?",
        "response": "Chicken owner here. The only difference is the breed of chicken the egg came from. We have a couple different breeds and end up with white, brown, green, and blue eggs. There's no difference in taste or nutrition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the police so reluctant to use body cameras? Wouldn't it protect them from false accusations?",
        "response": "We don't mind using it as long as privacy and cost issues are addressed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Opium Wars of China have any long term effects on the Chinese Psyche?",
        "response": "Look up the term \"Century of humiliation\", it's what the Chinese call the roughly 100 years between the opium wars and WWII/Second Sino-Japanese War. It is still a sore issue with them, and is a part of their school history books.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is taking adderall so frowned upon?",
        "response": "I think it has to do with doctors over-prescribing all drugs in general over the last 20-30 years. Kids who don't really have ADD are being prescribed it. Everyone has ADD to some degree, but some worse than others. People also abuse it, especially around college campuses to either drink longer or stay up all night for tests. I'm prescribed it and I can say I abused it in both those ways. At the same time, it helped me graduate because of those all-nighters studying and typing papers. Personally, I believe in moderation it is a great drug.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't there a continuous gradation of species between humans and chimpanzees?",
        "response": "There was a continuous gradation of species between us and the common ancestor of humans and chimpanzees, but the intermediate forms have died out. Chimpanzees have been evolving over that time as well, so they are no longer the same as our common ancestor. The topic you want to look up is [speciation](_URL_1_). If there had been no removal through natural selection of the intermediate species, humans and chimps would form a [ring species](_URL_0_), but there wasn't a niche for all those intermediates so now we are just two separate species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is a government budget not like a household budget?",
        "response": "The government is obligated to provided certain services. A household can cancel cable, sell a car, not go on vacation, even move into a smaller place. Governments can't just up and not do schools and roads and police anymore. In addition, there is a complicated relationship between government spending and the economy. Going into debt and injecting that money into the economy can make it grow, resulting in more money in the long run. A household's impact on the economy is so small spending extra money is unlikely to come back to them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any scientific/medical evidence that a cleanse is of any benefit to the body?",
        "response": "It's actually really hard to find a good scientific article that has well controlled, large studies on the matter. Probably because the whole concept of a \"cleanse\" or \"detox\" doens't make a whole lot of sense from a medical stand point. Our gastrointestinal system, livers and kidneys do an awesome job of getting rid of anything. As long as you do not have a medical condition blockage in your intestine, there is nothing in there that's older than 24-48 hours.  What we eat can influence the consistency of our stool, of course.  *[David Gorski on colon cleanse](_URL_1_) *[and on liver cleanse](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If water conducts electricity, how come when lightning strikes the ocean all the fish don't die?",
        "response": "Seawater isn't as great a conductor of electricity as one might think. The fish that take a Thunderbolt to the face are pretty much dead, but the electricity doesn't actually get too far, and, after a few miles, you won't feel a thing. So basically... Zapdos used Thunder! It's super effective! Magikarp fainted! Note that you did not just exterminate Hoenn's entire Tentacool population.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how money laundering works and why you would need to do it.",
        "response": "Because if you got money from selling drugs, its not usable to legitimate transactions that require it to be traceable from legitimate sources. By running it thru a launderer process, you make it seem like it comes from a legitimate source.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm an Russian during the Great Purges. How do I survive?",
        "response": "If you're in the military you don't want to be an officer. The higher your rank the more likely you were to be caught up in the purge. When you get to divisional commanders and above you were lucky to survive the purge. There were cases of high ranking officers who one day would be presiding over a trial and the next day they'd be the ones on trial.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Gravity An Infinite Source of Energy? If not, explain why Io has volcanic activity.",
        "response": "The wiki page on [tidal heating](_URL_0_) basically answers this question specifically, actually.  > Tidal heating (also known as tidal working) occurs through the tidal friction processes: orbital and rotational energy are dissipated as heat in either the surface ocean or interior of a planet or satellite. Io is losing orbital energy (its orbit is shrinking) to power the tides. If you let this go on long enough, its orbit will presumably shrink enough to fall out of the resonance (maybe making the entire system of orbits unstable) and thus lose its source of tidal heating. I have no idea what kind of timescale this effect takes place on though, but it's evidently pretty long for us to still be seeing it. Tidal timescales are still a big mystery for most astronomical systems, but I think rocky systems tend to be worse at dissipating tidal energy than gas giants, so it's no surprise that Io's tidal heating isn't decaying its orbit too rapidly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why don’t toilet drains go straight down? Wouldn’t that make blockages less frequent?",
        "response": "If they did, sewer gases would also come straight up. The p trap is an intentional block using the toilet water to stop sewer gases from coming into your house.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If both LSD and psychedelic mushrooms use psilocybin then why does one give you an 'energizing' experience and the other gives a more 'relaxing' experience",
        "response": "They aren't the same chemical. Only mushrooms are/use psilocybin. LSD is a man made chemical called Lysergic acid Diethly amide (aka \"acid\"). They're both hallucinogens, but act on the brain and body in different ways. However, both have therapeutic and recreational uses under the right conditions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does a warm, frequent freeze/thaw-type winter do to mosquito numbers for the following summer?",
        "response": "I don't think that the current weather will have much of an effect on the abundance of mosquitoes in the spring and summer. Currently, mosquitoes are in a state of diapause, meaning a period of decreased metabolic and physical activity. This condition typically begins in the fall when temperature and photoperiod fall below a certain threshold for a sustained amount of time. To successfully exit diapause, you need to meet those three criteria: * Change in temperature * Change in photoperiod * Sustained change over a significant period of time If we look at the current weather, we only have one of those, the temperature. However, this is only one factor that doesn't last for very long. For this reason, it's doubtful that the mosquitoes well come out of their inactive state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't planes live-streaming their black-boxes to a cloud? (No pun intended).",
        "response": "The black box for a modern jet stores a lot of information about the state of the aircraft. Fuel levels, engine speeds, position of the rudders, flaps, altitude, air speed, air temp, oil pressure, and many other sensors.  Even if we pretend we have some kind of global wireless network able to handle that level of data stream from every plane and helicopter in the air, who maintains that global network? who pays for it? who is authorized to access it? who is responsible for gathering data when the plane is on the other side of the planet? who maintains the network in the middle of the ocean? what happens when there's a network outage? do all the planes fly around that section of the sky? I'm sure there are other issues too, but this should give you an idea of the scale of issues such a live stream would create.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the brain \"wrinkly\"? How does a larger surface area of the brain give us more of an advantage over volume?",
        "response": "because the cores of your neurons are only located at the surface of your brain, the interiour consistd of their connections if im not mistaken. a larger surface volume leaves you with more neurons in total",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why some people can't sing/whistle in tune and why is it so painful to listen to?",
        "response": "Some people have perfect pitch. I have to use a guitar tuner to tune my guitar. I could do it other ways but it would take longer. You obviously have pretty good pitch. That means you can detect the frequency of sounds well. Others cannot. But they probably have some rhythm which is a lot of music. So they do what they can. You are sensitive. So it hurts for you to hear off key music.  Eventually I can tell my guitar chords do not sound good. So I retune. You would be more fussy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would someone be able to make a terrestrial (not sattelite) cell phone call from low earth orbit?",
        "response": "Cell phone towers have range of ~3-30km, and are directional, so the range is even shorter if you are far above the ground. Low earth orbit is 200+km up, so you would not be able to make a cell connection based on distance alone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how can new particles/electrons can be created?",
        "response": "This question is rather ambiguous. Could you clarify? Do you mean creation of new mass, splitting atoms into their composites, or making new elements?  TL;DR more stuff, dissecting stuff, or new types of stuff?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What actually happens when you get the wind knocked out of you?",
        "response": "An impact in the right (or wrong as the case may be) place causes a spasm of the diaphragm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could \"vertical video\" be solved with a software feature, or is it innately a hardware issue?",
        "response": "Hi there, your question is based on a false premise; the CCD is rectangular, hence the shape of the video format. The only software solution would be to crop the image, but this would reduce the resolution by about half.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we give countries names that they don't use for themselves?",
        "response": "> Why aren't the native names universal regardless of the language of the speaker? Because *language* isn't universal. Each language has unique phonemes, the individual sounds which make up a language, which means one word or name in a language cannot ever be said in a different language. You can get something *close* but if one were to learn every country's name in their home tongue would require learning a bit of a huge number of different languages. Instead we do what every language does for everything else: Come up with a new word in the local language. And that new word doesn't need to sound anything like the name in the original language.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's up with Flash Player? I heard it became extremely unsafe and it'd be best if everyone just stopped using it, but it's still everywhere like nothing happened.",
        "response": "Adobe had a disagreement with Steve Jobs. In retaliation, he made iPhones/iPads incompatible with Flash. Because the iPhone used to be the only popular/high-end smartphone, lots of content stopped using flash and started using other things (like Unity or Unreal or gaming). Then because less was made in Flash, most devices didn't need Flash compatibility to be useful. Then Flash slowly dwindled to what it is now, which is some embedded videos, and not much else. TL:DR; Adobe vs. Apple. Apple won.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the universe is constantly expanding, what is the \"space\" on the outside that gives it room to expand?",
        "response": "Asked multiple times today and yesterday and all week. Please search.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Caucasians have variations in hair color and shape while some races have single hair color and shape.",
        "response": "Some Chinese and Japanese people actually have [naturally curly hair,] (_URL_1_) and some native Japanese people are [naturally blonde haired and blue eyed.] (_URL_0_) This can probably be explained by the mixing of other races with these Asian cultures long ago, and be attributed to recessive genes. While it may be uncommon, it is certainly a noted and documented event. Hope this helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do ads put the phrase \"Many will enter, few will win\" in for contests",
        "response": "The phrase comes from CARU, the Children's Advertising Review Unit, which is a self-regulatory body for children's advertising. From their guidelines:  > The likelihood of winning should be clearly disclosed in language readily understandable to the child audience. Disclosures such as, “Many will enter, a few will win.” should be used, where appropriate. You can read the rest here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If viruses are not alive, how do they evolve?",
        "response": "Apparently, being \"alive\" is not a precondition for evolving. The definition of \"life\" is really quite arbitrary. We've constructed our definition to include all possible things that seem to have some quality of being \"life like\" to us, and viruses seem to have fallen on the wrong side of that line. They violate at least some of the [requirements](_URL_0_) that we've set up in order to allow something to be called \"alive\", but they're still made of either DNA or RNA, they still copy themselves, and they do so imperfectly (i.e. they mutate), and thus natural selection will act on them, as will other evolutionary forces.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When two objects collide, why does it make a sound?",
        "response": "Sound is just particles (in the air) moving in unison. If two objects collide non-elastically (i.e. they lose some of their kinetic energy), then that energy is converted into other particles moving, i.e. heat (random movement) and sound (coherent temporary displacement) and 'visible' movement (coherent movement).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can I not drink water by just letting it slide down my throat?",
        "response": "There are 1 tubes in your throat: one for your stomach (food & water) and one for your lungs (breathing). If too much water gets into your lungs you cannot breath (drown). Your body makes absolutely sure nothing but air gets into the lungs by making you want to swallow. Swallowing temporarily closes the tube to your lungs while also contracting the upper part of the stomach tube, forcing the water down the stomach tube, away from the opening to the lungs tube.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about Sleep Cycles",
        "response": "For your first question, this just means you were in a lighter stage of sleep (stage 1 or 2), or you were aroused (woken up) by something like a respiratory event (such as sleep apnea). There are a number of ways you can be woken up, however your [circadian rhythm](_URL_0_) also plays heavily into your sleep schedule. It is true that sleep cycles last around an hour and a half, and in short, you stay asleep and the cycle repeats. I am not a physician, however I am a Registered Polysomnagrapher (sleep technician) that manages a sleep disorders clinic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly does a power strip work?",
        "response": "The outlets in a power strip are wired up in parallel.  As you plug more items in the load does increase. Most power strips have a circuit breaker on them that will trip if you exceed the load, if not your outlet should have a circuit breaker as well. It is entirely possible to overload a power strip, it is just most consumers don't have that many high draw items in one area and professionals such as contractors already know better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there people on the floor at the NYSE?",
        "response": "Most of the people on the floor these days are just there for the TV cameras. It's more of a TV set these days than a place where people actually do stock trading.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do integrated circuits \"know\"?",
        "response": "Maths basically. If the most basic element of a computer is a switch (transistor) it can either be on or off (or 1 or 0) from there you can teach a series of switched to compare two inputs (1's or 0\"s) and derive an output - i.e. make a decision. This means you can extend out to basic maths like addition and subtraction. If you ramp this up by a factor of billions you then have a machine that can do apparently complex things using very simple maths. But a computer cannot make decisions on its own; it can only respond to certain inputs in a finite number of ways, and these need to be programmed. Its responses may seem complex but every reaction has been programmed at some stage. So the answer is they don't \"know\" - they are just returning programmed responses.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did paper/coin money become a \"thing\" instead of bartering or trading?",
        "response": "Cause its hard to trade my chickens for you pigs when I don't want pigs. I want shovels.  And even if I did want pigs, I only have 3 chickens and you want 5 chickens for a pig",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Columbus Day is tomorrow. Why did people start hating Columbus so much?",
        "response": "A [previous thread](_URL_0_?) with some very good answers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are product activation codes produced?",
        "response": "Product activation codes are produced by an algorithm by the company that makes software. You know the tickets they sell for raffles? The tickets come in pairs and have the same number on them. The same for product activation codes. They are all made in a sequence and once you enter yours in, the one on the company's side is registered to your account and can't be reused.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the line item veto unconstitional?",
        "response": "Some parts of laws are designed to work with each other. For instance, Congress might pass a law that lowers taxes on the poor and raises on the rich, as a compromise between people who just want to lower taxes on the poor and people who just want to raise taxes on the rich. If the President used a line-item veto to eliminate only one part of the law, he would basically be rewriting it, and the President does not have the right to write laws.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the American education system work?",
        "response": "We sort of have a system similar to university. We have required classes, but sometimes get to choose when we take them. This is also sometimes true as early as sixth grade (11-12 year olds).  Say we need to take two years of math. This is determined on what level of comprehension we have. I took geometry as a first year high schooler, which allowed me to take second year algebra my sophomore year, a precalculus course my third year, and calculus 1 my fourth. This was above the requirements, as most students only take algebra, geometry, second year algebra, and sometimes precalculus or trigonometry. Usually only three years are required. We can also choose which sciences we take. Usually you're required to take biology, physics, and chemistry, but you may pick the order in which you take them, or decide if you want to take them concurrently. Taking multiple of these courses opens the possibility for upper level classes in the following semester (Honors, or advanced placement classes).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the USSR communist or socialist?",
        "response": "They were Communist, in the sense that it is commonly used today. But that isn't how Marx intended it - today, it is used for any country led by a Communist party. To Marx, it meant a society where everyone was equal, where governments had withered away and capital was owned equitably by all, working by the rule of \"from each according to their ability, to each according to their need\". Communist parties are so named because they seek to work towards this end. Describing them as socialist is, however, fair. Socialist societies are defined by the fact that industry, and capital, are owned by labour, or representatives thereof. In the case of the Soviet Union, the government claimed to be representing labour. The amount to which they actually did can be debated, but I personally would describe the Soviet Union as socialist.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the severity of the flooding in Houston an example of the effects of climate change?",
        "response": "It exists within a climate that has changed. Pointing to any specific climate event is not useful - there have been big weather events periodically throughout history. What climate change predicts is that the frequency of what we regard as 'abnormal' weather will increase. So...will we look back and see this storm as part of a pattern of changes to Houston's weather? Most likely, yes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are so many people allergic to Gluten?",
        "response": "Many people are jumping on an anti-gluten bandwagon -- they're uninformed, and think that it's bad for them, or that their one symptom in common with true gluten sensitivity is actually indicative of a real gluten problem. A headache is a symptom of a cold or a brain tumor -- you're more likely to have a cold.... Regarding breeding out of the gene pool, Celiacs mutations aren't passed down to kids AFAIK, and even though it's not ideal, it's far from a death sentence for them -- there are plenty of other ways for people to get the nutrients they need to survive, other than consuming barley, wheat, or rye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Evolutionarily, why do men grow facial hair but women do not?",
        "response": "There are a lot of theories. One of the top is the communication factor.  Think about male and female lions. Same thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did humans evolve with such vast differences between individuals' singing abilities? Was this ever a part of natural selection in the se way as looks, intelligence or physical capability?",
        "response": "The voice is a muscle. If you use it you can make it better. But you also need a good ear, or you will struggle. I can hit notes now that I couldn't even have prayed on hitting years ago. Singing voices also mature and change over time and become refined. I can adapt my voice to many styles of singing with practice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can I run my car on moonshine in an emergency?",
        "response": "Mythbusters did a segment on this a while back the answer is yes but it does not have the performance of gas",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After my demise, I'd like to have myself fossilized. Would this work?",
        "response": "\"Natural\" fossilization is a very hit-or-miss process, and I very much doubt that we could design a fossilizer like you describe with a high expectation that it would actually work. There's simply too much that could happen. Might I suggest having your body encased in a large capsule of borosilicate instead?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an electronic device counts time?",
        "response": "Modern watches (well, not like smart watches, but the ones that came after clockwork) used Quartz. They found that if you pass a current through Quartz, it vibrates at a constant rate. They find out how many of those vibrations happened in a second, and voila, cheap watches.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a cool pillow feel so much nicer to sleep on than a warm one?",
        "response": "In general you need to lose a degree or so of body heat to have a good night's sleep; your metabolism slows down and that's part of the process. If you actually wake up in the middle of the night, you'll probably notice that your pillow feels pleasantly warm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the Swedes in Delaware?",
        "response": "I answered [this](_URL_0_) before, and it might answer your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are fossils/history items so deep in the ground?",
        "response": "All kinds of geologic forces push the fossils into the ground. Faults (earthquakes) usally bend and crack the crust that causes the fossils to become deeper. Also, layers of sediment end up on top of the fossils. Over millions of years the sediments really builds up and the fossils can end up very deep down. This is why you will see the oldest fossils near the bottom and the youngest near the top. But the youngest fossils will never be below the oldest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Germans produce food in 1944-45?",
        "response": "> I would also be interested to hear more information as to why such extreme measures were needed. As for that bit I think the answer is simple. People were starving and they needed something that was relatively harmless to bulk what foodstuffs they had to fill their stomachs. While not healthy or advisable it will let a human limp along through near-starvation conditions a bit longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What has been the US's problem with North Korea?",
        "response": "North Korea has threatened to drop a nuke on the U.S. They do this every now and again, or sometimes threaten to do the same to South Korea, who is an ally of the U.S. The U.S. doesn't ever take them seriously, and with good reason. The U.S. usually just sends them food and they shut up. Reddit caught wind of it this time and is making a big deal out of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take so much longer for the US produce military aircraft than it used to?",
        "response": "Tell me... how many computers were in the P-51? How many stealth features? How about communications, sensors, and jet engines? Oh... none? (With the exception of a radio) Comparing a P-51 to an F-22 is about as sensible as comparing a Model T to a Tesla... I mean strictly speaking they do the same thing... but one is a hell of a lot more advanced.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any materials that are plasma at room temperature?",
        "response": "Because it takes energy on the order of electron volts (eV) to ionize an atom and 1 eV corresponds to a \"temperature\" (actually kT) of around 10,000 K, there are no materials that are plasmas at room temperature without any external electric or magnetic fields. However, there is a whole category of plasmas called low-temperature plasmas, which are created when electrons are heated to a very high temperature by an electric field, but neutral atoms and ions stay near room temperature. Low-temperature plasmas are also typically low-density as well, one good natural example is the northern lights. They glow because of gases in the upper atmosphere being ionized by solar winds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Seeing the new laws regarding gay marriage in certain states, was same-sex marriage actually illegal in the US or was it just looked down upon?",
        "response": "It was flat out illegal. But that's a curious word to use. Since there was previously no legal provision for gays to marry, you can't really say it was illegal. They could call themselves married, they just weren't recognized as such by the government.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do apps such as \"Maps\" have a constant,up to date, traffic report?",
        "response": "\"Would you like to share your location with Maps?\" If you click No, then it pretends it has no idea where you are (which is probably true). If you click Yes, then you're telling it where you are for TWO purposes: 1. To place you on the map 2. To relay this information back to the server so it can see where *everyone* is on the map. It can see what road you're on, what lane you're in, and most importantly, how fast you're going in comparison to the speed limit. It uses this information to predict which roads are backed up and which ones are not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any limits to time dilation?",
        "response": "There is no limit. As your velocity approaches c, gamma (the time dilation factor) approaches infinity. E: [Like so](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do big cities like Chicago still have so much gun related crime despite having strict gun and gun ownership laws?",
        "response": "Gun and gun ownership laws don't stop criminals from committing crimes. criminals will still commit crimes even if they are illegal. these kinds of laws typically only work to keep the honest people honest. kind of in the same way that \"gun free zones\" don't stop mass shootings. they' don't create a magic force field that keeps guns out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does anyone know what happened after the picture in Tiananmen Square?",
        "response": "Well, it is not a photograph but a still from a video. I remember watching this on the news. Here is the first 2 minutes, including the standoff and restart of the tanks: _URL_0_ I cannot source anything else so I will refrain from speculating who the guy was and what happened to him.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do low pitch bass frequencies not seem as \"loud\" as treble frequencies?",
        "response": "Your brain doesn't perceive all frequencies at the same level. Which makes total sense if you think about it, for example the most sensitive range of hearing is around 3-5kHz which is right around the peak of baby cries. An ok-ish plot of your ears sensitivity is called the Fletcher-Munson curve which points out how low frequencies need much more energy to be perceived at the same level as higher frequencies.  On top of that, for bass frequencies you don't hear it so much as feel it in your chest cavity and throat.  And lastly testing bass response on people is finicky, especially indoors. There are peaks and nulls in the room where you won't hear anything just based on location. Furthermore creating low frequency sounds accurately is not cheap to do right for a test.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the internet hate Nickelback?",
        "response": "Nickelback is one of the more bland bands in the world. They don't innovate, they don't take risks, and they don't change.  They have made seven albums since their inception. All of them are basically exploring the themes of strippers, sex, prostitutes, drugs and drinking.  The internet sees the insincerity in their music. Combined with their blatant cash-in work and the majority of people dislike them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't people take Ron Paul seriously?",
        "response": "ELI5: The various ideas that Mr. Paul likes would involve changing a whole lot of things that people have gotten used to. When people get used to doing something a certain way, they usually don't like to change, because it's hard (like it's hard to instantly stop running if you're running really fast).  Even if things aren't going real well, people still usually don't like to change. Sometimes that's because they're lazy, sometimes it's because they're greedy and are getting something from the system as it is, and sometimes it's because they're afraid if they change, then something will break.  When you make changes, sometimes things break that you didn't expect. As hard as you work and as carefully as you plan, sometimes when you change stuff, things happen that you didn't plan for, and something breaks. So that makes people scared of change.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you not see flowers almost anywhere in the wild where not purposely planted? Where are roses and tulips etc. actually from that we never see them?",
        "response": "Most of what you see were created by people through genetics whether naturally mixed or in a lab. Wild roses and tulips are prolific where they are native, but they aren't that interesting to look at. Forests on the east coast of the USA are largely deciduous, but on the west largely evergreen. Both grow in both places, but historically they naturalized where they are. You likely don't live where roses and tulips are naturalized and native species, and even if you did, they look nothing like what you buy at the store.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is protein powder ruined when mixing it with orange juice because the acid denatures the protein?",
        "response": "No, that's complete nonsense. As I [explained yesterday](_URL_0_) (see the bottom of the comment, specifically), it doesn't matter one bit as far as nutrition is concerned whether or not a protein is \"denatured\" or not. Metabolism of protein involves breaking them down into their constituent amino acids.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that TVs only used to be in black-and-white and what did we change to make them in color?",
        "response": "Because way back when, that was the only way we knew how to make TVs. And even when we had the technology, most the of the broadcasts were in black and white, so it didn't make sense to switch right away. And even when most of the broadcasts were in color, black and white TVs were a lot cheaper. Color TV as it exists today wasn't invented until the 1950s, and color programming wasn't common until the 1960s. Black and white programming persisted in the US until the early 1970s, and black and white only TV stations existed until the late 1970s. Cheap black and white TVs, particularly for small, portable TVs, were sold until the early 1990's.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do dogs feel emotions similar to us humans?",
        "response": "To your main question: a qualified yes. Dogs feel pain, happiness, joy, sadness, etc in a similar way to humans. It's not exactly the same, because human emotions are affected by our highly developed rationality. This means that humans will try to understand the emotion, look deeper into the causes of the emotion, and/or attempt to suppress/maximize the emotion.  A dog will know if another dog is no longer around, and will definitely know when its \"master\" isn't around. Will it necessary know that it has died? I doubt it, because dogs don't understand concepts like \"death\" to the same degree that we do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it work to close one eye and fully open the other on a bright sunny day, but you must squint if both eyes are opened?",
        "response": "At one point I had an eye infection that made it hurt whenever my pupils dilated or contracted. Even though the infection was only in the left eye, bright light in the right eye would hurt the left eye. The doctor explained that even though light only entered one eye, the pupils do not react completely separately. Light in one eye caused both pupils to contract. Perhaps if one eye is open, the pupil contracts slowly, but if both eyes are open, it contracts too quickly, causing pain? I'm far from an expert, so feel free to correct me if I'm wrong; just thought I'd share what seems to be a relevant experience!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to a lossless audio file in a car sound system?",
        "response": "Well the audio is stored digitally on your iPod, but it's converted to an analog signal before it goes out of the headphone jack. The file itself doesn't leave the iPod, it just tells the iPod what audio to output (in the form of 0s and 1s), and that's what goes into the aux port.  Unless the headunit or audio processor converts it *back* into digital audio (which I doubt they would), it won't be degraded in quality. If the file you're playing is truly lossless, it's just as good quality as you can get from a CD (possibly better even, depending on the bit-depth and sample-rate of each).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you smoke marijuana, many people tend to be able to eat and eat without feeling full or getting sick of eating. How is this possible?",
        "response": "THC triggers the release of Ghrelin which stimulates the hypothalmus to initiate the feeling of hunger, increase stomach acid production, prepare the body to eat etc... When rats being exposed to cannabis were also treated with ghrelin blockers, they didn't display the characteristic increased food intake seen when cannabis was administered alone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "does anyone know what Search algorithm Microsoft Excel uses?",
        "response": "There doesn't seem to be very much information about how exactly it makes guesses. One person speculated that it uses the [bisection method](_URL_1_). If you're just trying to find the solution to a function of X, you might want to consider [Newton's Method](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between software and application.",
        "response": "Software is a general term that comes in contrast to hardware. While hardware is the physical, tangible parts of the computer, software is the logic and code that runs on the hardware. An application is a specific type of software, intended for a specific task (or tasks). The operating system (which \"runs\" your computer), the device drivers (which help the operating system communicate with the hardware) are examples of software which isn't applications.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "It's 1880 in Australia, who has \"an accent\"?",
        "response": "Everybody. Everybody has an accent - especially since it was before any sort of standardization, like RP of today, and we really can't tell what was the accent before modern recording devices. Both free settlers from UK and the convicts were derived from various counties and countries - around 12% of convicts came from Ireland, for instance, and many Welsh convicts did not speak English. A significant number of settlers were Londoners, and perhaps this was the basis for what's today an Australian accent, but the population varied wildly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are insects attracted to artificial sweeteners?",
        "response": "Not a bad question, considering [the statement in this abstract from a 2001 paper](_URL_0_)  > As far as we know, the present work is the first report describing that a non-sugar sweetener for humans induces a sweet taste in insects. In behavioural experiments, we found that glycyrrhizin induced the feeding response",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible (or are we able) to isolate cytosol from a cell or group of cells?",
        "response": "Yes, absolutely.  [This](_URL_1_) is a kit that is commonly used in laboratories for the isolation of the cytosol, and [this](_URL_0_) is an article discussing the protocols involved and their usefulness.  Hope this helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Around what time did the Vikings become Christian, and what did it mean to them.",
        "response": "Hi! I'm really hoping that some of the viking specialists in this sub will jump in with lots of information for you, but meanwhile, there have been several previous posts asking about the effect of Christianity on the Norse people. See these for the previous discussions [What was the importance of christianity reaching the vikings?](_URL_4_) [Why did the Viking Age end?](_URL_6_) [What happened to the vikings?](_URL_0_) [Why did Christianity win over the Nordic and Germanic religions?](_URL_1_) [In ancient Northern Germanic and Norse culture, what sorts of impacts did the advent of Christianity bring to their culture?](_URL_2_) [How did Norsemen transition from Vikings to an extremely progressive welfare state?](_URL_5_) [Why did Christianity spread so quickly---what was the appeal, especially to chiefs/kings/upper classes?](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does bacteria cause bleeding with a UTI (blood in urine)? Are they biting you?",
        "response": "While the picture you painted is quite uncomfortable to think about, you were closer to the target with your earlier assumption. An infection in your bladder (or anywhere) increases blood flow across the lining of the bladder, just like a trauma would at any other part of the body. The lining of your bladder swells and gets “irritated” as you said, and this irritation allows blood cells to leak through the very small capillaries out into the organ. The blood then flows out the urethra mixed with the urine and can give it that tinted red (sometimes referred to as Coca Cola color in more severe cases).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't Magic Johnson developed full blown AIDS and died years ago?",
        "response": "Because he can afford the best medical treatment, and we have some pretty good treatments for HIV these days that don't make it an instant death sentence anymore. Can't cure it, sure, but mitigate it? Yeah. Mostly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Melania Trump the first 1st generation immigrant to live in the white house?",
        "response": "No. Luisa Adams (John Quincy Adam's wife) was born in London. They met in London and married two years later. Her parents were British and his dad (John Adams, then US President) took some time to accept the marriage due to her foreign birth. John Quincy Adams became President in 1825, and she was the first foreign born first lady (and only one until Melania). Edit: Her father was actually American born but her mother was British.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were there any important 'States Rights' issues apart from slavery?",
        "response": "There have been many throughout history. As mentioned, tariffs were a large issue early on. Warmaking authority was contested around the War of 1812, but given the fact it is explicitly laid out in the Constitution it was not a particularly strong argument. Slavery, as you said. Then, there were a number of issues regarding the Reconstruction amendments, particularly the Equal Protection Clause. As you move towards the modern era: commerce powers, racial civil rights, gay civil rights, gender equality, abortion, drinking age (and alcohol in general), drug policy, guns, (and more that I can't remember off the top of my head) are all states' rights issues. Federal legislation and/or Supreme Court cases have all attempted to regulate these issues and all have caused backlash by certain states.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Tuesday Trivia | Time Travel Tourism",
        "response": "I would go back to 1858 to witness the trial of William \"Duff\" Armstrong, a man accused of murder in Beardstown, Illinois. His defense attorney was Abraham Lincoln, who famously impeached the sole witness to the alleged murder by producing an almanac showing the lunar phase on the night in question. The witness testified that he was 150 feet away from the incident, but he could see it clearly by the light of the full moon, and he saw Mr. Armstrong strike the victim. Lincoln presented an almanac showing that the moon that night was not full -- it was only in its first quarter, and that at the time of the alleged murder the moon would have been setting, meaning the witness could not have seen anything from that distance. _URL_0_ It's a very famous story, and it would be fascinating to see the man who would become the 16th President in action as a lawyer. It would also satisfy my curiosity about Lincoln's purportedly high-pitched voice. _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do spacecraft navigate in space even though there's no fixed point about which a co-ordinate system can be made, and there's no concept of direction in space like north-south or up-down?",
        "response": "In Earth orbit the obvious reference is Earth. Outside: We have points that are essentially fixed: The Sun is a great reference point, bright stars and the center of the galaxy are other reference points you can use for navigation. While the Earth is moving in the solar system, we know its position with great accuracy, so it can be used as reference frame as well (=\"where the signals come from\" for spacecraft). Stars are not perfectly fixed, but their motion is irrelevant for navigation within the solar system. The ecliptic (the plane of the Earth's orbit) is another good reference frame. You can't measure it directly, but you can express the position of stars relative to it and then use the stars for navigation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If zero times anything is zero, and infinity times anything is infinity, then what is zero times infinity?",
        "response": "\"Infinity\" is not an element of the standard real number system, so if you want to say something like \"infinity times anything is infinity\", you have to choose an alternate system of numbers that actually includes infinite values. There are several of these, which appear in different areas. Using the extended real numbers, which includes points +infinity and -infinity at either end of the real number line, 0 \\* +infinity and 0 \\* -infinity are simply undefined. Using the cardinal numbers of set theory, there are many different infinite values, but you still have x \\* 0 = 0 for any x, whether finite or infinite. As with anything in mathematics, you have to be precise about what you mean by \"zero times infinity\" before you can talk about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much closer (or further away) to war during the Cold War were the US and USSR than South Korea and North Korea are today?",
        "response": "Though this question has been reported, probably because it touches on current events, I'm going to allow it because: * it features a historical component * we have an excellent North Korea expert whose responses are always a joy to read",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Water level of ice water before and after melting.",
        "response": "The level will stay the same. Reason: The ice, when floating in the water, is displacing its weight, pushing exactly that much water away from itself. After melting, the same weight of water is present, thus displacing the same amount of water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do cryptographic hash functions work?",
        "response": "They work in a really complex way that is too hard to describe. But they are maths that, when provided with a large bit of data, output a shorter, fixed length bit of data that: 1. appears totally random 2. changes completely and apparently randomly for any change in the input, no matter how small. 3. Does not allow a person to calculate what the original was from the hash, apart from making lots and lots of guesses until you get lucky. 4. Does not allow a person to find another bit of input data that produces the same result, apart from brute force guessing as per number 3. 5. Is relatively difficult to produce, making the brute forcing difficult.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Each parent contributes one chromosome from each chromosome pair to their child. Is it possible that two siblings receive a disjoint set of chromosomes and end up unrelated?",
        "response": "There is a 1/(2^23) chance of that happening, not counting crossing over.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is going on when you feel your stomach drop out, (when on a roller-coaster/airplane in turbulence), and how exactly does your bladder cause pain?",
        "response": "For the example you gave involving coasters and plane turbulence, the feeling comes from brief weightlessness during \"free fall.\" Normally your stomach and intestines are settled in the abdominal cavity from gravity. In the short moments on a roller coaster or in a plane during turbulence when you drop these organs are slightly \"loose\" from where they should be. You feel this shift, as well as when they return to their proper position.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So...what was the Dreyfus affair?",
        "response": "Adding to this, what did contemporary non-French people think of the affair?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How MMOs can handle thousands of players yet other online games generally can't handle more than 8 - 32 players.",
        "response": "To start with, if you're playing an FPS, everyone needs to know *precisely* where everyone else is, with a very rapid update. This takes a lot of network traffic & a lot of CPU time to process. MMOs, OTOH, can get away with less accuracy & less frequent updates - all that really matters is if you're standing next to the dragon or not. Secondly, most MMOs split the world into regions that can run on different computers. A single \"server\" might actually be dozens of machines. Thirdly, a lot of multiplayer games have caps because it would just be too chaotic if there were more players on the small maps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do electric trams work?",
        "response": "The overhead catenary is the \"live\" wire and the circuit is completed by the rails on which the tram runs and are grounded.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is this specific sound effect of children laughing and playing used over and over and over again in movies/tv shows?",
        "response": "Recording new sound effects is expensive, so to save money, sound designers pull unimportant / generic sound effects from an existing library of pre-recorded stuff. You're not supposed to notice it, but sometimes certain sound effects get so overused that they become a joke. The Wilhelm Scream is the most famous example.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were Ainu allowed into the Imperial Japanese armed forces?",
        "response": "Related question: How did WWII era Japan treat the Ainu populace?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What prevents viruses from jumping between species?",
        "response": "It’s my understanding that viruses attack specific cells; the enter the cells by using almost like a key. The key doesn’t work in different cells though, including cells in different species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we grunt/scream when doing strenuous exercise?",
        "response": "Everybody uses their tummy muscles. But sometimes, when you squeeze really hard while you poop, you squeeze some air out! Same thing if you are lifting heavy ass weights. You're squeezing air out. Even though you are A. Trying to keep it in or B. Go for an extra bit of power by forcing all the air out and really *really* using your abdominals. Edit: its the same reason that people doing martial arts either yell or do that hissing noise. they are tensing their midsection to help squeeze every bit of power out of their body.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how are we able to have emojis and even send gifs that play inside text bubbles but we still are unable to use bold or italicized text in text messages?",
        "response": "It's not overlooked, exactly. Whenever you design hardware or software, you start with a laundry list of things you want to include, then cross things off the list when they become impossible, impractical (i.e., too expensive to manufacture), or just unimportant. There are a ton of things that designers want to do with phones, but not all of it makes it into the same version. People aren't begging for bold or italics inside text messages, so why add more code to your phone to make it happen?  They'll put their efforts somewhere else until it becomes a point that people would be willing to look at in selecting their new phone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many civilizations, nation states and people have controlled Anatolia?",
        "response": "Original inhabitants of Anatolia were very likely the people who have left behind Gobekli Tepe. However, it's hard to say because Anatolia has been inhabited since the paleolithic.  The civilizations once controlled Anatolia or parts of it are: Hittites, Hurries, Assyrians, Sumerians, Meds, Persians, Urartu, Phyrigians, Galats, Armenians, Greek speakers(Ionians, Lydians, Lycians, etc.) Seleucids, Romans, Sassanids, Seldjuk Turks, Ottoman Turks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was it in Great Britain 1 year before The Roman Conquest?",
        "response": "Bloody cold and bloody wet, i imagine. Furthmore it was a much less developed region which tended to lean heavily towards hillforts such as Cissbury Ring (A recent example I visited a while back). Agriculture and foraging went on side-by-side however. I have myself encountered archaeological evidence of grain and chaff within samples taken from digsites across the South-East that fell within the neolithic context. The closer to the coast one moved the settlements became a little harder to pin-down and in some instances the inhabitants were intransient fishermen which huddled around river estuaries. To go deeper would be to surpass the extent of my knowledge on the time period, as I didn't study ancient Britain in detail, so it would be best to take onboard other answers besides mine. The notion that the Britons were just hunter-gatherers who liked chariots is utter nonsense however.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does our saliva “change” before we are about to vomit. Whether it be a rapid build up of saliva or saliva getting runny.",
        "response": "saliva can help protect against the damage of stomach acid that comes up with vomit. coating your mouth in as much saliva as it can is a way to defend it",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we know that Life can exist in extreme situations in various forms and we know that universe can support insane probabilities to exist - Why exactly we still look for \"habitable zone\" in star systems to search life ?",
        "response": "Not because no other life could exist. But because this is one combination we *know* supports life, so the probabilities based on our limited knowledge are higher.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does water evaporate from oceans and seas when the boiling point of water is 100 degrees centigrade?",
        "response": "Let's start with the layman's definition of temperature. It's the average kinetic energy of all the particles. However, individual particles can have and often will have more kinetic energy than that, meaning that individual particles can possess enough energy to \"evaporate\" and escape the ocean.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it some people can consume whatever they want and still be lean?",
        "response": "While there must be some natural variation in the degree to which people process and metabolise fat-- in fact, genetic markers for predisposition to weight retention have recently been identified-- it always comes down to the amount of calories ingested relative to the body's needs and ability to metabolise fats, carbohydrates, etc. It's very easy to under- or over-estimate how much a person is truly eating; a small amount of junk food, while likely poor in nutrients and nutrient-quality, will not enable a person to gain weight as much as an excessive amount of healthy food. Since you're not talking nutritionally, from a purely physical standpoint it's literally all about caloric intake. Regardless of what foods are being consumed, if the calories are there, the body will build muscle and store fat. If the calories aren't available, then people stay slim.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In movies, how to they get the glass in windows/windshields to break as if a bullet went through it?",
        "response": "Other folks already mentioned the squib. However, as a separate fun fact, normal glass found in houses, drinking cups, etc is made from super heated sand (over 3000F). As you know is super sturdy, hurts like hell if you break it, etc. You can compete this same process with sugar instead of sand. The sugar glass is far far more brittle and doesn't shard as badly. However, when filmed (combine with added sound effects) appears like sand glass. So it's far easier and safer to punch, be near when a \"bullet\" punctures it, etc",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How cold would it have to be for a large body of water like the ocean to freeze over?",
        "response": "The key thing here is the average global temp, right now the average is around 57 F. If the average temperature is below the freezing point of water 32f, then eventually everything freezes. The total freezing process gets very interesting if it's between the freezing point of fresh water (32f) and salt water (~28f)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was a white, aggressive, vocal opponent of racism treated in 1930s America?",
        "response": "Not a historian here, but it seems to me that you might qualify this statement a bit; I can imagine the white community of a middling-sized town in Alabama was different than a Northeastern city, or a city in the northwest, or whatever. They all, presumably, had racism pervade pretty much all aspects of the community, but the differences lie in how overt or covert it was, and whether it would have been recognized as racist by a wide swath of Americans (meaning, separate but equal schooling--which is clearly racist--might not have been particular viewed as racist, while a tolerance and encouragement of lynching would be clearly viewed as racist).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would earth be like without the moon?",
        "response": "Without the moon, many of the species of animal which currently exist would die off, for one. Animals which depend on the existence of the tides, for instance. Or animals which use the light of the moon in navigation (like it is believed moths do). In fact, humans are highly dependent on the tides as well, and have been for as long as we've been taking advantage of the oceans' bounty. Would the Earth fall apart or something without the Moon? No. But if the Moon suddenly stopped existing or was somehow flung out of Earth's orbit unexpectedly, it would have serious impacts on the biosphere as a whole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would repetitive consumption of a incredibly hot pepper (Carolina Reaper, etc.) eventually yield lesser physical response?",
        "response": "Capsaicin, the spicy component of hot peppers, does indeed cause desensitization of the TRPV1 nociceptor with prolonged activation. This seems to underlie some of the effect of topical capsaicin against several types of neuropathic pain. _URL_0_ _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Jet Turbine Engines not use gears (like a car)?",
        "response": "Turbine does not work the same way. What propels you is the gas or just air that it shoots of behind. It works off of conservation of momentum. When you use a turbine you also need a compressor to feed it air. If there was no energy losses due to friction etc than there would be no net loss or gain of work. What gives it the gain of work is burning of fuel that changes the air pressure and speed that comes out of the turbine which makes the blades spin faster also.  To add the blades change tg e air speed and pressure also but with out fuel not enought to create enough work to surpass the compressor",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would people who today use glasses have lived in a time no glasses were available?",
        "response": "This came up recently on /r/AskHistorians. The basic gist was that conditions like nearsightedness were probably very rare until the modern age. Modern vision problems probably came about because of artificial lighting in indoor spaces (and before this, peoples' nighttime habits were different from how they are now, so indoor reading was less common).  So... there wouldn't have been people who needed glasses back then.  Here's the [thread](_URL_0_), if you're interested.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do towels smell after being used for some time even though we only dry ourselves AFTER showering?",
        "response": "While drying you slough off dead and dying skin cells loosened by the wash. these combined with the steamy warmth of your bathroom allows bacteria to grow. They die and their corpses rot. And that stinks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Netflix get away with calling a show such as Death Note a \"Netflix original\"?",
        "response": "Original airing rights for the US. Also production originality for the live action remake (which was awful). Its actually kind of annoying how they do that, and I'm not sure why they do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Queen Victoria ruled over one of the most powerful empires in history for almost a century. So why did it take until 1918 for women to be considered politically intelligent and allowed to vote?",
        "response": "You've got to remember the changes in 1918 weren't just about female suffrage. Prior to the changes men had to be home owners and over the age of 21 before they had the right to vote. That at the time meant somewhere around 40% of the male population was also ineligible to vote. Men had returned from war to a parliament that hadn't been voted on in 10 years and a lot of the people returning who had fought and watched their friends die, were denied the right to vote. As you can imagine it lead to a lot of tension within the UK and people were demanding political change. Womens suffrage mirrored a lot of issues for people returning from war so it also gained a lot more public support. It's easy to get angry about something when you're already angry so it became a very important subject as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do animals know when to stop hibernating?",
        "response": "Generally, the timing and length is based on temperature.  Yes they do wake up midwinter if its unseasonably warm but go back to hibernation if it goes back to being cold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Biology] What's the scientific reason for the hymen?",
        "response": "Looks like it's already been asked [here](_URL_0_) Sorry for wasting your time :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a ceiling fan cool a room, while increasing the average kinetic energy of the air molecules in the room?",
        "response": "The temperature of the room will increase. However, around your person exists a pocket of air warmed by your body metabolism. When a fan is turned on, it disrupts this pocket of warm air, cooling you off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come you can be at a point where you have to poop SO BAD it is almost completely unbearable, but after a few excruciating minutes that feeling just 'goes away'? Does the poop literally go back up the intestine? What happens?",
        "response": "Buy sugar free Haribo, eat a handful and you'll be pooping until there is no poop left.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since bugs are attracted to lights why are there no land predators that use bioluminescence to attract bugs?",
        "response": "[There are](_URL_0_). But the lights bugs are attracted to are usually quite bright, brighter than most reasonable bioluminescence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any chemical reactions that would dissolve the container they are contained in?",
        "response": "Yes, that is one example. A solution of HF will etch glass. The F- ions react with the silicon and volatizes it. EDIT: spelling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we survive solely off of vitamins?",
        "response": "The problem is that the human body runs on a lot more than vitamins and minerals. While they are essential for certain functions within the body, they do no power the body itself. The calories you see on food packages aren't an actual item or thing inside the food. Calories are a measurement of energy. (Just imagine if the package said joules instead of calories). When you hear that you need 2,000 calories a day that doesn't mean you have to consume X amount of food, it means your body is spending X amount of energy. Knowing that, the most compact form of calories is... fat. However even then you only get a whopping 9 calories per gram. Not to mention that it takes a lot of effort for your body to break down fat into useful energy.  If we were ever to create some sort of \"food pill\" that could reduce our daily meals into a few small pills, we would have to find a way to compact organic energy into an extremely tiny place *as well as* have some sort of way for our body to effectively break it down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are biracial black-and-white people referred to as black but never as white in America?",
        "response": "The US Census and laws played a huge part in this. The so-called \"One-Drop Rule\" made it to where legally, if an individual had a drop of black blood in them, they were considered black. This was clearly a tool used to disfranchise people of color. This is an interesting policy to juxtapose with laws regarding status as a Native American. One typically has to prove a larger percentage of racial ancestry in order to be considered Native, and therefore again, making it harder to receive the benefits deserved by these populations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is blood circulation restored after a limb is reattached?",
        "response": "Surgeons have to stitch the vessels together initially.  This is true for organ transplants as well. Eventually, new vessels can grow and take over from ones that may have damaged, and some of the tissues which were damaged due to lack of oxygen will heal or be replaced.  But yes, you need to restore major circulation when reattaching a limb or putting in a new organ, otherwise you risk the organ / limb rotting when there isn't enough circulation to keep things alive.  Source: in medical school.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the controls on most fans go \"Off, High, Medium, Low\" instead of gradually going from Off to High?",
        "response": "The reason I have repeatedly seen on Reddit is that some fans need to start in \"high\" to overcome the resistance from not moving. In other words, the power output from the motor in \"low\" might not be enough to get the fan moving. Going from \"high\" to \"low\" however, doesnt require any additional work",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we percieve certain colours as bright?",
        "response": "If something is bright, that just means that a lot of photons bounce off of it instead of being absorbed by it. If too many photons go into your eye, the pain is your body realizing that all that light is too much for the receptors (rods, in this case) and that you should close your eyes to prevent damage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the tachometers in old racecars mounted at such an angle?",
        "response": "because it's not important to know what RPM you're at when it's < 2000rpm.   it IS important to know what RPM you're at when it's 7000-8000.    so the important part is on top, where it isn't blocked by the steering column or anything else.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who is the earliest recorded human?",
        "response": "If you're referring to the earliest known record of a named human being, the answer is Iry-Hor, an early Egyptian king who ruled in the 3100s BCE. See u/kookingpot's earlier answer [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Signal Bandwidth and Modulation",
        "response": "Pretend the carrier is like water in a hose. You can see when the flow changes. If we have agreed on what flow changes mean what, we can transfer information by changing the flow. If I'm at one end of the hose I could step on it in a pattern, and you could see the changes at the other end and using the pattern figure out what I was sending. That's an extremely simplified explanation, of course.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Microscopes: What exactly am I looking at?",
        "response": "Looks like a [blade of grass cross section](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do contemporary artists seem to produce art in groups of multiple compositions following one theme? Or has it always been like this?",
        "response": "A lot of these groups can go on for years and years. So it's not really like \"muck together 10 paintings that look kinda similar for a show\", but maybe a decade long fascination with certain techniques or types of imagery.  It's a bit like how people will refer to Picasso's \"blue period\", but this literally just a period in Picasso's career where he was painting in a certain style, often using similar subject matter and a lot of blue colors. It wasn't like he sat down and said, \"I'm going to spend 5 years painting a lot of sad musicians on blue backdrops,\" it's just what he was into doing for a while until he then got more into cubism a few years later.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did jokes about Pearl Harbor become acceptable?",
        "response": "Followup, or maybe return question for OP: what were such jokes? I ask because honestly, I've never heard one before, and my parents came of age during the war itself but had rather dark senses of humor.  It's odd that I have never, ever heard one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Stock market question",
        "response": "The price of the stock isn't set by a specific individual so nobody in particular \"attaches a dollar amount\". There's nobody making that decision. Instead it's a \"hive mind\" or a consensus. In the case of Woods the consensus was that Nike would lose business due to what had happened. However, the hive mind is a weird thing and can be prone to overreaction. So in your example the stock fell by 50%. I don't know if you're using actual figures but let's take them as an example. It would be very surprising if the Nike business as a whole became worth 50% less because of Woods' behaviour. But what can happen is that loads of people who own Nike stock go \"AAAAARGH!\" and panics and hits the sell button. So the response of all those people who got scared by the event causes the drastic fall. It's not totally crazy either, because a lot of people will think \"well, even if the stock only drops by 5% this means it's time for me to sell\" and then everyone who thinks like that causes the stock to drop and drop.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was Schrodinger's cat actually trying to explain?",
        "response": "Schrodinger was criticizing quantum mechanics. It wasn't trying to explain anything, it was an attempt to discredit the idea. He thought it was ridiculous and contradicted common sense. Thus he made Schrodinger's cat, since we know that a cat cannot be both dead and alive at the same time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When looking at a patern for long enough why is there after image if we look at wall or any plain background?",
        "response": "You are actually seeing an inverted image. This is because when your eyes get used to seeing a specific image, it wears out the receptors in your eye that detect those particular colors, since they need a few moments to get back the neurotransmitters they use to send information on what you're seeing back to your brain. Since these light-detecting cells are \"tired out\" they struggle to react even when you move your eyes elsewhere. So if you see something red for a while, and then look at something white, you won't detect the red coming from that white light (since white is all colors of light) since your red-detectors are tired. So it looks instead like you are seeing something that has *no* red light, which makes it appear green to you at first.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With hundreds of thousands of registered users, why do front page links on Reddit top out at 4-5k upvotes?",
        "response": "OK, so this hasn't been mentioned yet, and this is somewhat important: Reddit just squashes votes. Straight up, number drops precipitously if it gets too high. [From last time this came up:](_URL_0_)  > It's because reddit has a vote-squashing algorithm. Have you guys not noticed that every well-voted thread ends up somewhere around 4000-5000 points? Have you not thought it a little bit weird that with something like a million and a half unique daily visitors, the top posts are just as upvoted as they were a year or two ago?  > The idea is that a pure count of votes isn't a \"fair\" way of doing historical all-time rankings: you would end up with newer content trivially displacing older content that, just because there were more users seeing it and thus voting on it.  > This may be interesting for you all: _URL_2_  > E: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do petrol prices change so often but not other things like food and other stuff that's imported.",
        "response": "Oil is a commodity and has few alternatives, which its price makes it very sensitive to changes in its supply. Food, on the other hand, can vary - usually you get the manufactured good which has more alternatives",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I blow my mouth up; why does a small pocket of air open up near my jawbone causing severe pain.",
        "response": "Like blowing balloons and your jaw feels sore?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes that constant ringing in your ears and why does it get louder and softer seemingly at random?",
        "response": "That’s tinnitus my dude, and not everyone has it. It’s not actually getting louder or quieter, but your attention sometimes just noticed it more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it bad to consume things full of bacteria if you don't get physically sick from the bacteria at all?",
        "response": "> Is it bad to consume things full of bacteria if you don't get physically sick from the bacteria at all? Not at all. There are literally millions of bacteria in ever cc of fresh water and if you didn't have bacteria in your gut you would be way worse off than having them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come 911 works when there is no cell phone service due to being in a remote area.",
        "response": "\"No service\" on your phone actually means: \"There is no signal from a carrier that recognizes that you have an active, billable account allowed to make calls.\" However, since an active, billable account isn't required to make a 911 call, you can make a 911 call from a cell phone as long as there is any provider in range who has the technical ability to receive your phone's signal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do alkalis taste of?",
        "response": "Bitter and gross. From an evolutionary perspective, this is probably due to the fact that many naturally occurring poisons fall into a category called alkaloids, which are alkaline molecules. Common examples are caffeine, piperine and piperidine (both extracted from black pepper), and nicotine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can animals eat all sorts of crazy things (grass, rotting flesh, their own shit) but we have to eat things that are cleaner/healthier/cooked?",
        "response": "As someone who has suffered starvation I can confirm you can live relatively comfortably eating things most would deem inedible. Cedar bark, dandelion greens and tree jelly for a start.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If company A pays company B money as acquisition, does company A now own that money?",
        "response": "Both Company A and Company B have owners. When a company acquires another one they are not paying Company B but rather the owner of Company B. Imagine you you buy a chocolate bar of your friend. The chocolate bar represents Company B, You are not giving the money to the chocolate but rather the owner of the chocolate. In this scenario the chocolate is Company B. So to answer your question. Company A does not now own that money. The money is owned by the former owner of Company B.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If DMSO can absorb pharmaceuticals and permeate skin, why do we both with subcutaneous injections?",
        "response": "I would say that, first off, I don't know if we use subcutaneous injections all that much . A vast majority of medications are taken orally, and those that aren't are typically administered intravenously. Subcutaneous is a relatively rare route, in comparison (IIRC). Most common SC injection I can think of would be insulin. That said, there are a number of therapeutics (mostly proteins) that are probably better off injected SC rather than IV. In most of those cases, point 2 below would be relevant. Besides that, I'd say that: 1. As you said, many drugs are not soluble in DMSO in relevant amounts. 2. Even if something *is* soluble in DMSO, if it has too high a molecular weight, it still will not be transported through the skin ([e.g. insulin](_URL_0_)). 2. DMSO is toxic to cells, so while I doubt it'd be damaging to have an occasional patch-based administration, I imagine you'd want to avoid it being a super frequently used approach.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does this study imply that people will live longer if they worked out *without* taking (much) protein?",
        "response": "I'd be interested as well, although to clarify they didn't participate in weight training, only endurance/running exercises.  I bring up weight training because every study I've come across advises to consume more protein that the RDA.  _URL_0_  > For maximal muscle hypertrophy to occur, weightlifters need to consume 1.2-2.0 grams (g). protein kilogram. (kg)-1 and > 44–50 kilocalories (kcal).kg-1 body weight daily [1-9]. **This is considerably higher than the recommended dietary allowance** (RDA) for protein (currently 0.8 _URL_1_-1) which meets the needs of 97.5% of all healthy adult Americans not engaged in weightlifting with the intent of gaining muscle mass [8]. Bolding is mine. It appears the [low-protein diet](_URL_2_) from the study constituted a ~.73_URL_1_ ratio, which to me doesn't seem that much lower than the .8_URL_1_ RDA. I couldn't find any studies on the effect of weight training and cancer risk/prevention.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Rocky Planets in our Solar System are created from the asteroid Belts. Could that also happen now?",
        "response": "The mass of the entire asteroids belt is 1/35th of that of the moon, and most of this mass is in the 4 largest bodies. according to the modern formation scenarios for rocky planets (stream instability followed by core accretion), such belt cant form any planet. Edit: let me add that Jupiter would forbid the formation of any large body near it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do computers measure time?",
        "response": "There is an element called a quartz oscillator. When you try to transmit electric signal through it, it will output square-shaped waves so precisely, that every wave would be perfectly timed. The one frequency that is used in time systems is 33kHz. That means that when in one solid second of electrical impulse you'll get 33000 perfect waves. The computer is fast enough to count every wave, and when it hits 33000, the system will clank another second. Since quartz oscillator needs constant power to work, the time system works on individual power source to count the time even when the system is off. That's why we have batteries on our motherboards. To count time, computers mainly use UNIX time. UNIX time is a very long number that says how much seconds had passed from 1st of January, 1970, at 00:00:00 UTC.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do photons have no reference frame?",
        "response": ">  > What am I missing? any kind of relativistic treatment of the problem.   you make a lot of unphysical assumptions that are in direct contradiction to relativity. you are basically just pretending physics is classical and the speed of light is like any other speed.  a massive object cannot go at the speed of light in any frame. you change frames by making a lorentz transform. no lorentz transform exists to have a massive object move at the speed of light. then also \"0 inertia\" (i think you meant moment of Inertia ). etc  you should look into the math of relativity and build your reasoning on it. right now you leaving it out completely conceals the wrong assumptions and makes it sound reasonable to you. understanding the mathematical structure comes before using casual formulations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why office jobs pay so much more than retail despite being easier?",
        "response": "Supply and demand. There are plenty of other people who can do your job, therefore the employers can afford to pay you less - if you quit they can just find someone else. Office jobs are usually jobs that require education, skill and training. Finding a replacement is difficult.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do people like to watch pimples being popped?",
        "response": "I guess it's because we need \"resolution\". For instance in music, you can't leave something tensed : after tension, you need a resolution. Same with your body : when you have something that hurts a bit when you touch it and you KNOW you could juts pop it, drain the pus and it would be fine, you do it because it releases the tension. Now, because you KNOW how it works with your body, when you see it in someone else's body it creates a tension : you see that white spot that is JUST ABOUT to burst and that creates a tension that you want to release, thinking \"if it was me, I would have popped that fucker a long time ago !\". So seeing someone do it brings a resolution to a tension and it soothes the watcher.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do movies hide cameras in scenes shot in front of mirrors?",
        "response": "My favourite example of a mirror trick is in Terminator 2, the scene where they open the T-1000's head to extract the CPU. This was pre-CGI, so in the foreground (where you can see the head being opened) is a prosthetic, being operated on my Linda Hamilton. The mirror is actually glass, with Arnold Schwarzenegger sitting behind it. Operating on his head? Linda Hamilton's twin sister. Obviously not something you could use for every film...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do they decide what the temperature \"feels like\" compared to the actual temperature",
        "response": "\"Feels like\" is usually another term for the apparent temperature. At 50 degrees F or lower, that's the wind chill, above 80 degrees F, the heat index, and in between, it's the same as the actual temperature. The wind chill is derived from the actual temperature and the wind speed - more wind, the lower the \"feels like\" temperature. The heat index is derived from the actual temperature and the humidity - more humid, the higher the \"feels like\" temperature.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were Dark age armies really that much smaller?",
        "response": "Adrian Goldsworthy in his book *How Rome Fell - Death of a Superpower* (2009) argues that Romans during 3rd and 4th century were unable to field as many soldiers as they did in previous centuries. Battles where emperors participated were won or lost with thousands of soldiers rather than tens of thousands.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do Ocean Currents exert non-negligible pressure on tectonic plates?",
        "response": "Yes, ocean currents can exert torque on the solid earth. Most large-scale currents, such as the Gulf Stream, are in [geostrophic balance](_URL_1_) in which the dominant force balance (F=ma) is between the Coriolis acceleration (tendency to turn to the right in the northern hemisphere) and the horizontal pressure gradient in the fluid. If the current is a boundary current, then a portion of the pressure gradient force can be supported by pressure against the solid earth. Essentially, geostrophic currents can 'lean' on continental shelves or deep ocean ridges. As those currents vary in time, there is a fluctuation in the net lateral force the current exerts on the bathymetric slope of the ocean margin. The magnitude of the effect is apparently small and only has been diagnosed in numerical models. More information at: [Oceanic Angular Momentum and Earth Rotation](_URL_0_) and [Oceanic torques on solid Earth and their effects on Earth rotation](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are human chimeras susceptible to autoimmune diseases?",
        "response": "Here's some research:  * _URL_1_ * _URL_2_  * _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can animals get concussions like humans? And if so are the consequences similar?",
        "response": "Yes, they can and do. It can be harder to tell, and we don't usually send them for MRI/CT to confirm, so a lot of them go misdiagnosed. But animals with head trauma will become nauseous, lose consciousness, loss of balance, signs of partial blindness, etc, all the same kind of signs we'd expect in a human.  Rest and exercise restriction are important. Obviously its hard to prevent intense cognitive workouts in a dog or cat, but keeping them \"unstimulated\" is important. We do also see cumulative concussion effects like tremors, seizures, cognitive dysfunction, etc in animals with a (suspected) history of repeated concussions, such as victims of animal abuse or bloodsports.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does subway eletricity cabels run along side the track instead of above like normal trains?",
        "response": "Because for the most part subways aren't going to be put anywhere people are going to walk or drive over. Train with overhead cable have them to keep them away from people who share part of the road with the train.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are steel surfaces relatively inhospitable to bacteria and other germs whereas stuff like acrylic are not?",
        "response": "I believe it has to do with the surface and how porous it is/isn't.  Bacteria need tiny holes to hang out in (which also traps stuff they feed on), otherwise they get brushed away easily and there is less available 'food' for them. Also some metals give off ions that apparently kill bacteria.  I know silver does, not sure about other metals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do lips get chapped when you lick them?",
        "response": "I thinks it's because the evaporation of saliva causes them to dry out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where would the potential 10,000 Syrian refugees to the U.S live during the 18-24 month vetting process?",
        "response": "Most of them are already living in tent cities in countries surrounding Syria. It is not like we are getting the ones you saw on TV last month crossing boarders. And they go through the process described below. At least someone is asking questions and not just panicking like so many others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sleep Paralysis & the shapes and shadows you see during the experience",
        "response": "When asleep, you're paralyzed. However, you can wake up while being asleep. The thing is that your brain does not know that you woke up, so you will hallucinate.  The hallucinations occur because the brain still produces the dream images, but combines them with the image of the world, hence you see monsters or creepy figures occur.  Because you're awake but your body is paralyzed, you need more oxygen than when you're asleep but the lungs can't fully extend. That's when you see the monster strangle you. (This is also the reason why you can't talk nor scream.)  Some people also got raped and found that they ejaculated, don't know the cause for this, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the whey powder salmonella killed in the Ritz cracker making process?",
        "response": "It's possible that the salmonella was introduced after the baking process, or that the baking process killed the large majority of the salmonella but the uncertainty was enough to want a recall.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do pirates say \"arr\" or \"yargh\"?",
        "response": "_URL_0_  > Newton is best remembered for portraying the feverish-eyed Long John Silver in the Walt Disney version of Treasure Island, which became the standard for screen portrayals of pirates. Hailing from the West Country that was also the birthplace of many famous English pirates, Newton is credited with popularising the stereotypical West Country \"pirate voice\" by exaggerating his West Country accent.[1] Newton has become the \"patron saint\" of the annual International Talk Like a Pirate Day on 19 September. He was the first actor to employ the phrase \"Arrrrh, matey!\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do solid black curtains reduce or increase the temperature of a room?",
        "response": "The overall heat of the room is probably increased. Black things are black because they don't reflect much light, which means most of the sunlight entering through the window is getting absorbed by the curtains. Those curtains will shed that extra energy as heat to the air or as infrared radiation. Glass tends to absorb IR radiation, so that energy won't escape back out to the outside but get trapped inside the house. After that though things get more complicated and might depend on exact part of the room in question and many factors of the room. The curtains will likely concentrate the heat at the curtain/window part of the room and so areas on the other side of the room could be significantly cooled by the lack of direct sunlight (even though average room temp would increase). The curtains holding a pocket of air between themselves and the window also provides a decent level of insulation from the outside heat getting in, so outside temps could play a factor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When meat/eggs go bad, why does cooking them not make them edible?",
        "response": "Sometimes, these little bugs on foods can make us sick. These are called \"germs,\" or \"bacteria,\" and they live on everything - even your skin. But the ones on food can be bad for us, not like the ones on our skin, so we cook the food, and that gets rid of all the bugs. But, like all things that live, they poop (don't laugh! it's true!). So when you eat something that's gone bad, it's had all these bugs living on it for a long time, and they're too tiny to see, so their poops are too tiny to see. But that's what makes you sick, even when you cook the meat to get rid of all the bugs - the poop is still left behind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During conditions of severe smog, etc, is the air quality indoors actually appreciably better?",
        "response": "It depends on the building and the nature of the air quality crisis. Buildings have a turnover time of air, and you can lengthen that time by closing doors, windows, and vents. The air might get stuffy inside, but the smog won't mix much. If there is a few-hour smog event, that could reduce the interior smog level. Some buildings have HEPA or electrostatic filters on their interior air supply; these filters remove particulates from the air and can increase air quality if the main problem is small particles.  Some buildings contain smokers.  That degrades interior air quality.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does facebook sell personal information, what information is it selling, and to whom?",
        "response": "It uses your cache & cookies from previous sites you've visited. Say you were searching for TVs bia _URL_0_, your cookies are specific enough to let Facebook know that. Now, companies pay FB to show their adds, based on views. So, when you go onto FB after looking at TVs, you will see targets ads related to TVs, amongst whatever other cookies you have. This is targeting advertising in a nutshell. If anyone knows more, please educate myself & OP.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is buoyancy not used for launching things into space?",
        "response": "_URL_0_ Summary: Getting to orbit is mostly about orbital speed, not vertical speed or altitude.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Interstellar, why does one minute on one planet equal four years on earth?",
        "response": "ELI5:  If you move very very fast, or if you are nearby a strong gravitational pull (black hole), you experience time slower relatively to when you are not moving fast/no strong gravitational pull. This is a fact and is not theoretical physics. It has been confirmed by numerous experiments, and for example the GPS satellites orbiting the Earth at about 3.9 km/s periodically correct their internal clocks in order to synchronize with the clocks on Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are drugs called dope?",
        "response": "Dope is derived from the Dutch word \"doop,\" a thick sauce or gravy. The term dope began to be associated with drug use in the 1880s (edit: according to OED, first recorded use of dope in the sense of illicit drugs was 1889) due to the consumption of opium by smoking a molasses-like preparation of the drug.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When someone increases their flexibility (via stretching/yoga/exercise), what is actually happening at a molecular level?",
        "response": "Flexibility is increased by reducing the reflexive muscle tension that occurs when a joint is flexed past a certain point. For example, there is no connection travelling across your groin that prevents you from doing the splits. It's muscle tension in each leg that automatically kicks in. This means that increasing your flexibility is to some extent a psychological exercise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is taking tylenol so bad for the liver?",
        "response": "Tylenol is metabolized in the liver when it goes through your system. If your liver is already working on getting the alcohol out of your body, adding Tylenol on top of that will overwork and damage it. Ibuprofin or NSAIDs are broken down in the digestive system so they are a little safer to take with alcohol. However, Ibuprofin can make you more susceptible to ulcers when taken with alcohol so it's still not recommended.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What determines the ending of road names? (Ave, St, Rd, Trl, Blvd, etc...)",
        "response": "For a very good answer, I recommend you read /u/acidnisibannac's response to a similar question [here](_URL_0_). I'll TLDR it in case cannot be bothered to read it. TLDR; A bunch of historical context goes into the names, plus cities/towns will use whatever name they think sounds nice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I crave sugar when programming, i.e. why doesn't my body use my fat stores?",
        "response": "Fat is emergency energy storage, and your body is always very resistant to using it unless there's no other choice. You're basically hardwired to try and use up existing food supplies before you start burning through fat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people remove clothes as they freeze to death?",
        "response": "We don't really know.  _URL_0_  > One explanation for the effect is a cold-induced malfunction of the hypothalamus, the part of the brain that regulates body temperature. Another explanation is that the muscles contracting peripheral blood vessels become exhausted (known as a loss of vasomotor tone) and relax, leading to a sudden surge of blood (and heat) to the extremities, fooling the person into feeling overheated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do tight socks prevent thrombosis? How does the compression actually improve things?",
        "response": "Tight/compression socks increase venous pressure, which encourages blood flow back to the heart for recirculation. Otherwise, low venous pressure would result in blood pooling within the veins. Slow-moving blood has a tendency to coagulate and form clots (aka, a thrombus).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If superconductor has no resistance, would a thin wire be able to transfer energy as good as a thick wire?",
        "response": "Superconductors have zero resistance, but there is a maximum current density they can carry before their structure changes, and they lose their superconductivity. So for very small current densities, yes, but these thresholds are not very high.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do celebrities participate in roasts of themselves and of other celebrities?",
        "response": "I'm a big fan of the roasts, but the last one was pretty awkward I'll agree with you there. Back in the day roasts were for people that were highly respected amongst their peers and it was just a bunch of friends getting together to rag on each other. There weren't any random un-funny celebrities doing it either (though Snoop Dogg was pretty good at the Beiber roast). Now it's a commercial thing with comedians who barely know the guest of honour and celebrities who have other people write their jokes for them. Still occasionally funny. Look up the Bob Saget roasts for a recent good one. You can tell everyone there are friends, yet they go hard on each other. Then Norm MacDonald deliberately bombs with a bunch of old jokes and everyone dies laughing because they just get each other. This sort of feeling was totally missing from the Beiber roast. I also find Kevin Hart tries too hard, he has his moments but I can't watch him for very long.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a single most basic proof of all mathematics that can be used to create all other mathematical proofs or laws?",
        "response": "Not a proof, as such. The word you're looking for is \"axiom\", meaning a basic statement which is *assumed* to be true so that other things can be proved from it. You usually don't prove axioms, you use them to prove other things. Probably the most fundamental axioms in mathematics are the [axioms of Zermelo-Fraenkel theory](_URL_0_) (plus the Axiom of Choice, which was added later so certain statements about infinite sets could be proved).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are electric cars able to speed up so quickly compared to a car that uses gas?",
        "response": "A electric engine can provide full torque (the force that cause the rotation of the tires) from then start to rotate from stationary. A combustion engine have low tork at low RPM and max torque and a quite high RPM To be more correct the electric engines torque will change when the rpm changes but is it a flatter curve then for a combustion engine so in most/all RPM depending on the combustion engine a electric engine have more torque and therefore faster acceleration",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have any nations ever redrawn their internal borders?",
        "response": "This is quite a bit outside my field, but the first answer that comes to mind would be France during the period of the French Revolution. The National Constituent Assembly dissolved the traditional provinces of France in favor of a system of departments. This was done in order to weaken loyalty to the old traditional regions in favor of the national government, to rationalize the regions of France, and to ensure that no area within a region was more than one day away from a national capital, so that rebellions could be more easily crushed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any variable alternatives to fossil fuels for cargo ships.",
        "response": "Nuclear cargo ships have been [built and demonstrated](_URL_0_), but the bottom line is that they just aren't economically viable. This is due to a combination of factors, such as the need for highly trained staff, safety, security and regulatory requirements, and the fact that marine reactor technology is highly controlled due to its dual-use capability (i.e. military).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if wood floats in water, why do wooden ships sink when they get breached?",
        "response": "Buoyancy is determined by density. Wood is less dense than water, so it floats. A boat made out of wood is filled with mostly with air, which is also less dense than water, as well as whatever cargo is involved, but the main point is that the density of the interior of the boat has to be less than the density of the water. If there is a breach and the boat fills with water, this is no longer the case, since instead of air and cargo, it will be water and cargo. Since water+cargo is not less dense than water, the ship will sink.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why was red chosen for \"stop\", green chosen for \"go\" and yellow for \"prepare to stop\"?",
        "response": "It's not a coincidence. Traffic lights were invented in London and were based upon a system of signals that themselves originated with train lines. Originally train lines had red for stop and white for go with green meaning caution. Unfortunately, there was an accident when the lens fell out of one of the red lights (making it white) and so they removes the white colour and replaced it with green. The intermediate (caution) colour became yellow. When the lights were established in London, the same system was used. In part because it was familiar to officials who would implement the system but more because red is a great colour to penetrate London fogs. Longer wavelength light is scattered less by atmosphere and other gases so red penetrates better than green or yellow. Thus you can see a red light further away in fog than green.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many Strong Man/power lifters look fat despite exercising & lifting so much?",
        "response": "Because theyre going more for muscle mass and less for a sculpted look like body builders.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are boxes of canned soda so much cheaper when you buy them in 3's or 4's?",
        "response": "Perceived discount motivating purchases. It's like stuff you see online with an MSRP of $2000, 95% off for $100. Discounts, and prices, are only what people are willing to believe. Getting 3 boxes of coke at $3 a piece, is a better deal to most people than no name/store brand soda for $2.75, since you're saving so much! Not to mention the higher MSRP makes people believe it is a better product, in fact a lot of store brand/no name brand products are made by the same factory and just sold in bulk, then packaged in cheaper packaging to make the savings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In words like Relationship, sportsmanship, where did the \"ship\" come from?",
        "response": "It's a suffix meaning \"quality, condition; act, power, skill; office, position; relation between\" [The full etymology](_URL_0_): Middle English *-schipe*, from Old English *-sciepe*, Anglian *-scip* \"state, condition of being,\" from Proto-Germanic *-skapaz* (cognates: Old Norse *-skapr*, Danish *-skab*, Old Frisian *-skip*, Dutch *-schap*, German *-schaft*), from *skap-* \"to create, ordain, appoint,\" from PIE root *(s)kep-*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Truth Serum\" from spy movies and the like, does it actually work?",
        "response": "Lying takes more mental effort than truth telling, so taking any downer should make a person more truthful. This effect can be seen with alcohol and other gaba agonists like ghb and benzodiazeprine, and such downers as barbituates and xanax. Psychedelics **may** have some use to this effect, but such use is unreliable and inconsistent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the stomach \"layer\" food eaten at different times or is it all mixed together?",
        "response": "Your stomach is a sack of muscle filled a bit with digestive juices and coated in slimy mucus. At one end, it's the \"intake valve\" where food comes in. At the other end, there's the \"output pipe\" AKA start of your small intestine, the duodenum.  You stomach twists around a bit while it's digesting food. It'll move that food to the small intestine when it's \"ready\". If you eat some food, and it's digesting (digestion time mostly depends on exposure time to the digestive juices and content of the food) it will move to the small intestine when it's ready to go. If it happens that you eat something else while \"digesting\" that first meal, it could also move to the small intestine with the first round of food. In short, I think the answer to your question is a no.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pipelines in Unix-like operating systems.",
        "response": "Every Unix program executes with \"standard input\" and \"standard output\". When you run a program on its own, standard input reads from the keyboard & standard output displays on the screen. One of the more useful things that the Unix command-line lets you do is redirect the input and the output of programs. When you connect two programs with a pipe, it takes the output from one program and feeds it directly into the input of another program. Let's say you're looking at the files in a directory with \"ls\" and want to know how many files there are. You can pipe the output of ls to wc (a program that counts the number of words/lines in its input) with \"ls | wc\". Lets say you want to list files that are *not* zip files, you can use grep (a program that searches for patterns in text) and connect them with \"ls | grep -v .zip\". If you want to count the files that aren't zip files, you can \"ls | grep -v .zip | wc\". Similarly, you can always use a \" > \" to send the final output to a file.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is happening in your body when you're daydreaming, like, why does everything seem to just tune out?",
        "response": "Welp, it's been a while since you posted this, so you probably have an answer from somewhere else already, but I will answer anyway. This is mainly due to our brains being very good at selective attention. It is impossible for the human brain to focus on every bit of information it receives, so instead it will focus on one or two main points and effectively ignore the rest.  A good example of selective focus is [the infoumous Monkey Business Illussion](_URL_1_)  [More info](_URL_0_)  When you are day dreaming, your brain can only focus on that, thus tuning the world around you out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I have to download some version of directx everytime I buy a game and install it?",
        "response": "You shouldn't have to actually install it. You just run the installer, which quits because you already have it.  It's bundled with every game to guarantee that even new PC gamers can run the game.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "For non-Americans - What is thanksgiving, and why is it important? Why is a harvest holiday so important, even among non-farmers? Why is it considered a very seriously bad thing for someone to eat alone on the day?",
        "response": "There is some historical meaning to thanksgiving. But I wont get into that because it is hardly relevant and in my opinion has no effect on why people value the holiday today. Thanksgiving is just a day when families put down whatever they are doing, and put aside whatever issues they have with each other and eat a meal together. It is only important because it is is viewed as a sort of social barometer for a family. If someone is alone on thanksgiving it a sign that either they do not care about their family or that their family does not care about them. It is also common that if someone for some reason absolutely cannot travel to eat with their family on thanksgiving a friend invites them to join his or her family. So basically being alone on thanksgiving in american culture is sort of like a confirmation that either no one cares about you or you dont really care about anyone. Neither of which are particularly flattering things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How accurate are the accounts on Drunk History?",
        "response": "As much as I love Drunk History, I'm afraid it's a story telling by drunk people. It's slightly worse than getting your history from Eddie Izzard. The most it's good for is finding a story or person you didn't know about before and going to get a book on the topic. It is absolutely hilarious though. EDIT: [Here](_URL_0_) is an interview with Derek Waters on how Drunk History is made. Count the number of times \"history\" turns up in his answers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is having perfect vision called \"20-20 vision\"?",
        "response": "It means that you can see at 20 feet away what most people can see at 20 feet away. 20/15 vision for example means that at 20 feet away you can see what most people can see at 15 feet away (meaning you have better vision than normal).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What evidence is there for the existence of quarks?",
        "response": "The most conclusive pieces of evidence for the existence of quarks are the results of [scattering experiments](_URL_4_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If tap water has iron content, mineral content, etc., does it change how the molecule looks? Instead of it being H2O, does something bond or attach itself to the water? Or does it \"float\" along side it?",
        "response": "You should read up on [solvation shells](_URL_0_). It will answer all your questions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did medieval kingdoms have anything equivalent to \"spec ops\" or \"secret service\"?",
        "response": "This has been asked a few times, a few others and myself commented on it a while back: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why Watchmen is considered the greatest comic (graphic novel) of all time?",
        "response": "It has a masterpiece level of artistic detail in both the images and the story. It presents a fascinating look at a morally ambiguous bunch of superheroes that have realistic motives in an immersive alternate reality. It also is considered to be one of the best utilizations of the medium; it uses imagery and pacing perfectly. The story itself is masterpiece-level, and it could not have been told so perfectly by any other medium. That's my opinion, anyway.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are mailguys in the US allowed to drop packages at the front door without the customer signing anything ?",
        "response": "A very high percentage of the time, the person isn't available to sign. So multiple attempts are made until they give up and require the person to pick up the package. If all packages required signatures, it would be a huge inconvenience and waste of time (money) for everybody.    Out of all the packages delivered, an extremely small percentage of them are lost/stolen.  So, people would usually rather take that small risk and the default is not to require a signature. And if it's not worth the risk, the option to require a signature upon receipt can be used.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Credit Cards are a lot more popular than Debit Cards in the US?",
        "response": "Debit cards are still widely popular, but credit cards offer a few advantages to users who use them responsibly. Many cards offer a small percentage rebate, consumer protection benefits, and in the event of an unauthorized charge, you are not financially penalized while the dispute is open.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why there are so many different variations of SSRI?",
        "response": "To add to this, even ones that are supposedly the “same” can act in very different ways.  I was on a generic of Wellbutrin for depression and it worked GREAT. My insurance company forced me to switch to a mail order company and guaranteed the same service and prescriptions for a cheaper price. Well, the ones they sent were a DIFFERENT generic, and after about 5 days of taking them I was very depressed, lethargic, and in general not well at all.   Luckily I immediately brought this up to my therapist, told her I thought it was the new pills, and we discussed it. She noted the differences, and based on how quickly the original ones worked and how these other ones were working and got me back on the original generic. I felt better in two days. And in case you are curious, I weened myself off the good ones slowly and am now fine.  Just an example of how and why there are different ssri’s and how dramatically different they can work for different people. Brain chemistry isn’t easy!! :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What, if anything, limits electromagnetic radiation to gamma rays on the high end and radio waves on the low end?",
        "response": "There is no physical constraint on the longest possible radio wave, but we use the same term (ELF, or extremely low frequency) for all radio waves 3hz or below. Gamma rays have an extreme upper bound in frequency where their wavelength is the same as the planck length, and at 1.022 MeV, photons interact with matter to for electron-positron pairs.However, \"gamma rays\" includes all particles with freuencies greater than 10^19 hz.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Nickleback so hated?",
        "response": "It's a bandwagon thing I think. Someone started the joke and it just grew like wildfire ...look at this graaaaaaaaph",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is “consent” verified?",
        "response": "This is why the conviction rates for rape are so low. There are rarely witnesses, and it often comes down to one person's word against another's. Also, unlike many crimes it's not enough to prove that the act took place; you also have to prove that it took place against the will of one of the people involved. Reasonable doubt is therefore common, and in that case you cannot convict.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a proper term for the excess amounts of saliva your mouth produces right before you puke?",
        "response": "[Water brash](_URL_0_) The salivation protects the oesophagus and oral cavity from the acidic contents of the stomach and is a reflex caused by the parasympathetic nervous system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The beef between Tupac and Biggie and the conspiracy surrounding their deaths",
        "response": "A lot of people don't know that Tupac was actually born in New York",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you could take the average of all the temperatures of everything that exists in the world, would it always be the same?",
        "response": "No it would not always be the same. Energy cannot be created nor destroyed but heat can be generated and taken away through other forms of energy. For example with friction the kinetic energy will change into heat energy, but when a liquid is evaporating it will cool the surface it is on/ the remainder of the liquid as it takes energy from its surroundings. Chemical reactions are either exothermic or endothermic processes, which means they either expel or require energy, meaning there is usually a heat change to go along with this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are the muscles on animals like gorillas biologically similar to the muscle on people? ie would 100kg or gorilla muscle be more or less powerful than 100kg of human muscle?",
        "response": "Not exactly. There are different type of muscles in our body only. Muscles in arms are predominantly designed to exert large force but they tire out quickly. The muscles in heart will not tire easily. The leg muscles also don't tire easily and also exert high force. They are evolved depending on the species, as humans walk on legs, leg muscles are provided with ample blood vessels for circulation. An ape on other hand has this type on both is hands and legs as they are tree dwellers. The arms of a monkey, Gorilla etc are stronger than human mufflers of same mass",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From 1787 to 1750 their were a series of compromises made between the North and South on the issue of slavery. My question is why didn't compromises work after Lincoln was elected?",
        "response": "Slavery was controversial from the beginning of the country. And the compromises were made to keep the union intact. The slaveowners of the south had no plan for an economy that didn't involve slaves, so as the compromises took hold, such as banning importation of slaves, admission of slave/free states in pairs to keep the Senate balanced, and so on, it didn't really effect the economics of the slave-owning south. By 1860, though, compromises were at an end, and the next step was either to end slavery, or to just ignore it. The south couldn't do the former and the north couldn't do the latter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do chromosome locations and snp positions work?",
        "response": "[Here's](_URL_1_) a great chart of chromosome location, but notice it only localizes to the general area of the chromosome. Good enough for most applications.  Given your example of location, I'd take it you already found this though! The numbering of SNPs, [much like in amino acids](_URL_0_), is by custom. You are right that there are differences between human genomes, but this is less than 0.01%, so even with indels or repeats, the SNP won't be shifted far from it's original position, so it should be easy to find and compare. Especially considering the important SNPs are likely to be in genes under high selective pressure not to mutate greatly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do other languages have as many accents as English? Why or why not?",
        "response": "Everyone is giving examples of specific languages, so I'll just give a general answer: it's a resounding yes. Virtually all languages will have some kind of accent variation based on geography. Accents may also be based on things like social class or ethnicity, and other languages will have those as well.  You hear more about this for English because it has the most widespread community of speakers (and in your case, OP, you hear about it because it's your language).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How quickly are humans evolving?",
        "response": "Evolution, quite simply, is allele frequency change over time. An allele is one version of a particular gene. So we, like all living creatures, are evolving every time someone gives birth or dies, because the balance of various alleles shift every time that happens. Now when people think of evolution they think of the really big things, like major new features of an animal, or a speciation event. But those things take incredibly long periods of time, and it's nothing you are going to notice in a human lifetime (unless you are a scientist doing evolution studies on extremely short generation life forms). So what we can actually see are things like the slow spread of lactose tolerance in human populations over thousands of years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Why do ducks and some other bird species fly in formation?",
        "response": "It's aerodynamic. Each bird gets reduced air resistance and a slight updraft from the bird ahead of it, meaning they can fly longer using far less energy. They take turns in the front position, which is the only place that's really tiring. Military jets fly in V formations for the exact same reason: the air flow reduces resistance and bolsters the planes in back, saving on fuel.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has there ever been an example of a peasant in the Middle Ages that moved up and became an important member of society?",
        "response": "If you take the traditional (if silly) date of 476 AD as the beginning of the Middle Ages, Justin I was a peasant by birth and ended up as Roman Emperor, ruling from 518 to 527. Strictly speaking, the same can be told of his more famous nephew Justinian I.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If sugar makes us hyperactive, then why are we prone to going into food coma after a big meal?",
        "response": "There is no evidence whatsoever to suggest that sugar actually does make people (especially children) hyperactive. Instead, it is highly likely that the effect is psychological i.e. kids act hyperactive after eating sugar because adults *say* that they will (\"don't feed him that, he'll go mad!\") and they are subconsciously conditioned to do so. Trials show that without knowledge of the presence of sugar in a food substance, children don't behave any differently.  Unfortunately I don't know what mechanism causes the so-called sugar coma to occur.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do tech/software companies stay in the US when they are demanded to include backdoors by the US government? Can't tech companies just develop and release their products overseas, out of reach of the US government's influence?",
        "response": "The short answer is that it's not just the US government pushing to include \"backdoors.\" Tech companies could move to a country without these laws, but places like the US could restrict or prohibit them from selling their products in the US. The better option is to follow Apple's example and refuse to build the backdoors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In 1978, a man was struck by a particle accelerator beam and survived. A curious side effect of the accident is that the left half of his face is paralyzed, and \"does not age\". How is this possible?",
        "response": "I think this depends highly on the definition of \"age\".  Considering that a face is said to be \"aging\" when lines and wrinkles appear, I would suspect that the paralyzed side of his face doesn't \"age\" because it doesn't move.  Wrinkles form from repeated stretching and relaxation of the skin. As the skin loses it's plasticity with age, wrinkles appear at points of stress and movement. No movement means no wrinkles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so important that the Department of Homeland Security gets funded? Isn't it a redundant department that was created in response to the terrible communication on 9/11?",
        "response": "DHS was restructured in 2005 so that the various branches of intelligence and law enforcement are all now under its umbrella. It's not so much a standalone thing, rather than the thing that encompasses other things the same way the Army, Air Force, Marines, and Navy are all under the umbrella of the Department of Defense. If DHS doesn't get funded, then that causes problems for the FBI, CIA, TSA, US Marshals, customs, ATF, FEMA, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we assume that the speed of light is constant throughout the universe?",
        "response": "Because the value of the speed of light holds no significance at all, because it's dimensionful. A coordinate change brings a space-dependent speed of light c(x) again to a constant speed c. That's not surprising. The value of c is defined conventionally through the definition of the metre, so it cannot hold physical significance. In natural units, c=1. Only variations in dimensionless constants can be meaningful. EDIT: [this](_URL_0_) should make this easier to digest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Decline and Fall of the Roman Republic - AMA",
        "response": "This one kinda goes past the Republic into the Principate period. At what point did Romans (mainly the literate and educated) realize they were no longer a republic, but instead a monarchy? How did they accept this given there was such a strong hatred for monarchy within Republican Rome?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes our eyes to close while sneezing? Is it possible to sneeze without closing our eyes?",
        "response": "It's probably a safety measure by the body so you don't get anything in your eyes during. Urban myths say your eyes pop out if you sneeze with them open. Mythbusters tested it, and nothing happens if you hold your eyes open while sneezing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Stupid question alert - Would there be a difference in temperature between a glass of water sat in a room, and an unheated aquarium sat in a room?",
        "response": "Assuming that both were under the same conditions (i.e. the aquarium wasn't say especially well lit), then yes.  There are a few conditions on this We must assume that the room itself is of a constant temperature. We must assume suitable time has passed since both containers were filled This is because over time both bodies of water would be exchanging heat with the surrounding room, as time progresses this exchanging of heat would work to equalise the temperature between the glass and the room, and the aquarium and the room.  Since the two bodies are of different size they would both exchange heat at different rates, this is why the suitable time condition is necessary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If something freezes quickly, does it generally mean it will melt faster?",
        "response": "No. As /u/SovereignWinter pointed out, the latent heat of fusion determines the amount of heat input for melting or heat output for freezing to take place, however solids and liquids have different thermal transfer coefficients as well as different mechanisms through which heat is transferred, as well as differences in other properties relevant to the efficiency of your method of thermal transfer, so in general, you can't perfectly equate the time for freezing and the time for melting without maintaining a constant rate of heat transfer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do airline flight prices change like the wind?",
        "response": "Airline costs are sensitive to demand - they really want every plane full, but overbooking too much costs money. Unpopular routes like Seoul to Vladivostok are consistent - you're not going to get much fluctuation in people making that flight, and there's so few that even the small plane you're running will have spare seats. For popular flight paths, there are lits and lots of people trying to find tickets, so the demand varies greatly even minute to minute. The algorithms automatically price that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which Came First, the Virus or the Cell?",
        "response": "No one can tell you for sure. However, since a virus cannot reproduce without a cell to infect, it stands to reason cells would have come first.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In what ways did Hitler hurt the German war effort?",
        "response": "Actually invading Russia wasn't necessarily against his generals' advice even though there were some who argued for and against it as is almost always the case for operations of that size, (chapter one of 'War of the Century' by Laurence Rees, published by BBC Publications, 1999). During Operation Barbarossa, Hitler personally interrupted the original plan by constantly diverting forces from one front to another multiple times which slowed down the main force, Center Group, that was tasked with capturing Moscow. Also during Operation Blau, Hitler put too much emphasis on the capture of Stalingrad which was originally meant to only help protect the flank of the main force that was advancing into the Caucasus. The number of forces that were diverted to participate in the battle of Stalingrad weakened the flanks enough for the Russians to counter attack across an ill-defended Don River which ultimately lead to the capture of a quarter-million men. From there it was the Soviet's War to lose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we have to clean our teeth when all other animals don't have to?",
        "response": "We live a long time and eat a lot of foods that are good at feeding bacteria that can corrode our teeth. Other long lived animals have to worry about their teeth, too, though. When they lose teeth and such they just kind of have to deal with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Any number of bosons can occupy the same position in space. Does this mean bosons have no size?",
        "response": "*Fundamental* bosons have no size. The same is true for fundamental fermions. However, this has nothing to do with spin statistics. A boson is any particle with integer spin. You can have composite bosons such as mesons or even certain atoms (e.g. ^(16)O) which all have non-zero size. Fermions can occupy the same space without violating the Pauli Exclusion Principle, as long as there is something different about their quantum states, such as spin. This is evident in nuclei: the nucleons overlap spatially and don't scatter off each other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your nose run when you east spicy things?",
        "response": "Nasal irrigation is a way for the body to protect sensitive and vulnerable tissues in the sinuses. Spicy foods trigger a feeling of actual heat (like real fire), even though it's not actually hot. The best way to cool spicy foods (at least from chili peppers) is with milk or some other dairy product. Fats in milk bind to the oily spice and carry it away, and sugars bind too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Quotation from a bronze age general who conquered a city said something like \"But we have the weapons!\" to a local politician who could not understand the enforceability his rule?",
        "response": "A vaguely similar story appears in Plutarch's biography of Pompey the Great (Gn. Pompeius Magnus):  > ...[M.] Perpenna [Vento] immediately abandoned Sicily to him [Pompey], and he [Pompey] retook its cities, which had been abused [by Perpenna], and treated them all benevolently except for the Mamertines in Messana, who pleaded against his tribunal and jurisdiction on account of an ancient law of the Romans. He said in response: \"Will you not stop mentioning laws to us who are girded with swords?\" (10.2) The Penguin edition gives a more elegant translation of Pompey's reply (οὐ παύσεσθε ἡμῖν ὑπεζωσμένοις ξίφη νόμους ἀναγινώσκοντες;): \"Stop quoting the laws to us. We carry swords.\" Now, I'm not sure if this is the story you had in mind, since there's very little context to it; Plutarch says nothing more about incident. But it seems unlikely that these were same Mamertines from the time of the First Punic War. I hope you find this helpful! :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did people in the science community start to utilize electronics in their studies, tests, experiments, etc?",
        "response": "As u/JustAnotherAlchemist said, define what you mean by electronics. If you are referring to computers, the very first digital computer was the ENIAC. It was built for the United States Army's Ballistic Research Laboratory. So in the case of computers, quite literally the moment they were created. Specifically it's first use was to study the feasibility of a thermonuclear weapon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do we know about invertebrate evolutionary transition from sea to land?",
        "response": "edit: wow, definitely failed to see the 'in' in 'invertebrate' there. regardless, maybe you'll find some of this interesting. The [Tiktaalik](_URL_4_) was a fish that preceded tetrapods (4 legged amphibians). It evolved in the late Devonian and in oxygen-poor waters. This species is the current root of the terrestrial fauna phylogenetic tree. These are some of the traits it had (stolen from the link): Fish: fish gills, fish scales, fish fins, \"Fishapod\": half-fish, half-tetrapod limb bones and joints, including a functional wrist joint and radiating, fish-like fins instead of toes, half-fish, half-tetrapod ear region Tetrapod: tetrapod rib bones, tetrapod mobile neck with separate pectoral girdle, tetrapod lungs This species is most akin to present day mudskippers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fuzzy is the line between \"mentally ill\" and \"not mentally ill\"? Are mentally healthy people actually free of mental illnesses, or do they simply have them at much lower, tolerable levels?",
        "response": "Calling them \"illnesses\" may not be ideal. \"Syndromes\", perhaps? According to current psych docs, a huge percentage of the population is \"ill\", but the documents are written by people who are paid to treat the problems, so... they're not without bias. I expect everyone's a little crazy. What makes it a problem is when it starts interfering with your life. Personally, I cycle into depression on a fairly regular basis, and that really does screw everything to hell. I have a friend whose boy is autistic spectrum and... he's been getting the best help, and maybe he'll be able to live a life on his own some day, but it's going to be a really unusual life, at best.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do the chips on credit cards provide extra security?",
        "response": "Magnetic stripes are easily duplicated. The information on them is unencrypted and the machines to duplicate them quite cheap.  A chip on card is basically a unique encryption key. The reader has an active conversation with the chip to verify the authenticity of the card. Pin not being required has been done largely to reduce the resistance to adoption. It is an additional layer of security that should be used but its absence does not lower it to the simple pinless magstripe transaction as the difficulty of reproducing or emulating an individual cards chip is prohibitive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After World War II, did men from nations that sustained high casualties such as Germany and the USSR find themselves with a huge abundance of single women to pursue romantically?",
        "response": "This raises tons of demographics related questions for me as well. Did the war create a clearer \"generational\" divide in politics? Did the agricultural/economic disruption make a lasting impact on children's development? We're generational cycles of poverty/abuse broken/begun?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When in our evolution did we develop consciousness?",
        "response": "First we need to define consciousness rigorously (as you pointed out) and devise a way to test for it. This is not an easy task.  It might be better to ask, \"when did we develop higher reasoning?\" Even with that, there might not be a clear dividing point.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the acceptance and promotion of drug and alcohol use (e.g., Marijuana, Percocet, codeine, Xanax, Hennessy, Molly) become so common in pop culture, notably the music industry?",
        "response": "It always has been, pretty much. Different eras had different addictions, of course, and alcohol is the most common in older times. Removing the alcohol, since that's legal, you still get references to drug use as early as the 1930s, with artists like Herb Morland and Cab Calloway. In the 70s, there was a growth of hard drug references in songs, like \"Lucy in the Sky with Diamonds\" (LSD).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do wisdom teeth serve a specific purpose other than general chewing?",
        "response": "I am not a dentist, but my understanding is that wisdom teeth are a relic from when our jaws were simply *longer*, making them an easy fit.  Well, not *our* jaws obviously, but the jaws of the species that later became us.  If you look at a lot of other mammals, their heads start out with a human-like roundness to them and later develop a more pointy snout.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the shower get significantly hotter when I turn the dial a little less than a centimeter?",
        "response": "Make a circle with your thumb and pointer finger. Do the same on the other hand. Put those loops next to each other, like you were making eyeglasses or binoculars with your hands. Now move them a centimeter towards each other, so the circles overlap. How big is the hole that looks through both loops? Move them another centimeter closer, so they overlap even more. The hole should be more than twice as big, even though you've moved the same amount! That's a quarter-turn valve.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did average German soldiers become capable of the horrible acts that took place during the Holocaust?",
        "response": "While my experience in this area is limited I would like to make you aware of the [Milgram experiment](_URL_0_) and the [stanford prision experiement](_URL_3_) which you will likely find very relevant to this as they both look at normal people put in situations where they are under strong orders or have power and no accountability, then show often very cruel and callous behaviour. Not a very ELI5 answer given that I have just pushed you off to wikipedia and not explained it myself for which I apologise. [previous ELI5 thread on the milgram experiment](_URL_2_) [previous ELI5 thread on the stanford experiment](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If gun scopes are located on top of the guns, how come the shots are accurate?",
        "response": "The scopes are already calibrated, or calibrated by yourself, to point where the shot will go. They don't just point out in a straight line from the end of the scope, unless you make it. If you put a laser pointer on top of the scope pointing straight out and having it be level, then looked through the scope, the 2 places would not be the same",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how is bottling up your feelings bad for your health",
        "response": "It'll make you neurotic. If you can't process and come to acceptance of your emotions, it can lead to anxiety, depression, bouts of anger, unhealthy impulses, and self destructive coping mechanisms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the difference between firmware and software",
        "response": "Firmware is a set of programs and routines that are built into the device running them. They are typically essential for the basic operation of the device and are not usually accessible by the user.  Software is a program that the device runs such as an application or a printer driver. Software can usually be installed and uninstalled with ease by the user and is not essential to the operation of the device.  If your software is faulty, you can usually uninstall and reinstall it to resolve the problem. If you have faulty firmware your device probably won’t function properly or in serious cases at all. To make a simple comparison; Firmware is the stuff that you do without thinking like breathing and blinking, software is stuff you learn, like the ability to drive a car or do calculus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From the Light Side of the Moon, are there phases of the Earth?",
        "response": "Sure. The Moon is tidally locked, so you always see Earth nearly in the same position in the Moon's sky. As the Moon moves along its orbit you'll eventually see a crescent Earth, full Earth, waning Earth... The fun fact is that they are exactly opposite to Moon phases on Earth, i.e. you'll only have a full Earth if we have a new Moon. Their relation to eclipses stays the same, though (i.e. you'll only see a new Earth covering the Sun, never a crescent or full Earth).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people \"google\" before Google existed?",
        "response": "Before google, there was altavista. Before the \"internet\" there was AOL, Prodigy, Compuserve & Delphi all of which you had forums to ask questions and online encyclopedias, etc.  Before those online encyclopedias you had BBSs, which had FidoNET, RIME, etc which also connected to USENet, so kinda like Reddit is today. Before that you had Encarta, which came on CD.  Then yep, before that you had book Encyclopedias, you also had almanacs where you could look stuff up. Almost every house had encyclopedias.  Other than that, yeah, you had to go a library, where you could find a book, or ask a librarian.  Even had newspapers and magazines on microfilm with indexes of topics.  Or you could save your question to ask your teacher, grandparents or librarian.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(serious) Why didn't the Egyptians write about and catalog about building the pyramids? Are there any books written about building them? IE, labor, design, etc.",
        "response": "Hi, I just ran into this post while searching for something. You may be interested in this answer by /u/Bentresh  * [Is it true that \"two hundred years after the last pyramid was reared in their country, Egyptians were as baffled by the big masonries as everyone else?\" In other words, did they forget how to build the pyramids? How/why?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if someone is a citizen of 2 different countries, do they have 2 different passports?",
        "response": "Yes. Passports are issued by each country separately, there's no such thing as a \"multiple country\" passport.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Progress in understanding the Late Bronze Age Collapse?",
        "response": "I got a book recently by Eric H. Cline (noted Classical and Biblical historian) called 1177 B.C: The Year Civilization Collapsed. I haven't finished it yet, but what I've read so far is very interesting. He spent the first chapter detailing how interconnected the Eastern Mediterranean was, in terms of culture, politics, and trade networks. It's very fascinating so far. He also describes the Sea Peoples in better detail than anyone else I've read.  So far his thesis seems to be that the LBAC was due to the collapse of this trading network, which was caused PARTLY by the Sea Peoples, but most likely by a wide combination of sources (I.E. total systems collapse theory).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The power of star < - > triangle transfiguration of resistors?",
        "response": "I don't know if one can definitely say that start triangle transfigurations allows for every possible network to be solved but what you state in your question is a bit different than how you might state it. The parallel and series laws are derived from Kirchoff's current and voltage laws. And with them, one can solve every circuit possible already. So if you simply use the 2 rules mentioned by you as instructions a computer could use, then you couldn't solve every circuit but with the most basic of laws (Kirchoff's laws), every circuit can already be solved. The star-triangle transfiguration and those substitutions are derived mathematical tools to make solving some circuits more easily without having to go through pages and pages of rigorous analytical boring calculations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can someone please dumb down the theory of Relativistic Mass??",
        "response": "As u/Midnight___Marauder mentioned, we don't really talk about relativistic mass anymore. Back in the day, the idea was that because things going near the speed of light seem to behave differently (such as time on a speeding spaceship slowing down, which I can explain further if you want) we can represent some of those changes by treating the moving object as if its mass has changed. In reality that tweaking of the mass is redundant and confusing because that change doesn't really happen, compared to things like time dilation where a clock on a fast spaceship will literally move slower than your clock on earth. You can describe all the important things that happen to a fast object by what happens to its energy, time, and length, so you don't need to say anything about mass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Chinese kanji are one character per word, wouldn't books have considerably less pages in Chinese?",
        "response": "* It's hard to compare since translations are not exact. * The characters are more complex than single Latin characters, so they are usually printed larger. * You need different amounts of characters and phrases to express various concepts. * In my experience, Chinese printed matter does have somewhat fewer pages on average [(see example of the first six Harry Potter books translated into Chinese)](_URL_1_). As a nitpick, _kanji_ is the romanization of the Japanese word for Chinese characters. In Chinese, this is called [hanzi (汉字)](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any incidents of successful removal of an invasive species once a breeding population is established?",
        "response": "New Zealand has a number of off-shore islands where invasive mammal species (including rats, stoats, and ferrits) have been successfully removed. The islands are now used as havens for threatened native bird species. For example, Codfish Island off the South Island is used as a breeding ground for Kakapo.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Genuine question, is there a reason why natives of most \"third world\" countries are black while most \"first world\" countries are white?",
        "response": "You might want to take a look at Jared Diamond's book \"Guns, Germs, and Steel\" for one hypothesis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does chemotherapy work to stop cancer?",
        "response": "My understanding is it targets and kills cells that have a fast rate of multiplying, such as your stomachs lining and your hair, but also cancer cells. There's not a way to get it to distinguish good vs cancer so it effectively kills them all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are BRCA1 mutations so highly linked to breast cancer compared to other types of cancers, when BRCA1 is expressed in many different tissues (not just breast tissues)?",
        "response": "Pathogenic BRCA1 mutations increase the risk of breast and ovarian cancer. This is thought to be due to BRCA1’s direct interaction with the estrogen receptor among other possibilities. Estrogen receptor is highly expressed in both mammary (breast) and ovarian tissue and is involved in cell proliferation and differentiation in these tissues. BRCA1 can inhibit estrogen signaling And increased exposure to estrogen is linked to increased breast-cancer risk. Estrogen is involved and normal mammary cell proliferation’s and differentiation and can help breast cancer cells grow and spread. So BRCA1 can hit the brakes on estrogen signaling, decreasing cell proliferation and growth signals, decreasing cancer risk. Here is a good published article for reference: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it not possible for earth to be flat?",
        "response": "There's no hypotheticals anymore here. We've been to space, the moon, and beyond.  We took pictures of the earth from out there. It wasn't flat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When someone is a surrogate mother does any of their genetics or anything end up with the baby? Does the baby technically have 3 birth parents then?",
        "response": "No. The surrogate only provides the environment for the foetus to develop. The fertilisation of the egg with the sperm ( which together carry all of the genetic makeup of a human ) is done outside her body. So, technically, the baby still has only two genetic parents. Semantically you could argue that since the baby came out of a second woman, she could be considered another parent, but that's upto the person.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How important was Allied Lend-Lease to the USSR during WW2? Approximately how much of the gear in use by the Red Army was supplied by the other allied powers?",
        "response": "There's more to be said on the topic; you might like to start with some previous answers in the FAQ section Economy, Industry, and Lend-Lease. * \"In WW2, who had greater industrial capacity, the Americans or the Soviets?\", _URL_2_ , by /u/Georgy_K_Zhukov * \"Soviet industrial might between 1940-1945?\" at _URL_1_ by /u/Elm11, /u/iHistorian, and International_KB * \"I often hear people say that the United States saved the USSR by lend-lease. How important was lend-lease to the Soviet war effort and is this claim anything more than just American propaganda?\" at _URL_0_ by iHistorian Feel free to have follow-on questions. information, or debate! Listing these is not to discourage anything follow-up. By the way, the FAQ section is in the wwii/ussr page at _URL_3_ In the Reddit app, the # anchor doesn't work, so it goes to the top of the page, so you have to search for \"lend\" or such like.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are foreign microbes such a threat to Mars?",
        "response": "The microbes aren't considered a physical threat as much as they are a scientific threat. NASA abides by a practice of planetary protection which is the protecting solar system bodies from contamination by Earth life. This practice is important because it preserves our ability to observe other worlds in their natural states. Contamination from Earth life would make our ability of finding other life forms, if they exist, very ambiguous because we would have to examine if the life form was from Earth or not. Specifically, a planet like Mars which has great potential that it could support life is a prime area of planetary protection. Scientifically, we want to avoid the contamination of Earth life on Mars so if we do find other life forms, we will have avoided the possibility that the life forms are of Earth. [More Information](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the 3 Japanese writing systems differ and why is it necessary to have all 3?",
        "response": "One is copied from Chinese: a character for each word, essentially. The next is essentially an alphabet: necessary for Japanese words that don't have well-known characters. The third is merely a second copy of the alphabet, a bit like English upper-case and lower-case, though used for different reasons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the lines across some bodies of water on large satellite image maps?",
        "response": "Those are where the satellite took a long series of photos as it passed overhead in lines, and the photos were later stitched together with imperfect colour correction, so you see the edges of the photo series.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did we establish the universal rule of 'righty tighty lefty loosey'?",
        "response": "Most people are right handed. Screws take more force to insert than to remove, and righty-tighty screws allow to use your right hand in its strongest position. Thus it's preferable to the other direction, which is now rarely used.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a complex animal be genetically engineered to allow for the growth of chloroplasts?",
        "response": "> DNA engineered to produce everything the chloroplast needs to function … [one step ahead of ya](_URL_0_)  > Exactly how the genes got from the algae to the slug isn't clear, but Pierce said research into this mechanism could lead to advances in gene therapy and genetic engineering.  > Pierce said gene therapists are \"trying to insert genes from one organism to another to fix genetically based diseases, and honestly that doesn't work very well yet, but these slugs have figured that out.\" [source](_URL_1_)  > … and reproduce It sounds like they haven't figured that part out yet. (Not that I'm an expert.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the tonality of different languages affect the personality of the native speakers?",
        "response": "Essentially, you are describing the [Sapir-Whorf hypothesis](_URL_1_), now commonly referred to as \"linguistic relativity\". To summarize that article- many linguists support the idea to some extent, and there are absolutely universal features of every human language that can be used for comparison, but we don't yet have a scientific consensus on how true it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why a car doesn't get better mileage going at a faster speed.",
        "response": "Air resistance gets stronger the faster you go. Hold your hand outside a car window. More resistance means it's harder to keep the same speed. That means more energy is needed. That means more gas is needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does currency exchange work? Like roughly BDT 80tk is 1 USD and BDT 120tk is 1 Pound. What determines this value?",
        "response": "Jimmy and Sally are neighbours, both of whom have parents who own the farms they live on. Jimmy's parents are apple growers. They have a vast orchard or beautiful apple trees, and when the harvest comes the entire town looks forward to getting drunk on the cider they produce. Sally's parents grow oranges. They have orange trees as far as the eye can see and the town is noted for the fine marmalades that come from there. The amount of fruit each orchard produces is like a country's GDP. Both Jimmy and Sally are allowed to take as much fruit as they want (within reason) to school. They both like the fruits they bring, but they also like other fruits too. After some discussion, they conclude that to them 2 apples is equivalent to 1 orange, and so they decide to swap at that rate. This is the equivalent of an exchange rate. Word gets around the playground and before you know it, everybody is trading apples and oranges at the rate of two to one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does \"Student Athlete\" status vary from sport to sport in the NCAA",
        "response": "Ryan Donato is no longer eligible to play NCAA hockey. He has joined the Bruins. He's still a junior at Harvard (and still attending classes apparently) but he isn't allowed to play hockey for the Crimson anymore. This was something that he chose, to turn pro early and forfeit his remaining NCAA eligibility.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a reason we can't just boil contaminated water to make it drinkable?",
        "response": "Not all contaminants are alive. Boiling kills \"germs\", you still need to remove poisonous chemicals. You could potentially take boiling a step further, though, and distill the water. Boil the water, capture the steam, allow to cool and re condense into water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some languages, such as Spanish, use two question marks when asking a question?",
        "response": "Both language have two ways of signalling that it's a question - English has a question mark at the end, and word order inversion. Often a question in Spanish uses the exact same words as an assertion: Are you OK? ¿Estás bien? You are OK. Estás bien.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the relationship between Dukes and Counts during the Merovingian era?",
        "response": "The Merovingians adopted Roman hierarchical terminology; for them a 'comes' was a 'companion', someone deriving authority from his mission (either explicit as a palatial count, or implicit as a landed count) from the king. A 'dux', on the other hand, just means 'leader', and while theoretically he should always be subjected to a king of Christendom for his rule to be legitimate, his authority was not directly derived from his association with the king. Things change during the Carolingian period, when the counts become increasingly independent and heriditary. It gets complicated when monks try to capture the subtleties of non-Christian hierarchies within these classically-derived terms, such in pagan Saxony (what are 'satrapes'?) or Denmark 'rex danorum'?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has the Earth expanded over the last 3 billion years and is it still?",
        "response": "The idea that the Earth was expanding (or contracting) as an explanation for common geologic features (e.g. mountain ranges, ocean basins, etc) was abandoned once plate tectonics was developed and provided a more consistent set of explanations that were better supported by data. In the modern, with a variety of tools like GPS, very long baseline interferometry and others, we can directly measure the shape of the Earth and [say with relative certainty that it is neither expanding or contracting](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do mentally disabled people know that they're mentally disabled, and if not, is there a way to explain it to them?",
        "response": "It really depends on the disability that you're talking about.  Many of the Personality Disorders (like Paranoid personality disorder, Narcissistic personality disorder ect.) listed in the DSM-IV (basically the current encyclopedia of mental disorders) are egosyntonic. This means that the person doesn't recognize their maladaptive functioning as a disorder. Another example is Anorexia Nervosa. Women who suffer from this disorder usually don't see it as a problem and, in fact, are often very proud of their eating habits.  If, by \"mentally disabled\" you mean things like Autism or Down's Syndrome, then I think the evidence suggests that they know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we build a group of nuclear reactors that would power the continent or world.",
        "response": "You've gotten a bunch of decent explanations, but none have touched on the biggest issue: power distribution. Power lines have power loss, due to resistive heating of the power lines. The power loss increases with the square of the current, and linearly with distance. I.e. we don't want to transport the power too far, because the losses would be too high for it to be economically viable.  And if you want to power a whole continent from a cluster of nuclear power plants, the current in the power lines leaving the cluster will be very high, which leads to massively increased losses.  There is also the question of redundancy. What if another country attacks the cluster and render it useless? What if there's an accident like Chernobyl, that renders the whole complex inaccessible due to high levels of radiation?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do you people mean when they say that avocado is \"the good kind of fat?\"",
        "response": "Generally speaking, there are two types of fats: saturated and unsaturated. (Its actually much more complex than that but I'm keeping it ELI5) Saturated fats are the bad kinds you hear about that clog up your arteries and lead to a host of health problems - heart disease, hypertension, etc. Unsaturated fats, on the other hand, have been shown to have positive effects on your health. The help the body absorb vitamins, the can clean up your arteries and strengthen your heart.  So, no. Not all fats are created equal. The fats found in things like avocado, salmon, nuts and other things are not only necessary but also beneficial to our health.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does thunder go on for so long when lightning is over in a second?",
        "response": "In a word, Echoes. Now I'll just throw in some filler text so the bots don't send me annoying spam about how my one word answer couldn't possibly have adequately answered your question....blah blah blah...echoes...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our stomach acid is strong enough to digest razor blades, why can't we digest corn?",
        "response": "There's something in plants called cellulose. We know it as \"fiber.\" We can't digest all types of fiber. A lot of mammals have a thing called a coecum attached to their digestive tract, with bacteria inside, which digests the cellulose for them. Not an easy task for an animal, because it takes incredible amounts of energy to digest it yourself. That's why they employ bacteria.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the United States is in such major debt, why is our currency still good?",
        "response": "Just because we are in debt does not mean that the country's economic strength has waned. We are still repaying our debt on time, our economy is still performing relatively well overall.  [Take a look at this chart on GDP % Growth](_URL_2_).  [Also take a look at our yearly GDP in general](_URL_1_) [Our debt to GDP is kind of high, but not unusual as compared to other major countries](_URL_0_) So our currency is still good because our economy is still good, and compared to other large nations, is generally performing around the same. GDP is just how much we are producing in whole (very simplified). GDP growth means the country is considered a good thing, and while we had a dip going into 2009, since then our GDP has been rising to good levels again. In general, while we had a financial crisis, it was not nearly bad enough where we would have to consider the possibility of a debt default. The debt default 'crisis' was largely manufactured and was entirely political rather than an economic inability.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do those FBI internet scams work where they freeze your entire browser?",
        "response": "Browsers have built in features for saving user inputted text. For example, if i write out this comment without submitting and i try to leave the page or hit the back button, chrome will ask me if I really want to leave the page. This is so i don't lose my post or other work by inadvertently pressing the wrong button. Asshole hackers hijack these features and exploit other browser holes to try and fool people into giving them money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did American breweries survive the prohibition? Did any survive?",
        "response": "Yuengling is the oldest active brewing company in the United States, having been in continuous operation since 1829. Rather than shut down in the face of the 18th amendment, owner Frank Yuengling decided to focus on brewing near-beers with less than .5% alcohol. Sales still went down and the company diversified by making dairy products like ice cream. The ice cream business kept itself afloat for the next 65 years but Yuengling went back to traditional brewing as soon as the 21st amendment was passed. Curiously, Frank Yuengling sent president Roosevelt a shipment of their new 'winner beer' the day that the amendment was passed. Since it takes a while for beer to be brewed, the implication of this is that Yuengling had been brewing illegally in anticipation of prohibition's repeal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In animation, objects that are going to move in a scene (usually rocks) are a different color than anything around it. Why is this?",
        "response": "Often the backgrounds are painted with a paintbrush as one large image, and anything that will change is on a clear sheet placed above. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we not allowed to put metal in microwaves, even though they are made of metal?",
        "response": "The energy of a microwave is designed to particularly be absorbed by water and result in heating. As it turns out, however, metals will also absorb these same wavelengths. This turns out in the metal absorbing a ton of energy and, among other things, heating up significantly. It can also cause electric currents in the metal and all sorts of sparking. Though the microwave has a metal case, the interior walls do not absorb microwaves.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why should I eat breakfast?",
        "response": "No reason, it turns out. The [studies](_URL_0_) showing that breakfast was \"the most important meal of the day\" were done by breakfast companies and haven't been replicated. In fact, there's a counter argument which says that extending the period that you fast can be beneficial. So instead of fasting from 7pm to 8am, you fast from 7pm till lunch, which gives you a longer food-free period. (Google \"intermittent fasting\" for more.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Bose-Einstein condensation",
        "response": "Pretty tough to explain, but Nova did a pretty good documentary on absolute zero where they covered that. [Here is a clip of it](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Just started reading the Martian, could the thin atmosphere actually make a duststorm?",
        "response": "You can definitely get dust storms on Mars. We observe them all the time. Here is a Nasa information page about them: _URL_0_ But the thin atmosphere means that the winds involved in these storms wouldn't be nearly as strong as comparable wind speeds on earth. I think the author explained that he embellished the storm a bit for dramatic effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do \"wisdom teeth\" have so many problems compared to other teeth?",
        "response": "Modern oral hygiene - when compared to the rest of human history, is extremely \"new\". Evolutionary speaking, wisdom teeth came in *after* you lost the majority of your other teeth due to rot, disease, falling out, etc. They'd pop in to take the place of a bunch of other teeth that were already lost. Then, pretty much five years after that, you were dead anyway.  Many of the issues with wisdom teeth nowadays is that there's not enough space *for* them... is because we can keep the rest of our teeth healthy. There's no need for wisdom teeth if our other chompers are still working and in place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did people in the past have worm like belly buttons sticking out of their bodies?",
        "response": "The umbilical cord dries up and the stump falls off on its own within a few weeks of birth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your lip quiver when you are about to cry?",
        "response": "The acute stress reaction (sudden, extreme anger, frustration, grief or excitement) often leads to neurogenic tremors. It's not just your lip, but many other parts of your body start to quiver -- worsened when initiating movement. In this case, your mouth might quiver because you want to talk. In anger, you notice your hands might also start to quiver if you want to hit something. Often it's just involuntary and your legs may even give way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Engineering] Why has no one made an engine where the cylinders are of varying sizes?",
        "response": "Vibration would be a big factor. Straight 6 and V12 engines have the best balance/lowest vibration. Most others are compromises of space and vibration. If you have different sized cylinders everything becomes way more complicated and less efficient.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is \"terraforming\" an exoplanet feasible?",
        "response": "Terraforming is a solid concept but, as you seem to realize, one of the biggest questions is \"where do we start\". In my opinion, the most important part of terraforming is choosing the right target. As mentioned already in this thread, a large magnetic field is KEY to protecting the atmosphere from harmful solar winds. In addition, in order to support our type of life, large quantities of water are required. If the target has an ice cap, that is a good start, but creating a manageable greenhouse effect to melt it without overheating the planet would be very difficult. I think the most useful technology would be genetically engineered microorganisms that could be used to create an atmosphere / warm the planet and then \"turned off\" when they were no longer needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is some essential reading for the Muslim side of the early Crusades? (First through third)",
        "response": "I am sure that you have come across them in your search, but the memoirs of Usama ibn Munqidh, a poet from the 12th century CE, contain in-depth descriptions of warfare, cultural contact with the Franks, and medical practices. He has a heavily pro-Islamic cultural bias, of course, so you have to take much of what he says with a grain of salt but he is still an excellent primary source from the Muslim perspective. Though he focuses mainly on culture, he describes several battles, such as the retaking of Damascus, and the military technology and tactics involved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With such a successful experience with legalising recreational marijuana why haven't other states followed in the same path as Colorado",
        "response": "Since CO and WA legalized, AK, OR, and DC have also legalized, and a handful of states have decriminalized. It should be noted it has only been about 3 years since legalization took effect, which is about as long as it takes for these sorts of things to work through the legal process. There are strong legalization movements in several states right now. As for why states don't, there are a few reasons: * politicians shy away from the issue, as marijuana opponents will always vote against supporters, while supports are more meh about it * when the state has spend decades saying how terribly marijuana is and distorting the truth about it, it is hard to do a u-turn * many current politicians are on record speaking out against it * many law enforcement agencies and prison directly or indirectly get funding to enforce marijuana laws * many law enforcement agencies took advantage of prevalent marijuana use to gain legal leverage against suspects",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any difference between eating three meals over the course of the day, and eating the same amount of food all at once?",
        "response": "Avid intermittent faster here and yes, to answer your question, it's okay that you ate the bulk of your food in one sitting. As /u/torsed_bosons pointed out, humans are designed to fast every so often as it's how we evolved. Also, fasting is hormetic, so doing it once in a while can help lower blood pressure, raise insulin sensitivity, fight against heart disease, and it may help to lower cancer risk _URL_0_. I usually do mini fasts everyday, rarely eating before noon. Also, I do two 36-hour fasts per week for fat loss purposes. This helps me to not eat so strict on non-fasting days and keep my weekly calorie intake in check. Plus, eating small meals throughout the day just makes me hungry. I'd rather just eat 1-2 big meals later on and be satisfied. TL;DR: It's fine that you only most of your food at the end of the day. Small bouts of fasting can actually be good for you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if a girl takes Viagra?",
        "response": "She either grows a penis or her blood pressure changes for 6 hours.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wouldn't the 7 Years War be the first world war?",
        "response": "More can obviously be said on the topic, but [this answer](_URL_0_) from a now deleted user (and the follow-up comments) do a good job at illustrating why the 7 Year's War is not considered to be a \"World War\". Another similar thread [exists here](_URL_1_) (and I think the posts were by the same user).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we need a zip code when mailing something, if the address/city/state are on there? Or vice versa, why need city/state if you have zip code?",
        "response": "Cross-reference. Someone could easily misspell the city or write the wrong city completely. Having the zip code there helps decipher where it's really intended to go. Same for the opposite situation. If someone writes a zip code that doesn't exist, the city name will at least narrow down the options.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do prosthetic limbs work above the elbow or knee?",
        "response": "So in most cases, above the knee (AK) amputees actually don't have powered or robotic or hydraulic knees. They are very very expensive, heavy, and mostly experimental. Normal people don't get them. Most use a \"free knee\", which means they must land on it fully extended so they can weight bear on it. Then when they step onto the opposite leg they use hip flexion to swing it forward. It then kicks out and extends so they can land on it straight. People can get so good at it that only a PT can recognize the gait. This also allows the leg to bend naturally when the person sits (they control their descent with the good leg). There are many many ankle options out there, from the \"runner\" foot or blade to the pointed foot for dancers to a regular, nonflexible ankle and foot. With a prosthetic, the fewer moving parts the easier it is to predict and control. All this being said, prosthetics is a rapidly moving field due to all the soldiers coming back and needing innovative solutions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is a general practitioner a regular doctor? Is it the person you go to on a regular basis for check ups and general problems?",
        "response": "Yes that is correct. Some people get a specialisation (surgeon, gynaecologist, oncologist etc) after their medical degree but if they don’t, they can practice medicine as a GP (general practitioner)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a child was brought up speaking and hearing two languages exactly the same amount, i.e French and English, would the child speak in both languages?",
        "response": "Generally, yes. The thing is a person rarely hears two languages perfectly evenly. Usually it's an area that speaks X with a parent or two that speak Y. Maybe you grow up hearing both, but when you start to make friends and socialize in the area, the dominant languages gets more exposure.  But this is how e.g. Hispanic-American children whose parents speaks Spanish end up bilingual.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Parish records useful to historians?",
        "response": "Many Catholic parishes have kept records going back a couple hundred years. From those, you can obtain all sorts of information--deaths, marriages, baptisms, and the like. Some have financial records that can be used to gain insight into the economics of that parish and its parishioners. Tracking which priest or priests were assigned to the parish would give you an idea of what religious order might have influence over the area. If there's an archive of parish bulletins then you have a tiny newspaper--and we historians love newspapers. Is that the kind of thing you are asking about?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are creatures able to survive at the bottom of the ocean without their bodies being crushed?",
        "response": "Objects are only crushed under pressure if their internal pressure is less than the external pressure. For deep sea fish, their internal and external pressures are equal, hence the fish is not crushed as their internal pressure counteracts the external pressure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could life on Earth survive if our solar system was closer to the galactic core?",
        "response": "The concept of a \"galactic habitable zone\" is now gaining a lot of traction in planetary astronomy. Close to the Galaxy's center there's a lot to worry about though: our Milky Way may have had an active galactic nucleus (AGN) phase which would have wiped out a closer earth. Huge episodes of star formation could result in an abundance of SuperNovae causing excessive doses of high energy radiation that would be like blow torching a piece of paper. There are even theories that the sun's orbit in the galaxy is eccentric and brought it close to the centre some 100m years ago, wiping out the dinosaurs. Not implausible if you consider that the galaxy takes 250m to rotate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How it is possible to understand a language but not be able to speak it yourself.",
        "response": "Forming words and sentences is a different skill set to matching heard words with their translated counterpart.  You can hear cheval and connect that with a horse but being able to know you want the word for horse and that the word is cheval is harder. Basically multiple choice being easier versus short answer on a test.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has the Chinese ever had an elite spy service similar to the KGB or MI5?",
        "response": "So I'm slightly confused as to what you're looking for as the KGB and MI5 would have shared some tasks and not others. The KGB was divided into multiple directorates who had their own responsibilities from foreign intelligence gathering to domestic counter-intelligence. MI5 was responsible for the latter.  The Ministry of State Security would then be your equivalent branch in the PRC. [An article about a defector from them.](_URL_3_)  The PLA also maintains its own intelligence gathering organization, the Second Division, in case you were looking for military spying organization. Again mentioned in the article above.  There's also a book on Chinese spying efforts 'Tiger Trap' by David Wise, which while I'm unsure of its exact academic merits (and reviews seem to be mixed) is at least an interesting read.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does chloroform work?",
        "response": "Chloroform is an anaesthetic which acts on the nervous system and will eventually induce unconscious and death. It takes several minutes of inhaling chloroform to become unconscious, and on waking the victim will most likely have a terrible headache. I tried this, I would not recommend it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are bar codes regulated and standardized? How do they prevent two items having the same barcode?",
        "response": "Bar codes, conceptually, don't have any system to prevent duplication, but there are systems that use bar codes that enforce uniqueness. The UPC codes you see on grocery store items are one of them. In that system the first half of the digits are a manufacturer code (and some other data), unique to each manufacture. The second half is up to the manufacture to control to assign to each of their products uniquely.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Japanese Warfare; Time period irrelevant] Did armies or soldiers ever make use of shields? Why wasn't it a widespread phenomenon?",
        "response": "Not to discourage discussion, but [you may be interested in the writeup](_URL_0_) that /u/AsiaExpert did a few months back :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In 1897 Greece was beaten by the Ottomans, and then in 1912/13 they defeated them: What sort of reforms did the Greek military implement in the decade-and-a-half period between the two conflicts?",
        "response": "While there were factors specific to Greece as /u/dimtriant points out, there were a couple other major factors worth noting, the big one being that while the 1897 war was indeed Ottomans vs Greeks, the 1912 war was Ottomans vs Greece, Bulgaria, Serbia and Montenegro. Most of the fighting was actually done by the Bulgarians, and Greece, while certainly important, was something of a junior partner.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a completely curable mental illness?",
        "response": "The answer depends on how you define \"curable,\" but generally I would say yes. Many mental disorders can go into full remission and never resurface. Some examples of disorders that commonly go into full remission include major depressive disorder, social anxiety disorder, panic disorder, phobias, post traumatic stress disorder, etc. There are some mental disorders which are highly biologically based (e.g., schizophrenia, bipolar disorder) which tend to run a chronic course. However, many mental disorders have much less of a clear genetic/biological cause, and the maintaining features of the disorder are more behavioral/cognitive rather than biological. For example, depression is largely maintained by factors such as a negative cognitive style, social withdrawal, interpersonal problems, or lack of meaningful activities. If all the behaviors/cognitions maintaining the depressed mood are changed and the depression remits, it can stay in permanent remission.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there any precedent for the Nuremburg Trials?",
        "response": "I apologize for not being able to answer this in more depth at the moment. Generally, no. Nuremburg was unprecedented, especially the scale of the trials and the legal underpinning of the whole endeavor. (When saying \"Nuremberg,\" be sure to indicate which set of trials you mean since there were several. My assumption is that we are talking about the trials of the major war criminals -- the Nazi high command.)  In the past, victors had found easier solutions for dealing with the leadership of belligerent nations. For instance, Napoleon was exiled. After the First World War, there was a proposal to try Kaiser Wilhelm for war crimes, but he went into exile before this happened.  In Nuremberg, one of the principle charges was the new concept of \"Crimes against Humanity.\" While this was argued to be an ex post facto charge by the defendants, the victorious nations, particularly the U.S. and Justice Jackson, held that the crimes were so odious as to be understood as inherently illegal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would be the effect of having one computer connected via LAN and the rest of the computers connected via WiFi?",
        "response": "IT support specialist here.  Are your WiFi connected computers the ones having a problem?  What is the make and model of your router? What are you trying to do on the affected computers?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't Cerenkov Radiation violate causality?",
        "response": "When scientists refer to the speed of light related to causality ( c ), what they are actually talking about is the speed of a massless particle (usually the photon). When you hear about the speed of light in a medium slowing down, what you are hearing about is the macro level appearance of moving light. The reason it slows down is because as photon move through the medium, they are periodically absorbed and re-emitted by atoms in the substance. This absorption takes time, so the light seems to take longer to move through it. Between atoms though, photons are always moving at c. In my opinion, 'speed of light in a substance' should always instead be called the speed of propagation of light in the substance instead, because they are two different things, and this does tend to confuse new people. Hope this helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the risk of hearing damage proportional to actual sound intensity (dB-SPL) or perceived loudness (phon)?",
        "response": "Yes. It would be more accurate to say that hearing loss can occur when exposed to sound levels of 85 dB**A** or above. The \"A\" in \"dBA\" specifically indicates [A-Weighting](_URL_0_), which is a an adjustment applied to \"flat\" dB-SPL measurements to approximate the frequency sensitivity of the human ear. (Although A-weighting does have its inadequacies, we don't need to get into that here.) [Noise Induced Hearing Loss](_URL_1_) (NIHL) occurs when the hair cells in your cochlea are damaged as a result of over stimulation. Let's say we have a perfect pink noise signal, which is to say that the sound approaching your ears has equal energy at all octaves. After passing through your auditory system, this signal will create a greater vibration at the hair cells associated with the more sensitive frequency bands. Therefore the likelihood of damage to these hair cells, and hearing loss at the associated frequencies, is much greater.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is violence more acceptable on television than sex is?",
        "response": "Social norms. American society has decided that violence and blood is OK while nudity and sex is not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the oldest file format still in use today?",
        "response": "Depends what you mean by \"in use\". Somewhere some enthusiast (or maybe the US military) has an old mainframe computer from the 1950's running in their garage, so the binary executable files for that machine are still \"in use\". Or there's a simulator for some old architecture that can interpret the old binary files and run a program. Or what do you consider a \"file\". There are one or two reproductions of Babbage's Difference Engine in museums (or did Minsky finally collect his into his private collection) which are running \"programs\" based on a punch card format designed by Babbage and Lovelace in the 19th century. Does a stack of punch cards count as a file?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't their a Universal Currency that everyone has switched over to?",
        "response": "Hey there It's to do with the way the economy works. For example when a country isn't doing to well it's currency goes down in value and therefore goods from that particular country become cheaper to the rest of the world and then the country's economy starts recovering due to other countries now preferring their cheaper goods. We have seen the effects of a countries economy tied to international country that couldn't use this method to recover (Greece) it sort of scares the rest of the world to convert to a singular currency.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm a second-year History Major, with the intention of teaching at the Secondary Education level. I'm not quite sure yet what I want to specialize in, I really enjoy all aspects of history, but to me a concentration in World History seems too general. Can you all give me any advice?",
        "response": "You're more than likely going to be asked to teach whatever history courses are lacking teachers when you get a job rather than just the ones you want to teach, so I would recommend getting a good overview of everything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you have to pee much more frequently when drinking alcohol compared to water, soda, etc.?",
        "response": "Alcohol, specifically ethanol in this case, acts on your kidneys only indirectly. Ethanol inhibits the release (or production, I can't remember which) of Vassopressin (a hormone) from the posterior pituitary of the brain into the bloodstream. Vassopressin is what acts on the kidneys by increasing water channels in certain cells of the kidney, which causes water to be reabsorbed back into the blood. However, since ethanol inhibits vassopressin from reaching the kidney in the first place, you end up with less water being taken back into the blood. Now the only place for it to go is out, so you pee more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there examples of harmonies at work in nature/space?",
        "response": "I can think of a couple of examples in the animal kingdom. Some mosquitoes will buzz a [duet in a perfect fifth](_URL_1_) as part of a mating ritual. When they're in tune they'll even create overtones. Alligators engaging in their mating ritual release a subaudible bellow that has a frequency that matches the distance between the keels in the osteoderms on their backs. This creates the \"water dance\" on their back - which are actually [Faraday waves](_URL_0_), a type of standing wave. Not quite a harmony, but I don't know of any other animals that generate Faraday waves!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do epithelial cells line the outsides of organs that never experience external stimuli?",
        "response": "Endothelial cells line the interior surface of blood vessels. Epithelial cells are called that because of the layer of the blastoderm that they are derived from, IIRC. You may be mixing up epithelial and epidermal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do American radio stations play the same songs over and over?",
        "response": "I assume that's what gives them ratings. It's all about what's new and popular.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can ants and cockroaches eat food that we dropped or is \"dirty/rotten\" and not get sick?",
        "response": "Fungi are designed to be able to gain nutrients from our \"waste.\" It's the same thing with ants and cockroaches. In order to fill their particular niche, they have evolved to be able to eat foods that for civilized humans are considered dirty or rotten.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the budget for a cartoonish CGI movie (toy story 3) higher than a realistic CGI movie (Pacific Rim)?",
        "response": "Think about it like this - in a movie like Pacific Rim if you need a car in a landscape shot you pick a place to shoot, gather your actors and crew, rent a car, and shoot it.  In an animated movie you have to build the land, the road, the sky, the clouds, your characters, literally everything - then hire your actors to voice the part, pay technicians to make the characters be able to move, pay animators to make them move, this goes on and on... TL;DR: You literally have to build and move everything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are colonies who negotiated with their former colonial power for independence better off than those Colonies who won independence through a liberation war?",
        "response": "Is there any reason the mods keep shadow deleting all the comments? one or two were quite helpful",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is egg nog only available for a short time each year?",
        "response": "People think of it as a seasonal item and so tend to only buy it around the holidays, even if it were available year-round.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly do human learn to communicate by words?",
        "response": "The evolution of language is believed to be a gradual thing. Obviously the use of sounds to convey meaning is common across species. But our ancestors gradually developed a special brain region dedicated to this task, and began to use more and more different sounds to represent more and more complex meanings. This turned out to bring huge survival advantages by enabling people to be more effective in groups, and to pass knowledge down through the generations. So the adaptation stayed, and mutations that expanded it stayed too (through evolution, where things that keep you alive are favored). There was no morning, indeed no single century or millennium, when language just showed up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This may be a stupid question, but I can't find the answer.",
        "response": "The actual alcohol in the beer contains the missing calories; ethanol actually has a pretty high food energy per mass at 30 kJ/g or so. Also, it's not a stupid question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we use black cement to melt snow on sidewalks?",
        "response": "I'm assuming you're referring to asphalt instead of putting dark things in the concrete to make it black.  If that is correct, some places do use asphalt instead of concrete for walking paths. Asphalt doesn't last as long as concrete, and sidewalks don't tend to get much maintenance. When the ground under the sidewalk settles the asphalt will crack apart much faster than the concrete will. Also, if I was wrong, think of white as an insulator and black as a conductor. White materials act as a closed door and keep heat from moving. Black materials act as an open door and let the heat come right in. That works both ways, so the white sidewalk won't heat up much in the sun but it won't get too cold in the dark of night. Asphalt will heat up in the sun, but at night it will get colder than the concrete.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did British Regulars in colonial America really treat the colonists harshly?",
        "response": "Do you mean during the American Revolution or before hand?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't Earth tidally locked to the sun?",
        "response": "> due to our massive oceans The ocean tides are, as I understand it, a secondary effect of tidal locking due to *gravity*. The moon is a perfect example of tidal locking, as our Earth's gravity has caused one side of the moon to face us constantly.  > But since the surface if the sun is fluid, shouldn't Earth also be tidally locked to the sun? I think you're misunderstanding the concept, fluid isn't the initiator in this effect. We are experiencing tidal slowing due to the Sun. Eventually the Earth will be tidally locked with one side constantly facing the Sun. [Here](_URL_0_) is an answer to this question from a previous post.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why, in the US, are food companies allowed to put unnamed ingredients in foods and call them \"natural flavor\"?",
        "response": "The FDA has a list you can peruse. It's called the [\"GRAS List\"](_URL_0_) The simplest explanation is the acronym itself. The natural flavoring or coloring or whatever needs to fall under the category of GRAS, or Generally Recognized as Safe. For natural stuff, like flavoring, it's generally not that big of a deal either. If you are eating a green apple gummy bear that is natural flavors, it's using green apple flavor, likely from the juice itself. Artificial however, they still need to fall under the category of GRAS or they would need to disclose every ingredient. For something to fall under the GRAS classification, it needs to be something that gives absolutely NO allergic or adverse reactions, except in EXTREMELY rare cases.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does listening to music on full volume damage your ears if the sound is reduced by a loud ambient noise.",
        "response": "If someone sticks a pin in your butt and someone else cuts off your leg you still have a pin in your butt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Disclosing Domicile Deaths",
        "response": "The only logical reason is some people are uncomfortable with the notion of living someone people died. Their discomfort might not be completely logical, but that mean it isn't real or requires the supernatural.  In my town, there was a neighborhood that was officially called \"Swastika Acres\". It wasn't on any sign, no one ever used or even new about the name, but if you dug into city records form the 1920s, that was the official name. Even through there was no logical reason to change, when people found out their were uncomfortable with it, and had to official name changed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are battery’s measured in Amps and volts instead of Jules?",
        "response": "For a generic multi-use battery you need to be sure the voltage it presents is standard so that you know it is correct for the application. For a dedicated battery, you are more concerned with its total lifetime than with its power delivery profile because the designers have already taken care of that for you. What you the customer care about in that case is how much battery you are getting, and capacity - maH - is a better cross-spec comparator in that case.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does the moon only look huge when it's low in the sky?",
        "response": "Your eyes are used to things getting smaller in the distance towards the horizon. It's the principle behind perspective in painting/drawing. So a car right next to you is way bigger than a car in the distance, but your brain is used to understanding that they're actually the same size. The moon moves around us and never gets closer or further away as it does so. When it's low in the sky and you can see it alongside distant objects that appear small to you, the illusion comes from your brain thinking \"Hey, if it's that big way far away, it must be huge!\". Overhead, it's the same size (you can stretch out your arm and use your fingers to see that angularly, it occupies just as much of your vision), but now it's set against overhead clouds, or nothing, and appears smaller.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the greatest coup/overthrows in history?",
        "response": "The Russian Revolution set up what could have been the first communist state ever. as such, it failed, because of reasons stated in this quote:  \"“It is said that power corrupts, but actually it's more true that power attracts the corruptible. The sane are usually attracted by other things than power.” -David Brin \" Do not make the mistake of thinking of the USSR as communist. The \"dictatorship of the Proletariat\" turned into a normal dictatorship.  Also [Napoleon's coup](_URL_0_).  Also, Caesars [assassination](_URL_1_) And [Sulla's march on Rome](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm near sighted. Why is the image on the surface of a mirror blurry, even when the mirror is close to my eyes?",
        "response": "The mirror is close, but it just reflects the light. When you look at a mirror at something 10 meters behind you, it's the same as when looking at something that is 10 meters behind the mirror.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are signatures legally binding when they can vary so much and be easily forged?",
        "response": "Sweet, I'm the first one to post [this](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Reddit organize the content on my front page?",
        "response": "My understanding is that it is based on the post's score (upvotes-downvotes), reduced by a formula based on how old the post is. The score is also adjusted so that each additional upvote is worth progressively less. I'm not sure if any additional adjustment is made to balance posts from different subreddits. For the non-ELI5 version, see a statistical description of both the story and comment rating algorithms [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the efficacy of out-of-hospital CPR?",
        "response": "As an addendum, it's rare for CPR to restore someone to health. What CPR does is keep your brain oxygenated so that some other process can restore your heart to working order. Much of your body can afford to be without oxygen for a while -- it's safe to apply a tourniquet to a limb for several hours -- but your brain is a resource-hungry bastard. Brain oxygenation is so important that, in some cases, medical professionals will perform a round or two of CPR before attempting to call an ambulance. (Remote Medical in particular is recommending this for certain situations in their Wilderness First Responder classes.) At your level of medical training, though, the most important thing is to contact emergency services and obey their instructions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What attracts a liquid to stick to the side of its container (e.g. tube wall)? What does adhesion, low surface tension, cohesion got to do with it?",
        "response": "cohesion - how well something sticks to itself  & #x200B; adhesion - how well something sticks to something else  & #x200B; surface tension - kindof like cohesion at the interface between the solvent and air.  & #x200B; So, low surface tension means (usually) low cohesion. If low cohesion then adhesion (to the container) may be more dominant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does printing off money cause inflation?",
        "response": "Printing money doesn't create wealth; it just redistributes it. Imagine an economy with an output of 100 pillows with $100 in total currency. Each pillow is worth 1% of the economy, or $1. If I print out $100 I haven't increased the wealth of my economy. Each pillow is still 1% of the economy, which is now $2. All I've done is given myself half of the purchasing power of the economy; I've basically stolen half of everyone's money. Even if I gave everyone their share of the $100 no one is better off. You still only have access to 100 pillows. Just because you're holding \"more\" money doesn't mean that your purchasing power has changed. People become better off when the output of pillows increases, or with the output of a new desirable product like a bed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone go to the moon (If they were able to) or is it like some sort of private property of a government ?",
        "response": "No one owns the moon. So you could go there is you wanted to. However I would imagine you need to permits to build a rocket that powerful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Ptolemic dynasty avoid dying out in two or three generations from inbreeding/infertility?",
        "response": "That's not really how inbreeding works. I direct you to my discussion in [this previous thread](_URL_0_) on more or less the same subject.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes humans to age and why is it rare to live pass 100 years of age?",
        "response": "Each time our DNA is replicated, the telomeres, located on the ends of the strands of DNA, shorten. A current prevailing theory is that this shortening of our telomeres is what causes aging: basically a copy of a copy of a copy of a copy, until you have a degraded version of the original.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes some materials conductors and insulators? Is it something about their molecular structure?",
        "response": "Metals are good conductors of electricity because the atoms in a chunk of metal are packed close together in a lattice, and so the electrons in the outer orbitals have an easy time jumping from one atom to the next. So when a tiny voltage is applied, electrons all start moving in the direction, like a river flowing among rocks. Insulators are the opposite, their atoms hold onto their electrons tightly, and a lot of energy is required to get the electrons to move around. The energy required to get \"insulator\" electrons to move is high, but not infinite. Air is an insulator, and lightning is what happens when the voltage difference between the cloud and the ground is high enough to get the electrons moving. This can happen in a plastic insulator too, if the voltage difference is high enough, it will lightning right through the plastic. This is why higher voltage wires have thicker plastic insulation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After snakes swallow a large meal, how do they avoid getting eaten in turn?",
        "response": "That is a very real concern for the snakes when they eat a large meal like that. Really there is not much for them to do besides wait out the digestion period. Usually a snake will hunt in an area it is familiar with and has a dark hole of some kind it can lay in for a while for some protection while it digests. Other then hiding away they really don't have a mechanism to defend against this. They can still hiss and bite to an extent so they are not totally defensless but they are at a higher risk. Hope this helped!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The world record for the men's 100m is 9.58s. However, the world record for the 4x100m relay is 36.84s, an average of 9.21s per leg. How is this possible?",
        "response": "The 100 is a very short race and it has a standing start, so a large portion f the total race time is spent getting up to speed. In the 4x100 only one of the 4 runners has a standing start, the rest are handed the baton at as close to full speed as possible. So the standing start is less of the total time. If you wanted direct comparison you could look at the first split in the relay. That includes the standing start; you would find it's slower than the 100 runners since you want your fastest sprinter anchoring.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Middle Eastern History] What would have been the buying power of \"30 pieces of silver\" to Judas at the time of his betrayal?",
        "response": "There's always room for more answers, but these past threads might get you started:  _URL_1_? _URL_2_? _URL_0_?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do several sites with new \"breakthrough\" ideas use videos players that dont allow you to rewind/scroll to any point in the video?",
        "response": "Do the links for the these videos often appear on the sides by advertisements?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are cave paintings so often called 'art'? Isn't it much more likely such drawings were practical?",
        "response": "Art and practical drawings often intersect, so some cave paintings may have served both functions. But people don't stop producing art when times are tough, in fact art becomes very important to modern humans in the most brutal of times. One function of art is to increase social bonds, which is highly important for early humans. Cave paintings aren't a very practical method of communication either. It is much more likely that practical communicative drawings would be done in dirt, sand, or clay, and would quickly be washed away. Going into a cave, preparing the paints, torches, and doing the detailed work that goes into some of the painting just isn't efficient for communicating day to day things. Perhaps for intergenerational communication it was used, but that would take on an artistic flavor in addition to whatever practical purposes it served.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pros and cons of adopting a highway?",
        "response": "Con: you can't decrease the number of lanes to make wider, luxurious lanes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the best way to memorize history facts?",
        "response": "The best way I can think of studying history is to see it not as a pile of facts you should memorize, but as a long sequence of influences, movements and gradual changes, occasionally marked by a certain event which counts as an accumulation of several factors. Quantifying things helps too: There were four stages to the French revolution, there were three new taxes before the Boston Tea Party, the Communist Manifesto had five main points, etc. Writing these down helps remember them, but the best way isn't just to remember them as facts floating in space, but to understand the why and the how - *why* did the Thermidor reaction end the Reign of Terror? *How* did those new taxes escalate animosity between patriots and loyalists? *What context* was the Manifesto written in? Once you remember the flow of history, once you really *get* how history isn't just a lot of \"what happened\" but also \"why\"s and \"how\"s, then remembering the dry facts - while never easy - isn't all that hard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any circumstances where momentum is not conserved?",
        "response": "No. Momentum conservation follows from symmetry of a physical system under spatial translations. This is a very deep symmetry, taken to be fundamental by most physicists. You can construct a physical system which is not translationally-invariant, but it really just means that if you were to extend your system to contain the thing breaking translational symmetry, you'd find that the symmetry is still upheld. In other words, momentum is not conserved if you don't have a **closed** system, but if you extend your system such that it is closed, the total momentum will be conserved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Troubles, or the Northern Ireland Conflict",
        "response": "The 1960s saw the beginnings of a civil rights movement among Catholics in Northern Ireland who sought an end to discrimination they faced at the hands of the British government. The main thing the civil rights campaigners were looking for was the idea of '1 man, 1 vote'. This is important as Protestant business owners often had more than 1 vote. Similarly, they sought an end to gerrymandering. The Protestants/Unionists, while being in the majority in Northern Ireland were (and still are) the minority when you take into account the Republic of Ireland's population. Therefore the Protestants in N.Ireland at the time of the civil rights movement, felt that any concessions to the civil rights campaign, might lead on the long run to a United Ireland and the erosion of their British identity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can we or can we not use technology to view inside a black hole?",
        "response": "There are a couple of problems with that idea: - Black holes are _really_ far away. The closest one we have found is Cygnus X-1, which is still 6,000 light years away. We simply don't have the technology to send something that far away yet. - Even if we could get there and we could send some signal back (a 12,000 year round trip is the best case scenario), we wouldn't learn anything useful. We can already observe black holes right up to the event horizon - the point beyond which the black hole begins to absorb everything. New data would have to be from inside the event horizon, wherein lies the problem - it absorbs nearly _everything_. There would be no way to get signal back outside to send back to us.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What actually is stamina?",
        "response": "Contributors to stamina: Blood flow, how easily does your blood flow. Ease of blood flow contributes to stamina. Oxygen intake and efficiency. How much oxygen can your body intake and use, what's the efficiency of the usage, intake vs usage. Build up of lactic acid. Lactic acid causes muscle fatigue and soreness. How much lactic acid builds up in your muscles when you exercise.  These three factors contribute to your stamina and ability to perform exercise, or endure long bouts of physical activity. Each one of these factors can be increased or strengthened through exercise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you have CIPA (the inability to experience physical pain), can you still experience physical pleasure?",
        "response": "Saw no one had chimed in but I got curious and did a little digging. I found this from some yahoo thread asking the same thing several years ago: \"Yes. CIPA is a genetic mutation which prevents the development of cells which carry the electrical signals for pain, heat and cold to the brain. Pleasure is mainly derived from the body releasing dopamine, not from your nerves. For instance, when someone you have strong feelings for touches your arm, its not the touching that makes you feel good, its the fact that its someone special, your body releases dopamine as a way trying to keep you calm. Sexual pleasure is from a stimulation of a large cluster of nerves in a single spot. CIPA does not affect this, just like it doesn't affect pressure or touch. Having CIPA does not mean you are numb, you just have the inability to feel pain, heat or cold.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does printing a receipt from a cash register work? What kind of file is a receipt?",
        "response": "A typical receipt printer itself has just enough memory to store an array of 1s (print here) or 0s (don't print here) to store a character, or potentially even a line (could be 8 dots high; 40 or 80 dots across). Like a litebright board, one character at a time. More sophisticated printers would have capacity for more lines. Whether it's a thermal receipt printer, or an impact/contact printer, the print head has those same matrix of positions that can be a 1 (make a dot) or a 0 (don't make a dot). So, it's usually what the printer is attached to that converts what numbers to print, to a simple array of dots that represent our visual interpretation of that data. No specific file type; just a matrix in memory, generated by the language of the register itself, in real-time, as-needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are the cells of a Blue whale bigger than those of a human?",
        "response": "In general, as others have suggested, no. However, their longest nerve cells may be considerably longer than ours, depending on how far they need to reach from their spinal cords. The greatest distance ours travel is from our spines to the end of our toes, however in whales it's probably from their spines to the front of their bellies. I imagine some of their nerves cells might be several metres long, in that case.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to take the president (or any other important person) to court? Are they legally obligated to respond/show up in court?",
        "response": "I always wondered how the president/famous people/royalty handle things like the DMV. Certainly they aren't in line with the rest of us peons are they?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was the first trial (by jury or by judge) and/or what pre-dated the trial that eventually evolved into the modern western version of a trial?",
        "response": "The western version originated with the Germanic [Thing](_URL_1_. Read the history of [Alfred the Great and his reforms](_URL_0_) thereof. The Anglo-Saxons in England developed a sophisticated system. Everybody knows the Sherif from Nottingham in the Robin Hood Saga. This Sherif job was part of that Anglo-Saxon system. The unique circumstances on the British Isles lead to the sophisticated understanding of law and freedom we enjoy in the West.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is low fat milk sometimes skim milk and cream combined, instead of partially skimmed milk?",
        "response": "It's easier to make a machine that just takes *all* the cream off, and then put some back. Speeds up factory production in volume.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is 'xxx' a symbol for porn?",
        "response": "In the US, originally, the rating system had an \"X\" rating for movies that either did not meet criteria to be rated at \"R\" (which was meant for mature audiences and not for children) or not rated at all. Few movies took the \"X\" rating because it meant that most theaters would not distribute the film, making the production company less money. This did not hold true for porn films, as they were never rated to be widely released. All were by virtue of this, rated X. Then, I want to say in the 1970s, porn companies took the rating as a sarcastic way of marketing their content, since a couple of US movies gained critical acclaim while also being rated X (Midnight Cowboy even won an OSCAR with the rating intact). They started marketing their films as \"XXX\" in a way to say, \"Hey, we're so far beyond what the rating board will allow, we're TRIPLE that limit.\" That's more or less how the XXX thing started, though I may be leaving some parts out through my own bad memory.",
        "source": "sentence-transformers/eli5"
    }
]