[
    {
        "query": "Where did parades come from?",
        "response": "I couldn't speculate on a far-off, ultimate point of origin, but in Ancient Egypt on holidays, gods such as Amun were carried into the streets in their ceremonial barque, then led in procession before the common people, the only time when a non-royal or non-priest would be able to directly address the god. Obviously it was a very, very big event, hugely attended by the peasantry. I'm sure one of our Roman historians could also elaborate for you on Roman military Triumphs, which (to my understanding) were celebratory parades in honor of military campaigns.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we swallow hard when we see someone who’s extremely attractive?",
        "response": "Seeing someone attractive makes you nervous (sympathetic nervous response), and you get a dry throat when you're nervous. So you swallow to try to get rid of the feeling of dryness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Molten Salt Nuclear Reactors",
        "response": "Well, no one has answered yet... So I'll try to explain it: To put it simply. An MSR uses salt instead of water to transfer thermal energy. However, instead of having fuel rods like in traditional nuclear reactors, the uranium fuel is mixed in with the salt. This creates an inherently stable reactor, as when the heat increases, the salt expands and pushes into cooling tubes. Even if the reactor gets too hot, it cannot go into meltdown, since the materials are already molten. Edit: Water is still used to generate steam to run turbines, it's just that salt is used to directly extract the heat energy from the uranium fuel. Hopefully someone else who knows more about MSR's will find this post. But this is the basics of what I know about them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how vaporizers (or nicotine vape pens) pose less health risks than smoking cigarettes.",
        "response": "You aren't inhaling the byproducts of combustion. Nicotine isn't great for you but it's the tar in cigarettes that kills people. I've seen cadavers of smokers and their lungs are black. That tar is just full of nasty stuff.    Vaping doesn't produce tar, it's just a method to inhale nicotine without combustion. There is some controversy over the solvent propylene glycol that they use to make nicotine vape liquid , but it seems as long as you keep the temperature down you are OK. And actually one can also use vegetable glycerine as a carrier which is probably more benign. But in any case with vaping there is no tar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does \"zzz\" come from and why do we use it as onomatopoeia for sleep? Is it used in languages other than English?",
        "response": "The two answers I came across are that snoring noises sound similar to a 'zzzzzz' noise.  Also, the letter Z is similar to an electrical wave.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When the hydrogen in the Sun fuses, releasing light and heat, where does that newly formed particle go? What becomes of it?",
        "response": "The Hydrogen fuses into Helium which remains inside the star. At some point, the star starts to run out of Hydrogen to burn. Because there is no more outward pressure resulting from the energy that the fusion usually creates, the star starts to shrink, thus heating up. Once it heats up enough, it reaches the temperature to burn Helium. This process actually repeats a couple of times, causing fusion of increasingly heavy elements. The final result is usually that the star becomes layered: There are different fusion processes going on in different layers in the star. The outer regions are still burning the leftover hydrogen, followed by Helium etc..",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has anyone had sex in space yet? If so, how, and why? If not, why not/is it viable?",
        "response": "Husband and wife teams have gone into space. The odds of someone at least attempting it are pretty high. However, NASA says it's difficult to obtain an erection in zero-g because of blood flow problems. The \"Uranus Experiment\" series shows zero-g sex filmed on aircraft.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all other buttons on a computer require the computer to be on to do work, how does pressing the power button turn the computer on in the first place?",
        "response": "Most power buttons close the circuit allowing the power from the wall go to the starter part",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a State of the USA leave the Union and become an independent country?",
        "response": "Only if the federal government let it. See: American Civil War",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did steppe nomads do to children with Down Syndrome or similar diseases?",
        "response": "People in the ancient world generally frowned on any sort of physical disability even if it was injury from war. Exposure was a common practice not only for Spartans in the movie 300, but most ancient and many primitive societies. It's very likely that steppe nomads would have engaged in similar practices if children appeared physically disabled or deformed, as they did not have the resources to support extra people that, at least in their view, could not contribute like a \"normal\" man or woman.  That said, children that were exposed could also be adopted by another couple looking for a child. This happened in both Greece and Rome. Perhaps it's also possible that a sturdy looking child, even if it had an unusual facial appearance, would be expected to grow up into a physically strong person and somebody might keep him? For a female however, I think that would be almost impossible as they would struggle to attract a mate in later life.  Overall, I'd say they were generally exposed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Marriages - specifically child marriages - throughout history: context?",
        "response": "hi! not discouraging further input on this, but FYI there are a few posts on this topic in the FAQ* - check them out for previous responses [Child marriage](_URL_0_) *see the link on the sidebar or the wiki tab",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a gas giant like Jupiter \"dissolve\" in our lifetime or any foreseeable future?",
        "response": "I think what you mean by 'dissolve' is if Jupiter can be dispersed (blown away). On small planets with no (or weak) magnetic fields like Mars it's possible for the solar winds to blow away the atmosphere. However in the case of Jupiter it has a large magnetosphere and is at no risk of our sun affecting it.  Further any force/event that *would* disperse Jupiter would likely be the end of all our lives here on Earth as well. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were the Irish so reviled by the English but not the Scots?",
        "response": "Can I ask what makes you think they became \"more tolerant\" of the Scottish over time? I think I can probably prove that they didn't but I'd like to know what to address directly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is space a vacuum?",
        "response": "Vacuum is relative -- an area of low pressure feels like a vacuum compared to an area of higher pressure. A space capsule is pressurized, so space is a vacuum in relationship.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain to me the fourth dimension",
        "response": "You might enjoy these previous posts on the topic: _URL_0_ _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do New York City's skyscrapers have any noticeable effects on the city's weather?",
        "response": "Cities affect the local climate. Generally, they are warmer due to materials (concrete, asphalt, etc.) and the lack of evapotranspiration due to lack of vegetation. They are generally less windy (because of tall buildings) and develop street canyons. Due to particulate matter, cities might receive less sunlight; however, particulate matter can serve as condensation nuclei, altering the development of clouds, fog, humidity, and precipitation.  You can search more about Urban Heat Island Effect, as well as albedo.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the etymology of the word \"Guinea\", and why is it so widespread?",
        "response": "Are \"guinea\" and \"guyana/guiana\" definitely related? I tried to find this out a few months ago, and I don't think I found a definitive answer, but it seemed to me that they probably weren't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do video game coders optimize their games to boost fps and stability?",
        "response": "The basic method is they look at how long their code takes to perform each function and look to see if there are more efficient ways to perform that function. If you can do the same action with 5 calculations instead of 10 then you have double the speed of your code. If you can avoid having to read data from a slow hard drive and instead have it available in very fast graphics memory then you can similarly increase the performance of your game.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't boats have transmissions like cars do? Wouldn't that make them be able to go faster?",
        "response": "Some boats, very high performance ones, do have transmissions. But for most normal boats, this adds a lot of complexity and, most of all, cost. The other factor is that water behaves very differently than air. Water resists being pushed out of the way, and the harder you push, the harder it pushes back. The fancy term is compressibility. It's because of this that a fall from a great height into water tends to be like hitting concrete.  So, back to the boat. As you spin the propeller faster and faster, it gets harder and harder to turn. Also, the drag of the water against the hull increases, requiring more effort. So, a boat in water is like a car that is going up a very steep hill. It needs to gear down to maintain speed or accelerate. With a boat, it works out that most of the time you only need one or two gears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do [win X] competitions where the prize is a lifetime supply of the product manage to work?",
        "response": "First of all, there are limits to how much is given for free. Usually \"one per visit\", \"one per day\" or \"one per week\". That keeps the costs from getting too prohibitive. The winner could go into a McDonald's, get an ice cream, and had to come back later, and couldn't just sit in the lobby from open to close and demand a thousand ice cream cones. As for why companies do this, it's great advertising. Even if the person takes advantage a little, the actual cost per cone is pretty cheap, and it would take years for the cost of him eating thousands upon thousands of ice creams to equal a single commercial spot. So, for the cost of two commercials (the one advertising the contest, plus the cost of the ice creams), they get thousands or millions of active participants in a contest, including names, addresses, phone numbers, etc., that they know, for sure, are interested in McDonald's.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did any us troops in Vietnam pick up ak's or sks weapons?",
        "response": "Locally? Of course. Long term? Too hard to get ammo. Also the distinctive sound would be a problem in a firefight when pretty much everyone involved is firing at sounds. Firing an AK is just another way to get your guys to shoot at you.  Now special forces sometimes deliberately used AKs for that very reason. I read one account of a tactic a team would use to have one man with an AK. When breaking contact he would fire, and the VC/NVA would stop firing, thinking they were shooting their own guys.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you wanted to push an orbital object towards it’s gravitational well, *as fast as possible*, (say, like, using rockets to push Europa into Jupiter...) would you slow the object’s orbital speed (x)? Or push the object directly towards the gravitational center, at equal force (y)?",
        "response": "You would slow it's orbital velocity, as it's tangential velocity decreases it will drop because the acceleration from the larger body will be able to pull it closer. Orbits work by the orbiting object moving sideways as it's attracted to the planet and so it falls around the planet. If it is no longer moving sideways it will fall directly towards the planet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the tv series \"Wolf Hall\" Thomas More mentions the conquests of the ottoman empire as an existential threat to Christianity, would this have been a common mindset for people as far removed as England?",
        "response": "Just like to leave a comment here pinging u/Fornad and an excellent answer to a question concerning [the fall of Constantinople to the Ottomans and its reception by Christian elites](_URL_0_).  While the two settings are decades apart perhaps some of the attitudes could be shared by these elites? Also given that it’s Thomas More we’re talking about maybe he had written something on the matter of the ‘Ottoman threat’? EDIT: forgot to actually leave the link here.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Parsley can cause a miscarriage?",
        "response": "[There is some evidence that parsley might be partially effective in inducing abortion, but it doesn't appear to be very safe.](_URL_0_) That \"infographic\" is at least ill-advised and possibly dangerous.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Dungeons and Dragons",
        "response": "Nope...Players can collaborate with their DM's via private RP or passed messages. The only one who really needs to know what's going on is the DM. Players can be completely ignorant to what another party members' true ambitions are. It's part of the role play. Players can collaborate with each other and leave another party member out, as well. They may or may not need DM approval, depending on what they are doing. This is usually done with private messages or out-of-character conversations.  Also, player knowledge does not equal character knowledge. If you discover two characters are plotting together but your character has had no indication and no reason to believe that the others are in cahoots, then you cannot make your character miraculously know it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "WhatsApp announced end-to-end encryption on all of their services, so that no 3rd parties or WhatsApp themselves can access any information transferred. How does this work? How does WhatsApp prevent themselves from being able to see the data?",
        "response": "The data is encrypted, and it is not decrypted until the other device gets it.   To visualize it, say I sent a safe to a friend via FedEx, now FedEx can't see what's in the safe because they don't have the key, only me and my friend do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pouring molten aluminium mishap, what exactly happens here?",
        "response": "There was some amount of moisture still in the mold. The water got super heated and the escaping steam caused the molten aluminum to pop.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are satellites more powerful than wifi?",
        "response": "The distance a radio signal can travel is based on how strong the signal is. GPS satellites are allowed to broadcast very strong signals. Your Wi-Fi transmitter is not. This isn't a technical limitation, it's a legal one. The reason your Wi-Fi router's signal strength is limited is that if everyone broadcast really strong signals on the same frequency (and Wi-Fi is only allowed to be on a limited range of frequencies), they'd all interfere with each other and no one's Wi-Fi would work. Think of it like 100 people trying to shout in the same room at the same time, versus everyone having a quiet conversation with the person next to them.  Since GPS was set up by the government, it was given its own dedicated set of frequencies and no one else is allowed to have any radio transmitters on those frequencies so everyone's GPS receivers can hear the satellites.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Tinder Bots. How? More importantly: Why?",
        "response": "Some get you to click on websites that they will make money off of, others could be from tinder themselves to encourage users to use the app. As for how, I'm not sure what needs explaining. Take a random picture from a collection, add in some basic info any maybe a sentence for the bio and try to match everyone possible for spam. All automated by a computer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it a natural human instinct to flail your arms and legs around when jumping freely from a distance, such as a diving board or cliff diving?",
        "response": "By rotating your arms you push your body the opposite direction, serving to try to keep your body upright. Note that people instinctively rotate their arms in the direction their torso is tilting as they fall, it isn't random flailing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the differences between mental and clinical depression?",
        "response": "By \"clinical depression\" they are referring to major depressive disorder (or similarly named conditions), as categorized and studied by psychiatrists. Your friend is using \"depression\" as a special term in psychiatry. Traditionally however, \"depression\" refers to an emotional state that all humans experience from time to time, which is perhaps what you have in mind for your story. Unfortunately, people who don't really understand the importance of context improperly assert that only one meaning or the other is the *true* meaning, which is silly. For comparison: everyone experiences anxiety once in a while, and the concept is well understood, but a psychiatrist would only diagnose you with an *anxiety disorder* by referring to formal diagnostic criteria established in his profession. The psychiatric term must be distinguished from the ordinary use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are vegetables considered \"better\" for health purposes than fruits, is it just because of the sugar? Could I get all the vitamins and things I need by eating a wide variety of fruits with no vegs?",
        "response": "Both fruits and vegetables posses a wide array of phytonutrients, vitamins, minerals, and dietary fibers. Almost everything we classify as a fruit has carbohydrates in the form of sugars, and thus calories. Almost everything we classify as a vegetable (with exception to root and harvest veggies like potatoes and pumpkin) is low in calories. Fruits tend to be around 70-120kcal a serving, low calorie vegetables around 5-25kcal a serving. Since excess calories and sugars are seen as problems in society, the ones with less calories and sugars are seen as 'better'. (I say 'almost everything' as there are some foods that society cannot decide to call either a fruit or a veggie; like tomatoes)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Meta] How does the AskHistorians Twitter account work?",
        "response": "Don't believe /u/caffarelli, it's a robot that's algorithmically programed to find the best stuff out there. It's the real deal.  But also, if you want to get *even more* great interesting questions and answer that you might have missed, check out the weekly [Sunday Digest](_URL_1_) thread. The amount of good stuff people put on this sub that gets four to six up votes is astounding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our bodies are normally 98 degrees, how is it that we get so hot and sweaty if the temperature outside is even a bit lower than that?",
        "response": "Because your body generates heat, with everything you do, every piece of food you eat, is energy you're putting into your body that is used and turned into heat, or stored as fat. So the hotter your surroundings, the harder it is to get rid of that excess heat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "New York City government",
        "response": "NYC resident checking in. All five boroughs are part of the city. We have one mayor. There are Borough Presidents but they have little power in city government. By the late 1800s, New York City was just Manhattan. Queens was a bunch of little villages and towns, as was Staten Island and The Bronx. Brooklyn was its own city. Then they all consolidated into one city, under one mayor. I've lived in Manhattan, Brooklyn, and Queens. When I lived in Manhattan, my address was written as New York, NY. In Brooklyn, it was Brooklyn, NY. But in Queens, it was whatever neighborhood I lived in, as those used to be the names of the villages that existed there at one time. But, you can address an envelope to Queens, NY and it will find its way to the right place. In fact, you can address anything to New York, NY no matter the borough, and as long as the zip code is right, it should get there...eventually.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could we notice (visually) that our galaxy is rotating?",
        "response": "> Would our standard set of stars like the big Dipper, orion etc... still be visible?  No, in fact we don't have to wait for a half rotation of the galaxy. Within a hundred thousand years the familiar constellations will be different shapes as the stars have moved relative to each other in that time, and in a million years or so most will be unrecognizable and many stars would be visible in our sky that aren't today, and many stars we see today would be too far away to see.  > What about stars outside our galaxy? The other galaxies visible in the sky would mostly be in about the same place relative to each other, but a different place relative to the Milky Way.  > How did we ever use the stars as navigational aids if their position is constantly changing? Is the change not enough for people to notice in their life time? Correct, the stars move noticeably over tens of thousands of years. They hardly move at all in a century.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were / Are there any traditionally matriarchal Native American tribes?",
        "response": "Yes. The most famous and well-studied are the Iroquois (although the word 'matriarchal' is controversial, they were matrilineal in major property distribution and mothers had executive veto power over major decisions of men's counsels, creating a kind of bicameral system). See Judith Brown's \"Iroquois Women\" (which is reprinted in many places).  Many Native American cultures favored a kind of division of labor between the sexes that awarded major decision making to each sex/gender. So they wouldn't be called either patriarchal or matriarchal. There are, imo, no \"matriarchal\" societies in which women possess the kind of power that men do in the patriarchal societies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does America oppose communism so strongly?",
        "response": "There were a couple Red Scares based on the threat communist ideology posed to the existing order in the US. The modern animosity towards Communism was because it was the ideology of the Soviet Union, who was a rival to the US and its Allies after WW2. Due to the rivalry, the US played up the anti-freedom and anti-individual aspects of Communism and the USSR in order to indoctrinate its population against foreign infiltration. Additionally, as historians have studdied Russia and ther Communist nations, Communist revolutions have a nasty habit of involving a monstrous amount of mass murder and actual tyranny, which provides legitimate justification for sentiment thatwas seeded by what more or less amounted to propaganda.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Speed of Light? I am Confused :S",
        "response": "Mass is energy that things have at rest. Photons are never at rest; all their energy is kinetic. They have no mass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can I get mononucleosis from one sip of the supposedly mononucleosis-infested beer?",
        "response": "Yes its possible Probable? Dont know Impossible? Doubt it  & #x200B; Wont know till you test or show symptoms",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "History Teacher Needs Help",
        "response": "I'd just like to caution you against heavily drawing upon Howard Zinn's *A People's History of the United States.* As [others] (_URL_0_) in this sub have noted, it's revisionist history. I always hated when my high school history teachers fed us agenda-driven history, it just loses its objectivity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If atoms don't \"touch\" each other, how is friction created?",
        "response": "It's atoms running into each others fields of influence. When they react in this way they are pushing back on each other and this causes some kinetic energy to be transferred into the atoms heating the atoms ever so slightly. Duplicated over a few million times across a wide surface and you get friction and friction heating.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a theoretical relationship between superconductivity and gravity?",
        "response": "No, they're generally not related. There are some areas of physics that use insights from theoretical descriptions of gravity to understand superconductivity, and vice versa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that we are able to remember a songs lyrics even when we haven't heard the song in a while?",
        "response": "Because you associate the lyrics with a melody, and it's much easier for us to remember melodies than a sequence of text. Also because the lyrics rhyme and have a meter. A meter means a pattern of the number of syllables per line in a verse, with the stressed syllables alternating in a predictable way. Probably the most recognizable meter is what Shakespeare used, iambic pentameter. Penta means five, iambic means it starts with an unstressed syllable and then every alternating one is stressed: to BE or NOT to BE, that IS the QUEStion __ 1 ___ 2 ____ 3 _____ 4 ____ 5 _____ This creates a pattern of sound, and it is really easy for us to remember a pattern of sound rather than a pattern of text. If you look at the text of old Norse sagas, like Beowulf, they have a pattern where each line is two halves, and the halves rhyme, and they have a stressed-syllable meter as well. This was a mnemonic device to allow bards to remember really long stories exactly, before they could be easily written down and shared.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when lightning hits a beach of sand?",
        "response": "You get a piece of fulgurite if you're lucky. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a near-light-speed spacecraft travel in a loop, or only in straight lines?",
        "response": "There's nothing stopping you from doing that. The trip that goes at constant speed & sudden change in direction is just used as a teaching tool, because it's really easy to do the maths - a good high school student could handle it. In practical terms, you'd need a lot of energy to do that, but if we're talking about near-light-speed travel, we're talking about a pretty huge amount of energy to start with. You can also get into an orbit around a black hole at quite high velocities, although that gets a bit [complicated](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Paris, unlike perhaps any other city, so synonymous with romance?",
        "response": "During the French Revolution of early 19th century the society heavily liberalized, with prostitution being legal , theatres promoting works of romanticism; Paris came to establish a standard for fashion , perfume, femininity, class and more.  This created the courtesan(or Lorette), the ideal of an educated, classy, seductive and fashionable lady who is very high maintenance; an equivalent of an expensive escort of today. Those courtesans promoted romantic love.  Through a combination of sexual, romantic and the artistic factors, these traditions survived till today to some extent, creating the image and being the tourist sales pitch.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do you interpret revolutions per minute (RPM) in the context of driving your car, and what do you need to look out for?",
        "response": "The RPM is how fast the engine is spinning. If you let it go too low (driving slowly on a higher gear) your engine will stall. And neither should you rev your engine too high, going in to the red of the meter. And no it's not bad to roll down, again as long as the rpm doesn't go in to the red, just shift up to a higher gear if you need to. Engine breaking is actually good for your fuel consumption. As modern cars will complete stop the fuel to the engine if the car is rolling in gear. So if you plan your driving and use your brake as little as possible it will save fuel.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do hot dogs tear open in the microwave?",
        "response": "Because the outside is (mostly) waterproof and the inside has a lot of water in it. So when the water turns to steam, it builds up pressure until the casing breaks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With modern technology, why don't people get paid and billed electronically by the second or minute instead of monthly?",
        "response": "The technology isn't really there, or at least hasn't been developed. If you've ever worked in IT, you'd understand how hard it is to integrate different systems and make them talk to each other. Such a system would have to built from the ground up and would include real time capturing of hours worked, real time transfer of money to the bank, real time availability of the money on your credit card. That wouldn't be cheap. Then, every company and bank would have to adopt those systems. If your bank doesn't use it, it wouldn't matter if your company does or not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I'm playing an audio CD on a CD player and the music skips, what is happening?",
        "response": "When you bump the walkman, you can cause the disc to literally skip, meaning that you cause a rotation other than that caused by the motor. When this happens, the walkman has to spin the disk and find its place again before continuing. If you walkman has \"anti-skip\" protection, it is simply a flash buffer where the walkman reads the disc a few seconds ahead of what is actually being played. That way if it skips, it can keep playing and have time to find its place again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did WWI veterans react to the coming of and start of WWII?",
        "response": "More of course can be said but [this previous answer]_URL_0_) might be of interest to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How time signatures work and why 4/4 (whatever that is) seems to be frowned upon etc.",
        "response": "4/4 is the most common time signature... I've never heard about it being \"frowned upon\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come we can \"feel\" other people staring at us?",
        "response": "We can't. However, there's an evolutionary advantage to being vigilant, and being wary of being watched. So many little clues will make you feel like you're being watched: A subtle change in the ambient sound quality implying that someone is behind you, and small moving reflection, etc. If you look around and don't see anybody, you mostly forget that it even happened. But if you look around and see someone looking at you, your brain is all, \"Aha! I knew it! I'm _always_ right when I think someone's watching me!\" This is known as \"confirmation bias\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your own voice sound so different to you compared to hearing your voice on a video etc?",
        "response": "Bc unlike everyone else, you hear your voice through bone. You hear your own voice through your throat rather than air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do big tech companies (Microsoft, Apple, Adobe, etc.) justify charging up to 200% more for their products in Australia?",
        "response": "They don't have to justify it, they just do it. Businesses can charge whatever they want (as long as laws aren't being violated). If the price is too high, customers won't buy it and will find an alternative product for cheaper.  Ultimately, the Australians put up with these high prices because they still want the name-brand products. It's also worth noting that incomes are higher there, so the high prices aren't *as big* of a deal as they seem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the Canadian equivalent of constitutional rights from the US",
        "response": "Its called the Canadian Charter of Rights and Freedoms. Its in plain english and an easy read. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are synthetic diamonds considered less valuable, are they molecularly different then real diamonds?",
        "response": "No, in fact lab diamonds are more pure than natural diamonds. However, one of the reasons that diamonds are valuable is because people believe that they are rare and hard to find.  Because lab diamonds don't fit this mold, demand for them is lower, dropping the price.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if you let a chess AI play itself? Is it just 50-50?",
        "response": "Check out TCEC if you want to see the results of chess engines playing other engines. _URL_2_ Heres a general rating system for the engines. _URL_3_ At higher levels chess is largely considered a draw as there are many many ways to cause a draw, often in professional games like the world championship last year with Magnus Carlsen vs. Sergey Karjakin, Karjakin seemed to almost put Carlsen on tilt because he kept trading down pieces as if he was trying to cause a draw. You have to keep in mind that in Chess draws are possible, so absolutely perfect doesn't mean much unless whenever it's solved it's proved that one side has the advantage in which case that color would always win.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Gen. Sherman: Hero, or War Criminal?",
        "response": "Destroying the enemy's will to fight and crippling their resources/supply lines are the primary objectives in winning a war  He did only what was necessary.  As I understand it, General William T. Sherman did not like war and in order to hasten the end of the civil war, he targeted the resources of the Confederate States.  Like he said, war is hell (I believe this originates from a speech he gave to the graduating class of a Michigan Military Academy on June 19, 1879, may be wrong though) Varying accounts have been published apparently  And if you can get the war to end as quickly as possible, it will be better for everyone as war can take a toll on your humanity",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do adults puke less when sick when compared to kids?",
        "response": "Because their bodies are immature. Easy puking is a child's body defense mechanism against a poison that it could not fight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why some areas rarely have thunders, while others have several in the year.",
        "response": "To form thunderstorms you need conditions where a big mass of warm, wet air at low altitude can very quickly rise up to high altitude. Usually this happens in areas where a low, warm, and wet air current meets a high, cold, and dry one. The two masses of air basically trade places and cause the massive updrafts that form huge thunder clouds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why \"You have nothing to fear if you have nothing to hide\" is a poor argument for increasing security.",
        "response": "If that statement is true, I should be able to walk into anyone's house and look around because there shouldn't be anything bad there to see. I should be allowed to have full access to tour life, as you are a good person, and you'll only be affected if you aren't. Does that sound okay to you? Privacy isn't about hiding bad things, it is about having your own space in which you are free to do what you wish.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how does earwax form?",
        "response": "Earwax is made from glands of the external auditory canal (which are basically modified sweat glands if I recall it well enough), and also dead epidermal cells. It is thought to be a protective mechanism for the auditorium canal against infections and other trauma and is also a way to remove dead cells from it. Bonus tip: you don't really have to clean your ears , and it is actually dangerous to do so, since wax is reabsorbed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are they trying to accomplish at the LHC? How will this help humankind?",
        "response": "Not sure how it will help, but sometimes these things aren't obvious, eg. [Relativity gave us GPS technology](_URL_0_). Who knows what advances in technology the discovery of the Higgs Boson could be responsible for? I'd love to hear an answer from someone who knows.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is water so loud right before it boils in a kettle, but then it's quiet as soon as it starts boiling?",
        "response": "Cavitation. The little bubbles that form on the bottom collapse when they hit the colder water above. It happens so quickly that the water slamming back together makes a sound. I also found a video that goes into more detail: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some girls have rape fantasies?",
        "response": "In some cases it's about submission. Less about violent acts and more about being sexually used by a dominant person. Majority of women wouldn't actually want to get raped, but some with this fetish just want to be taken control of once in a while. That's how my ex gf (who had a fantasy about being forced into sex with authority figures) described it to me.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Chemistry, How does hydrogen become other elements?",
        "response": "Its the process of fusion. Inside stars Hydrogen is at such high energy and density that it can overcome the coulomb repulsion (liked charge particles repel) of the two nucli to a distance where the strong nuclear force takes over. This force is really strong (it has much higher binding energy than the coulomb force), but only works at really small distances. That gives you He. Repeat for larger elements. All the way up to Iron.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast to atoms \"push\" each other? Ex: If I lifted a tower of metal one foot that is 10^10^10 miles long in a perfect vacuum (I'm really strong), how long will it take the top of the tower to move a foot as well?",
        "response": "The movement propagates through the material at the speed of sound for that material. This differs by material. For instance, in steel it is about 19,107 feet per second. So if you had a pole of steel 19,107 feet long, and you pushed one end, the opposite end would move 1 second later.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ask Anything Wednesday - Engineering, Mathematics, Computer Science",
        "response": "Suppose someone comes up with a solution to the factorization problem. Do we have any asymmetrical-key encryption algorithms that don't rely on it? Wikipedia has a list of asym-key algorithms, didn't go through all of them, but *most* of them are based on an exponent and a modulus just like RSA but with some small variant. So I became curious.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Blood cell survival post donation.",
        "response": "No. Blood cells are produced in the bone marrow, not from other mature blood cells. Mature red blood cells also do not have nuclei and thus, no DNA. However, if person B got a bone marrow transplant from person A, A would not only continue to produce blood cells from B but also white blood cells which do have nuclei and DNA which could possibly confound that DNA analysis that you posited.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Plants vs Animals, Photosynthesis vs Mobility?",
        "response": "Photosynthesis provides much less energy per unit time than heterotrophy. If an organism can move, it is much more efficient for it to absorb nutrients by eating pre-existing storehouses of it. I don't have numbers off the top of my head, but I *think* it's 2-3 additional ATP per photosynthesis cycle for the trade-off of sacrificing space and energy to sustain chloroplasts. As a digression, human Vitamin D generation is considered a form of photosynthesis. On top of that, *Elysia chlorotica* is an animal (type of sea slug, iirc) that consumes, incorporates, and passes down chloroplasts through generations for the sole purpose of getting energy through photosynthesis. *Ambystoma maculatum* is a type of salamander (a vertebrate!) that is thought to harness photosynthesis through a similar mechanism by passing down algal symbionts (possibly only during juvenile stages).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are those little holes at the bottom of plane windows and why are they there?",
        "response": "To equalise the pressure. This reduces the stress on the window and makes it less likely to crack. The holes are small enough that if the inner pane fails, there will still be time to get the plane down to a safe altitude.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Germanic languages counting past 20",
        "response": "Sorry, I have no explanation for that, but I know there is a group of people here, that would like to see that changed.  Lothar Gerritzen is a professor at the Ruhr-Universität. He is trying to make the idea of changing the way to say numbers popular.  I couldn't find an English reference so quickly, so here is an aggregation of press responses : _URL_0_  (please note: some of these could make you think, they actually are going to change something, but they aren't yet)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When receiving IV fluids, why do you get a metallic taste in your mouth for a few seconds?",
        "response": "This is not my specialty, but I found [this paper (*Experience of unpleasant sensations in the mouth after injection of saline from prefilled syringes*)](_URL_0_) stating:  > The phenomenon of bad taste or smell is explained by the mechanism of volatile substances, released from saline when injected into the bloodstream and then eliminated by the respiratory system and thus detected by the patients in the air expired by the olfactory system. A sensation of taste, mediated by the taste buds, is usually combined with stimulation of touch and smell. Thus it is not surprising that the volunteers confused taste, flavour, and odour.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we sneeze and pee at the same time?",
        "response": "Not to get too gross (my standards, not Reddit's), but I've done it. In fact, once, I sneezed and farted at the same time while peeing. I believe physicists refer to this as a \"singularity\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why sometimes my phone charges at 60% an hour and other times of can charge as slow as 17% an hour",
        "response": "There are two answers: When you charge an idle battery with two different transformers, one of 5 Watts and one of 12 Watts, then the 12 Watts one will go faster. So it depends on the power of the transformer you charge it with. The next thing is about what the phone is doing. If it is really idle (i.e. off), then it will go the fastest. If it is mostly idle (nothing running on it but the screen is on), then it will be slower than that. If it isn't idle at all (you have some game running in the background, 3G/4G is constantly doing things etc), then a large part of the charged amount will be immediately used for that and thus less will be used for increasing the charge level on the battery.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far could we send information in the universe?",
        "response": "The limitation is the speed of light, but, assuming you had time enough to wait, you could communicate anywhere within the galaxy and anywhere else (e.g., nearby galaxies) which aren't expanding away from us. However, more distant galaxies are expanding from us, and the fact that the expansion of the Universe is accelerating means that some galaxies which we can see today we won't be able to see in the future. They'll run away from us faster than any signals can catch them. I just did a quick calculation and assuming the acceleration continues as it is today, the furthest galaxies which would ever see a signal we sent today are presently 15.7 billion light years away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which came first, orange the color or orange the fruit?",
        "response": "hi! always room for more input, but (assuming you're asking whether the English word \"orange\" originally referred to the colour or the fruit) these posts may be of interest [Which was named first, orange the colour or orange the fruit?](_URL_0_) [When was the Orange first brought to Britain?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What as the US Army like prior to the National Defense Act of 1920 and the establishment of a regular army?",
        "response": "The Regular Army was already established both in concept and in name prior to 1920. I made a post about the Root reforms that reorganized the structure of the Army going into the early 20th century [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there so much resistance/opposition to an independent Kurdistan?",
        "response": "The short answer is that Kurdistan is divided up among three regional powers: Turkey, Iran, and Iraq. As you note, Iraq is coming apart. Turkey is not, however, nor is Iran. No one sees a politically viable Kurdistan because the minute you get a Kurdistan (in Iraq, as you suggest) Turkey or Iran would invade because, at some point they would fear that their local Kurds would start colluding with Kurdistan to create a broader Kurdistan and try to take territory from the current host country. Iran/Turkey would try to suppress local independence movements, Kurdistan would get drawn in, and it would set off a regional conflagration. That would be very bad times.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During the various Roman civil wars, how did the soldiers tell each other apart?",
        "response": "The Roman army wasn't exactly homogenous. It was made up of different legions from across the empire, that all decorate themselves differently - different symbols, emblems and the like. Rarely did civil wars involve men from the same legion fighting each other - generally you had whole legions loyal to different men, and then those legions would fight it out. For example, during the year of the four emperors, there were legions from North Africa, Germany, Spain and Italy all contending to put their own candidate on the throne. It's not as if they were entirely indistinguishable. That said, confusion is a natural part of battle, and I'm sure that there were times when this caused problems for individual soldiers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why sometimes things are now expensive from manufacturer's website than a third-party reseller?",
        "response": "A major reason for this has to do with how the manufacturer's company is set up. They'd honestly rather not deal with small-time customers because packing boxes and shipping to locations is a lot of work. A place like Amazon has really efficient distribution methods, so it's cheaper and easier for them to ship packages. A place that doesn't specialize in dealing with small customers usually has to deal with higher shipping expenses, which they then pass on to the customers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do mass spectrometers use magnetic fields?",
        "response": "Because the lorentz force due to a magnetic field depends on the velocity, while the electrostatic force does not. Launch ions with the same charge and same velocity into the same magnetic field, and the radius of curvature of the resultant trajectory will depend only on the mass of the ion. If the field is uniform, the speed will be constant along its path, and so the trajectory can be a semicircle making the measured degree of freedom be the radius of the semicircle. I distinctly remember doing the calculation for this at one point or another while taking physics. I'm a bit surprised you haven't, and that it isn't in your book if your book even touches on the subject.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does facebook think I know people whom I share no friends with?",
        "response": "Maybe it creates you the perfect opportunity for you to make some friends since you only have 149",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Whats the evidence that supports that the accumulation of O2 begun 2b years ago?",
        "response": "Rust. Two-billion year old iron oxide in huge quantities indicates an explosion of oxygen production. Read more here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is fudge made out of and how do you make it?",
        "response": "This is a perfect job for a google search: _URL_0_ Most are simply melted chocolate, butter, a sweetener of some sort, and some dairy product (milk or cream). Nuts and/or extra flavoring added by additional ingredients as necessary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did going into World War II dramatically propel the U.S. economy, as opposed to ruining it like the British economy?",
        "response": "The US had virtually *none* of it's infrastructure damaged at all during WWII. Compare that to England (and, in fact, most of Europe) being *devastated*. The US emerged from the war ready to just roll back to work.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are my pupils black?",
        "response": "The shape of your eye is an important part of the reason: _URL_1_ Some creatures have highly reflective layers behind their rods and cones, but we humans are not adapted to nocturnal life as thoroughly as they: _URL_0_ Still, a camera flash can reveal that your retina are actually a dark pink color. Thankfully, software can be used to edit such photoss, and give the illusion that the photo was taken under low light. Apparently it's frowned upon to show your retina. Alternatively, it's possible that your pupils are black because you teach at a school which serves a neighborhood that has undergone \"white flight\": pupils with lighter pigmentation would have come from families with additional privileges (historically much more formal; now mostly implemented via differential enforcement of nominally race-neutral laws: see, for example, [Michelle Alexander's work](_URL_2_)) that allowed them to either transition over to private schools, or move to \"better\" neighborhoods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes dizziness when you stand up?",
        "response": "The medical term would be [orthostatic hypotension] (_URL_0_) and is nothing else than low blood pressure caused by large blood amounts gathering in the lower extremities while sitting or laying. The venous return in the standing position is different from when laying down and sudden change of orientation can cause a lag of venous blood return, causing temporary decreased cardiac output, which causes the hypotension.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water on my tongue feel colder after sucking on a mint?",
        "response": "The menthol in mints makes your taste buds more sensitive to cold than usual.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Earth consistently stay in orbit in relation to the sun? Or are we in a constant falling motion towards it that will consume us one day?",
        "response": "We are in a constant falling motion, yes. But we are also in a constant sideways motion as well. Both of these affect each other such that instead of falling *toward* the sun, we fall *around* it. If our sideways motion were to slow down, we'd fall in. If our sideways motion were to speed up, we'd spiral away. As far as we can tell, the Earth orbit is stable, neither collapsing or spiralling away. By contrast, the Moon is slowly moving away from us and, on a long enough timeline, will no longer orbit Earth. Based on what we know, the Earth will continue to orbit the sun until the sun evolves into the Red Giant stage where it will most likely consume the Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what point of evolution is an animal considered a different animal?",
        "response": "The terms you are looking for are [speciation](_URL_1_) (see also [here for a slightly more advanced discussion](_URL_2_)) and also [cladistics](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are med schools and residencies so selective when there is a national shortage of doctors?",
        "response": "Wow, I'm so lucky the dropped the standards for becoming a Doctor, otherwise I would never have made it. So anyway, I'll be preforming an epend... apetand.... a procedure an you. This might fix the problem, I hope. If not we'll try something else. Hell, the body has 2 of most things for a reason so I can probably take most of them out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there so many people in China and India?",
        "response": "Looking at their climates, locations, and amount of arable land, historically they have been able to cultivate vast amount of food. depending on the region of each of the countries you can cultivate/farm year round. As a result they also accounted for a greater chunk of world's economic activities. Combine all these factors, you have means to support a massive population which they historically did. Since they were starting off with a high population when modern medicine (vaccinations, antibiotics) arrived, their population grew proportionally.  Also, we don't see european/african countries having a big population because we see them as individual countries. But if you take Europe as a united entity it has a population of 743 million. Sub-Saharan Africa was 800 million. Both India and China are pretty big countries (could argue they are continents of their own) with a lot of arable land ([India has the highest](_URL_0_)).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a medicine for lowering your body temperature work ?",
        "response": "I assume you're referring to medications that help reduce fevers. They're called antipyretics, or at least they're medications with an antipyretic action. Our temperature is regulated by our hypothalamus. Antipyretics cause the hypothalamus to set the threshold for increasing our body temperature higher, effectively causing the fever to diminish in intensity or abate altogether.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does China's government work?",
        "response": "Because it's no longer communist. China has been learning from the western governments, even though it's still an one party authoritarian state, its officials learned a lot from western world's management experience.  Government officials competency are measured by the economic performance of the regions they govern, and that is why it's so competitive. However, it creates problems sometimes, such as sacrificing environment and violating the human rights of individuals in order to achieve economic success. In some cases, they also fabricate numbers to look better.  Sorry my explanation is kinda lame, I believe others can explain better than I do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Belgium a really powerful and influential country given the size as they are home of the EU headquarters?",
        "response": "It isn't... it fact quite the opposite. It is such an irrelevant little country that it was *perfect* as the place for EU HQ. Putting it in Germany would have annoyed France... and having it in Paris would have pissed off Germany... and of course the UK would be pissed regardless.... But Belgium... well nobody can be offended by that choice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our limbs tingle or get numb when they \"Fall asleep\"? Also why does it hurt? And what happens inside the body when this happens ?",
        "response": "Unrelated, but can someone please explain to me rain pain. It doesn't happen everytime it rains , but the type of discomfort I get in my elbows or knees happens only when it rains. Someone told me that it had to do with barometric pressure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will eating a multivitamin everyday keep me relatively healthy, even if my diet is not that great?",
        "response": "1.) your body only can absorb so many vitamins and minerals at a time. Most of all that is in a multivitamin goes to waste (literally). That’s why your urine is such a dark yellow when on a multivitamin routine. 2.) when you say a not great diet. That presumably means you’re putting in ‘bad’ or too much of something in your body. You can have all the vitamin c you want, but it’s not going to stop you from developing hypertension. 3.) Diet is only one portion of what makes someone’s lifestyle and body healthy. You have to consider exercise, mental health, etc. That being said, vitamins are perfect for people that cannot consume a specific food group. I.e. vegetarians should try to introduce iron rich food into their diet, vitamins can supplement that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens on a global ecological level if the Great Barrier Reef is entirely bleached and dies?",
        "response": "Follow up: What can I personally do to halt the bleaching of the GBF and other environmental disasters?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is chemotherapy used the way it is?",
        "response": "I think that is what radiotherapy is. Radiotherapy focuses on one spot but chemo kills cancer cells which are trying to spread. I could be wrong tho.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how much civilian life was lost in sherman's march to the sea?",
        "response": "Surprisingly little. The total casualty count is commonly accepted as around 3,000 but this number includes conflict with militia and military personnel in Georgia and pockets of resistance.  From what I remember the actual civilian casualties numbered around 100. The real damage was done to the city of Atlanta and the Georgian countryside where over 300 miles of railroad tracks were destroyed along with $100 million worth of property. Including a very significant amount of corn, cotton, hay, livestock (cattle and mules), horses and homes. Considering the fact that Sherman managed that much destruction it's actually impressive how few civilians died, although they lost their homes and property (part of which if I recall correctly was due to some Georgian leaders not ordering evacuations) Sherman's march was remarkably disciplined and resulted in very few casualties considering the scale of the many other battles in the Civil War.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the prohibition change drinking culture in America?",
        "response": "One change in American drinking culture was the explosion in the popularity of gin and the martini. In contrast to America's pre-Prohibition liquor of choice, whiskey, gin does not require aging, is easily made in small batches, and can be made cheaply by adding juniper and other flavorings to low-quality grain alcohol. The illicitly manufactured \"bathtub gins\" were pretty freaking terrible. Mixing it with other things such as a strong-tasting vermouth made it much more palatable, hence the martini. After prohibition, the manufacture and importation of gin became legal again, the quality improved dramatically and it wasn't necessary to drown your foul-tasting gin with a strong vermouth. The ratio of gin to vermouth rose from as high as 1:1 to 3:1, then 6:1, to the point where many people today hardly like any at all.  Edit: mixed up my ratios.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why have humans evolved \"past\" monkeys if we both evolve from the same common ancestor?",
        "response": "Your premise is faulty. We haven't moved past monkeys, nor are we more evolved in some sense. We've simply adapted to different sets of selection pressures. The monkey might as well ask why humans suck so badly at the important stuff like jumping around from branch to branch.  Evolution doesn't have any direction that it aims for, where a species can be said to be more or less evolved toward that standard than another.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When something gets in your eye, where does it go?",
        "response": "If the thing in your eye doesn’t get out of your eye, then it might go inside your eye or your eye lid, and then it might get infected. But if it’s small enough, sometimes your body will absorb it and rip it apart into even tinier pieces and put them elsewhere in your body.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was Enigma, what was it used for and why were the Enigma Codebreakers such an important part pf the Allies' victory?",
        "response": "I could try to explain it to you, but this video is all you really need:  _URL_9_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we see things wavy through heat",
        "response": "Light moves at different speeds through different material. It moves faster through hot air because it's less dense than cold air. So, as the light moves through pockets of hot air above your radiator it gets bent and distorted. That's what you're seeing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If pure energy is a by product of anti matter and matter meeting could we theoretically reverse the process and take pure energy and make it into anti matter and matter?",
        "response": "There's not such thing as pure energy. It's just not a concept. Matter and anti-matter typically produce high energy photons when they meet. The reverse can happen, for example a gamma ray can interact with a nucleus and produce an electron-positron pair.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During WW1 because the trench line ran from Switzerland up to the Channel is there any instances of fighting or a battle taking place at the extream ends of the lines.",
        "response": "There wasn't any fighting on the beaches, but there was fighting in the flooded areas along the Yser in 1914 and 1917. In 1914, the Belgians and the French were able to hold off the advancing Germans, while in 1917 there was some fighting between the German *Marine Korps* and the British 4th Army, which was stationed along the Yser in preparation for Operation *Hush*, the planned amphibious landings at Ostend that were to accompany a British break-out from the Ypres Salient (the 3rd Battle of Ypres, 'The Battle of Passchendaele'). As for along the Swiss border, there was no major fighting that I'm aware of, though further north in Alsace there was heated fighting around the *Hartmannwillerskopf*, a large hill that was the site of fighting in 1915.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come some GIFs need a \"GIFV\" link to be viewed, while others work without even a click?",
        "response": "I'm no expert, but here's my basic understanding of it: GIFs are basically a bunch of images lined up and played in order like a flip book. This can make really long GIFs massive in size, which would take ages to load since they have to save every single frame.  GIFV on the other hand is more like an MP4, where it's one image and the next frames are just instructions on what changes. So instead of storing the whole image, if the background of trees is always the same, you can get rid of it basically when saving the files.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If every human being spontaneously died, what would eventually emerge as the next dominant species?",
        "response": "Define dominant. Bacteria always have been and always will be dominant. Do you mean be the most populous large mammal? Make the largest change to the environment? Please define your terms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Countries and debts. Is this even real?",
        "response": "It's not as though the money is so simple as \"USA owes Germany 5,000 dollars, Germany owes the USA 4000 dollars, let's cross it off and say USA owes 1000\" or what not. Rather, every government is made of many many organizations. The different groups may owe money to one another, or may owe money to the citizens, or to programs like social security.  Just as an example, the majority of USA debt is owed within the USA, not to other governments.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can time be dilated or compressed but never go backwards?",
        "response": "Yarr! Yer not alone in askin', and kind strangers have explained: 1. [ELI5: Why time moves forwards, not backwards. ](_URL_5_) ^(_5 comments_) 1. [ELI5: Why is time travel backwards not possible? ](_URL_3_) ^(_6 comments_) 1. [ELI5: What causes time to move forward? ](_URL_6_) ^(_28 comments_) 1. [eli5: How can we know if time travel is/isn't possible? ](_URL_0_) ^(_ > 100 comments_) 1. [ELI5: Why we cant travel backwards in time. ](_URL_2_) ^(_4 comments_) 1. [ELI5: Why time travel cannot exist ](_URL_1_) ^(_85 comments_) 1. [ELI5: Why can we travel forwards in time but not backwards? ](_URL_7_) ^(_3 comments_) 1. [ELI5:Why can't we turn back time? ](_URL_4_) ^(_20 comments_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is integration the opposite of differentiation?",
        "response": "Let f(x) be some function and let F(x) be the area-under-its-curve function (say, the area under f(x) between 0 and x). Think about the derivative of this area function. If you increase x by a little bit, you increase F(x) by adding on approximately a rectangle of height f(x). There's a pretty good [picture](_URL_1_) of this on the Wikipedia [article](_URL_0_). From this, you can see that f(x) is the derivative of the area function F(x), so F(x) is an antiderivative of f(x).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who gets to be the ant queen?",
        "response": "Queen ants become that way because they are fed a special food when they are born. The worker ants decide which newly hatched ant gets made a queen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does limping actually help you heal faster?",
        "response": "I'm gonna have to use common sense and tell you that limping is caused by pain. We limp because it makes the pain more tolerable. Pain generally means we are hurting ourselves, so limping clearly prevents us from hurting ourselves. I'm not really sure what you want to hear. What do you mean your limping is \"a choice\"? Eating is \"a choice\", too, because we consciously do it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the \"ceremony\" of English afternoon tea develop?",
        "response": "According to tradition Anna Maria, wife of the seventh Duke of Bedford, began the custom in the 1840s and would invite guests for tea and victuals at 5 o' clock, since she was a Lady of high society she was a fashion setter and the trend quickly spread. This site covers the history of tea quite thoroughly if you wish to read more. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any animals that consume non cellular matter as a significant part of their diet?",
        "response": "Inorganic minerals are consumed all the time by most animals, especially many herbivores that aren't able to get enough of certain essential elements like calcium, magnesium, and sodium from their plant diet and instead rely on natural mineral lick sites or get else get them from water sources. Even humans get major portions of our required mineral nutrition directly from inorganic sources (e.g. table salt). If you're only thinking of nutrition as calories, though, then no there are no animals that get calories from completely inorganic sources. The closest would be certain worms and insects that consume free amino acids and polysaccharides in soil. These are organic and originally derived from living matter, but are no longer what you would call \"cellular.\" Of course if that counts, then I suppose termites and hummingbirds should count, too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the evolutionary advantage of grief?",
        "response": "While you're likely to get a wide array of convincing answers to your question I'll simply ask that you take them with a grain of salt.  Evolutionary psychology is a field fraught with conjecture. Not everything that exists is adaptation (*see* neutral evolution). In any case, were grief an adaptation, any explanation as to why it is adaptive would be conjecture two-fold: there is no way to scientifically demonstrate that it is an adaptation, and secondly demonstrating why it is an adaptation is doubly preposterous.  Furthermore, the fact that grief is an emotion, and as a scientific community we possess barely a molecule of water in the ocean of neurochemistry understanding, is really just the icing on the cake. I apologize for being such a downer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Graviton is discovered, could we use it to create artificial gravity in an other way than centripetal force?",
        "response": "Two things: 1) there is basically zero chance the graviton will be discovered in the lifetime of anybody alive today (we haven't even found classical gravitational waves yet). 2) if you use gravitons to produce a gravitational effect that is a real gravitational field- not something which mimics it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the body \"need\" 8 hours of sleep?",
        "response": "I have a question about this question: How do people with sleep disorders survive? My great aunt had a sleeping disorder where she wouldn't sleep for weeks on end, eventually (It being the early 1900's) she was sent away to a mental institution.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When objects, such as rockets and space shuttles leave our atmosphere, will the atmosphere shrink to compensate for the mass/air that has just left?",
        "response": "If it were a liquid, I would say yes, though it would be a minuscule change. Air is a bit more complicated because there isn't a clear boundary of the atmosphere, it's not at all like the surface of an ocean. Air density gradually becomes lower and lower as you go higher. The transition is so smooth that the line dividing the atmosphere from outer space at 100 km of altitude had to be traced arbitrarily. But I can conceive that the density of the upper layers of the atmosphere will decrease a tiny bit to accomodate for the air that has moved into the place of the spacecraft. Related: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible that all elements are radioactive at some point -- even if it took the age of the universe for just one atom to decay?",
        "response": "The possibility of proton decay is one of the biggest questions in science. They have been able to put lower limits of 10^34 years as the half life of the proton. Is the proton stable or does it have a really long half life? We don't know yet. Of course that also makes us wonder if the proton in other elements will decay after a ridiculously long time, making them radioactive as well. Just for comparison, the longest measured half life is for Tellurium-128 which has a half life of 7.7 x 10^24 years, and the age of the universe is 13.8 x 10^9 years. As for why are certain isotopes radioactive while others are stable? Are the sum of the decay products less massive than the original nucleus? If yes, then it will decay. You can think of putting balls (nuclei) around a hilly area. If they are at a high potential (top of the hill) they will decay (roll down) to a more stable position at lower potential energy (the valley).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our body stops producing melatonin when we're exposed to light, why do I get tired and take a nap on really sunny days?",
        "response": "It never \"stops\" melatonin production, it controls it. Your body constantly forms melatonin for a variety of reasons, not just based on light sensitivity. For example, you could be in a very bright room, but have gone without sleep for 48 hours. Part of your brain wants to lessen melatonin production because it's bright our, but your brain realizes it needs you to rest to repair muscle and overall function properly; as a result it will still pump out melatonin. There are of course are other reasons your brain may produce melatonin, but this is just an example.     You probably don't particularly get tired on sunny days, and a possible explanation is you might be more active on these days because of the abundance of daylight/warmth - as a result tiring yourself out more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there 360 degrees in a circle?",
        "response": "It's an arbitrary number but was probably chosen because it's divisible by so many different numbers. If a circle was 359 degrees (a prime number divisible only by itself and the number 1) you'd have too many fractions to deal with. For example instead of 90 degrees a quarter of a circle would be 89.75 degrees. A 45 degree angle would be 44.875 degrees. Too messy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How ancient is the concept of a \"nerd\" and what were the social implications of being considered one?",
        "response": "From Celsus, De medicina 1.2.1, on how to maintain health: \"The weak, however, among whom are a large portion of townspeople, and almost all those fond of letters, need greater precaution [than healthy people], so that care may re-establish what the character of their constitution or of their residence or of their study detracts.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is fentanyl approved for medical use in the US when it’s exponentially more potent than heroin?",
        "response": "It is used for chronic pain. Used best, it is for people in situations where addiction isn’t really a problem, like stage four cancer with weeks left to live. Chronic pain from end-stage cancer is really a sucky way to die, so anything that helps is a good thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was life like for Hispanics/Latinos in pre-Civil Rights Act America? Did they suffer the same types of discrimination as African-Americans?",
        "response": "Did people before the 20th century really see 'hispanics' as non whites? Spaniards and Portugues are seen as white here in Europe, when did the distinction start in NA?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If light emits a significantly minute force, how much light would it take to crush a human?",
        "response": "The main issue is that any light is intense enough to push a human would literally vaporize someone. For a 100 pounds force, you'd need roughly 130 gigawatts focused on someone. A 1-watt laser is enough to cause burns.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why the contrast between regional and global effects of climate?",
        "response": "I also want to build on this question and ask whether this increase in temperature has a disproportionate effect near the polar regions of the planet. Certain parts of the earth must be just on the verge of thawing. Since water freezes at 0 degrees Celsius, surely even a slight increase or brief excursions in temperature above this point would be sufficient to induce a phase transition and convert lots of ice into water? This simple transformation must have vast and complicated consequences for the movement of glaciers, and the dilution of saltwater in the arctic regions?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do little kids tend to copy each other?",
        "response": "Kids tend to copy their sorroundings in general. Its part of our biology. Kids come to the world without knowledge over anything, but humans are, like wolfs and other animals, creatures who work in group. A child depends sollely of what it observes this group doing and on what vital informations the group holds, on growing and achieving sucess. And since this becomes crucial at earlier stages and since we know no better at that time, we tend to grab as much as we can in order to do what other do(what the group does) in order to stay within it, essencially becoming copycats. This also explains why kids of ages 4-10 tend to ask a ton of questions, the curiosity peaks after the first stages of life where we move from basic necessities to facts and understanding of why things happen. TL:DR: we live in a group so we copy others to be a part of the group, this spikes at young ages",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do nutrition labels work for items like bacon? The more you cook it, the more fat is left in the pan so wouldn't it change the values on the label?",
        "response": "For items whose nutritional content changes via the cooking process, the nutrition label can only show the nutrition *before* you cook it. Sometimes they'll show both (\"as prepared\") but if there is only one, you can only assume that it's pre-cooking. Compare with pasta nutritional labels where the issue isn't so much the nutrition but the serving size (which changes dramatically after cooking it. The serving size on the nutrition label is dry.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is human skin insoluble in water?",
        "response": "The lipid bilayer has hydrophilic part directed towards the innerside of cell and lipophilic part towards the outerside. Furthermore there is a 3D helical structured keratin layer on stratum corneum protecting the skin which absorbs water. Skin also consists various lipid layers and water insoluble collagen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could the ISS use a solar sail to slightly alter its orbit?",
        "response": "You gotta understand how absolutely weak the force on a solar sail is. I mean incomprehensibly weak. You are talking about a force on the order of 10^-5 N/m^2 which for a few kilmotres is 10^-2 or so Newtons. now the ISS has a mass of about 500,000 kg so your acceleration is about 10^-7 m / s^-2. Now this doesn't even seem that bad until you consider you are in low earth orbit and adding a gigantic solar sail is going to increase your drag on the atmosphere by a huge amount, resulting in the ISS falling out of the sky basically. Another example, I'm just working from memory here, is that if you were using a sail to get away from the sun you need something about 100 times lighter than paper just to go anywhere. This is just the sail before you take into account the payload.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, in sugar drinks like soda, does sugar not separate and fall to the bottom of the bottle, can, etc.?",
        "response": "...Because it isn't a supersaturated solution of sugar, not even close. If you dissolve sugar in water, and don't let the water evaporate, you'd see that the sugar stays dissolved. Of course, in real life, the water evaporates, the sugar concentrates and crystals nucleate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a celestial object pulls on a beam of light, does the light pull back?",
        "response": "In General relativity, which is the best theory of gravitation that we have, curvature of space is caused by energy and momentum. Light/photons have energy and momentum so therefore cause a curvature of space. The amount of curvature/gravitation caused by photons though is so small that it would not be possible to measure it, and in calculations is safely ignored.  So the simple answer to your question is: yes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the awareness that you will die learned through observation or is it instinctual?",
        "response": "I don't think he will be aware that he can die.He hasn't learned it anywhere, or that its even possible. I think he'll just feel crappy, not knowing what its called, and scared. Nor know that there's more outside the room. He will just die without knowing what the concept means or is called. However i do think he instinctively knows that something isn't right.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some ancient ruins buried while others are on the surface?",
        "response": "The most important thing in real estate is location, location, location. Cities are just large real estate and they develop in areas with economic (roads, water access) and/or strategic (protective terrain, ship access) resources. If a city goes into ruins (enemy attack, disease/famine, etc), others may find the same area suitable for building a new city once they demolish and build over the older ruins. All the new \"ground\" comes from resources that they carry into the new city or waste generated from living in the city. Other ruins that do not get buried like the Akropolis or Pantheon often have significant cultural value and remain standing for long periods of time without being demolished and burried.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do fans of TV shows not make kickstarters to help the show increase their budget?",
        "response": "The cost of a single episode is in the millions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my body get covered in goosebumps and why do I feel light headed / relaxed when I'm really enjoying a piece of music or song?",
        "response": "There are two competing theories on this.  One, listening to music triggers the same reward pathways as addiction and reward, coating your striatum in dopamine. Your brain can predict (to some extent) what's going to happen next in the music, so it's anticipating the dopamine shot before it actually gets it, and it's that moment between the anticipation and the reward that gives us goosebumps.  Two, the amydala (what controls our emotions) reacts uniquely to music, acting as if it has 'real' triggers. However, your brain knows that this isn't 'real', so is constantly shutting that down before it becomes a true fight-or-flight reaction, so we get the hairs-on-end physical reaction without the adrenaline.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the point of showing the 'tropic' lines on a globe or world map?",
        "response": "These lines represent the northern- and southern-most points of the sun's \"travel\" in the skies. The sun would be overhead during one of the solstice's were you to stand on each line--the northern one in June, the southern one in December. In between these lines and the sun may appear overhead some months, north of the viewer some months, south of the viewer some months. Beyond those lines and the sun will be visible but never overhead. (The Arctic and Antarctic Circles are the 'opposites' of these, being the points beyond which the sun dissapears/is always 'up' at least part of the year). Climate tendencies usually follow these rough \"lines\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does adware/Other viruses always change your search engine to Yahoo?",
        "response": "Yahoo will pay companies to get you to change your search engine to Yahoo. So it's another way to make money, along with showing you ads or stealing your credit card.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the uncanny valley work?",
        "response": "Basically, when something looks human (be it a doll, a mannequin, a video game character, a drawing, whatever), there's different degrees to which we \"believe\" it. Something that's not very realistic (say, a Raggedy Ann doll) isn't very believable. As you increase the amount of detail or realism, the believability also increases- up to a certain point, at least. At a certain point, if something is very real looking but not COMPLETELY real looking, it is really, really upsetting to our subconscious. It sends off a signal in our brain that says \"Not human! Fake! Don't trust it!\". Only after this point, if it gets considerably more realistic, do we start feeling okay again. This is why mannequins are sometimes creepy. Some kinds of CGI, too, like Jeff Bridges' digital version (CLU) in Tron: Legacy. Ironically, some less realistic CGI (say, The Incredibles for example) is actually a lot less creepy because our mind just sees it as a symbol of a human, rather than a \"fake\" human.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Jerusalem so important to Judaism (and other religions such as Christianity and Islam)?",
        "response": "Judaism: The [Holy Temple](_URL_0_), the most important place of worship in the Jewish religion was build there, twice, and a wall of the original structure still stands, and is usually referred to as the [Wailing Wall](_URL_2_), to which many Jews still come to pray. Christianity: according to the Bible, Jesus lived in Jerusalem for most of his life and was killed there. Islam: according to the Quran, [\"Muhammad was taken by the miraculous steed Buraq to visit the Farthest Mosque (which many Muslims believe is the Al Aqsa Mosque in Jerusalem), where he prayed, and was then taken to heaven\"](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come some people can seldom or never brush their teeth and seldom or never develop cavities, while others adamantly brush 2-3 times a day, and develop many cavities?",
        "response": "Cavities have more to do with diet than brushing! I recall one study where a dentist went to a very remote village in Africa or Asia and they didn't have tooth brushes. He cleaned teeth and was amazed that after cleaning teeth that were completely black with built up plaque, there were no cavities or any real issues.   Sugar rots our teeth. Soda drinkers and candy eaters tend to have more cavities, even with religious brushing. People who eat \"clean\" (ie less refined sugars) tend to have fewer cavities even if they brush less frequently.   Brushing is important, especially if you eat sugar, but diet is a bigger factor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do phone companies, like the iPhone, focus on making smartphones thinner rather than putting in a bigger battery?",
        "response": "Look at sales. There have been quite a few smart phones that have focused on battery life being the number 1 priority. The problem was that they didn't sell as well as the new phone that's 1 mm thinner.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you chew a piece of gum, are you getting the entire nutritional value of the gum as listed on the packaging, or does it require swallowing to get the full \"nutritional value\" as listed?",
        "response": "The nutritional facts listed on gum are just the sweeteners and flavors. The gum base is not considered to be food, and the ingredients are not declared.  [Gum base is the non-nutritive, non-digestible, water-insoluble masticatory delivery system used to carry sweeteners, flavors and any other desired substances in chewing gum and bubble gum. It provides all the basic textural and masticatory properties of gum.](_URL_2_) You shouldn't find any of these in the ingredients.  _URL_1_ _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The moon landing was \"Fake\".",
        "response": "People believe what they want to believe. A lot of people think that 9-11 was conducted by our own government. Consider this: At present, NASA employs about 18,000 people. This is with a seriously reduced budget that congress keeps slashing. Consider how many people they would have employed in the 1960s when the program was in full swing. Now with a staff of 18,000+ people who are all working towards one goal, and with a massive audience that witnessed the launch, it's simply impossible to keep a secret like with that many employees. If it was faked, somebody would have talked. And now...[a video of Buzz Aldrin punching a moon landing conspiracy theorist who confronts him](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why in movies and tv shows every time a character asks another character about a large sum of money they write it down in a piece of paper instead of just simply saying it out loud?",
        "response": "*writes answer on slip of paper, folds it up and slides it to OP* I think you see why now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Isn't \"complexity\"/\"highly ordered state\" arbitrary? If so, how does entropy \"know what to do\"?",
        "response": "Think about it this way: If you have a novel of War and Peace it is 1225 pages long. There is exactly one way to have it be ordered correctly. There are nearly an infinite number of \"disordered\" configurations compared to this one ordered condition. Entropy is just statistically more likely and is why it \"knows what to do\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Middle East go from a free society where woman were able to wear whatever they wanted to what it is today?",
        "response": "The whole history of the Middle East is too big for an ELI5 question, and there is no single answer for the whole region. Iran and Iraq are very different, for example. Iran was a fairly liberal country until the Islamic revolution of 1979, after which Islamic law was enforced. Even after that, though, Iran is not as harsh on women as other countries: dress codes are strict, but women in Iran have careers, take part in sports, drive and even race cars, vote in elections and even get elected to government office.  That's not the case in Saudi Arabia, where women have been basically treated like naughty children since before the founding of the Kingdom. Daesh (ISIS) has its own rules, contradictory: they have female soldiers, but also sex slaves. In short, it's not really accurate to generalise about women's rights in the Middle East.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do MRIs need such a powerful magnetic field?",
        "response": "MRI machines use the magnetic field to line up the spin axis of certain atoms/molecules in your body, then emit radio “pings” to knock those atoms out of alignment. As they return to their original alignment, they dump the energy back out as another radio wave.  Those returning waves are collected and analyzed to yield a volumetric data set.  Without the very strong initial magnetic field, the atoms would just get reoriented and never need to realign, thus no signal return",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How to chickens keep their heads so stable despite the motion of their body?",
        "response": "They have specific muscles in there neck that keep there neck completely still but there body moves with t",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we use waste gas to create more energy?",
        "response": "The 'gas' emitted from power stations is the bi product of combustion of their fuel, which could be gas, coal, whatever. A hefty amount of that is water vapour. For a gas to be able to turn a turbine then it has to be expelled under pressure, which is of course how power stations work, usually by steam turbines. But the emissions from the plants are not usually under any significant pressure, not enough to turn a turbine anyway, so to attempt to put a turbine on the top of the chimneys would be pointless.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Customer Service/Technical Supp is one of the most impt in a business but also the one of the most poorly paid?",
        "response": "It is not one of the most important in the business. It's just required, much like the Janitor is required. It's one of the most poorly paid because it requires some of the fewest skills.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can bird/predators eat bugs or insects that are venomous?",
        "response": "There's a difference between poison and venom. Poison takes effect when eaten or inhaled. Venom takes effect when injected into the blood, typically through a bite or sting. Their predators may produce a natural anti-toxin or, in the case of those that prey on venomous creatures, are just really good at avoiding getting hit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Questions for a Hundred Years War History Project",
        "response": "From [the rules](_URL_0_):  > **Is this the right place for your question?**  > Questions should be about what did happen, not what could have happened. Questions of that type should be posted in /r/HistoricalWhatIf.  > **Homework**  > Our users aren't here to do your homework for you, but they might be willing to help. Remember: AskHistorians helps those who help themselves. Don't just give us your essay/assignment topic and ask us for ideas. Do some research of your own, then come to us with questions about what you've learned. This is explained further in this [META] thread.  > You can also consider asking the helpful people at /r/HomeworkHelp. A quick Google allowed me to find the answers to a couple of your questions very quickly. Help yourself - put some leg work in :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will a single gold atom have color? 10? At what point do we notice the color?",
        "response": "Color as we experience it in everyday life is mostly caused by the way many atoms are bonded together. For instance, carbon atoms bonded into a graphite pattern are gray while carbon atoms bonded into a diamond lattice are clear. Single atoms don't have color in the traditional, everyday, sense. But a single atom still gives off a characteristic set of colors when excited (its line spectrum). This is the action at work behind the colors given off by gas discharge lamps such as Neon signs. In a gas, the atoms are so spread out that they are effectively free and independent. Therefore, an atom does have a color in a gas-discharge sense. So, we \"notice\" the color even with a single atom, but it is just a different effect at work.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- How does somebody become paralyzed?",
        "response": "Paralysis is commonly caused when the nerves that send signals from the brain to the limb are damaged. There are medical causes, including birth defects, and mechanical causes, like crashing one's motorbike. Being paralyzed from the legs down might be caused by spinal cord damage in the lower back.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the amp a fundamental SI unit instead of the coulomb?",
        "response": "An ampere is simply a coulomb per second, it doesn't functionally matter whether you use a coulomb or an ampere as your base unit.  However, an ampere is much easier to measure. The SI ampere is currently defined through the force between two wires.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I sleep from midnight to 8AM, I feel like crap all day. If I sleep from 5AM to 1PM, I feel amazing and refreshed. Why?",
        "response": "Human beings have sleep cycles with different stages. Essentially what happens when you wake up groggy or tired even though you had 9+ hours of sleep is that you woke up in the wrong stage of your sleep cycle. There are ways to avoid this like special phone apps that detect how much movement you make and start the alarm when you're not in REM sleep. You can also time your sleep manually but I don't know the numbers behind that shenanigans. Essentially you want to wake up when you're in your lightest state of sleep which is known as NREM 1 according to this wikipedia article. _URL_0_ Edit: A sentence",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is the KKK still relevant? What exactly do they even do?",
        "response": "Times and values change, and so does the focus of any organization. Consider the March of Dimes was founded in 1921 by FDR, to help in the fight against polio. Today it's focus is on birth defects, and infant health.  Similarly, the KKK basically [started](_URL_0_) as a insurgency/terrorist organization after the end of the civil war. Today, over 150 years later, a post civil war insurgency would have a hard time recruiting support, money or supplies.  Near WW1, the KKK focused on anti-immigrant, mostly Catholics, eastern Europeans, Jews and still blacks.  Post WW2, it went back to anti-black, as an opposition to the civil rights movement.  Today there's still the obvious racism core, but it's more focused on being pro-white, with an element of using criminal activities to fund itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were there ever any Asian/Asian-American cowboys?",
        "response": "In the great expanse that is the American West, I suspect there was at least one Asian-American cowboy during the nineteenth century - the period that is the focus of your question. But finding such an example could prove difficult.  In general, one would not expect Asians to work in this capacity. Tragically, they were a scorned immigrant group, and many laws restricted what Asian immigrants could do to pursue a living. While I have never heard of any laws prohibiting Asian immigrants from working on a ranch, it would difficult to image one being welcomed by other ranch hands representing other ethnic groups. That said, the one place I would look for Asian-immigrant cowboys would be in Hawaii, where all sorts of Pacific Rim traditions merged in ways that were distinct from the mainland. I do not have Hawaiian sources at my disposal, and a quick search didn't yield anything concrete. Perhaps we will have a Hawaiian historians who will be able to address this possibility.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference between a religion/church and a cult.",
        "response": "The difference is easily seen when you try to leave it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "As a native speaker, why does my english get worse when I'm around ESL?",
        "response": "I'm curious to hear an answer to this too, as I live in a very diverse area and I've noticed I change my dialect depending on what ethnicity I am around and what their accent consists of.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes you to suddenly get shivers when you aren't even cold?",
        "response": "Your brain isn't always sure what it's supposed to be doing, or what your body is experiencing. Something to the effect of \"I haven't checked my body temperature in a while, better do something to affect that.\"  Ever had your leg just twitch for no reason? Same thing, except your brain thinks your falling asleep or dying instead of just sitting there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "According to special relativity, the speed of light is constant in all reference frames. Does this mean that the speed of light increases as your speed increases?",
        "response": "No. The speed of light can't increase, it's a constant :) I'm guessing what you're thinking of is the fact that, normally, velocities add - if you're travelling at 60 mph relative to the ground, and I'm travelling at 30 mph in the opposite direction also relative to the ground, then I'd see you travelling at 60+30=90 mph. That way of adding velocities, as it turns out, is only valid when things are very slow compared to light. Makes sense, because light clearly doesn't work that way - if I add the speed of light to any other speed, I should just get the speed of light back. That's what the [relativistic velocity addition formula](_URL_0_) does. Given two velocities, this formula tells you how they're added. It has two nice properties. One, everyone measures the same speed of light. Two, if both velocities are small, then it reduces to the usual additive formula.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does an infinitely-powered, constant-thrust spaceship never reach 300km/s?",
        "response": "The short answer is, as the spaceship gets to relativistic speeds its mass begins to increase, so the constant thrust results in less and less acceleration. Increasing the thrust won't help because as you approach light speed, the mass approaches infinity. From inside the spaceship you wouldn't notice this mass increase, however. The 1 million km markers would appear to keep coming faster and faster, and eventually they'd fly by often enough that you could seemingly clock yourself as superluminal, however at the same time the markers would appear to be closer to each other -- from your frame of reference they'd be less than 1 million km apart, meaning you're not superluminal after all. From the outside world you'd be passing the markers slow enough to be subluminal, but everything inside the spaceship would be observed moving in slow motion, which is consistent with observers inside the spaceship seeing the markers flying by more frequently.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it seem salt water fish and mammals grow so much larger than their fresh water counterparts?",
        "response": "2 reasons.  1: Everything you find in a fresh water lake or stream originally came from the ocean. A whale shark or a whale can't swim upstream and into a lake so colonization of large sea creatures are limited. 2: Well in the lake you have a food limit. Most lakes wouldn't be able to support a population of extremely big animals. The larger ones have fairly big sized fish, like the [European sturgeon](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much does direct heating affext global warming?",
        "response": "[Global energy consumption is on the order of 200 TWh per year (= 720 petajoules).](_URL_0_) [Total solar energy absorbed by the Earth is about 3,850,000 exajoules per year.](_URL_1_) Divide the two and you get about 2E-7. The amount of energy humans use per year is about 2 ten-millionths of the amount of energy absorbed from the Sun. Primary energy consumption, then, is negligible compared to something that affects how much energy is absorbed from the Sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does higher frequency EM become more dangerous?",
        "response": "Because the energy in a photon is proportional to its frequency. Multiply frequency by ten and you multiply energy by ten, too. In the case of human life, it becomes dangerous once it has enough energy to disrupt biological molecules.  UV can do a little bit of that, but won't penetrate the skin (so it causes sunburn). X-rays are worse, and gamma rays are quite capable of blasting a DNA molecule apart.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Instructions given to pilot by co-pilot in rally car racing.",
        "response": "One interesting addition which is often overlooked.  Usually, for safety reasons, distances less than or equal to 100m are called in multiples of 20. Distances greater than that are specifically not. E.g. 20, 40, 60, 80, 100 But then 110, 130, 150, 170 etc. This prevents a misheard note causing a massive accident - e.g 40 could misheard as 140, causing a flat out boo-boo... \"Odd\" number = far away. \"Even\" number =close. Easy to remember and becomes second nature quickly. Exceptions are 200, 300 etc as the word hundred is called, which is difficult to mishear. Edit - oops i thought this was in rally subreddit. So to summarise my post as an ELI5, far away roundy number make big bang.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people superstitious about doing something",
        "response": "Our brains like to find patterns. When they find good patterns of cause and effect, it's science. When they think there's a pattern where none exists, it's a superstition. We also like to learn from other people. When they share good information, that is teaching. When it's bad information, rumors and Speedos spread.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the 5th century both the Roman Empire and China were invaded by nomadic peoples and were divided. But why did the idea of unified China survive while Europe developed into many different states that never unified?",
        "response": "I don't know as much on Chinese history as I would like to do, but I think an important part of the answer may be our distorted view of the succession of Chinese empires, due to our ethnocentric bias (to which we could add the nationalist reconstruction of Chinese history). After all, you could argue that Napoleon's son was entitled “king of Rome” and destined to inherit the greatest part of Europe — doesn't it clearly show that the Roman Empire still existed in 1810? For us, the differences between Iulius Caesar and Napoleon seem obvious; they may not be so blatant for someone without a good knowledge of European history. Conversely, we definitely tend to think that all Chinese (and, more generally, non-European) polities were more similar than they really were. Were the Sui and the Jin less different than Charlemagne and Constantine?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to farm electricity using lightning rods or similar techniques?",
        "response": "It is pretty impractical. When farming electricity you want a steady constant source as much as possible so you don't need to store it which results in efficiency loss, not a huge violent (and random) blast 75 times a year.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it such a huge deal that scientists have taken a picture of molecular bonds?",
        "response": "Science involves taking data and building conceptual models to explain its behavior and to predict future events. Our models suggested how they would look, but now we can directly see it. In analogy we flipped to the back of the book and checked our answers, and they were right!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it common to pronounce some latin names like Caesar and Cicero with a soft C instead of a hard K (the traditional latin pronunciation), but not names like Cornelius and Caius?",
        "response": "I mean, in Classical Latin, it really is pronounced \"Kae-sar\" and \"Kae-sero,\" but English speakers are terrible about not butchering names.  Plus, it's how Ecclesiastical Latin pronounces some of them, because it's more related to Italian.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What colour is the sun outside of our atmosphere?",
        "response": "One could call it white, but it is actually a certain mix of a wide range of frequencies of electromagnetic radiation. The actual composition depends on the sun's surface temperature (6700K). See _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come sex and nudity in movies elicits a higher rating than violence?",
        "response": "Most of the world does not have this odd sense of priorities. Most of the world is far more relaxed about nudity and sex than the USA, perhaps with the exception of the Middle East.  Personally, I think the source is religious. Many Americans still adhere to a very traditional religious-based sense of morality, which stigmatizes sex and nudity. Violence, however, seems to have always been there. In terms of popular entertainment, violence was part of tales of thrilling adventure. From a young age, childrens stories involved violence and it always seemed to be acceptable. This acceptance of violence continues into adulthood.  The final result are extreme, ridiculous situations where prime-time television has been filled with fictional depictions of violence - and its fine. But Janet Jackson exposes half a middle-aged breast for a second at a football game, and it seems like the world is coming to an end.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How common are substances that radioactively decay into a liquid daughter -do any naturally occur? Are there any non-hypothetical instances where this causes a problem? How about into gas daughter isotopes?",
        "response": "For gas, the major one is Radon, from the decay of 238U and other heavy elements, and is itself radioactive. 135Xe is also produced by Uranium fission, also being unstable, going to 135I which isn't too hard to make a gas (especially at the temperatures in nuclear reactors). Liquid is more difficult, as you only get Hg (and something else?) that are liquid at room temperature, and is probably much too light to be a product of natural radioactive decay. Of course, if you count gaseous/liquid compounds, then the fun *really* starts...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is inside a nuclear warhead? Also what goes on when it explodes?",
        "response": "Modern nuclear weapons use high explosives to compress a sphere or shell of plutonium. This compression (\"implosion\") increases the density. At that moment, neutrons are injected into the compressed core. This starts a nuclear fission chain reaction which releases a tremendous amount of energy. For thermonuclear weapons, the radiation from the fission bomb is then used to compress and ignite fusion materials.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't Leptons affected by the strong force?",
        "response": "The same reason (fundamental) neutral particles don't feel the electromagnetic force. Leptons have no charge under the strong force, so they have no interaction.  The fact that the strong force exists has some residual effect on leptons. They feel the electroweak forces, as do quarks, so there are some higher order (\"virtual particle\") strong force effects. These should be very small though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the British and French not colonise South America and instead allow the Spanish and Portuguese to?",
        "response": "British colonization of the North came after after many of Spains conquests in Central/South America. The French made some efforts before the British, but even then the Spanish led the way. What years are you referring to where your stated situation was in place?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't China and Taiwan get along?",
        "response": "China had a civil war that ended in approximately 1949. The communists won and the nationalists lost. The nationalists fled to Taiwan, a large island off the coast of mainland China. The situation has been tense and complicated since then. Taiwan's economy boomed to unbelievable extent, and the mainland Chinese want to incorporate them into mainland China. If there is another huge war in the near to medium term, this is one of the places it could start.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were the reasons which led to Russia allying with predominantly Shia countries and the US allying with predominately Sunni countries?",
        "response": "The USA was strongly allied with both of them until the Iranian Revolution. After the hostage crisis and US support of Saddam in a devastating Iran-Iraq War, the relationship was severely compromised and has only recently been on the mend. The seeds of this unraveling were sown when the US supported a coup against Mossadegh who was elected, but seemed likely to be USSR friendly. The reimposition of the Shah, who was seen as an American puppet, fueled some of the initial tension which blew up the relationship.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Plausible disposal method for nuclear waste?",
        "response": "Even without reading your question I guessed it'd be \"shooting it into the sun\" - that's how often it's asked (e.g. [1](_URL_0_), [2](_URL_4_), [3](_URL_2_), [4](_URL_3_), [5](_URL_1_)) Short answer: It'd be ridiculously expensive, and rockets have a nasty tendency to occasionally explode, which would hurl nuclear waste everywhere, which is exactly what you _don't_ want.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the state of \"history\" regarding Islamic civilization today in academia?",
        "response": "Can you explain this?  > There seems to be an intense grassroots movement on the internet for a kind of historical revisionism regarding Islamic history and civilization.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a room that's closed off (sealed windows and doors, no sunlight getting in) get warm when the weather gets hotter outside?",
        "response": "Sun will hit the outer walls and the walls will heat up to the temp outside. Outer walls transfer heat to inside walls which heats up the air in the room.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At which point does something move?",
        "response": "Motion is a change in position, so an object will move as soon as its position changes. Mathematically, Zeno's Paradox is interesting history but not particularly useful. If you have one liter of water, and divide it into two halves, you will still have one liter of water. If you split the halves, you will still have one liter of water. If you split the quarters, you will still have one liter of water. No matter how many times you split the liter, it will still be exactly one liter. Splitting a length into small pieces -- even an infinite number of small pieces -- does not alter the length itself. If you learn calculus at some point, you'll perform this sort of operation regularly. Theoretical physicists sometimes talk about the [Planck length](_URL_0_), as it becomes very difficult to distinguish any movement or distance below that length.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I put oil between two flat plates, why is it harder to pull them apart? What is this pressure called?",
        "response": "A layer of liquid wetted between two surfaces is called a capillary bridge. The force you are describing is known as capillary adhesion and is caused by capillary action trying to spread the fluid further out into the narrow gap between the two surfaces. There's a nice diagram [here](_URL_0_). The force can actually be repulsive also if the surfaces are hydrophobic. Here are some links to additional diagrams and discussion: [one](_URL_3_) [two](_URL_2_) [three](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the KGB really superior to western spies in the cold war, and if true what made them better?",
        "response": "They weren't better. They had the advantage of operating inside of the west's free society. Where travel was generally unrestricted and surveillance was light, making it easier to avoid detection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did humans think to superheat ore into metal?",
        "response": "You may get better answers in /r/AskAnthropology. The earliest smelting pre-dates history, back around 9000 BCE. So we don't have a written record of why or how the practice started. That makes this more an anthropological/archeological kind of question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is static black and white and not colour?",
        "response": "Analog TVs had a circuit called the [\"color killer\"](_URL_0_). It was designed to eliminate any color from the screen when B+W programming was being received. The B+W signal did not have a [color burst](_URL_1_) reference signal, and it is the absence of this color burst which triggers the color killer. Static means no signal and no color burst.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did our universe become so organized?",
        "response": "The error in your question is that you're taking entropy to mean \"disorder\" which is not entirely correct. If that's all it was, then you'd say \"of course a planet, a solid spherical object, has more order than a big cloud of gas, so it must have less entropy\". But entropy is better described as an inverse measure of how far something is from energy equilibrium, or how much work a system can do. With most terrestrial systems, disorder/order works well, but on a large scale where gravity comes into play, that defintition breaks down. We talk of objects/systems that have potential energy as ones that are high up in a gravitational field and can fall, thereby performing work. Core principle of hydroelectric dams. Therefore, a giant spread-out cloud of gas has a lot of potential energy - it will eventually collapse under gravity and form a star/planet, radiating heat out as it does so. A planet is in a much lower 'energy-state' than the gas, and so has a much higher entropy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it likely that elements 119 and 120 already exist from some astronomical event?",
        "response": "Such heavy elemements are extremely unstable. Therefore they decay in fractions of a second after they are created. Even if they are created somewhere outside of the earth, there is no way that they make it to earth and then stay intact long enough for us to identify them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do \"extended release\" work? Does the tablet just sit in your intestines fizzing away? Or is it more complex?",
        "response": "It depends on the type of medication. However, typically half the medicine will dissolve very quickly while the other half has a coating of material on it that it takes your body a certain amount of time to break down. An example would be half the dose now and the other half in four hours. For reference, the form of medication that this would pertain to is a caplet which when you open will contain many tiny beads half of which are coated and half of which aren't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between medical steroids and athletic steroids?",
        "response": "Athletic steroids are anabolic (muscle building) in nature. Medical steroids (presuming you mean corticosteroids) are still steroids but they are usually anti inflammatory in nature. So steroids like the hormone testosterone will make you get larger and cause masculine virilization. Corticosteroids are for respiratory and many autoimmune disorders.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we know why moving electrons create magnetic fields, or we just know they do?",
        "response": "Theres two perspective of looking at it, and it basically comes down to the relativistic effect of moving objects that causes a slight contraction in the direction of movement, dependant on speed. Its hard to explain how this actually causes it so ill let this guy do it for you: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In \"The Pacific\" miniseries, the Japanese military commit numerous atrocities in Okinawa (shooting civilians, forcing civilian women to be suicide bombers, etc); is this historically accurate?",
        "response": "Hello everyone,  Unfortunately, we have already had to remove a number of poor quality responses in this thread, including many asking about the deleted comments, which merely compound the issue. In this thread, there have been a large number of incorrect, speculative, or otherwise disallowed comments, and as such, they were removed by the mod-team. Please, before you attempt answer the question, keep in mind [our rules](_URL_2_) concerning in-depth and comprehensive responses. Answers that do not meet the standards we ask for will be removed.  Additionally, it is unfair to the OP to further derail this thread with off topic conversation, so if anyone has further questions or concerns, I would ask that they be directed to [modmail](_URL_1_), or a [META thread](_URL_0_[META]). Thank you!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the medieval war trope of launching rotting corpses and cattle over walls actually occur?",
        "response": "I only know of one such case: during the siege of a Genoese colony Caffa, 1346, Mongols were throwing bodies of people who died of plague into the city. It is not clear how much effect this had on the defenders - the city was not taken. However, the plague did spread from Genoese colonies in Crimea to all of Europe - the outbreak is known as \"Black Death\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do movie studios care if I pay for Netflix and use a VPN to change my location? They are getting paid either way.",
        "response": "The problem is that when Sony released a movie in Australia, it formed a contract with a studio in Australia to do that. So that studio owns the right to distribute that movie in Australia. If you use Netflix and a VPN to access the U.S. version of Netflix, you're cutting out the Australian company that actually owns the right to distribute that movie in Australia. It'd be like if you paid for the right to be the exclusive seller of BMWs in Colorado, but people were buying BMWs in Colorado directly from Germany. You're getting screwed even if BMW isn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's all the fuss this morning with Wikipedia and Go Daddy?",
        "response": "Long story short, yesterday, a call to boycott GoDaddy came about because of their positive stance on SOPA. Today, someone suggested that Wikipedia switched their domains from GoDaddy to another domain name provider.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that when i first watch a movie or listen to song the first time it feels longer?",
        "response": "It's because you don't know when it will end.  Same goes for a road trip: when you have been down the same road several times, you already have a picture in your mind of the whole thing. The first time through, it's all new and you don't already know when and how it will end.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "There were 8 presidents while the US was under the Articles of Confederation. Why are they not considered as the presidents of the United States?",
        "response": "The President of the Continental Congress was not a chief executive, he was just the leader of Congress who ceremonially presided over their business. He had almost no power that Congress did not explicitly grant him. The position had so little importance that it was difficult to get people to fill it in the later years. Anyone with real political aspirations sought out state or congressional positions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are chef's hats (toques) so tall?",
        "response": "Different heights may indicate rank within a kitchen. The 100 folds of the toque are said to represent the many different ways a chef knows to cook an egg.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What allows us to remember a taste?",
        "response": "All of your senses except one are gated by the thalamus, a structure deep in the brain that acts sort of like a filtering mechanism. Ask yourself why you weren't noticing the feeling of the clothes you were wearing until I just mentioned it. The thalamus! The interesting thing about smell, in particular, is that it actually bypasses the thalamus -- decrease in the subjective sensation of a given smell isn't gated by the thalamus, but by chemoreceptors in the nose. This is why things involving smell are so intimately tied to memory -- a more direct signal into the higher cortical structures can more effectively \"condition\" you to remember something. Taste depends on smell; if you haven't tried it before, squeeze your nose shut and try to eat something. Won't be nearly as good.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the temperature of water affect it's viscosity?",
        "response": "Hopefully you'll get an answer from someone more knowledgeable, but yes temperature does affect the viscosity of water. [This page ](_URL_0_) shows that as the the temperature goes from boiling to about freezing the viscosity increases 4 or 5 times.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does light stop moving at absolute zero?",
        "response": "> absolute zero signifies that all matter stops moving  This actually isn't the case. Quantum systems almost always have energy of motion which is still nonzero as you approach absolute zero temperature. For instance, electrons don't stop moving around their atoms because it's cold. What absolute zero does mean is that your system no longer has any excess internal energy it can lose.  > So, can a photon still travel through 0 K?  The is more complicated. Temperature does not just exist on its own, it's a property—a substance has a temperature and different substances interact with light in different ways. So a medium at one temperature might impede light while a different medium at the same temperature lets it travel through just fine. Being close to absolute zero doesn't have anything to do with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This scene from Phil of the Future, a binary code joke (link inside).",
        "response": "Not to be \"that guy\", but 1101001 is actually 105. 01000101 is 69. I think what they did was break it into 2 numbers: 110 = 6 and 1001 = 9 It's like Chad Ochocinco - it's not really 85, it's 8 and 5.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we determine the amount of calories a certain food product has? Also, how do we estimate how many calories a body burns for a x-amount of time?",
        "response": "The amount of calories in your food is determined by putting it in a measuring device conveniently called a 'calorimeter'. In the device it is burned until there is nothing left that will burn and the energy that is released by burning the food is measured as heat produced. Calories are a measure of energy, so this is a measure of the energy in your food.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What ever happened to Lake Vostok? (The ancient lake found underneath the glacier)",
        "response": "From the article you linked.  > In the Antarctic summer of 2012–13, the Russian team also plans to send an underwater robot into the lake to collect water samples and sediments from the bottom. An environmental assessment of the plan will be submitted at the Antarctic Treaty's consultative meeting in May 2012.[51] Meanwhile, both the American and British teams intend to penetrate the lakes sometime in the future and retrieve sediment cores from the bottom.[53] The southern summer is the northern winter, and it's too inhospitable to be there in the southern winter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we clap excessively at the end of a formal performance (play, ballet, etc)? Where did that originate?",
        "response": "It is really just kind of a ritualized release of energy built up during the performance - from the highs, lows, awe, dread, excitement and what not. People have stomped their feet, jumped up and down, flailed about excessively at various times in our cultural history to express this energy in different ways.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is all the debris in space and other stuff orbiting earth not a bigger problem?",
        "response": "Its all super far apart and would take more resources than the objects are worth to collect them and orbital decay HAS already been calculated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between bees, hornets, wasps, and yellow jackets.",
        "response": "Bess are generally not aggressive (except maybe Africanized Bees), die when they sting because bits of their insides get pulled out after they sting, and harvest flower pollen to make honey. Bees are also fuzzy. Wasps are basically smaller hornets, both wasps and hornets eat insects (like bees) and don't die when they sting because the stinger doesn't get torn out of their body. Wasps and hornets are hairless. Yellowjackets are just one particular type of wasp.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it totally ok and expected to haggle some items (like cars and apparently mattresses), while others have a fixed price? Why can't we haggle the price of chips or an iPhone?",
        "response": "Amount of inventory and volume of sales. High amount of inventory or sales means little or no haggle. Lower inventory or low sales volume creates better opportunity for haggling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How/why Putin is not considered a dictator? (Or at least the head of an authoritarian regime?)",
        "response": "Putin is indeed considered a dictator in some political circles, and his policies and media utterances are looking a lot like fascism. However, there are diplomatic reasons why politicians use more moderate language.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the earth was symmetrically/uniformly hollow, gravity would be cancelled out inside. But what would be the gravitational field behaviour in an off-center 'pocket' of space in the earth's mantle, and could this ever occur naturally?",
        "response": "You can find the field anywhere in this situation using superposition. You just take the field that *would* be produced by the full sphere, and add to it the the field produced by an off-center pocket with \"negative mass\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have people always celebrated birthdays like we do today?",
        "response": "Dwight is wrong. The Romans celebrated birthdays. As an example, one of Propertius' most moving elegies is addressed to Cynthia in celebration for her birthday. The poem is a bit odd in that it's all Propertius imagining, rather than reporting, what Cynthia is doing, but he imagines her purifying herself and offering sacrifice and then speaks of her dressing up and banqueting, followed by drinking and birthday sex. That's just one (particularly cute) example, but there's really no shortage of references to private birthday celebrations in Latin literature. As early as Plautus birthdays were celebrated with feasting and conviviality, and in fact Plautus has quite a large number of very open references to birthday parties--in the *Pseudolus* the preparations for Ballio's birthday party are sort of of central importance, as they're supposed to be going on in the background while all the action happens",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did wooden heavy ships such as galleons deaccelerate before docking? Why didn't their massive weight cause it to slowly ram their hulls against piers wrecking everything?",
        "response": "Larger ships rarely sailed directly to the pier when they docked. While they might have a minimum of sail to have speed enough to navigate when aproaching the pier, the last stretch was usually manually handed, by warping. This means that the ship stops and the anchor of the ship is put in a boat and rowed to the position the ship want to take. The anchor is then dropped and the ship can pull itself to the anchor by raising the anchor until it is in the position it wants to be. Another way would be to sail at a very low speed until the ship was close enough to throw lines to men ashore, who would then pull the ship the last distance until it could be tied up pierside.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Former SS in French Foreign Legion, Vietnam",
        "response": "> > My father mentioned a book about some SS who joined the Foreign Legion after the second World War and were sent to Vietnam but I haven't found said book nor much info about it. Does anyone know more about it? Here's the wiki link the page your father most likely is referring to _URL_0_ It's basically Neo-Nazi propaganda",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how our parents became so unanimously convinced that their children should take out massive loans to pay for college?",
        "response": "It became a cultural thing. Go to college and be successful. That simple message trumped everything. People dreamed of fancy office jobs and forgot just how good life as a plumber could be. So much so that their is a shortage of qualified workers in trade jobs.  However it's more than that. It evolved to be the 13th grade. Just the next logical step with no real plan. Liberal arts? That's horrible. Really. After high school you are supposed to have a plan. If college helps in that plan, you go, if not, you don't.  This is becoming culturally realized now as we have more grads in debt then we know what to do with. Like anything in society, it goes in cycles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are all of the different LGBT acronyms and which one is the most politically correct/least offensive?",
        "response": "People have created variants when trying to be inclusive. That's all there is to it. Generally speaking, almost no one will be offended by LGBT. It's not *wrong* even if some people consider it incomplete. LGTBQ is considered pretty solid as well. People will generally appreciate the effort if you push it past that, but it gets cumbersome, especially when spoken aloud. Though, I am somewhat fond of (the slightly more approachable) \"QUILTBAG (Queer, Unsure, Intersex, Lesbian, Trans, Bi, Asexual, Gay)\" which is rather easy to say. I was also a big fan of GSM for a long time- Gender or Sexual Minority. It's very inclusive. I've heard though that the term is falling out of use because it's been appropriated by pedophiles, zoophiles, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the TSA know if you have a Note 7?",
        "response": "It's not so much about knowing, it's about the fact that it's a crime to bring it on a plane (possibly a federal crime). Most people *will* avoid breaking a federal crime.  You are also required to have all your electronics for inspection, and your luggage *does* get x-rayed and searched. Yeah, you *might* be able to get away with it, but they also may well find it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do wild animals know if humans are trying to help them (i.e. stuck sheep or trapped bear cubs)?",
        "response": "It depends on the situation and on the animal. Sometimes the critter is so wound up they will go for anybody, so you have to dart them or cover them so they can't hurt you while you fix the situation. Other times they know they've tried everything they can and all they have left is trusting a stranger, regardless of species. Normally the wild ones will wait until they are out of danger, then make a break for it. If they are too tired they might need some time and care, but we try to give them space away from humans to get their heads together. Occasionally they will take their time on release, but mostly they just run for it. When it's most heartbreaking is when you have a domestic animal that is in such a bad way that when the Animal Welfare Officer turns up they just crawl into your arms and lick your face in the hopes you'll take them away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the easiest way for me to reduce my carbon footprint without going all environmentalist all over everyone's day.",
        "response": "Turn off the lights when you don't need them. Only run water when you need it. Ride a bike occasionally. Carpool if you like your co-workers. *Saves money and the world*  Recycle  Don't litter",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the purpose of multiculturalism, why is it good, and what is it's goal? (like i'm a teen not 5)",
        "response": "Imagine you are with your close friends from your neighborhood. Chances are, you have similar backgrounds, similar cultures, like the same things and act in a similar fashion (this might not be the case, but stay with me). It is likely that when a problem arises, you might all come up with a similar solution or similar analysis.  Now, someone outside your close group of friends enters. They have grown up in a different culture, with possibly different values and different ideals. When presented with the same problem, this person might come up with a completely different solution/analysis influenced by their different background/thought process. These new approaches might be better, might be worse, or just might be something you haven't thought about. It seems that some cultures (for whatever reason) excel at certain things (German Engineering, French cooking etc.) The idea is that the meeting of various cultures will increase the exchange of ideas and potentially find the best solution to a problem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do you naturally want to hold your breath when lifting something heavy?",
        "response": "Holding your breath increases pressure in your lungs/rib cage which can help brace the spine during a lift making it stable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you start to see oddly specific advertisements on messenger, is that just a coincidence?",
        "response": "No. Your internet usage is being tracked by a whole lot of people, including facebook, and countless others. They then serve you up appropriate ads.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have drugs affected human evolution?",
        "response": "I'm not sure if it's \"drugs\" in the manner that you meant, but antibiotics have let people with inferior immune systems survive and procreate, and have therefore affected human evolution.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between a wireless access point, a Wi-Fi extender and a bridge?",
        "response": "A wireless access point is the initial generation point of a wireless network, this can either be from a wifi enabled modem, or a wifi router.  & #x200B; A wifi extender is a relay, that sends the data back to the access point, but often has a different ssid. Whereas a Mesh Network (which is another kind of extender) gives you the same ssid from every extender, meaning you don't have to change network.  & #x200B; A wireless bridge connects two different wired ethernet connections together over a wireless connection.  & #x200B; Some Wi-Fi extenders, such as those from tp-link can act in \\*all of these capacities\\*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Television News Programs get locations completely wrong on maps so often?",
        "response": "In the past you had a newspaper once per day. The journalists supplied the stories, editors checked them for editorial issues, content checkers (that's a job, not some feature of your word processor) would fact check them and when the newspaper went to the printer it was checked and double checked. Then some people in the publishing company (news paper or TV or internet) went from \"If we get rid of the content checkers who don't generate any contents anyway, we can save ourselves money on that.\" and the content checking was then done by people who were supposed to do editorial checks. And then the editorial checks got cut down because the stories coming from the journalists were good enough. So, nobody is checking the content before publishing, nobody is checking the facts before publishing. And that is how you end up with embarrassing mistakes like Brussels ending up in over Paris.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is this uniform? Possibly Ukraine prior to 1935",
        "response": "The crossed rifles cap badge + tunic resemble that of a British School of Musketry privates uniform. The Suit to the right is English in cut as well - is it possible your grandfather was in Britain at any point?  Conversely, your grandfather is wearing leather high boots, which were not issued to British EMs (only officers) , while the belt does not appear to be British either",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In American football, other than the quarterback, why do most players never pass the ball?",
        "response": "Well it's not their job or position. Each individual position has a specific job. The quarterback's is to pass. The running back's is to carry the ball. The wide receiver and tight end's is to catch. The Offensive Line is to block. It's like asking why the shortstop doesn't pitch in baseball.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When the global sea level changes, what does the corresponding change in atmosphere look like?",
        "response": "Your theory does make sense but there are a few points you missed. The further away air is from the Earth the less gravity hold it in place so it will be less dense. This means 120 m of air at water level takes up considerably more space when at the outer reaches of the atmosphere. In addition, if you think of the atmosphere as a series of layers, the layers closer to the center have less surface area than those further out, so 120m decrease in water level night only result in a 20m decrease in atmospheric level, such that the change would probably not be remarkably noticeable",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly did Europeans bring livestock to the Americas?",
        "response": "Some animals, such as pigs and chickens, can be brought on ships as deck cargo. Most often they would be brought as a source of fresh food for the sailors.  Horses don't travel well at sea. Generally they have to be transported in a sling because otherwise they will die. Large ships with wide hulls were sometimes co-opted by armed forces as horse transports. Horses could be disembarked with a ramp.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the military phonetic alphabet get its letter/word combinations? And why is \"F\" Fox-trot and not just \"Fox\"? And why is 9 \"Nin-ER\"?",
        "response": "Verbal communications, particularly over radio, are subject to noise. Ambiguity needs to be avoided as much as possible. \"Nine\" and \"five\" sound too similar, saying \"nine-er\" and \"five\" is clearer. Foxtrot is two syllables, so it's harder to confuse it with something else of one syllable that might sound similar to fox. Considering how much confusion occurs in cell phone calls, it would be helpful if more people knew how to speak this way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do any conspiracy theories actually hold any water? If so, which ones?",
        "response": "The term \"conspiracy theory\" is usually applied more to outlandish ones than actual historical conspiracies. There have absolutely been many historical conspiracies, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Modern Britain experienced enormous, even dramatic changes, between the mid-eighteenth and late-twentieth centuries, and yet there was no revolution. Why?",
        "response": "A reasonable amount of personal freedom and prosperity compared to much of Europe, a representative legislative body, an adaptive legal system, and an extant, but limited in power, monarch. Oliver Cromwell had also soured republicanism for many.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Vietnam War considered such a failure?",
        "response": "From an American view, we lost 58,220 troops, another 303,644 wounded. The south Vietnamese government we were supporting lost the war, and the northern Vietnamese government we were opposing took control of Vietnam. Many of our wounded ended up having a lot of physical and mental problems because of the war experience, it was the first war in America in which post-traumatic stress disorder started being recognized in returning troops. It also tarnished our image as a great military power. So yeah, it didn't go well for the U.S.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do all those vitamins fit into that one gummy",
        "response": "In very minute doses. The tablet weights is usually a gram or two. The vitamin content is in milligrams. So it can have hundreds of milligrams in a gram.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the first computer coding get \"written\" if there wasn't a \"language\" to write it in beforehand?",
        "response": "Computers cannot understand programming languages directly. They have to be \"compiled\" or \"interpreted\" into the native language of the computer. This \"native language\" is simply an arrangement of 1 and 0 bits that tell the computer what to do. For humans, reading a long string of 1's and 0's is tedious and error prone, so we developed a 1-to-1 translation of these mappings to instruction mnemonics. That is, you would write something like   mov al, 0x00 and that tells the computer to move the hexadecimal value 0x00 into the 8-bit register AL. Since all these instructions can be mapped directly onto a bit pattern, it was simply a matter of translating these to the appropriate pattern and loading it into memory to run.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do snakes sleep? They don't have eyelids, they don't even blink.",
        "response": "For starters, they do have eyelids - they're transparent and fused closed, so technically their eyes are always 'closed'. But to sleep, they'll typically either bury their face into themselves, or just close their retinas. They have that ability.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How self-driving cars will handle 4 way stops and merging on a freeway?",
        "response": "Do what humans should really be doing: if you have right of way go for it. If you don't, then don't. If you take your right of way and someone is going out of turn stop going. If someone else isn't taking their right of way go cautiously.  Similarly merge by waiting for the opportunity, signalling correctly and going for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"white-knighting\" exactly? Why is it considered bad?",
        "response": "A person representing themselves as male shows up in a thread where women or a woman are being disrespected. Male poster attempts to shame those who are doing the disparaging. Some see this as an attempt to become attractive to females by \"taking their side\". There are hints that the White Knight is actually misrepresenting their true feelings to trigger this response.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't there big social movements anymore in the US, e.g., temperance, religious reformation, segregation, etc.?",
        "response": "I suspect that it is easier to see the magnitude of a movement in history books, in which a great deal of irrelevant information is cleared away, rather than in the present, when it is simply part of a large, complicated world which no historian has yet sifted through, seeking the histories of those ideals which have already won. In other words, I suspect that there are movements, they're just hard to see because hindsight is twenty-twenty.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and when Conservatism got attached to anti-science ideas?",
        "response": "Generally this happens because conservative parties have a common cause with religious conservatives, who may have their own ideas about how the world works that conflict with established science. The left also has issues with this though. As demonstrated by the anti-vax, anti-GMO, and anti-nuclear movements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What can the James Webb telescope see that the Hubble can’t?",
        "response": "Finer and more detailed pictures. If I'm not mistaken, Hubble can only see about 10 billion light-years (ly) away, but those pictures are kinda fuzzy, we can still collect a lot of data, but JWST is going to take MUCH finer measurements, observations, and pictures.  **Answer to your question starts here:** Hubble specializes in taking visible light observations, or pictures if you will, although it has tools to measure in other wavelengths, whereas JWST is going to specialize in longer wavelengths like infrared due to the expansion of the universe redshifting wavelengths from so far away. This will allow us to see what the universe might've been like when it was just a wee baby and starting to create galaxies",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did people use before lip balm?",
        "response": "People used goose or other animal fats on their lips and faces, especially in cold areas to protect against windburn and cold, dry air. Also, beeswax and oil. The Burt's Beeswax brand that I use now is essentially just that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the cardinality of the set of the cardinalities of all sets?",
        "response": "There are too many cardinalities to form a set, so it doesn't have a cardinality. *Proof.* Let *S* be a set of sets so that every set is equivalent to one set in *S*. Let *P* be the powerset of the union of all sets in *S*. This set must necessarily have a strictly greater cardinality than any set in *S*, and so cannot be equivalent to any of them. □",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the appeal for celebrities to take part in an AmA?",
        "response": "3 main reasons: 1: publicity for their work 2: publicity for a charity 3: they love chatting with fans",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Large Kinetic Energy Weapons",
        "response": "Related question: If I'm orbiting along and just 'let go' of one of these rods, won't it just hang there next to me? Won't the rod have to be actively de-orbited in order to actually reenter the atmosphere on command, short of normal orbital decay?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When we smash glass, does the crack travel outwards from impact, or does it crack instantaneously?",
        "response": "The videos you saw might be slow motion, but they're probably not slow enough to show the crack propagating from the point of impact. [This](_URL_0_) video on youtube shows glass being impacted by a high-speed projectile at 10 million fps, and you can clearly see the crack propagating from the impact point, however the initial propagation is *much* faster than the projectile itself. My understanding is that cracks propagate at the speed of sound in the material (someone correct me if I'm wrong here, materials science isn't my specialty). For glass that's about 5000 m/s. There isn't any scale shown in the image, but guessing the ball is about 1 cm, then it would take about 1e-6 s, or 1 millionth of a second for the crack to spread from the point of impact to the size of the ball. Since the camera frame rate is 10 million frames per second, that's a high enough frame rate to resolve the spreading crack.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there preconceptions as to what should be eaten for breakfast/lunch/dinner?",
        "response": "It's not so much \"preconceptions\" as \"culture.\" Different cultures vary on that kind of thing; for instance, in India they often have Dal (a spiced lentil dish, sort of like lentil soup) for breakfast.  A lot of our culture has been shaped by commercial interests, by the way. Having cereal for breakfast was something that came about in the early 20th century after a lot of effort from those who were making breakfast cereals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are all adverts on porn sites of such poor quality? [NSFW]",
        "response": "Sometimes advertisers purposely make their ads look like they're written by non-english speakers. I get spam on a daily basis with people pretending to be \"a young russian lady living in the boonies of ukraine. I love meeting your acquaintance on my profile\" and crap like that.  They're trying to make it seem \"more realistic\" instead of polished. It gives it a certain unrefined genuineness and non-corporate legitimacy. That might explain some of them. As for the general low-quality of the rest of them, the internet in general isn't a very good place to do lots of advertising. Most ad companies do PPC (pay per click) at REALLY low rates - they also pad the accounts so 50 hits is only registered as 2 or 3. They'll disqualify the majority of your hits and claim that they were \"bots\" or whatever. Plus, a lot of people have ad blockers (or they just visually block the ads by ignoring them). Honestly, have you ever clicked one of those ads? That's partially why they're low quality - nobody clicks them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you pour a layer of oil on top of water in an open container, will it keep the water from evaporating?",
        "response": "Yes definitely. One of the ways people used to do pcr was to layer silicone oil on top of the tubes so the water would not evaporate away that was in them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Differentiation and Integration",
        "response": "excellent book with an approach I think you are looking for: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a virus get its \"energy\"? As in what does it use to move around, infect, etc.?",
        "response": "No, there is no organ system or any equivalent in a virus. A virus is simply a strand(s) of RNA or DNA in a capsule. The capsule is structured in such a way as to bind to certain cells and enter. Once in the virus simply uses the cell's proteins to replicate it. So in this sense they use ionic/hydrogen/VdW interactions to accomplish this. Also, in blood or out of the cell, viruses depend on random movement to help it encounter the cells it needs to infect. I would think this is determined on binding affinity of the virus to the cell of interest and diffusion. Viruses don't use energy because the host provides it for them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This scene from American Beauty. Everyone is saying it changed their view of life, and that it is a very deep scene. But I fail to see the greatness.",
        "response": "Then you might already be hollow inside. The scene is about the beauty in the world that gets unnoticed or passed over, as you just have. Ever hear ‘stop and smell the roses’? That is what this is all about; take the time to see the wonder in life, take the time to soak in experiences others miss. I once watched two green anoles (lizards) fight for an hour! It was amazing, the territorial dance, the ferocity, the determination, and the ultimate defeat. This scene fall into that moment, when you are so absorbed into wonder that it makes you cry that other have missed it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do female mosquitos need to drink blood?",
        "response": "Not nearly as effectively. Blood is a very concentrated nutrient in fluid form, and so it's easily to collect very rapidly in great amounts. You don't have to chew it, all you do is have to insert a hose and suck it up. So mosquitoes evolved blood collection as a strategy to get the necessary proteins and other chemicals because it was so efficient, even if a whole lot of them die in the process.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the natural logarithm function used in the thermodynamic definition of entropy, rather than base 2 or 10 or anything else?",
        "response": "Once you're using a logarithm, the base is pretty much up to you -- it'll just add a constant of proportionality if you change the base. So the choice of the base of the logarithm is one you make about what's useful in the context in which you are working. In thermodynamics, the mathematical simplicity of the natural logarithm in the context of calculus makes that the preferred choice. (e.g., d/dx of ln(x) is 1/x; other bases don't give such a simple result). In the case of Shannon and more generally when thinking about information, bits are the fundamental unit of information, so log base 2 lets you access directly what you want to be thinking about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is safer for the baby, a natural birth or C section and why?",
        "response": "Natural birth. A the end of the day [more babies die](_URL_2_) during an elective Caesarean (1.77 per 1,000) than as with a natural birth (0.62 per 1,000) by almost a factor of 3. The time when a Caesarean is \"safer\" is when it is not-elective. That is, when it is done because a natural birth would be too risky for the baby or the mother.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between being indicted and being arrested?",
        "response": "Being arrested is the local law enforcement agency detaining you on the reasonable belief that you have committed a crime.  Being indicted is actually having charges pressed against you in a court with jurisdiction over the offense you are alleged to have committed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Jews get so much discrimination throughout human history?",
        "response": "Traditional Jewish laws make it impossible to assimilate very well into a different culture; lots of things are required or prohibited, in a way that makes people following the laws stand out. Modern Jews aren't generally too strict about following all that stuff, but in the past they were more so. And because they were an easily visible minority population, it was easy to point a finger at them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My father thinks Hitler was an atheist. Where is this miss information coming from? or am I on the wrong?",
        "response": "Hitler's religious identity is really a matter of whatever was useful to him at the time. He has plenty of writings that denounce and reject Christianity and yet he also liked to portray himself and the National Socialist movement as a defender of Christian values. It's really all about who's listening.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Probes like Voyager are limited by their speed. Wouldn't the best way to send out an extraterrestrial greeting be through an intelligently sequenced string of explosions from space?",
        "response": "Wouldn't it be even easier to just build a big radio dish? There's a lot of visible light pollution from things like stars. And besides, no one really treats probes like voyager as a possible first contact method.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the label around a plastic bottle of soda seem to shrink when the bottle is first opened?",
        "response": "The label doesn’t shrink. It’s being pulled in with the bottle as it reduces its volume and pressure as the gas is released when you open it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our ability to smell is just our way of perceiving chemicals in the air, why do certain substances, like an unlit candle, still give off these chemicals to the air?",
        "response": "Candle wax and the oils containing the candle scent are still relatively volatile -- the candle is outgassing a slight amount of the scent particles even when not lit, which is what you smell.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "2 questions about dark matter...",
        "response": "1) no. Not that we think at least. It seems to behave like any other kind of matter does gravitationally speaking. *But* it doesn't interact with the electromagnetic force or strong force. Technically, neither do neutrinos, but they have too small of a mass to fit the rest of the data. (they are a *kind* of dark matter, but a \"hot\" dark matter, as opposed to \"cold\" dark matter). (also photons *are* light, and they do curve space time in a specific way, but it's a little difficult to say it's exactly the same thing as gravitation. 2) Yes, it generally seems to be in [dark matter \"haloes\"](_URL_0_) around and through galaxies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Unintended holes in airplanes are bad. But people can safely stand in open cargo planes and helicopters?",
        "response": "Pressurization. A hole in a pressurized cabin at 38,000 feet will cause massive damage as the pressure tries to equalize as quick as possible. An aircraft with an open door from the ground remains at the same pressure as the outside throughout the entire flight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How high could a balloon float?",
        "response": "There's two major factors determining how high a balloon can float: **The strength of its material** and **Archimedes’s principle**. As the balloon travels higher, the helium inside expands, and it explodes sooner or later, depending on the strength of the material. The ultimate limit is Archimedes's Principle, which states that balloons will stop rising once their density equates to the surrounding air, so it's impossible for it to rise into space.  Read more about it here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people acquire \"smells\"?",
        "response": "Your smell mostly comes from what you eat, and the flora living on your body. Simple as that really. If you eat a ton of onions, you will smell slightly oniony. Whatever balance of bacteria and fungi you have living on you contributes hugely to your smell. Your smell will actually change over time depending on what people you have close contact with, your daily activities, and your personal habits. All of these factors change the balance of living organisms on your body (or in your clothes and such), and will probably also affect what you have been eating.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "People say that bonobos/dolphins/whatever are the only animals other than humans to have sex for pleasure. Don't other animals get pleasure too?",
        "response": "\"People\" don't always know what they're talking about. Sure - any animal is going to experience a reward sensation that will drive them to keep having sex. I guess the idea is that the animals you listed have sex for reasons other than procreation - namely recreation and social reasons. In the case of cetaceans, for instance, blowhole sex has been reported. Not kidding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the 'air' feel so different when there's snow on the ground?",
        "response": "The air is drier after it snows, because most of the atmospheric moisture has precipitated out as snow. That may be the difference you feel. Also, cold air cannot hold as much moisture as warm air. That's why it's generally drier during the winter than the summer, if you live in a temperate zone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that people drown in an ocean when you can float in a swimming pool?",
        "response": "But the ocean has waves, and it takes some effort to float. Also, panic figures heavily into it: once you catch a lungful of water from a wave you weren't expecting, it's amazing how fast things can get pear-shaped. But there are people who have lasted an amazing time at sea; survival techniques, when tested, sometimes had their duration tests ended simply because the subjects got bored.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does speech recognition software know what you are saying?",
        "response": "Programmer here currently researching vocal recognition inside computer assistants, allow me to share my research. By default, computers don't understand, that's where developers come in, identifying tones in the voice to gather whether something is a question, and overall gathering words from how something is said. This stuff requires A LOT of hard work, because each word needs to have a certain tone and dialect registered, which is usually why assistants don't work in offline mode, and require a network so the assistant can check with a database or API (Application Programming Interface) to see what it is that is said and what it should do. So to sum, it's all to do with the programmer making something identify tones and certain ways something is said. Anymore questions I'll be happy to try answer Oh, i'm unsure whether your techy but here's some Python code for a popular open source recog lib _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a spaceship rotate or change its course by shifting its mass instead of using thrusters?",
        "response": "Yes, [control moment gyroscopes](_URL_0_) (CMGs) or reaction wheels are used for this in smaller spacecraft and some satellites. The International Space Station uses several CMGs to orient itself. It can be more efficient than thrusters, and more importantly, it can be done without consuming propellant. Edit: Yes, to clarify, this can only change orientation, not position. So relating that back to the ISS example, the CMGs keep the space station at a fixed attitude relative to Earth, but two engines are used to boost the station to maintain orbit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the Theory of Evolution explain the development of adaptations, the intermediate stages of which are unlikely to be advantageous to the organism (e.g., winged flight)?",
        "response": "The likely intermediate step was useful either for gliding (such as a flying squirrel), or as an extended jump (like a domestic chicken). Both of those are useful for quick bursts when fleeing from a predator. From there longer, more controlled, and powered flight are all beneficial improvements, but as pointed out there are examples of living creatures today that survive with pseudo-flight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our faces become flushed when we are embarrassed ?",
        "response": "Adrenaline starts pumping, therefore you start sending more blood to your brain and in some spots like your cheeks, the increased blood flow is visible! You also feel warmer ;)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the current state of Japanese historical scholarship in Japan itself?",
        "response": "> how much access do Western (English-speaking, primarily) historians have to Japanese primary sources? Are you asking how easy is it for foreign historians to gain physical access to Japanese primary sources or are you asking to what extent have Japanese primary sources been translated into foreign languages?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do two-dimensional objects (like strings) have mass?",
        "response": "I'm not familiar enough with string theory to really answer your question, but I will say that I think you're letting your physical intuition get in the way here. Mass is not a priori related to volume; that's just how we normally observe things on scales we interact with. In fact, most particle physics theories theorize that [elementary particles](_URL_0_) like the electron are *zero-dimensional*, having no spatial extent whatsoever. The electron, of course, has a finite non-zero mass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there no human subspecies?",
        "response": "A subspecies is part of the population that has distinct characteristics, and who do not generally interbreed with the main population, though they are still fully capable of it. Usually there is some barrier in place like the subspecies living on an island or on the other side of a mountain range. The reason we humans have no subspecies is because there is simply no population of humans on earth that fits that description. We are just really effective at getting everywhere, so there isn't really any group that doesn't regularly interbreed with the rest of humankind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are all the stars that we know exist and have names for within in our own galaxy? Are we able to see individual stars in other galaxies? If not, what is stopping us?",
        "response": "> Are all the stars that we know exist and have names for within in our own galaxy? No. We have identified individual stars in other galaxies, and named them. Most relevant is Variable star V1 in the Andromeda Galaxy used to determine the distance to that galaxy back in 1923. Individual stars in the Magellanic clouds are easily identifiable and some have been given designations. Designations, not really names all the 'names' like Rigel are generally in our galaxy.  > Are we able to see individual stars in other galaxies? If not, what is stopping us? Depending on the star, its brightness, its distance and the same factors for the galaxy and how crowded the area is in stars yes we can make out some stars in other galaxies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any recounts of different cultures finding dinosaur bones through history? What did they thought they were?",
        "response": "Hello, you will find some interesting answers to this question in the FAQ here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a cord still draw power when plugged in to the wall even with no device attached to it?",
        "response": "Anything using a transformer. An extension cord wont.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't both political parties just have 1 big election day to see who is the party nominee?",
        "response": "Although the voting would be simpler, it's questionable whether it would be more effective at choosing the right candidate. Think about how big the country is: a candidate can't be everywhere at once. With primary elections that are spread out, they can visit the state and campaign there before the election, and then move on to a different state. If you hold everything on the same day, then predictably the areas with the densest population are going to be the only ones to get significant attention, since that's the best use of very limited time. The campaigns aren't just for the benefit of the candidates, but also for the electorate. You want to get to know the candidates, hear about their plans, what they're going to do for you. Additionally, different people have different views on how the nomination should be run. Some states like caucuses, others prefer elections. In a way, it's simpler to let people figure out for themselves rather than have the party bosses impose one system on everyone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does 'cracking' your back (or fingers, neck, etc) feel good?",
        "response": "it causes a small release of endorphins. we know this happens, but i dont think we've figured out why yet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the advantages of being a private company vs publicly traded?",
        "response": "The biggest con of being public is that you're publicly *owned*. A private business can make business decisions without them being second guessed by the market. That's not true if you're publicly owned: they expect short term *results*. If you don't make a year-over-year gain, you may find your stock in the shitter, regardless of your profit. And when you take the steps to guarantee a short-term profit, you will find they're still quick to abandon you when the long term consequences catch up to you. Being privately owned, you have way less money, but you have complete control over your business, and there is no chance that a minority shareholder lawsuit can force you to take measures that are detrimental to your future business. Remember, public stockholders aren't vested in your business. They don't care about you. Look at what happened with Ben and Jerry's. Your stockholders will happily sell you out if there is a profit in it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do hermaphrodites have different chromosomes other than XX and XY? Do they have both?",
        "response": "There are a number of different types of chromosomal disorders that present with hermaphroditism. Klinefelter's Sydrome, for example, is characterized by a trisomy of the sex cromosomes (more specifically XXY). The patients are characterized as male, though they can be phenotypically male, female, or intersex.  That said, most disorders related to ambiguous genitalia or other intersex symptoms are hormonal rather than chromosomal, including impaired synthesis (17β-Hydroxysteroid dehydrogenase deficiency), androgen insensitivity, excess hormone production, and even inactivation of hormone receptors.  In that sense, most hermaphroditism presents with a stereotypical chromosomal karyotype (showing plain old 46 XX o XY).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how these 1950s special effects were created",
        "response": "looks like multiple exposure. This explains it pretty well : _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the flammable component of flammable liquids evaporate?",
        "response": "Yes, the spirits will evaporate. There is no \"flammable component\" to methylated spirits. Methylated spirits **is** the flammable component. It's basically just ethanol with an additive to make it undrinkable. Typically methanol, but also including isopropyl alcohol, acetone, MEK, and a few other things all of which evaporate too. You have no worries about your flooring bursting into flame.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does the digestive system keep repeating the same steps to reduce polymers into monomers?",
        "response": "You are correct, if starches were completely broken down in to simple sugars in the mouth, it would taste like having a mouthful of table sugar or corn syrup. If you take a piece of dry pasta and keep it in your mouth, you will get a slightly sweet taste after a while. Your mouth is only the first stage of your digestive tract. One of the reasons why soda and other sugary drinks are so unhealthy for you is that it causes your blood sugar levels to spike to a high concentration. Slowly digesting complex carbohydrates such as starches allow you to intake large amounts of calories in a single meal without causing such a large spike in blood sugar levels.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any accurate depictions (Movies or Books) that show the Native Americans lifestyle and or plight.",
        "response": "The short answer is yes, there are an enormous number of well-executed histories of native America. If you're interested in fiction, I would go straight to indigenous authors themselves: Sherman Alexie, N. Scott Momaday, Louise Erdrich, Leslie Marmon Silko, and so on. If you're more specific about what kind of indigenous histories you're interested in, I can give you some suggestions. In the meantime, Arizona State has a collection of syllabi from native history survey courses on their [website.](_URL_0_) There are also related syllabi [here.](_URL_1_) Several of the scholars listed there are very prominent within indigenous studies: Ned Blackhawk, Paul Rosier, and Don Fixico in particular. That should get you started with what these folks think of as the key texts in the field.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why wasn't North America discovered much earlier via the Bering Strait?",
        "response": "> Humans have always spread like the plague, and intrepidly explore and colonize everything everywhere. We managed to discover and set up shop on almost every little island throughout the Pacific, like Hawaii, which is 1000 miles from anything, at the dawn of prehistory...but no one ever manages contact between to giant continents virtually tickling each other to the north. umm... They did. We call them \"the Native Americans\" now. They got to the Americas [about 17,000 - 15,000 years ago](_URL_0_). At \"the dawn of prehistory\", as you say.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can joint pain be caused by weather changes?",
        "response": "Here's an article on the topic, [\"On the belief that arthritis pain is related to the weather\" from PNAS 1996 (pdf)](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Happy Festivius/Winter Solstice/Christmas/Yule, etc., etc.! Every year it comes up, so let's clear it up! What are the truths and myths behind Christmas?",
        "response": "Where did the concept of a Christmas tree come from? Celebrating Jesus' birthday by chopping down a tree and covering ornaments seems kinda out there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does bitcoin mining work?",
        "response": "Bitcoin mining has not been profitable for quite some time. I don't recommend it. The location of every bitcoin, and every transaction, is stored in an ever growing ledger file. Miners attempt to solve a very complicated math problem, that takes a kind of \"summary\" (Hash value) of the ledger as one input, and try to find another input such that the answer to the math problem comes out under a certain number. Once a miner solves the problem, they announce the answer, update the ledger file with new transactions, and award their own account some bitcoins. Other miners verify that all those procedures were done correctly, then try to solve the problem again with the new ledger file. The criteria for a correct answer to the math problem is changed by the developers periodically, so that on average miners find one solution every 10 minutes or so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the intention of US enemies is to further our partisanship and escalate conflicts amongst us then why on earth isn't our number one concern around unifying our country and finding common ground?",
        "response": "1. The enemies of the united states are not unified nor do they only have one goal 2. Everyone wishes we were unified and found common ground. However, nobody wants to be the one that has to change or give something up. Simply suggesting that we do something doesn't make it happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[SERIOUS] Scientists of Reddit! What are some good books or sources for a laymens like myself to learn about astro-physics and quantum astro-physics?",
        "response": "Stephen Hawking's \"A Brief History of Time\" would be a good starting point. It is written for a broader audience, like something you would pickup while waiting at the airport. It has a great overview of cosmology, and newer editions include new topics like wormholes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do brakes on cars seem to work better temporarily after it rains?",
        "response": "They don't, they've just been working worse while it rained, water lubricated the parts, and you got used to it. Then the pads and rotors dried off and your braking power returned to normal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between Bisexuality and Pansexuality?",
        "response": "The distinction is primarily political. The choice is meant to suggest that their sexuality stems beyond traditional gender binary- it's not just about liking \"men,\" and \"women,\" as separate entities, but acknowledging that gender is a lot more complex than that with a lot of variance in between. The term is inclusive to transpeople, yes, but it's also inclusive of people who are intersexed (Turner Syndrome, Klinefelter Syndrome, etc.) as well as people who have atypical gender identities.  In short, it means \"I like everybody and I don't believe that it's just as simple as \"men,\" and \"women,\".\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The United States voted against UN Resolution 2758 which expelled Taiwan from the UN and gave the permanent seat on the security council to The People's Republic of China. If America voted no, why did it pass? America has veto power.",
        "response": "I may be wrong on this, but it's because that was a General Assembly Resolution. The US only has veto power on the Security Council.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are the majority of wealthy/developed countries concentrated into the northern hemisphere of the world?",
        "response": "Look at a globe. Most of the world's land is found in the Northern Hemisphere.  In fact, not only does the Northern Hemisphere contain more land but almost every person on the planet lives in the Northern Hemisphere. Only 10% of the human population lives south of the equator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the last percent when charging your device the one that takes the most time?",
        "response": "In general, for charging batteries like lithium ion cells, there is a maximum safe voltage that shouldn't be exceeded (keep in mind batteries can hold a ton of energy, and you don't want that released uncontrollably).   This generally means that as the charging cycle comes to a conclusion, the voltage of the charging circuit increases to a constant level, and because the cell voltage increases after that, the current flowing into the battery tapers off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What factors primarily determine if a shoreline is rocky or sandy?",
        "response": "It has to do mostly with how long the waves have been washing over and corroding the rock over time. The most common component of sand is quartz, which ranks a 7 on the MOHS Scale of Hardness, meaning that the amount of time it would take to break down into sand would be significant. The longer the waves have worked at it, the finer the grains become.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what do astronomers use as a reference when plotting stars or other celestial bodies? Do they use a traditional x y z system? Do they take the earth as an origin?",
        "response": "They essentially use latitude and longitude of the earth, except with the longitude set in a way that's not rotating. The latitude bit is called declination, and the longitude bit is right ascension.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are \"redundant systems\" (like having two kidneys) actually evolutionarily useful?",
        "response": "You can have an illness that selectively damages one kidney such that you would be in end-stage renal failure if you didn't have a spare one. Also the kidney is pretty clean, you would be surprised what the body can wall off. There are cases where even a burst appendix can be contained.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we replace humans' eyes with falcon eyes and just casually see ants on the top of a 10 storeys building?",
        "response": "Because the eye has so many little tiny nerves which is near impossible to do by hand, we have developed artificial eyes for the blind which can help but we cannot make the replacement eyes work with 100% clarity. (Not even 10% as good as a proper working eye, i cannot find the article but they simulated what you would see and,sadly IMO, you kight be better off entirely blind[but ive never been blinded so it is a biased comment]) The eye contains an estimate of 120 million cones and rods which would have to be hooked up by hand to the optic nerve.  [Heres a link that shows we are progressing towards 100% clear and working artificial eyes](_URL_0_)  The other issue is even though much of wildlife looks similar, they are all vastly complicated and very often incompatable. (E.g. mantis shrimp see 120ish colors, while we see 4. So how would we develope the other 115?)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we see meteor showers some specific days only?",
        "response": "There are various asteroid \"clouds\" in our neighbourhood, but their orbit around the sun only intersects with our orbit around the sun every now and then. When the orbit of an asteroid cloud intersects that of the Earth, we can see a meteor shower. On other days, there are simply little to no meteors of sufficient size entering and burning up in our atmosphere.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Severe weather on other planets.",
        "response": "We do have dust storms on earth, but nothing compared to [Martian dust storms](_URL_13_) which can cover the entire planet for months at a time. Saturn's moon [Titan](_URL_12_) has liquid methane which rains from the atmosphere and collects into lakes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Chemistry] How do you calculate the volume of an atom?",
        "response": "An atom consists of 1) electrons and 2) an atomic core/nucleus. As you correctly state they do not have well defined positions but are instead described by a probability distribution. Instead one can use this probability distribution to define a measure of the size, i.e. one could say the volume in which there is 99 % chance to find the electrons and similar for the nucleus. When one takes the volume of the electrons defined in this way and compare to the volume of the nucleus one typically finds that the volume of the nucleus is orders of magnitude smaller, but the actual numbers will depend on the probability cut-off used to define the volume.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the acceleration due to gravity effect the frequency of a pendulum?",
        "response": "Are you sure that is what your professor said? Your intuition is correct, as the [frequency](_URL_0_) (1/period) of a pendulum does depend on the gravitational acceleration. Perhaps she was talking about a different kind of pendulum, such as a pendulum that is constrained to move completely perpendicular to the direction of gravity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were we able to film the explosions of atomic bombs? I would assume the sheer amount of force would blow any type of camera to dust.",
        "response": "Because your assumption is wrong. Notice how all the footage of atomic detonations is from far away? Thats because they don’t have unlimited blast radius. You can look at one, and film it, from far enough away that the shockwave will dissipate before it hits you. There is very limited footage from camera’s within the lethal radius, and those cameras were placed in reinforced structures, not directly facing the explosion, rather they are trained on a ‘subject’ to observe as it is destroyed, usually at an angle away from the blast.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is crying the reaction to almost all emotions?",
        "response": "Crying is referred to medically as *lacrimation*, referring to the lacrimal gland, or tear duct. While we don't understand the precise connection between emotion and crying, we do know that certain glands produce hormones that accompany specific emotional states, and emotional tears (as opposed to tears from physical irritations to the eye and surrounding tissues) contain a higher concentration than normal of prolactin, leuenkephalin, and other hormones, suggesting these hormones share some connection with the emotion triggering the response. True ELI5: Honestly we don't know, but it has to do with hormones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't I get electrocuted when I touch the metal contacts on an Apple Lightning cable?",
        "response": "Most of those systems run on low voltages—they don't have the level of energy necessary to overcome the electrical resistance of your skin (the transformer built into the power cords of most electronics is responsible for converting high voltages from wall outlets to lower ones suitable for sensitive applications like computing).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Gavrilo Princip viewed in Serbia today?",
        "response": "Although this question is likely violating the 20 year, the WWI centennial has caused some focus on the expressions of commemorations and historical memory. NPR had a good report, [*The Shifting Legacy Of The Man Who Shot Franz Ferdinand*](_URL_1_) and *Smithsonian* magazine had an article in 2000 [\"Searching for Gavrilo Princip](_URL_0_) that takes a long view of Princip's legacy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why when you look into horizontal water you see a reflection but not vertical water?",
        "response": "It's because the reflection from the surface of any medium is dependent on the refractive index of the medium, the refractive index of the medium in which the light is first travelling, and the angle of incidence. So when you're looking down on the surface of a pond, you're looking at it from a large angle, and light tends to reflect more highly at large angles. When you look directly into a fish tank, the light is entering the water at a lower angle and so it's less reflective. . . If you want more information on the physics and maths behind this, you can read up on the Fresnel relations/equations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the passage of time change when space is curve? Or, why/how is time so inextricably linked to space?",
        "response": "The answer is ultimately because that's how the universe works. This is really all science can say. We've rigorously shown via the scientific method that this model of reality is extremely accurate and precise at predicting the behaviour of the universe, but that's all science actually does. The question 'why' is a philosophical one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why after eating mint the water that I drink feels a lot colder going down.",
        "response": "Many mints contain menthol. Menthol is the chemical in mints that makes your tongue and mouth feel cold. [That's because menthol binds to a certain receptor in your cold-sensing nerve fibers in your tongue and mouth, causing the nerve fibers to depolarize, and send a signal to the brain.](_URL_1_) These nerve fibers usually only depolarize and send signals when something cold is in your mouth. But the way that menthol is shaped (it's chemical composition and structure) [allows it to bind to a receptor on the cold-sensing nerve fiber, and make the fiber depolarize](_URL_0_), in a way that other molecules can't. As for why drinking water makes the sensation more intense, I don't exactly know. I would guess that drinking water makes it easier for the menthol to get to your cold-sensing nerve fibers. But that is just a guess.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"Riemannian\" geometry and why is the geometry of space-time considered \"Riemannian\" and not Euclidean?",
        "response": "Euclidean geometry is about flat surfaces. If you draw a triangle on a flat table, Euclidean geometry can tell you the relationships between the angles and edge lengths. Riemannian geometry is about curved surfaces. If you draw a triangle on the surface of a ball, it won't have the right angles and edge lengths that Euclidean geometry would tell you. Riemannian geometry can be used to figure things out about lines and figures that are on curving surfaces. We can see that our universe isn't Euclidean. For example, we know that light travels in straight lines. But we can see that the light from stars gets bent a little bit when it passes by massive objects like the sun. The only way for straight lines to appear to curve is if spacetime itself is curved. We've done lots of experiments like this and all of them have shown that the fabric of spacetime is curved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't anti-trust laws prevent ISP's from having monopolies in certain areas?",
        "response": "Having a monopoly does not violate anti-trust laws. Anti-trust laws just govern the conduct of a monopoly, preventing them from engaging in actives to prevent other businesses from entering the market.  Natural monopolies (especially regional ones) are quite common. For businesses such as ISP's you have large degree of geographically oriented infrastructure that needs to be created, creating large barriers to entry. For any given location there simply may not be enough demand for more than one company to service that area. The fixed costs are so high, that adding a second competitor would cause both to lose money at the current pricing, which would mean it would be a disservice to the customer to artificially add a second competitor (because prices would actually go up since you are now effectively paying for redundant infrastructure).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't more African Americans move out West after the Civil War?",
        "response": "I'm having trouble finding links to any academic texts, but quite a few Western states and communities actively worked to keep African Americans from settling in them. One of the more infamous examples is the set of exclusion laws passed in Oregon beginning in the 1840s. These laws, while banning slavery in Oregon, also banned black people from settling in Oregon.  [This](_URL_0_) may not be considered a proper historical source, but it has the basic background of the Oregon situation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did \"confinement\" amongst upper class women evolve over the centuries?",
        "response": "Postpartum confinement is still practiced today in several cultures, especially China. I think the word 'confinement' is a bit off-putting to some since it isn't against the mother's will. Unfortunately, I could really only speak about the modern version of it, and not at all about the western version. Hopefully someone can address the medieval portion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In mathematics, is the order of operations (PEMDAS) a universal truth, or is it a human convention?",
        "response": "It is just convention to make notation less cluttered. Addition and multiplication are really binary operators. So to be consistent with other two-variable functions, the expression \"3+4\" should really be written \"+(3,4)\", where the symbol \"+\" is a placeholder for the two-variable function which sums its two arguments. Longer expressions get more unwieldy. For example, the expression \"+(3,\\*(4,5))\" is much more cumbersome than \"3+4\\*5\". So our convention is to write such operators differently, but then we also need a convention for the order in which different operations are performed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In programs like VLC, why does the screen freeze or show blocks when going to a random position in a movie?",
        "response": "Some video file formats, especially compressed video formats, don't contain all of the image in each frame. Instead, they contain the *difference* between that frame and the one before it -- called the reference frame and a motion vector. So when you skip into a video, you lose your reference frame, and have to wait for either the whole image to be filled back in by subsequent frames, or for the video to run into a new reference frame. It's like if I gave you instructions to get somewhere, and I said, \"Go three blocks north and two blocks west\" without telling you where to actually start -- you're lost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Buzzfeed get away legally by posting .gifs from movies/sports/tv shows when that is all copyrighted source material.",
        "response": "Fair Use provisions allow you to incorporate parts of copyrighted work (e.g. short video clips / GIFs) for purposes of critical review, journalism / news reporting, parody/satire and for certain other uses without seeking explicit permission. This protection can be afforded even in the case of commercial distribution. Not all uses of video clips from movies/TV shows are protected by Fair Use though - for example, you typcally can't just post a video clip from some random movie and then not criticize, parodize or provide commentary on said clip.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will a given tree turn the same color each Autumn? Why or why not?",
        "response": "I'm no expert, so take this with a grain of salt. The colored leaves you see in Autumn are the actual colors of the leaves, but the abundance of chlorophyll in the summer turns (almost) everything green.  Maple is typically red. Oak=yellow with orange. Popular=more of an orange. Shorter Fall days lead to less sunlight, thus less chlorophyll in the leaves. This causes the green to fade away and uncovers the actual colors of the leaves.  Eventually, the tree will abandon it's leaves...they dry up and fall off. The intensity of colors (what makes a beautiful Autumn so beautiful) depends on the levels of moisture, precipitation, and temperatures present as Summer transitions into Fall.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do new developments seem to hate the concept of the square city block?",
        "response": "It keeps neighborhoods quieter and safer by discouraging drive through traffic. It also makes surrounding traffic easier to manage, because all the traffic from that neighborhood will be coming out at fewer points.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Crime Dealt with on Indian Reservations",
        "response": "Each tribe will have its own police department, which handles most things. This is important, because on tribal reservation/trust land, city/county/state law enforcement officers will not have jurisdiction. For felonies, federal law enforcement officials are involved, typically the FBI. The reason for this is that most tribes have misdemeanors proscribed in their tribal legislation, but felonies are just handed at the federal court level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I put pressure on my eyes for an extended period of time I see really cool patterns that alternate. What is that?",
        "response": "your eye is full of liquid called the vitreous humour. when you press on your eyes, you're increasing the pressure of that fluid inside the eye; that in turn causes pressure to be applied to the nerves in the back of your eye, on your retina. those nerves get confused and start sending out random signals that you see as cool-ass patterns.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you wake up late and don't remember turning off your alarms, what actually occurred?",
        "response": "Something horrible happened here. I'll just leave this link directing you to a [past post](_URL_0_) that may be helpful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How significant to WWII was Hitler's death at the Le Gamaar cinema in 1944?",
        "response": "If the Allies had failed, Hitler's most trusted scientist, Wilhelm \"Deathshead\" Strasse, would have been able to complete his research concerning large-scale mechanical combat units and the Nazi war machine would come into world domination by about 1950. London would become occupied by a giant, somewhat implausible giant mech dubbed \"The London Monitor\" and the United States would have been nuked to a fine radioactive dust.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are guys often more attracted to much younger girls, while younger girls are more attracted to much older guys?",
        "response": "Young females are more fertile and capable of carrying a child. Older males are experienced, strong, capable of providing and protection. At least that's the very core. The outward reasoning has changed, I.e. \"I like younger girls cause they're cuter\". But our brain has a more basic reason. Unless you're talking about 20 somethings getting with the elderly. Then the answer is MONEY. Just money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How homeschooling works",
        "response": "I homeschooled my children for several years. In my area the government required an annual certified test to be administered by me and send back to the company to be scored. Then I was to keep these results on file. There was also an attendance record that had to be kept and a minimum days of attendance, (190 days annually). The government could audit you at any time but, they rarely do because they do not have the staff to accomplish such feats. There is no regulation on what is being taught or how well they do on the annual tests.  Regulations vary from state to state, for example, my mother homeschool a couple of her grand children in another state and a certified teacher was required to test them and the results of the test were turned in to the board of education. Her state being more strict on rules of homeschooling.  Many homeschoolers lobby to keep the freedom to do as they please because they want to educate with religion in their curriculum.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can sperm survive for days in the heat of a woman's body, when it needs to be outside of the man's body(in the testicles) to survive?",
        "response": "I believe the lower temperature of the testes is optimal for spermatogenesis (sperm development) but that the little dudes (once fully mature) are fine at body temperature.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "It is said that time gets slower and slower near a blackhole. Does this mean that inside the blackhole there is a point where there time does not exist at all? If something got sucked into that point, would it stop existing completely?",
        "response": "Isn't a black hole rather detrimental to one's health?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How precise can you get with GPS coordinates?",
        "response": "Yes. A technique called [Differential GPS](_URL_2_) provides accuracy down to about 10cm (4 inches) in the best case. A network of land-based stations provide correction information that allows receivers to compensate for the drift in the orbits of the GPS satellites. Receivers with this level of accuracy are [commercially available](_URL_1_) and used for things like surveying, but are prohibitively bulky and expensive for general use. The next generation of navigation systems will provide even higher levels of accuracy - the European [Galileo](_URL_0_) system is designed to provide accuracy of better than 1m for standard receivers and better than 1cm for commercial users.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why more equal societies are also more economically stable and secure?",
        "response": "They aren't, intrinsically. Just look at various Communist regimes which impose \"equality\" upon everyone, but invariably suffer from economic collapse in the end. Not to mention the fact that \"stable and secure\" can also be interpreted as \"stagnant and unchanging\". Of course, the other extreme of massive disparity isn't any better either. As with most things in life, the middle path tends to be best. Don't believe everything you read and just because a claim is made in \"an article\", doesn't mean it's accurate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it seen ok for people to earn below the wage of living?",
        "response": "Because there is much to do so Uncle Sam doesn't pay attention to the fact that people who make such little money are forced to find other (sometimes illegal) ways to make money.  It's a downward spiral for some. It's really not OK, the US govt. just hasn't really noticed. Imagine being in a position of power; you don't really live life the way everyone else does. Thus you don't have the same concerns as the general population. --- It's almost like owning a community forum and not being a part of the community. So the people who are contributing to the forum are usually more avid and knowledgeable about what goes on there. Whereas the owner is blind in that regard, and only focuses on the \"structure\" and \"integrity\" of the board in addition to the number of members and sometimes diversity.  (I ran a community forum back in the day.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we still dock dog tails?",
        "response": "Breed standards aside, docking is usually done on breeds that have very thin tails that are prone to injury. It's a preventative measure so the dog's tail doesn't get injured later in life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are cereals unhealthy on the long term?",
        "response": "Did your friend read that on the internet? Or do they have a reputable source?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In HBO's \"Rome\", Julius Caesar enrages the senate by letting Gauls and Celts become senators. This is pure fiction, right? When were people from the provinces able to become senators in ancient Rome?",
        "response": "Caesar did in fact make many Gauls and provincials citizens, and it really angered the senate and aristocracy. There was a joke at the time that Gauls would peel off their dirty cloths, put on a toga and ask \"which way to the senate house?\" In \"Rubicon\" it's argued that he does this in order to place high-ranking members of the provincial aristocracy in his debt to continue to support his establishment of an autocracy. Though other historians argue he might have done it as part of a long term plan for reorganizing the republic, since he was also granting citizenship to doctors and other highly skilled professionals who decided to move to Rome. He also might have been doing it to extend his populist reputation with newly integrated tax payers. Whatever the reason, the result was that the senate saw him as continuing to dilute their power and solidify his own claim to authority, which added fuel to the assassination fire.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people speed read, how do they comprehend it when their inner voice is talking at inhuman speeds?",
        "response": "The inner voice is called subvocalization: _URL_0_ Speed-readers don't subvocalize and you can train yourself to \"skip\" it. I'm a fairly fast reader - I've never tested it but I can easily finish an average size novel in a few hours of uninterrupted reading - and don't \"hear\" words in my head when I read. I don't read each individual word in a sentence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why would centrifugal space cylinders for artificial gravity work?",
        "response": "In space, yes, you could be near the spinning surface and not be affected. In atmosphere, though, atmospheric gases would be affected by the spin, and thus centrifugal forces, and would slowly act on you until the centrifugal force became strong enough to \"pull\" you towards the outer cylinder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are news companies like News Corp (Rupert Murdock) allowed to form such huge monopolies when they influence so many people's opinions.",
        "response": "Monopolies aren't inherently illegal. It's illegal to obtain or retain a monopoly by engaging in certain anti-competitive practices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Winston Churchill make it to the Tehran conference despite German superiority of the landscape?",
        "response": "Churchill sailed from Plymouth to Alexandria on the battlecruiser HMS *Renown* via Gibraltar, Algiers and Malta, then flew from Alexandria to Tehran via Cairo in *Ascalon*, an Avro York transport aircraft derived from the Lancaster bomber, modified for VIP transport with facilities including a bar, ashtray for cigars and an electrically heated toilet seat. By November 1943, following the invasions of North Africa and Italy, the Mediterranean was considerably more secure than it had been in August 1942 when Churchill had also visited Tehran, on the way to Moscow. On that occasion he flew directly from Gibraltar to Cairo in *Commando*, a modified B-24. [Issue 148 of *Finest Hour*] (_URL_0_), the Journal of Winston Churchill, has several articles about Churchill's extensive travels during the war.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when light is absorbed?",
        "response": "They are called electromagnetic waves. So think about light transmission the same way as sound transmission where if you put enough crap in front of it the sound will get absorbed. So the light energy is transferred to the electrons and converted into other forms of energy. Thermal/infrared for example.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is paper easily torn apart when we put it in the water?",
        "response": "Paper is primarily composed of cellulose, which is a polymer. The long chains of cellulose aren't aligned in any particular direction, so they tend to overlap each other. Nearby chains can hold onto each other via inter-molecular hydrogen bonding.    When you add water to the paper, the paper swells, soaking up the water. The water molecules soak into the cellulose and weaken or break the hydrogen bonds between the chains, pushing them further apart.   Analogously, imagine that you have a dozen people standing in a circle, trying to reach in with both hands and hold onto a small water bottle. Now imagine them trying to do this when their arms have swollen to twice their normal size and the bottle has been coated in grease.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would you still be able to see if your eye fell out of its socket? Not so any of the 'cables' were snapped but if the eyeball was just out?",
        "response": "It's called traumatic globe/eye luxation. It's actually relatively-common in some cat breeds, and my understanding is yes. Up until the point in time that the stress and inflammation causes irreparable damage to the actual parts. Bonus answer: I'm hard-pressed to explain wtf NON-traumatic luxation would be...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is cranberry sauce/jelly always canned up-side down?",
        "response": "From _URL_0_ The rounded end of the can is filled with an air bubble vacuum, which makes it easier to get the sauce out. To activate the vacuum, you simply insert a flat knife between the can and the jelly. This allows air to reach through to the bubble, and, in turn, push the contents out. What that means is the rounded end isn't actually the bottom and the cans aren't actually upside down. They're just differently designed cans.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Dothraki fear the sea before the discovery of the numerous kaiju that inhabit the narrow sea?",
        "response": "Godzilla's rampages of Dany's fleet destroyed the Dothraki's prophecies; of the Stallion who mounts the world. So that began their distrust of the sea, and the repeated kaiju landings at Slaver's Bay and other sea based cities such as Meereen both ravaged the economy and led to the widespread thalassophobia in the Dothraki.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can I trust a password manager website/app with all my information?",
        "response": "If it's \"open source,\" that means anyone can inspect the code and report security flaws. Ideally, a website is set up so that even the operators cannot intercept your data, which should be testable by looking at the source code. If it's closed-source, you don't really know what the operators are doing, so I would never trust a closed-source password manager. Of course, it being open-source doesn't mean all flaws have been discovered, either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the age 18 become the legal age? Is there a cultural reason why it's 18? (or 21 or 16 in other countries)",
        "response": "There's always more that can be said, but I answered a similar question [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A good beginner's workout routine, explained without any of the lingo commonly found on fitness subreddits that outsiders like me struggle to follow",
        "response": "For starters, you need to specify what kind of workout. That is, Weightlifting, or Cardio. Weights are used to build strength and muscle mass, while cardio is exercise that involves maintaining a high heart rate to burn calories, get in shape, and (depending on what kind of cardio you do) tone muscles. You need to determine what you want out of your workout first.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are snowflakes flat? Why not something with more depth?",
        "response": "[Under the conditions where snow crystals grow, the growth is fastest in regions where the crystals are sharp](_URL_0_). So basically, the rate at which the crystal gets thicker is much lower than the rate at which it spreads out in it's major plane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is the advantage of smartphones having all glass bodies? Is there a reason companies have been making the backs of their phones glass too?",
        "response": "They look really pretty in product shots. Makes them look & feel \"luxurious\" even though glass is of course cheap as dirt, but plastic *feels* cheaper.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a death sentence cost more than life in prison?",
        "response": "A lot of judicial process has to go through to execute someone. There's appeals and trials and whatnot. It clogs up the courts and uses the time of lawyers, judges, etc.  I assume these professionals cost more than the sustenance food they give prisoners.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't you see distant stars while in space?",
        "response": "Besides lack of brightness? Red shift. Due to the expansion of the universe, distant stars are zooming away from us. This makes their light (as it reaches us) have a lower wavelength, which makes it non-visible colors like infrared.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the earliest religion that we know about and what did they believe?",
        "response": "That depends on what you mean by \"know about\". Religious practices such as ritual burial are older than modern humans and were practiced by earlier hominid species. We don't have any clue outside archaeological observation what kind of beliefs these people had. The earliest religions that we have records of their myths and beliefs are from when people started writing (that is to say, the beliefs existed before we figured out how to record them). These are the religions of Mesopotamia and Egypt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I had a cup of 50 degree F water and a cup of 100 degree F water and mixed them, would the combination be exactly 75 degrees F?",
        "response": "Approximately yes. The total internal energy of the water would add, according to conservation of energy. If you graph internal energy per mass vs temperature, it's very close to a straight line between 50F and 100F. However, a cup of 100F water is *slightly less water* than a cup of 50F water. This happens because water expands with temperature (at least above 39F). I would expect (not looking at the tables, just guessing) that the water would be slightly cooler than 75F.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How prevalent were underage brothels in the 1890s?",
        "response": "I hope this won't preclude another answer, but I posted [an answer about The Alienist's depiction of child brothels and child sexual exploitation](_URL_0_) in a recent Saturday Showcase that might be relevant to your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[ref. request] The history of Europe for people who don't know nothing about nowhere",
        "response": "Read the Davies. It's a lot of fun...I've read it three times",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a technical reason why, on andorid phones, 180° rotation (upside-down) is not a standard?",
        "response": "Basically because people are stupid and would then regularly hold the phone upside down thinking it was right side up. Then they wouldn't find their power and volume buttons where they should be, and would cover the camera with their palm and wouldn't hear anybody while in a call because the headset speaker would be at the bottom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it okay to re-use your drink cup at a buffet but not your plate?",
        "response": "Serving utensils can touch the plate and transfer contamination back into the food source. Not so with drinks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can you use a negative adverb to make an adjective more positive? Ex: Awfully good",
        "response": "The adjectives which spring to mind - awfully, terribly, dreadfully, frightfully, fearfully, scarily - all come from words related to fright. And this, I think, is because for many things we fear, that fear is mixed with respect - we both fear and respect the mighty power of nature; we both fear and respect a large predator; we both fear and respect whatever god we happen to believe in. So the comparison is being made with that - \"He is a terribly good footballer\" literally implies that he is so good that we must fear and respect his powers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you had a million mirrors placed in such a way that each would reflect off the next one, and you stand in front of one and move, would there be any lag between your movement and what appears on the final mirror?",
        "response": "Yes. Light doesn't travel instantaneously, although it does travel pretty fast (3 x 10^8 m/s). From that speed you could calculate the lag depending on how far the light travels from one mirror to the other. The calculation would look something like: (distance from you to the mirror in meters + average distance the light travels from mirror to mirror in meters x (999,999))/(3 x 10^8 m/s) = _____ seconds of lag",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After the abolition of slavery in the US, what happened with the former slaves?",
        "response": "[Many of them were effectively re-enslaved](_URL_0_) due to the loophole in the 13th Amendment that allows for those convicted of crimes to be enslaved.  > Neither slavery nor involuntary servitude, **except as a punishment for crime whereof the party shall have been duly convicted**, shall exist within the United States, or any place subject to their jurisdiction. The cotton still needed to be picked. Plantations didn't suddenly start to work just fine with fewer laborers, and plantation owners hadn't exactly budgeted in advance for \"what if I need to start paying all 20 of these people?\" There was high demand for forced labor. Between vagrancy laws and *verb*-while-black laws, they were able to come up with a supply to meet the demand. I can't answer about schools, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the velocity of planets affect the time dilation for objects on it?",
        "response": "Technically the speed of the planet *would* have an effect on the time dilation but it would be relatively tiny; planets and stars move too slowly to notice the effects of Special Relativity (i.e. time dilation due to speed) or such effects are vastly outshined by those of General Relativity (i.e. time dilation due to gravity). To notice time dilation due to speed you have to get much closer to the speed of light than any planetary body we know of does.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the inverse square law so prominent in physics?",
        "response": "It has to do with the fact that our universe has three spatial dimensions*. When you have a field whose intensity is spread evenly over a surface (e.g. a gravitational field is the same everywhere at a fixed distance from a central mass), and the surface area of a sphere grows with the square of its radius, the field to remain evenly spread out must decrease with the square of distance.  *Trigger warning for string theorists.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people define their lives by their sexual desires?",
        "response": "Think of it as a hobby, like people having whole rooms for sewing or video gaming or something.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do organisms want to reproduce?",
        "response": "It's actually very simple. All organisms we see reproduce because we only see the ones that do. If an organism exists, someone gave birth to it, and someone gave birth to the one before, and so on all the way back for more than a billion years. If at any point an organism had no desire to reproduce, that branch ended then and there and whatever trait made them unwilling or unable to have kids was gone as soon as they were. The ones that did have a desire to have kids are the ones that passed those traits on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how many of the bright dots in the nightsky are stars and not entire galaxies?",
        "response": "Almost all of the points you can see in the sky are stars within a few thousand light-years. Some are planets, a few are actually clusters of stars (and gas), but almost all are individual stars. You can see galaxies with the naked eye, but they're faint and big. You can of course see our own Milky Way extending across the sky, but also Andromeda, and the two Magellanic Clouds. However they're very faint - they're like a dim cloudy path in the sky. If a galaxy is far enough to just be a point, it is a very dim point of light indeed, and not really visible with the naked eye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do your cells on your body stay connected?",
        "response": "There are basically a huge network of proteins on the surface of cells that tether to other cells, and help keep an overall form. Different tissues have different types, and allow for different functions. This picture demonstrates some of them. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "there is so much Media today about what future technology might be, did ancient cultures such as the Romans ever speculate either through predictions or stories of what technology they thought might be created in the future?",
        "response": "[This comment](_URL_1_) by u/publiusclodius (from the FAQ) covers differing Roman ideas about what the future would look like. Also, while it doesn't exactly address your question, you might be interested in u/mythoplokos's comment on [the Roman concept of technological progress](_URL_0_), which wasn't quite the same as ours.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was the first time an airplane destroyed another airplane in military combat?",
        "response": "Well, the first time one aircraft was used to destroy another was on September 8th, 1914 when the Russian pilot Pyotr Nesterov rammed an Austrian observation aircraft, resulting in the destruction of both and killing of all involved.  The first instance of using guns occurred October 5th 1914 when the French aircrew of Joseph Frantz and Sapeur Louis Quenault shot and killed a German pilot with carbine fire.. This also marked the first time machine guns mounted on aircraft were used to attack other aircraft, but they had used all their ammunition and had to resort to the use of their carbines to shoot at the German aircraft.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the toilet paper holder so low in many public restrooms? Wouldn't it be just as easy to put it a little higher to be more ergonomic?",
        "response": "Just a guess, but I wonder if this was to prevent people from unrolling five feet of TP, three feet in and you're either touching the ground or, if pulling it towards you, at your body  Again, complete guess",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did women become associated with witchcraft and magic rather than men?",
        "response": "Follow-up question: What caused the shift from witchcraft originally being associated with the well-read clergy toward women and social outcasts?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when we sweat in zero gravity or micro gravity situations?",
        "response": "The air circulating fans, which are needed so you don't use up all the oxygen in front of your head, blow dry air on it and it evaporates. If it bothers you, you can wipe it off with a rag. There isn't a lot of exertion in these environments, which causes NASA to put exercise machines in space to keep the astronauts fit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If less harm is done to your body when you relax your muscles before an impact, why is it that the human instinct is to brace yourself and tense up?",
        "response": "if we are thinking about the same instinct, it is to protect the weaker and more important organs like the head or stomach area. the reflex will make you put your arms and legs(if you don't need them to stand) in front of them as some kind of shield. you will also often turn away so your back faces the danger. all this moves can't be done while relaxing the muscles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a chord progression work?",
        "response": "I'd like to provide something more concise and from a different angle than the previous responses, because it seems like OP is asking about how a progression functions rather than what it is. If you don't have knowledge of Roman numerals, please see itaremeelar's post first. In western music, chords are functional. Basically, there are three functions: tonic, predominant, and dominant. Tonic is I, though sometimes vi or iii; predominant can be vi, IV, or ii (in ascending order of affinity to dominant); and dominant is V or vii. Dominant should always lead to tonic; predominant can lead to another predominant, dominant, or tonic; tonic can be used in most places. In addition to function, chord progressions are governed by \"voice leading.\" Each of the pitches in the chord are treated as voices, and there are ways of moving the voices which are forbidden in textbook theory, such as moving two voices in parallel motion at perfect fifths.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does it happen that an entire volume of data can become corrupt when the writing of only a small portion of it is interrupted?",
        "response": "In your case it seems was damaged the File Allocation Table (FAT). This file system can be read and written by a wide range of devices, but it is very fragile because of how data is arranged logically. In most cases you can fix the problem with a specialized application, like chkdsk under Windows. If you are using it only on computers, you can format it with NTFS file system. This file system is more robust.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "As life only began once on earth and we and everything around us has evolved from that is it at all surprising that it has never happened again ?",
        "response": "I've read it hypothesised that this could be because any new life would be initially far less efficient than existing life, so would instantly be pushed out and go extinct.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we photograph the milk way looking far away if our solar system is IN the milky way galaxy?",
        "response": "Most of those images are not photographs, but illustrations. We can get good measurements from various telescopes, and piece together a model of what our area of the universe looks like.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do countries improve economy? I read that China and India are going to be the next economic powerhouses. How will that happen?",
        "response": "By increasing the education level of the people, and by building infrastructure and equipment that can produce stuff, and by improving how things are organized and governed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does the the brain not register the second 'the' after the first 'the'?",
        "response": "Your brain takes in information with expectations, based on previous experience. When you're skimming through the sentence, your brain expects you to only see one 'the'. So therefore, you don't process the second one. (Or you do see it, but the brain tells you to ignore it since it's not important - based on your experience with sentence structure) This process is called [\"top-down perception.\"](_URL_0_) It explains why you can still know what a convenience store is even if it's missing a few letters. It also helps you see interpret drawings based on dots and lines.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What actually is the sine, cosine, and tangent of a triangle?",
        "response": "They are the ratio of the length of sides. Take SOH, oppostite over hypotenuse. As the angle increases, the difference in length goes to zero.  These angles have specific values and can be measured. They also scale to any size so the ratios will be the same regardless of actual lengths. Very usefull.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I bashed my head as a child I cried; as an adult I get angry and swear. When did the change occur and why?",
        "response": "Crying from pain is pretty damn useless if not to alert adults that a child is hurt. Anger on the other hand causes adrenaline and endorphin levels to rise significantly, which is useful both in suppressing the pain and dealing with any potential threats. Crying helps to relieve anxiety; it helps when we are distressed and sad. It's calming.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why would it be ok for ISPs to sell your browsing information, but not ok for the NSA to spy on your browsing information?",
        "response": "It is not ok. The people who support this do not have the interests of the consumer as their top priority.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't photons that bend with gravity violate conservation of momentum?",
        "response": "It's not violated because the bodies that bend the light experience a change in momentum equal in magnitude and opposite to the change experienced by the light.  Remember that light bends spacetime too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do waterless / flushless urinals get rid of liquid?",
        "response": "Flushless urinals are filled with oil. Oil is less dense than water and floats, so the urine sinks to the bottom and spills over the trap, on down the waste pipe. The oil provides a barrier so the urine and it's smell largely doesn't evaporate back into the room and stink the place up, and of course keeps waste gases from venting out, which is why sinks and toilets and the like have traps to begin with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the French population grow much less than England or Germany in the 1800s/1900s?",
        "response": "French were the first to develop birth control practices throughout their society. The \"pull out\" method and douching was common 100 years before it became common outside of France.  Source: Children and Childhood in Western Society since 1500 by Hugh Cunningham.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The US presidential election of 1876 had the greatest voter turnout in American history, with 81.8% of the voting age population voting. What were the factors that caused such a major turnout?",
        "response": "Follow up question. With the literacy gap in the country at the time, as a consideration, can these turnout numbers really be trusted?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does gravity effect everything at all times.",
        "response": "Theoretically, c (the speed of light in vacuum) is the maximum velocity that any interaction can propagate, gravity, light, anything.  If you were to look at [this](_URL_0_), some experimental measurements have been made that seem to suggest this is the case, although they are not without criticisms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did Vikings and other people living up north eat in these climates that are not so hospitable to agriculture, say, Iceland? Lots of fishing and hunting? Typical meal?",
        "response": "Well first off, remember that most 'Vikings' come from the habitable parts of Scandinavia, not the far north. Jutland, the coastal fjords of Norway, the more southern areas of Sweden are all much more heavily populated than anything inland or further north. These areas are all perfectly arable, have good growing seasons etc. Look at a map, Edinburgh and Aarhus are practically on the same latitude, for instance. No one asks whether Scotland is habitable -- except maybe the scots ;) -- . In terms of how those who *did* live farther North, check out [this](_URL_0_) thread for a description of the *Finna* by a Norwegian viking from the 10th century.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would lab grown meat eliminate the risk of certain diseases?",
        "response": "Not unless the lab growth process is somehow flawed. Kuru and mad cow are diseases caused by [prions](_URL_0_). Prions are misfolded proteins; I ELI5'd them in a previous comment [here](_URL_1_). They're associated with cannibalism because eating the brain of a prion-infected person infects you with the same prion disease. Simply being a cannibal doesn't mean you're going to get kuru (for example, the men of the cannibal tribes famous for kuru didn't often get the disease, because they ate the muscles while the women ate the brains). So eating lab-grown human meat won't give you kuru simply because it's human meat; it would have to have prions in it. On the other hand, it is possible that they develop a flawed procedure for growing lab-grown meat, that as the proteins grow some of them misfold into prions. That would mean a risk of a prion disease like kuru. But I would hope that such a flaw would be identified and fixed before the procedure gets FDA approval.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we chill when we are actually burning with fever?",
        "response": "There's a part of your brain that controls your temperature called the hypothalamus. When you get a fever, your immune system makes your hypothalamus change your desired temperature higher. Your body basically wants to get warmer, so it makes you feel cold. When you feel cold, you try to get warmer yourself and you shiver to move your body to create warmth. Your body forces you to feel cold because it wants you to get warm. If you felt hot, you would try and cool yourself down, which is the opposite of what your body is trying to do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the noise someone “hears” when they have tinnitus?",
        "response": "I have tinnitus. The easiest way to describe it is a very high pitches “eeeee.” Think movies where someone survives an explosion, or those mosquito noise apps on your phone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do all these buttons actually do? (Pic in comments)",
        "response": "That's a mixing board in a recording studio. It's a pretty large one. Fundamentally, it's the same as a [smaller version](_URL_0_). Each strip down the board controls a single audio input - you've got an equalizer to tweak the frequency of the sound, a volume fader to control how loud it is & probably another knob to set your left/right position of the audio. There's a few more advanced things like *effects sends* and whatnot but they're just complications.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Guy Fawkes and the 5th of November",
        "response": "Well, we set fire to effigies of him so it isn't really glorifying him. It started with anti-Catholics celebrating his failure to install a catholic monarch. I think most people would recognise: Remember remember  the 5th of november the gun powder treason and plot I see no reason why the gun powder treason should ever be forgot It's a poem that gets repeated around this time",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the appeal of the Sexual Humiliation fetish",
        "response": "Some people finds the abdication of responsibility that comes when you are being \"forced\" to debase yourself to be freeing. It allows you to indulge in \"taboo\" actions without feeling the responsibility and shame, After all, someone else is \"making you do it.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the full moon nine tones brighter than the half moon?",
        "response": "The moon is a sphere. It is lit by the sun and reflects that sunlight. So when you see a crescent moon, that bit is the bit facing the sun and the rest of the lit part of the moon is facing away from earth.  At a full moon the earth is almost right between the sun and the moon so most of the lit part is facing us.  As the main part of the moon is facing us, almost all of the light is reflected straight at us. When you have a crescent moon, the light is hitting at an angle and some hits Earth while the rest shines past us out into space. So technically, from our point of view, the moon is a lot brighter in the middle than at the edges so a full moon is more than four times brighter than a quarter moon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens with out of duty nuclear reactors?",
        "response": "The fuel is removed from the reactor and everything that can be decontaminated is removed.  All the buildings and structures outside the containment vessel are torn down or taken apart And the core of the reactor is moved to a safe place, encased in concrete and buried.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cell phone networks struggle so much in crowded stadiums?",
        "response": "Basically it's not worth investing in enough permanent capacity to serve 50,000-80,000 people for perhaps 100 hours a year (when the rest of the year a small fraction of the people will be in the area) when one can't charge them more for the additional service, and there is only so much temporary capacity that can be brought in for the game/event.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the process of supplying more cellular data to a customer on the provider's side? To companies like AT & T and Verizon have an unlimited supply of data to give?",
        "response": "There are a lot of good analogies in here, but all of them fail to mention that on the *wireless* side, there are limits. The wireless carriers buy wireless spectrum and the technology in use can only provide so much bandwidth to so many users on that spectrum. If more people want to use their cell phones than the spectrum can support, the slower it is for everyone. Remember, wireless is a *shared* medium so everyone talking to the tower has to take their turn, almost like a game of password. So the wireless companies want to incentivize you to pay more, if you want to use more data, with the justification being they'll use those profits to buy more spectrum or utilize their knowledge and expertise to increase the capacity via various engineering tricks. It's a subtle balance of making the most profit without degrading the network performance and simultaneously investing just enough to allow the network to have faster speeds and/or more customers on it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When royal/aristocratic families threw balls, how late did their guests stay? Was it a giant slumber party after the festivities?",
        "response": "What period and country are you asking about? There’s no context in your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When taking a hot shower with cold feet, why does the hot water make your feet feel \"icy hot\" for a while?",
        "response": "Your cold receptors are firing because your feet are cold. When you dip your feet in the warm water, the nerves responsible for detecting heat are then activated. So for a moment, your brain receives signals for both hot and cold, leading to the sensation you describe.  Source:medical school",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why have the planets in the solar system assumed relatively perfect circular orbits?",
        "response": "The planets have elliptical orbits. They are close to circular, but they're not perfect circles. And anyway, a circle is just a specialized ellipse with the centers in the same place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are there diet sodas with 0 calorie sweeteners, but no diet candy bars with them?",
        "response": "There are actually a fair amount of sugar-free candies. The problem is, you can't make a candy *calorie*-free. Soda is mostly water. Candy bars have a whole lot of other stuff - chocolate (which contains a lot of fat in the form of cocoa butter), peanuts or puffed rice or corn flakes (seriously, in Butterfinger), etc. You can't make those calorie-free. Also, sugar substitutes don't act like real sugar to a large degree. I could be wrong but I don't think you can make a sugar-substitute caramel.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we have any idea what prevents the massive force of repulsion between the protons in the nucleus of the atom?",
        "response": "Nothing prevents it; they **do** feel electrostatic repulsion due to each others' charge. However there's a much stronger, usually attractive force between nucleons. It's the residual strong force. This is why nucleons bind together and form nuclei.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Internet Explorer considered a bad browser? What makes Google Chrome or FireFox better?",
        "response": "Imagine your browser as a bicycle. The internet is the road. Older versions of Internet explorer were like those [penny fathing bikes](_URL_0_). It has all the major components of a bike, but its big, most of it is pointless and its a bitch for road makers to design paths for. Then firefox & Chrome came along, which were more stripped back and faster to use. Like cheezy said though, microsoft have finally learned their lesson, and firefox has gotten worse.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How has math developed over time?",
        "response": "> Avoid questions answerable by a single Google or Wikipedia search. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do salts, specifically NaCl, do chemically that inhibits cell growth?",
        "response": "It's not the salt directly, but the movement of water due to salt concentration that inhibits or destroys cells, specifically animal (eukaryote) cells. The osmotic movement of water out of a cell, due to a high surrounding osmolality, causes dessication. Besides being an integral part of the physical stability of a cell, water is required in many different metabolic processes needed for survival and growth. So, in short, it's not the salt per se, it's the effect it has on cellular water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are we aware of any \"impending doom\" asteroids on an eventual collision course with Earth?",
        "response": "There's a listing of [potentially hazardous asteroids](_URL_0_), and you can sort them for those coming [within 0.05 AU of the earth from the start of this year through 2178](_URL_1_). If I'm reading this right, Apophis is the closest, coming within 0.0002644 AU (about 25,000 miles) in 2029. [NASA has another risk table](_URL_2_).  So no, none are known to be on a collision course yet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When and how did we end up with a system where the people vote for presidential candidates rather than state legislatures or the people voting for members of the electoral college?",
        "response": "Hi, hopefully someone can drop by to address your specific questions, but fyi there have been several discussions about the electoral college recently; this one is a good starting point  * [Question about the electoral college](_URL_0_) featuring /u/uncovered-history",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't all police officers required to wear cameras which record their point of view at all times on their person?",
        "response": "I think this should definitely be enforced. I know I would feel alot safer during a traffic stop or random encounter. I found an article that said Rialto Ca, police department implemented a policy in February 2012 that all of their officers wear required to wear a lapel camera. Complaints against officers dropped 88% compared to the previous year, and officers use of force dropped 60%. Also those who were drunk and agitated became more polite when they were informed they were being filmed",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was socialism before Marx?",
        "response": "This will be rather short, excuse me for that. Other posters have already touched upon the actual question you asked. But I think I can clear up some confusion about what you mentioned about that book. Walter Ulbricht was a member of the Social Democratic Party of Germany in the 1910s. In modern Germany they are like any other social democratic party, back then they were mostly democratic socialists. Their previous name (until 1890) reflects that - social democratic workers party of Germany. Ulbricht was part of the left wing in the party though. That's the party wing that split off after the war, first forming the USPD and then the KPD (communist party of Germany). He joined the KPD in the early twenties. So I think what the author of your book tried to convey was that Ulbricht started politics as a socialist in the SPD and then became an important figure in the Marxist- communistic KPD after the war.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Siam not colonised by Britain/France when all surrounding countries were?",
        "response": "The short answer is that Siam was used as buffer state between British controlled territory (Burma and Malaya) and French controlled territory(Cambodia, Laos, Vietnam). Even if Siam is not colonized it had to cede significant territory to the British (Trengganu, Perlis, Kedah and Kelantan) and the French (Siem Reap, Preah Vihear). Siam also quickly modernize itself (similar although not exactly the same with Meiji restoration in Japan) to face the threat of colonization, most importantly by strengthening its control toward periphery border areas. So it is basically a mix of geographical luck, being sandwiched by two most powerful colonial power on Earth, capable monarchs and diplomacy with willingness to sacrifice territory for independence. There is already [this thread for further discussion](_URL_0_). [This book](_URL_1_) presents further information on the issue of colonization in Southeast Asia.",
        "source": "sentence-transformers/eli5"
    }
]