[
    {
        "query": "When an body part is removed and reattached how do the nerve fibre ends find and reconnect to one another?",
        "response": "In addition to surgical intervention such as ryashpool mentioned, your nerves can regrow themselves at the right locations. Simply put: your nerves are surrounded by supporting cells (called glial cells) that will form a kind of protective channel through which the axon (the long \"information highway\" of the nerve cell) extends. If the axon is damaged at some part of its length while the soma (the body of the nerve cell, where the nucleus is) remains alive, the axon can grow back, and it will grow along the path that the glial cells are keeping open for it, until it reaches the end. There are other details (this works only in the peripheral nervous system, which is why the brain and spinal cord don't recover so well, and the PNS glial cells are mostly [Schwann cells](_URL_0_), in case you want to read more about them). And if the damage is too extensive, the process won't happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some retailers put a quantity limit per purchase for an item? Wouldn't they want to sell as many as possible, regardless of who the buyer is?",
        "response": "They want to make you think that those coins are such a good investment that people are lining up for them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the real estate market adjust to prevent abandoned buildings?",
        "response": "If the property hasn't been properly cared for, it will likely cost money to repair. Demolishing a building and rebuilding also costs quite a bit. In either case, if this cost exceeds what the potential buyers believe they'll get out of the investment, nobody will buy the property regardless of purchase cost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What in the brain typically causes a mentally unstable person to yell/mutter/talk with themselves or an \"invisible person?\"",
        "response": "Think about it like you have one of these mental disorders, not like someone looking at another with a mental disorder. People with say, severe schizophrenia, may actually not be yelling at an \"invisible person.\" In there mind, that person or voice or whatever they are seeing or hearing is actually there and so they are responding to things that they actually see or hear. You can almost think of some of this as a conversation in your head that spills over into physical talking.  What causes this? that's not fully understood right now, a chemical imbalance in the brain, as well as differing structures in the brain of people with these disorders from what we would consider a normal brain. there are much deeper explanations of these disorders. [here is the mayo clinic explanation of schizophrenia](_URL_0_) obviously there are other disorders which I completely ignored, and I appologize.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do red ants bite but black ones don't?",
        "response": "So this question needs more info before anyone can answer - many \"red ants\" don't bite and many \"black ants\" do.  In general, different species of ants do or don't bite or sting. Some are too small to bite people, others can bite but it's basically painless. Some are actually wingless wasps, and hurt like fuck",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some bank tellers have to stand behind a glass wall?",
        "response": "Usually a rule implemented in high risk areas for security reasons Source: my wife is a banker",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't spyware/adware illegal?",
        "response": "Because you agreed to the terms of the software when you installed it.  Wait, you mean you clicked \"Accept\" without actually reading what you were agreeing to?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come FanDuel and Draft Kings are legal, but online poker is not?",
        "response": "Because the law banning US banks from allowing money transfers to online poker companies specifically exempted fantasy sports as gambling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for new types of sailor's knots to be \"discovered\"? Or have the common ones been around for hundreds of years?",
        "response": "The common ones have been around for ages. They are the most efficient and easiest to tie. There're four main types of knots: Bend - ties two lines together; Hitch - ties a line to another object; Loop - creates a loop in the rope; and stopper knots, which basically just make the line thicker. The most efficient form of each of these knots has been known for a long long time (Reef knot, clove hitch, bowline, figure-eight, respectively). There's other, more complicated ones for more specialized tasks, but these four are easiest to tie, have been around longest, and are the most often used. Knots used outside of sailing, that have specialized tasks can be considered newer. For example the [Prusik knot](_URL_0_) was \"invented\" in the 20^th century. TL:DR: New knots can and have been invented recently, but the most often used, best knots have been around forever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come I can remember a certain moment from my childhood, yet I can't remember a maths equation I learned today?",
        "response": "You have two forms of memory - short-term and long-term. The first is far from perfect but can get better with the proper training. So just after you learn it, your math equation is in short term memory. When you sleep, some of the long-term memories are created from the short-term memory experiences you had during that day, particularly when it really stood out. (For example, an afternoon playing will likely not be as long-term memorable as a trip to Disney). But if you got swamped with new information that day, not everything is permanently written down and so you forget some stuff like your equation. When you're younger and learning lots, you're pretty good at this conversion process, so many long-term memories exist and can be recalled well into adulthood. But the short-term ones that didn't get transcribed into long-term form are lost, just like that equation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that the United Kingdom is known for having bad teeth as well as free healthcare?",
        "response": "Imagine if botox injections starting from age 30 became so common in South America that eventually it just became natural, that nobody ever questioned it. South Americans would start to stereotype North Americans as being wrinkly, and someone might go on the Reddit of the Future to say \"How is it that the Yankees and Canadians are known for being so rich yet untreated and wrinkly?\". Only instead of South America and North America, it's US and UK, instead of wealth it's healthcare, and instead of botox, it's bleaching and braces. It isn't that they have *unhealthy* teeth (they actually rate fairly highly in that regard, as I recall). It's that what Americans (and lately some other nations) consider obligatory and normal, they consider -- or considered, at least, when the stereotype began -- cosmetic surgery, not something you usually give to teens. There are even some stereotype-jokes from old Australian things that play the reverse (\"Oh those vain effete Americans, even their *men* wear braces!\").",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do baby birds breathe inside their eggs?",
        "response": "Directly under the egg's shell are two membranes. When the eggs are laid by the mother they’re very warm, and as they cool the material inside the egg shrinks a little bit. The two membranes pull apart a little and create a small pocket or sack of air. As the developing bird grows, it breathes in oxygen from the air sack and exhales carbon dioxide. Several thousand microscopic pores all over the surface of the egg allow the CO2 to escape and fresh air to get in. Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did certain creatures of English folklore (orcs, elves, and lichs) differ from their interpretation by 20th century Fantasy authors?",
        "response": "Quick note: Orcs are creations of J.R.R. Tolkien, not a part of the English folklore. More specifically the name 'Orc'. The other name for orcs is goblins. (Orc is elvish)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Current Australian politics and why we appear to have no good contender for the next federal election",
        "response": "Here's my understanding of the current climate in as simple terms as I can muster. The last election didn't result in a clear majority for any party. Thus, Labor, Greens and a few Independents banded together to form a government. In some respects this is good because more ideas and opinions are represented. On the other hand, some people (mainly Tony Abbott) say this complicates the decision making process. What makes things so tense is that the Independents can change their support at any time, which would really up-end the tea-table. I'm not sure how to answer your second question, but I hope I've helped.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to a company after it files for Bankruptcy?",
        "response": "there are 2 general kinds of business bankruptcy - liquidation and restructuring in Liquidation, your business is basically a complete failure. The court usually appoints someone to come in and shut down the business, handle all the employee exits, sell the remaining assets, etc. The company ceases to exist and any execs and board members just walk away. Some execs may continue to get paid as if they're needed in order to settle the affairs in an orderly fashion in Restructuring, the business is in bad shape but is still viable. The management of the company usually presents a plan to the court to pay off debt, sell assets, reorganize, etc and get the business back on its feet. If the court accepts the plan the management will execute it under court supervision until the bankruptcy process is complete. The execs and board members may stay or may be replaced as part of the restructuring.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If seemingly nobody agrees with the current drinking age of alcohol being 21 in the USA, why is it still illegal and taboo?",
        "response": "It's a cultural thing. America had a strong temperance movement wich lead to the prohibition. This was later removed again but drinking was still seen as problematic by many so they made this strict age limit. If really a majority was for a reduced drinking age, and would be loud about it, it would get changed. I imagine if politicians tried to the outrage by \"protect our children\" activists would be stronger than any current movements for reducing the age (are there even any?) Same why cannabis isn't widely legalized even though experts agree that it's not more dangerous than alcohol for adults.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Laser spot on the moon -- is it faster than light travel?",
        "response": "You haven't really transmitted information from A to B in this case. Base A can't encode anything into the signal that will be received by base B. What if the computer at base A fails to turn on properly? That doesn't become part of the signal received by B. You've really just transmitted a signal from the Earth and inferred from that that the computer at A *should* be on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the biological reason for female orgasm?",
        "response": "During the female orgasm, the uterus and cervix clench down into where the ejaculate would hopefully be, thus aiding the collection of semen into the cervix and thence as an aid to fertilisation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does carbon dating work in space?",
        "response": "1. Carbon dating could work on other planets 2. You cannot carbon date the moon First of all, carbon dating (C-14 that is) only works for ages up to some 50000 years. It degrades to fast to date anything much older. Secondly, Carbon dating works because the C-14 levels in our atmosphere are kept constant by cosmic radiation which generates C14 in the upper atmosphere. Once Carbon is incorporated into an object, no \"fresh C-14\" is provided and the C14 levels decay. By comparing them to the levels in the atmosphere you can estimate an age. This would also work on other planets provided that the concentration in the atmosphere stays constant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for a shape to have rotational symmetry of order n, and m lines of symmetry, with 0 < m < n?",
        "response": "This is indeed impossible for bounded figures. A planar figure that has rotational symmetry of order n belongs either to the point group C_*n*_ (if it has no reflective symmetry) or the group D_*n*_ (if it has reflective symmetry). There are no 2D shapes which don't fall into one of these groups. The group D_*n*_ is defined to have n lines of symmetry, so planar figures either have no axes of reflective symmetry, or as many axes as their order of rotation. See [here](_URL_0_) for more information.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How \"efficient\" is a supernova?",
        "response": "I'm not sure what you mean by \"efficiency.\" During nuclear reactions (fission, etc) mass is being converted to energy at the rate governed by Einstein's famous equation (E=mc^2), so if you mean efficiency in terms of amount of mass destroyed per unit of energy produced, they should be equally efficient.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is hydrofluoric acid considered a weak acid if it is as dangerous as it is?",
        "response": "how \"strong\" or \"weak\" an acid is , is based on how well the H dissociates from the conjugate base. In the case of HF the conjugate base is F-.  HF is a weaker acid than HCl because it does not dissociate as well. The reason that HF is such a strong acid is because the Flouride ion, F- is HIGHLY reactive. So in this case the reactivity comes from the Flourine rather than the acid which is H+",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what would happen if everybody in the U.S. decided to withdraw their money from banks at the same time?",
        "response": "The banks would run out of physical cash and a freeze would be put on withdrawals to prevent a run on the banks. Of course the chance of such a thing happening is extremely remote.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How large of a role does Marxist methodology/historical materialism play in how a modern historian works?",
        "response": "You may be interested in a number of our 'Monday Methods' posts by u/commiespaceinvader that discuss the ways modern historical methods use some marxist (or marxian) analytic tools while not necessarily adhering to the Marxist Philosoph of History. These include: * [Marxism and Hegemony](_URL_2_) * [Gramsci and Hegemony, Redux](_URL_1_) * [On Great Man Theory, Trends and Forces Theory, Capitalism, Socialism and a general history of how we write history.](_URL_3_) * [\"Not the mere accumulation of knowledge but the emancipation of man from slavery\": The Frankfurt School, Critical Theory, and critical theory](_URL_0_) * [A closer look at E.P. Thompson and the Making of the English Working Class](_URL_4_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What purpose does hiccuping serve? Bonus round: why does breathing in a bag cure it?",
        "response": "They're involuntary spasms in your diaphragm due to gas or air bubbles often. The large majority of the lungs are considered smooth muscles so often taking control of that and making several deep breaths can often help. If they continue for a long period of time, they can be related to several different medical conditions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many people have bad vision?",
        "response": "Because poor vision is largely a result of some environmental aspect common to the developed world. It's thought that spending more time indoors-and getting less sunlight- as a child is the cause. Rates of nearsightedness are much, much lower in preindustrialized countries. We never evolved to deal with nearsightedness because we rarely experienced it until the last few generations. Here's a good NYT article, but I've seen this discussed elsewhere: _URL_0_ There's not always a direct evolutionary reason for why things are the way they are--and traits certainly aren't always due to natural selection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why am I paying for Highspeed Internet with a speed of 20 mb/s Download rate, but when I go to download something, it says I am only getting 1-2 mb/s?",
        "response": "You might be paying for 20mbps, while your download rate is measured in mBps. Bits versus Bytes. A byte is 8 bits. So if you are paying for 20mbps, you might expect a maximum data transfer rate around 18mbps (you never quite get what you're promised, plus overhead, rounded to make the following math easier). 18mbps is equivalent to 18/8= 2.25 megaBYTES per second.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Thanksgiving is upon us. How can meat temp continue to rise after being removed from the heat source (aka carry over heat)?",
        "response": "The heat comes from the outside of the meat. A turkey (continuing the Thanksgiving example) is a huge chunk of mass, and the oven does not heat the entire mass evenly. The outer layers absorb the bulk of the heat from the oven, and it is then carried by (mainly) conduction and (slightly) convection through the rest of the meat. When you remove the turkey from the oven, the outer layers are going to be much hotter than the center, and this conduction and convection is going to continue until the entire mass is close to the same temperature. Therefore, if you wait until the center of the mass is as hot as you want it to be, when you remove the external heat source you will have the center at temperature T and the outside as T+N, where N > 0, and when the meat rests it will equilibriate until the uniform temperature of the meat (TU) is T < TU < T+N.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "10 people draw one card each. Whoever draws the lone black card will die. No one reveals their card until all have drawn. You get to choose the order of the draw. Do you draw first? Last? Or does it not matter at all?",
        "response": "First guy has 1/10 chance of drawing the black card. Second guy has 1/9 chance of drawing the black card but only if the first guy didn't (9/10).  9/10\\*1/9 = 1/10. Third guy has 1/8 chance of drawing the black card, but only if neither the first nor the second guy drew it (9/10\\*8/9).  9/10\\*8/9\\*1/8 = 1/10. Etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does thermal radiation move as a particle similar to how light moves as photons?",
        "response": "Thermal radiation is light in the infrared region, so it is made up of photons just as visible light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are items (ie- aspirin, band aids, and other cheap med stuff) so outrageously expensive when received through a doctor or a hospital? Is this why insurance costs so much?",
        "response": "Its a vicious circle caused by people being uninsured. Hospitals, specifically emergency rooms, can't turn people away from receiving care, whether they are able to pay or not. When somebody has an expensive surgery, they don't have insurance and can't pay, they usually file for bankruptcy, and the hospital eats the cost. BUT hospitals are privately run, and they need to make their bottom line, so they charge more for little things, which the insurance company pays. Basically, the people that have insurance are paying for the healthcare of the uninsured.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are airport runways repaved?",
        "response": "They don't need to close down the entire airport. Usually airports have more then one runway. So they can close off just that one for as long as nessecery.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do people that work at reddit do?",
        "response": "Victoria was a fairly unique case, as instead of dealing with software or hardware, she worked with people. Victoria's job was as a liaison and organizer for AMAs. When Victoria was suddenly fired, AMA subreddits were left without organization and communication for AMAs.  Other Reddit people are Admins, who do higher level administration (kinda super mods), IT guys, who deal with Reddit's inner workings, and money people (accountants, etc.). There are various jobs that are needed to make any company run smoothly, and titles such as CEO as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who invented the months of the year and when?",
        "response": "This gets asked here a lot -- [check out this section of our FAQ](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does wind chill effect how we perceive temperature, but it doesn't change what a thermometer reads?",
        "response": "Wind chill is basically when the wind blows away the air that is warmed by our bodies. Thermometers are not warmer than their environment, they are in thermal equilibrium with their environment, otherwise they wouldn't work. So there is no local excess heat around a thermometer for the wind to blow away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there such a thing as space coordinates?",
        "response": "There aren't any absolute coordinates in the universe. However, you can broadcast our location relative other parts of the universe. For example, if you wanted to send a message within our [local group](_URL_1_), such as communicating our location to a civilization in the Andromeda galaxy, you could send our galaxy's location relative to others in the local group, [like this](_URL_0_). Then you could include a second message communicating our location within our own galaxy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the ultimate fate of all the lead in tetraethyl lead added to gasoline during most of the 20th century?",
        "response": "A lot of lead was rained out into the oceans which are slowly ingesting it. The primary delivery method is by rainfall and the atmosphere only carried the lead for a few days so most of it is in the northern hemisphere (where the sources were) and less in the southern hemisphere.  I'm not sure how the budget of oceanic deposition compares to terrestrial. The differing isotopic signatures of lead used in the USA vs. Europe allow the relative impact of each area to be separated.  See: * [*Thermocline ventilation of anthropogenic lead in the western North Atlantic* ](_URL_1_) * [*Lead from gasoline discovered in Indian Ocean* ](_URL_0_) * [*The Global Anthropogenic Lead Experiment*](_URL_2_) [Powerpoint PDF]",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come mammals are the only animals that produce milk? And not other animals (such as birds, fish, reptiles, amphibians, etc)?",
        "response": "The assumption your question is based upon is not 100% accurate. There are other animals that make \"milk\" for their young. This article has an example: _URL_0_ So it seems that there is a bit of convergent evolution going on in regards to \"milk\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How doesn't entropy break the law of conservation of energy?",
        "response": "Conservation of energy is not related to time **reversal** symmetry, it's related to time **translation** symmetry. So while entropy increasing seems to provide a physical difference between \"forward\" in time and \"backward\", that doesn't imply anything about time-translation symmetry violation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some languages have conjugations and others not?",
        "response": "There are conjugations in english it's just not as easily noticeable. A good example is ''to be''. Another example is that you would I say ''He sits'', not ''He sit'' (Unless you use the subjunctive, in which case it is ''he sit'').",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would a blindsight patient with synesthesia \"see\" things via auditory/gustatory/tactile experiences alone?",
        "response": "Possibly. Seckel & Ramachandran (2013) report that some synaesthetes process things in ways that allow them to jump up the visual pipeline and draw a direct comparison to blindsight processing, suggesting that the underlying mechanisms are shared. **References:** Seckel, E., & Ramachandran, V. S. (2013). Blindsight: enhanced visual puzzle-solving and memory in synesthesia [Abstract]. *Journal of Vision*, 13(9), 1326-1326.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's stopping us from harnessing the energy in lightning?",
        "response": "Energy storage We simply have no way of storing the concentrated power but short duration involved in a lightning strike.  People have imagined capacitor storage banks, heating piles etc. but as yet we have not created a technology that can store that energy quickly enough Any other method of storing energy in present usage i.e. batteries, hydrogen, hydro etc. are *incredibly* slow in comparison. There are a great many other considerations like unpredictability, distribution etc. but essentially ....  .... storage",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some things burn and others don't?",
        "response": "Things that burn have a chemical structure that allows their molecules to form simpler, energy-stable molecules in a chain reaction that is started when heat energy is added.  The heat provides the energy for the more complex molecules to form less complex ones. When they change, the new forms requires less energy to hold together. The extra energy is released as heat and light. The heat causes the same reaction in remaining complex molecules. This happens until the fuel (complex molecules) is exhausted. Normally when we think of burning, we mean combustion. So, usually the more complex molecules are hydrocarbons and the less complex molecules are carbon dioxide and water, with residual ash and smoke being released due to incomplete conversion. Also, O2 is a part of the process.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you hypothetically knew every single initial variable at the time of the big bang, could you predict the fact that I'm typing this question right now?",
        "response": "the probabilistic nature of quantum mechanics would indicate no",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't cab companies just adopt the tricks that make uber so popular?",
        "response": "Everyone keeps talking about the Uber drivers and how Uber doesn't have the same over-head for employees as a regular cab company does, but what does any of that have to do with this? Uber isn't popular because of any of that. Uber is popular because it's super easy to get from where you are to where you want to go. Why can't the cab companies update there dispatching system to work with an Uber style app?  If the experience of getting a cab was the same as getting an Uber, then they could compete on price. I suspect the cab industry, because of the medallion system, was lazy and got caught flat footed. Instead of innovating, they assumed the high barrier to entry of the medallions would protect them, and now it's plain they were wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does flour and other powdery things clump when water is added?",
        "response": "Inside those clumps is dry flour. The surrounding flour holds the water tension creating the clump. Thats why you have to mix the flour thoroughly in order to break the water tension in each indivual clump. EDIT: I had used the wrong spelling for the word \"tension\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Islam seem to have more violent fanatics than other religions?",
        "response": "Your question is probably gonna get downvoted to hell, but I have heard from a Muslim friend of mine that parts of the Quran actually encourages the killing of non-believers.  But like most religion, including Christianity, the holy book contradicts itself, and other parts of the Quran actually promote peaceful coexistence with those of other religions.  I'm assuming since the killing of non-believers is mentioned in the Quran, the Islam extremists tend to lean toward violence. Most other major religions don't have a violent message that I know of, so extremists of other religions tend to exhibit less violence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the Aral Sea?",
        "response": "A rapid increase in the amount of water diverted from the two rivers which are the primary sources of water for the Aral Sea (the Amu Dar'ya and Syr Dar'ya) for irrigation purposes starting in 1960 led to a dramatically declining water balance (i.e. a lot less water flowed in than evaporated out). This decrease in inflow has led to the rapid shrinking of the Aral sea. This [review paper](_URL_0_) lays out the basics nicely.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people with type 1 diabetes need to eat sugar if their pancreas still releases glucagon which releases sugar back into the body?",
        "response": "It's not glucose that the body needs, it's insulin. Which the pancreas no longer produces and why people w/ type 1 diabetes need to take insulin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do humans get headaches? Is there a sole reason or is it a combination of factors? And does the factor(s) also cause migraines?",
        "response": "The exact mechanism that causes headaches isn't/aren't yet fully understood. All we know is that there are many known factors that can trigger it. Like blood vessel constriction/dilation, and a change in hormone levels. (And that's also why more women suffer headaches than men.)  Certain patterns of brain activity have been found to trigger blood vessel constrictions, which will reduce the oxygen supplied to the brain. Consequently, the blood vessels dilate and some chemicals that cause inflammation are released. The nerves nearby have pain sensitive endings and these can be triggered by that, activating the pain centres in return.  As for migraines, we are less familiar wih how they work but apparently have something to do with the constriction and dilation of blood vessels too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will we ever be able to tell if the reality we perceive is actually real ?",
        "response": "Like many interesting hypotheses, the idea that we are in a constructed/simulated universe might be proven under some circumstances, but can never be definitively disproven -- we may remain in doubt forever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did it take so long for the concept of zero to be discorved in some parts of the world?",
        "response": "Well, it’s not really a concept that’s as simple as it seems to us now that we have it.  In almost every context that matters for ordinary life, numbers are used relative to a certain count noun. There are three sheep. There are two dogs. There is one shepherd. And so on.  But think about how weird it is to say that there are some number of things when the number of those things is zero! “Are there some number of sheep here?” “Yes!” “Oh, strange. I don’t see any. How many are there?” “...Zero.” The utility of the concept of zero only becomes apparent when you are dealing with numbers as abstracted from any particular case. And not every society developed such an abstract understanding of numbers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I am a medevial european. How do I view inbreeding amongst humans and how big is the chance that I will marry a relative, with or without knowledge (cousin, or even closer)?",
        "response": "At least with respect to continental Europe, there were fairly clear rules about the degree of relationship (Consanguinity) within which marriage was allowed. At first that followed Roman civil law, prohibiting marriages any closer than first cousins. In the 9th century this was expanded to 7 degrees, so anyone up to and including a sixth cousin was prohibited; the 4th Lateran Council changed it back to four degrees (in 1215). So cousins, depending on your period; siblings, no. If it was done without knowledge, it was grounds for annulment. C. Bouchard, *Those of My Blood: Creating noble Families in Medieval Francia*, 2001. J. Brundage, *Law, Sex, and Christian Society in Medieval Europe*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far away from a television would you have to sit before the sound started lagging behind the picture?",
        "response": "Audio latency becomes noticeable at about 30ms. This is generally the high end of acceptable latencies for audio recording monitors.  The speed of sound at sea level, dry air, at 20 degrees C is about 342 m/s. That means you have to be sitting 10 meters away, or about 34 feet. Intuitively, this makes sense to me -- think about sitting at a concert. At the back row there's a definite and distinct delay between audio and visual. The delay gets shorter as you move closer, but it's still detectable, ever so slightly, even at 35 feet away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Whats the difference between compact bones and spongy bones?",
        "response": "Compact bone is found around the shaft of long bones and is made of concentric rings of bone with no red marrow between it. It is strong against compression and within it contains the marrow cavity with bone marrow in it.  Spongy bone is found within the heads of the long bones, and in flat and irregular bones. Instead of concentric rings, they have bony shelves in a spongy meshwork called trabeculae and red marrow surrounding it. It is weaker to stress than compact bone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are multi-level marketing companies like Vemma legal and not considered pyramid schemes?",
        "response": "Honestly, I think they are WORSE than pyramid schemes or Ponzi schemes. For one because they prey on naive, desperate or vulnerable people like high schoolers and college students who can't find jobs and have no money. But what's even worse is that they push some kind of product as their only link to legality, and usually this product is some way-overpriced health supplement based on faulty science or pseudoscience that offers no real benefit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what point does a vacuum start allowing the formation of virtual particles?",
        "response": "> Or are they always popping in and out of existence but it's just easier to detect when we have a near perfect vacuum? That's correct.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are all medicines that relieve pain also reduce fever?",
        "response": "You're thinking specifically of NSAIDs, which tend to be antipyretic (fever-reducing) as well as analgesic. These are medications like paracetamol (acetaminophen), ibuprofen and aspirin.  Unlike stronger pain relievers such as opioids (e.g. morphine), these don't actually work on the brain to reduce pain. They act by reducing pain transmission to the brain at the site of tissue damage. They do this by inhibiting an enzyme called cyclooxygenase, which acts to produce chemicals known as prostaglandins.  One thing prostaglandins do is produce inflammation at sites in the body where tissue has been damaged. The inflammation is what causes the pain. So by reducing prostaglandins you reduce inflammation and hence reduce pain. Another thing prostaglandins do is act on the hypothalamus' thermoregulatory centre, causing a high body temperature.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do chips stay crunchy in the bag, but once opened, become soft?",
        "response": "They are packed under a controlled atmosphere: very low humidity, very low oxygen content normally. This prevents staleness and loss of flavour. _URL_1_  A German company tries to do the same for shipping containers to keep meat and fruit fresh for longer: _URL_0_ That's how I knew about the technology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Correlation vs. covariance difference?",
        "response": "the Pearson correlation coefficient is just the covariance normalized to a -1 to 1 scale by dividing it by the product of the standard deviations of the two variables. It's basically a more convenient and quickly understandable way to understand the relationship between two random variables compared with covariance. Your point two points to precisely why we use the correlation coefficient: It's difficult to make sense of precisely what covariance means because part of the information involved is how disperse each of your two variables are on their own, which isn't really important for considering how they're correlated. Covariance is, of course, part of correlation so even if the only thing we ever wanted to do was measure the correlation between things, we would still need to calculate it. That said, covariance makes its way into tons of other formulae in statistics because it's how we actually measure how two variables move together.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do people mean when they talk about keeping same-sex marriage out of education?",
        "response": "It means same sex marriage, and homosexual relationships in general are not part of the school curriculum. There are two main justifications for this: * Homosexuality is immoral, and should not be presented as \"normal\". * Young children don't need to be exposed to every variety of sexual relationship. When we teach nutrition, we don't confuse them with the vagaries of vegetarian, vegan, kosher, halal, low carb, and gluten free diets. We present them the most common diet, and let their parents supplement their knowledge as necessary. Similarly, we should present them with the most common relationships instead of ticking off every possible variation. The first argument most people dismiss as bigotry. The second has some validity, but is often of an excuse people who agree with the first use to seem more reasonable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a candle burns, where does the wax go?",
        "response": "The long chain hydrocarbons that make up the wax are burning. They then turn into mostly water vapor and carbon dioxide, plus some soot and miscellaneous products of incomplete combustion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "'Earworms' are where a song gets stuck in our head on a loop - I end up knowing all the words to pop songs even if I try to avoid them. Is there a way to harness this phenomena for good - like learning a language?",
        "response": "it worked for me. I know 99 luftballons and völlig losgelöst by heart",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can elementary particles produce heat alone? How about adding more?",
        "response": "Heat, thermal motion, can exist in any system with many particles. In normal material, the particles are molecules or atoms, but one can also talk of the temperature of a \"photon gas\" if you want, or electrons, or of a Quark-Gluon Plasma (the hottest stuff ever made on the planet. So hot, no where else in the galaxy is likely to have any unless there are other aliens out there making some in their laboratories).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to burn calories without increasing the heart rate? Also, why does resting heart rate tend to go down the more \"in shape\" someone gets?",
        "response": "You are always burning calories. The moment your body stops burning them, you die. What you're asking is can you burn more calories without raising your heart rate. This relates to your second question. The better shape you are in, the more calories your body naturally burns even while your sleeping. Specifically, muscle burns more calories than fat does. So in that sense, being in shape allows you to burn more calories without increasing your heart rate. The better in shape you are, the lower your resting heart rate is as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are bugs attracted to light?",
        "response": "Actually, you're wrong. The bugs that are attracted to the lights in your house do spend their time flying toward the moon. However, they will never reach the moon and smack into it over.. and over.. and over.. Those bugs have very basic eyes and very basic brains; they use the moon as a rough navigational aid. The trouble comes when you have something else as bright as / brighter than the moon at night, within smacking-into distance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do metal pipes, say copper, which have pressure fluctuations over long periods of time, eventually work harden and become more brittle?",
        "response": "In theory, when you are using a material, you're going to have it operate in the elastic region of deformation. So under a simplistic model, it will not work harden because you're not operating it in a regime with plastic deformation. however, this disregards 'fatigue^1 ', which is often seen in cyclically loaded materials (even if the cycle stays within the elastic region). On the microstructural level, there are sometimes stress concentrators (e.g. inclusions, microcracks, etc) that can cause local stress to be high enough for plastic deformation. After many cycles, these stresses can cause cracks to grow and ultimately failure. An example of research in this area is the metals used in heart stents (e.g. Nitinal). They have a high strain and need to last a whole lot of cycles (heartbeats), and fatigue is a big issue! I don't know the answer to how long powerlines last, but in general, fatigue failure is an important aspect of material selection and design choice. [1]_URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the sound you hear when you put a clam to your ear?",
        "response": "This comes from Wikipedia  There is a popular folk myth that if one holds a seashell—specifically, most often, a conch shell—to one's ear, one can hear the sound of the ocean. The rushing sound that one hears is in fact the noise of the surrounding environment, resonating within the cavity of the shell. Hope that helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the Fed keep raising interest rates this year?",
        "response": "To discourage over-leveraging of individual entities' assets and income.  If something were to increase the outlook for businesses, the market wants to invest in that, but also a lot of people want to start businesses since the outlook is better.  The downside is that people aren't very smart, and most new businesses fail. Those businesses were started with lent money. So a lot of the time that business loan goes unpaid.  Too many unpaid business loans puts the bank out of business. Too many banks out of business monopolizes capital and reduces credit availability to too-low of a level for the economy to function.  To protect against the failure of repayment on loans, higher interest rates are charged. The interest on loans in repayment covers the losses of loans not in repayment.  So raising rates keeps the economy on an even keel and not subject to the daily news.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the firms in class action suits find members for settlement payments?",
        "response": "You can google cases that are soliciting clients. Fill out your info and it's ironically often an honor system. Law firms solicit clients. In turn, the firm gets a lot of the settlement money and the rest goes to the clients. Divided between hundreds of thousands of people, it's not a huge payout for the clients.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The 3gb barrier in 32bit operating systems?",
        "response": "A 32-bit system doesn't have enough fingers to count to more than 4GB.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With such a high salt content, would the Dead Sea freeze if it were in a colder climate? If so, what kind of temperatures are we talking?",
        "response": "According to the [NSIDC](_URL_0_), every 5 ppt increase in salinty causes a 0.28 degC drop in freezing point. According to [wikipedia](_URL_1_), the Dead Sea has a salinity of 342 ppt.  Thus it would have to be 0 degC - (0.28 degC / 5 ppt * 342 ppt) = -19.152 degC for the Dead Sea to freeze. That's -2.47 degF.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the presence of pain evidence that damage is done, or is it just a warning?",
        "response": "Just a warning. Pain can happen when nothing is wrong. Take for example the pins and needles feeling. That's usually due to \"pressure neuropathy,\" which is just when you press on your pain nerves, they fire weird.  Sometimes people feel pain for no reason at all. Others are born without the ability to feel pain.  It just so happens we've evolved so that we usually feel pain when our bodies are being damaged, but our \"damage detection system\" can still give plenty of false alarms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "since the moon is tidally locked to Earth and it's rotation is nearly identical to it's orbit around the Earth, what would happen if we (somehow) artificially forced it to rotate faster?",
        "response": "Nothing, probably. The moon would be rotating independently of its orbit (at least until tidal forces stopped it again) but there wouldn't be any noticeable effects on Earth as far as I'm aware.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the purpose of the British Common Wealth? Do countries like Canada, Scotland, Australia have to do what England tells them?",
        "response": "it is a club of countries that shares a common history and culture, descending from the British Empire. They use it to encourage friendly relations between each other on that basis. The members are equal, including the United Kingdom. Scotland is not a member, because it is not independent. There are rules for being a member, but the organization has no authority; all it can do is suspend membership for misbehavior.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is actually happening when we \"zone out\" for a few seconds?",
        "response": "I don't know, but it scares the shit out of me when I realize that I'm 15 miles closer to where I'm going, and I'm the one driving.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do companies like Coke gauge the effectiveness of their advertising when it’s everywhere and people buy their products anyway?",
        "response": "I can't be arsed to find the link, but Coca Cola apparently chose a small target city in the US and stopped all local advertising as a test, and saw a decline in sales.  It validated the fact that advertising is required to keep the brand in-your-face, lest someone else come along and steal the short attention span of the average consumer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did those with mental disabilities (Autism, Down Syndrome) function in society before modern help centres and widespread awareness of these conditions?",
        "response": "Historically not very well.  Some cultures viewed them as touched by the gods and mostly ignored them, sometimes providing them with food. Others would see them as possessed by demons and would actively kill them due to a perceived (and at time legitimate) threat that they may pose.  Many cultures would also leave any child with born deformities to die to exposure and so never had to deal with the mental disabilities that are associated with conditions that are obvious at birth such as Downs Syndrome.  In more recent history they would have had better care than being fully ignored or outright killed by being put into Asylums that cared for them, but even that was not a great thing. Many times they were used for experimentation, and some of the treatments for them like electroshock therapy or lobotomies were horrid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we \"re-date\" historical events that pre-date the Gregorian Calendar?",
        "response": "No, we don't usually re-date anythig, because that would create a terrible mess. Only in special cases the [Proleptic Gregorian calendar](_URL_0_) is used, notably by Maya historians. So the 10 days are legally missing, 4 October 1582 was followed by Friday, 15 October 1582. Thus Columbus made his landing in proleptic Gregorian calendar on October 3, 1492 (pre-1500 the difference was just 9 days instead of 10).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I feel fear in my scrotum when I look over a high ledge and imagine falling, when all other types of fear seem to take place in my chest?",
        "response": "It is an adrenaline explosion where your body tenses up and prepares for what could happen. It goes along with the phrase \"puckered up\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "EILI5: What is a cerviogenic headache?",
        "response": "There's a phenomenon called \"referred pain\". Sometimes the nervous system gets confused where the pain is actually coming from. Because the nerves that innervate the neck are so close to the ones that innervate the head, it's relatively easy for the nervous system to confuse a neck ache and a headache. It works both ways, too. A lot of times migraines can cause a person's neck and back to hurt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the purpose behind very lengthy prison sentences of 150 years, 200 years and more when the average human lifespan is 70 years?",
        "response": "It is to express the Court’s disapproval of a certain offence and the gravity of the person’s offence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's this \"anti-feminist\" crusade currently going on in the Atheist community?",
        "response": "I'm a male atheist myself and I myself am very confused as to why the \"New Atheist Movement\" is such a \"boy's club\". It is predominantly young men who worship Hitchens and Dawkins. And yes, it extends from just anti-feminism to full-on misogyny (and Islamophobia, and hatred for African-Americans in the South due to their often fervent Baptist and Pentecostal beliefs, etc.). It's part of why I have absolutely no desire to be part of that \"movement\". Sorry that I don't have a real answer mate, but I just wanted to confirm that you're absolutely right that the atheist community has a serious sexism (and racism) problem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since the honeybee is an foreign species in North America, would it really be that bad for NA if all honeybees died out?",
        "response": "Bees aren't the only pollinators; before european bees were introduced in 1600, other pollinators played a central role. But you can't feed the US of today with the technology of 1600s. Crops that depend on pollination by bees today include apples, avocados, onions, oranges, pears, and pumpkins. Eliminate everything from your life that includes any one of those, see how much is left, and then decide whether that is \"much impact\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Mitchondrial membrane question: Why do the H+ ions stay in the intermembrane space instead of leaking out the outer membrane?",
        "response": "AFAIK, neither of the membrane are particularly 'leaky'. There's ATP synthase as an obvious channel for protons back through the inner membrane, but there are no proton channels in the outer one.  (Note that aquaporins allow water to pass through but not H^+ , something that's rather remarkable)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does Reddit Gold do for your account and for Reddit as a whole?",
        "response": "_URL_0_ It pays the bills, notably server costs. Reddit continues to operate in the red and is not a profitable website.  As for you the user it really only does a few things: * Gives access to /r/Lounge an elite members only subreddit. * Allows you to get notified when someone mentions you in a comment. * highlight new comments on a post you return to * Lets you hide subreddits from r/All * Disable adds * Enhanced friends functionality * Access to betas when/if they run them * Makes you feel fancy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Physics] Photoelectric effect and its uses?",
        "response": "This may not be practical in the conventional sense, but it's important in the characterization world. The photoelectric effect is key to a measurement technique called x-ray photoelectron spectroscopy (XPS), where we can identify the atoms at the very surface of a material by shining an X-ray beam at them. The high energy X-rays ionize the electrons, which fly off the material with the excess kinetic energy (KE = hv - binding energy). We can detect the kinetic energy of the electrons that fly off, which tells us information about the composition (types of atoms) of the surface and how the atoms are bonded together (chemical state).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which came first to define the word orange, the color or the fruit?",
        "response": "The fruit. The word for the fruit comes [originally from Sanskrit](_URL_0_) where it's \"nāraṅga.\" In 1512, somebody first referred to something that was yellowish-red as \"orange-coloured.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Numerous Questions i have about ISIS.",
        "response": "1. To create a state based on their strict interpretation of Islamic law. 2. Generally people don't. The [UN](_URL_0_) says there are 4 million refugees, out of a prewar population of a bit over 20 million, so 1/5 of Syria has fled. Those that are still there are pretty much stuck. Turkey and Jordan are already struggling to feed and house people, and Iraq is just another battleground. 3. They aren't terrorist attacks in the sense they're going into areas controlled by a government and doing stuff. They are going out and militarily conquering areas and committing atrocities. The US is bombing them. The Iranians are basically single-handedly propping up the Syrian government and have troops fighting them in Iraq. The Saudis and Qataris are funding their own rival Islamists which are fighting them in Syria.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do boxers randomly hug each other?",
        "response": "The primary goal clinching can achieve is to slow down and tie up your opponent to stop his or her momentum. There are times when you need to slow down what your opponent is doing and change the pace more to your liking. Boxing, if anything, is about fighting at your pace (whatever that pace may be).  A clinch is like a do-over. Also, for some boxers, clinching provides a respite of the full expenditure of energy. [Full article](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If an Airbus A380 was teleported mid-flight into Jupiter's atmosphere, would it be able to sustain flight? If so, for how long?",
        "response": "Assuming you planted the Airbus at roughly where Jupiter's atmosphere is Earth's atmospheric pressure not very long at all. Jet planes and combustion prop planes require oxygen to operate. Jupiter's atmosphere is mostly hydrogen and helium. You'd do better with an [electric prop](_URL_0_) plane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what point did we (as a society) become certain that Everest is the tallest mountain?",
        "response": "The official, recognized height of Mt. Everest was determined by an Indian team in 1955. Since that's the official data being used by Nepal and China, then you can use that year as the time where official certainty was determined.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does drinking alcohol lead to drunkenness?",
        "response": "Alcohol activates the GABAa receptor leading to a loss of GABArgic neuron function in the brain. GABAa receptors help modulate neuron activity by transporting Cl- ions into the postsynaptic neuron, hyperpolorising it, making it harder for it to pass on a signal. In this way, alcohol is considered a central nervous system depressant. With regards to nausea, the body typically responds to high amounts of intoxication by trying to rid itself of the perceived source of the drug (ie vomiting). In addition to this, motion sickness can be caused by lack of motor control.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why can't nuclear waste be neutralized?",
        "response": "Its not like acidic or caustic liquid that can be \"neutralized\". Nuclear waste has products that are radioactive by nature and the only way to fix that is to allow them to decay until they are stable. Which usually involves several steps and each one releases some form of radiation. The only way to bypass this would be to somehow manipulate the nuclei of the atoms and change the atoms into something else. We've only come as far as splitting atoms for bombs and destructive means. The \"strong force\" that holds a nucleas together is fundamentally unknown, so we are unable to manipulate an element at this level and cannot stabilize the waste by any means besides allowing it to naturally decay.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If £1 is worth more than $1, does that mean the UK's economy is better than the US's, and if not, why?",
        "response": "no. as a related example, since 1 bitcoin is worth more than $1, if the value is related to strength of the source economy, what economy would need to be better for that to make sense? What economy does BTC represent? To again sidestep the question - Consider a company with 100 shares of stock each worth $1mil, and another company with 1 billion shares of stock each worth $1. Is the company who's stock is more expensive worth more? no. These don't directly answer your question, but I think these may lead you to discover and understand the question on your own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Japanese porn pixelated?",
        "response": "Article 175 of the Criminal Code of Japan, forbids distributing \"indecent\" materials. The current interpretation of that law is such that showing the penetrative act would be obscene, and thus most of their porn is censored to prevent violating the law.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that on most fans, the switch is ordered as off, high, medium, and low?",
        "response": "When you turn the fan on, the motor that powers the fan is running at max speed. When you turn the fan to medium or low, the motor is slowed down. Running the fan at the maximum speed of the motor is more efficient and the fan will last longer since the motor does not have to adjust to the increased power flow as you go from low to high.  There is not a lot of strain on the motor when you turn the fan on, as the current flows without any limitation, and when you turn the power off, the fan stops on it's own with no adjustment of the speed of the motor. When you turn the speed of the fan down, the loss of current slows the fan down. Again, no strain on the motor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a Pro gamer make a living after he / she retires?",
        "response": "It's a bit of a tough question to answer as the pro gaming industry hasn't delivered that many retirements so far. However, if they follow a gathering based on not just their skill, but also their personality, they could complete a full career by Twitch (subscriptions, ads, donations) and YouTube (ads, sponsorships, Patreon), even if they can no longer compete at -the- top level. Or their knowledge on games could indeed land them a job in a gaming company. In my opinion it can be compared to \"normal\" sports in this regard, as sports knowledge (- > coach, manager...) or personality (media personality) can allow you to continue your career even after retirement from actual top level competition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do capacitance, inductance, and resistance make up impedance in an electrical circuit for power plants?",
        "response": "you're in charge of a circuit, at the end of which is (for the sake of a visual) a motor. you flip on the switch and the motor gets 50w of power. you look at the generator and it's spitting out 100w. so where the hell are those other 50 watts? some of it is heating up the wires (resistance), some of it is filling capacitors (capacitance) and some of it is generating a magnetic field (inductance). these are all forms of work (it takes energy to do them) but *you don't care.* for all you're concerned, those 50 watts are just gone. *that* is impedance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If there's a super massive black hole in the center of every galaxy, then why can you see light from the center of galaxies?",
        "response": "It's not that black holes suck all the light in, they don't allow light to escape if it's inside the Schwarzschild radius. The super massive black hole at the center of the Milky Way is [no more than 6.25 light hours across](_URL_0_), which is much, much smaller than even the center of a galaxy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you don't believe 100% of your religion's holy text, how do you decide what to believe?",
        "response": "You pick and choose. Simple as that. There's absolutely no reason for one point to be any more valid than another in a holy text, because of the faith involved. It's gotten to the point where holy texts offer two things, a few well-meaning guidelines for leading an ethical life and a way to justify hatred and prejudice. So the faith is no longer relevant, you're removing \"God's word\" from the equation and just making up your own mind as to what parts of it seem good or not, basically blowing the whole idea to pieces. (Edited for grammar's sake)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is fire composed of?",
        "response": "Hot gas. Fire happens when something reacts chemically with oxygen. This reaction releases heat; this heat raises the temperature of the reaction products. Some of the reaction products are gases like carbon monoxide or carbon dioxide. When these gases get hot, they glow, just like a hunk of steel glows when it gets hot. So the visible flame you see when something burns is gas released by the chemical reaction and heated to the point where it emits light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What parts in HBOs tv-show “Vikings” is actually historically accurate?",
        "response": "Hi, many have asked questions about the series (psst, it's not HBO, it's History Channel) and thus there is [a section of the FAQ](_URL_0_) you might be interested in exploring.  There's always more to be said, though you may be more likely to get responses to questions regarding specific aspects of the series rather than the series as a whole. Experts in early medieval Scandinavia may have no / limited familiarity with the series.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When eating starchy food like rice, crackers, or bread... why do you get that choking feeling until you drink water.",
        "response": "Carbohydrates are hydrophilic... they like water and bind easily with it. Ever see a chicken leg or steak swell up in water? No, but bread or pasta or rice will. The carbohydrate food is probably sucking up the moisture in your mouth and throat. Btw, that's one reason why fiber supplements must be taken with a lot of water. They can blow up in your throat and cause choking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Genes, DNA, RNA, mRNA... how are they all connected?",
        "response": "A gene is the instructions for making a particular protein. It's stored as DNA. When needed it's copied to RNA which is used as a template to make the protein. A gene is a specific sequence of DNA or RNA that can be translated (by the ribosome) into a protein. Genes are stored as DNA sequences. DNA is double stranded and much more stable than RNA. When a cell needs a particular protein, the DNA is partially unwound and an RNA copy pf the gene is made from the DNA strand (called messenger RNA or mRNA). This process is called transcription. The mRNA is used by the ribosome as a template to make the protein (the gene product). This is called translation. mRNA is one class of RNAs. Other RNAs include: rRNA (ribosomal, these are parts of the ribosome), tRNA (transfer RNA are involved in translation), ncRNA (non-coding RNAs that don't code for a protein and are involved in regulating the expression of proteins).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the words for \"cat\" (gato, katze, mačka) in European languages so similar, while the words for \"dog\" (hund, perro, pes) are so different?",
        "response": "Cat is a very old word - it was used in Africa and the middle east 2000 years ago. Dog is a very new word - it replaced Hound in English - about 300 years ago. Ie. Cat has had time to have an influence on other languages, dog hasn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is actually happening when I hear my timber framed house 'crack'?",
        "response": "It would be better described as creaking rather than cracking. When a door creaks, the hinges aren't cracking, there's just resistance that builds up until friction can no longer stop the hinge from moving. The same applies to the beams in your house as some parts of the wood heat & expand faster than others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I leave food out in the open, it will rot and eventually larvae or maggots will form, but I don't have any flies in my room ever, so where do these larvae/eggs come from?",
        "response": "It's from flies. I doubt you're watching it 24/7.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Abnormally Long Arm hair, Can Anyone Explain This?",
        "response": "C'mon guys, the rules are right over there ---- >  > Keep discussion on topic and focused on answering questions scientifically. Personal anecdotes and layman answers are not acceptable posts. I don't want to have to downvote any more of you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "We are said to be 10% human and 90% bacteria - where does the bacteria come from?",
        "response": "A large majority of the human microbiome (i.e., the microbes that inhabit you) reside in the intestine. It's estimated that there are around 100 trillion bacteria in the gut alone, and the latest estimates for the number of cells in an average human are around 30 trillion. However, you'll find bacteria all over the body - interestingly, there are distinct bacterial populations on certain regions of your body (e.g., the bacteria that inhabit your ear canal will be different species than those typically found in the intestines). The population of your body by microorganisms begins at birth (a lot of the skin flora on a newborn will come from the mother's birth canal, and it's possible to demonstrate different types of bacteria residing on the skin of those delivered by C-section rather than vaginal delivery)...indeed, much of the microflora that initially inhabits a newborn is thought to come largely from the mother.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it bad to wash your hair with shampoo every day?",
        "response": "I depends on the person. I have baby fine hair and moderately oily skin. I cannot go a day without shampooing. I've tried and it doesn't work for me.   The no shampoo crowd frequently push the idea like religion. But if you try it and it doesn't work, trying harder isn't a solution.  Shampoo your hair and go on with your life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a way to determine how much pain someone is in using technology? Do our brains react differently or the same despite each individuals unique pain tolerance?",
        "response": "Because pain is *subjective* measure. Two people can be subjected to the exact same injury, but it'll seem more painful to one person and less to the other.  You could *in theory* put a person in an fMRI and measure how their brain is reacting to the pain, but -- again -- their perception of the pain might make that measurement pointless, and beyond that, it is absolutely impractical to do so. You can't have every patient in the ER put in an fMRI.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why fabrics get darker when wet?",
        "response": "Here's an easy experiment. Place a drop of water on a paper towel. Notice how the wet spot looks dark? Now hold that paper towel up between you and a source of light. Notice how the wet spot looks bright? The water increases the ability of fabric (or a paper towel) to transmit light, which means there's less light to be reflected back toward you. So the wet spot will look lighter or darker, depending on whether you and the source of light are on the same side of the fabric, or not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do babies cry all the time?",
        "response": "Luckily, the Doctor taught me how to speak baby. \"THERE'S SOMETHING WRONG AND I DON'T KNOW WHAT IT IS BUT I'M VERY UNCOMFORTABLE AND I HAVE NO IDEA HOW TO MENTALLY COPE WITH ANYTHING BECAUSE MY ENTIRE EXISTENCE HAS BEEN A BLISSFULLY WARM ENVIRONMENT IN WHICH I WAS CONSISTENTLY NOURISHED AND RESTED. WHY DOES MY SKIN FEEL LIKE THAT? I DON'T LIKE IT. WHY ARE MY LEGS WET AND COLD? I DON'T LIKE IT! MY HEAD... HURTS? I DON'T KNOW BECAUSE I'VE NEVER FELT LIKE THIS BEFORE AND *I DON'T LIKE IT!* I'M UNCOMFORTABLE AND THIS IS NEW AND I DON'T LIKE IT BUT I HAVE NO OTHER WAY TO DEAL WITH THIS\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If it's against Islam to depict pictures of the Prophet Muhammad... how do you know it's a picture of him when someone prints one?",
        "response": "It's claimed to be a depiction of Muhammad. Presumably, idolatry, which this rule is a preventative measure for, does not require a genuinely accurate image to be a problem. It merely requires that the worship be dedicated to the individual, even if that individual is inaccurately depicted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes absorption of right- or left- circularly polarized light by chiral molecules?",
        "response": "The answer lies in the polarized nature of the electric and magnetic fields induced by the light. Polarized light, like all light, will induce magnetic and electric dipoles within the matter it interacts with. These induced dipoles are distortions of the electron clouds around the molecule, and can thus be seen by looking at the absorbance spectra of chiral molecules using polarized light. So polarized light will preferentially induce a directional dipole (probably poor language) in the molecule. Because of their chiral nature, chiral molecules have unique dipole moments that lead to absorption.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we require sexual stimulation to ejaculate?",
        "response": "In most animals, most behaviour is the result of stimuli. Hungry+see food=eat food. It's involuntary. This makes things much easier because it doesn't require such a complicated brain. Making ejaculation voluntary wouldn't really present any benefits compared to only triggering it when it is sensed that the male genitals are in contact with female genitals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If bees continue to die and decline at the rate they currently are, what other options are they for pollinating plants?",
        "response": "The bees that are declining are honeybees. They have been bred to produce a maximum of honey, but not so much for robustness. There are, however, many species of wild bees, which can pollinate just as well. The problem is that wild bees do not make nice beehives, which means that it will take more effort to breed them in large numbers. Plus, since they don't produce honey as a by-product, they will be more expensive. But if honeybees indeed decline even more, wild bees will become an economically viable alternative.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is an itch? And why is it satisfying to scratch it?",
        "response": "Interestingly itches are picked up by the same type of nerves as pain. When your brain recieves this very low pain signal, it interprets it as an itch and compells you to scratch it to relieve the \"Itchy\" feeling. But why does your brain generate this \"itchy\" feeling when it recieves a tiny ammount of pain? Well, like everything biological, it's an evolved response. Basically very minor pain could be a sign of a tick, jigger or other parisite which could be scratched out. This could have saved your life.  Unfortunately the \"Itchy\" response never evolved to be able to differentiate between a tick which can be scratched off, and eczema which can only be made worse. And here we are today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we put a man on the moon, a robot on Mars, and travel to the deepest depths of the ocean, yet we have no way to rescue people from Mount Everest?",
        "response": "Moon, Mars, ocean: * little or no weather there * took years of planning for each trip * cost ... billions? ... of dollars Rescuing people from Everest: * involves highly unpredictable, difficult, and extreme weather * has to be done within hours or days of someone getting lost * has to be affordable * has to be repeatable I'm not saying it *can't* be done. Those are just reasons why it *hasn't* been done.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they stop someone's heart during surgery?",
        "response": "For open heart surgery like a coronary artery bypass, the perfusionist administers a cardioplegic solution through one of the tubes used to bypass the heart. Cardioplegia usually contains potassium. They also throw in a few handfuls of ice into the chest cavity around the heart.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have eyebrows?",
        "response": "They're meant to catch dust and the like, similar to eyelashes, to protect your eyes. It may also have something to do with the angle of our brows during evolution, so that the underside (similar to armpits) were less exposed and kept the hair. Extra text in case of the subs minimum word count or whatever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can gold be created in a lab?",
        "response": "Yes, you could produce gold in a nuclear reactor by bombarding mercury 196 with slow neutrons.  Aside from the economic reasons (if we could easily make gold, its value would plummet so what'd be the point?) there isn't exactly a whole lot of mercury 196 floating about (about 0.15% of all naturally occurring mercury) so it wouldn't be particularly worth it. Also, slow neutron are essentially what keeps a nuclear reactor going, so they're needed elsewhere.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you have to \"charge\" glow in the dark stuff?",
        "response": "That's actually pretty much correct. It is called \"phosphorescence\" and basically means that it doesn't re-emit the light that it absorbs immediately (the way light shining on a red object would just absorb and then reflect back red light immediately at the same strength as the light that hit it, since it is all at once). Phosphorescent materials absorb the light and then release it *slowly* over time by releasing it with lowered intensity. That's why glow-in-the-dark items won't glow as bright as the light that was shining on them originally, but they can last longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is South Korea broadcasting on the loudspeakers?",
        "response": "According to this article i was reading, the broadcasts  > focus on the superiority of life in South Korea as well as South Korean soap operas  & nbsp; Basically they spew how awesome electricity, fresh food and the internet is. And then they annoy the shit out of North Korean soldiers with their soaps. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the last battery bar on my phone last a lot longer than the other 3 bars?",
        "response": "There are 3 possibilities that I can think of: 1. They purposely programmed the battery indicator to make it seem like your battery is almost empty for longer, so your phone doesn't die on you as often (since you'll probably charge it when you get to 1 bar). This is similar to your car's gas gauge.. it says empty, but it still has a little left so you don't get stranded. 2. Your phone may have battery-saving features that kick in when the phone is almost dead (such as dimming the screen more, turning off extra services that it doesn't necessarily need, etc.). So even though half your battery was drained in 8 hours, that last '10%' charge could last you another 4 hours. 3. It just seems to last longer, because you try to conserve battery as much as possible when you're down to that last bar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the buzzing sounds speakers make whenever a phone receives a call?",
        "response": "Interference. Since speakers have magnetic coils they act as an antenna and receive the signals emitted by your phone. it converts this into sound. But since the transmitted signal is digital format and the speaker is analog thats what you hear a burst of very fast beeps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If two people held a string stretching from one side of the universe to the other, would it snap due to the expansion of the universe?",
        "response": "Yes. There is a real tension on the string from the expansion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "is the universe a closed system?",
        "response": "Universe is by definition a closed system because it is everything that exists, and so nothing can go into something else because that something else is also universe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my nose run when I eat really spicy food?",
        "response": "There are two main chemical compounds that make food spicy: capsaicin and allyl isothiocyanate. Capsaicin is found in chilis — jalapenos, habaneros, cayennes, and such like. Allyl isothiocyanate is what gives radishes and mustard their kick. Different tastes, but similar compounds. Similar in that they're both *irritants.* That means exactly what you think it means: Those chemicals irritate mucus membranes. When you eat them, they bind to receptors in your mouth, throat and nose that trigger an inflammatory response all up and down your respiratory and digestive tracts. One of the effects of that response is that your nose runs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does most oceanic life live close to the coast?",
        "response": "We can usually treat primary productivity as a good proxy for all the biomass in the system. So a map like [this one](_URL_0_) of the global distribution of chlorophyll content at the surface is a pretty good approximation of relative biomass. The actual pattern might be a bit more diffuse than this because of ocean currents, but this should be pretty close.  EDIT: This map doesn't include the non-photosynthetic productivity associated with deep sea vents, though, obviously. They're not a huge source of biomass, but they are worth considering, especially because they form along the ocean floor at tectonic spreading centers, which just happen to be underneath some of the areas of lowest surface productivity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a liquid run down the side of a glass when pouring it?",
        "response": "Due to both the high surface energy of the ceramic surface and the lower interfacial energy of the ceramic-water interface.  The lowest energy state is when the water is covering the ceramic and so the water will adhere to the mug as it is poured out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between a \"language\" and a \"dialect\"?",
        "response": "[This thread on /r/linguistics would interest you.](_URL_0_)  Officially, a dialect becomes an independent language when speakers can no longer understand each other (ie, they lose \"mutual intelligibility\"), but in practice, it's usually a political decision.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can you pull up an anchor?",
        "response": "The anchor stops horizontal movement by dragging along the seabed, lifting it vertically has little drag.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does lightning have enough voltage to reach the ground?",
        "response": "Dry air is 3 MV/m for dielectric breakdown. Humid air is lower.  Nonetheless, it's still not typically enough to account for breakdown given the electric field strengths we see. We're not actually sure what triggers the initial breakdown. Theories are either something else starts the ionization, which cause a breakdown chain reaction. Cosmic rays are a candidate. Or something causes much, much higher local electric field strengths, which causes a breakdown chain reaction. The sharp points on water crystals are a candidate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/how do some people get pimples on their chest?",
        "response": "Same as on your face,basically oil stuck in holes in your skin (pores).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the Pacific Ocean calmer than the Atlantic, and why or why not?",
        "response": "The ocean's current name was coined by Portuguese explorer Ferdinand Magellan during the Spanish circumnavigation of the world in 1521, as he encountered favourable winds on reaching the ocean. He called it Mar Pacífico, which in both Portuguese and Spanish means \"peaceful sea\" So one guy thought it was peaceful when he was there.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "House Flies. What purpose do they serve in the circle of life, if any at all? Are they beneficial in any way and could the world do without them?",
        "response": "They're very important as bottom feeders. Living organisms die and leave corpses behind, and something has to get rid of all that waste. Flies and many other invertebrates help break all that waste down more quickly by eating it and pooping it out, which breaks it into simpler chemicals which microorganisms and plants can recycle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where and when did tarot cards originate? Were people secretive about it? Have the decks, suits, and major and minor arcana changed over the years?",
        "response": "Hi, this previous thread may give you something to get started on * [Before being used in divination, what did the 22 trump cards in the tarot deck signify?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is interstellar space travel even possible considering the amount of random dust/matter out there? Wouldn't a collision with something the size of a grain of sand destroy the craft?",
        "response": "I'll assume 0.5c is \"extremely fast\". The (classical) kinetic energy of a bare proton at 0.5c is: * 0.5 * m * v^2 = 0.5 * 1.67e-27 kg * (1.5e8 m/s)^2 = ** 1.88e-11 J ** ...which ain't much. The objective answer to your question obviously depends on the parameters of the spacecraft and the debris encountered, but if we make some assumptions, you can get an idea. Let's find out how much matter it would take at 0.5c to cause a 1 kiloton impact event. 1 kiloton of TNT is roughly ** 4.184e12 J ** * E_k = 0.5 * m * v^2 * m = E_k / ( 0.5 * v^2 ) * m = 4.184e12 J / ( 0.5 * (1.5e8 m/s)^2 ) = ** 372 mg ** That's about a third of a milliliter of water. It doesn't take much...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some pieces of poop float, while others sink?",
        "response": "Because you eat different things. If you eat something that would float followed a bit later by something that would sink, then it could result in the first turd floating and the next sinking. Keep in mind that the digestive process takes several hours, so one bowel movement can contain what you ate over a period of an hour or two.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was premodern medicine, (e.g. Bleeding, Mercury, leeching) ever effective against disease? If not why did medieval doctors continue to use these techniques?",
        "response": "Leeching and maggots certainly had enough benefits that they are [making a recurrence in modern medicine](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My Gorilla Glass 2-equipped phone screen is all scratched after more than a year of use, but I can't make a scratch on it with my keys?",
        "response": "Sand will scratch Gorilla Glass. If you get a bit of sand in your pocket (or wherever you keep your phone), it can cause a lot of scratches on the screen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for a male human to receive a testicle xenotransplantation and produce viable sperm of the donor species?",
        "response": "This is an interesting question as the testicle is one of the few sites in the body that is [shielded](_URL_0_) from the immune system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does salt makes us thirsty?",
        "response": "The bit of basic physics to be known here is the concept of the \"osmotic gradient.\" Simply put, water will flow towards high concentrations of solute (in this case, salt). If there's a lot of salt in your blood -- say, after eating a lot of salty food -- the water in your cells will flow out, into the space outside the cells, to try to bring the concentrations into balance. Your body senses this outflow of water and causes you to feel thirsty, so you drink more water, because there's less in your cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do magnets pull things? Since magnetic forces cannot do work, what is actually pulling an object?",
        "response": "Magnets will rearrange so as to align in a particular manner (their magnetic moments align). If magnets are moving things around, it is because work was put into the system *before* at some time in order to even arrange them in such a way. Upon moving, energy that was put in before is being released. Basically, I have to do some work in order to put the magnets in a place where their energy is NOT minimized. When the magnets move about, the objects are merely falling into potential wells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so important and commonly requested in the United States, unless you opt out, to specify your Race/Ethnicity? Specifically, why is there a completely separate 'are you latino' category?",
        "response": "The United States has a long and ugly history of racial discrimination. By keeping tabs on how different racial groups are using services, we can see if certain groups are being disproportionately effected by something, compare how they're doing over periods of time, and just generally assess the efficacy of various programs.  As for Latinos, that is categorized as an ethnicity and not a race. Since you can be black, white, mixed, native, etc. and still be Latino.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What real evidence backs up the theory that hitler escaped to Argentina to live out the rest of his days?",
        "response": "Here's a few previous answers on this topic: * [Did Hitler fake his death and lived in Argentina until he died in the 60's?](_URL_1_) feat. /u/Bernardito * [Is there any chance Hitler escaped?](_URL_0_) feat. /u/Voransaka",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can gravity waves form interference patterns?",
        "response": "Interference patterns are simply the result of a linear wave equation, for which the sum of two solutions is itself a solution. The wave equation for gravity waves of sufficiently small amplitude is linear, so they can indeed form interference patterns.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come in some TV shows normal scenes seem to be very quiet but when fighting/shooting happens the volume gets about 10 times louder?",
        "response": "probably intentional design by the show's producers to use contrast as a storytelling/atmosphere building device. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the most up to date scientific opinion on water fluoridation? If you can cite sources that would be much appreciated.",
        "response": "[Here](_URL_0_) is the CDC's site about water flouridation studies by the National Academy of Sciences. [Here](_URL_1_) is another site that specifically addresses some of the conspiracy theories and internet propaganda surrounding Flouridation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people believe they don't need to pay income tax?",
        "response": "Because they don't want to pay income tax. Confirmation Bias takes them the rest of the way. [Check out this wikipedia page for a list of the silly arguments that are used](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did colors end up with their associations? (Pink/Purple being \"girly\", Blue for boys, Green with envy). Where did it start?",
        "response": "Depends on culture. Romans used purple to signify royalty. Indians view pink as lucky and it is worn by both sexes. Different colors mean different things to different cultures. They aren't universally symbolic generally. As to the specific origin of the symbols you're asking about: I dont know. I'll leave that to someone else.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would a peasant in medieval times learn that his king was dead?",
        "response": "A tag on question: Do a peasant even care that his king was dead? or Do peasants even know who their king was?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are many Greek and Roman statues missing their hands and head?",
        "response": "Because those are the weakest points in its construction. After 2500 years of wear and tear, necks and wrists break.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What actually kills you when you are dehydrated?",
        "response": "The two most significant issues with severe dehydration are the loss of perfusion volume as well as the electrolyte abnormalities that develop. If someone is hypovolemic enough, they will not be able to maintain an adequate blood pressure to supply oxygen to their organs, which results in multi-organ failure (in particular, the heart, brain, kidneys, and liver are particularly vulnerable). In addition, changes in electrolyte concentrations in the blood (most typically sodium or potassium) can result in comas or seizures as well as cardiac arrhythmias.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast and how many miles does the earth travel around the sun each day?",
        "response": "If you assume that the orbit is circular (roughly speaking), then the radius of the orbit is about [93 million miles](_URL_0_). That makes the circumference of the circle [584 million miles](_URL_1_). It travels [1.6 million miles per day](_URL_2_) EDIT: I did not convert the speed because the question asked each day.... so it's in units of miles per day, not mph. I prefer v~30 km/s personally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it feel weird when we watch a movie with a framerate higher than 24fps?",
        "response": "Source for there being a black frame after every movie frame?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does food have the same amount of calories before and after it's been cooked?",
        "response": "From my limited understanding on the matter, cooking it creates lots of chemical changes in the carbohydrates and proteins allowing us to more easily extract the calories contained in the food.  Supposedly, it was the development of cooking food that allowed our brains to dramatically increase in size. Our brains require a lot of power to run, so we could \"get even smarter\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an automatic firearm work?",
        "response": "This explains it much better than I could in words; _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- What's going on in Syria?",
        "response": "Assad, the leader of Syria, is a bad dude. some people in his country want him out, like what happened in Egypt and Libya, and so there's fighting. the US wants Assad out, too, but important countries like Russia and China disagree, and so the UN isn't going to get involved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who were the first prominent Southerners in government [Congress/White House/SCOTUS/Armed Forces/etc...] after the Civil War and did they face extra issues getting in?",
        "response": "General James Longstreet joined the Republican Party after the war and was appointed as the head of Louisiana's Reconstruction-era militia.  He was despised by many fellow Southerners, despite heroic service in the Confederate cause, especially after the 1874 Battle of Liberty Place - Longstreet, commanding black troops, ordered them to open fire on a mob of white Southerners who were attempting to remove the state's elected government by force.  Longstreet served as a federal railroad commissioner and an ambassador in his later years. He was hounded until his death by Southern critics who (ironically from a certain point of view) thought he was a traitor, and who tried to rewrite history to dismiss his sterling military record. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, if all these different countries are in debt, why would it not be beneficial for every country to have debt wiped out and start anew?",
        "response": "At its very core, erasing the fact that you owe somebody something means that said person never gets payment for their efforts. I would be very mad if I invested in a country and it suddenly decided \"well, we're broke, you're not getting any of your millions of dollars back\".  Oh and it means there's no trust in your government (in terms of bonds) anymore.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how the little tab on the rearview mirror works to dim the view of headlights.",
        "response": "I believe there are actually two layers of glass in the rearview. The tab changes the angle of the glass at the back to reflect light downwards (or upwards), while the front glass continues to allow you to see without the full light being reflect directly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly does a DIMM or SO-DIMM do in a computer?",
        "response": "That's for additional RAM. DIMM stands for Dual Inline Memory Module. SO-DIMM just means that it's for laptops - Small Outline DIMM.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did chili evolved to be spicy?",
        "response": "It's advantageous for a plant to have its fruit eaten by birds. This is because seeds largely pass through birds undigested, and because they spread much farther. On the other hand it's not so good to be eaten by mammals, because they generally kill the seeds and anyway don't travel very far. As it happens, birds can consume very hot peppers without any ill effects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do you calculate the radius of an atom that isn’t in a bond?",
        "response": "You can numerically solve the Schrodinger equation for a potential well with a certain depth (nuclear charge) to obtain the shape of the electron orbitals. The shape of the atom is typically defined as the volume which contains some large fraction X% of the electron density.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we just look up at the moon with a telescope to where the astronauts landed to disprove conspiracy theorists?",
        "response": "The unfortunate truth is that even if you could organise guided tours of the landing sites, you wouldn't convince the conspiracy theorists. The fault is not in the data but in the psychology of these people.  A conspiracist is not motivated by the objective evaluation of evidence, but rather by their cynicism and disenfranchisement with authority, be it government, scientific conscensus or other.  EDIT: felt the need to back up my claim with references (Damn but those paywalls are a nuisance):  Conspiracy Contradictions, - Michael Shermer, Scientific American 307, 91 (2012)  What a Hoax, - Sander van der Linden, Scientific American Mind 24, 40 - 43 (2013)  and the un-peer reviewed (but non paywalled):  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water without ice spill more easily than water with ice?",
        "response": "ice floats because it has a lower density than water. therefore the top portion of the glass is lighter, making the base more stable because it is denser.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people write C.E. instead of A.D.? Why not change the calendar?",
        "response": "CE means Common Era, AD means Anno Domini (year of our lord) CE is more accurate, because it's arbitrary. Whereas the year of Jesus' birth is up for debate, usually being 3-5 AD (Doesn't make much sense does it). We don't change the calendar because there is nothing wrong with the calendar, it works the same as ever. It's off by one day every 8000 years, considering 8000 years ago we had no calendars and 8000 years from now we will have a better system, it's fairly good. The only different is that CE is secular. Edit - extra info",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were there no large-scale reform movements in the Orthodox church as compared to, rather famously, its Catholic counterpart?",
        "response": "I think it would be difficult to establish a specific reason, but two factors that were probably important were: A) that the national Orthodox churches maintain some degree of autonomy, whereas in the Catholic Church the center exerts a much larger influence. The local Orthodox churches were more flexible and more easily able to deal with local challenges. B) that the national Orthodox churches are *national*. The religious identity and the national identity have some amount of overlap there. It's not a church controlled from some foreign remote location, it's described in those countries as \"our church\". The combination of religion and nationalism is always very powerful. I'm speaking mostly about East European countries, although Orthodoxy is not limited to that area. Also, those two factors alone are probably not sufficient.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does acting oblivious/dumb to people's insults make them annoyed?",
        "response": "They didn't get the reaction out of you that they wanted, but honestly i dont think thats the best way to deal with insults. There are ways to deal with insults which can annoy people even more",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all but one species of dog died out, could we theoretically recreate all of those lost species by selective breeding?",
        "response": "This is probably just a matter of semantics, but I would like to point out that when you say \"if all but one species of dog died out...\", you're really talking about breeds of dog, not species. All dogs are the same species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With nothing to gainand everything to lose, why do people continune to start smoking cigarettes?",
        "response": "It's an easy trap to fall into. I smoked for two years after being the most anti-smoking person ever. Basically there's the social pressure, a lot of people still subconsciously see it as grown up and cool, particularly when celebrities like Johnny Depp smoke. I would also say most people start smoking when out drinking and not thinking rationally. So many people are \"social smokers\" but they're already on that slippery slope. As soon as you have the occasional cigarette when sober, you're done and in the trap. Also they taste disgusting, so you think \"this is gross, I will never get hooked!\" And ironically you think it's ok to have another because it seems to give you a bit of a buzz when combined with alcohol.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my inner shower curtain always insist on attacking me during my shower?",
        "response": "It is caused by both the Bernoulli effect and driven cavity. Driven cavity seems to be the largest effect. The water droplets falling from the shower head (because of gravity) cause aerodynamic drag on the way down. That starts the air moving, which causes a low pressure area within the shower, drawing in the curtain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do modern jet aircraft have sharp angles on their wings/tails, whereas propeller aircraft of the 40s had curved wings and tails?",
        "response": "Short answer is as planes got closer to supersonic speeds thanks to the development of jet engines traditional wing designs were innefective since the aerodynamics are quite different under these conditions.  Some WWII planes used elliptical wing planforms since it was the most efficient shape at the time, but also more expensive to make. In most cases they settled for a compromise solution where the shape wasn't quite an ellipse but the performance wasn't much worse and the costs were cheaper. These curvy wingtips probably responded to that attempt of making the wings more ellipse-like without making them much more expensive. But under the new conditions brought by jet engines this was no longer that important, having elliptical wings or very curvy tips didn't help much but it added costs. Also plain rounded wing tips aren't that good at reducing wingtip vortices and better wingtip devices were developed later.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is the N word so commonly heard in music when it’s such an offensive term?",
        "response": "When it is used in music it is almost exclusively done so by black people. In general, the idea is that if you are part of the group that a term refers to, then it is not offensive to use. This whole idea of being able to use the term if you are part of it probably comes from the fact that the whole N word issue comes from racism and the whole history of white men using black men as slaves etc. So the N word is offensive due to being seen as racism - but if you are a black person, then it is suddenly not really racism anymore, and thus the offence of the word is gone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This hypothetical scenario",
        "response": "It's called the [Monty Hall problem](_URL_0_).   Ultimately, what it comes down is that, from the start of the experiment/gameshow, there was only a 1 in 3 chance that you chose the door with the prize behind it, so if you repeat the experiment a thousand times over, the prize would be behind the other door two thirds of the time, so you should choose to switch if you want to maximise your chances of winning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the Steam Machine that Valve is releasing, and how will it change gaming?",
        "response": "> what is? The steam machine is just trying bring pc gaming to the living room as most pc gamer are seen as they have big computers and have to play at their desk and its not practical to play with multiple people in a local space. So valve trying to cover that part of the market by making an Operating system that will just boot into steam and you can play games and feel like you are playing on console with the ease of use and making the actual machine being small so its looks like the size of a console.  > As how that will change gaming?  it will make more people buy one if they are reasonable price like a console and the person knows the difference between pc gaming and console gaming (1080p 60fps...) that will make them get steam machine rather than buying console but most likely most of the machines will be people that will build them based on having spare parts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it relatively easy to become a teacher when the future of our society depends on how well they perform?",
        "response": "in most states it requires a 4 year degree and state certification, as well as continuing education. It's easier than becoming a doctor, yes, but it's not a cakewalk.  And frankly, if it were harder to do, it would limit the number of teachers entering the workforce, and we already face problems with class overcrowding due to not enough qualified teachers. That's higher than the education requirement to be a police officer in most states.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do doctors know or decide what antibiotic to prescribe for an illness?",
        "response": "LOL I'll try to give an answer that has a bit less hatred towards doctors than the other guy. When the doctor see all the symptoms, he can form a list of differential diagnoses (a list of potential causes). Running cultures will help you pinpoint the exact disease, but that involves the patient coming backing in 2 weeks, and not receiving any relief until then. Since patients don't like that (understandably), doctors give what's called \"Empirical therapy,\" where you treat the most likely cause. It's easy to differentiate if it's a bacterial or viral infection right away. When choosing the exact antibiotic (if it is bacterial), there are a number of right answers. If a lot of patients have recently come in with a certain disease, then doctors will give an antibiotic that works well against that disease (but is still good enough for other diseases). If there hasn't been an outbreak in that clinic, then the doctor is more likely to give broad-range antibiotics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it unhealthy for parts of the body to fall asleep?",
        "response": "Yes and no. Depends on the degree. If a normal person, you won't let something fall asleep enough to actually damage it. You'll move it. However, with the compression of blood vessels and nerves, there is some risk of injury if prolonged.  One example of this is \"saturday night palsy.\" People pass out drunk with their arm in a weird position, it falls asleep, and they are too drunk to move it in their sleep. They wake up with nerve damage.  A second example of this is during surgery, when you are paralyzed and anesthestized. If you are mal-positioned during surgery, you can wake up with damage from nerve compression. This is a very common lawsuit in anesthesia (second to chipped teeth).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do all electromagnetic waves bend in the same way light does when it changes media?",
        "response": "You can see this phenomenon with other electromagnetic waves -- [here](_URL_1_) for example is a material with an index of refraction of 38.6 for waves of around 10^(12) Hz. As another example, radio waves undergo refraction when they travel into the [ionosphere](_URL_0_). And it's not just electromagnetic waves. You can see refraction with [sound waves](_URL_2_), for example.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Gravity wave compression",
        "response": "While you wait for an expert I'll note a few things: 1. A gravity wave is different to a gravitational wave. 1. Questions starting with \"if the current laws of physics weren't true ...\" can't be answered with the current laws of physics. 1. Despite years of efforts we have yet to directly detect a single gravitational wave, much less Doppler effects on them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the coldest days in the winter when there is no cloud cover?",
        "response": "Clouds are like a blanket, trapping heat. When there are no clouds, the heat from the earth has a freer path to space.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "We know the body “burns” fat when losing weight, but how does it get rid of all the extra nerves, blood vessels, and skin cells it creates when gaining weight?",
        "response": "The cells that become \"extra\" will apoptose(die) and otherwise be breakdown. This process especially on the protein level (necessary in skin because of lots of collagen). Is not fast and due to severe epigenetic effects from the obesity may not return to normal easily. Cosmetic surgery is generally used to help this along for large differences.  They don't get \"burned\" per se but your body slowly realizes you don't need them and will devascularize the blood vessels and degrade the collagen/keratin in skin. This process is limited by both time and degree of change which is why you get stretch marks(skin collagen synthesis not keeping up) when quickly get fat/ muscular and get \"flaps or a lack of\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Industrial Revolution play a role in ending slavery?",
        "response": "It was a key enabler. While lots of folks were against the principle of slavery, it was hard to outlaw a practice that was essential to parts of the economy. Industrial machinery made it possible to spend money on machinery rather than slaves, for those who so choose. The abolitionists were now trying to regulate a choice, rather than end an industry, a much more tenable political cause.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Stephen Hawking talk through his computer?",
        "response": "Stephen lost his ability to speak many years ago after a surgery. Unfortunately he had already at that time lost control of most of his limbs, but in the beginning he wrote using a tiny joystick and picked out letters one by one to form words. Last time I saw a documentary the joystick is nowadays a small sensor that he nudges with his cheek (one of the few muscles he can still voluntarily control) to control the computer. The actual speaking is done with a speech synthesiser; computer software that attempt to speak from written text.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Siege Engines and Defenses",
        "response": "None of it. Siege warfare wasn't something you could make a movie of. (although to be honest Acre and Jerusalem fell to direct assaults) Drive civilians from the surrounding area to the fortification. Burn or destroy everything in the area. Wait. (the civilians need food,) The lord makes his choice. (surrender, sacrifice or starve) When he forces his own civilians out to preserve his own food supply slaughter them. (or if you're the black prince just block their motion and watch whilst they starve to death in front of their lord) Pop out the party hats and retreat for the winter.  Come back next year.  (all the people who can make food will be dead and lords ain't notoriously good farmers cos you cant eat taxes)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If medical marijuana is such a miracle drug, why don't pharmaceutical companies make a pill form of THC? That way patients that can use the drug without the stoner stigma.",
        "response": "They do, and they have for a long time. Marinol has been in use for over a decade. I couldn't nail down a date, but in 02 there was an effort to get marijuana classified the same as Marinol, but it was unsuccessful, so its been around at least that long",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does one decide to be a Republican or Democrat?",
        "response": "First method is that you decide what matters most to you, and what you believe. Choose the party that best aligns with your beliefs. If neither party fits well, abstain from voting or vote for a third party that matches your beliefs. For example: socially, I am very very liberal. Fiscally, I would say I'm moderately conservative. I also believe social issues take precedence over fiscal issues. Ergo, I vote democrat. Others may use different methods. For example, they may only care at all about one issue. Depending on which side of the issue a party typically sides, that's how you vote. For example: I believe abortion is the murder of babies. Baby murder should be stopped no matter what. The Republican party tries to stop abortions. I vote Republican. The third and final way that I know about is based on family and community. You vote based on how your family votes. For example: I don't care about politics. My family, however, does. I want to fit in with my family. So I vote for whoever they vote for.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Earth moves far and long enough from the sun, would the core freeze? And if so, how long would it take?",
        "response": "The internal heat budget of the Earth is not influenced appreciably by solar radiation. Rocks are generally not great conductors, so the incoming solar radiation only effects the temperature down to a few 10s of meters below the surface. The two main sources of internal heat are [primordial heat](_URL_4_) (i.e. heat left over from the formation of Earth, this is gradually decreasing through time) and [radiogenic heat](_URL_0_) (i.e. heat from the radioactive decay of elements like ^238 U, ^235 U ,^232 Th, and ^40 K, this is adding heat to the Earth). There are other sources of heat as well, such as frictional heating from the moving of material, both the [rising of plumes](_URL_1_) and [sinking of dense material](_URL_3_) and [latent heat generated by the solidification of the outer liquid core](_URL_2_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a person moves their eyes from the left-most position to the right-most position, the Field of View seems to \"jump\" rather than smoothly panning. Why is this?",
        "response": "Those are two different kinds of motions your eyes are capable of making: [saccades](_URL_1_) and [smooth pursuit](_URL_0_). There is some amount of masking / blocking of processing of visual information that occurs when you make a saccade. This is called [saccadic masking or suppression](_URL_2_). I recommend starting with these basic readings and coming back with a more specific question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Hydrology: Does river discharge affect bathymetry?",
        "response": "It is the discharge of large rivers which creates river deltas. As the rivers widen at the sea sediment settle out due to the slower water flow. New land is formed damming the river into smaller diverging rivers. I hope this helped. :) -Science Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Without noticeable seasons, did cultures that lived on the equator still come up with the year as a unit of time? If not, how did they denote long lengths of time?",
        "response": "At least as it applies to the Pacific; Definitely; despite the seasons not appearing to change as dramatically, the stars in the night's sky do alter throughout the year. For instance the Makahiki in Hawaii is sometimes referred to as a new years celebration; but Hawaii was not alone Tahiti and elsewhere in Polynesia celebrated ceremonies marking the rise of the Pleiades Star Cluster (though of course they had their own names for it). That said; there are definitely noticeable seasons at least in the equatorial/tropical Pacific though the changes appear slight to people used to more dramatic shifts. * *edited for grammar*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the area around a wound hotter than an area without a wound?",
        "response": "The sensation of heat is caused by inflammation in response to your wound. Specifically, the [heat comes from increased blood flow](_URL_1_). While this is a local response in that it's around the wound rather than your whole body, it still involves peripheral areas responding and is only felt in the skin - so around the edges of the scratch itself if it's deep enough to pierce through the skin.  Nociceptive afferent terminals are responsible for you sensing the pain, and may also cover a larger surface area. Researchers have demonstrated that people are only able to localize thermal pain sensation within 8.6mm [[Schlereth et al. (2001) Pain](_URL_0_)] which could certainly indicate that it's your perception that's \"the problem\", rather than the true thermal differences near and within a few mm of the wound itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If nicotine increases the flow of adrenaline why does it feel relaxing?",
        "response": "Because of nicotine addiction. You are feeling relaxed because when you smoke you are returning your body to the level of nicotine it is used to.  If you aren't a regular smoker, nicotine has a much more stimulating effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are there no insects in the ocean?",
        "response": "[These guys](_URL_0_) live on the ocean surface. Oceans are full of crustaceans which are the closest relatives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does coke in a glass bottle, or in a can, taste noticeably different from coke from plastic bottles?",
        "response": "not to mention you might be buying coke made in mexico, 'hecho en mexico' where they still use real sugar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's up with the frequency of nitrogen in basic compounds?",
        "response": "That nitrogen has a lone pair of electrons. It will be able to donate it and act as a Lewis base.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the period table end at atomic number 103? Why can't there be elements with higher atomic numbers?",
        "response": "There are elements above 103. Right now it goes up to 118. But the reason it doesn't go higher is 'cause we just haven't discovered or been able to create those elements as of yet. Also, the higher you get the(generally) more unstable you get. Elements in the hundreds can generally only exist for a few seconds before they decay into lighter elements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why most acne treatments' active ingredient is either salicylic acid or benzoyl peroxide but never both?",
        "response": "Not true. Effaclar has both and I believe there are a few others on the market. They do entirely different things to try and solve the same problem. BPO is an anti-bacterial that kills the bugs causing the infection and salicylic acid exfoliates and reduces inflammation.  Both ingredients are a bitch to work with from a manufacturing standpoint. BPO is highly explosive if it dries out, so storing and working with it is a pain. LRP (L'Oreal) contracts out the manufacture of it because they don't want it in their factory. Salicylic acid reacts very strongly with any ferrous metal, so you have to be absolutely certain that any metal it comes into contact with is 316L. Even a low-grade stainless steel will cause the solution to turn a very dark purple color and it will grow crystals really easily. Huge pain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come 3D modeling software will take hours to render a single high quality image of a car, while a video game like Gran Turismo or Forza will display 30 images per second that look just as good?",
        "response": "they don't look just as good.  they're way less detailed.  but you don't notice because you're not scrutinizing the detail of how the detailed the ferrari badge looks when you're going around the road.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes whiteheads, cysts, etc. to build up in pressure and \"squirt\" out of the point when squeezed/stabbed?",
        "response": "The contents of cysts are mostly dead cells, and proteins, they build up and have no where to go, that's what builds up the pressure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that when it’s hot we can walk miles without sweating but once we stand a bit after that walk we start sweating a lot?",
        "response": "You are sweating it is just that the sweat is evaporating and cooling the skin as it is supposed to do, once you stop your body is no longer as hot as it was and isn't evaporating the moisture away, but the sweat is at the same level. In addition your motion through the air assists in the evaporation again standing still reduces this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is pH logarithmic?",
        "response": "Basically just because it's easier to use that way. With pH, you're dealing with the concentration of hydrogen ions in a solution, which is a number that spans many many orders of magnitude. At a pH of 0, [H+] = 1 mol/L, at a pH of 14, [H+] = 0.000000000001 mol/L.  A lot of the time it's just easier to say \"the solution should be at pH 7.0\", rather than having to deal with scientific notation, metric prefixes, saying \"the hydrogen ion concentration of the solution should be 100 nmol/L\", etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When people are really scared, why is their first reaction tensing up and freezing instead of running away?",
        "response": "Freezing up and not making sound can make it much harder for a predator to notice you. Their sight is similar to ours in that they find it easier to notice motion than things that are standing still. Fear doesn't just have to be caused by a mammoth charging at you!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Amazon can pay $0 in Federal taxes",
        "response": "There are a lot of ways, but an easy way is don't bring your money home (USA). Say you live in Bahamas, but only work in US. Corporate tax is based on where you register your \"HQ\" or \"home\". If your home is in a no tax state, then you pay no tax. Another way is to spend all the money you made improving your company, like buying new tables or chairs. Money spend on improvement is subtracted from your tax. So you can effectively pay \"0\" tax, but reinvesting in your company.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do people who eat fewer calories live longer?",
        "response": "There is an idea called [caloric restriction](_URL_2_) which has been demonstrated to increase lifespan in a number of model organisms. We don't know yet whether this also works in humans (it isn't an easy experiment to pull off). Some scientists are **very** convinced that it works. In [2012](_URL_1_), a study in monkeys suggested that it doesn't have an effect on aging. In [2014](_URL_0_), a study in monkeys suggested that it **does** have an effect on aging. Both were published in very good journals (by the same publishing group, Nature)! I'd say that the jury is still out, but plenty of scientists would disagree, and I personally know several that are applying caloric restriction to their own diets.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "are wildlife parks cruel to animals and if so why and how?",
        "response": "In wildlife parks, animals are left to live as they would have naturally without humans. If a park isn't doing that, then it's not a \"wildlife\" park. It's only cruel if you believe animals should not be allowed to live in their natural habitat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If humans have only been around for about 100,000 years, then why did it take 95,000 years for us to do anything rememberable? Did our brains become more evolved in the last few thousand years?",
        "response": "This is not really a biology question to start, and should probably be re-tagged with anthropology if it exists. The question is almost like asking why humans didn't invent computers 200 years ago as opposed to 70 years. It takes time for humans to figure things out, and when there is very little knowledge about the world they live in, it takes a very long time to make a decent progress. (For example, we know as a matter of fact that sowing crop seeds will yield crops. 100,000 years back, staple crops like rice did not even exist in the present form.) Second, progress and population are dependent on each other. 100,000 years ago, there were not that many people to make progress. Now we count some seven billion, with estimated 500,000 people dedicated to biology alone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can animals experience embarrassment?",
        "response": "A few years ago my mother was doing some ridiculous television exercises. As she was repeating an upwards arm stretch, my dog (who was silently laying on the floor) suddenly got up on her hind legs and raised her front legs into the air. My family all burst out laughing and my poor dog laid on the floor and started rubbing and covering her face with her paws while lightly whimpering. I'm pretty damn sure she was embarrassed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are those who step out of their traditional gender roles and identities criticized?",
        "response": "Because people are dicks? I think a lot of people automatically 'hate' things that are different, and it seems to be really exaggerated when it's gender roles for whatever reason.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If cooked, would human meat be red, white, or an \"other\" similar to pork.",
        "response": "Cannibal serial killers like Arthur Shawcross and Jeffrey Dahmer claim that humans taste like roast pork. That freaks me out because I love roast pork.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do milk alternatives [soy almond etc] get called milk and not *name* water?",
        "response": "Because they are white in color, and often used as a milk alternative. If they were clear they would be called waters or juices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Christians think there are no prophets after Jesus (Muhammad, John Smith, etc.) even though they believe in the prophets that came before Jesus (Adam, Noah, Abraham, and Moses)?",
        "response": "Christians don't actually necessarily believe that there have been no prophets since Christ. Some would argue that now that we have the Bible, there is no need for prophets. Others just don't like to assign the word \"prophet\" except to people who the Bible refers to as such. But Jesus, the disciples, and then Paul, all said that people would prophesy in the future. The New Testament talks about the Holy Spirit causing Christians to prophesy, so it could be that the church is no longer divided into prophets and non-prophets. *All* Christians are potential prophets. (But what that means, exactly, depends on what denomination you belong to.) And consider Paul. He lived after Jesus' died. He experienced a divine revelation, and his letters to the early church are included in the New Testament. Christians consider them inspired scripture. Basically, Paul is a prophet in all but name. Since biblical times, when someone is divinely inspired the church tends to call them \"saints\" rather than \"prophets.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to have two quantities with the same dimension but different units?",
        "response": "It is possible for two quantities to have the same dimensions but different units. for example, have the dimension [L]. However, a length may be expressed in any length unit, such as kilometers, meters, centimeters, millimeters, inches, feet or yards.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "All colours are made from CMYK, right? Can you produce any SCENT similarly to producing any colour?",
        "response": "First, some slight pedantry. Strictly speaking, CMY is a *subtractive* system. RGB is the correct way to think of colour, really, even though mixing lights is a little less intuitive than mixing paints. (A cyan paint reflects B and G; a yellow paint reflects G and R; mix them together, and you get a paint that only reflects G. You *lose* colour by mixing paints. More to the point, the receptors in our eyes discern red, green and blue.) Whereas your eye only really has three types of colour receptors, your nose (and tongue) has hundreds or maybe thousands of different smell (and taste) receptors. This is understandable - light is really just a wave that can take on different wavelengths. Smell is far more complicated - smells are really just certain chemical compounds that can take on many, many different shapes and forms. This means that we can tell apart far more different types of taste and smell (which explains why we are so bad at *describing* them) than we can tell apart colours.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why a helicopter can’t drop me on the top of Mount Everest",
        "response": "Because it's too high, at those altitudes the helicopters engine just cannot produce enough power , the blades also just cannot produce enough thrust , the higher the plane or helicopter flies the less thrust and power it has its called density altitude, and it's due to the fact that the higher you go the more spred out air particles become due to the fall in pressure  So if the air is thin it's sucking in less air to the motor which produces less power and the blades have less air to push against so less thrust",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the tradition of the Rosary (more generally prayer beads) an Italian or Middle Eastern (Israeli [Hebrew, tribe of Israel] or non-Hebrew Middle Eastern) pagan tradition?",
        "response": "Prayer beads predate Catholicism. Hindus and Buddhists were using them long before Christians, and for the very same reason; to keep count of the number of prayers said without having to lose focus on the prayers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it true that Napoleon Bonaparte shod his horses backwards to trick the Russians?",
        "response": "His horse would be lame in no time. Take a look at why horses are shod and how it's done. That would be extremely painful for the horse not allowing it to walk correctly, on top of Bonaparte risking not being mounted and not having effective cavalry? I'd say it's completely made up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Robert M. Price said in a recent podcast episode that there are Quran manuscripts dating from the 5th and 6th centuries, suggesting that it was originally a Christian text. Is there any legitimacy to this theory?",
        "response": "Christian or Jewish influence on the Quran is one of the oldest topics of inquiry Quranic studies. More recently, a scholar named Christoph Luxenberg (among others) has suggested that based on supposed Syriac readings of the text that the Quran may have begun as a Christian lectionary. While the need to examine possibly Syriac etymologies in the Quran is widely accepted, Luxenberg's overall thesis is not, and his views are regarded as fringe. As to \"Quran manuscripts dating from the 5th and 6th centuries\" that would be the biggest news in the history of the field. Intact Quran manuscripts before Muhammad? If he's found such manuscripts, then that would be a revolutionary discovery.  (Hint: They don't exist.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If what you sound like to yourself isn't what you really sound like, how are people able to do spot-on voice impersonations of other people, or fictional characters?",
        "response": "They are professionals, they don't just wing it, they practice for weeks with recordings of themselves.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a can of pop can have 9 tea spoons of sugar in it, then why would a cup of tea with 4 sugars in make me feel sick, yet I could chug a litre of pop and feel fine?",
        "response": "Carbonation. The co2 becomes carbolic acid and neutralizes the sweetness of the sugar. Soda is acid enough to damage the enamel of your teeth, and sweet enough to give you a whole host of other problems. And yet, since it's both at the same time, it's perceived as neither. Some sodas of course also use orthophosphoric acid and citric acid as part of the recipe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Family Video still literally everywhere while Blockbuster burst into flames years ago?",
        "response": "According to Wikipedia, they own the estates that are housing them. Also, they made partnerships with other businesses, like pizza delivery, hair salons, gas stations or fitness centers. And apparently their prices are really low ($2 or $3 for a new release). [This](_URL_0_) article deals exactly with the reasons why Family Video is still in business but other video rentals closed down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen to copper wire used as a equipment grounding conductor in the event of a lightning strike?",
        "response": "A lightning strike is in the range of 50C to 350C of electric charge transfer. An example of a very fast 50C charge transfer would be a 1.6MJ cap bank discharging through a 32mOhm impedance. An example current would be 1MA sourced from 32kV across a 1.6mF cap bank, which would dump most of its energy in about 50us (assuming your load happened to be around 100-500nH). I can tell you from experience that a 4AWG copper jumper cable that is 1m long will almost completely vaporize if even 10C from such a cap bank discharges through it, although you will need a fortuitously placed rogowski coil array to determine exactly how much... I would definitely not recommend trying this btw. Even if the wire is completely vaporized, a significant portion of the current will flow through the copper plasma before the arc has an opportunity to move very far. The arc will try to take the *highest* inductance shape possible, so it will try to straighten out any bends and open any loops. Edit: lowest changed to highest...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Freddie Gray shooting a \"Black Lives Matter\" issue when the only officer being charged with murder is Black, the city is mostly Black, the police force is mostly Black, the mayor is Black, the prosecuting attorney is Black, the president is Black, and the attorney general is Black?",
        "response": "The data that show racial bias among police officers does not show significant differences based on the race of the officer. It seems that black officers are just as likely to profile black men as white officers are. As for the news coverage, the news is covering this mostly because of the aftermath, meaning the protests and the riots, and also because Ferguson was so recent. If this was just a killing with no protests and no riots, it may have had a couple of minutes on a news wrap-up just because this sort of thing is in the national consciousness right now, but other than that it wouldn't be covered outside of the local Baltimore media.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given that plants are as old(or older) than sentient life, Why haven't they evolved to become borderline animals.",
        "response": "Evolution takes many paths. As life evolved various traits are selected for. In some cases a plant finds its niche and no further evolution is required. If you look at plants you see a huge variety which can live in various environments. Even in the same environments you see a broad range of plants each with different strategies to survive. Make no mistake...plants are in their own war for survival. As life sought various ways of survival we got sentient life. Some organisms found the ability to move and eat plants was useful and you go from there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the mental health effects of being a celebrity?",
        "response": "Ego goes a bit out of whack but when people are literally stalking you as if you shit gold its just like how else do you deal with these people, im sorry ive never answered an eli5 before so the eli5 version is, you think youre better than them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do protests actually do? Do they affect anything?",
        "response": "You're talking about it, so that's half the battle. They aim to spread the word and get people who wouldn't care/know about an issue to be concern with it and possibly help with the fight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does there appear to be a higher concentration of craters on the poles of the Moon?",
        "response": "You're kind of right. There are more craters in general on the dark side of the moon. The near side features *mare* or seas. Essentially these are lava flows.   The story of why one side is different is intimately connected with the formation of the Earth-Moon system. This is an active area of research. But basically imagine one side having a thinner crust. Would highly recommend [this talk](_URL_0_) given at the SETI Institute in January.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes a ‘second wind’ of energy? For example staying awake 24hrs feeling extremely groggy, then suddenly wide awake again?",
        "response": "In this particular case, it's your brain flooding with histamines, adrenaline, and other such chemicals that affect alertness and sleep. Your body is basically going \"oh shit, we must be staying awake for a good reason, let's involve the parasympathetic nervous system so we stay awake and alert because otherwise, we might die\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do humans all look different facially but not animals?",
        "response": "You're using a brain wired to see the differences in humans and not other animals to state that humans look different and animals look the same.  > Is it that the more advanced the animal is There is no concept of \"advanced\" in evolution. We are not more advanced than ants or mice. We're different at best you could claim more complex.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens physiologically to a crash victim in an airplane crash on impact?",
        "response": "I think you found the right man for this question. I have a airport right by my hospital and I am trained to deal with aviation emergencies. I just need to know what type of aircraft we are talking about. Also what type(s) of aircraft are you interested in hearing about (private prop plane, private jet, charter jet, commercial jet, *helicopter*? As soon as you get back to me I will be able to help you out. Also if you can give me any additional information I can give you a better answer or at least give you the most probable scenarios.  I would also like to say that I am very sorry for your loss, and I hope this information can help you deal with your loss easier. If there is any details you would like me to leave out to make this easier for you, please let me know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does petrol in america only contain 87 octane where as in england it contains minimum 95? (where i live)",
        "response": "The octane rating of a fuel measures how much compression the fuel can withstand before igniting. Higher octane ratings (and therefore more compressible fuel) are used in high performance engines that need to compress the fuel before igniting it.  There are a couple different ways to measure the octane rating. One method yields the Research Octane Number (RON), which is determined in the lab under pretty ideal conditions. Another rating is the Motor Octane Number (MON) which is determined under less ideal conditions (higher RPM motor, preheated fuel mixture, etc.). The MON is usually about 10 octane less than the RON. In the US gas stations have to advertise the average of the RON and MON. This is called the (R+M)/2 method. In the UK petrol stations can advertise just the RON. This is why the numbers are higher in the UK.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With all the talk of data caps, how much of my data is from advertisements?",
        "response": "> How is that even fair, to pay for data we dont want? Because the websites you do want require you view them to see their content. You cant just say I dont want the ads. The ads are your payment for visiting the site that had them on it. Thats why that data is perfectly fair to count. Im not saying it doesn't suck, but its certainly not unfair. ~~Edit: Really, downvotes guys? Its true. Ads are payments for the free content we enjoy.~~",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we drive with one foot?",
        "response": "If you drive a manual, you use your left foot for the clutch. Since it's necessary to use the clutch+brake together, *and* the clutch and accelerator (gas pedal) together, having the clutch on a different foot to the other pedals makes sense. For an automatic gearbox, we no longer use the clutch.... but the other controls are unchanged.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the vast majority of video cameras and websites support HD video nowadays, why is the porn industry still flooded with low definition videos?",
        "response": "My best guess would be that they want you to subscribe for the higher quality/full length content. Why give away your best product for free right?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Cortez communicate with his native allies while he destroyed the Aztec empire? Were there translators? How were they educated in so little time?",
        "response": "There is always room for more discussion, but perhaps the section [How did colonialists talk with indigenous people?](_URL_0_) in our FAQ may answer your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Latin split into all the romance languages and when did the speakers of these new languages realize?",
        "response": "The Council of Tours, in 813, directed priests to give their sermons in the \"simple Roman language,\" as they put it, a recognition that the language spoken by the common people was different enough from the Latin used by the Church as to no longer be intelligible. The Oaths of Strasbourg in 842 were written down in Latin, Old High German and an early form of French, and are the earliest text in a language that led to modern French. Latin continued to be the usual language in writing and the international lingua franca, so to speak, for hundreds of years after the fall of the Roman Empire, which makes it difficult to date precisely -- by the time writing in the Romance languages became common, those languages would have already been established for probably hundreds of years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you pour a liquid from a container why does some of it roll down the outer side of the container and drip at the peak",
        "response": "It’s called surface tension. The molecules slightly drip over the edge microscopically and more follow quickly. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between a legitimately demanding game and a poorly optimized one?",
        "response": "Without looking into the code itself it's hard to tell. It's not always obvious what a game is doing in the background, it might look like you're just moving around but the enemies might be engaging in complex AI behavior to develop a strategy to attack you. Or they might be incredibly stupid and just wait until you get close to them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do kids love bright colors so much, but as they get older, bright colors seem less important?",
        "response": "While growing, humans use attention to collect useful information. In early childhood attention is mostly focused on easily perceivable differences between events and things like contrast, brightness, loudness, primary tastes etc When you grow older you already collected that information and unless some part of your focus got permanently attracted to some of it, like getting hobby of collecting colorful things, your attention moves onto other, more complex and nuanced differences like differences in art style, subtle tastes, refined music styles etc.  Why is it working this way? Because brain builds more complex concepts using more simple ones increasing neural network complexity for their representation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do people kiss mouth to mouth to express their love to each other, and has this method always been the way (if we don't count sex)?",
        "response": "_URL_0_ This video captures a lot of the reasons why we kiss, though kissing is hypothesized to be a learned behavior rather than an instinctual one. Mainly due to not all human tribes being documented as kissers, wherein it's thought that kissing may have originated from mothers kiss-feeding their babies. Another hypothesize is that kissing may in fact be instinctual considering animals such as the Bonobo and the Chimpanzee monkey kiss as means of social interaction. Kissing, by humans at least, is believed to be traced from India all the way back as far as 326 BC. The main reason why we kiss is because our lips house a lot of sensitive nerve endings, resulting in a wave of information being sent to the brain during a kiss; aka, it's a pleasurable feeling. The secondary reason for kissing is to swap pheromones and bacteria with potential mates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some non carbonated, sealed drinks increase in pressure when you shake them?",
        "response": "Gases dissolve into liquids at varying amounts depending on the liquid and gas. Gases also escape liquids based on the pressure of gas above the liquid. A bottle of juice at rest has a volume of gas on top, a volume of liquid on bottom, and a surface area of interface in the middle, all at equilibrium. When you shake a bottle, you produce more surface area which allows dissolved gas to partition from the liquid into the bulk gas phase. When you stop shaking there is exists a greater amount of gas in the bulk gas phase, which results in a greater pressure. That pressure of gas either escapes when you open the bottle, or is forced back into the liquid to establish the initial equilibrium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did kings legitimize themselves and why did people follow them?",
        "response": "hi! you might find some useful background info in these FAQ* sections: [Origin of monarchies](_URL_5_) [Advantages of monarchy](_URL_2_) and as for the divine right of kings, I've found a bunch of posts on the topic (maybe it's time for another section for the FAQ!) [How does a monarchy establish it's divine right?](_URL_0_) [How are rulers deemed \"legitimate\" or not?](_URL_1_) [If the pharaohs were suppose to rule by divine right, how did they justify dynastic changes?](_URL_6_) [How did the divine right of kings originate in Europe after the fall of the Roman Empire?](_URL_3_) [How did monarchs in buddhist nations justify their power?](_URL_4_) - Tibet, China, Thailand [If two leaders who rule by divine right belong to different religions that consider the other incorrect or blasphemous are on good terms, how would they acknowledge the other's right to rule?](_URL_7_) *see the popular questions link on the sidebar or the wiki tab",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible there are naturally occurring, stable, muon based \"isotopes\" for elements beside hydrogen?",
        "response": "Muons will always decay if they can and the decay releases a lot of energy. There is no known place where this decay would be impossible. What you can do is e.g. add a muon to a nitrogen atom. The muon will be very close to the nucleus, to electrons farther out it \"looks\" like a carbon nucleus. You form something that behaves like carbon chemically - for a few microseconds before the muon decays.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does it really mean if \"four out of five\" dentists approve my toothpaste? Does someone actually poll dentists?",
        "response": "The marketing firm polls the dentists. The polls are unscientific as hell - a usual scenario would be \"Here's a big box of free toothpaste. Now, would you recommend using SmileWhite brand toothpaste, or no toothpaste ever?\" Edit: Most toothpastes are basically identical products - powdered chalk as a polishing agent, water and some sort of thickener for texture, mint flavoring, and fluorescent dyes to make your teeth look whiter in certain lights. Whitening toothpastes have bleaching agents in them; enamel restoring ones have more fluoride, but the brands are pretty much equivalent. If you see the ADA accepted mark on a toothpaste, it's not a recommendation *per se*; it just means \"This product was tested and we can confirm the advertisements are accurate\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When they piece together old dinosaur bones, how do they know they got it right? Do they?",
        "response": "It's very hard to be sure, and sometimes they *do* get it wrong. For decades, there was something called brontosaurus that was exactly the same sort of error you suggested, where the wrong sort of head was put onto a body, and the body was wrongly felt to be a different species than apatosaurus. It wasn't until they found more samples that this became obvious.  In general though, you have to just look at which bones are found in proximity to which others to be reasonably sure that they really are the same species, and put them together according to what is well known about comparative anatomy. It won't always be absolutely correct, but as new bones are found, corrections can be made.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What state of matter is gel/jelly?",
        "response": "Think of it as a sponge made out of protein, with water suspended in it. The sponge itself is solid, but the water inside it is liquid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What foods are something that we can truly consider \"American,\" where no one else can claim to have been a big factor in its creation?",
        "response": "Smoked Brisket. Definitely first popularized in the US (best I can tell, in Texas ~1950's when BBQ grills/smokers first became affordable), though first sourced by Jews in El Paso ~ 1910's _URL_0_ _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do motion activated lights \"see\" me in the dark?",
        "response": "In the home or office, the motion activated lights are usually based off changes in heat with infrared sensors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't audiobooks and ebooks unlimited?",
        "response": "Not a technology issue. It's money. The publishers want money for electronic material in the same way they get for physical materials. They use technology to limit it in the way you see. The libraries pay for each digital copy, typically as part of some larger subscription type contract. The details of how many copies of what are in the contract with the library. Give the library more money and they'll be able to buy more!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The painful little bump you get on your tongue sometimes.",
        "response": "These are enlarged taste buds and commonly known as lie bumps. The cause is unknown but it is assumed to be from medical conditions and/or treatments, damage from teeth or objects placed in the mouth, or certain foods. They usually last several days and can be treated for pain using pain relieving gels. Some people actually clip them off using sterilized tweezers or other devices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The guy that spent $700 at a vet who couldn't find what was wrong with his cat, only to have a different vet immediately know what's wrong, are there any consequences for the original vet?",
        "response": "Basically no. If a professional carries out their duties to the best of their ability with no intent of fraud then you should have picked a better vet. They can be sued but as long as the vet wasn't negligent the suit wouldn't be successful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does body temperature change when you're sleeping?.",
        "response": "Body temperature can naturally fluctuate up to a degree Celsius or more throughout the day. It varies with your circadian rhythm, amongst other factors. Tends to be lowest in the middle of the night or early morning. _URL_0_ Secondary source: I measure body temps as my job.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big and powerful would angel wings need to be to allow them to fly?",
        "response": "This paper, [Integrated Pest Management of Manifestations as Infestations or, Angels Are Insects](_URL_0_), is the definitive scientific evaluation of the Entomological Biology, Evolution and Systematics of Angels. It begins, in part, with this observation:  > This six-limbed state is not a vertebrate structure, as any look at basic vertebrate anatomy quickly reveals. It then describes observations of: Wing surfaces Angelic skeletons The aerodynamics of angels The dilemma of horns It continues by evaluating the various descriptions of angelic capabilities, and weaknesses. While it does not directly address your question about wing dimension, much can be inferred from its conclusions. I very much enjoyed the presentation of this paper by its authors in 2003. Obviously, it made quite an impression since I remembered it even now, although its subject is outside my expertise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the weight of a city not throw off the earth's rotation?",
        "response": "It is insignificant in relation to the overall forces.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What speed is the universe expanding at, and how can we measure it?",
        "response": "The expansion of the universe follows [Hubble's Law](_URL_0_), which essentially states that objects recede from each other at a rate proportional to the distance between them. So objects in the universe aren't all moving away from each other at the same speed- very distant objects are moving away from us much faster than closer objects. The 'speed' of this (technically a speed/distance) is known as the hubble constant, and though its value is a bit uncertain, it's around (70 km/s)/megaparsec.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How has the universe conserved energy from the big bang until now?",
        "response": "Energy is not conserved during the expansion of the Universe, in fact it gets created. Conservation of energy follows from time-translation invariance, which an expanding Universe clearly does not have. Most of the energy present now in the Universe was in fact created during the inflationary era.  During inflation space was filled with a constant energy density from a field called the inflaton; a constant energy density induces an exponential expansion of space. Since the volume of a given region expands exponentially, and energy density stays a constant (instead of \"diluting\" like normal matter) then the total energy in the region grows exponentially. When inflation ended, the inflaton collapsed to its ground state and its energy turned into matter and radiation. After that, the rate of creation of energy has been much, much smaller, but technically energy is still being created today. (inb4 negative gravitational energy means the total energy is zero)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is our general idea of life in the ancient times and medieval times pretty accurate?",
        "response": "While feats shown in movies are embellished to make for good cinema there is no doubt that armies such as the ancient Romans and Spartans were formidable fighting forces. The success of their respective countries/city-states in warfare bears this out. Depending on the period of history we have a pretty good idea of the general overview of how countries were run and how major political events transpired. Our understanding of history is usually from the viewpoint of those educated enough to record events. For this reason much of our understanding of history comes from nobility and religious groups. In many cases our understanding of how daily life transpired for a common person is completely limited to interpretation of physical artifacts. Overall though it really varies, depending on the time period and location historians can have access to lots of or little data. tldr: It depends on the time and place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can bacteria/fungus live in an aircraft fuel tank?",
        "response": "Aircraft fuel is toxic for humans. But fuel is hydrocarbons. Which is hydrogen and carbon atoms together. Which is what cells like to nomnom. Some organisms have a metabolism that can live on ingesting hydrocarbons. And the fuel doesn't see temperature extremes. If it did, the tank would blow up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a keyboard were made in alphabetical order would we be able to type as efficiently as we can with a QWERTY keyboard given we have the same amount of practice?",
        "response": "QWERTY was never designed for fast typing speed. It was designed to prevent the moving parts of typewriters from blocking each other if the letters follow each other too fast. As an example, \"st\" follow each other frequently in English, so they shouldn't appear next to each other (as they would in alphabetical order). For computer keyboards this consideration is completely meaningless, of course, and it would make sense to use a different layout designed for faster 10 finger typing. But QWERTY is standard now and unlikely to go away. There are [alternatives](_URL_0_). If you type a lot, usually on your own computer and rarely on others, it can be interesting to learn one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With respect to the era you specialize in, what common courtesies existed then and there that no longer exist?",
        "response": "Hey man, it's an interesting question! However, it's also [against the rules of the subreddit](_URL_0_) :/ Maybe you could rephrase it or save it for the Friday Free-for-All? :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If someone mails me illegal drugs, why can I be arrested?",
        "response": "It needs to be proven in a court of law that you knew you were recieving drugs in the mail. The police have the power to arrest someone on reasonable suspicion a much lower standard then what is needed to find you guilty in court. Its pretty reasonable that if you got drugs in the mail you knew they were coming since people don't tend to randomly send out drugs to strangers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has Britain ever apologized to China for the Opium Wars?",
        "response": "No public statement from an official representative of the UK has come forth to apologise, nor does there seem to be any inclination from either governments to pursue an apology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do older generations look more mature and older at \"x\" age than current generations at \"x\" age",
        "response": "Are you talking about when you look at a picture of your dad (for example) when he was 20, and compared to 20 year olds today, he looks more mature? It's probably just because of his style... the type of clothes he wore, how he wore his hair, etc. You associate that style with older people because it's the style of older generations. When they were young, they probably thought the same thing about their parents.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does room-temperature alcohol feel cold on your skin?",
        "response": "The attraction between isopropyl alcohol molecules is not as strong as, for example, that between water molecules. Isopropyl alcohol evaporates pretty quickly, providing an evaporation cooling affect much like sweat does when it evaporates, but at a much faster rate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between \"fresh\" and \"stale\" air?",
        "response": "I'll give my best guess since there's no good answer here... I suppose it's dust and dirt and whatnot, from wood and living things and other materials that degrade and give off particles. Like how water starts to taste \"old\" after a while, because it accumulates dust from the air as well as particles from its container if applicable. Fresh air probably just feels better to breath as well, because it's cool and contains lots of faint smells. Circulation distributes different smells and humidity around so it is not full of all the same junk. Perhaps things like sun and rain contribute to the pleasantness of outside air as well?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How could math change in the next 100 years?",
        "response": "A lot of interesting work is going on in foundations. Set theory is only a hundred years old. Promising alternatives are category theory and homotopy type theory. The latter is related to automated proof checking. Because everything must be computable, there's a growing interest in constructive and intuitionist philosophies of math. In particular the law of the excluded middle is not always assumed. This is a radical transformation of how we do math but the computer revolution is inevitable. I see math going this way in the next hundred years.  To be clear, of course people will still do set theory for its own sake. But set theory may no longer be regarded as foundational. And there may be less core belief in the wild infinities of set theory. On a computer, everything must be computable. I think the *computable mindset* will take over.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are sharp points not differentiable?",
        "response": "It's sort of both. If you take a function like f(x) = |x| and try to take the derivative at 0, you get [this](_URL_0_), which doesn't exist: the left-hand limit is -1, and the right-hand limit is 1. Thus, by definition, f isn't differentiable at 0. Geometrically, there isn't a unique tangent line to the curve-as you mentioned, there are infinitely many. Another way of looking at this is that differentiable functions are supposed to be \"locally linear\": if you zoom in on the graph, it eventually looks like a line. However, if you zoom in on a corner, it doesn't ever look like a line, it just keeps looking like a corner.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do computers slow down and take longer to perform even basic functions as they age?",
        "response": "Don't know if you've upgraded the software, but Chrome for example becomes is a memory hogging beast.. Each version getting worse... But that also has to do with developers targeting newer hardware... At some point your old machine can't handle the requirements of the new software",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are spider venoms made from, how does a spider produce it?",
        "response": "Spider venom is not all the same, but most are neurotoxins which are polyamines or polypeptides. Spiders produce it from a gland they have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why / how does a Crookes Radiometer spin?",
        "response": "The black side absorbs the light, and warms up. This causes the air that touches it to warm up and expand, thus pushing the vane away and making it rotate. It has nothing to do with the pressure of light, though that force also exists. If it were to be the pressure, then the thing would work in hard vaccuum (it doesn't) and it would turn in the other direction. (Reflecting is a larger momentum change than absorbing)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"The medium is the message\"",
        "response": "Example: Say I am very angry with someone. I have two options. I could send them a postcard which says \"You are a poopyhead\" or I could write it on a brick and throw it through their window. In both cases, the message is \"You are a poopyhead\". But the medium I choose - postcard vs. brick through the window - portrays far more about the message than the message itself. My choice of the *way* to get them the message is really more informative than the message.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is a fat muffin top at your belly caused because humans wear clothes around their waistline?",
        "response": "Yes, but not by much. Your fat stores are all located in/around your hips/pelvic region, they swell and become distended due to an increase in volume of fat storage. Squeezing into tighter clothing does cause certain shapes (i.e. muffin top) to form, but it has no impact on the overall volume.  So if you are carrying weight in your belly it's not like that weight is going to suddenly shift to your thights, it'll still be there but just in a different shape.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did language capability evolve such as there are many different languages instead of one universal human language?",
        "response": "Simple answer is that there's no inherent relationship between sounds and the concepts we use to refer to them. Like genes, languages gradually change over time, and any groups that don't speak to each other frequently change in different ways until they're no longer mutually intelligible. In a sense, every language now could be considered a descendant of the language(s) of the humans at the most recent global population bottleneck.  Incidentally, the same thing is true for other animals with language. Whales, monkeys, birds, etc, have local and regionally different languages taught from adults to children. For all relevant species including humans, the particular languages emerged over deep time in parallel with the genes for language (including sound making, hearing, and cognition). If that process took place in disparate environments, each language would be unique, united only by the similar biological constraints on what kind of sounds can be made and grammars can be understood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Charlie Chaplin's \"The Great Dictator\" (1940) contains a scene in which Chaplin is imprisoned in a concentration camp. What sources, if any, would Chaplin's depiction of the camps have been based on?",
        "response": "Nazi Germany had established concentration camps [as far back as 1933.](_URL_0_) Chaplin also [stated in 1974](_URL_1_), \"Had I known of the actual horrors of Nazi concentration camps, I could not have made The Great Dictator.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Buddhist concept of Anatta",
        "response": "People are like waves on the ocean. You can look at a wave and maybe think it is different from the ocean, but it's all water. When the wave crashes on the shore, where did it go? It was always water, the wave was just a shape it took for a little while. Everything is like this. Not just living things, but all things, from thoughts and feelings to the whole universe. They come and go. If we just see them as waves, we might feel sad or anxious, because a wave has a beginning and an ending. But if we see them as what they really are then there's no need to feel sad.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you exercise, does your heart beat harder or just faster?",
        "response": "Both. To effectively increase flow throughout the body, both rate & strength need to be increased. Strength is simply how much your heart muscle is contracting... no different than any other muscle in the body. However, it is possible to increase one without the other by targeting different cellular receptors. We have different medications that work by increasing one or the other, or both, administered to heart failure patients.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "For beta decay: During positron emission a proton becomes a neutron and emits a positron (and neutrino). During electron emission a neutron becomes a proton, emitting an electron (and antineutrino). How is it possible that they can convert back and forth by continuously losing particles?",
        "response": "A proton is made of 2 up quarks and 1 down quark. A neutron is 2 down quarks and 1 up quark. In beta- decay, an up quark converts to a down quark, and emits a W- boson. This boson decays to an electron and an antineutrino. In beta+ decay, a down quark converts to an up quark and emits a W+ boson, which decays to a positron and a neutrino. So at the nucleus level, what you see is a proton change to a neutron and vice-versa. But what is actually happening has to do with quarks flipping back and forth. One other thing to note is that the neutron has more mass than the proton. As a result, a free neutron can beta- decay, but a free proton cannot beta+ decay. The reaction isn't reversible (in that sense). Beta+ decay can only occur in bound nuclear states, where some of the binding energy can go into the mass needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much truth is there to the claim that radioactive water from Japan is harming those on American soil?",
        "response": "[This](_URL_1_) guy gives a good explanation about why many of these articles are BS. The misinformation and fear mongering from such articles is baffling sometimes. A simple internet search might help them understand the radiation doses they are talking about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does saliva help prevent fogging in snorkel/dive masks?",
        "response": "From my personal experience, saliva forms a transparent film on the surface of the mask, preventing condensation from forming. Anti fog sprays appear to do the same thing; coat the surface with a transparent gel like film that shields the surface form condensation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do sensations like hunger, pain, etc. come in waves rather than all at once?",
        "response": "nerves function by maintaining an electric charge, that builds up when the nerve is excited by something, and then has to recharge. So if you say cut your hand really bad, all the nerves around the cut trigger at once, and then they have to rebuild their excitation level, and then they trigger again, and then they rebuild... The result is waves of pain that correspond to how long it takes your nerves to recharge.  Alternatively if you get something like a bruise or a not bad cut, that bruise will cause your nerves to be excited, but not enough to trigger them. Then something that pushes on your bruise, even lightly (for instance, the pressure of your heartbeat passing under the bruise), will cause the nerves to trigger. Then you get throbs of pain corresponding your heartbeat. (these are much more throbby compared to waves you get from the really bad wounds, and are common in wounds that cause swelling, especially around joints where bloodflow is more constricted.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a .zip reduce the file size of its contents?",
        "response": "At the most basic level, a compression algorithm reduces non-unique data to an instruction for how to re-construct that data. Think of your great great great great great great great grandmother. Obviously that's a long piece of information, but you could compress it by writing about your great(x7) grandmother. You've taken information that was repeated and reduced it to a single instance plus how many times to repeat it. You can also take a pattern that repeats a lot and designate a symbol to represent it. We do this in English with things like copyright and trademark symbols, road signs, bathroom designations, and acronyms and initialisms. This is why some types of data are more compressible than others. Things like a Word document is going to have a lot of repetition due to the standard formatting operators, but something like an MP3 is almost all unique with very little repetition. Compression algorithms in reality are much more complex, but these are the basic techniques.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can flights \"make up time in the air\" when they depart late? If they can safely go faster, why don't they just go faster in the first place?",
        "response": "Going faster tends to decrease fuel efficiency. The airline is spending more money on this flight than they otherwise would like to, in order to avoid the headaches of customer complaints or customers missing connecting flights and getting refunds, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The quote \"No good deed goes unpunished\"...how does that make sense?",
        "response": "It means that people often don't appreciate you for doing something good, or are even outright hostile.  For instance, you hold the door open for a women and she calls you a chauvinist pig who thinks she can't open the door herself. Or you pick up a wallet that someone dropped, and they accuse you of stealing it. Stuff like that is where the phrase came from.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Asian community much less effected by systematic equality than say the Hispanic population when both groups started in the US with fairly similar situations?",
        "response": "As a mexican descendent, let my try. Mexicans come to the US with literally nothing. We have a basic education, if that, a strong back and a willingness to work for whatever to improve our lives. In Mexico, life is literally shit, ANYTHING would be better than that. The corrupt government and the lack of social structure leave too many with little chance to improve their caste in life. By taking a trek to the north, risking life, we can improve our lives by just working our ass off until our children can have a better life. It's not for us, it's for the children. Asian communities strive for academic excellence. Even in financially stagnant situations, their academic endeavors lead them to the \"better\" jobs and opportunities. If they fail to see the opportunity, it's their fault. TL:DR Mexicans just work hard, Asians at least get some education.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people only feel a acceleration or deceleration? Why don't we feel different at different velocities?",
        "response": "It's related to your semicircular canals _URL_0_ They are fluid filled rings in your ear that detect changes in velocity across all axes. Once at a constant velocity (whether stationary or at movement), they equalise, return to normal and stop sensing the acceleration/deceleration",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does yeast in bread-making not produce alcohol like yeast in brewing?",
        "response": "It does, a little. But the amount produced is very small - bread rises for a matter of a day or two, brewing can take weeks or months.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ask Anything Wednesday - Economics, Political Science, Linguistics, Anthropology",
        "response": "I've read that creativity was almost entirely dormant in the humans for most of our existence, given the fact that thousands and thousands of years could go by without so much as a step in innovation. Is this the right way to think about this? The human brain was essentially as it is today 100,000 years ago, definitely 50,000 years ago. Yet, creative progress was incredibly slow starting. Creativity is obviously a neurological process, but is it better thought of as a cultural innovation?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does receiving anti-biotics via IV differ in effectiveness from a pill?",
        "response": "Yes. When you get antibiotics in your blood immediately, you get the whole effect of the antibiotics. When you swallow them, they have to pass through your tummy, and in there a bit of it gets broken down and not used. Some more doesn't get fully into your system and you pass it. It also takes longer to get the antibiotics into your system if you swallow them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can you recycle plastic bottles, but not plastic bags and garbage bags?",
        "response": "Plastic bags are so light and fluffy that they can get blown around within the recycling center. They can get jammed up in the machines and even be responsible for breaking the machines, so often places do not accept them.  Some communities have facilities designed to process material like plastic bags, but they're not everywhere.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In a stationary glass of water (like in a cup sitting on my desk), do the water molecules that make up surface tension change places with the water molecules found in the remainder of the glass?",
        "response": "The water molecules are constantly shuffling around and changing places, and the ones on the surface are no exception. Think of it as a group of people holding up a platform. People can swap out without the platform falling, and even if one person left, the remaining people would just each take a little more weight until someone new came along. The only difference is that for water, there are billions of molecules holding up the platform. So if one or two leave, it really makes no difference.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A (probably ridiculous) question about bees posed by my six year old",
        "response": "Male bees are called drones and like all larvae are fed with royal jelly for a while. The difference is that some larvae will be selected to become queens and will be fed a lot of royal jelly for a long time. I don't know and haven't found anything about what happens when you feed a drone with royal jelly for an extended period of time but the effects of jelly are mainly on ovaries so it might be that drones do not have the necessary receptors for the jelly to have an effect.  Also, drone's sole role is to fertilize queens and they do not live in the hive, they are created from unfertilized eggs and therefore only possess one set of chromosom.  Here is the wiki article: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is “binge drinking” so unhealthy?",
        "response": "Alcohol is effectively a poison that takes a lot to actually kill you. By binge drinking several times a week you can permanently damage your liver that filters out toxins and waste from your body. This will cause these to build up in your system and can cause even more damage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does squinting help you see?",
        "response": "When you wear glasses you correct light refraction reaching your eyes. When you squint, you reduce the amount of light being refracted, therefore, making it easier to see. There is something called a pinhole occluder that does the same thing. You essentially look through a tiny hole and, if you wear a prescription, it makes your eyesight seem clear. Basically just poke a hole through an index card using a paper clip and look through the hole. You will be able to see perfectly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it say \"consume within 3 days\" on my bottle of water? What's in it that makes it bad after 3 days?",
        "response": "It usually says (or should say) \"...within 3 days of opening.\" Nothing bad is in it *yet* but there is no chlorine in the water, so once you open it and expose it to whatever's in the air and in your saliva, stuff could theoretically start growing in it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the drinking age 14 in Germany but 21 in the USA?",
        "response": "In the 1970s and 80s, the US had a huge rash of drunk driving fatalities caused by drunken teenagers. The two reactions considered for this was either raising the drinking age or raising the driving age. The US opted for the former. Whatever you may think of the drinking age in the US, it had the desired effect -- drunk driving fatalities plummeted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the United states so much more susceptible to tornadoes than any other place in the world?",
        "response": "Convergence of cold arctic air from canada with the warm air from the gulf, which happens right over the midwest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is cities in the desert like Las Vegas (or Dubai) is supplied in water?",
        "response": "In Vegas, most water comes from the impoundment of the Colorado River at Lake Mead (Hoover Dam). Some of this water goes to California as well. The Colorado River is used so extensively, by the time it crosses Mexico, the water is highly polluted and salty. It's flow has been so affected, it no longer reaches the sea. _URL_0_ I think Dubai uses desalination plants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What act/quality changes someone from being funny and crosses the line into obnoxious and annoying behavior?",
        "response": "Not sure if there is an actual psychological reason but I'd assume it has to do with attraction. If you're good looking, have a great personality or are a kind person, things you do are seen in a positive light. And, opposite of that, being \"unatttactive\" or a shit person will put things you do in a negative light. (Attraction doesn't just mean outward appearance)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What came first, the spelling or the pronunciation of the word colonel?",
        "response": "It's linguistic, rather than historical, but we adopted the French pronunciation (Coronel), but the Italian spelling of the word (colonello), which both derive from the Latin origin (columna) which means a column of soldiers. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there ever an attempt by patriarchal societies to recruit women as warriors in times of war when there wasn't enough manpower?",
        "response": "I think you'll find a number of examples from instances where one side is fighting against a much strong opponent. * [Palestinian women in the Intifada](_URL_2_) * [Tamil women fighting in the Tamil Tigers](_URL_1_) * [Salvadoran women in the civil war of El Salvador](_URL_0_) Also, the more communistic rebel groups tended to use women as they generally had a more gender-equal philosophy but that answer dodges your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Anonymous's best efforts taking down twitter accounts? What good does that do? Is it substantial?",
        "response": "these accounts are very good propoganda tools for ISIS and they can help convince people to carry out attacks of join. Taking them down does good but it is impossible to calculate how much",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't I divide by zero?",
        "response": "If I have zero sweets and I share them between seven people, you can say how many sweets each person has - none.  If I have seven sweets and share them between zero people, it's meaningless to ask how many sweets each person has. As there are no people, there's no answer, and we say the number of sweets per person is *undefined*. As an aside, if you divide a number by another, progressively smaller number, the answer you get gets bigger and bigger, but that does NOT mean the answer to 1/0 (0 bring the smallest number of all, in a sense) is infinity. It's better to say that 'the limit of 1/|x| as x tends to zero is infinity'.  Edit:- my most upvoted comment of all time so far! I don't know whether to say thank you or lament my sheltered reddit life. Or both. Probably both. Also, added mod symbols to the limit in response to drummerx357 - thank you. The vertical bars mean you should ignore the sign of x and assume it's a positive number, if any five years olds happen still to be reading this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Not sure if this is the correct place, but I have a mythology related question.",
        "response": "If you have no luck here, you might also try /r/tipofmytongue .",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there any form of draft or mandatory service in the Confederate army during the US Civil War?",
        "response": "Yes, there was conscription in the Confederacy. In fact, the first ever conscription law was passed by the Confederates, owing to the smaller population size. There were exemptions based on occupation, if the occupation was important enough in the home front. Later on, the conscription exempted men who owned more than twenty slaves. As in the North, richer men could pay a replacement to take their spot. Those last two exemptions caused a lot of strife, especially for the poorer Confederate citizens who felt that it was unfair that rich men essentially didn't have to serve while they did.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If hot air rises, why is it colder at higher altitudes?",
        "response": "Because of something called [\"adiabatic cooling\"](_URL_0_). Air becomes cooler at lower pressures. And because the pressure is much lower higher up, this results in hot air, as it rises (due to the effects you already understand) cooling down,",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't more world leaders/\"important\" people murdered/assassinated?",
        "response": "Most world leaders have armed escorts. Police checks are also run in areas where world leaders are about attend events. So it isn't exactly easy. Besides most murders are heat of the moment things or crime related (gangs, kidnappings, robberies). Assassinations are extremely rare because they usually don't provide any benefit to the assassin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why has modern science not developed a cure for the common cold?",
        "response": "Because there are ~200 different viruses that cause the common cold, so it would be incredibly difficult to determine which virus you contracted each time you get a cold _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the origin of the \"gay sailor\" stereotype?",
        "response": "I suggest that you check out George Chauncey's *Gay New York: Gender, Urban Culture and the Making of the Gay Male World, 1890-1940*. He goes does a fantastic job explaining the various stereotypes and perceived groups (such as fairy, wolf, trade, etc...) in and around the early twentieth century gay community.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you cut a sheet of paper in half with a scissor, do \"molecules\" get removed from the paper, or are they simply \"pulled\" to the sides?",
        "response": "Soem of the long polymer chains of cellulose will almost certainly get broken in half. Even stirring polymer solutions can be enough to break chains. Many of the chains and fibres will just pull and slide rather than break.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how a bycicle brake works",
        "response": "Bikes commonly use [Bowden cables](_URL_0_). The cable housing is somewhat flexible but its length will never change by much. The ends of the cable housing are affixed right next to the brake handle and the brake itself, so the final bit of air that's spanned will also stay the same length. The end result is that the brake handle controls the brake very directly, as if you were pulling on a solid rod as opposed to a flexible cable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't the United States just bombard Syria with cruise missiles from afar and not put boots on the ground?",
        "response": "\"Hey look, that country is having issues we care about, but why directly get involved? Just push some buttons, throw some million dollar armament at them and show them who's boss\" Any country whose crisis plan actually reflects that deserves hatred. Regardless of global opinion we are not that country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I had 100 bitcoins in my account, would I be able to cash them for $100K now that the value is $1000?",
        "response": "*IF* you could find a buyer for all 100 bitcoins, and *IF* they purchase at the $1,000 price exactly, then you would walk away with $100,000K. You would have to find a way to put that into your bank account, and then explain/hide it from the tax collectors when it comes time to report earnings/savings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it dangerous to take Tylenol or other medicinal pills while drinking alcohol?",
        "response": "Tylenol is processed by the liver, so to is alcohol. Together they multiply the effects, becoming more dangerous.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen to a human if they fell from the ISS in just their spacesuit?",
        "response": "If you like his math, there's a kind of related what-if xkcd [here](_URL_1_) about dropping a steak from high altitude.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Price to Earning Ratio",
        "response": "Exactly what it sounds like\" The price of a companies stock, divided by their earnings per share. The idea is it's supposed to let you compare how expensive a stock is.  If i want to buy a stock for $200, is it cheap, or expensive? There's no way to know without more context. You could have a $200 stock that is raking in tons of earnings (or is expected to in the future), or a $200 stock that is doing pretty \"meh\". You can think of it as \"how much does it cost to get $1 worth of the companies' earnings?\" The average P/E is ~20-25.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do trees determine when to drop leaves?",
        "response": "Dropping temperatures and lengthening nights, that results in slowing chlorophyll production, causes leaves to change colour and gradually form a layer of cork that ultimately starves the leaf of nutrients. Gravity handles the rest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't they spin the International Space Station to create 'artificial gravity'?",
        "response": "As KingKidd notes it would require extra mass and that is expensive, and those are _very_ important considerations, but I think the main reason is this: We spend huge amounts of money and expense getting people up to the _one_ place we can easily access with extended freefall conditions. If you took the station and spun it up, you would remove one of the major reasons for being up there in the first place: running experiments in microgravity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is it that psychologists do and how do they actually help people other than being someone to talk with?",
        "response": "A therapist can also help people to figure out how their actions and reactions to situations and emotions may be self sabotaging and damaging to their happiness.  For example a person who had a parent leave the family at a young age may have a fear of being abandoned. This may lead them to over react at the first sign of trouble in a relationship or be overly needful of reassurance or be jealous and insecure. All of these things may then cause the other person to break off the relationship, thus reinforcing the persons belief that everyone abandons them. It creates a negative emotional loop that can be difficult to break without some intervention.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "shaped charges. I read a little about it but I just don't understand them",
        "response": "An explosion is basically a shockwave. For a uniform, round explosive, the wave is more or less spherical. However, you can change the shape of the shockwave by changing the shape and material of the explosive. Just like light, shockwaves move slower through some materials. By creating a lens shape using a different material, the wave can be bent and focused in the same way a glass lens will bend light. The material used to make the lens can be anything, but is usually either air or an explosive with a different shockwave velocity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they determine how many bars to display my wifi as?",
        "response": "The device measures the signal to noise ratio of the signal. Various thresholds are defined for the bar levels.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Final Fantasy music so uniquely identifiable?",
        "response": "Up till FF12, most of the songs were written by the same composer, [Uematsu Nobuo](_URL_0_). It's probably his particular style you're thinking of as being \"Final Fantasy\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does 72 degree water feel so much colder than 72 degree air?",
        "response": "Water has a much higher thermal conductivity than air, meaning it will transfer heat (or cold) through it faster, ultimately removing energy from your skin faster.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are some spoken languages easier for computers to understand than others?",
        "response": "It would probably be easier for a computer to learn something like Indonesian Bahasa than English or Chinese. Simply because the number of words is far fewer. In terms of how logical a language is then Latin is supposed to be the most logical language. So a computer should be good at that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the amount of stuff in my fridge change the amount of energy needed to keep it all cold?",
        "response": "The fridge must run the compressor to pump out any heat that has leaked in. The can of soda doesn't magically produce new heat, so it does not require more compressor time to keep cold. The only thing that matters is the difference in temperature between the fridge and the outside, and how well insulated that barrier is. Assuming, of course, that the fridge door is never opened. There is some small effect when the door is opened a lot. The presence of more solids in the fridge means that less volume of warm air can enter when the door is opened, whose heat must then be pumped out by the compressor. So in that sense, it probably takes slightly less energy to keep a fridge cold with an already-cold soda can in it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any land macro-animals (ignoring insects etc) that have a population in the billions like humans?",
        "response": "* Chickens: [19 billion](_URL_0_) * Rats: [\"Up to 7 billion\"](_URL_1_); [\"which, everyone agrees, outnumber us — but no one seems eager to count\"](_URL_4_) * Mice: [\"About the same as rats\"](_URL_2_) * Cattle: [1.4 billion](_URL_3_) * Sheep and pigs: [\"About 1 billion\"](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the NBA an Association, while the NFL, NHL, MLS and MLB are Leagues?",
        "response": "Founded in 1937, the National Basketball League (NBL) was a professional men's basketball league in the United States. The league would later dissolve and some of its teams would be absorbed into the Basketball Association of America (BAA) to form the National Basketball Association (NBA) in 1949.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it when it is fairly cold outside that some parts of your body gets kinda itchy like due to the coldness",
        "response": "I think it has to do with dry skin. As it gets colder, air is dryer than warm air. If you are in a warmer environment, and then you go to a cold one as you go to bed, the cold air will pull moisture from your skin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our ears feel weird when someone in the back of a car opens their window?",
        "response": "The air moving into your car doesn't have an exit, so it pressurizes the existing air in the car, which then pushes it back out, over and over again. This creates alternating high and low pressure zones, aka, the \"WUBWUBWUBWUB\". Sounds are basically just alternating high and low pressure zones, so your ears are hypersensitive to it.  If you open the front window as well, the air will have a path to flow along, so it will be a bit quieter",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there less wind at night?",
        "response": "Chemical Engineer here so this is not my specific field but here I go! One of the primary causes of wind is the expansion of gas when temperature increases.  So in very watered down / simple terms: the sun heads the ground. The ground heats the air close to the ground. The newly heated air rises and causes air to be pulled into the low pressure zone it created by rising.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have to open window shades in an airplane during landing and takeoff?",
        "response": "The cabin crew should know the answers. For emergency purposes: 1) cabin crew can see out the window to better assess the situation should one arise. 2) Your eyes are already somewhat adjusted to ambient light if you have to evacuate following an incident 3) If there is an emergency landing and the emergency lighting doesn't go on for some reason, windows may allow light into the cabin to help people see what they are doing.  4) People outside, rescue services can more easily obtain a visual on what is happening inside the cabin",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't Oreos absorb almond milk as fast as cow's milk?",
        "response": "I don't want to be the bearer of bad news, but oreos have changed their recipe. They're using cheaper fats. They do not act the same in cow's milk, either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have to have a very varied diet in order to live a healthy lifestyle when all other animals tend to eat the same thing all the time and get all the nutrients they need?",
        "response": "In addition to the ~~above~~EDIT: below, you don't actually HAVE to eat a varied and healthy diet. As a species, humans will do just fine if we all eat a very unhealthy diet, reproduce six times between 15 and 20, have three babies die, and drop dead ourselves at 27. This is a valid survival strategy for many species.  The problem crops up when you actually want to live till you're 80. Then you'll have to take much better care of yourself.  Car analogy: You don't have to maintain your car, clean it or buy quality oil and gas if you plan on scrapping it when its three years old. But if you still want to drive it in 30 years, you have to take good care of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes it so difficult for Iran, or any other country, to manufacture a nuclear bomb? Is it a technology or intellectual deficiency?",
        "response": "I believe the major hurdle is enrichment: you need something like 95%+ enrichment. For those who don't know, all nuclear bomb fuel has fissile and non-fissile isotopes (i.e. part of it goes boom, part of it doesn't): enrichment is where you increase the fissile material (i.e. explodey part).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the \"right side up\" view of the Earth, aka North = up, become the norm for all globes and maps?",
        "response": "Globes have north at the top from that same convention that operates for maps; the convention is arbitrary (many early maps had east at the top, from which I believe is where the notion of 'orienting' a map stems). The choice of north at the top of the page or uppermost on a globe is not necessary in any sense - globes could be upside down or sideways (i.e. the axis horizontal), maps could have any direction to the top.  You may find the following article helpful: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Honey (and bee biology). Why does bee's \"vomit\" taste delicious? Why doesn't anything else's?",
        "response": "What does your vomit taste like? Mine tastes like beer, jagermeister, red bull, schmirnoff ice, and stomach acid. It tastes like whatever I consumed, plus some of the digestive fluids that my body keeps in my stomach. If you were to eat nothing but sweet flower nectar, your vomit would taste like sugar and stomach acid. *It just so happens* that the digestive fluids in a bee's stomach help the chemical reaction with the sugary nectar, and make it taste delicious to humans.  I know you are looking for a reason, but there *really isn't one*. Bees just evolved that way, and humans' tastebuds just evolved that way.  If you restarted the universe, and a few tiny things were different, you might get a spider who injected his prey with a smoky bacon-like flavor. The supermarket stores might very well be filled with bacon-infused spider prey, instead of with bee-regurgitated flower nector.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do airplane seatbelts do anything?",
        "response": "I've been in severe turbulence with the seat belt sign on.  Even the stewardess was strapped in.  A guy two rows up was not buckled in.  All of a sudden the plane dropped and unbuckled guy smashed his melon on the overhead carrier. He was not only a danger to himself but had he hit another person, he could've caused some real damage. There's also take off and landing. Most crashes occur on take off or on landing. If you are not buckled up you just become a flying projectile.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you finance a car, but no longer want it halfway through the length of the finance, how do you sell it?",
        "response": "Assuming that the title shows that you have a lien on the vehicle, you will need to get the lender (lien holder) involved in the sale. You won't be able to transfer title to the new owner without getting a lien release from the lender.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why female products often costs more then male products?",
        "response": "Could you name an example? Throwing out blanket statements makes it really difficult to answer your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If there is no absolute position or speed, and both can be measured only in relation to something else, how can there be a maximum speed (light speed) and in relation to what is that measured?",
        "response": "This is what makes special relativity different from the Newtonian universe. Light *does* have an absolute speed. It was this discovery--that light was the same speed in all frames--that eventually lead to relativity.  If you are driving a car at 70% of the speed of light and you turn on the headlights, you'll measure the light (relative to you and your car) as moving at 100% the speed of light. If I'm on the side of the road, I *also* measure your headlights emitting light at 100% of c. Space and time twist themselves into a pretzel to honor this invariant. So, for example, I measure time in your car to be running slower. You measure distances along the road as being shorter. It's counter-intuitive, but it is what we observe. Our intuition only works because we move so slowly compared to light. For that matter, it's counter-intuitive that the Earth is round. Our intuition only works because we are so small by comparison.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can what someone looked like in life be reconstructed with DNA alone? Can we use the DNA of people who died before photography and reconstruct their appearance? (For example, King Richard III's bones/DNA)",
        "response": "The big problem is that DNA doesn't account for environmental factors. How much muscle and fat you have are only partly genetic, and a lot of lifestyle. Scars, hairstyles, tattoos, piercings, none of those will be in DNA. Circumstances will have a lot to do with how your laugh/frown lines grow.  So, maybe we could get a fairly accurate picture of unmodified reasonably healthy person in their late teens, but older than that and we run into too much environment to be very accurate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does sound travel slower/quieter on Mars?",
        "response": "Yes - the speed of sound on Mars is much lower. Around 240ms^-1 compared to around 332ms^-1 on Earth.  The density and pressure are much lower, which as you surmise, reduce the speed at which interactions between molecules are able to transmit sound.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when corporations buy back their own stocks? Why is this done?",
        "response": "The primary purpose of a stock buyback is to boost the earning per share and thus boost stock price for those who still hold shares.  If a company had $100 profit and 100 shares, then EPS is $1. If company buys back 20 shares, then EPS increases to $1.25. Presuming a constant multiple of 20x, the stock should increase from $20/sh. to $25/sh. Also, with fewer shares outstanding, the company can raise the dividend by splitting the pool of money among fewer shares. In some cases, share buybacks might also be done to counteract share dilution from stock grants and options being exercised by employees — one of the reasons for Apple’s buyback in recent years, along with it being a way to return shareholder equity via use of their cash reserves.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If masturbation is healthy, what are the health benefits?",
        "response": "- Reduced risk of developing prostade cancer (if male) - Reduced stress levels (as a result of endorphin release) - Slightly reduced blood pressure (as a result of the physical exertion)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will the flooding in Colorado replenish lake Mead?",
        "response": "Colorado straddles the continental divide; the western third of the state feeds into the Colorado river watershed, while the eastern 2 thirds feed into a different watershed going east. As far as I can tell, the flooding is in Boulder and Larimer counties, which flow into the eastern watershed. This should not have any significant impact on water levels in Lake Mead, which is 700 km away SW into Nevada, in a separate watershed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the people of the United States of America come to circumcise a majority of their young male children?",
        "response": "hi! more input is welcome; meanwhile catch up on previous responses in these related threads [How did medical circumcision of male infants become the norm in the United States?](_URL_0_) [Why did circumcision catch on in places like the US, Canada and Australia but not in Europe?](_URL_2_) [How did circumcision grow from a practice of Judaism into a popular practice in Western medicine?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, for the most part,we get health insurance through our employers but we buy every other kind of insurance as individuals.",
        "response": "Excellent question. The history of employer-provided health insurance goes back to WWII, when the government imposed strict wage limitations on the private economy (for reasons I won't go into). Employers couldn't compete to attract talent by offering more cash, so they had to offer fringe benefits. Among these, health insurance became the most popular. It's been enshrined in benefits packages for most full-time salaried positions ever since. Like pretty much all your compensation, it's tax deductible for your employer. By contrast, it would be *more* expensive to you if you had to buy it with your after-tax dollars. Plus, people just came to rely on it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are TheFineBros trying to do?",
        "response": "They are basically trying to corner the market on reaction videos, you know, profit from other people's work, other generally greedy and evil stuff. It is ludicrous and it will not turn out well for them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some of our dreams mirror the following day or even days to come? Over the past year every now and again I will have a dream that will mirror the events of the following day. Is there an explanation for this phenomenon?",
        "response": "It's called confirmation bias. Your dreams are random, but based on the real world. So it's a coincidence when they overlap. When it randomly does happen, your brain is biased to remember it. When it doesn't overlap and it was just a crazy dream, your brain has no reason to remember it. You have had thousands of forgotten dreams that didn't mean anything and didn't",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was Julius Caesar a reformist, a conservative, or just an opportunist?",
        "response": "Could you expand your question? What do you want to know about Julius Caesar?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the Statue of Liberty ever assembled before verdigris set in?",
        "response": "**Why is the Statue green?** The Statue's copper has naturally oxidized to form the outer patina, or green, coating. Upon completion in 1886, the Statue of Liberty was more of a traditional brown color, like an American penny. It took about thirty years for the Statue of Liberty to fully oxidize and form the patina. --[_URL_0_](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can Wikileaks be a trusted source without confirmed sources and unverifiable documents?",
        "response": "They leak mostly emails. Emails contain a mechanism called DKIM which basically inserts code into the email when it is first sent. With this code you can 100 percent verify if they were tampered with and the source.  Using said method you can easily see all emails released by wiki leaks are verified. The site has never released an email that was not.  Unfortunately, wiki leaks is more accurate and trustworthy than MSM.  This only goes for emails. Everything else would need Authentication using other methods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do city lights look like they're sparkling?",
        "response": "Turbulence in the atmosphere creates a lens affect that distorts the light waves as they pass through.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't energy or mass be destroyed?",
        "response": "Conservation Laws in physics arise from basic symmetries of the universe. This concept is called Noether's Law. Essentially, if the laws of physics are invariant under some transformations (i.e. there is a symmetry) then mathematically a conserved quantity pops up. Energy conservation arises from symmetry with respect to transformations in time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did western nations stop caring that Vietnam was communist after the Vietnam War?",
        "response": "Mostly when the Cold War in Asia ended in 1975. The idea of Communist expansion in Asia basically ended when the Soviet Union and China split. By 1975 China attacked Vietnam due to the latter's alliance with the USSR making Marxist-Leninist ideology in Asia a non-issue for American policy-makers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is a half life, and what is it’s significance in science?",
        "response": "A half-life is the amount of time it takes 50% of any material to decay. Most often this term is used when talking about radioactive materials. If Chemical X has a half life of 5 years, and you start with 1 gram, then: * In 5 years, you'll have only 500 mg of usable Chemical X left * In 10 years, you'll have 250 mg * In 15 years, you'll have 125 mg * In 20 years, you'll have 62.5 mg * etc. You'll never theoretically reach 0 mg because you half the previous amount, not half the original amount.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a non radioactive material have radiation?",
        "response": "> Assume I'm exposed to radiation, how do I become radioactive? You don't necessarily. Unless the radiation induces nuclear reactions in your body, producing unstable nuclei, you will not become radioactive (assuming there is no contamination, just irradiation of your body). The process of making something radioactive is called *activation*. Alphas, betas, and gammas are generally not well-suited for activation, however neutron radiation is very good at it. If you are exposed to neutron radiation, it can turn you radioactive. Neutrons are a very nasty form of radiation for this reason, and because they're hard to shield against.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Does Biometric Authentication Work, If Digital Data can be Copied?",
        "response": "Biometrics is useful to authenticate you to something in your presence. Like your laptop, or a high-security door in an already-secure facility. Using biometrics to authenticate you to a remote facility is pretty much useless, for the reasons you suggest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't they just not put the bad stuff in cigarettes?",
        "response": "They don't put \"bad stuff\" in cigarettes. The vast majority of that stuff is the inevitable result of setting things on fire and breathing the smoke.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cats innately know to use a litterbox?",
        "response": "They don't but they're easy to teach. Cats instinctually bury their droppings to hide their scent from predators. In a group of cats, one might leave their droppings exposed to assert their dominance over the others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Spotify and iHeart Radio get away with paying songwriters .005 cents per stream when radio airplay pays .05 to .07 cents for each play?",
        "response": "Spotify stream: 1 person listens to a song at a time. Radio airplay: Dozens, hundreds, or thousands of people listen to a song at a time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does your mind think of disgusting things when you're trying not to vomit?",
        "response": "\"That is disgusting. You know what else is disgusting? This thing, and this and that.\" Our brains love connections and relationships.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the best historical documentaries/documentary series?",
        "response": "Ken Burn's *The Civil War* and *The War* (WWII). And if you really want \"to learn a lot\", I would suggest some historical books... Some are quite easy to read and accessible!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the Destiny load screens so long even though it's saved to my hard drive?",
        "response": "Some of the loading is also synchronising with the network. Which pulls in the players you have on your team any randomers in the area and any random events that happen on the map.  None of that is on the disc or your hard drive :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Had the Germans outlasted Japan in WWII, would we have used the atomic bomb in Europe?",
        "response": "Hi there -- not discouraging further comments here, but [this previous AMA](_URL_0_) with u/restricteddata has some information that may be of interest to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Steven Moffat so hated?",
        "response": "He is pretty terrible with things like \"plot\" and \"logic\" and \"consistency\". He comes up with some cool ideas, and some good dialogue, but when you think about it, nothing ever makes any sense, and tends to rely on people being stupid, doing things out of character, or shocking swerves out of nowhere. It also frequently tends to break canon, and winds up getting rewritten by the subsequent writers.  Oh, and more importantly, Sherlock and Dr. Who (*especially* Dr. Who) have some of the most obnoxious fanbases ever. If Moffat was literally Jesus, people would still want him fired.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a bubble in your bloodstream kill you (diving)?",
        "response": "Imagine a funnel. If you took a golf ball and dropped it into the funnel, it can fit into the wide part, but it gets stuck in the narrow end. If something else is trying to get through, it won't be able to get past the golf ball. The biggest blood vessel in your body is very wide. The smallest blood vessels in your body are very narrow. If something big is in your blood, it can float through the bigger vessels, but when it reaches a smaller vessel, it can get stuck. If the small vessel is in your leg or something, it's no big deal. You'll be ok if a tiny part of your leg doesn't get oxygen for a bit. But if your brain or heart doesn't get enough oxygen, you'll have major problems. If the heart doesn't pump blood anymore, the rest of the body won't get oxygen either. Air bubbles can get trapped in narrow vessels. There isn't enough pressure from behind it to push it through. Plus when blood stops moving for a too long, it starts to clump up and make an even bigger blockage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any kind of dream analysis that is derived from scientific studies rather than just mumbo-jumbo?",
        "response": "There is nothing scientific that addresses dream content at the level of detail you're suggesting. For example, there is research that tries to answer questions like \"Do persons with depression experience dreams with greater emotional content than non-depressed persons.\" by simply asking people to rate the \"emotional level\" of their dream on a scale of 1-5 for example. However, there is nothing where you could be so specific as to say \"A dream containing an empty house is frequently seen in persons with depression\". The magnitude and scale needed to do a study like that is far greater than the benefit it would provide in my opinion. I may take some flack for this statement, but as a physician with training in psychiatry, I argue that the science consistently shows that dream content serves little or no purpose in the diagnosis or treatment of psychiatric disorders.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I were to connect a radiator to a sealed pot on the stove, would water circulate through it without a pump?",
        "response": "The name of this phenomenon is [thermosiphon](_URL_0_), if you want to 'fully' circulate then both pot and radiator need two openings each at the top and bottom (and the heated part should be lower).   *A single opening at the top of the pot and bottom of the radiator above it will work, sort of.*    The flow is a bit difficult to calculate, as the flow-resistance is unknown, water expands when it heats up (the specific gravity gets lower), the driving force behind it is weight *difference* of the hot- and cold water columns in the connecting pipes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does this not exceed the speed of light?",
        "response": "Yes, time dilation exactly corrects for this. There is no \"point of view\" that observes this system having any faster-than-light phenomenea.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the United States did the government ever own slaves? (Federal or state?)",
        "response": "The federal government certainly used slaves to construct the major buildings of the Capitol, although the number is not known.  A report from the Architect of the Capitol commissioned in 2005 sheds some light on this.  > The first step in the Capitol's evolution was taken in the last decade of the eighteenth century and was, in fact, assisted by the toil of bondsmen-mainly slaves rented from local owners to help build the Capitol and the city of Washington. They were an integral component of the city's workfoce, which otherwise would have suffered from a severe shortage of hands. _URL_0_ It also details that it was very common in each of the 13 states at the time to commission slave labor.  Your question was whether the US actually *owned* slaves. I do not know, although after the Emancipation of slavery in the District of Columbia, the federal government likely would not be able to own slaves.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans bare their teeth (smile) to show positive emotions when baring teeth is an almost universal signal of aggression or fear among other mammals?",
        "response": "In primates, showing teeth within a /closed/ mouth is a submissive gesture. It shows that there is no aggression going on. If a monkey bares fangs with their mouth open, then that is a dominant gesture. I did behavioural research with monkeys for several years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could one bend light with magnetism?",
        "response": "magnetic fields exert forces on *charged* particles *in motion* and the force is proportional to the velocity and charge and field strength and directed perpendicularly to *both* the field lines and the velocity direction. Light is not charged, and thus is not affected by magnetic fields at all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can the Casimir effect come from harmonic oscillator ground state energy if the latter is arbitrary?",
        "response": "That derivation of the Casimir effect is simplified with the assumption that the fine structure constant is infinite, which allows it to be derived much more easily. A full derivation considers the relativistic van der Waals attraction between two real plates, which is more complicated and less handwavy: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come red and violet are similar colors on the standard color wheel, but are on opposite ends of the visible light spectrum?",
        "response": "That becomes obvious if you look at the spectra of sensitivity of the different color receptor in our eye: If you have a look [here](_URL_0_), you see that the red receptor has a region of sensitivity in the blue-ish frequencies. That is why short wavelength light evokes violet perception in us - it produces the same signal as a mixture of red and blue light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When and why did racism go from Race A against Race B to White race against rest of the world?",
        "response": "You are arguing with silly people. One can waste quite a few hours doing that, but I do not recommend it for constructive usage of one's time. However, there are certainly societies in which this particular form of racism would be potentially the most institutionalized or powerful, such as my own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the missing electrons ignored in alpha decay? (at least by my high school physics textbook/class)",
        "response": "Alpha decay is a process of the *nuclei*, not of the corresponding atoms. So in your reaction, for example, radium-224 means a nucleus consisting of 88 protons and 136 neutrons (net charge of +88), and radon-220 means a nucleus containing 86 protons and 134 neutrons (net charge of +86). So in going from the former to the latter, you lose 2 protons and 2 neutrons, which emerge via the alpha particle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we use the word \"late\" when talking about deceased people?",
        "response": "One lesser-known meaning of \"late\" is \"recently, but not any more\". If, for example, you say, \"A man late of London,\" you mean he used to live in London until just a short time ago, but now he lives somewhere else. From that came the expression \"The late Mrs Smith,\" which was used as a euphemism to avoid using the word \"dead\". It basically means: \"Mrs Smith, who used to exist until just a short time ago, but now no longer does.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you get a physical and the doctor has you turn your head and cough, what exactly are they feeling for and why?",
        "response": "They're checking for an inguinal hernia. There's essentially a weak spot below the abdomen called the inguinal canal that separates sections of the body. If you do have an inguinal hernia, the doctor will feel that something normally not in the scrotum has either moved inside or is causing the canal to bulge.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do humans manage to predict/calculate past events that we've never witnessed before?",
        "response": "Largely through extrapoloation. What that means is that we observe the world how it is today, and observe how it changes over time. Than we figure out the rules of how stuff changes over time, and we apply those rules backwards to figure out how things used to be. A good example is if you saw a ball come over your fence and land in your grass. You first spotted the ball as it entered your yard and you were able to watch the ball falling and with that info and with your knowledge of how gravity and moving objects work you can reasonably predict that it came from your neighbors house to the left.  An alternative is that the ball just magically poofed into existence halfway over your fence and then started moving, but most people reasonably conclude that's unlikely. The same thing is done with the age of the earth and fossils. If all our experiences thus far tell us the universe has certain rules, we can use those rules to wind the clock backward as well as forward.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "ExplaintomelikeI'm5 what is the difference between 3G and 4G connections",
        "response": "Simply put, the difference is speed. 4G connections support faster data speeds than 3G connections.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we cancel out global warming by causing a Nuclear winter",
        "response": "Well, in order to create a nuclear winter, you kinda have to nuke the entire world. So it wouldn't save much.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Assuming that roughly 3-3.5k calories equal one pound of fat, would it be possible to eat a food of that caloric value, that weighs less then a pound, and gain a pound from it?",
        "response": "It's not about the type of food. Yes, there are foods which will have more calories than 3500/pound. But I think your question was about conservation of mass or something like that? The answer to that is - fat cells don't consist purely of fat... They also have, say, water in them ;) However, the whole thing with calories and fat is far, far from as simple as this...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does honey last forever?",
        "response": "It's so hyper saturated with sugar that microbial cells would be immediately shriveled by the osmotic pressure. All the water would SCHLUP out of the cell and into the honey solution. Bacterial spores and toxins can survive, which is why honey can be a source of botulism, but bacterial cells, or fungi or anything else, can't grow in honey.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is a mechanical keyboard, is it something different from the kind of keyboard on a laptop or the kind of peripheral laptop you get at Staples? Is there something better about it?",
        "response": "Mechanical keyboards are distinguished in contrast to \"membrane\" keyboards which use a flexible membrane to separate two layers of conductive material from touching with small \"bubbles\". When pressure is applied to the raised areas of the membrane it completes the circuit and signals a key press. This is really cheap to produce and so it is most commonly used, but it feels spongy and wears out relatively quickly. In contrast a mechanical action for each key provides a better ~~tactical~~ tactile experience at the cost of.. well, cost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why the bicycle wasn't invented until 1817",
        "response": "Like most modern inventions, the bicycle was invented smack bang in the middle of the industrial revolution. How the industrial revolution occurred was from a combination of technologies that 'fed' developments within each other, good access to energy, information and new transport methods. This is probably the best explanation put as simply as possible for how that happened: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What military value did Japanese castles have, compared to European castles?",
        "response": "That seems to be the keep of the castle not the all of the fortifications. The keep is designed to look impressive as a show of the owners power, while I wouldn't call them ceremonial (they have a practical use) they are certainly very aesthetically pleasing structures. These two images should probably clear things up for you. _URL_1_ _URL_0_ They are both of Osaka Castle one of the most famous Japanese castles (and in my opinion very impressive). It has many similarities to its European counter parts which are pretty obvious (moat, walls etc).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they date cave paintings with the materials used, such as ochre, when the materials within the ochre likely date back long before they were mixed into ochre?",
        "response": "They mostly do it by dating other human artifacts found nearby. Sometimes they use carbon or thorium dating but that's difficult because it's hard to get enough sample.  One way I heard of is radioisotope dating of deposits laid down *over* cave paintings but again I think that's rare because it relies on a stalactite or something dripping onto the painting and being able to get a usable sample of those deposits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can you tell if an ionic compound is a salt ?",
        "response": "A salt (by the arhennius definition) is the product that is formed along with water from the neutralization of an acid and a base. The salt will contain the cation of a base and the anion of an acid. example: NaOH+HCl - > NaCl + H2O here, the NaCl is a salt composed of the cation of NaOH (Na+) and the anion of HCl (Cl-).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is collecting rain water illegal?",
        "response": "For those states that restrict collection of rainwater, the reasons seem to be a combination of environmental (water you collect is water that isn't going into the land where it usually would), legal (water you collect isn't going to someone/something that has a legal right to it), and public health (water you collect can't be guaranteed safe to drink, so you might be restricted to using it as non-potable water).     If you want to read up on it, Colorado is probably a good state to focus on to see the general issues surrounding this sort of thing. [Here](_URL_0_) is an interesting article that is tangentially related. It's about policing water rights in CO.    Edit: for pete's sake, don't ask a question and then delete it two seconds after you get some answers. For future readers, the question was why it is illegal in some states to collect rainwater.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who wrote on the atomic bombs, and what did they write?",
        "response": "They wrote their names, mostly. [One photo](_URL_1_) (guy writing in front is Norman Ramsey, future Nobel Prize winner and part of the assembly team), [another](_URL_0_), [another](_URL_2_) (\"A Second Kiss for Hirohito! W.R. Purnell, Rear Admiral, US Navy\"). Similar things were done to the Hiroshima bomb but most were painted over before it was dropped. Generally it was the assembly team, but by the time of the Nagasaki bomb the import of these bombs was more generally known on the island so you get things like rear admirals signing their names.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come we cannot have things like phone and laptop chargers that charge batteries instantly?",
        "response": "Batteries are being developed that can fully charge in seconds but they are a ways off before they are ready for commercial products. The main reason is that regular batteries can store more power than these new batteries. Instantaneous charging will probably never happen because it would require superconductors (objects with no electrical resistance) and as far as I know they can only exist at extremely low temperatures. Because of this it wouldn't be worth it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was inbreeding an issue in non-European nobility?",
        "response": "Famously in the case of Cleopatra. She had many fewer immediate ancestors than most people: three of her four great-grandfathers were the same person, Ptolemy VIII. The fourth was his son, Ptolemy IX.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our legs fall asleep?",
        "response": "Basically you're compressing your nerve or blood supply to said nerve and interrupting the impulses from the nerve. It's called paresthesia.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the cost of Tritium prohibitive in using fusion as a power source?",
        "response": "Fusing deuterium with tritium yields 17.6 MeV per interaction. One gram of tritium contains roughly 10^24 atoms, which makes for a total of 1.76 * 10^25 MeV per gram, or 2.82 * 10^12 J. That's 2.82 TJ (Terajoule) of energy. Regular oil-based combustibles have a specific energy of just under 50 KJ (Kilojoule) per gram. That's a factor 40 million difference. Of course, that's a very simplistic estimate and a fusion reaction would also need deuterium, but the main conclusion is that the energy density of fusion processes is orders of magnitude larger than that of regular fuels. So the current price of tritium would not be an issue for future fusion reactors, even if the price would increase. But since we can produce tritium from more abundant elements, it is to be expected that the production rate of tritium would go be increased if the demand increases dramatically. There is no risk of running out of materials to produce tritium with for a long, long time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Despite the diversity of life, no form has three sexes. Why exactly?",
        "response": "I took a class on the evolution of reproduction. We actually do see multiple sexes (mating types) in certain species like Physarium (a genus of slime mould) which has > 500 sexes (but it still only takes two individuals, who are not the same sex, to make a baby). The main problem that limits most species to 2 sexes is the issue of mitochondrial inheritance. Basically, when the two gametes fuse, only one of them can donate its mitochondria (if they both did, the cell would die). So, nature's solution was to create two general mating types: Male (DNA only donors) and Female (DNA and mitochondria donors). In most species with multiple sexes, the mitochondria donor seems to be determined by a \"rock-paper-scissors\"-type of game.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do different species have different numbers of chromosomes?",
        "response": "Consider that there are many of the types of mutations that occur at the genetic level that can still occur on the chromosomal level: duplications, deletions, translocations, chromosomes joining together, splitting apart, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What raw materials/ingredients are used to make antidepressants.",
        "response": "The process of synthesizing a medication starts with some commercially available reagent which is acted on in various ways to create the desired molecule. What that initial reagent depends entirely on the drug in question. For example, citalopram, a widely used antidepressant, can be synthesized out of 5-bromopthalide, [which can be purchased from suppliers](_URL_0_). That reagent is combined with others under specific conditions. Chemical reactions occur. At the end of the process, you end up with citalopram. It's basically like cooking. You go to the grocery store and buy flour, eggs and sugar, then you come home and combine them in the right way to bake a cake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will public safety vehicles (police cars, firetrucks, ambulances, etc.) become autonomous vehicles when self-driving cars populate the roadways?",
        "response": "Likely no, because the situations they respond to are not normal, the program may not be able to respond appropriately. Similar to how tesla autopilot should not be used in construction zones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do modern vehicles still use a dipstick to check the oil level instead of an automatic gauge?",
        "response": "Some do have an electronic gauge. But a dipstick is still best for numerous reasons: Physical dipsticks are crazy reliable! Unlike sensors, connectors and wiring which are all things that you dont want to fail on such a critical task. You can only use a dipstick while the engine is stopped which means if all your oil has drained out for some reason, you'll see that before starting the engine and have it make a horrible rattling noise to tell you it's dry. When you lift the bonnet to check your stick, you also subconsciously look around the engine bay and may notice something else. If you simply sit in the driver's seat and let the car do a check, anything could be happening under there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you and how much would you need to do to die from a marijuana overdose?",
        "response": "Its impossible. You would have to consume around 1500 pounds of weed in about 15 minutes to achieve a lethal overdose, you would smoke yourself into sleep long before coming close.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do electrons orbit the nucleus? And why don't the molecules touch each other?",
        "response": "Electrons behave quantum-mechanically. In quantum mechanics, a particle has lower kinetic energy if it's more spread out in space. (and it cannot have exactly zero kinetic energy. But as with classical physics, its potential energy will be lowest if it's as close as possible to the nucleus. So these two forces 'balance out' to give atoms the 'size' they have.  > Also, when the molecules attract each other (van der waal) why don't they touch each other?  How do you define 'touch'? The electron 'cloud' around the atoms is a diffuse thing, so there's no set boundaries. As two molecules get closer and closer, the electrical repulsion between the electrons (in combination with the 'rules' of how they behave) will eventually become larger than the attractive force.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't there a flat tax rate?",
        "response": "Think of it this way. You earn $100k a year. This is a nice upper middle class figure, maybe into the low reaches of the upper class. If the government takes 20% of that, you're still taking home $80k a year, well into upper middle class numbers. You might have to cut back a little bit, but you're still comfortable. I earn $25k a year. This is just above the poverty line. If the government takes 20% of that, I'm left with $20k, and I'm now officially under the poverty level. I'm cutting back on important things so I can make rent each month. That's why a flat tax is a terrible idea.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This question about gravity has been bugging me for a long time.",
        "response": "We orbit around where the sun is **now**. More precisely, we orbit around where the sun's momentum 8 minutes ago predicted it would be now. Change in gravity does take time to spread, but it doesn't change due to velocity. See: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the range of tempos we typically see in music that we typically find enjoyable to listen to a means of gauging our brian's \"processing speed\"? Or something else, like heart-rate or brain activity (state of mind)?",
        "response": "[Some theoretical thinking by neuroscientists who study beat and rhythm](_URL_1_) in humans suggest that the range of tempi we see in music probably is strongly linked to the rate at which we walk/run/swing arms, meaning that the human gait may have shaped music-related tempi.  [Even when sitting still, the sense of beat in music engages the motor system](_URL_0_), helping us set up predictions for when events are likely to occur. These predictions might also help us to plan actions, for example, to *participate* with music. Following this thinking, music that's not in that ideal tempo range might sound bad because of two reasons, A) it's too fast to to participate with and B) what you pointed out, at very fast speeds it would be difficult to process it to a point where we can understand the relationships in music (melodic line, harmony, structure, perception of a human voice, recognition of instruments, etc). However I'm not aware of any one study that has shown this definitively.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Silk Road last as long and gain as much popularity as it did?",
        "response": "The TOR network uses an untraceable method of internet browsing wherein you will be connected through another router somewhere else in the world, so the DEA was unable to track where traffic was coming from. All transactions took place in the form of bitcoins, which are also pretty much untraceable. The only real way anything could be done was intercepting parcel in the mail, but people who used the site were clever, and would vacuum seal parcels, and normally would not deliver to their own address",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did satellite imagery help us discover anything new about the Earth's topography?",
        "response": "Nothing like an island, but I some large scale features were not recognized until satellites or at least high altitude planes were able to get a big picture view. For example the [Eye of the Sahara](_URL_0_). It's not like people had never been there before, but from the ground it doesn't appear to be anything special.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The English verb 'be' and it's conjugations.",
        "response": "It's much the same in Spanish. Remind them that soy-eres-es-somos-son makes no sense, and that fui-fuiste-fue-fuimos-fueron makes even less sense. You just have to memorize it.  Same in English. Am-is-are makes no sense. You just have to memorize it and use it until you know it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were the 1936 Berlin Olympics militarized?",
        "response": "No. They may of had guards and such, but it was probably policemen, etc. Everyone was instructed to treat ALL foreigners with the utmost respect. Hitler even practiced what he preached. He was the ONLY world leader to send written congradulations to Jesse Owens on his gold medals, as pissed as he was that he won. The government put foreign newspapers in the stands again for the first time in years. If you were in what passed as \"the Olympic village\", you were in a very carefully crafted bit of stagecraft designed to show the world how great Nazi Germany was. Basically, for the duration of the Olympics, Berlin was Disney World. Normal rules of operation for the world, suspended. Think of what insane show North Korea would put on if they hosted the Olympics...It was kinda the same thing, only the Nazi's were generally successful at it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If UBER violating antitrust laws, how come the WWE isn't if it's performers are independent contractors?",
        "response": "Because the antitrust issue with Uber is only indirectly related to the employment status of the drivers. Yes, both Uber drivers and entertainers are independent contractors. But the problem that Uber faces is that it sets the price for all of the rides, and not the drivers. So, that means that either the drivers are actually employees, or Uber is engaged in price-fixing, which is an antitrust violation. It's not a good situation for Uber. It's possible their entire business model has painted themselves into a legal corner. WWE isn't doing the same thing for its contractors, since each of the wrestlers can independently negotiate how much they get paid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where is the addiction/reward system field headed? It's easy enough to find broad overviews of the pathways and neurotransmitters involved in addiction and reward, but what new questions is the field as a whole investigating now?",
        "response": "Re: addiction, [Karl Friston](_URL_4_) has a paper that's very cutting edge but requires a good amount of background knowledge to understand. See here: _URL_1_   For something on addiction that has more neurobiology talk, but uses more traditional theory, see this paper:_URL_3_ \"Reward\" is a fairly nebulous concept and is slowly being replaced by more precise terminology. Moreover, a lot of the popular science ideas about dopamine are probably wrong. For the most recent review of the field, see [this paper](_URL_2_). For cutting edge theory on dopamine and reward, see [this paper](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is TB not spread by kissing or sharing toothbrushes?",
        "response": "The TB bacterium grows in the lungs and if you look at the full relevant part of the CDC info sheet:  > The TB bacteria are put into the air when a person with TB disease of the lungs or throat coughs, sneezes, speaks, or sings. you can see that all these involve expelling air (and thus aerosolized bacteria) from the lungs. Coughing/sneezing, being more forceful, would expel more bacteria than speaking/singing. Kissing and brushing your teeth both still have potentially contagious air being exhaled, the mouth is not exactly the most amenable place for bacteria; saliva has antibodies and enzymes that attack microbes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do I go from zero programming experience to being able to create simple android apps?",
        "response": "There is a wonderful programming language called [processing](_URL_0_) that was developed at MIT specifically for people with zero programming experience to create visual applications.  It comes with it's own editor, and has an excellent tutorial. You can make your own simple interactive applications in 10 lines of code, with no importing libraries or anything ugly.  In addition, it has a mode specifically for android development, and you can export apps directly to a phone connected by usb.  I can't imagine anything easier, and there is a ton of documentation and help videos. It's built on java, so if you get good with it, it's easy to move on to more complicated programming.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Palestine have a legitimate claim to the land, if they, Arabs, took the land from Hebrew Jews a long time ago.",
        "response": "Are you referring to the 732 BC conquest by the Assyrians, the 500 BC conquest by the Babylonians, or the Third Jewish/Roman Revolt of 130 AD? The Romans killed and kicked out nearly all Jews. Why do you blame the Palestinians for that? Does this mean I can go back to my ancestral home in Ireland and take the land back from the family that bought it form the English occupiers? Is the statute of limitations 200 years or 2000 years?",
        "source": "sentence-transformers/eli5"
    }
]