[
    {
        "query": "How Do I Drive In The Snow?",
        "response": "It's pretty simple once you understand what you need to do. Slow everything down. If you normally start braking about 100 feet from a stop sign (approx.), do it in 200 feet. You might get idiots honking at you, but don't pay them any attention. Until you are completely and 100% sure of how the vehicle handles and how long it takes to stop it, do this. I'd probably try going kinda fast and braking hard in that parking lot a few times. Just so you know how much you're going to slide around. And always remember to treat the brake pedal like an egg. Step on it too hard and it breaks. Just take everything nice and always give yourself tons and tons of space while behind cars.   Good luck.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the consistency of the material on the solar surface?",
        "response": "The surface of the sun is defined as the layer where the sun emits the majority of electromegnetic radiotion, the so called [photosphere](_URL_1_). The density in that layer is only 10^-7 g/cm3, so its basically a vacuum. The particles there are in a state of plasma, so its no gas nor liquid in the common understanding. Due to the low density it behaves like a very thin gas however. In deeper layers, where the convection of the [granules](_URL_0_) starts, the pressure is high enough to make the material overcritical. This means there is no way to tell the difference between gas (or plasma respectively) and liquid. This is the reason why the sun is sometimes described as a gas ocean.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Lobbying and how it is so influential on (specifically American) politics.",
        "response": "The term \"lobbying\" originated in the early days of the Republic, when Congressmen usually lived in hotels. A \"lobbyist\" was someone who would wait in the lobby for them to come down so they could speak to them about something. Most lobbying that happens today is just that: a way for people to let Representatives know how they feel about different issues. It's not just corporations who have lobbyists: teachers, doctors, environmentalists, unions, gay-marriage advocates, civil-rights organizations and just about every interest group that you can think of has them.  You might ask why these companies and groups don't just send someone from the company instead of hiring a lobbyist, and that's because lobbyists are much more familiar with how our government works (many of them are former Senators and Congressmen). They have personal relationships with sitting representatives, they know who to talk to if something needs to get done, and generally know the best way to advance their client's interests.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we able to see the sun without flinching when it sets/rises?",
        "response": "As the sun is setting, it has to travel through more atmosphere because of the curvature of the Earth. That's why we get sunsets in the first place. More atmospheric scattering means fewer photons and less radiation hitting your eyes. EDIT: Also answered [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can molten iron explode into a mushroom simply when it comes into contact with cold water?",
        "response": "So molten iron is, of course, crazy hot. 2600 F is standard if I remember correctly. When that comes in contact with water the water instantly flashes to steam. Steam takes up a lot more space than liquid water so it exerts a large amount of pressure on anything that may be containing that pressure. That almost instant application if force to the Molton iron pushes it up and out creating what is called a steam explosion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where goes my sixpack in the evening",
        "response": "> Am I adding fat during the day and loose it during the night? You are dehydrating during the night and rehydrating during the day. Bodybuilders when preparing for their shows will avoid drinking anything so their skin is tighter to their muscles. It is perfectly normal and not really something you should try to stop.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the squeaky sound from the saying “squeaky clean”?",
        "response": "Let’s compare rubbing your finger off a dirty surface to rubbing your finger along a clean surface.  When things are dirty, there’s a layer of oil/dirt that lubricates the surface and decreases the friction. Less friction = less kinetic energy transformed into heat/sound energy.  When things are clean, there’s less lubricating substance between your finger and the surface. Therefore there is more friction. Friction converts kinetic energy into heat and sound. Hence the squeaks!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does intermittent fasting work?",
        "response": "Weight loss *does* pretty much depend on calories in versus calories out. Those who tell you otherwise are wrong. The thing about intermittent fasting is that it shortens your eating window, so most people end up eating less calories simply because they aren't grazing all day. For some—myself included—it's also easier to *not eat* than it is to *eat less* when trying to lose weight. It makes sense, though, if you think about it. Say you're eating a diet with 1,500 calories. If you try to eat three equal meals, you get three 500-calorie meals. Not very satisfying. With 16/8 intermittent fasting (one of the more popular methods), you'd get two 750-calorie meals. Those are a lot more satiating. **TL;DR:** There's nothing magic about IF, but for some, it's an easier way to restrict calories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does terrorism work?",
        "response": "This question has a lot of unadressed assumptions that the answer depends on (define: terrorism, work), but broadly speaking the answer is: Yes, sometimes. Let's take the most famous act of terrorism in recent memory: 9/11. Al Qaeda's stated goal was to get the U.S. to invade a bunch of Muslim countries, become bogged down in endless wars, then bankrupt itself fighting like the USSR did. While they haven't yet gotten the total collapse of American hegemony they wanted it's hard to say that the 9/11 attacks weren't successful. Additionally there's a basically [endless](_URL_2_) [list](_URL_1_ of [terroristic political movements](_URL_0_) that ended up attaining their goals. Terrorism was never the sole reason for that success, but it was often a major contributing factor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was the Zeppelin ever considered a viable weapon?",
        "response": "Zeppelin's airships were largely developed before France really started building up their heavier-than-air fleet. They were designed before aircraft in general evolved beyond their reconnaissance role, so flying high enough would have completely insulated them from the threat of hostile fire. When aircraft were militarized, the superior carrying capacity of the Zeppelin design spurred the notion of them as good bombers - so after a bit of trial and error the Germans learned to navigate by night to drop their ordnance. While their military impact was minimal, the psychological effect was profound and they served to force the British to retain an inordinate amount of forces in the Home Isles to defend against the threat - fighter units which would have put more of a strain on the heavier-than-air Luftwaffe fleet which was hard-pressed over the trenches.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come 20°C outside feels pretty warm, while a 20°C sea or swimming pool feels like it 's freezing?",
        "response": "Air is a good insulator, while water is a good conductor for heat. The water sucks the heat from you, making you feel cooler, while the air doesn't do it as much, so you feel warmer. Think about touching a metal railing outside. Then think about touching the pavement the metal railing is stuck in. The railing will feel cold, while the pavement less so. They are the same temperature, because they are in the same environment, the metal is just better at sucking the heat from your skin than the pavement is. For science nerds, I know there is more to these processes than what I've said, but it's an ELI5.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can I have some help understanding the intuition behind Poynting's Theorem?",
        "response": "For a circuit at steady state, the time-dependent term is zero. So what remains of Poynting's law are the **J**•**E** term and the div(**S**) terms. So places where the current and electric field are parallel (the battery) are sources for energy flux, and places where the current and the electric field are antiparallel (in a resistor, for example) are sinks for energy flux. Your question about energy flux through a surface is a valid one. What happens if you look at the energy flux through a closed surface in the limit where the radius of the surface is taken to infinity? The only terms which survive are ones where the electric and magnetic fields drop off *at least as slow as* 1/R. This **is** radiation. The field far away from a radiating charge distribution to lowest order looks like a 1/R field, and this happens to be the only term which can transport energy through a closed surface at infinity (because we live in three spatial dimensions).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the difference between psychology and sociology? What’s the difference between sociology and cultural anthropology?",
        "response": "Sociology focuses on groups/ multiple people as the unit of analysis, while psychology focuses on the individual. There is overlap because each field recognizes that the individual is never \"just\" an individual but always influenced by others (and even takes the perspective of others in its own minds). Sociology is broader than cultural anthropology, and comes from a different academic disciplinary history, but includes the same topics: the meanings, practices, and artifacts of a particular culture, and how they work. Sociology also includes lots of topics besides \"cultural meaning\" itself, and many levels of analysis, from social psychology to economic behavior, to history of politics, etc. Source: PhD/ B.S. in sociology from two top tier American universities",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the first computer programmes know what one second is, or any unit of time for that matter when mankind invented the units of time?",
        "response": "Well mankind invented computers too, so of course we built them to use the units of time we invented. Computers generally keep time with a quartz crystal. When current is applied to them they oscillate at a predicable frequency. By counting the oscillations the computer can work out if a second has passed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "While receiving radiation therapy I keep seeing these blue flashes across the room followed by a very odd smell. What is this and why can't anyone else see/ smell it",
        "response": "Have you told the person operating the machine? I don't want to alarm you, and it's entirely possible that this isn't at all the case, but it's worth asking. In the 1970s, there was a case of a radiation therapy machine that was dramatically overdosing patients due to faulty software ([Therac-25](_URL_0_), if you want to research it), and flashes and smells were reported by the affected patients, some of whom eventually died of overdoses. Again, this may not be the case for you, it may even be normal. I've never experienced it, and I'm not an expert, so I can't say. It just came up in my ethics class (I'm a computer science major) recently, so it's on my mind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does vision become grainy in the dark?",
        "response": "Ooh, I think I remember this one! You have two kinds of receptors in your retina, rods and cones. Cones see colors and work best in bright light. Rods see black and white and work well in dim light. More cones are in the center of the eye, more rods around the sides. So if you want to see something well in the dark, you may do better to look next to it and use your peripheral vision. Since your best focus is usually at the center, this might help explain the graininess.  Take this with a grain of salt, I'm remembering from an interesting book I read about 40 years ago. And I may have my rods and cones switched. But I'm sure some smart young whippersnapper will pop up to correct me.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So seeing as neutrinos dont travel backwards in time, Would time really slow down at near relativistic speeds?",
        "response": "Yes, time slows down as predicted by Relativity. If it didn't, your GPS wouldn't work right.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to all those letters mailed by kids addressed to Santa?",
        "response": "the USPS service delivers them to the Santa at the North Pole of course.  where Santa reads and replies and sends back.  USPS offers free service for pickup of the millions of pieces of parcel and letters that Santa gets. what did you think happened? USPS wouldn't just toss them in the garbage.         in actuality, they're sent anonymously to registered volunteers who read and reply.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do I get so dizzy when Iv'e been lying down for a while and suddenly stand up?",
        "response": "Blood, like all things, is subjected to gravity. Therefore, when lying down the blood in your vessels are equally distributed throughout your body. When you suddenly stand up, the blood rushes to your feet (the most gravity dependent portion), creating a slight deficit in your brain. This deficit is why you feel lightheaded or dizzy. Your body, however, has mechanisms in place that sense this change and adjust heart rate, vascular resistance, etc, so that the brain receives adequate amount of blood. The lag between you standing up and the mechanisms kicking in is when you feel that lightheaded-ness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the bail system work in the USA? if you 'post bail' of $15,000, say, do you get it back or what?",
        "response": "After you are arrested, the state wants a guarantee that you will show up for court. The \"bail\" money is used to coerce you into compliance. You get the money back when the case is disposed of, guilty or not, as long as you appear in court when you're told. If you don't show up, you have \"jumped bail\" and the cops and maybe Dog the bounty hunter will come looking for you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do consoles still need discs even after installing in order to play a game?",
        "response": "For the newest consoles where the data is installed to the hard disk, it's just to make sure you own the game. The disc is essentially a licence key. They could have gone with a system like Steam where even if you buy something on a disc, you get a license key that links the game to your account. But that would make second hand sales impossible and console gamers aren't keen on that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "ETF for a cell phone carrier is around $350. What's stopping me from getting a $700 phone for $200, paying the $350 ETF, and pocketing the difference?",
        "response": "You'd have to find a buyer that would pay full retail to you for it. You also have to figure in the first month of service and the time and effort to sell it. It isn't worth the trouble for most people, since it is something you can only do once - getting a contract is tied to your identity. You might make a hundred dollars for a few his of your time. Better things to do for money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the 1% so much hated?",
        "response": "It's not the 1% people hate, is the tax system which favors them. Because the wealthiest 1% make money via capital gains their income is taxed at a lower rate than the average middle class American, creating a system where the wealthy retain more of what they make than an average working man or woman. Warren Buffet had claimed that he is taxed at a lower rate than his secretary. What people want is a more equitable tax system. Also raising taxes on the 1% can contribute to paying off the deficit.  Edit: auto correct ducks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How often were flails used as weapons in medieval combat? How effective were they?",
        "response": "In my reading about Medieval warfare the only time I've heard about the widespread use of flails was in the [Hussite Wars](_URL_0_) during the 15th century. From what I understand the Hussites (who were a massively diverse group, consisting mostly of peasants, that were held together by religious fervor) converted agricultural implements they had on hand into flails. The cornerstone of their military success was the Wagenburg (wagons grouped together into forts in a defensive position and filled with men wielding early handguns) and tbh I'm not sure how the flail was incorporated into that or how it was deployed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Are Condoms Only 98% Effective When Used Perfectly?",
        "response": "That 98% effective stat doesn't mean what you think it means. It means that for 100 couples using condoms as the sole method of birth control, 2 women will be pregnant after 1 year.  So really the percentage is significantly higher than 98% on a per use basis. There's some debate as to exactly what perfect use means.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Google Maps blur out every license plate for every image?",
        "response": "There's a designated Google Team who use proprietary software which can automatically find license plates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given how our solar system is speeding through space, how does a satellite from our planet reach another one in our solar system instead of being lost like throwing a cup of soda out of a speeding car?",
        "response": "It's like throwing a cup *inside* a car. While you're in that car. If everything around it is moving in the same direction at the same speed, it may as well not be moving at all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if being even close to the sun kills you instantly, and lightning is five times hotter than the sun, how does lightning not disintegrate everyone on earth when it strikes?",
        "response": "Being close to the sun doesnt kill you instantly, it kills you very *quickly*. In theory, if you could expose yourself to the sun for a *very* short amount of time, you would be fine. Lightning is very hot, but it is also gone very quickly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are large nuclei unstable?",
        "response": "The Pauli exclusion principle forbids two particles from sharing the same quantum state. Therefore, as you add nucleons to the nucleus they are forced to occupy higher and higher energy states to avoid violating this principle. A nucleus in which the valence nucleons occupy a high energy state is unstable, since lower energy states are accessible by ejecting a few nucleons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we only inherit maternal mitochondrial DNA?",
        "response": "A spermatozoon only carries nuclear DNA to the ovum. It has [mitochodria at the head of the tail](_URL_0_), to run its outboard motor, but that stays outside the ovum. Meanwhile, the ovum is a complete cell, and is fully equipped with the cytoplasm that will be duplicated for each cell in the developing creature.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the colors we see are just the wave length of light that is not absorbed by the object, int he absence of light is everything the same color?",
        "response": "It'd look black under that light. The lack of color/light is black. It means your eyes/detector isn't getting any signal. Also, real shirts aren't perfect absorbers/diffuse reflectors, you'd still \"see\" the shirt, it wouldn't be a void in your perception, but it wouldn't look blue simply because they're no blue light around.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the benefit to having an unsecured wireless with a login wall rather than secured wireless?",
        "response": "With the login wall security can be applied at the individual level - so when you check out of the hotel that can disable your wi-fi access. They cant do that if they just give you the WEP",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is vegan prepared foods made by for-profit companies like BeyondBeef and Impossible Burgers healthy or just tasty?",
        "response": "\"healthy\" is a pretty ambiguous term. You'd have to look at the nutritional information and make your own decision. _URL_0_ They have the nutrition facts on their web site. Beef patties have 47mg of cholesterol as opposed to none in the Beyond Burger patty, and have some more carbohydrates in them than the Beyond Burger patties. Meanwhile, Beyond Burger patties have more iron and phosorus, but less calcium, magnesium and vitamin B-6. They have comparable amounts of fat and sodium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have dominant hands?",
        "response": "The best answer i've heard for this has to do with language. As humans developed language it was usually developed in one side of the brain (the left). Before this point there is no clear evidence that humans were right hand dominant. After this point we have evidence that most humans are right hand dominant. The left hemisphere of your brain also controls the right side of your body. The hypothesis is that your right hand (and foot) becoming dominant was a side effect of this side of the brain doing more processing. There is also evidence that people who process language on the right side of their brain tend to be left handed. As for people who process language on their left side of the brain and are left handed? I don't know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the x-axis on this graph supposed to represent?",
        "response": "Based on the dates on the bill, you're billed for two months at a time. So the x-axis contains abbreviations for months, taken every other month (since billing cycles are two months), and in reverse order (most recent first, and then getting older as you move to the right). So the letters stand for: * June  * April * February  * December  * October  * August  * June",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do cops need to request vehicle registration and drivers licenses to give a fine, but bylaws can just write a parking ticket without all the identification?",
        "response": "When a car is parked, it doesn't matter who drove it to that place -- all that matters is who owns it, which is linked to the license plate. A moving violation is written against the driver, who may not be the owner.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Under relativity, is a stable orbit even theoretically possible?",
        "response": "Orbits emit gravitational radiation and decay because of it. However, the timescale of the decay is generally much longer than any other astronomical or cosmological process that it's pretty much irrelevant. Even in systems like double pulsars, the time-scale is still in the trillions of years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if you microwaved something while there was a hole in the microwave?",
        "response": "> Would the air be bad to breathe? What would happen if you breathe it? No, microwaves don't make poison air. They make microwaves. An unshielded microwave would emit high microwave energy, causing pain and burns similar to a fast and extreme sunburn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people feel the urge to roam the house while on the phone?",
        "response": "Personally I would call it anxiety as I do not enjoy talking on the phone no matter who the person is, and if I am stagnant I feel like I will contribute less and seem off putting. Roaming kind of makes your brain stay alert.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can fish survive in carbonated water, or would they suffocate?",
        "response": "There can be some pretty dramatic effects of CO2 below levels that would kill a fish. There's some pretty interesting research that's shown that for some species of saltwater fish, CO2 can interfere with neurotransmitter function and impair their ability to chemically detect predators in the water. So this may not be as much of an issue in, say, your aquarium, but in the ocean it could have a pretty dramatic effect on fish survival.  Maud Ferrari has published a bunch of cool papers on the topic, and [this](_URL_0_) is a good review if you're interested.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do gas giants die?",
        "response": "They don't die, they're not alive. Stars are said to 'die' because there's a process, nuclear fusion, which eventually peters out in their cores. But there's no ongoing process that defines a gas giant.  Given enough time they'll gradually contract more and more, and the end of their host star's life (whether red giant to white dwarf or supernova) will result in most of their envelope being blown away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if there is no up or down in outer space, why is the Earth always \"upright\" in photos from space?",
        "response": "Because that's how astronauts orient themselves when snapping photos. I'll bet if you looked around enough, you'll find some taken from a different perspective. The only up in space is a predetermined direction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we actually know what Einstein's IQ was?",
        "response": "As far as we known today, Albert Einstein has never done any IQ test. Thus his IQ is unknown! In the 1920'ies scientists had tried to estimate the IQ of deceased personalities such as Mozart (1756-1791) and Goethe (1749-1832) by means of biographic data; thus they wanted to estimate Albert Einstein’s IQ, too. The value estimated for Einstein was between 160 and 180. But this rough estimation can not count as Einstein’s IQ! Remember the standard IQ-test will show a persons ability to think logically and solve problems and is not a real indicator to how smart someone is. This has far too many variables to be indicated in one single quotient. Source: _URL_0_ The source may look a bit shady, but it's been reliable in my experience.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Do Police Use Loud Sirens When Responding To Bank/House Robberies As It Alerts The Thieves They're Coming?",
        "response": "Everything in police work is about maximizing the safety of the public. The use of sirens is a safety system to let other drives know \"I'm responding to an emergency, I'm in a hurry, get the fuck out of my way!\".  Anytime that a call is urgent enough to require speed, it requires these safety features. The potential concern of scaring off the robber DOES NOT override the greater concern of public safety.  If a robbery features robber vs. innocent people, then this is a potential danger, and it's better to respond quick and scare off the robber, than to sneak in and catch them in the act. If the robbery consists of \"robber in a non-occupied warehouse\" then the officer can sneak up and catch them.  Ultimate deciding factor \"people > property\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Many atoms on earth can only be formed in stars. Do we know how many cycles of stars the matter in our solar system has been through?",
        "response": "We look at the metallicity of the star, which is a fancy way of saying how much of the star isn't hydrogen or helium. First generation stars would have had almost zero metallicity but each successive generation would increase by getting seeded from the heavier atoms made by the previous generation stars. I believe the sun is thought to be a third generation star based on how many heavier elements it has mixed in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the moon sometimes appear sideways?",
        "response": "It's a lot easier to grasp when you think about the Sun's location relative to the moon when you're looking at it. The bright part of the moon is always facing the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does feces and urine smell so bad?",
        "response": "So we instinctively avoid it, as it can harm us",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How rampant has voting fraud been in US elections?",
        "response": "In the US South, voters of different persuasions (poor, less educated, black, Republican, Populist, etc.) were systematically harassed, coerced, or disenfranchised. There was a century-long history of this, which led to the Voting Rights Act of 1965. Ballot stuffing in Texas, like other areas of the South, was a long standing tradition. LBJ became famous for having won by less than 100 votes in the 1948 senate election - and this evidently achieved by supporters stuffing ballot boxes, but it is also widely believed that his opponent stuffed the boxes of the previous election that he lost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could I live at a 24-hour gym?",
        "response": "I'm sure they would ask you to leave once they found you sleeping for 6+ hours at a time. If you can avoid sleeping, then they probably would have no problem with you staying 24/7.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the speed of light is a universal constant (~300,000 kms/s) then how did the universe expand so quickly after the big bang?\" Does this imply that \"out there\" there is \"something\" faster than the speed of light?",
        "response": "No, the speed of light is a maximum speed for any propagation of information, be it a wave, particle, energy distribution, gravity. However space, or the fabric of space can expand and contract, stretch or thin at any rate as this does not transmit information. It is space which is expanding when we say the universe is expanding and everything else is just along for the ride. So some galaxys are expanding faster away from us now than the speed of light because the space between us is expanding faster than light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does pouring a beer into a glass at an angle allow it to keep from foaming so much, as compared to pouring straight into the glass?",
        "response": "It reduces the surface area of the liquid. Foam is caused by a lot of carbonation escaping from the beer all at once. Carbonation escapes more easily when there is a larger surface area, so by pouring it down the side of the glass, you reduce the amount of carbonation that is able to escape at once.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why whenever I eat a burger/sandwich the bottom bun always gets way smaller than the top bun.",
        "response": "Because you move your lower jaw and the bite on the bottom part goes \"deeper\" than your upper bite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were territories gained from Spain in the Spanish-American War considered \"colonial\" or \"insular\", but it was clear that Hawaii would eventually become a state?",
        "response": "Part of the reason lies in the local culture. The people of former Spanish colonies were culturally different from Americans and numerous. Americans didn't want that many uneducated, Catholic, brown-skinned people in the country. It would either mean giving them citizenship and \"diluting\" the population, or creating a kind of class system that would be absolutely unacceptable to American ideals. There were some calls to annex *all* of Mexico during the Mexican-American War in the late 1840s that were quickly struck down because Mexicans were seen as \"lesser\" people unqualified to become American citizens. The Hawaiians, on the other hand, were seen more along the lines of indigenous peoples like the Native Americans, and therefore less of a threat if incorporated into the United States. **tl;dr** - racism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if you eat rotten meat?",
        "response": "Well, if you could tell by the taste of the meat that it had gone bad you might want to prepare for feeling sick later and possibly throwing up. If not, chances are that nothing happens. It depends a lot on how weak your stomach is. Do you get belly aches easily?Bacteria like to grow on rotten meat and some of them are nasty like coli or salmonella, but since the meat was cooked it reduces the risk of food poisoning. If anything, I'd guess you'll throw up once and that's it. If you've never had food poisoning before and end up having it: it's hell but it doesn't last forever! It just means vomiting a lot and frequently, but it's to get the strong bacteria out of your system. The whole thing could be over in an hour or sometimes more, but it's usually a relatively short thing. It's nasty, but you won't die from it. I see you posted it 8 hours ago. If nothing happened yet, you're safe. These things usually happen like 30 minutes after you've eaten.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any difference in the water that forms the rings of Saturn and the water we have on earth?",
        "response": "Well one difference is its much colder around Saturn..... But yea pure water is just pure H2O so whether it's in space or on earth the molecules are the same. Any impurities would just be trace minerals and those might differ than the trace minerals on earth but that's about it. Edit: Its also possible that the amount of \"Heavy water\" D2H might be higher in water surrounding a gas giant than on earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does refubished mean when looking at electronics? Is it worth buying?",
        "response": "Refurbished means it has been checked and possibly fixed by somebody who is certified, usually by the manufacture, to do such work on the product.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between mexican soda and U.S. soda",
        "response": "Soda made in the U.S. has been made from high fructose corn syrup (HFCS) for decades. Soda made in many other parts of the world continued to be made with cane sugar (and in glass bottles). The difference is in the taste. If you don't believe me, seek out your most Latin neighborhood and find an abnormally tall glass bottle of Coke, Sprite, or Fanta. Then thank me for changing your life. Also, assuming you're anywhere in the southern half of the country, they sell this stuff in bulk at your local home depot.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does an object with a constant velocity and zero acceleration exert no force on an object it collides with?",
        "response": "It's not the acceleration before the collision that matters, it's the acceleration during the collision. The objects before and after have different momenta, and the change in momentum over time is force.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In an event of a power outage, can electrical appliances stay powered on if backup generators respond fast enough?",
        "response": "Yes, it is. But how long depends on how it is designed. Most modern equipment uses a switchmode power supply. These have large capacitors at their inputs which store power. They normally can keep running for a few tenths of a second, but if they use large caps and work down to low voltages, they can run for several seconds before powering down. And you can increase the size of the filter caps to keep it running as long as you want - although if you need more than a few seconds, you'd be better off building in a battery backup system, too keep it running for - well, choose your battery size for hours or days.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Bootstrap Web Development",
        "response": "When you do web development, you will often want to implement 'best' or 'standard' practices. These are practices in terms of styling, scripting, unit testing, building.  What Bootstrap does is it brings together a bunch of these 'requirements' together in one place. So it gives you some Less stylesheets, you get some already-styled web page elements like buttons, labels, textboxes. You get several JQuery plugins too for dialogs and carousels and autocompletes.  By bringing it all together, it's a quick and convenient starting point when creating a new web project. It's not necessarily always the place to start, sometimes you will want a lot more control over what you are creating, in which case you'd probably start by picking the bits yourself using grunt/bower. In some cases you do want a quick start, and bootstrap is one way of helping you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when someone is beaten to death?",
        "response": "The most common cause of death from being beaten would be brain damage from bleeding within the cranial vault (inside the skull where the brain is) There is very little room in there for anything but the brain, so if there is bleeding from an injury, the pressure starts to squeeze the brain and push it through the small hole at the base of the skull (herniation) usually killing the person if not surgically stopped. The next most common cause of death from a beating is internal bleeding, usually from and organ injury to the Liver or Spleen. Other causes of death could be a ruptured lung (Pnumothorax) a bruised heart (cardiac contusion) or a broken neck (transected cervical spine)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Kratom, and why is the DEA so interested in banning it?",
        "response": "People can use Kratom instead of anti anxiety meds from what I've heard. In my opinion they should just leave it alone, but then how will the DEA get their cut? The DEA isn't interested because it may be a harmful, addictive drug, they're interested because if people catch on that Kratom is an option then people may choose that instead of pharmaceuticals and then a lot of higher ups lose money. And they like money too much to let a seemingly harmless substance that may even do good for people stay on the streets where they can't tax you for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to leftover campaign donation money after the election?",
        "response": "Here in Florida you have to either give it back to your donors or donate it to a recognized charity (501c3).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would have been the body type of a \"perfect 10\" (sexual attractiveness) in Ancient Rome?",
        "response": "A similar/Parallel discussion on Fatness in the roman empire (_URL_5_) does also get into the beauty and attraction discussion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can Chinese sellers on eBay afford to sell me an item for 89 cents with free shipping? Do they not pay to send the item?",
        "response": "I heard a podcast the other day that explained this - basically international companies pay a different, much cheaper rate to ship overseas. The expensive bit is the \"last mile\" which covers the shipping once it's in the destination country, e.g. USPS to get it to your door...and they don't have to pay for this at all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the present day west we tend to attribute particular personality traits to certain animals (fox=sly, owl=wise, cat=stuck up, etc). Did Native (North) American tribes anthropomorphise animals in that way? If so did they come up with different imagined traits for the same animals?",
        "response": "Northwest groups have anthropomorphized a number of animals. As have most of the tribes in the west. Perhaps the most common animals represented in the mythological literature are Coyote and Raven. [Coyote](_URL_0_ or the Trickster, was famous among Northwest California as a mischievous critter who could trick people into having sex with him, take others' money or possessions, and give people they were averse to bad luck.  Prominent Coyote stories have been collected from central California to the northern Plateau. Coyote was also mythologized in the Southwest and in the Great Plains. Coyote figured prominently in creation myths, innovations (e.g. creating fire), demonstrating normative or more accurately, non-normative behavior, and in explaining natural land forms. *Hupa Texts*. P. E. Goddard. 1904 Handbook of North American Indians, Smithsonian. Volumes 7(Northwest), 8 (California) and 12 (Plateau). Handbook of California Indians, A. Kroeber, 1970",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "benefits of different pay types from business stand point",
        "response": "Hourly and non-exempt are almost exactly the same, and is often a matter of convenience to the employer.  Hourly is more common in jobs where productive can be easily measured, like shift work. If a machine operator is late to their shift, the machine sits idle and that time is lost. Such jobs often involve punching a clock. Non-exempt salaried is for jobs that are harder to measure, or where idle time is not closely linked to lost productivity. Office workers are usually free to come in a early and stay late, so the exact hours they work is less important. They typically self report their time. Exempt salaried are positions in management, administration, professional, technical, and a few other categories, typically ones with the freedom to set their tasks and responsibilities. Since the directly their own work, the don't necessarily have to track their hours.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did we all come from people with a black skin tone?",
        "response": "There is no definitive way to know, as there were no cameras or even written records, of course. However, yes, the common wisdom is that ancient pro to humans in Africa had dark skin tone, as this is an evolutionary advantage for living there in the intense sunlight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "/r/ShitRedditSays. I don't get that subreddit. Can someone please explain to me what the fuck is going on there?",
        "response": "1. Find a boderline outrageous comment on reddit 2. Remove any explanatory context 3. Create a sensationalized title, post to SRS 4. Send a horde of self righteous dumbasses into the original sub, making reasonable discussion impossible 5. Smugly comment on what a terrible place reddit has become For example, in a discussion on health care policy, someone might suggest now that AIDS is largely treatable, research money is better spent on other diseases. This will show up in SRS under the headline \"Reddit thinks all gays should die!\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Curved trajectory of Ping-Pong balls.",
        "response": "Adding spin to the ball will cause its trajectory to curve, due to the [Magnus effect.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a planet be made of light?",
        "response": "Theoretically a large enough density of electromagnetic radiation in a very small area could form a black hole. However, it can't make a planet. Light doesn't bind to itself and it's always moving above escape velocity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how were languages created?",
        "response": "Ogg pointed to Trugg and grunted while gesturing towards his stick. Trigg thought that grunt meant Ogg wanted his rock. So Ogg grunted with a higher pitched inflection and Trigg understood he wanted stick. From that day forward, Ogg would always grunt with an inflection to indicate 'stick' and thus the first word was created. Soon they created other inflections and varying sounds to distinguish from 'rock' and 'fish' and 'HOLY **** THERE'S A SABORTOOTH TIGER RUUUUN'",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it only now that Pirate Bay's HQ was raided and the website shut down when it was clear years ago where they were operating/what they were doing was illegal?",
        "response": "Pirate bay has never actually had any illegal content on there servers. They only have had links to the content. This a various other loop holes have kept them clean.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast can we possibly travel in space using current technology?",
        "response": "About 20 km/s, going away from the sun. You can get a lot faster if you go towards or around the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Geology] Why do certain types of mud dry up rock hard, while other types are soft and crumbly?",
        "response": "It can depend on a wide range of things; e.g. what clay minerals are present, how well aligned the grains are, what the chemistry of the pore water is/was, how quickly it was dried, whether any compressive forces were in action, whether there is any sedimentary structure to the fabric.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many generations would it take for a Mars colony to become a separate species from their Earth ancestors?",
        "response": "i think the biggest problem would be immunological. the first generation born on mars wouldn't be exposed to much of what earthlings are exposed to, so interactions and child birth between martians and earthlings would be marked by sickness, and the problem would just get worse over time, since we can assume the colonists' biosphere is much tinier than earth conditions and more carefully controlled.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is mathematics a universal language? If so, how could we use it to communicate with another civilisation after initial contact?",
        "response": "They put plaques on some of the space probes they shoot out just in case they bump into aliens. I thought there was a better one than this, but can't find it. Anyway: _URL_1_ It's more of a pictorial message, but to interpret it relies on mathematics (amongst other things). It depicts distance a couple of ways that could then be used to figure out different things from the messages. Kind of cool.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The significance of the pentaquark",
        "response": "Some theories predicted their existence, some didn't. We now know to reject the theories which were wrong, and pursue those which got it right. That's how science works. There is no direct practical impact, other than the general advancement of science.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do neon signs have a buzzing noise to them?",
        "response": "I think the most likely culprit is the transformer for the neon sign. The transformer takes the 120V or 240V 60Hz from the outlet and steps it up to several kV. The way it works is by running current through a coil of wire to create a magnetic field, and then converting that field back to a current in a secondary coil of wire with a different number of turns. The oscillating magnetic field can cause vibrations of any magnetic material in the vicinity (casing, core, etc).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the air outside mix of gasses? Shouldn't the heavier gas settle lower?",
        "response": "The short answer is that entropy dictates that a mixed system of gases is more favorable than those gases separate.  The longer answer is that gravity simply isn't strong enough to overcome the entropic driving force that keeps gases mixed. On top of that, N2, O2, and Ar are all pretty close in weight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has anyone ever gotten Cancer then beaten it without necessarily knowing about it?",
        "response": "While you may not consider this to be a satisfactory answer to your question, cancerous cells actually develop fairly frequently in your body. However, they are almost always killed by the immune system quickly. (If they are not, it can lead to spreading of the cancer, tumors, etc., \"cancer\"). In this way, it could be argued that everyone gets cancer and beats it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the main differences between the Republican Party and the Tea Party?",
        "response": "The Tea Party is an umbrella term for a subset of people that believe in strong conservative fiscal policy (even more so than most Republicans). And while they tend to lean conservative on social issues, it's not as important as the fiscal policy. Remember, though, that there are multiple Tea Party organizations advocating for different things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Most efficient heat exchange location on human body",
        "response": "The hypothalamus (a part of the brain) is devoted to maintaining a stable environment in the body, in terms of temperature there's a few ways in which it does this, once of which is either dilating or constricting the capillaries in our extremities.  This is in concert with starting or stopping sweat production and making our body hair lie down or stand up, and encouraging or discouraging urination. (For each of these pairs the reaction to warmth comes before the reaction to cold.) In simple terms, your extremities, which is basically your *entire skin*, are riddled with capillaries for the specific function of heat exchange, whereas your major blood vessels are near the core of the body, mainly for transport of blood. So you're right, your friend is wrong. Source: current biology major.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a quantum computer collapse into the right answer?",
        "response": "You don't. I know that answer makes people cringe, but that's the point of quantum mechanics. A traditional computer typically works by reading a high or low voltage. When you're talking about quantum mechanics you're dealing with spin states of electrons. There's a possibility to where you won't be able to distinguish off from on, which is where the qubit comes from. A better question would be, how is a qubit useful. It's useful in the sense that it enables us to come up with more clever logic gates that can be designed to tackle problems quicker. That said, where not using binary logic anymore, so it gets infinitely more complicated (well, not really, but it does get harder). There's not many known quantum algorithms known currently, but the ones that are known are targeted towards cryptography, which is ultimately the entire motive for this kind of research. [If you're interested in these new logic gates check out wikipedia.](_URL_0_) It'll explain it better than I could.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given how far lightning travels before it strikes, why is it still attracted toward slightly taller objects given the relatively small difference between the ground and object?",
        "response": "It's because of the way that lightning moves. It doesn't just appear as one coherent bolt all in one go. Lighting consists of several distinct stages. The first stage is marked by what are called stepped leaders. These are essentially filaments of charge which originate in the cloud. Each stepped leader moves a few meters at a time in a jerky and branching pattern defined by least resistance in the area they're moving through. Once a stepped leader comes into contact with a ground point, then the second stage takes over, and consists of a number of massive return stroke from the ground back to the cloud which equalizes the charge differential between the two. Here's a video of a lightning bolt taken by a high speed camera which shows the distinct phases. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does corporate welfare and deregulation helps the working class?",
        "response": "It depends on whom you ask. Many would argue that it doesn’t help workers at all, and benefits only wealthier employees and executives. The theoretical benefits are that a company in a deregulated economy is more profitable (true, often) and can pass more benefits down to the workers. However, it’s worth noting that in order for workers as a class to do well, so must consumers, whom regulations most often protect in terms of economically-minded laws.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference between ad valorem tax and capital gains tax",
        "response": "You've got some of your vocabulary mixed up, and it's like you're asking *what's the difference between asphalt and I-95.* Capital-gains tax is basically a tax on your profit from buying something for a low price and selling it for a higher one. In a little bit more detail, it's a tax on the difference between your sale price and your cost to acquire and improve (but not maintain) the asset. Ad-valorem is an adjective to describe taxes that are assessed on the (estimated) value of a property. The Latin just means according-to-value. Many cities and counties have a property tax where homeowners must pay a certain percentage (1%-2% is pretty typical, but there are high-tax cities out there) of the assessed value of their house & land.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the fastest algorithm for multiplication of two n-digit numbers?",
        "response": "There are lots of such algorithms. [This picture](_URL_0_), taken from [_URL_1_](https://_URL_1_), illustrates the fastest method (on a given CPU) to multiply a *n*-digit number by a *m*-digit number. For very large values of *m* and *n*, you want to look at the upper right corner: you see here that [Fourier transform-based methods](_URL_3_) (yellow) are the fastest. But this becomes true only for numbers of more than about 10,000 bits. Numbers that large are really not encountered often (for instance, they are way too large for most cryptography, whether currently-used or currently-suggested).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Turning light into matter?",
        "response": "Ignore useful. How a discovery is used is of zero concern. What is important is the experiment and proof of concept. If successful, it will prove our understanding of matter and the universe, if unsuccessful we will study why and expand our understanding of the universe.  It's like the discovery of electricity, when someone commented \"It's all very nice, but of what use is it?\" No one experimented with electricity thinking, \"I wonder if I could use this to invent the tv.\" Now most people can't even function without electricity flowing. What is being experimented with is the famous equation E=mc^2 . Energy is mass and mass is energy. We can take mass and create energy but we should be able to go the other way too. If we can, who knows what that may lead too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a cat seemingly \"turn off\" when the back of their neck is pinched?",
        "response": "It's instinct. Mother cats will use the skin on the back of a kitten's neck to carry it (in her teeth) if she needs to move it. Cats instinctually go limp when this happens (which prevents it from potentially hurting one cat or the other), and you're triggering that same instinctual response when you grab a cat there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Moore's Law really still in effect?",
        "response": "The clock frequency of your computer isn't a true measure of its speed. What Moore's law actually 'predicts' is an exponential growth of the number of transistors on a chip, [which is a persistent trend](_URL_2_) although possible a self-fulfilling prophecy (manufacturers are aware of the trend they have to meet, and meet it). I'm not an expert on computer engineering but I believe the reason processors stopped increasing in clock speed was because it was starting to use too much power requiring too much cooling compared to other improvements like parallelization.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there potentially an unlimited number of elements that can be discovered?",
        "response": "It gets harder because higher and higher elements are progressively more unstable. It is possible, but not certain, that they'll be so unstable as to not be able to bind together at all past a certain point.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't tobacco advertisements protected free speech in the United States?",
        "response": "The tobacco industry, for **decades**, systematically hid from the US Government and the public the devastating health detriments of tobacco use — cancer, emphysema, heart attacks, the effect it has on developing children exposed to nicotine, tar, and secondhand smoke — So, in order to settle the **enormous** litigation against them, in part, they agreed to government regulation of their packaging and advertising.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do we know which genes affect which of our traits?",
        "response": "One way is you look at a bunch of people who have specific traits, do a gene survey, and see if there's one (or more) gene(s) that they all have. This is easiest for single genes with a drastic and easily detectable effect, if there's like fifty different genes that each have a little bit of an effect it gets tougher.  Alternately, for mice or *E. Coli* or whatever where we can mess around with their genes, we can basically go \"what happens if I push THIS button?\" by creating genetically-modified critters and observing any differences.  A third is that nowadays we understand the \"language\" of genes that code for proteins and such, the sequences of DNA that say \"start here, stick these amino acids together, then stop here\" or whatever, and then by tracking what the known protein does you can see what the gene does.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm a rural citizen of a Soviet Social Republic wake up in 1991 to the news that the USSR has dissolved; in what concrete ways (legal, societal, etc) has my life changed?",
        "response": "I think it might be better for you to specify which Soviet Republic you live in. The living standards of Ukrainian or Russian farmer were different from those of an Uzbek or Tajik one for example.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Lots of US states have laws against oral sex. Were these laws ever enforced? How?",
        "response": "Another question, would both parties involved get in trouble, or just 1 person?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when you quit the military during training?",
        "response": "You can generally quit during your initial basic training if you want to. They don’t want people who really don’t want to be there. There will be exceptions but generally if you say you’re done, you can start the process of leaving.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do aquatic animals know how far they should go down in the water? ex. Blue Whales can only go so far down, what prevents them from going further?",
        "response": "Probably \"similar\" to the feeling you get when holding your breath past what's good for you. Your body just knows what it needs and will tell you when you are taking risks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does iodine help with radiation? If at all.",
        "response": "One of the radioisotopes released in large volume at Chernobyl was Iodine-131, a highly unstable form of Iodine with a half-life of 8 days.  Iodine in the diet is absorbed by the body and concentrated in the thyroid gland. I-131 undergoes beta- decay to yield Xe-131, an electron, and a gamma ray. The electron carries sufficient energy to damage cellular machinery and cause mutations. To prevent radioactive I-131 in the environment from concentrating in the thyroid, likely damaging or killing it, an appropriate dose of Potassium Iodide can be ingested in order to saturate the gland with stable Iodine.  A daily dose taken for 6 weeks can provide some degree of thyroid protection during the early days of a nuclear emergency. After 6 weeks, ~99% of the I-131 will have decayed, and use of the supplement is discontinued.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Female worker's 77c for $1 study",
        "response": "That statistic is using all professions, meaning it's partially comparing CEO's and surgeons (male majority) to secretaries and cashiers (female majority). If you compare the same jobs and account for things like experience, the difference shrinks (I believe) to under 10¢. The remaining few cents can be partially attributed to the fact that men are more likely to aggressively negotiate their wages and also to the fact that since men, on average, work more overtime, they are more likely to get a raise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any type of astronomical phenomena that could occur in a different galaxy yet still affect our planet?",
        "response": "**Very** hypothetically, a [vacuum metastability event](_URL_0_).  It's unsure if the vacuum of space is a true vacuum, or a false one. If it's false, and something happens anywhere in the observable universe that manages to kick the local vacuum into a lower energy state, then the new *true* vacuum could spread out at the speed of light, most likely completely annihilating all of existence and rewriting the very laws of physics in its wake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any materials/structures/chemicals that can be tuned to get a precise frequency of reflective light like an L.E.D.'s emitted light?",
        "response": "There are a number of different ways to get the effect you're asking about, which is sometimes referred to as [structural color](_URL_0_) when it's found in nature. Thin films of materials with different refractive indexes can be used to make filters that reflect or absorb certain wavelengths and reflect others - this is a called a [dichroic filter](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If people are cutting all those forests down, doesn't it mean that the oxygenlevels in the sky are dropping too?",
        "response": "Yes, oxygen levels are dropping but since so much of the atmosphere is composed of oxygen (21%) the relative change is quite small - for every million O2 molecules in the atmosphere, 19 O2 molecules are lost each year - mostly due to combustion of fossil fuels but deforestation is also a factor. It requires very sensitive equipment to even measure the effect. [This page](_URL_0_) has a plot of atmospheric oxygen levels from 1990 to present. In addition to the long-term decrease, there is an annual cycle of oxygen since plant growth peaks in summer months.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do hunters wear camouflage clothing but bring orange accessories? Do they want to be visible or stealthy?",
        "response": "Since most animals are color-blind, the orange doesn't stand out to them, but it stands out to other hunters. Wearing orange prevents you from being mistaken as an animal, something that can absolutely save your life when folks get trigger-happy.  Source: I grew up in rural area and wore orange often.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does quantum mechanics prevent one from (hypothetically) measuring the gravitational field of a particle to determine its position and velocity?",
        "response": "There is no reason to suppose that gravity doesn't follow the rules of quantum mechanics to this basic order. So no, you cannot use gravitational effects to bypass the uncertainty principle. In fact, the uncertainty principle is probably the most certain part of quantum mechanics. It is incredibly unlikely that any new discovery will discredit it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(x-post AskReddit) Why does a storm in Salt Lake City usually cover the entire city, but a storm in Las Vegas (roughly the same size) only cover a few square miles and the rest is blue skies?",
        "response": "SLC has far greater humidity than LV (according to Wiki, SLC receives 4x as much precipitation than LV). Naturally, in a higher humidity, clouds are more likely to form because the air cannot hold as much water vapour so it condenses. This is why SLC has full-city coverage whereas clouds are sporadic in LV. But why does SLC have a greater humidity? There are a few reasons - SLC has better access to the jet stream coming from the Pacific. LV is at the very edge of \"monsoon season\" area, so the monsoon's effects are not as dramatic. SLC also has greater amounts of \"lake effect snow\" during winter, because unlike LV, there isn't a mountain range separating the city from its nearby lake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was it that Japan, being prepared to fight the US to the last woman and child in 1945 didn't have massive insurgencies in the early postwar period?",
        "response": "The emperor of Japan ordered the people directly to surrender and accept/endure their fate. The Japanese people held the emperor in extremely high regard and this was enough to ensure that things were peaceful. It also probably helped that the people were starving and tired of fighting. _URL_1_ _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I feel so awful after a 4 hour flight, but feel fine after 4 hours at my desk?",
        "response": "A lot of reason,s actually. In an airplane, the pressure is lower than you're likely used to (in most, it's normalized at the pressure roughly equivalent to ~7,000 feet above sea level). Unless you live that high up (and there are only 14 states that even *have* peaks much above 7k feet) then you're going to feel a difference, and you ascend to that pressure so fast that you don't have much time to adjust. So there's some just basic pressure shock involved.  Airplane air is also generally *very* low humidity, and that can dry you out and require additional water intake to offset, which most people don't get on the plane. It's recirculated, too, so any bad smells will often find their way back to you throughout the flight, albeit at lower levels. Then there's just the additional stress of travel -- crowds, security, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do electricity and plumbing connect into rotating restaurants/hotel rooms/houses?",
        "response": "In most rotating restaurants, only the floor around the dining tables rotates. The ceiling mounted sprinklers, lighting, and centrally located kitchen and bathrooms do not rotate. So there is no need for power or water on the rotating part. As u/sergeantseven said, it is possible to send plumbing and electricity through rotary joints.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we look far enough back in time, is there any evidence of the distance ancestors of our modern words were just made up out of thin air? It must have happened at some point, right?",
        "response": "Something like that. It wouldn't have been very functionally different from how it happens today. After all, we still invent and discover new things, and we have to come up with names for them. Somebody uses a sound (word) for a thing, other people start adopting that same sound, and before you know it, you have a word.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's wrong with developing downtowns?",
        "response": "You'll have to give more details. Who is saying there is a problem developing downtowns?  What are their arguments? Most people involved in urban design and development would argue that developing downtowns is the best thing that a city or region can do to improve its finances, reduce car congestion, and increase quality of life for residents.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come I never see thin film interference with just a water layer?",
        "response": "To show the rainbow of interference patterns that oil on water has, you need a flat, thin layer of material sandwiched between two materials of either higher or lower refractive index. It needs to be flat and thin so there is enough room to set up interference effects inside the layer that are steady over a big enough area for you to see them.  The vapor pressure doesn't matter much, but the surface tension does. Oil spreads out on water to make a thin layer thanks to a low surface tension. Water has a high surface tension and tends to make a thicker, rounder layer when sitting on a surface.  You can get really nice interference patterns by squishing some water between two pieces of glass, such as a pair of microscope coverslips.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are RWD cars more powerful than FWD cars?",
        "response": "A 400whp RWD car is not any more or less powerful than a 400whp FWD car. That said... RWD is better for acceleration, because weight shifts backwards under acceleration, so shifting to the drive wheels will give them better traction. FWD cars are nose heavy. The ideal balance for handling is 50/50 (imagine a pivot in the center of the car, it would be easier to turn if the weight is equally balanced on both sides, right?), and FWD cars will tend to have a poor weight balance due to the entire drivetrain being located in the front of the car. Further on handling, RWD cars have better balance between understeer and oversteer. When a car is turning, a FWD car will tend to plow forward if you approach/exceed the traction limits, while you can rotate a RWD car with the throttle and keep it on course.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do pets lay around all day without getting bored?",
        "response": "Humans are animals too. If we didn't invent this thing called \"work\" we'd also spend a lot of the day sleeping, lounging around, doing nothing. Otherwise known as the weekend.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why games/software/movies are released on different dates in different regions?",
        "response": "When the difference is a matter of days, it's basically done as a courtesy to stores. There tends to be a weekday that is \"release day\", and the various chains set up their distribution so all the stores have new content on this release day. Europe and America operate with different release days.  Digital storefronts obviously don't have this need for distribution, but the publishers that sell them the games don't want to give them access earlier than physical stores for fear that the physical stores will retaliate with less exposure, smaller purchases etc. As such, the publisher requires that Steam et. al. hold back release to coincide with physical release in that region.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come when through my polarising sunglasses coach windows have a shadowy lumpy pattern?",
        "response": "The windows are also polarized. This is usually a side effect from tempering glass. this makes the glass stronger but also causes it to break into a billion pieces as safety glass. Glasses are generally polarized intentionally to reduce glare as glare is polarized light being reflected. Roughly speaking your glasses are polarized in one direction and the dark spots in the glass are polarized perpendicular to them. The opposite polarization blocks the light. If you take your glasses off, look through them at the polarized glass while roatating them you'll notice the spots appear to move. If you do this with another pair of polarized glasses you'll notice that at some point all the light will be blocked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a meteor were to hit earth, would it be better if it hit land or in the ocean(and causing a tsunami)?",
        "response": "The answer depends on the size of the impacting object and your distance from it. You can explore the possibilities yourself using [this handy impact effects calculator](_URL_0_), designed by some impact experts. For instance, according to the calculator the damage from an near-Earth asteroid the size of a skyscraper would be contained within a 100-km area if it struck land, but if it landed in the ocean could create a significant tsunami 1000 km away or more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can same volume engines have different HP/torque/etc.?",
        "response": "The displacement of an engine is not the only factor contributing to work done by the engine. The compression ratio for one will change the power output (the more you squeeze the air and fuel the more power you get out). Intake and exhaust manifolds will affect how effectively air can enter and exit the combustion chamber (less pressure loss on the intake will help get more air into the engine, less back pressure on the exhaust will help clear the chamber to allow cleaner air in). How well the engine is tuned as well will play into the performance of the engine (igniting the air/fuel at the right time to make sure the mixture ignites when it is compressed the most). There is much that plays into HP/torque than just volume",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are people able to colorize old black and white photos?",
        "response": "The way I have done it is by essentially coloring it in by hand in Photoshop. Which means of course that the colors just guesses. There are probably more advanced methods, especially if you have the original film at hand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the average price for a slave in 1840's America?",
        "response": "The slave auctioneers spoke of their business as though they were, in fact, buying and selling hogs. The callousness is clear in this July 10, 1856 letter from slave trader A.J. McElveen to Charleston slave merchant Z.B. Oakes.  I offered Richardson 1350 [equal to 27,000 in 1998] for his two negros. He Refused to take it. The fellow is Rather light. He weighs 121 lbs., but Good teeth & not whipped. The little Girl he was offrd 475 [9,500, 1998]. I thought the boy worth about 850 [17,000, 1998] and at that price they would not Sell for cost, but I Supposed the fellow would bring 9 to 950 [18,000 to 19,000, 1998] & c and the little Girl 500 [8,300] at best.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Cassette tapes produce sound",
        "response": "If you expose a powerful magnet over the cassette tape would it be ruined?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My school is having its annual book sale, what are some good history books I can keep an eye out for? Which should I avoid?",
        "response": "If you haven't seen it yet you should absolutely take a look at r/ askhistorians [reading lists.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why would anyone buy a Treasury Bond? I can get .25% interest from a savings account.",
        "response": "FWIW savings accounts can almost always be found that have higher rates than t-bills. 1. A savings account is not risk-free. Comparatively speaking, a US Treasury is.  2. The insurance that protects savings accounts is limited to 250,000 dollars in the US. If you want to put more than that in the account, you're screwed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do scientists obtain radioactive isotopes of common elements such as Oxygen and Carbon for experiments that involve tracking the movement of molecules?",
        "response": "Chalk River in Canada, a nuclear reactor, makes a third of all the medical isotopes used (and most of North America's). There's another one in the Netherlands that makes another third. Things like Carbon-14 are also formed in such reactors and can be harvested.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If any distance can be halved, at what point do you stop touching something?",
        "response": "You're never touching anything - you are just as close as possible to it. The sensation you feel is effectively the force of the atoms \"pushing back\" against your fingers (and your fingers' atoms \"pushing back\" against the atoms in whatever you are touching). Think of it a bit like how two magnets push against each other, but much much stronger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given an unknown object, how would a scientist determine what it is made of?",
        "response": "Chemical analysis based on the spectrum of said object. The scientist would start off by taking a very small part of the object and heating it in a sealed container until it is all evaporated. Then the scientist would shine white light through the gas thus imprinting the absorption spectrum of the gas content on top of the white light. By analysing this absorption spectrum and comparing with known elements one can find the composition. This is actually how scientists measure the elements present in stars.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any animals other than humans that show signs of having religion?",
        "response": "Organized religion - no. Superstition - yes. See [Skinner's famous experiments on superstitious pigeons](_URL_0_) (article - > [Skinner 1947](_URL_1_)).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Carl Jung's theory of collective unconsciousness.",
        "response": "All I could gather from wikipedia is that his idea was about how all humans have similar predispositions, character traits based not on person, but species as a whole i.e. our species have set of characteristics from which a person could be made. It seems to me he was describing an instinct, nature of a man in a broad sense, which is a reasonable hypothesis. On the other hand wikipedia says that he was ambiguous in stating exactly what he meant, hinting that he thought of it as something divine, like a world soul. Some people say that his observations are proof for existence of such a thing, but with no evidence and way to test it (how to measure a soul?) it's not scientificly valid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Tuesday Trivia: In 1511, Brussels conquered apocalyptic levels of snow through a civic arts project! They built 100+ elaborate snowmen all over the city, depicting biblical and mythological scenes as well as obscene poses. How did people in your era handle wacky weather?",
        "response": "In France the church bell used to be rung during a storm. However its also a likely place to get hit by lighting. In 1783 there were 121 bell ringers killed by lighting strikes! (Peasants into Frenchmen pp 28)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do contacts stay in the center of my eyes?",
        "response": "Eyes are not perfect spheres, they actually raise a little where the cornea covers the lens of your eye, the contacts are sized to fit the cornea portion, with similar curvature. Like [this](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Greek austerity measures",
        "response": "Due to pressure from creditors, they are going to lay off gov't workers, reduce public work salary, pension benefits, raise taxes, and privatize some gov't functions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do thickening agents (roux, corn starch, arrowroot, etc,.) sometimes clump and sometimes not when used to thicken liquids?",
        "response": "Clumping happens when the starch molecules aren't separated fully before being added to hot/boiling liquids.  You have to make sure it is fully saturated a dispersed throughout whatever is being used to carry the starch (cool liquid for slurry or butter for roux).  The following is a snippet from [this](_URL_0_) article, which basically breaks it all down:  The way starches thicken a sauce is by soaking up water and using the heat to loosen their molecular structure. A starch is a tightly-packed string of sugars in a long, long chain. With the energy from the heat and the extra water, those long chains go from being curled up in a tiny ball to spread throughout whatever liquid they are currently boiling in. This causes a molecular net to form, which traps all of the water in the pockets. If all goes well, everything is evenly distributed and everyone is happy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Sun is almost entirely hydrogen and helium, where does it get its magnetic field from?",
        "response": "Plasma and a shitload of energy. You don't need heavy elements to create a magnetic field. See more here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't American's have citizenship to their ethnic origin but offspring born abroad have American citizenship?",
        "response": "Because we practice two types of birth citizenship: *jus sangris*, meaning that a child born to an American parent is an American citizen, and *jus soli*, meaning that any child born in the United States is an American citizen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Please explain this joke, I'm having a hard time",
        "response": "It sounds like an anti-joke. The standard setup is inverted and that is the cause of the humor. The bartender sees the joke coming and want's nooo trouble in his place.  I don't think it's funny, but we've all got different tastes in that regard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does salt \"bring out the flavor\" of food?",
        "response": "Salt tends to reduce our perception of bitterness in foods. By reducing the bitterness perception it actually increases our perception of not only the salt but the other flavors in the food that we can detect: sweet, sour, and umami (savory flavor). This brings out 4 of our major 5 tastes while reducing one that is often undesirable. Of course too much salt eventually overtakes those other flavors as well, so the amount of salt is very important. There is also the fact that we crave salt in order to get the sodium we need to survive. Meeting that craving adds to our enjoyment of foods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Bismarck want to alienate France? Did he have some kind of personal hatred?",
        "response": "It goes a lot deeper than personal hatred. You might start with reading the wiki articles about the franco-prussian war and the general diplomatic situation at the time: Causes for the war of 1870: _URL_0_ And the overall traditional enmity of France and Germany. _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I have 1000 dollars in a stock and the stock goes to zero, what happens to my money?",
        "response": "Stock represents your share in ownership of a company. When you buy stock, the company gets the money. If the value drops to 0 then that means the company is being appraised by the market as worthless. They may have your money somewhere or they may have spent it. You own a tiny sliver of the company though, and if the value of the stock goes up (based on the company's value) then you'll be able to sell your stock based on that value.  People who own enough stock in a company get to make decisions about it, and even if they don't, companies often worry about \"shareholders\" and their interests since these people indirectly help fund the company, and through their buy/sell behavior, influence the value of company shares (stock) on the market.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do we know about how Marcus wrote the Meditations?",
        "response": "/u/boopoo3894 tackled that [here](_URL_0_). This kind of information is generally available in introductions or praefationes in the critical editions of the texts. Almost all Loeb editions, in addition to having a translation as well as the Greek, will have an English introduction; Oxford editions have started to use English introductions but don't provide translation of the text, and the old editions will have Latin praefationes - these will usually have fuller info though, if you can work through the Latin. Boopoo gives a good account and some scholarship in addition, if you can't get your hands on a critical edition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How massive would a black hole the size of our sun be?",
        "response": "The rule is that a black hole's Schwarzschild radius is 3 kilometers for every solar mass. A black hole the *mass* of our Sun would be 3 kilometers in radius (compare to 696,000 km for the Sun). A black hole (non-rotating, since rotating black holes are nasty to calculate) with a radius of 696,000 km would have a mass of about 236,000 solar masses. A 1 million solar mass black hole would be 3 million kilometers in radius.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I just had my first dream in another language. I have only ever studied English. Was what I was speaking and hearing in my dream nonsense? Or was there meaning hidden away in my subconsciousness?",
        "response": "Your subconscious has better memory than you; it's possible you were simply repeating words you've heard on shows or movies. And it doesn't matter if you don't know any of those words, if in your dream you believed you understood their meaning, then you did. It may not be real Spanish or Japanese , but in your dream it was.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the world of normal, everyday crime like in Paris (and other big cities) during the German occupation? Did normal crime become politicized as Resistance activity? Did French detectives continue catching French criminals?",
        "response": "Follow up, what were the punishments like for petty crimes like theft of food or being out past curfew, if there even was a curfew.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't all TV shows and movies have consistent sound mixes / volumes?",
        "response": "Usally the tv shows and movies are kept nearly the same, but it can change heavily even in the movie itself and the TV station can't control that.  That said, ads are always louder as anything else to make the user aware of the ads. Their isn't really a standard for the right volume, that doesn't even exit in music.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes someone to look pale or lose their color when sick?",
        "response": "A lot of blood which is normally distributed equally throughout the body is being sent to your vital organs. For example, if someone is experiencing stomach pains and become pale and weak, their blood is being sent to the stomach organs to help heal the illness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we hate rats so much but are indifferent to squirrels?",
        "response": "squirrels aren't trying to get into my house",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When and why did crucifixion fall out of practice?",
        "response": "It was abolished by the Emperor Constantine and so fell out of use in both the Eastern and Western Roman world - I believe this is contemporaneous with Constantine's baptism in 337 and done out of respect for Jesus. The practice was resumed by the Umayyad caliphate (see Sean A. Anthony's *Crucifixion and Death As Spectacle*) as a form of legitimizing their rule, essentially establishing themselves as peers of the Roman, Byzantine, and Sassanid emperors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How shiny was the knight's armour?",
        "response": "A follow-up question, was it anything as shiny and artificial-looking as [this](_URL_0_)?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the back of my Sensodyne (and other OTC drugs) list active and inactive ingredients?",
        "response": "Active ingredients fight the problem. Inactive ingredients make the part of the product that doesn't heal you. For instance in vodka, the active ingredient would be alcohol, while the inactive ingredient would be the water that's added to dilute the vodka to 40% alcohol. I know alcohol isn't the kind of drug you mean, but it's a simple one that I know the formula to, haha. For things like neosporin, the inactive ingredients probably constitute the gel, including thickeners, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a subsidiary?",
        "response": "A subsidiary company is a company that is owned (or mostly owned) by another company. It is also referred to as a daughter company. Subsidiaries are not divisions of the parent company. The Disney channel is a good example, its a company, but its a subsidiary of Disney Inc. This explains it a bit easier: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- Why is water footprint important?",
        "response": "Few reasons, (1) You need to purify water to make it suitable for agriculture, that purification takes energy. (2) You need to get the water from where it is to where you want it to be. If the natural water cycle doesn't do that for you again it takes energy to transport it (3) Sometimes you pollute the water in your process in a way that thee natural cycle can't handle so that water is gone from the system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does captcha work exactly and what is it supposed to accomplish?",
        "response": "Websites use captcha schemes to separate human users from simple computing users.  Because humans can do some things easily while same task is harder on computer.   At same time, new AI algorithms are solving what we're previously hard computing problems. As AIs grows in capability, captcha teams have to find new problems that are easy on humans but still hard on AI.   Additionally REcaptcha is used to improve Optical Character Recognition algorithms so that printed books can be digitized easier. It's also used to gather datasets to train AI  REcaptcha is funded by Google.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did coming out of the closet become assosiated with the homosexual movement?",
        "response": "Pretty sure it's an evolution of the idea of having \"Skeletons in your closet\". If you are secretly gay, that's a big skeleton in your closet, which becomes \"you are a closeted gay\", which then means you come out \"of the closet\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do people who are larger or more obese have less pain receptors per square inch compared to smaller or skinny people?",
        "response": "[Here's](_URL_0_) an answer to a question about touch receptors that I think applies here as well: > The skin, like all organs, is continuously remodeling itself. As skin is stretched due to obesity, growth, edema, or muscle hypertrophy, there is a initially loss of concentration of sensory receptors on the surface. However, as the skin continues to remodel over time, nerve cells will put out more axons and generate more microscopic end organs to conform to the sensory profile of that particular region",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how can bots read images ?",
        "response": "They can apply filters to try to identify edges in the picture, and that lets them pick out individual objects (with varying success). Then once they think they have the edges and color (and context) identified, they can compare it to a database of known objects. The programmer can tweak the filter and database to look for specific attributes. \"Looks like this photo has an oval shaped skin-colored shape under a shaggy brown shape. My database of known objects says this is likely to be a face.\" or \"This is a solid black fish hook shape on a white background. That's most likely an upper-case J.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are all generations told that they're worse than the previous? Or is it just today's young people?",
        "response": "Back in the ancient Greece, we have records of philosophers and poets decrying the rise of writing, saying that it would make children into idiots who have no knowledge, who just read anything they need to know instead of memorizing it like their parents. They also talked about how the youth were lazy and disrespectful. Some people interpret all change as loss. It's an emotional response to change.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From the perspective of the Second Law of Thermodynamics, is global warming inevitable?",
        "response": "One of the items typically missed with regards to the Second Law of Thermodynamics is that it refers specifically to a closed system. The earth is notably not a closed system, we receive most of our energy from an external source, being the sun.  Also the problem of global warming is not necessarily one of waste heat being generated on earth, so much as waste products, which alter our atmosphere's composition in such a way that it absorbs and retains more infrared emissions from the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can capillary action be used to generate electricity?",
        "response": "Nope, because then you'd have a perpetual motion machine. Water naturally wants to climb into capillaries due to attractive forces, and to then remove that water you need to work to counter it. Remember, you can't get something from nothing, and all energy is in balance. It's like asking: could I make a system that automatically lifts metal and deposits iron weights using a permanent magnet? The answer is no, because while the magnet would lift the iron weights, you'd need to go to the effort of removing them from the magnet and in the end you'd have no net gain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big is the atomic gap between my fingers when I rub them together, and could you put that in terms I could understand? A hair to a whale, or maybe the planet or larger?",
        "response": "The gap is on the order of an angstrom, which is 10^-10 meters. To put that into perspective, if an angstrom were the length of a meter stick, a meter on that scale would be about 14 times the radius of the sun, so about 10,000,000,000 meters.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Spacetime dimensions",
        "response": "> What is the purpose of the rest of them? Primarily to make the mathematics work, from what I understand. They haven't been observed, and may well not *be* observable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how come YouTube hasn't found a way to prevent adblock plus from blocking YouTube ads?",
        "response": "Adblock Plus works at a browser level on the client PC. It executes its blocking code after all the content from the server has been delivered. There's nothing a site can usually do about it in terms of forcing an ad to go through.  What they *can* do is detect whether or not the ad is being blocked, then change the screen saying so. If they wanted to be shitty, they could do something like \"if ad is blocked, don't allow video to be played.\" But that takes additional time to develop, test, roll out, etc, and it would only piss people off, resulting in possible negative PR. On top of that, the number of users who use adblock plus vs. those who don't is likely very small, so it's not worth the time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In a car, what is the difference between a turbocharger and supercharger?",
        "response": "Ooh, good time for me to post instead of lurk. A turbo is driven by the exhaust gases. A supercharger is driven by a belt off the motor. Seems like a small difference but makes them behave very differently in practice, even though they're both basically just air compressors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get a tax refund if the country is in debt?",
        "response": "Even if the country is in debt, you're not obligated to pay more than you owe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did the concept of basic training come about in the military? Like the whole sergeant screaming in your face thing.",
        "response": "The 'sergeant screaming in your face' type of basic training largely emerged after the Second World War. S.L.A. Marshall's research during and after the Second World War found that 75 to 80 percent of riflemen *did not* fire their weapons at an exposed enemy. \"When [he] was sent to the Korean War to make the same kind of investigation [...] he found that (as a result of new training techniques initiated in response to his earlier findings) 55 percent of infantrymen were firing their weapons - and in some perimeter-defense crises, almost everyone was. These training techniques were further perfected, and in Vietnam the firing rate appears to have been around 90 to 95 percent.\" A lot of these new training techniques involved the desensitization and conditioning that come with variations on the 'screaming in your face' style of training. If you are interested in this kind of thing, I would highly recommend Lt. Col Dave Grossman's *On Killing: The Psychological Cost of Learning to Kill in War and Society*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the moon slowing down?",
        "response": "You have a good instinct for the energy interaction between the Earth and Moon. But it turns out the interaction is just a little bit different than what you guessed: [There is a little bit of friction between the tides and the turning Earth, causing the rotation to slow down just a little.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Bohemian Rhapsody, why do they sing \"Is this THE real life\"? Why not \"Is this real life\"?",
        "response": "It holds the rhythm to add the word. Poetry that sticks to a set meter of 5 syllables per line also does this in a similar fashion. If you take out the word \"the\", the song won't sound quite right.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are you able to drink water (H2O) but you can't drink hydrogen peroxide? (H2O2)",
        "response": "Hydrogen peroxide is a reactive chemical, while water is not*. Hydrogen peroxide will burn your innards as it goes down. Its mechanism of action is oxidation, which is basically burning something without the light and flame.   And when it isn't burning something, it is releasing oxygen molecules. Surprisingly, free oxygen in your body is pretty toxic. The oxygen carried in your blood by hemoglobin is carefully managed at the cell level so that it is quickly captured and moved into the metabolic reactions needed to sustain life.  * Water's reactivity isn't zero, but living things can handle whatever it wants to do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are medicine names chosen?",
        "response": "Lots are just names chosen by marketing to simplify the names of the compounds built by pharmacologists and chemical engineers. *Tylenol* is the brand name for N-ace*tyl*-para-aminoph*enol*. *Asprin* is acetylsalicylic acid. This is similar to lots of industries where people don't often care about who made it or where it came from, they just want to buy something that does what they want. To try and get people interested, they come up with cool-sounding names. Pharmaceuticals have this in common with material sciences, like steel-making and polymer (plastics) industries, with names like *Inconel, Duralumin, Mylar, Nylon, Rayon* and *Kevlar*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are trace quantities of antimatter found in the high energy environments of black holes?",
        "response": "Pair production can create antimatter in high-energy environments. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why hasn't there been a revolt in North Korea?",
        "response": "You're looking at North Korea from the perspective of someone who has an internet connection, knowledge of what living in a free society looks like, and no fear that the Dear Leader is reading your mind and has divine powers. For many people who escape North Korea, deprogramming them to stop fearing retribution can be a matter of months or years. A population so intensely monitored and controlled can't feasibly revolt, let alone communicate their ideas about doing so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it illegal to pump your own gas in New Jersey?",
        "response": "might have started out as a safety thing, but at this point, its just about the jobs. protected jobs for unskilled workers. They dont want the unemployment to go up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Considering all the different elements of sound, how is audio translated into binary so that a computer can understand what it's processing?",
        "response": "As complex as sound.. uh.. *sounds*, really your ear drum is interpreting all those various sounds into one wave form. That is because you have one ear drum in each year, and it has only so many dimensions. It's really a matter of how much pressure, and how fast, the ear drum is vibrating.  When we first started studying sound, we literally just looked at how our ear drums vibrated, and replicated that with analogue technology. It's just a wave, up and down.  So with computers, the binary is just representing that *single* wave. There are a LOT of ways of describing this in binary, depending on how much *fidelity* you want to the actual wave form. Basically, the binary representation will describe in a certain time interval where the wave goes. It goes up, it goes down, it stays flat. So basically / - \\  That's just three little symbols that can represent all of sound.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why can girls orgasm more than once and guys can only do it one time in a sitting?",
        "response": "Contrary to popular opinion, orgasm and ejaculation are not the same event. Men *can* orgasm as much as women, however, they cannot ejaculate more than every so often, since the system needs time to recover.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is learning another language simply additive to your mother tongue, or is the second language \"separate\" in your brain?",
        "response": "Add on question: I've come to understand that we can formulate different personalities when we speak different languages, what parts of the brain are responsible for this and have there been any studies (for example, looking at different parts of the brain via an MRI while the person jumps around through different conversations in different languages)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you feel an earthquake while swimming in the ocean.",
        "response": "I lived on an anchor out boat when we had that big one is Seattle. The whole boat shook like crazy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take weeks (or months) to receive results from multiple choice exams when everything is corrected and generated by machines?",
        "response": "I would imagine they have tens of thousands of sheets to mark. Then keying in marks, typing out certificates, etc for some exams. I've been waiting on my UNSW ICAS results for MONTHS.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Americans refer to the Republican Party as the Grand Old Party, when the Democratic Party is 16 years older?",
        "response": "According to Wikipedia:  > The term \"Grand Old Party\" is a traditional nickname for the Republican Party, and the abbreviation \"GOP\" is a commonly used designation. The term originated in 1875 in the *Congressional Record*, referring to the party associated with the successful military defense of the Union as \"this gallant old party\"; the following year in an article in the *Cincinnati Commercial*, the term was modified to \"grand old party\". The first use of the abbreviation is dated 1884. By the way, the Democratic Party is actually 26 years older, not 16 years older.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we told for example it is -2 degrees Celsius but feels like -10 degrees Celsius?",
        "response": "This has been asked before, but it helps to know the right buzzwords for search, \"wind chill\": _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Europeans displace natives in some colonies like the US and Canada, but not others like India and Africa?",
        "response": "Well, the Americas were radically depopulated through the spread of disease. Also, the colonization of the 18th and 19th centuries in India and Africa were more about expanding national/commercial power than groups of people making their way across an ocean to settle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Kennedy Assassination \"Magic Bullet\" theory",
        "response": "People believe that for Oswald to have shot both President Kennedy and Texas Governor John Connally with the same bullet it would require some outside force like magic. They look to the fact that Kennedy was sitting directly behind Connally. They say that at the angle Oswald shot at it would be impossible for the bullet to directly hit both.  The issue with this idea is that is doesn't take into account that Connally's seat in the car that day was offset by a few inches from Kennedy and they were not \"back to back\" as they would be in a traditional car. When this is taken into account the shot becomes quite possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do microscopes often use B & W CCDs?",
        "response": "A color CCD is just a B & W CCD with a filter grid in front of it. So using a color CCD has the disadvantages that: * You lose efficiency because the color filter will always block photons * You lose resolution because now you have to split your pixels among at least three colors * You filter out parts of the spectrum you might potentially be interested in Everything a color CCD can do can be replicated by taking multiple images with different filters. While fixing these filters directly onto the individual CCD pixels is great for digital consumer cameras, you lose a lot of flexibility.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the largest mammal on earth live in the ocean?",
        "response": "Creatures in water, like whales, are effectively neutrally buoyant. This means that when they're stationary they don't really have to support their own weight - they can just float there in the water. Contrast this to say, an elephant. A standing elephant must support its large weight with its legs, which puts considerable strain on them, and a realistic upper feasible limit on total size. Even laying down, it has to have structure to prevent it from collapsing (its rib cage must prevent the large amount of weight from crushing it self, for example). There's a famous essay on this scaling, though I forget the exact name. Google \"scaling: why animal size is so important\". Because they're neutrally buoyant, ocean mammals don't suffer from this same constraint.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If gravity is caused by massive objects warping spacetime, then when I hold my pen above the ground, is the force I'm applying with my hand un-warping the pen's spacetime, and that's why it doesn't move?",
        "response": "An object with no forces on it follows a straight line through spacetime; this is the cause of gravitational attraction, as you point out. But once another, non-gravitational force acts on the object, it follows a *curved* path through curved spacetime (just like in Newtonian mechanics, an external force causes an acceleration); in your example of holding a pen, the force is just enough to curve the pen's trajectory through spacetime so that it stays at rest relative to the Earth. By the way, the curving of space*time* is crucial for understanding gravitational forces; curving space alone doesn't cut it. (It can't explain the attraction of objects at rest, for example.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do tennis balls come in pressurised containers?",
        "response": "The air pressure inside the rubber balls tends to leak out over time, unless surrounded by equally pressurized air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't a rain-cloud just fall out of the sky as one big drop?",
        "response": "For the same reason that the condensation on a glass of cold water won't run down in one huge drop. Think of clouds more like leaky sponges and less like sky pools.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Sumerian an Archaic Tamil?",
        "response": "Sorry, are you asking if Sumerian is part of the Tamil language group? I'm not sure I understand, but if that's what you mean then the answer is a simple \"No, of course not\".  Sumerian has nothing in common with Dravidian or Proto-Dravidian, predates Tamil by several millennia, and arose in a pretty distant part of the world. It's universally considered a language isolate, with no real arguments possible for any other categorization.  Maybe if you clarified why you're asking, I could give a more thorough explanation? There is some support for the idea that *Elamite* was a Dravidian language, but Sumerian definitely wasn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the UK make more of an effort to hold onto Northern Ireland, when arguably, made less efforts to keep other land holdings?",
        "response": "A large proportion of Northern Irish people can trace their roots to the plantation of Ireland by British settlers. This population (Unionists) were very active in opposing home rule in Ireland and were effective at keeping the 6 counties of Northern Ireland part of the United Kingdom. These 6 counties were strategically selected as it was thought that the 'native' Irish population (Nationalists) would never be a large enough percentage to vote for a United Ireland. Interestingly, many Unionists speak about Ulster instead of Northern Ireland, which actually consists of 9 counties and Nationalists are the majority overall.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are green olives stuffed with and why do they do it?",
        "response": "They're traditionally stuffed with pimiento, a sweet red pepper. I've seen them stuffed with all kinds of things, though - jalpeno, bleu cheese, almonds, garlic....",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do wireless chargers not destroy phones?",
        "response": "the level of eddy current created is directly proportional to the length of the conductor. On the phone circuit board, the individual conductor traces are extremely short, usually just a few mm long if that. The coil used for inductive charging, on the other hand, is much much longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how come balloons pop loud when their full of air, but not when their full of water?",
        "response": "How do we make sound? By moving air molecules. Fill a balloon with air molecules which are bursting to escape, and you'll hear a nice boom as they go wizzing past.  Fill it with water, and all you get is water falling to the ground.  For a little more information, the water will actively be trying to go down, whereas the air will actively be trying to go in every other direction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does scraping scissors blades against ribbon cause it to curl?",
        "response": "If sufficient force is applied to the material to stretch the polymers beyond their elastic limit, they will be permanently deformed. When the change is not uniform throughout the material it will cause it to curl as one 'side' of the ribbon is now 'longer' than the other. Materials that don't break down, i.e. satin ribbons, will not curl effectively as they're made of individual threads. An interesting demonstration of a similar concept can be done by heating bimetallic strips. One side of the strip expands at a different rate than the other, causing it to curl. This property has practical applications in timekeeping, thermostats, thermometers, heat engines, and electronics. Sources: _URL_1_ _URL_0_ Edit: Big credit to /u/atmwarrior for explaining it as a curve which is much simpler and intuitive.. \"Simplicity is the ultimate sophistication.\" - Leonardo da fucking Vinci",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does coffee have oil rings on surface?",
        "response": "Coffee beans have a natural oil in them. Often beans that have been roasted longer will have more visible oil on the surface. Not really an indicator of quality, though, but a longer roast will be darker, have a stronger flavor, and (paradoxically to some) less caffeine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Our bodies can adapt to external temperature changes on the fly, but why does an internal temperature change of a few degrees (fever) have such a huge effect on us?",
        "response": "The hypothalamus controls your core body temperature. The skin controls your external body temperature. Those are related but separate mechanisms.  Fever is a symptom your body is fighting an infection and are caused by chemicals called pyrogens flowing in the bloodstream. Pyrogens make their way to the hypothalamus in the brain. When pyrogens bind to certain receptors in the hypothalamus, body temperature rises. Many illness-causing microbes are best adapted to thrive at the body's normal temperature. A fever raises the temperature beyond which certain microbes need to reproduce. The higher temperature also kicks the immune system into high gear, spurring the rapid production of white blood cells to fight the infection.  The reason that you feel bad when you have an infection is not directly related to higher body temperature. It's a self preservation mechanism to get you to rest and spend as little energy with other activities. The higher temperature is not the cause, it's a symptom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why scientists haven't been able to produce a drug that makes fat people skinny",
        "response": "They have. There have been all kinds of weight loss medications made. Remember Fen Phen? There was a big problem because the medicine caused cardiac issues. From what I remember though, it was really only dangerous to people who were taking it incorrectly such as taking more than prescribed to have it work faster or taking it when it wasn't prescribed by a doctor. There are tons of medical procedures and drugs for weight loss, though, so I'm not really sure what you're looking for. Are you just asking why there is no miracle pill where you can take one pill a day, eat whatever you want and still be in great shape?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If honey doesn't spoil, how can it ferment (to make mead and honeyed wines and such)?",
        "response": "Honey doesnt normally spoil because its dry. It has almost no water in it at all, and if any bacteria attach to it, due to osmosis it sucks the water out of it and kills it off. Its also incredibly acidic which kills off lots of bacteria. If humans add lots of water to it, suddenly the bacteria can feed off of its sugars and then ferment. We can also add things to reduce its acidity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do ants know to bite?",
        "response": "They have tiny little hairs/feelers that can tell them a bit about what they are on. As far as biting your shoe and leg when you \"attack them\" ie. Accidentally step on them an individual ant will release chemicals that indicate the colony is threatened. The more ants you disturb the more signals are released and stronger chemical signals gets a stronger defensive response from surrounding ants. It is likely they are attacking anything that is perceived as the threat including your shoe. But the individual ant can also detect organic matter with his feelers and might defer to chomping into juicy organics rather than your shoe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do networks have a mid-season break?",
        "response": "In addition to the other reasons listed, The Walking Dead often beats Sunday night football, no small feat in October and November. No coincidence that it airs on Sunday night and goes on haitus in December when the playoff race heats up until after the Superbowl in February. It can't sustain its Sunday night ratings competing with the NFL in those months. With television consumption changing I don't see this as a big deal. As a weekly watcher of the show and an NFL fan, I'm glad they go on haitus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the 'genocide' against the Air Nomads REALLY happen?",
        "response": "Just as a preemptive warning, apologist arguments for the Sozin regime and genocide denialism will not be tolerated at /r/AskHistorians, per [our rules](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After watching Master and Commander, it's interesting to see many young boys serving on a ship in the 1800s. Was this really the case?",
        "response": "Yes, absolutely. [I have written about this before](_URL_0_) — feel free to ask follow up questions here.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does ancient China seem so much cleaner than medieval Europe?",
        "response": "Isn't a better question why medieval Europe seems so dirty? Depictions of Ancient Rome / the Middle East also seem much cleaner compared to it. Does it have something to do with public bathhouses?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Japanese justification or rationale for military aggression in Asia prior to WWII",
        "response": "I graduated with a minor in history focusing on modern warfare, so there will be others better informed. As I understand it, Japanese leaders felt they had come late to the colonial party. WW1 didn't end colonialism, it merely meant the winners took over the colonies of the losers. It wasn't until the end of WW2 that global colonialism (at least, the non-cold-war kind) receded.  Japan planners consciously modeled themselves after these colonial powers. They felt they were simply competing with European and American powers.  As to how Japan treated its colonies relative to the European powers, that I don't know. As you say OP, there were horrific cruelties. But many European powers committed atrocious acts as well.  Not saying this justified it, but that's my understanding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the phrase \"When was the last time you saw a white horse\" cure hiccups?",
        "response": "It's just a distraction, it gives your brain a chance to focus on something else and relax.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do critics exist?",
        "response": "I want to listen to critics. Atleast most of the time. Usually critics are very experienced and have a very high amount of knowledge, so their opinion about something might be rather valuable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do pets understand the concept of babies and the young?",
        "response": "Absolutely. Being a single guy with no kids my Heeler took on the role of ensuring my young (2, 4 & 5) cousins were safe in the pool. He'd constantly make circles and even jump in the pool to grab one of them and drag them to the steps if he thought they were in trouble. It was interesting to witness as he had never been around children before but instinctively knew they were family.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did we prove speed of light is constant then it was incorporated in theories or did theories predict speed of light would be constant than it was proved by experiments?",
        "response": "Is there a more precise way to say the constant speed of light? I'm asking because we do actually know that light may travel slower in a different medium.  Is it perhaps the maximum speed of light which also happens to be the most commonly observed speed?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if you took a basketball 10,000 feet under the ocean and released it?",
        "response": "At 10,000 feet underwater, the basketball (normally inflated to around 8 psi) would be subjected to about 4,400 psi of pressure due to the water depth. Chances of the basketball surviving this experience are not good.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Stephen Hawking's speech device work?",
        "response": "_URL_0_ He uses a sensor that he can control with a muscle in his cheek to type on a computer. The cursor scrolls across the screen over the letters and he stops it when it gets to the right one, plus there is predictive text. Then a text to speech program plays it aloud.  I have a friend who uses a Dynavox for the same purpose by clicking a button on her wheelchair's headrest with her head. It can take a while to have a conversation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do goats eyes have rectangular pupils?",
        "response": "Not only goat goats, octopuses and toads ,the reason these animals have rectangular pupils is because this is what helps them avoid predators. Rectangular pupils tend to get very narrow during day time, which gives animals a greater accuracy of depth perception in their peripheral vision. Traditionally seen as prey, thanks to their eyes these animals are able to avoid predators",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the cultural differences between China, Hong Kong, and Taiwan?",
        "response": "This is a huge question. The \"major\" difference is that Hong Kong and Taiwan are more traditionally Chinese (pre-Cultural Revolution), but with a tiny bit of Japanese influence from WWII occupation. (Hong Kongers and Taiwanese are, at least, less likely to viscerally hate Japanese.) In fact, Hong Kong and Taiwan have more in common with some overseas (i.e. American) Chinese communities than with the Mainland Chinese. Naturally, Hong Kong has a lot of British influence (people queue up), while Taiwan has some Native Taiwanese (essentially Polynesian) influence. Also, check out Macau -- the former colony of Portugal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How accurate are modern day precipitation predictions?",
        "response": "So first of all, you need to understand what it means when a meteorologist says there is a 30% chance of rain. (Hint: It isn't quite as simple as you having a 30% chance of rain and a 70% chance of no rain). _URL_0_ When we understand that, how accurate is the forecast? pretty dam accurate. A quick google search finds quite a bit of data, but here is a decent article that takes data from Nate Silver's book: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Fifth Amendment?",
        "response": "It is fundamentally a protection against coercion and torture. They cannot force or trick you into testifying against yourself, or into giving a confession to a crime. They instead have to prove that you are guilty with the evidence of the case.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were metals like steel first discovered?",
        "response": "When bronze was originally used, it was found as a natural alloy of copper and arsenic, as opposed to the more commonly known copper-tin bronze. So, the earliest bronze was actually found as a natural alloy, which turned out to be extremely useful. However, given the toxicity of arsenic involved in the process of smelting arsenic bronze, people at the time began to experiment with new, better forms of bronze, culminating in the development of copper-tin bronze. This may or may not have been helped along somewhat by a *very* limited number of sites where copper-tin bronze formed naturally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Chinese finger traps work?",
        "response": "The finger trap is braided in such a way that it becomes longer and narrower when pulled on. When you put your fingers in and try to pull them out, your fingers pull on the inside of the trap and tighten it. Conversely, pushing in on the trap makes it shorter and thicker, so your fingers are released.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are German Shepards the most used police (military) dogs compared to other breeds?",
        "response": "They have a good combination of traits. They are smart enough to be trained, to attack and to heel. They are able to be trained to sniff. They are strong, and fast. And they have a history of being used, which gives them an intimidation factor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some animals kill their offspring (even eat) and some aggressively protect them?",
        "response": "I've never heard of a healthy animal killing their young. I've heard of grown male bears killing the young of other males to force the mother into heat. But no healthy animals killing their own young. Edit- I sometimes forget that 90% of the animals I have ever interacted with and/or observed are mammals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to the germs and bacteria covering our hand skin when it's hard pressed against something or when we hit anything hard enough?",
        "response": "Some might die. Some won't. Some will stick to whatever you hit. Some won't.  Your hand is not flat, it has millions of tiny crevices for tiny organisms to hide or get squished into. The scale that we're talking about is so small that two objects that we might perceive to be \"flush\" with each other still have quite a bit of room between. Take for example, a microscope slide and it's glass cover.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible that there might exist more than 1 type of \"dark matter\"?",
        "response": "The possibility that there are \"dark atoms\" is one that has been explored by Kaplan et al. in [this paper (PDF)](_URL_1_). You can read some non-technical posts about this paper [here](_URL_0_) and [here](_URL_2_). Note that these \"dark atoms\" would not be bound by the ordinary electromagnetic force, but a \"dark electromagnetic-like force\" associated with a \"dark charge\" etc. That is, the mathematical structure would be similar to what we see with ordinary atoms, but it wouldn't have to be one-for-one match.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does nature ensure that humans are born at a (roughly) 50/50 balance between male and female?",
        "response": "This is due to the fact that it takes two parents, one male and one female, and explained by Fisher's Sex Ratio Theory, also called Fisher's Principle. Consider 3 generations. 1st generation has individuals which make more females than males. So the 2nd generation has lots of females, and few males. The second generation males have a lot of females to breed with. Which 1st generation genes are passed along the most to the 3rd generation? The ones from 1st generation parents who made more males. Eventually the genes for making more males will swing back to 50/50.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do females on average, live longer than men?",
        "response": "There's a few reasons. First men tend to do more risky jobs then women. I can't quote a source right now but I recall something like 98% of all workplace deaths being men.  Secondly there seems to be an evolutionary aspect. It's related to the first reason. Men hunted and did dangerous things which got them killed. Women stayed 'at home' and raised the next generation. Their own children and grandchildren. And having those extra hands around to help raise these kids turned out to be advantageous. So the offspring of women that lived longer where more likely to grow up and make baby humans of their own allowing the trait to be passed on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Other than giving his boss the finger, and threatening to start his own business, what did Satan do that Im supposed to hate him for?",
        "response": "You should read Anne Rice ' s Memnoch the devil. AND Milton ' s Paradise Lost. \"It's better to rule in Hell than serve in Heaven.\" Or something like that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does this visual effect happen with the propeller blades of this plane?",
        "response": "The digital camera reads the pixel image line by line (like a television does) off the CCD and into memory. Since the blade is spinning its image is captured further along its arc at lower scan lines. This would not happen with an actual film camera. In a film camera with similar exposure the image would be blurry. PS This wiki article goes into a lot more detail if you are curious. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is soil and dirt comprised of?",
        "response": "Basically it's a mixture of air pockets, water, sand, clay, rocks and organic material. As has been said it depends on where you live. Crucially the organic part often consists of mycelium, which allows plants to better regulate uptake of nutrients, as well as decomposers which make nutrients reavailable for living things.  This is much different than say potting soil for container gardening, where one usually has a mix of sphagnum or peat moss, added compost or manure, and perlite or vermiculite for water absorption. Plus added inorganic fertilizer to add N/P/K and trace minerals which normal soil has in its clay or other inorganic components.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- What allows humans to live so long compared to most other animals?",
        "response": "It's complicated, and we don't really have a definitive answer yet. But the best answer right now has to do with how DNA repairs itself. All animal cells are constantly being copied and replaced with new ones, but when you make a copy of a copy of a copy, the DNA starts to break down. How many times an animal's cells can copy themselves without making defective ones (or, if defective cells are made, the body's ability to fix/destroy them) will tell you how fast the animal ages. That's what aging is, really. The body's healing process being imperfect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At the atomic/molecular level, why does the body require oxygen?",
        "response": "Oxygen acts as the final electron acceptor in the [electron transport chain](_URL_1_), which is the main mechanism by which we extract energy from molecular sources (e.g., sugars). The oxygen is reduced into water, which then either participates in other reactions in the body, evaporates, or is eliminated from the body. In order to fulfill this role, the compound must have high enough [electronegativity](_URL_0_), and must be _just_ reactive enough for the body to use in chemical reactions, but not too reactive that it gets involved in unwanted side reactions. Both molecular nitrogen and helium are very stable, so they are not ideal candidates for this. That said, oxygen is still reactive enough to cause some trouble in the cell - see [reactive oxygen species](_URL_2_). Cells do spend some effort in combating these ROS and when these efforts are impeded, you can see adverse effects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have standardized eating times (breakfast lunch dinner)? Where did it come from and how did it start?",
        "response": "Back in the day every single meal had to be prepared from scratch. Too feed large families or communities more effectively there was division of labour: a few people cook, others do different work and show up at given times to eat together. A proper schedule is essential when many people have to physically live and work together in the same space and time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- are all planets in our solar system orbiting on the same plane (more or less)? Why?",
        "response": "It's not exactly the same plane but it is quite flat. Most orbits in our solar system are within 2.5 degrees of the Earth's; Mercury's is the furthest off at about 7 degrees. As for why, I recommend [this video](_URL_0_) because it's a hard thing to explain without a visual aid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is my thinking on this thought experiment right? (dry ice in a balloon)",
        "response": "Actually, it would decrease. The mass does not change, but the it will have bigger volume and the Archimedes' principle applies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does beer taste terrible when it's warm, and why does coffee taste terrible when it's cold?",
        "response": "A lot of beer tastes better cold because it's more difficult to actually taste it when it's cold -- and it tastes gross all around. I'm talking about American macrobrews like Bud Light and MGD. Craft beers tend to have a much more pleasant flavor and stand up a lot better to consumption at warmer temperature. European beer is traditionally supposed to be consumed at \"cellar temperature,\" which is about 55 degrees Fahrenheit, quite warm by American standards.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a \"feels like\" temperature? Shouldn't that just be the temperature?",
        "response": "> shouldn't the temperature that it \"feels like\" just be the actual temperature? Thermometers measure the actual temperature and that's just it, the objective temperature measurement, not affected by anything else.  Humans try to keep body temperature constant, so that's where \"feels like\" comes from - it's harder to keep warm in a cold wind and it's harder to cool off by sweating in hot and humid weather.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In World War II, which country suffered the most civilian deaths?",
        "response": "The Soviet Union had c. 10 million civilians killed as a result of crimes against humanity; China, c. 7-8 million, and Poland, c. 5 million.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why dont long haul flights offer a service to put you to sleep in a pod so you dont have to experience the boredom of the journey?",
        "response": "Have you ever had an operation? Putting someone under is a lot more serious than you might think. In an operation theatre for instance there's a trained anaesthetist who's job is just to keep you under without killing you. It's horrendous to wake up after even a fairly short surgery, and doctors will try and avoid putting people under completely for safety. Performing a risky and complex procedure to 300+ passengers every flight would be a nightmare.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the TV series The Flash, when Barry is running so fast and time slows down for him, how is he still able to talk to Caitlin and Cisco?",
        "response": "Producers of superhero TV shows and movies often have to play fast and loose with the laws of physics, in order for the show logic to \"work.\" The general idea of such a show is escapism anyway, so accurate portrayals of physics aren't that essential anyway. If you still want to nitpick about the physics challenges of dealing with super speed, though, here are a few other things to consider: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are dogs no longer found in the wilderness?",
        "response": "There are dogs in the wilderness; they're known as coyotes, dingoes, wolves and foxes. Modern domestic dog breeds are all descendants of these species that have been bred to have certain traits and split off into subspecies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does a Movie's CGI cost mean ?",
        "response": "It's not just a single artist for any movie that includes CGI - it's dozens of them, even hundreds for a big-budget movie with lots of CG effects. Entire companies full of digital artists are contracted out to work on these movies, because it takes an incredible amount of work to make good-looking CG.  So those millions of dollars are being spent on paying entire companies or large chunks of companies to work for several months on a project. Not to mention the overhead costs associated with contracting out a whole company with expensive and powerful computers. Just like when you hire a construction company, you’re not just paying for labor, you’re paying for their equipment, for their overhead, for their HR department, etc. It’s an expensive service.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do I download youtube videos for storage, later playing and to burn on dvds?",
        "response": "_URL_0_ Remember, there's a reason \"Download\" isn't an existing feature on youtube's site: It's a copyright violation unless you own the rights to distribute/copy the material. Know that unless the video was released freely, you're probably breaking the owners copyright by downloading a video.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is comcast able to change me to a new data usage plan without me signing anything?",
        "response": "If you don't have a contract with them, they can pretty much do as they please. Call and tell them you want to cancel your service. They will transfer you to the retention department. The retention department is likely to offer to keep you at the same rate, usually for 6-12 months. Then, you call back and do it again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a blank CD only hold 80 min of music when it can hold 700mb of files?",
        "response": "When you burn an audio cd that can be played in a normal CD player, the audio files are not compressed. 80 min of uncompressed music is 700MB.  MP3's are compressed files. They remove some data to make the file sizes smaller. But to play MP3's your CD player needs to know how to decode MP3 data. That why not all CD players can play MP3 files. Technically, there is some quality lost when using MP3 compression, but in the vast majority of cases it won't be noticeable. This makes it a pretty good trade off between quality and file size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was the switch made between democrats and republicans?",
        "response": "This is a commonly asked question u/Samuel_Gompers wrote some good answers here _URL_1_  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are those squiggly heat waves that sometimes radiate off hot stuff?",
        "response": "That's because the item under the squiggly lines is hot. Air (and most materials and fluids) expand when heated. So the air touching the grill gets very hot and rises (because it's less dense, which is why hot air balloons work), mixing with the less-hot air above (this mixing is what causes the lines to be squiggly). But if that's all that is happening, the squiggly lines would be invisible. But light [refracts](_URL_0_) when crossing between two volumes with different densities, so the light bends a little as it passes through the heated air. This causes the squiggly lines to appear, like the picture of the water glass in the link for refraction.  This phenomenon is also what's responsible for mirages of water in the desert, where light from the blue sky looks to be coming from the ground, looking a lot like water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there an imbalance of matter / anti-matter in the universe?",
        "response": "Nobody knows! It's one of the most exciting outstanding questions in elementary particle physics that the Standard Model can't answer. All we know is that several conditions, known as the Sakarov conditions, had to be satisfied in the early universe. These are violations of certain symmetries that would keep the numbers of matter and antimatter particles the same, and a departure from thermal equilibrium, where the numbers would again be equal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is there 60 minutes in an hour?",
        "response": "The current time tracking system was invented by the Babylonians, who used a base-60 counting system (sexagesimal). They used this number because it can be evenly divided by 2, 3, 4, 5, and 6, allowing for a convenient way to break up time in smaller amounts. As for changing it, that would cause HUGE inconveniences. Pretty much all of society is currently based on the 60-minute hour. Also, for general use, 60 is more convenient than 100 because it divides up more evenly by more numbers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does insects survive harsh weather like rain and heatwaves?",
        "response": "Like Taylor swift, they just \"shake it off\". It's actually true for some insects! For example bees, if they get wet, they start to move their wings very rapidly to exert heat and warm up again. In the cold they would do the same in a hive to maintain temperatures. During a heatwave they will do something similar and thereby ventilate their hives. I imagine it's similar for other insects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do dogs hump human beings even though they know they are not dogs? Why do other mammals not hump the way dogs hump?",
        "response": "Humping is a show of dominance in the dog world. Don't let your dog hump you, you hump him. It'll learn really quickly who is in charge.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Love and why do people feel different when they are in love?",
        "response": "WHAT IS LOVE? BABY DON'T HURT ME DON'T HURT ME NO MO'",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I just did something amazing. Can someone help me settle my disagreement with my wife iver just how amazing it was?",
        "response": "You're not accounting for reordering. For a given string of six colors, there is a 1/46656 chance that you'll pull them *in that order*. But if you're just seeing if you match the colors that you say, you need to make each reordering of the same six to count as one. To do this, you need to compute 6!/6^(6). This is 5/324, which is about 1.5%. Your wife got lucky, but not *that* lucky.  Also, [M & M colors are not uniformly distributed](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do ISPs work? Where do they get their internet?",
        "response": "Think of it this way. The internet is like a postal network. The ISPs are the postal service. They coordinate all of the packages and make sure that they arrive at the right place, on time. The ISPs can also expand the road network to reach more customers. They can also widen existing roads so that more traffic can be handled. All of the different ISPs around the world work together just like most postal services around the world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if I shut my car off while driving?",
        "response": "The power steering will be disabled, I almost crashed once when my car died on me in a curve!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would creating a matrix disprove the theory that we could be living in one?",
        "response": "If anything it would add more credibility to the theory, as it proves that a lifelike universe is possible. And no, the new matrix citizens can create a simulation of their own matrix. Surely it won't be an exact simulation of their own universe, but neither can ours be (as that would require the computer simulating itself).  Computationally, it's no harder to simulate the atomic movement of a bunch of rocks than to simulate the movements of a computer. At the atomic scale, the distinction kind-off disappears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has it been shown that there is no correlation between violent behavior and video games/movies?",
        "response": "In fact, there is a correlation between violent behavior and video games, but it's the opposite of what's being projected. Since about 1990, violent crime of all sorts has been steadily decreasing in the United States. No one has really been able to attribute this decrease to any specific cause, although many have tried. During the same period, video game sales have been rising steadily. It's possible that these two trends are completely unrelated, but it seems exceedingly likely based on this trend that if video games have an effect on violent behavior, it is either in the other direction, or it is not significant on a societal scale. It's plausible that, since video games give young adult males something else to do with their time and a different way to channel aggressive behavior, that they really do help reduce crime, but this is just speculation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This quote: Judges hold office 'during good behaviour' rather than 'during the monarchs pleasure'",
        "response": "\"During the monarch's pleasure\" means that the monarch may remove them at will--not just without consulting anyone else, but without needing to have any reason. One effect of this is that the judge is mindful of staying in the monarch's good grace, because he knows that making decisions the monarch doesn't like can get him fired. \"During good behavior\" means that the judge cannot be removed except for bad behavior, like failing to do his job or being convicted of a crime. The judge could challenge a dismissal that doesn't meet this requirement. This makes him independent--he is free to decide what he thinks the law *is*, not what he thinks his superiors want it to be. In both cases, the judge can still retire or resign voluntarily.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the role of the colonies in the British mercantilist system?",
        "response": "The colonies would produce raw goods and British merchants would turn into into a product. They would then in turn sell it back to the colonies. In a mercantile system the role of the colonies to to supply to the motherland. At least that is what I remember from my AP class.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Alka-Seltzer work? And could it be used to 'fix' a flat beer?",
        "response": "That sounds like an interesting hypothesis, why don't you test it and report the results.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't I get an infection when I shit so hard that I bleed? Serious question.",
        "response": "Your body has natural protection against bacteria called White Blood Cells, these help protect your body from harmful buildup of bacteria in the body. The veins and arteries in your rectum are small, not like the large ones in your gut or in your legs/arms. This means it is not an open freeway so much as a dirt road that the bacteria must travel through. This helps the White Blood Cells target and destroy that bacteria before it becomes too harmful. Lastly, recently expelled feces does not have as many harmful bacteria as feces that has been out in the open for long periods, this reduces the chance of infection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In cartoons like Ed, Edd 'n Eddy, why do on-screen elements just bounce around and pulsate even when they're supposed to be standing still?",
        "response": "It is just a style choice. It helps add to the manic nature of the show. It also may be a nod to classic Hanna-Barbera cartoons (who's classic toons Cartoon network's early line up was built around) which were often considered of lesser quality than Disney or Warner Brothers. HB did this due to a rising cost of animation and used a lot of what they call limited animation ( _URL_0_ ). Which is way cheaper. Dr. Kats and Courage the Cowardly Dog used similar \"shaking\" elements. I may be wrong in that they may have still been just going cheap on things or it may be a little bit of both style and saving money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do meteorologists get their numbers for next day temperatures?",
        "response": "They treat the atmosphere as individual packets of air both laterally and at different heights. Computers track the movement and interaction between them to build up predictions of the future movement, change in temperature, precipitation etc. The difficulty of doing this means some of the most advanced and powerful supercomputers are needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Writing my senior thesis on the Fourth Crusade and looking for suggestions.",
        "response": "Maybe your thesis was not like my thesis was, but shouldn't you be much further along by now? And potentially have 98% of your research complete? My thesis was 60 pages… and it definitely took more than 48 hours. My advice? The only suggestion you need right now is to get off reddit and write!!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the fertile life of human sperm so short?",
        "response": "Somewhat outside of my tag, but I have some college background and lots of reading on evolutionary subjects like this. To add to AlloLay's great answer, another reason why humans don't need to have the sperm longevity that other organisms have is that we have a LOT of sex. It's ridiculous how many intercourse sessions we have per pregnancy. Also, human females are fertile every month rather than every year and our social groups tend to favor kin-selection. Our genetic diversity is pretty low and traditionally a group of humans are related enough that sperm competitions isn't a priority. Even if a man helped to raise a child that wasn't really his, many of his genes would still be present in the kid because of the relatedness of a typical hunter-gatherer band of humans. (read up on classic selfish gene theory for more)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does gasoline appear blue when it is poured?",
        "response": "Its usually a dye put into the gas - just to identify it. Sometimes there are additives (I think mainly in diesel however) that are used for use in winter, etc... its harmless to the engine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If matter can neither be created nor destroyed, does this mean that every subatomic particle that comprises our bodies was around since the beginning of time? (Protons, neutrons, electrons, quarks, etc)",
        "response": "Where do you get the idea from that matter cannot be destroyed? This is not true. Total Energy is conserved, but that still allows me to change energy into particles and vice versa, creating new ones along the way. A few simple examples: Annihilation: An electron and a positron annihilate to produce two gamma rays. Beta decay: neutron - > proton + electron + antineutrino Binding: 2 H_2 + O_2 - > 2 H_2 O + binding energy released So no, your assumption is wrong. These processes happen all the time naturally, e.g. via cosmic radiation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is stainless steel really \"stainless\" or does it just \"stain less\" than regular steel?",
        "response": "Steel is iron mixed with carbon. When iron rusts, it interacts with oxygen in the air to form feric oxide (iron rust). Ferric oxide is unfavorable because a) it is discoloring compared to the base iron or steel, and b) it flakes off easily and weakens the steel as a result. Stainless steel is made when chromium is alloyed with the iron during the manufacturing process. Chromium can also undergo oxidation and rust (and actually does so preferentially compared to iron), however chromic oxide a) is not discoloring (has the same color as base chromium) and b) doesn't have poor structural integrity like ferric oxide does. This is what makes stainless steel \"stainless\" tl;dr Stainless steel alloys chromium with iron in its manufacturing process, chromium preferentially oxidizes compared to iron, chromic oxide has the same color as steel so it doesn't form stains.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is light outside the visible spectrum made out of photons? If so, how do they manage to penetrate walls unlike visible light?",
        "response": "All electromagnetic radiation is made out of photons. Photon is simply a quantum of EM field.  Absorption of photons depends on their energy, and energy structure of material they are passing through. For example, Earth's atmosphere absorbs gamma photons, while it allows visible light to pass through.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many times was the material that formed our solar system part of a supermassive star and subsequent supernova?",
        "response": "Its generally understood that our Sun is a third generation star, based on the elemental/isotopic ratios in it. Therefore, most of the material that makes up the sun (and everything orbiting it) would have passed through 2 previous stars. This isn't to say that there isn't some virgin hydrogen in there, but its likely that there isn't much, nor is there much material that has been more recycled. The universe is only old enough to have a couple of generations of stars at most, and the most massive stars which are shortest lived are rare, especially once heavier elements started to appear, so its safe to say that the Sun is approximately a third generation star.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we distort evolution by treating genetic diseases?",
        "response": "it does not \"reverse\" evolution. sure it likely alters what would have happened had we not cured those diseases. but the notion that it reverses evolution doe not make sense. It seems like you are making the mistake of seeing evolution as a process which is working towards a goal or a purpose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can I spin a ball on two axes?",
        "response": "No. You're really only rotating about one axis. If you express the rotations as matrices, you can see more easily that doing two rations at once is the same as doing the rotation that corresponds to the product of the two rotation matrices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do we know about the Jomsvikings? were they real?",
        "response": "Summoning the almighty /u/EyeStache & /u/textandtrowel from Valhalla, hopefully they'll be able to provide insight into your question as I'm intrigued as well :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Rubik's cube has 43,252,003,274,489,856,000 possible solvable permutations. How is this number calculated?",
        "response": "_URL_0_ The original (3×3×3) Rubik's Cube has eight corners and twelve edges. There are 8! (40,320) ways to arrange the corner cubes. Seven can be oriented independently, and the orientation of the eighth depends on the preceding seven, giving 37 (2,187) possibilities. There are 12!/2 (239,500,800) ways to arrange the edges, since an even permutation of the corners implies an even permutation of the edges as well. (When arrangements of centres are also permitted, as described below, the rule is that the combined arrangement of corners, edges, and centres must be an even permutation.) Eleven edges can be flipped independently, with the flip of the twelfth depending on the preceding ones, giving 211 (2,048) possibilities.[25]   8! * 3^7 * (12!/2) * 2^(11) = 43,252,003,274,489,856,000 which is approximately 43 quintillion.[26]",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do humans stay cool in extremely hot weather?",
        "response": "humans sweat, and the evaporation of the sweat helps you cool down. interestingly, dogs only have sweat glands around their paws, so their strategy for cooling down is by panting. This allows the moisture on his tongue to evaporate, and the heavy breathing also allows the moist lining of their lungs to serve as a surface from which moisture can evaporate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How tightly is DNA coiled?",
        "response": "This depends a little bit on what you are talking about. Are you talking about the helix, and how many base pairs it takes for it to turn? The answer to that is 10-10.5 base pairs per helix turn for B-form DNA, the most common type. The helix is, in this case, around 2 nanometers wide and each helix is around 3.3 nm long. But DNA is coiled in a lot of different ways. In eukaryotic cells, DNA is coiled around histones to make nucleosomes. The DNA gets wrapped around the histones 1.67 times (146 base pairs), and each nucleosome is separated from the others by 20-90 base pairs . These nucleosomes end up looking like ['beads on a string'](_URL_0_), and are about 10 nm in diameter.  Anyway, point being, when you talk about DNA coils, people are going to have a lot of interpretations regarding what you mean.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I get tired after I shower in the afternoon?",
        "response": "You're washing yourself with warm water, which will actually drain your energy after a while. If you took a cold shower, you wouldn't feel tired after. Same reason why you feel tired after spending time in a jacuzzi, spa, or sauna",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My hard seltzer boasts of only having 2g carbs. So why is it 100 calories?",
        "response": "The calories stat measures everything that your body can burn for energy.  Crabs are one source, but a whole lot of stuff can be burned for energy, even protein.  Though I think the alcohol itself in your hard seltzer is probably the biggest contributor.  Alcohol is a very energetic source as can be demonstrated by setting hard liquor on fire.  Your body will actually run off alcohol if it's present before going for more complex energy sources.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do our bodies know when to make blood and when to stop making blood?",
        "response": "So erythropoietin (EPO) is a hormone produced by the kidneys, when the body is lacking oxygen in the blood (when someone is at super high altitudes or losing blood at such high levels that there is low numbers of red blood cells carrying oxygen). However, there is always constant low amount of EPO being produced to replenish the dying old red blood cells with new red blood cells from bone marrow.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I need to find a liquid solution that Has a higher boiling point than ethyl butyrate, and does not react with it, so there is no product loss during distillation. Anyone got any idea what that solution might be?",
        "response": "DMSO, DMF, Xylenes, DMAc come immediately to mind. None of these are particularly nice, and have some downsides (like DMSO dissolves everything, xylenes are carcinogenic etc). Depends on your usage downstream, any undesired impurities and what you are attempting to do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did Christian churches begin using singing as a large part of a worship service?",
        "response": "According to the Bible, singing hymns was a common practice in the churches since the beginning of Christianity, not to mention the book of Psalms from the Old Testament that is full of songs which were sung by Jewish choirs and included instrumentals as said in the Psalms and elsewhere in the Bible. Therefore this practice as such isn't a modern invention except for the piano.  [Ephesians 5:19 (KJV)](_URL_0_)  Speaking to yourselves in psalms and *hymns* and spiritual songs, singing and making melody in your heart to the Lord; [Colossians 3:16 (KJV)](_URL_1_)  Let the word of Christ dwell in you richly in all wisdom; teaching and admonishing one another in psalms and *hymns* and spiritual songs, singing with grace in your hearts to the Lord.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why women generally take longer than men to orgasm ?",
        "response": "They don't. There's no \"generally\" about it. Some people take a long time, and others are on hair triggers. This is true of both genders.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What colour do blue lobsters turn when cooked, and why?",
        "response": "They still turn red, but you'll see a tiny, tiny bit of blue in the Shell lines. They taste the same as a regular lobster. You can get many color variations, inclusing calico blue/orange split.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I'm thinking in english, what were thoughts like before we developed language?",
        "response": "when you say 'thinking', that is a big process, of which 'thinking in words' is a small part. kind of like confusing the commentator for the entire ball game.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did cavalry charges actually connect with their targets?",
        "response": "There were also a number of uses of cavalry charges that weren't intended to make direct contact. For example, in the early 17th century cavalry would often be armed with pistols or carbines so they could charge into range, fire their guns, then ride back to safety to regroup and reload.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did any nation/culture even begin to approach the level of sword-making of Japan?",
        "response": "A lot of that is romanticism, not about actual quality. I would much rather like to know where that perception in the West came about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If each atom has its own center-of-gravity, why would an object have one center-of-gravity instead of spread out gravity for each atom?",
        "response": "Objects do have spread out gravity for each atom!  However, for an object to have enough gravity for us to feel (without relying on high precision instruments) it needs to be so heavy that it squishes itself into a ball, and once that happens all the sideways pulls cancel out each other while the far away atoms don't pull as much *each* due to distance but pull the same amount *combined* because there's more of them.  As it happens, all that spread out gravity behaves exactly the same as if it was all in the centre - as long as you're above the surface.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can book stores sell used books on Amazon for only $0.01?",
        "response": "Pretty sure none of the companies selling used books combine shipping, so that $0.01 book is actually $4.01 after shipping. And most of the time they bought a large quantity of said book for very cheap.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long does someone need to be exposed to asbestos in order for their respiratory system to be affected?",
        "response": "It's often considered an 'occupational hazard' and thus risk comes from long term usage/contact with the material. However, some authorities do not recognize any minimal safe exposure, and one of the important factors is the intensity of the exposure. So in those cases they would suggest any contact is a danger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When we say certain activities (e.g., meditation) causes structural change of the brain, what does that really implies?",
        "response": "You are partially correct in what you are saying... but an increase in cortical thickness could refer to a few different things. - An increase in the number of synapses - Some areas are capable of creating new cells (i.e. the hippocampus, prefrontal cortex).  - Another way area is taken up by cells is by the increase thickness and arborization (branching) of the dendritic processes. Simple activity in certain areas can activate and cause this branching as it is a natural process.   Disclaimer: I don't want to criticize too much, but it's possible that the difference they are seeing has to do with the inherent difference between the groups... people who don't practice meditation are likely to be different \"kinds\" of people and therefore have different brain physiology, so you can't assume that those brains are identical at the start. This study is merely correlational and can't say that meditation \"causes\" structural changes. Edit: typo",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do cosmic rays have any impact on the weather?",
        "response": "There was a scientific study of this by CERN, _URL_0_ The conclusions were not conclusive but suggested that, for known \"natural\" aerosols in the atmosphere, cosmic ray influence on creation of them was negligible - but there may be, as yet, unstudied aerosol substances which are created by cosmic ray interactions. _URL_1_ Usual cloud formation and daily weather is probably not influenced by cosmic rays.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we keep having power issues such as \"lines are down\" or \"rolling blackouts\" or \"rolling brownouts\".",
        "response": "Burying powerlines would solve the problem but it's quite expensive (the power company would need to dig up a network of trenches to all their customer's homes--costing thousands per customer and snarling traffic for several years).  It's far less expensive to cut trees regularly and repair problems as they occur (which frequently are much more minor than the rare widespread ice storm).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can magnets reduce the hardness of water?",
        "response": "The science is pretty uniform: They don't work, and there's no real reason to believe they would.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would a signal sent to a possible life bearing planet many light years away even be recognizable as the original message once it reaches its destination?",
        "response": "Radio astronomer here! The real issue on getting such a signal is actually the [inverse square law](_URL_0_) that describes how signals propagate through space. Basically radiation that travels that way becomes REALLY faint REALLY quickly, so the odds of teasing that signal out of the background level can be seriously difficult. (Trust me, I make my money from teasing these signals out of the background.) Otherwise, things tend to not lose too much information while in space, it turns out, but getting the signal in the first place is what makes it hard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(WW2) Was there every any serious thought given to using ballistic shields during D-Day?",
        "response": "I don't think you appreciate how heavy steel is. A German 7.92mm ball (not armor-piercing) round can go through 5mm of steel. A shield 5mm thick and large enough to cover a man would weigh around 120-150lbs. That's in addition to the 80lbs of gear he's already carrying. Such a shield would be completely unwieldy on level ground, let alone in the surf. And that only covers his front, he's still vulnerable to flanking fire and artillery while he struggles with his burden through soft sand. Even the current body armor and helmet at 30lbs is considered pretty heavy for combat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Lots of data keeps on getting added to the internet every day. Where us all that stored? And who pays for the storage?",
        "response": "It's stored on computers. If you need more storage, what do you do? Buy another hard drive. When Amazon needs more storage, they also buy another hard drive, they just have specialised equipment to have many more hard drives connected than you could in a regular desktop computer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a giant rocky planet ?",
        "response": "If a rocky planet is sufficiently large, its gravity will draw in hydrogen and helium from the interplanetary medium and it will build up an atmosphere and end up like a gas giant. If it is close enough to its star, the solar wind can strip this hydrogen proto-atmosphere away as it forms, so larger rocky planets can exist closer to stars. It isn't exactly known where the rocky/gassy cutoff is, from what I've red it's about five times the mass of Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we laugh at things harder and more often when we're in a group of friends as opposed to just by ourselves?",
        "response": "Laughing is, at it's core, a social response. You still find things funny when you are alone, you might not laugh as much because you are alone. People we feel close to, if they laugh, we often laugh as well. It is a nonverbal way of saying 'we are members of the same group, and we are bonding right now.'",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we hear our own voices through our jaw, which we hear lower than if heard through the air, how do we successfully replicate music in the correct tone and pitch?",
        "response": "I'm not sure that we hear our own voices at a \"lower\" tone/pitch through our jaw, it is simply a different quality of sound due to conduction of sound through solid material (bone) versus air. In my opinion, I think the mixed quality of bone conduction tone/pitch in addition to air conduction tone/pitch may actually help our basilar membranes within the cochlea of the inner ear (all of which processes sound) process a fuller sound when receiving input from both mechanisms and attempt to replicate similar qualities.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Just say.. We had the technology to lasso Mars and bring it to same position Earth is to the sun, Would Mars eventually be habitable like Earth is today?",
        "response": "No. In fact, it probably would make Mars *less* habitable. The lower gravity of Mars, combined with its lack of a magnetosphere means that any atmosphere is doomed to be blown away by solar winds. Bringing Mars closer to the Sun would simply subject it to higher intensity winds, stripping away the atmosphere at an increased rate. There is more to habitability than distance from the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would someone care to explain the Kulturkampf in the German Empire (~1871-~1879)?",
        "response": "Kulturkampf was also a strategy for Bismarck to get the support of the liberal parties who were normally opposed to a lot of conservative political projects of Bismarck.  (the conservative faction was divided into a protestant (diverse parties) and into an catholic part (Zentrumspartei). And the protestantic conservative parties alone were not strong enough to back up Bismarck who needed a majority in the parliament for his bills).  But in 1879 Bismarck wanted to introduce prohibitive taxes for German products. Naturally the Liberal Parties were against it. So Bismarck ended the Kulturkampf to get the support of the Zentrumspartei instead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, after Hurricane Katrina, were large masses of trees planted near the mouth of the Mississippi River?",
        "response": "Trees have roots that hold the soil around them which stops wetland loss. Wetlands act as a buffer to storm surge during hurricanes. In addition, trees would poke up through the storm surge during a hurricane and knock down waves. Those waves could be breaking over the levees.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If it weren't for the mass extinction, would dinosaurs evolve into what would seem to be modern day lizards, etc, or could they devlop thought patterns similar to humans?",
        "response": "Just so you know - Dinosaurs were on the earth for about 160 million years, so they had already had more time to evolve than we had. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it the standard/manual/stick shift car more reliable and gas efficient than automatic transmission cars?",
        "response": "Not entirely true for modern vehicles, but I personally feel you feel more connected with the road and driving in general with standard. Back in da day you could easily get better gas mileage with standard just due to more gears and changing gears early. But nowadays any auto can match or beat standard in fuel economy. The one thing that still stands is reliability, since a standard doesnt need a torque converter, theres less heat in the transmission, and less components to go wrong = lasting basically the life of the vehicle.  Other than that, a standard transmission can make any basic biotch 4 cyclinder feel \"ok\". Due to more control on shifting inbetween gears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How binary 1's and 0's translate into complex output?",
        "response": "01000010 01100101 01100011 01100001 01110101 01110011 01100101 00100000 01111001 01101111 01110101 00100000 01100011 01100001 01101110 00100000 01101011 01100101 01100101 01110000 00100000 01100001 01100100 01100100 01101001 01101110 01100111 00100000 01101111 01101110 01100101 01110011 00100000 01100001 01101110 01100100 00100000 01111010 01100101 01110010 01101111 01100101 01110011 00100000 01110100 01101111 00100000 01101101 01100001 01101011 01100101 00100000 01110100 01101000 01100101 00100000 01100100 01100001 01110100 01100001 00100000 01111001 01101111 01110101 00100000 01110111 01100001 01101110 01110100 00101110 00100000 The above translates to \"Because you can keep adding ones and zeroes to make the data that you want\".  Essentially a long enough string of ones and zeros can be made to represent any data. So with a long enough string of them, you can represent each pixel on your screen and the color it's supposed to be. This creates the image on your monitor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do companies pay contractors twice as much to do the same job as regular employees?",
        "response": "Do you have benefits? If so, those benefits cost your company money that they don't have to pay contractors. The contractors can also be fired more easily and have fewer workplace rights than full-time employees.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Castro and Cuba MEGATHREAD",
        "response": "Were conditions for the average working man (or woman) improved or worsened by Castro's taking of power? Would they have felt like their lives had been better under Batista, or did they welcome the Communist control?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to redheads and gingers in Nazi Germany?",
        "response": "If said redhead was Jewish, slavic, homosexual, mentally handicapped or a political dissenter then I see this question warranting more research. The question almost seems preloaded with the misconception that the Nazi doctrine called for the persecution of individuals based upon hair colour. Why would redheads be persecuted? They are not a race, religion or culture. Just a hair variation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is our bodies reacting like it is to drugs like heroin.",
        "response": "Everything you mentioned is an effect of the poverty, lack of hygiene, and malnutrition that result from a life centered around drugs at the expense of everything else. The extremely addictive qualities of drugs like heroin and meth drive addicts toward this lifestyle. The drugs themselves, however, don't do that to your body. One possible exception is that meth makes people grind their teeth, which accelerates tooth decay alongside poor dental hygiene.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If one calorie, when burned produces enough energy to raise the temp of a litre of water by one degree. If I burn 100 calories, could I boil that same litre?",
        "response": "Also the temperature change of water built into the definition of a calorie is from 0 to 1 degree. Things change a little at different starting temperatures",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could there be a periodic table for dark matter?",
        "response": "If (and right now that's a big if) dark matter is explained by supersymmetry, then our table of particles would look like a 3D version of the [Standard Model table](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do I twitch as I'm falling asleep?",
        "response": "This is called a hypnic jerk (or sleep twitching). It's an involuntary move triggered by you central nervous system. Causes are often too much caffeine, anxiety, stress. Has also been linked with watching TV or playing games before sleeping.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would one go about creating a computer that does not use Boolean logic?",
        "response": "You simply can not build a true ternary equivalent of a binary processor, it has to be its own thing. This is because operations like XOR have no meaningful equivalent. So basically you can build ternary processors at a logic level, they just aren't anything like binary computers since you lose and gain possible logical operations.  Tenary computers were briefly a thing in the 60s but they died out without ever gaining traction. I did some digging on this and this is a quote form one of the scientists on why research stopped  > “Ternary logic has some useful arithmetic properties, such as allowing the balanced representation of numbers. Its main drawback is that there do not exist any practical implementations of ternary storage circuits. Thus, if one has to use binary storage devices, it is clear that it makes more sense to try 4-valued logic circuits which can interface to the binary memory more efficiently.” _URL_1_ is where the quote was from, you can read about ternary logic at _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a shunt placement for treating hydrocephalus not lead to permanent disability given that a large amount of brain tissue is removed?",
        "response": "You don't need to 'remove' tissue, persay, so much as you pierce through the issue. Think of like piercing a knife through a piece of bread--the knife goes through it, but you haven't removed the bread so much as the bread moved aside. Inserting an EVD drain does damage a very small amount of brain tissue, but it's minimal and there's rarely any lasting side effects. Regardless, relieving the problems of the hydrocephaleus is far more important. Lastly, the value apparatus is typically placed under the soft tissue of the head, outside the skull.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we not run out of telephone numbers?",
        "response": "10 digits is 9,999,999,999 combinations. Sure there are rules, unused area codes, the 555 exchange number, but it's still more than the number you suggest. Under the [North American Dialing Plan (the rules)](_URL_0_ ): Each three-digit area code may contain up to 7,919,900 unique phone numbers: NXX may begin only with the digits [2–9], providing a base of 8 million numbers: ( 8 x 100 x 10000 ) . However, the last two digits of NXX cannot both be 1, to avoid confusion with the N11 codes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Nanking massacre so controversial among the Chinese and Japanese? Which is correct?",
        "response": "considering there are living witnesses to some of the atrocities, it's hard to deny atrocities happened. the Japanese story says there was no high level orders. and whatever stories of individual soldiers committing actions must have been fabrications because honorable soldiers always follow orders.  just like flat earthers, no amount of evidence will ever convince them that their opinion is wrong. and once you're in deep, you're committed to go all the way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a reason Beta Minus decay emits an antineutrino but Beta Plus emits a neutrino?",
        "response": "The total electron number before and after must be conserved. Electrons and neutrinos have +1, positrons and antineutrinos have -1. So if you get an electron, you need an antineutrino to balance it out and vice versa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are ores found at different height levels in real life like in Minecraft?",
        "response": "In a sense, yes, but depends on how and when the rock was formed, and the arrangement of tectonic plates. So a metamorphic rock that was formed by pressure and heat deep below the surface may have been caught in a fault and pushed high up on a cliff face over a subduction zone. Look up plate tectonics and igneous/sedimentary/metamorphic rock for more detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans see faces in every day objects?",
        "response": "There's a huge chunk of the brain that's dedicated to facial recognition. Here's a neat experiment to confirm that. Sit down a couple of yards away from someone and look into just one of their eyes. Ask them which one. You'll get an accuracy rate of waaaay more than half, even though the total angle deflection of your eyes into one of theirs over a couple of meters is WAY less than a degree. We can just tell which eyeball is being looked at. If it's dark, and foggy, and a few features, that might be facial features, make their way to this portion of the visual cortex, there's a HUGE survival benefit into making the determination, \"That's Bill,\" rather than \"Oh, look. Random stuff.\"  This chunk of the visual cortex is *always* running, so if you see a bunch of random stuff that might be a person, you're more likely to decide that it *is* a person.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Random dungeon generation",
        "response": "There's many ways to do this depending on what you want the dungeons to look like, so unfortunately there's no definitive answer. However, here's a strategy to get started: 1. Generate a dungeon manually on pen and graph paper 2. Notice how you did it. What strategy did you use to come up with that? What are some rules you had to follow to not end up with an invalid dungeon? 3. Codify the strategy into an algorithm 4. Refine the algorithm until it does what you want",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we reach up to 4 000,000,000,000,000 °C but can't go below −273.15°C ?",
        "response": "Think of Temperature as a uniform measure of the excitement of atoms in a substance due to a specific amount of energy input into that specific environment. You can always add energy to the environment because theoretically, there isn't a ceiling for the maximum amount of energy that can be input into the system... ...But -273.15°C represents a temperature where there is approximately 0 energy in a substance. That's as layman as I can put it and I hope I'm not wrong and get flamed to 4 000,000,000,000,000 °C in the subsequent comments. ^***TL;DR***: **Although there is an unlimited amount of energy that can be put into a system which brings it up to temperature, there is a starting point (zero energy state) where the temperature is absolute zero. We can't get a temperature below that because there is no negative energy.**",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I were stabbed in the stomach, would it be a lot worse if I had just eaten?",
        "response": "I remember hearing about a similar problem in the Korean war. Apparently, as sort of an attempt to instill a sense of toughness in British troops, they'd serve them tea after they'd been wounded, as if to say \"no matter, you're alright. Here's a spot of afternoon tea\". However, many if the injuries were belly wounds, in which cases the tea spilling into the open wound from the esophagus caused massive infections. All this to say that having food in the stomach would likely cause a similar problem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Difference between torque & horsepower",
        "response": "Imagine turning a heavy hand crank. Think of torque as how hard you're turning the crank at that exact moment. Think of horsepower as how much crank turning you do over time (how hard did you turn the crank over one minute). Torque is like work, and horsepower is work over time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are fines for breaking the law set fee's instead of a percentage of a persons income?",
        "response": "if it was based on income, does that mean that the unemployed or retired can speed as much as they want and not get a fine? Also, wouldn't it give the police incentive to stop nice looking cars to get higher fines?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Nazi eugenic policies considered repugnant, yet it is acceptable to screen egg/sperm donors for genetic diseases, minimum height, and IQ?",
        "response": "The part where one is voluntary and one isn't. Pretty damn simple answer there why one is okay and one isn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are we greener than past decades?",
        "response": "Not really, not even individually. Higher population means more pollution even if there has been a reduction in individual consumption which there has not really been. Add to that the expansion of the developed world into China and India. Finally the power needs of modern technology combined with the current deficiencies of wind and solar power generation and the publics fear of nuclear power means that there has been an increase of coal and oil power plants.  That said the pollution we put out these days is much less toxic then what was put out in the 50s with only a small fraction of the heavy metals and sulfer, meaning the biggest threat we can see is global warming and while all of the initiatives like the Paris Accord have officially failed to meet their stated goals they have all been absurdly ambitious. The trend is now going in the right direction where while we are still polluting more each year then the last it is starting to flatten out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the point in a corporation making billions in profit a year?",
        "response": "Most of them do, to a certain extent. Revenue means value, value means stronger stock, stronger stock means money. What is the point of limiting the amount of money a corporation can make or keep? Aside from limiting performance? Also, 15 billion dollars brought in, when your operating costs are 12 billion, isn't a whole lot of profit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the Amish avoid complications due to inbreeding with such a small community?",
        "response": "They don't. According to a nurse I know, they deal with a lot of genetic issues such as extra digits, and health complications.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people flick and squirt needles before giving injections?",
        "response": "You don't want to inject air. It's difficult to fill a syringe without having at least a small air bubble. Putting the needle up and flicking will get any air bubbles in the syringe up to the end, you then push out the bubble and you know when it's all out of the needle when liquid flows through. Even when you're not injecting it into a person, if the volume measurement needs to be very precise you won't want any air in there to throw it off. EDIT; Note that the movie version with a large fountain of medicine coming out is dramatization, but the practice is real and much less wasteful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can playing loud music help warm up my car in the morning?",
        "response": "Not noticeably, no. Bring a hot cup of coffee into the car instead, it will work much better than Metallica.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do pilots perform emergency/forced landings?",
        "response": "If the aircraft is still controllable, it's landed as a glider (assuming engine failure). Emergency procedures are drilled over and over and over again. Emergency runways can include anything from highways to rivers to dirt roads depending on speed, maneuverability, type of aircraft, and type of emergency. If the aircraft is no longer under pilot control, ejection is the way to go.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are vehicles built that under and/or oversteer?",
        "response": "most vehicles don't oversteer from the factory, that's a dangerous thing for the average driver understeer makes the driver realize they are going too fast and they react by slowing down, especially with audible feedback from the tires. for an average driver understeer is much safer and easier to control",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people anti-vaccine?",
        "response": "Mainly because of one study done by then Dr. Andrew Wakefield which claimed a causal link between vaccinations and Autism. Turns out the study was a fraudulent attempt to discredit the current MMR vaccine so he could push his own version of it (that he had already manufactured). His case study sample size was only like 12 children too, so that should have been a huge red flag from the start.  After that fiasco we then have talking heads like Jenny McCarthy and Food Babe espousing ludicrous and inane bullshit which a portion of the public believe in. tl;dr = The general public (or at least a portion) are ignorant or willfully so and would rather take advice about health and wellness from prominent celebs than they would qualified scientists.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did we think gold and silver was precious in the ancient times?",
        "response": "We uh... still do? 1 - It's shiny. Humans like shiny things. 2 - It's rare. When you only have a little bit of it, every piece is more valuable! 3 - It doesn't go away. Silver and Gold don't corrode quickly and last a long time. 4 - They are easy to work. Silver and Gold are softer metals making them useful for things like jewelry. You'll note that none of that has changed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Saturday Reading and Research | November 15, 2014",
        "response": "Reading reports and assessments of Soviet naval strategy and prospects that were published in the late 80s and early 90s by Western sources. Always fascinating looking back at those sources discussing what the Soviet Navy will look like entering the 21st Century, and also how effective the Soviets were at frustrating Western speculation on the missions and strategies of their fleets and vessels. Frustrating to the amateur historian is that these same confused and debating sources seem to be the ones that are still widely referred to even after the collapse of the USSR.  Maybe its more of a POV lesson. I can now feel the same sense of futility a Western naval officer might have felt in trying to discover if the Soviets still regarded the attacking of Atlantic shipping lanes as their primary naval mission despite their 70s/80s tendency to engage simultaneously in \"showing the flag\" in Third World ports. *and* appear to engage in defensive posturing in home waters.  Who said history wasn't fun?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the highest resolution a screen can have, at least in theory. And when would the pixel size become so small that it doesn't matter to the eyes anymore?",
        "response": "The amount of pixels on a screen is unbounded; one can always build a bigger screen with more pixels. However, the usefulness of a massively huge screen is limited, which takes us to the second part of your question. Current high-resolution (“retina”) screens are already at the point where the unaided human eye cannot distinguish individual pixels anymore. It's unlikely that resolution (in the sense of pixels per square cm) will get significantly increased in the foreseeable future. To take it to an extreme though, what's the smallest pixels you could make in theory? One pixel per atom/molecule, surely. As long as you can find a material in which you can excite the electrons of specific individual atoms in such a way that they give off the desired wavelength of light (= color), you're golden. For human consumption however, that would be massive overkill.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do noses have two holes?",
        "response": "Most parts of our body and brain are bilateral, meaning they're on both sides. I would assume the nose is no different and that is why.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know how much to chew?",
        "response": "You don't start out knowing. You learn around the age of 2 and as your throat grows you learn to gradually take in as much as you can swallow. Some people don't learn and eat very slowly. 2 year olds put more than they can swallow into their mouths all the time. They tend to spit it out when they realize it's too much. Or they choke and die.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if I dug a small hole 5m down into soil, and then started digging out a 10m*10m room? Would the soil collapse? Is it legal to do this?",
        "response": "5m down is not what would be called a small hole if we are talking about working round a property. Depending on the type of ground you are digging it could start to collapse on itself after abuot 1m, sometimes even less. Don't fuck around with something like this if you don't know what you are doing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens in our body when we vomit , and how do we vomit?",
        "response": "Your body takes a series of specific actions to prepare for vomiting and then to actually vomit: First your mouth fills with spit to protect your teeth from the acid & you take a deep breath (to keep from needing to inhale while vomit is in your throat and sucking it into your lungs). Then the muscles that move digesting material through your intestines reverse, pushing the contents of the upper intestinal tract back into your stomach. The pressure in your thoracic cavity lowers creating low pressure in your esophagus while your abdominal muscles contract , increasing abdominal pressure. Then the esophageal sphincter opens up and stomach contents shoot from the high pressure stomach to the low pressure esophagus and out your mouth like opening a bottle of pop. Repeat until stomach is empty.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did I get cuts that didn't shred my clothing first?",
        "response": "It did go through your shirt, but it only needs to pierce through in one spot. Your shirt then moves with the hook as it cuts your skin. It may have left no damage at all to your shirt, depending on the size of the hook.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are subatomic particles compressible?",
        "response": "Particles are not little balls of stuff. What a particle 'looks' like depends on how close you are to the particle and what method you chose to probe it i.e. the energy and type of particles that you shoot at it.  For all practical purposes (i.e. for the range of energies that have been reached in experiments up to date) it suffices to assume that a particle is a dimensionless point object.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If condoms have 99% success rate, what causes that remaining 1% to fail?",
        "response": "That success rate is not per instance. It is an efficacy rate, indicating the percentage of couples who conceived during a period of one year while using condoms as their sole contraceptive method. The couples that conceive are a combination of people who decided to stop using contraception and people who used condoms improperly and an unlucky few who have condoms break in proper use. The data is commonly estimated to be poorly representative of the actual effectiveness of condoms due to the fact that many factors contribute to the failures over one year other than condom technology itself, and that with the irresponsible users weeded out in a one year test period the efficacy rate would improve drastically in longer tests.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are word problems so difficult?",
        "response": "From my lay perspective, it's because the word problems are designed to confuse. They include extranious information that's irrelevant to the problem, and are therefore testing your ability not only to do math, but to retrieve only the information that you need. I have to re-read them a few times as well - my guess is that's your brain saying \"why are they talking about morning and evening if it's not important\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do WWII era soldiers have mesh around their helmets?",
        "response": "1. Sundry items like first aid kits could be attached to it for \"hands-free\" carrying 2. Twigs and leaves could be inserted to help with camouflage. Source: World War II Tactical Camouflage Techniques by Gordon Rottman, page 1939",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "California specifically seems to always be in a drought, but surrounding states don't seem to have the same issues with fires. Why is that?",
        "response": "The surrounding states do have bad fires. But they get less press coverage because they are usually in more rural areas with less population density than the LA foothills. Look up Arizona Rodeo-Chedeski fire, Wallow Fire, Willow Fire, Cave Creek Complex fire, Warm fire. All devastating and huge (some absolutely enormous). But little national press because it's just not as big of a news story when a few hundred thousand acres of national forest burns vs literal suburbs burning. Edit: and can't forget the Yarnell Hill fire, many young men died tragically fighting that fire.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to develop new allergies as you age, and if so, why?",
        "response": "Yes, allergies can become active during adulthood.  Allergies themselves are thought to be linked to a delayed maturation of the immune system, but their actual cause has yet to be identified.  Similarly, we're still unsure as to what might cause such a late onset. It could be something as simple as not being exposed to the allergen before, it could be a secondary defect in your immune system, it could be the result of a recent transplant, or it could be something different altogether.  --- Sources: - [Wikipedia Article on Allergies](_URL_1_) - [ISAAC Study](_URL_3_) - [Study on Allergies developing after cord blood transplants](_URL_2_) - [HealthCentral Article on Late-Onset Allergies](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If half of the matter falling in to a black hole during Hawking Radiation emission are anti particles and half are their particle counterparts, why does it cause the black hole to shrink?",
        "response": "The idea is that quantum vaccum fluctions create particle - anti particle pairs which are extremely short lived. To conserve energy, if one particle has positive energy, the other requires negative energy. Now, if this happens extremely close to the event horizon, a particle with negative energy cannot escape because it takes energy to climb out of a gravitational well, but a positive energy particle can, and will simply redshift as it loses energy when traveling away from the black hole. If the positive energy particle escapes, and the back hole absorbs the negative energy particle, it loses mass by the mass-energy equivalence (E = mc^2 ).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did contractions like \"won't\" and \"can't\" start being used in the English language?",
        "response": "You may also want to try the linguists in /r/linguistics or /r/AskSocialScience or in /r/Etymology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can gases/liquids be contained within a magnetic field?",
        "response": "Yep. Real cold dilute gases can be magnetically trapped: _URL_0_ Also frogs, but I think that is due to the interaction of the magnetic field with the orbital motion of the electrons, rather than spin: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Snowden and the NSA so popular on Reddit while they're virtually ignored in the mainstream press?",
        "response": "Redditors like the idea of someone bucking authority and 'fighting against the man.' In reality, Snowden's leaks revealed information that most people knew or assumed was going on anyway (I mean, it's all there in the laws authorizing it), so it didn't have a big impact.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How different was the culture and language of the Scottish Highlands from that of the Lowlands?",
        "response": "When? Scotti is the Latin name for the Irish, (or, alternatively, northern Irish) who frequently raided Britain. (Gael comes from Welsh Gwydel which is raider, iirc, akin to Viking meaning pirate or something along those lines) The Gaels of the north of Ireland set up a kingdom that spread across Antrim and the west of Scotland basically. Over time, Vikings arrived into the islands of Scotland, as well as invading England, Ireland and Scotland in general. Eventually Gaelic culture proved predominant in Pictish areas too, and the Vikings of the islands adopted it too, becoming the Hiberno-Norse. (Who would bequeath Irish culture the gallóglaigh or gallowglasses.) After that, it was a long slow decline.  Lowlanders speak a different dialect/language that's very close to English anyway. (Lollans?) So that allowed them be culturally closer to the English than to the Gaelic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does cannibalism REALLY have adverse side effects or is that just something people say?",
        "response": "In general, it's a bad idea to eat the same species simply based on a disease transmission perspective. (I'm sure there are plenty of psychological issues involved as well.) But a major concern in animal production is [transmissible spongiform encephalitis (TSE)](_URL_1_) or the more popular: mad cow disease. [Prions](_URL_2_), an infectious protein, can basically turn a brain into Swiss cheese. These mutated proteins occur naturally, albeit rarely, but can \"infect\" another of the same and sometimes other species if they are eaten. So in the case of mad cow, the cows were being fed a protein mix that included brain and spinal cord tissue from other cattle. We see the same thing in people with [kuru](_URL_0_. Shameless plug: if you like infectious disease stuff check out r/ID_News.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the variation between alligators and crocodiles come from?",
        "response": "There is waaay less variation today than there has been in the past, but I think you'll find [this article](_URL_0_) about their common ancestor an interesting read.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Greek mythology does Hades ever actually do anything morally questionable?",
        "response": "The story that immediately pops into mind is the [Kidnapping of Persephone](_URL_0_). Hades takes Persephone, daughter of Zeus and Demeter (God of Agriculture), as his wife against the wills of Zeus and Demeter. Demeter falls into deep anger and brings famine across the world and will not relent until Persephone is returned. Hades relents, but not before tricking Persephone into eating a Pomegranate seed, forcing her to remain in the underworld. In a compromise, Zeus' mother said that Persephone will spend 6 months with Hades and 6 months with Demeter each year. This is the explanation story of the seasons. This easily falls under Morally Questionable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In animal's native languages, have any species been found to give names to members of their pack?",
        "response": "[Dolphins call each other by name](_URL_0_) Also other intelligent species have been known to name certain members of their families such as monkeys and some parrots name their babies. The most interesting interaction with familial name calling is that of the penguin, which has a distinct call that the baby just learns. It knows its mothers call for when she comes back to bring it food.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much of the price of gold is perceived value (as an alternate currency) vs it's value as an industrial metal? Are other \"precious\" metals similarly valued?",
        "response": "Can't find my source now but ~10% of gold is used for industrial use the rest is in jewellery and financial use(~40% jewellery 60% financial. So A huge chunk of it's value is as you call it perceived.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes PRIME NUMBERS so important in encryption?",
        "response": "Prime numbers are needed to make the maths behind the encryption and decryption processes work. For RSA, the proof that decrypting the encrypted message gets you back to the original message depends on Fermat's Little Theorem, which is that  *a*^(*p* - 1) = 1 (mod *p*) where *p* is prime and not a factor of *a* The difficulty of breaking the code doesn't come from using a product of two primes, it just comes from the fact that multiplying two numbers is much easier that finding the factors of a number. It would indeed be harder still to find the factors if you didn't know that the number is a product of two primes, but then you wouldn't have a working encryption key. Instead we use really big primes to make the problem hard enough.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the wright brothers considered first in flight, yet the hot air balloon was invented several years prior?",
        "response": "First in a heavier than air machine to fly. A hot air balloon flies because it's less dense than the air it displaces so it's lighter than air. Plus the hot air balloon was invented well over a century earlier.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I often wash my hands in solvent at work because it works really well, how horrible is this for me?",
        "response": "Well what kind of solvent? Water is a solvent, and that works fine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do species with a shorter lifespan evolve faster than those with a longer lifespan?",
        "response": "Organisms with shorter lifespans will have more generations in the same period of time, so more mutations will occur in the population in the same period of time, meaning evolution will happen faster. We often use insects in labs when we want to study the evolution of traits partially for this reason; they also tend to breed in large numbers which helps too, though that's not related to their lifespan (plenty of organisms which breed in large numbers have long lives).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does fire emit light?",
        "response": "There are two ways that fire emits light. 1. Soot is made of solid, black particles, mostly carbon. When a black solid heats up, it emits [black body radiation](_URL_0_). This is why the sun gives off light, and why you can see people on infrared cameras at night. Yellow light from a fire is caused by this mechanism. 2. Gases in the fire get excited because they are so hot. This means that they vibrate faster than normal, or their electrons move further away from the nucleus than normal, or the spin faster than normal. This doesn't last long, and they quickly return to their normal state. When they return to this state, the excitation energy is released in the form of light. This is where the blues and greens in a fire come from.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "No need to upvote, just need a quick answer. Was there a census in the Roman Empire in the first three centuries?",
        "response": "Oh yeah, not sure if this is relevant but I'm writing a paper on the subject and all I'm looking to say is that Constantine had access to the census data, and he recognized that the exponential growth of Christianity could be an issue if he didn't embrace it. I'm using estimates from Rodney Stark that roughly estimate a forty percent increase in Christianity every half century. And I guess another question would be: Even if he didn't have the census data, would he still have a general grasp of the rapid growth of Christianity?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do ear buds always get tangled in my pocket?",
        "response": "There was actually a [study](_URL_0_) done in 2008 about this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Age at first marriage, when did it transition from teenage to adult?",
        "response": "[Not to stifle any further discussion, but this section of our popular questions page might be relevant to your question](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is violence, murder and death so widely accepted in movies/TV/Video games, while sex and nudity is considered taboo?",
        "response": "That's mainly in puritan societies that are heavily influenced by religious entities. In many European movies nudity is not such a taboo.  Violence is a reflection of a society that's focused on war and guns, where physical strength is important to subdue \"enemies\". Since the US has a huge influence over global entertainment you end up with a skewed view. Go check French movies and Brazilian TV. Nudity is not a big deal there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a bread knife cut bread better than a regular straight-edged knife?",
        "response": "Because the serrations tear through the crust, meaning you don't squash the bread when you press down while cutting (particularly when you start a new slice). The same thing goes for tomatoes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My friend claims he is affected by beer quicker than hard liquor.... is that possible and how?",
        "response": "I suspect it's something to do with the rate of his consumption. Does he do the 5 shots in the same amount of time as he drank the beer? If he did the five shots quickly then it would take a while to take effect, whereas a beer generally takes longer to drink and will be into his system before he's finished it. Here's an experiment. Give him a pint of lemonade with two shots of vodka in it (this should make it the same strength and carbonation as a beer), see if this affects him like the beer does.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "While drunk, why does it seem easier to see with only one eye? Why do you close one eye when drunk?",
        "response": "Because when your brain is operating normally it takes the two pictures your eyes give you and combine them into a 3D picture, when drunk it just sees two overlapping pictures. Close one eye and one picture disappears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does thinking harder burn more calories?",
        "response": "Reposting my response from a similar qs:   Metabolic activity of the brain has been shown to be pretty constant across time and across different mental activities. Transient task-related changes in brain activity are often small in magnitude relative to baseline activities (e.g. using changes in local blood flow as a proxy, task-induced 'activation' are often < 5%). An [open access commentary](_URL_0_) for more details.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "who is gallowboob and why is he on the front page almost daily?",
        "response": "Gallowboob is a collective of users who soul goal is to post material that have the highest chances of reaching the front page.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How someone is declared \"legally sane\" despite committing horrible crimes.",
        "response": "Legally, the distinction is whether the individual committing the crime was in control of his full mental faculties or not, and whether he knew what he was doing at that time. The individual must be aware of his or her own actions and its consequences whilst committing the act.  In the case of Anders Breivik, the court and psychiatrists found that he was lucid and aware of what he was doing while committing the crime. The legal aspect of it does not really deal with the overarching philosophies of whether it is 'morally right or wrong' to kill 77 people. The average layperson may consider him insane, hence the specific term 'legally sane' or its opposite, 'not guilty by reason of insanity' (e.g. lack of [mens rea](_URL_0_)).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What laws apply if I murder someone on the moon (or in space)?",
        "response": "Yes very much so. Most space craft are considers territory for what ever country they are from. Normal laws apply. Still should you be on the moon murdering someone Im not to sure there are regular check and you would have to fly your self back to get punishment...I don't really seeing anyone doing that. so Off to Mars you go OP, anything goes up there with the robots!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Asians (Chinese, Japanese, etc.) colonize the Americas?",
        "response": "long story short, [they did](_URL_1_), although China and Japan didn't exist 15,000 years ago when it happened. the americas were colonised by north asians through siberia and the land-bridge that is now the Bering straight. this is shown in [genetics](_URL_2_) as well as language. if nowhere in the new world has a large asian-descended population, then who are the Inuits and why are their eyes constructed the way that they are? [sources](_URL_0_) that [aren't](_URL_4_) the [smithsonian](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Having a discussion with my 15 year old on the historicity of Troy, and ended up discussing the Sea Peoples. Kid is now facinated with the idea of an invading group with no known starting point. What do we know about their possible origins? Is there any new research being done?",
        "response": "Not to forestall further (in-depth comprehensive) answers, but there's [a section of our Frequently Asked Questions page about the Sea People](_URL_3_) featuring not only a great explanation of [where the term 'Sea Peoples' comes from, and why it isn't that mysterious by /u/bentresh](_URL_0_) and [a good summary of what we know about the phenomenon by /u/kookingpot](_URL_1_), but also [an AMA with the author of *1177 BC: The Year Civilization Collapsed*](_URL_2_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly does Monsanto generate such enormous profits?",
        "response": "Because they're a $50 comanpny, and because the metric your using ignores a lot of what they spend their money on.  The $7 billion number is \"Gross Profit\". This is \"Money you get from selling something - cost to make the thing you sold\". It ignores what is called \"selling, general and administrative expenses\" which is stuff like sales people who actually go and sell your product, the rent for the buildings your business needs to run, management, etc.  A different measure you can use would be EBITDA (Earnings Before Income Tax, Depreciation, and Amortization). Which for monsanto would be about $3.75 billion.  $3.75 profit from a $50 billion company isn't really out of line. You can divide the latter by the former to give something called the \"Enterprise Value Multiple\" or \"EV/EBITDA\". Typical values for this vary based in the industry but 13 isn't going to be too far from the considered odd.   td;dr - Monsanto makes roughly what you should expect a company their size to make.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The chills, why does my skin get all tingly when I something interesting happens in a tv show or movie?",
        "response": "FRISSON Here you go : _URL_1_ And, here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How bankruptcy works and what the different chapters of it mean.",
        "response": "Bankruptcy is a legal process to discharge or reorganize debt. Under backruptcy, any or all of the following could happen: * some debt is eliminated (vanishes into thin air) * some of your property is legally forced to be sold to pay debt * you may be legally forced to pay off debt in a structured way (e.g. 10% of your paycheck for the next 5 years) The various chapters of bankruptcy in the US are just different approaches to the same thing. Chapter 7 is basic bankruptcy. Chapter 11 is more for corporations. Chapter 13 is more if you make a regular paycheck and need to structure a way to pay back your debts. Most people who file for bankruptcy use Chapter 7.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In America, what is meant by college? Is it the same thing as University or are they separate? What different qualifications do American's receive throughout education?",
        "response": "College and universities are both post-secondary education in the US. However, Universities tend to be larger institutions and more research-oriented than college with more advanced degrees offered, but the words are mostly interchangeable in everyday language. EDIT: In the US, it generally goes (and this is flexible depending on the school): - Under 5 - Preschool (usually optional) - Age 5 to 12 - Elementary School (Kindergarten to Fifth or Sixth grade - Age 12 to 14 - Middle school (Grades six or seven to grade eight) - Age 14 to 18 - High School (Grades nine to 12) - Age 18 and up - College or university. Most people take 2 years to get an associates or 4 years to get a bachelors. A Masters is usually 2 years on top of the Bachelors. EDIT 2: We also don't say that someone \"goes to university\" the way it's common in the UK. We say they \"go to college\", even if that college is a university.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Hermaphroditic and pre/post-op transgendered people",
        "response": "In LGBT (and feminist) theory, there's a distinction between sex and gender. Roughly, your *sex* is the physical traits you have, while your *gender* is the cultural gender role you identify with. That's important to understand the rest. Transgender people are simply those whose gender does not match their birth sex. So for instance, if I was born as a woman but identify myself as a male, I am a trans man. The pre/post-op refers to what's known as sex reassignment surgery; this surgery is designed to give my body the sexual characteristics of my gender. Intersexed people (that's the preferred term for what you call \"hemaphroditic\") are those born with physical characteristics intermediate between distinctly male and distinctly female.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a concentration as low as 400 ppm of CO2 heat the planet?",
        "response": "CO2 absorbs infrared light very effectively in certain ranges of wavelength. If you look at [this video](_URL_0_), you can see what 280, 390, and 560ppm look like with something that effectively absorbs visible light. Even a small amount of a substance can have a large effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a disease - Rabies - make an animal \"afraid\" of water? Like, what?",
        "response": "Rabies causes painful spasms of the throat. Because liquid entering your throat causes reflex constriction, it makes the affected animal afraid of drinking water. In fact they cannot even swallow their own spit - thus the foaming at the mouth. Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is rain on exoplanets determined by the liquid in their oceans ? Does this liquid have a cycle just like water on earth ?",
        "response": "> i was wondering could it be possible to have full oceans of methane on a planet and so just like on earth where there would be a cycle that transfers water from oceans to moutain tops ? This is exactly what happens on Saturn's moon Titan. It has a methane cycle that appears to behave in a very similar way to the water cycle on Earth, with seas and rain formed from cryogenic methane and other hydrocarbons. I'm not so sure about it happening for liquid iron though, since I've only heard about iron rain occurring on hotter gas giants and cooler brown dwarfs (not planets, but similar in many ways to gas giants), not solid planets.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the moon appear bigger on some days and smaller on others if its orbit remains the same?",
        "response": "There actually are slight difference in the distance between the Earth and the moon depending over time but you can't see them with the naked eye.  The reason the moon sometimes looks bigger is an illusion. When the moon is high in the sky you don't have any nearby objects to compare it to so you only judge it's size based on the angle it subtends. But when the moon is close to the horizon your brain compared it to objects that subtend a smaller angle than the moon does so it ends up looking bigger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would be the tangible, non-ethically related ramifications of humans just letting animals go extinct and putting no effort into conservation?",
        "response": "The biggest issue isn't the extinction itself, it's just a sign that we're destroying the environment. It should be a red flag that we're doing things that might catch up with us down the road and we need to pay more attention.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a credible source please explain what is going on with the European (or global if relevant) bee population? If so, what are the predicted (non-sensationalized) consequences? And why aren't the entities responsible being shut down permanently?",
        "response": "I don't have any expertise in this area but there is a fair amount of literature on the subject, from what I have read a lot of people are looking at a rise in invasive parasites (specifically Nosemi bombi and Crithidia bombi). This is probably compounded with loss of habitats and floral abundance and some of their social/breeding habits which make populations numbers susceptible to drastic fluctuations.  Sorry most of these references are probably not freely accessible. [Effects of invasive parasites on bumble bee declines](_URL_4_) [Pervasiveness of parasites in pollinators (open access)](_URL_4_) [Decline and Conservation of Bumble Bees](_URL_5_) [Effects of Invasive Parasites on Bumble Bee Declines](_URL_5_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long before humans can utilize lizard enzymes to regrow amputated libs?",
        "response": "Salamanders are not lizards. Humans are more closely related to lizards than amphibians are.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain this comic to me.",
        "response": "[There's a website for that](_URL_0_)  > This is a reference to the phrase context-free grammar, which is a technical term used in formal language theory. The play on words is that Cueball does not provide any context for his statement.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come my 2-3 year old computer/tablet, which was blindingly fast, is now slow and clunky despite having pretty much the same apps/software?",
        "response": "Have you done updates in those three years? If so, you do not pretty much have the same software. New operating systems can have vastly different requirements, and just because your tablet can run a certain OS version, doesn't necessarily mean it will run it flawlessly. Additionally, when was the last time you did a clean install? Too often apps and data that are removed from the device still leave traces on it, and if that happens over a period of years, well, you are looking at a lot of slow down. A clean install will help you with that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do pop rocks pop in your mouth?",
        "response": "> Here's the basic idea. Hard candy (like a lollypop or a Jolly Rancher) is made from sugar, corn syrup, water and flavoring. You heat the ingredients together and boil the mixture to drive off all of the water. Then you let the temperature rise. What you are left with is a pure sugar syrup at about 300 degrees F (150 degrees C). When it cools, you have hard candy. To make Pop Rocks, the hot sugar mixture is allowed to mix with carbon dioxide gas at about 600 pounds per square inch (psi). The carbon dioxide gas forms tiny, 600-psi bubbles in the candy. Once it cools, you release the pressure and the candy shatters, but the pieces still contain the high-pressure bubbles (look at a piece with a magnifying glass to see the bubbles). When you put the candy in your mouth, it melts (just like hard candy) and releases the bubbles with a loud POP! What you are hearing and feeling is the 600-psi carbon dioxide gas being released from each bubble. Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't prisons actually try to make people better?",
        "response": "Because fixing people is *haaaaaard* and really expensive. And it's incredibly difficult to convince middle-class folks that spending metric fucktons of money on a bunch of low-life criminals benefits them. Seriously, just look at how many people bitch and complain about prisoners having access to television and playing cards. A huge chunk of the population believes that Prison isn't for rehabilitation and redemption, but punishment and vengeance. And asking them to fork over more tax dollars to better prisons (especially when you watch various documentaries and television shows of varying levels of exploration that show prisoners assaulting guards and destroying prison property - things tax dollars paid for) is going to result in the politician asking for it not winning the next election.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how paul george can snap his leg in half and recover to be an mvp candidate but people are wondering if KD can return from an Achilles tear?",
        "response": "The difference between the two is that George snapped his bone, while Durant tore his tendon.  Bones in general are known to break apart and reform, with the right care, and are commonly known to fix themselves (e.g. broken arm in a cast). However, the Achilles’ tendon (tear) doesn’t carry its own robust (strong/healthy) blood supply meaning that it can’t heal by itself efficiently, unlike a cut or bruise which heals in a matter of days.  So, the only two ways fix a tendon is extreme physical therapy, with very little to no activity on that tendon, so as to let the tendon heal by itself over a long course of time, or surgery. However, operating on a tendon is very difficult and the tendon itself almost never comes out the same. Plus with the additional time or no activity in both treatments, Durant may have a hard time coming back and recovering lost skills.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why exactly I need to turn off my cell phone on an airplane?",
        "response": "I believe it was Mythbusters that tried to look at this closely so grains of salt may be necessary. They basically showed that most air line communications and electronics are on a completely different frequency than those used in *most* cell phones. A few that they managed to get a positive interference completely messed with the altimeter. Airplanes take the better safe than sorry approach and say shut it all off during take off and landing when those types of instruments are most crucial. During the flight, *most* phones won't cause issues with sending or receiving but I don't want to sit on a plane surrounded by 50 different cell phone conversations anyway so I'm ok with the conservative approach.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Cao Cao depicted as an evil tyrant?",
        "response": "Yeah but I'm still Cao Cao all the way.Thanks for informing me though.Also Sun Quan ain't no angel.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to tips left for non-tipped employees?",
        "response": "So you work for Domino's, you notice this and decided to ask a bunch of strangers on the internet, instead of asking your boss?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Megafauna and why they don't exist anymore.",
        "response": "The blue whale is the largest animal ever known to have existed, and they exist right now. So there's that. A big reason is that the dinosaurs went extinct and mammals evolved into all the niches they left behind. Being warm-blooded puts an upper cap on size because it becomes too biologically expensive to maintain the body heat of such a large animal. The largest land mammals weren't that much larger than modern giraffes and elephants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our ears pick up noise in complete silence?",
        "response": "here's a room that's absolutely silent.  people can't stand to be in it for more than 45minutes. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What defines a generation?",
        "response": "It's pretty arbitrary. Consider \"baby boomers,\" a generation of people born after the post-WWII economic prosperity in the US. You and I are considered \"millenials\" because we were born right before the turn of the millenium. They might even define a generation of people born after the Great Recession around 5 years ago.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are football statistics calculated? Especially possession, and distance travelled by each player.",
        "response": "Ahem. OP *might* have been talking about the other football game. Y'know, the one that almost every other country plays... Ex-Dortmund coach Juergen Klopp was one of the first in Germany to use sensors in the players' shoe to measure speed and distance covered as well as which parts of the field a particular player was active in. Now virtually all pro teams use it. These stats are frequently cited and published in any number of sports media sites. Possession time? No idea unless some poor mope in the pressbox is punching some sort of stopwatch every time the ball changes possession.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Resources on great Arab/Muslim empires from Middle ages through 19th century?",
        "response": "I am partial to the (recently discussed in a thread here) \"Venture of Islam\" series by Marshall Hodgson. It's a little dense but its the best complete history of the Islamic world to date. I'm also a big fan of the [Ottoman History Podcast](_URL_0_) which is run by a couple of smart grad students from Georgetown. They're usually pretty short (half hour or less), but you might find them an accessible entry point. Plus they have a great blog where they post very curious documents from Ottoman era archives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do racing bicycles have ultra thin tyres to make them faster, but the fastest motorbikes have very wide tyres?",
        "response": "Motorcycles have to have more tire touching the floor since they accelerate at a much faster pace than your legs. The more tire you have touching the floor, the less likely you'll lose traction. In addition, you want the lightest weights for bike so you expend the least amount of energy to power it, whereas the motorbike is powered by gasoline.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know that a planet 'cannot support life'?",
        "response": "Honestly, there could be a whole race of hydrogen-guzzling giants living on Jupiter. The only problem is that we don't know what hydrogen-breathing giants look like, how they affect their environment, what they're made up of, what they excrete, etc. Since we don't know any of that, there's really no way to look and a planet and *know* that there isn't life on it. But until we find a better way to check or learn a *lot* more about the universe, it's useless to go based on guesswork. Everything living that we've ever seen has developed on a planet that's not too hot, not too cold, with plenty of water and a rocky crust. So our best bet is just to look for more of that, because that way we've found something that we *know* could hold life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Do people say the Babyboomers screwed up the Economy? What did they do?",
        "response": "My understanding is that the problem is the large increase in births. It has skewed the population to a point where there will be too many older people e.g. pensioners, to support which would subsequently cause a large economic burden.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were some dirty tricks used by soldiers and armies in the Middle ages or Medieval/Classical periods?",
        "response": "Signifying something as a 'dirty trick' presupposes mutually-agreed upon standards of conduct in warfare that it would contravene, and for most of (European) history this has not *really* been the case. General principles (capture rather than kill nobility, for instance) may have been perceptible but usually those had an underlying layer of practicality (prisoners/hostages are more politically useful than corpses). You can find many examples throughout history of military subterfuge, but not much stuff that was roundly condemned as 'dirty.' Even those were usually isolated or unique events. If some 'secret trick' allowed a smaller army to regularly rout a larger one, regardless of circumstance... Would it really stay secret for long? As a side note, GoT's fighting and warfare owes much, much more to Errol Flynn and lord of the rings than to history. Don't put too much stock in it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Latin America the only place that seems free of Islamic extremism?",
        "response": "there's plenty of terrorism in south america, Google shining path or farc. hell any cartel violence against civilians is terrorism, ditto right wing death squads. as far as contemporary Islamist terrorism it is a relatively new phenomenon, middle eastern immigration to SA largely predates this, and SA countries largrly aren't involved in interventions in the Muslim world that invite terrorist blowback also it's overly simplistic and stupid to act like there is some overarching relationship between say ISIS in Europe and the uyghurs of China for instance",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many times has an alphabet been developed from scratch?",
        "response": "I can't really help you with the number of independently developed \"alphabets\", but I can show you [this](_URL_0_), and also add that \"alphabet\" isn't always a fitting description, as some written languages are organised differently (syllables, icons, etc). Also, you might wanna check over at /r/linguistics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are our keyboards Qwerty?",
        "response": "QWERTY keyboards were designed for typewriters, the design was made to avoid people from pressing two keys too quickly after one another to avoid the typewriter from getting jammed. QWERTY is what people got used to and now its what everyone uses. There's another type of keyboard that was designed to allow users to type as quickly as possible but its a lot harder for people to start using since pretty much is used to using QWERTY.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's wrong with the big pharmaceutical industry?",
        "response": "I was a clinical scientist in big pharma for years. I ran phase III human trials. It takes on average, testing of 100,000 new compounds to bring one to market. Of those 100,000, only 13 will make it to toxicology testing. 12 will fail. The expense is mind-boggling for all of this. On top of the drug development, the FDA has far more stringent standards than almost any other country. On top of this is the desperate need to make money. Big pharma had to compete with Apple, Ford, GE for your investment dollar. Mostly it's not individual buyers, but mutual funds. Big pharma is owned by the retirement plans of the USA. Because of the expense of research and the need to compete on the stock market, drugs are overpriced. (Some high tech drugs really DO cost a small fortune to produce) It's not because the companies are any more greedy than any other big business, they are owned by the American populace, but people like to create phantom \"evil owners\" and \"evil employees\" that work there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are we able to know of the existence of exoplanets and even categorize them as \"Earth-like\" when we barely have images of Pluto in our Solar System?",
        "response": "Its all about light wave frequency, when the planet moves in front of a star it is orbiting the light we see reflected off the surface of the plant gives off certain frequencies, which gives us an idea of its chemical make up. Also the relative position of the plant in its given system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did the number 666 become popularly known as the number of the beast, and was the year 666 significant at all?",
        "response": "_URL_0_ Here's a prior thread featuring /u/talondearg and /u/Astrogator. The short and sweet of it is that the number comes from the book of Revelations, where the reader is instructed to \"calculate the number of the beast, for it is a human number, and its number is 666 [or 616 in some manuscripts]\". This refers to the practice of Gematria, calculating numbers from the letters used to spell words. The most common explanation relies on transliterating the greek Neron Kaisar into Hebrew (NRWN QSR) - thus, the number refers to Emperor Nero. This works particularly well because N, \"nun\", is worth 50, so if you translate \"Nero Caesar\" from Latin, you get instead \"NRW QSR\", which adds up to 616, the other number present in some manuscripts. But as /u/talondearg goes into in the link, there are some problems with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we use metal spatulas on metal BBQs, when people tell you to not use meta kitchen tools on metal pans?",
        "response": "You don't use metal in pots and pans so you don't scratch the Teflon. Who cares if you scratch the grill.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can we \"observe\" the doppler effect on light?",
        "response": "Yes. We know the universe is expanding because most of the galaxies we see are slightly red-shifted, meaning they are moving away from us (as opposed to blue-shifted). Those closer to us are more red-shifted than those further away, meaning that the older the light is, the less fast they're moving away (or in other words, the rate at which the universe expands is accelerating).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would a body floating in space decay?",
        "response": "In a space suit: It would not decay, for the most part. Decay requires bacteria at the very least, and on earth it usually involves fungi and animals like maggots and beetles too.  There are some bacteria that have survived for quite some time on the outside of the International Space Station, so some bacteria in the human body might be able to survive and metabolize nutrients from the dead person in space for a time. Most likely though, the bacteria would die or enter a dormant state (called a spore) and wait until proper atmospheric requirements were met. Without a space suit: I don't know. I do know the physics here would be very odd, but I'm a medical lab scientist, not a physicist.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Japan was separated from their Axis allies by numerous Allied countries. How did they communicate with other Axis powers?",
        "response": "For the most part, they didn't. Top axis and allied leaders met and hammered out agreements at conferences. The Axis leaders often didn't even tell each other which countries they were going to invade, much less had joint strategy sessions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the crown as a symbol in kingship unique to Europe?",
        "response": "It certainly existed in Asia. In Nepal in particular, the kings wore a jewel and feather crown called a shreepech (clearly visible _URL_0_). The caveat here is the monarchy in Nepal was highly influenced by several hundred years of contact with British colonial rule in neighboring India. Outside of the monarch, the hereditary prime ministers of the Rana family wore similar crowns often posing with regalia intended to mimic european nobility.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do pets not get sick of eating the same meal everyday?",
        "response": "My dog gets sick of his food periodically and will eat only grudgingly after I make it clear he is not getting something better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do antidepressants (specifically bupropion/Wellbutrin) work?",
        "response": "Wellbutrin is a norepinephrine-dopamine reuptake inhibitor. Norepinephrine and Dopamine are both neurotransmitters that excite specific neurons in the brain to trigger specific pathways. The more neurotransmitter circulating, the more excited these pathways become. Your body has a natural way of recycling these neurotransmitters by using them or storing them in neighboring support cells (glial cells). A “reuptake inhibitor” functions to prevent these cells from removing the neurotransmitters in circulation. This way, they are present in higher concentration and longer duration. Dopamine plays a major role in reward-motivated behavior. The reward system is responsible for motivation, desire, pleasure, and much more. By maintaining circulating dopamine levels, the drug helps improve mood and provide a sense of motivation that counteracts depression.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the Germanic tribes originally come from?",
        "response": "How \"original\" are we talking about? Because originally everyone came from Africa. There's no way to answer this question without you specifying a timeframe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to the balloons I let go of as a kid?",
        "response": "The balloons, and I'm assuming you mean the floating variety, float because the volume of gas they displace is heavier than the weight of the balloon + volume of helium. As they rise up into the sky the atmosphere becomes a lot less dense and the pressure falls. This will result in the pressure on the inside of the balloon being higher than the pressure outside and the balloon will expand. Eventually it will expand beyond the point of failure and the balloon will explode.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do some smells penetrate their containers?",
        "response": "Smells are chemical molecules. These molecules are small, and they can get through some materials and around very complicated paths made by folding or zip-locking bags. You also have to worry about transferring the molecules onto the outside of the container.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "To travel long distances around the Earth, would it be faster to launch into orbit and then re-enter at your destination rather than flying in an airplane?",
        "response": "Yes, the term for this is suborbital flight. There are several proposals of commercializing it to transport passengers. Just a small detail, this is slightly slower than launching into orbit, that's why it comes back without completing a whole circle and why it's called \"suborbital\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "where do rivers start?",
        "response": "Technically, in the sky. Rainfall hits the ground in geographically delineate areas called 'catchment basins'. Basically these areas are divided by high ridges. All the rain falling on one side of a ridge may run down to the east, and all the rain falling on the other side to the west, for example. This rainfall follows countless small channels, streams and oversurface flows, until enough of it converges into a big enough channel to be defined as a 'headwater', which is the start of a river, usually high up in the hills or mountains. From there the river will flow downhill towards the ocean. Most headwaters (but not all) are narrow, steep, and fast flowing by comparison with the same river down by the ocean, where they usually grow placid and meandering on the lowlands.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are semi's not more streamlined?",
        "response": "In the US trucks used for long haul work usually are pretty streamlined. They need that large flat grille to suck air into the radiator during the summer, but the rest of the cab angles back. Some companies even put fins on the bottom and back of the trailers to disrupt vortex formation and lower drag. Trucks that do more local hauling don't usually go fast enough to warrant any aerodynamic improvement, so other concerns like cost, maintenance accessibility, and length determine the shape.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come Columbus never figured out that the Caribbean wasn’t actually India, as they spoke a different language and probably had different land and maybe looked different than the Indians.",
        "response": "_URL_0_  Columbus thinking that he landed in India is a myth",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some countries currencies so much more \"inflated\" than others? And vice versa. (1 dollar is about 100 Yen, for example)",
        "response": "They aren't inflated, their basic monetary unit is just much smaller than ours. It would be like the U.S. using the penny as the basic unit, which would turn the dollar into a 100 penny note.",
        "source": "sentence-transformers/eli5"
    }
]