[
    {
        "query": "How can stores like Menard's give away products (after rebate)?",
        "response": "Two things:   * Many people don't follow through with the rebate process (laziness, forget, etc.). That's why the rebate process exists - why not just make it an instant discount? Because if there's a process, many won't go through with it. That way on average, they can still make a profit on the item, even though on some consumers they lose money.    * Probably not in this case, but possibly loss leaders: Stores often are willing to sell some things at a loss, in order to get people to come in & then hopefully buy other things that they sell at a profit. Think turkeys at Thanksgiving, cheap french bread everyday,e tc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Che Guevara did",
        "response": "He helped Fidel Castro take over Cuba, was a brutal government leader responsible for many killings in the early days of the Cuban revolution, and then tried and failed to create revolutions in other countries like the Congo and Bolivia, where he was killed. Before he was a revolutionary, he was a medical student, and he rode a motorcycle all around South America.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How prevalent was homosexuality in 19th century armed forces?",
        "response": "A better question might be how prevalent homosexual *relationships* were in 19th century armed forces. The proportion of gay men will have been pretty much the same as the proportion among the general populace.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can I ensure that the diary that I keep will be a good primary source for historians in the future?",
        "response": "I can't speak for the physical side of things. But I can tell you as a historian who primarily uses primary sources for research it's rather difficult to ensure that your diary will be a valuable resource for future historians. Although I admit I find it funny as I often have similar thoughts.  Generally speaking, much of what is used as primary sources today is, to put it simply, junk or trash. For example, there is a very talented historian at Rice University named Tani Barlow that does a lot of research exploring the depiction of women in Chinese ads in the 20s. It's fascinating work but the majority of her work uses sources that most people at the time would have considered completely irrelevant or uninteresting. However, they are valuable windows into the cultural space of the time period she studies. So even if your current writing may seem useless or irrelevant to future historians it may in fact be useful. At the very least, preserving such things will certainly be interesting to your descendants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between Cloud computing and Fog computing?",
        "response": "From what I understand, cloud computing is when all the hard work and computation is done on some other system/network and then is sent through the internet or network in general to the client. Where as fog computing is where the services and computing is done at the \"edge\" of a network or on client end systems like access points which reduces latency. I don't really know for sure I just used the link below: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it surprising that Japan independently developed feudalism?",
        "response": "See also: * [AMA \"Feudalism Didn't Exist\" : The Social & Political World of Medieval Europe](_URL_1_) * [When historians say feudalism never existed, what do they mean?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are calories just calories? Is it the same if you get a calorie from a fizzy drink or a piece of fruit or a slice of potato or a bit of cheese?",
        "response": "A calorie is a physical measure of energy - specifically, the amount of energy needed to heat one metric mililitre of water by one degree Celsius. Energy in food intake is also measured in this way, though the terms kilocalorie and calorie are often used interchangably, which can cause confusion.  But yes, no matter where it comes from, one calorie always represents the exact same amount of energy. However, a difference you *can* make is that some foods will allow the energy that is within them to be absorbed more efficiently or more quickly, which can lead to varying results. (Edit courtesy of Neo6874: One calorie heats one millilitre by one degree Celsius. One kilocalorie heats one litre by one degree Celsius.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the order of operations have an deeper significance, or was it a convention that was simply agreed upon?",
        "response": "It is a convention but you could consider it to have deeper significance. [Addition, multiplying and exponents are all repeated applications of the former operation](_URL_0_). Multiplication is repeated addition (4×3= 4+4+4) and exponentials are repeated multiplication (4^3 =4×4×4).  You preform exponents before multiplication and multiplication before addition, essentially doing the highest order operation first as it consists of doing the lower order operations multiple times.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any organism that doesn't use ATP as the main \"energetic molecule\"? Is this a fact with no exceptions in biology?",
        "response": "ATP is universal today, but origin of life researchers think that other phosphate carriers may have been tested out in early metabolism. Acetyl-phosphate is a candidate phosphate carrier for primordial metabolism, for example. _URL_0_ Edited to add: also, the third phosphate bond in ATP is often called a \"high energy\" bond, but really it's near the middle of bond energies common in biological systems. That people call it high energy is a pet peeve of mine: like most things in evolution, this phosphate bond is \"high *enough* energy\". A stronger bond would be more challenging to build in the first place, and a weaker one would mean cells would have to carry and circulate a much larger (perhaps prohibitive) volume of energy currency. ATP therefore solves an important tradeoff, which is a typical task of evolution.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a hydrogen electron gets excited, will the orbital radius change instantly or as a function over time?",
        "response": "The notion of a radius at all is a problem with this description of an atom. To answer your precise question, the electron doesn't exist at an exact radius. By the Heisenberg uncertainty principle, you know that you can not confine the r position of an electron. The energy eigenstates are associated with probability distributions in space.  If you were to measure the r position of an electron you have collapsed it into an eigenstate of radial position from which it can deviate with time in a derivable manner. Until you have measured this radius, however, it is still in a superposition of many radii so talking about its movement in space is almost nonsensical because you don't know where it is until it is measured. I hope this sheds some light. The flaw in your question isn't in your thinking, it's in the Bohr model of the atom. All models have limitations and you have just hit a big one of this particular model. edit: apostrophes",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if diarrhea serves to flush toxins or bad stuff from your body, does taking an anti-diarrheal lock those toxins in, causing harm?",
        "response": "Technically yes, I guess? Your body removes a lot of trash through your gi tract, but generally after the first bout of diarrhea, if you haven't removed the problem, you aren't making it better. Cholera comes to mind in this example. From a resource perspective, diarrhea is expensive, and can kill you. It takes a ton of salt, and water; cholera kills you by the diarrhea dehydrating you. It's more productive to try to stop the diarrhea, and replace the salt water you've lost, than just let it keep going.  Other toxins like LPS/food poisoning is just irritating your gi tract, so the tract tries to remove it. It's a balancing act of risk.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do last names come from?",
        "response": "Depend. in Scandinavia men had the name of their father as surname (Leif Erikson mean Leif son of Erik) Last name could also come from profession (Potter, Baker, etc.) Can come from the city/town you come from (Chrétien de Troyes, 12th century poet who's known for the arthurian legends) can even be a nickname your ancestor had that became officially his surname. All these examples are only from European surname. I don't know enough about other regions such as asia and africa to say anything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If alcohol damages our livers, why does our alcohol tolerance increase?",
        "response": "The liver does have some specific cellular alcoho tolerance effects, but the liver is not the primary place that tolerance occurs. Keep in mind that alcohol is not a drug with acute cellular/neuronal action. It is readily absorbed throughout the body.  Tolerance to alcohol occurs at the molecular level at many places in the body. This involves lots of mechanisms including changing the activity of chanel protein production, interacting with membrane lipids, interacting with auxiliary proteins, modulation of membrane protein expression, and altering the spatial organization of membrane proteins. Also, we don't really understand how any of the mechanisms listed above specifically affect alcohol intoxication behaviorally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "GPS receivers used to be very expensive and bulky just a couple of years ago. How come it's now possible to not only fit them into phones, but we've also turned them into a standard feature even on the cheapest and smallest smartphones?",
        "response": "Mass production has resulted in the gps chips themselves getting tonnes cheaper to manufacture, but possibly most importantly to your question is that the gps chip itself has never been than costly. Standalone gps receivers are still pretty expensive mainly due to the other technology in them - they have to have screens, processors, MAPS, batteries and all the other bits and pieces that make up a gps receiver.  It's actually mainly all that other stuff getting cheaper that's had an effect on it, as I said gps chips themselves have never been very expensive",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any factual evidence for the Ottoman Slap?",
        "response": "Not a historian, but a musician here. Anyone who plays congas regularly for a number of years wind up with these kinds of hands; thick calluses like rock from heel to tip , and years of microfractures that thicken the bones as well. I studied with a guy who had hands like this, and just playing around felt like getting hit with a 2 x 4. I'm certain he could knock someone out with a slap, and provide ample concussion. Don't know about neck breaking: ask a martial artist?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does wind feel colder when you are wet?",
        "response": "Because as the wind blows, some of the water evaporates and is blown away. This water takes heat with it. Also evaporation in and of itself leads to cooling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are the earliest sunsets not on the same day as the winter solstice?",
        "response": "The solstice is the shortest day of the year, not the earliest sunrise of the year. Point of fact, it isn't even the earliest sunset of the year. The earliest sunrise may be around Dec. 5th and the earliest sunset is around the 9th-18th, but the days can still get shorter because the sunset is getting later and later at a faster rate than the sunset gets later and later. Here, have a [look](_URL_0_). edit - I misquoted the original question, but the explanation is still holds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our throats choke up when we feel sad or emotional about something?",
        "response": "When we get super emotional we actually send our body into \"fight or flight\" defense mode. The \"lump\" is just the glottis (the opening in the back of your throat that lets air in) expanding to let more air in so we can perform better. Since swallowing involves closing the glottis and closing the glottis requires us to work against the expanding muscles, we experience a \"lump\" or difficulty swallowing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some days I feel like I look ugly but some days I think I look really good looking for no logical reason? Is our brain playing a trick on us?",
        "response": "I don't think it's quite as drastic as the other commenter has suggested. That is a possibility, but it is more likely that it has to do with hormones. So many things come into play there including appropriate amount of sleep, eating habits, exercise (excercising releases endorfins that can improve personal opinion of one's self)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to predict the patterns of \"Clicks\" heard from an oven which is heating up from room temperature (with enough math)?",
        "response": "it's roughly equivalent to predicting earthquakes, but in addition to that, you'll have to take air circulation into consideration, which probably behaves turbulently at some point of time in heating. even if you develop a very precise model, it'll be so unstable that you might, with expensive computation, tell a click some seconds ahead (and mind you, that requires a precise description of the state of the oven to be observed in a lesser timeframe, which is probably a bigger problem than computation). telling when the clicks will occur over a period of say half an hour of pre-heating based on the state of before you turn on the heating is pretty much out of scope due to the instability of the calculations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I were to place a pile of sugar outside an ant colony would I be supercharging the colonies growth rate in anyway?",
        "response": "Developing ant larvae are fed primarily on protein, while the sugar resources are mostly for the adult workers. So, while carbon resources would in up the activity of workers, it wouldn't actually increase the development of new workers. One could argue that workers amped up on sugar will have more energy to go out and collect protein, which is certainly valid; there is good evidence that colonies given high quantities of protein or carbon will try to balance their ratio of intake. However, if there really isn't that much protein available in the foraging range of the colony (which varies with ant species and colony size), it doesn't matter how much sugar you give them, they still won't be able to develop an indefinite number of workers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do women stay with the men who beat them?",
        "response": "It's not like anyone walks into a relationship where they get beaten on the first debate. Physical abuse comes out after a gradual descent into shit. There's usually a bunch of emotional/psychological abuse leading up to it that slowly erodes their self-worth until they think they're responsible for or deserving of the physical violence. When you get to thinking that you're shit & nobody could ever actually love you, you'll put up with a lot of shit just so you won't be completely alone. ...and then there's the practical things. Some people just don't have the ability (or don't think they do) to get out of the situation and support themselves. Maybe they don't want to be homeless. Maybe they're afraid the abuser is going to come after them and make things worse. Maybe they're afraid of starving on the street. It's not a simple matter of a person just snapping one day & throwing punches.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do insurance companies gain profit?",
        "response": "By giving away less money than they charge. It's as simple as that. They charge you for the risk you wish to cover, and it's reasonably certain that over a long period you will spend more on insurance than you will ever receive in payouts. Obviously some people will go the other way, but they'll be in the minority. It's the same as gambling. They're betting you won't have an accident, and you're betting you will. In the end, the house (casino, bookmakers or insurance company) always win because they control the odds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In an episode of Seinfeld, Elaine gives out Jerry's NY phone number. It's KL52390. What's up with the letters and stuff?",
        "response": "In the old days phones had letters that went with the numbers. Here's a picture of one: _URL_0_ K and L are on the 5, so the number was 555-2390. Sadly, I know this because I'm from the old days before everyone had cell phones and dialers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't calories related to food weight? 1lb of broccoli is 154 calories, while 1 lb of ground beef is 798 calories.",
        "response": "Q: How many calories are in 1 lb of gravel? A: 0. Why? Because gravel is indigestible.  Calories are a measure of how much energy your body can extract from a given food. Not everything you put in your mouth is something your body can extract energy from. Vegetables, for instance, contain insoluable fiber, which is not broken down for energy.  It's still important, unlike gravel, but it nevertheless it's not used as fuel, so therefore contributes zero calories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did my oven safe PYREX glass shatter after cooling down?",
        "response": "Because pyrex no longer uses borosilicate glass. They use tempered soda lime glass instead. Go with arcuisine or something like that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people need to be unconscious when they sleep?",
        "response": "Sleep is generally not well understood, but what everyone agrees on is that sleep among other functions serves the conservation of energy during the night. Being conscious would take energy and wouldn't help much at night.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does snow melt around pebbles like this? [Example Pic in body]",
        "response": "Those appear to be bits of salt and gravel used as snowmelt.  The salt works by dissolving into the ice, lowering its melting point. The gravel increases traction by creating a rough surface to prevent slippage on ice, but it can also enhance melting by being a dark object that can absorb sunlight and warm up. The gravel may also have a layer of salt on it, further enhancing its melt potential.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the unit of viscosity and how is it measured?",
        "response": "The SI unit is the Poise, and it's measured by applying shear stress to the liquid. A typical viscometer has the liquid sandwiched between two concentric plates that the fluid sticks to, and measures the torque needed to turn one of them, then you calculate the viscosity from that. The plates can't be smooth, of course - the liquid needs to stick, not slide over them. There are different types of viscometer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do Micro Animals such as the Tardigrade actually look like what is shown in images of them?",
        "response": "Yes, that is what they look like. However, due to the fact that electron microscopes only capture black and white, the first picture was actually colorized by an artist.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the metal arms on weight racks at the gym not bend, especially when they're holding hundreds of pounds and sticking out horizontally?",
        "response": "Weights racks are designed to carry that weight, and few hundred pounds isn't much. Getting a rack to hold hundreds of pounds is fairly easy. Consider the fact that your average park bench can support 500 pounds (2x very heavy addults) without bending. Cheap metals are just that strong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Hitler receive salary?",
        "response": "Adolf Hitler made millions a year from the publication of Mein Kamph. When in power the Nazi Party created a huge demand for the book - for example each married couple were to be provided a copy paid for by the state at their wedding ceremony. Hitler would receive royalties from each one. Mein Kamph: Publish or Burn _URL_2_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it not possible to grow a baby outside of the mother's womb?",
        "response": "We could, and there’s research doing just that. Recently, scientists at the Children’s Hospital of Philadelphia engineered and demonstrated the feasibility of an artificial womb. This was in a lamb model, but a human version that could perhaps save very preterm babies isn’t very far fetched.    _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During WWII, were there any Allied units that fought in both Europe and the Pacific and if so do we know which they thought was worse in terms of living conditions, combat stress, e.t.c.?",
        "response": "Not a full answer, but no US infantry units served in both theaters.  It wasn't uncommon for USAAF crews to fly a complete tour in Europe and then transfer to the Pacific theater, but this was on a man per man basis, not entire units. A rather famous example of this would be Paul Tibbets who flew 43 combat missions with the Eight Air Force in Europe before returning stateside to help develop the B-29. He then commanded the 509th Composite Group which conducted the bombings of Hiroshima and Nagasaki.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The \"Elegant\" dishes that look like they are only 5 bites. How do people get full off of that?",
        "response": "They don't. But often meals that like are part of a several course meal. So you might be looking at the entree, but there may have been bread, an appetizer, soup, salad, entree, dessert to follow. Added together a 5 or 7 course meal with small portions spread over an hour or so can make you feel pretty full.  But, I'm with you. Fuck that noise---I don't want a 4 oz filet as my entree. I want a pound of dead cow at least.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the evidence against Nixon for the Watergate Scandal really so irrefutable that he likely would have been removed from office had there been an impeachment/trial?",
        "response": "Very likely. The articles of impeachment were not for the break-ins, they were for obstruction of justice, abuse of power, and contempt of congress. Whether or not he was involved with the initial break-ins, his interference with the investigation was in an official capacity. He demanded that the Attorney General fire the special prosecutor. Once his the tapes were released it clearly showed him to be involved in the conspiracy cover up from the beginning. In the end, impeachment is a political act. By the time that the articles of impeachment had come out of the judiciary committee it was clear that he had lost nearly all support in congress.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What keeps people from bleeding a lot in surgery?",
        "response": "The doctors! They are constantly clamping arteries and what-have-you in order to keep the blood where it belongs (ie - in you)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how celebrity actors get paid",
        "response": "Just to add to what others have said, even smaller name actors can earn residuals off of a film. Emo Philips, the comedian, talks about earning $.30 residual checks from the Screen Actors Guild for his not even 5 minute bit on the Weird Al film UHF.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the guy from sister wives afford to raise 18+ kids, 4 wives, multiple houses, cars, etc?",
        "response": "Kody is an advertising salesman which can mean he makes good money or no money, no idea. Depends on how good a salesman he is! He and all the other cast members are paid by the production company. The vacations they take on the show are also paid for by the production company.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does the phrase \"Head Over Heels\" even mean?",
        "response": "It is an expression used to denote that a person is overly affected by a circumstance or situation, typically regarding the emotion \"love\". It has been reported to have come about in the 13th/14th century, but was \"heels over head\" denoting how upside down or out of kilter the emotion of love makes one feel. Today we say head over heels (which, if you think about it, doesn't make much sense as that's our normal disposition anyway - head above and heels below) but it would be more accurate to describe that out of control feeling of falling in love as heels over head.  The use of the term in describing someone falling down evolved from the \"falling\" bit of falling heels over head in love, and also means being out of control of the circumstance of falling down. According to literary researchers, Herbert Lawrence's Contemplative Man, 1771 is the first known citation of 'head over heels': \"He gave [him] such a violent involuntary kick in the Face, as drove him Head over Heels.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "JFK said \"We choose to go to the moon in this decade and do the other things, not because they are easy, but because they are hard\". What exactly were these \"other things\" he mentioned?",
        "response": "Climb the highest mountain, fly across the Atlantic for the first time, and have Rice play Texas in football. [Transcript](_URL_0_) [Video](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "AMA - Bronze Age Archaeology and History",
        "response": "So the Sea Peoples... There are all kinds of theories about just who they were or where they came from. Is there any particular theory that you find to be most plausible? Are there any active theories out there that you think we just need to stop giving credence to?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does GMail's undo a sent email feature work?",
        "response": "they send the mail not instantly, they hold it back for a moment. if you decide not to send the mail it had never left your mailbox.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Mein Kampf is atrociously written and a struggle to get through. Mussolini claimed to have never finished it. Was this a reason why the appeasers underestimated Hitler's ambitions?",
        "response": "What's the basis for the assertion that it's badly written and a struggle to get through?  This seems like a claim that anyone can make about any book they don't like, from “Das Kapital” to “On the Origin of Species” to “Untergang des Abendlandes”. Of course we don't know whether anyone actually finished it, but the book was a bestseller in the Germany in the '30's.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does Soichiro Honda, the founder of Honda, have any relationship to the historical Honda clan of Feudal Japan?",
        "response": "Judging by the kanji, or Chinese characters, used to compose the names there appears to be no genealogical relation. While homophones, the names are different; Soichiro's last name is 本田, characters for origin and field, while the feudal clan was 本多, characters for origin and many. Soichiro Honda's name seems to be from the Meiji Restoration when former serfs created or were given surnames based on locale. Please remove this post if it's insufficient.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we rely on delegates to determine who the party's candidate will be? Why isn't it determined by the popular vote?",
        "response": "The political parties are just private organizations. They can choose whomever they want to back. They use the primary system because it gives them insight into who the populace favors, as well as helps them build buzz for their candidates. But fundamentally they're just groups of citizens who choose to put money behind a particular nominee. Note that anyone can get on the presidential ballot as long as they fulfill a state's requirements to do so. No need to have a party affiliation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Core difference between factions of Christianity.",
        "response": "Basic theological difference between Catholicism and main stream Protestantism (as started by Martin Luther) **Salvation** a) Catholics believe it requires both faith and good works. b) Protestants believe it requires faith alone. (Sola fides) **Religious Authority** a) Catholics believe it resides in scripture and in scared tradition--events and teaching that occur and come to be known after the events of scripture. b) Protestants believe it resides in scripture alone. (Sola scriptora) **Afterlife** a) Catholics believe in three realms, Heaven, Purgatory and Hell. b) Protestants believe in two, Heaven and Hell. There are, of course, many others, but these are the, dare I say, fundamental differences.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many pro-weed citizens (or redditors) want medical marijuana as a stepping stone for legalization?",
        "response": "Marijuana is a legitimate form of treatment for some medical conditions. I'm at high risk for glaucoma, and it's very likely I would eventually be prescribed medical marijuana as a treatment. Marijuana has also been shown to be a very safe anti-nausea medication, as well, which makes it good for countering the side effects of chemotherapy. I also remember hearing an NPR piece recently about a rare seizure disorder that affects children which has responded well to marijuana. Despite how totally counterintuitive it is to prescribe marijuana to children.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the majority of taxis yellow?",
        "response": "[Yellow is the easiest color to see from far away.](_URL_1_) Another fun fact: \"Taxi\" is short for \"[taxicab](_URL_2_),\" which is short for \"[taximeter](_URL_0_) [cabriolet](_URL_3_).\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are \"pin prick\" attacks often dismissed as unlikely to transmit diseases when we are so often and well warned of the dangers of sharing needles?",
        "response": "Even healthcare workers who get deep needle sticks from infected patients are rarely infected. Sharing needles is more dangerous in part because you are not doing it just once. If you get jabbed once and the odds are 1/200, chances are good you will be ok. Jab yourself several time a day for a year because you are an addict and your luck will likely run out. Not to mention that being in poor health and without follow up treatment as an addict probably makes you more susceptible to infection by some things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are underwater tunnel highways, like the Lincoln and Holland Tunnel, built?",
        "response": "In a variety of ways, depending on the exact circumstances. If the geology and cost permits it, they'll just tunnel through the rock under the water, and then seal the tunnel walls with concrete or something to prevent leaks. Sometimes, prefabricated tunnel sections are built on land, then put on a barge, taken to the appropriate spot and submerged. That's how they built the trans-bay tube for San Francisco's BART system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Even though Hispanics and Latinos are also descendants of Europeans, why are they treated and are considered different from Non-Hispanics whites?",
        "response": "You do know that there are plenty of white hispanics and latinos, right? By the terms very definition, a Spaniard from Spain proper is hispanic, and a Romanian is latino. The racism wasn't against the hispanic or latin part (OK, maybe a little, some didn't like the Spaniards/Italians/etc. either) but against the native that *some* new world hispanics/latinos had.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is wasting water bad for the environment?",
        "response": "Water which has been purified for our use required energy to prepare. Making more will require the use of more energy which these days is typically generated by burning fossil fuels. So while the water itself is recyclable and renewable the energy used to do so is not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people build programs inside of Minecraft?",
        "response": "Early computers were basically a bunch of switches that were either ON or OFF. By arranging some amount of switches ON, you would store that information. In MineCraft, you can build circuits using RedStone -- a powder which you can form lines of, that carry power from a RedStone Torch, or some form of trigger (pressure plate, switch, etc) for a certain distance, and can be used to trigger effects like pistons, doors, explosives, etc. What people do to build a computer in MineCraft is, they have a bunch of switches which they can set either ON or OFF, like an early computer. A lot ([a LOT!!!](_URL_0_)) of RedStone goes through a bunch of Logic Gates (I'll explain those in the next comment for formatting) and ends up doing whatever the creator wants them to do, such as turning on a bunch of lights (like pixels on your computer screen) to make an image.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much does the airplane fuel that is burned extra when I'ｍ carrying overweight luggage cost?",
        "response": "Nothing. The plane takes off full regardless of how much passenger bags there are. The extra space is sold to mail and cargo companies. You pay for overweight bags to make up for space they could have sold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During the Emergency Broadcast Systems \"This is only a test\" that we all hear on our tv's and radios from time to time, is there an actual purpose for those loud, buzzing tones?",
        "response": "Yes, to get your attention. They are distinct and annoying so will be more easily noticed if you weren't already paying attention to the broadcast.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What am I seeing when I look at fire?",
        "response": "You are seeing soot that is hot enough that it is less dense than the air around it and therefore rises through it. The makeup of that soot changes depending on what you are burning, which is why some things burn different colors. The reason something burns different colors has to do with how many energy levels the electron falls when it return from the excited state which was caused by the heat. So yes, you are seeing photons, but explaining it that way is about as good as saying that you're seeing light. It's would be worse than telling someone that plants make food from the sun and not explaining anything passed that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the noise I hear when I shut my eyes tightly?",
        "response": "And now every person reading the title has shut their eyes tight to see if it makes the noise...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much does temperature ACTUALLY matter when washing dishes?",
        "response": "My belief for hot/warm temperatures is that they were better able to get the fats and other hardened stuff to a softer and more liquidy state, thus being easier to scrub off.  I'm kinda wary about the killing bacteria claim on having hot temperatures, as there are plenty of bacteria in our environment, and a soap wash of dishes and washing hands before eating would be sufficient. Moreover, hot/warm temperatures increase their propagation, so if you were using hot water to primarily disinfect, I would say that probably wouldn't work too well. So to answer your question, whatever feels good.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a mushroom cloud, and what causes one to form?",
        "response": "Hot air rises. As it rises, it expands, and cools. Eventually it reaches a height where its density is similar to the surrounding air, so it no longer rises...however, more stuff is piling in behind it, so it spreads out sideways. Often the smoke is actually more dense than the surrounding air once it's cooled - perhaps it has a lot of ash in it, as in the case of a volcanic cloud. That's when it starts to turn down at the edges and curl under, caught up in the up-rushing air of the \"stem\". The [Wikipedia article](_URL_0_) has a lot more information.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any good evidence showing that fish experience suffering?",
        "response": "Define suffering. You're asking a somewhat loaded question. Fish can experience nociceptive stimuli. It's an open question. If you really want to know the answer, at least google \"pain in fish\" because there's a really nice layperson article on this on wikipedia. [Here, I'll link it for you.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is glycogen stored randomly throughout the liver or is it pretty much in every liver cell?",
        "response": "This all sounds VERY weird and the experiment should not be associated with glycogen whatsoever. once you put the liver into water, the electrolyte balance is so messed up that it will stop all cell functions. ATP is needed for glycogen breakdown and all ATP production has stopped. there is no way you are measuring glucose from glycogen breakdown. what you are most likely seeing is glucose (and a bunch of other minerals) rushing out of the cells due to the liver being placed in a HYPOtonic environment. no one saw glycogen breakdown. most likely your liver chunk has much less glucose to start with.  but to answer your question, glycogen should be stored relatively evenly in hepatocytes assuming a healthy liver and no hypertension. this may be effected if your piece of liver had cirrhosis or damage to it. was it lighter in color, more firm feeling, or had small nodules?  edit: just for my curiosity, is this a high school or university class your taking?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I am allergic to eggs. Why am I not allergic to chicken?",
        "response": "The chemicals in an egg are not the same as the chemicals in a chicken.  The egg, and particularly the egg white, is loaded with a big amount of free proteins that have a job to build a new chicken. Most allergies are reactions to these proteins.  The chicken had used up those proteins to build its tissues long ago before it hatched and while its body was developing in the egg, and they're not concentrated in its flesh any more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes rainbows to always be in the same color sequence? Can it be changed?",
        "response": "No, the order can't be changed. Here's why.  Imagine 7 race cars speeding down a straight track. Each car has a different color: red, orange, yellow, green, blue, indigo or violet. While all of the cars have the same speed, each car has a different power-train. The indigo car has the strongest power-train; the red car has the weakest.  As long as the cars are traveling in a straight line, their exact speeds cause them to travel as a tight, single unit. (So tight, in fact, that all 7 cars blend into a single, white color!)  But then the cars hit a spot in the track that is covered in tar. The tar slows down the cars, but each at a differing rate. The red car with the weakest power-train is slowed the most while the indigo car is slowed the least. The other cars spreading out in between, each according to the car's power-train.  Now the tight, white blur of cars appears as a continuum of colored cars, spread out in a specific order, determined by how much power or energy each car has.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is your nose and forehead (generally) a lot more OILIER than other parts of your body?",
        "response": "Two reasons.  1. It's where we keep our stuff. A chapped face means you can't effectively see, eat, breathe, whatever. The sebaceous oils help provide a bit of protection against the elements.  2. As we're social animals, our faces require more lubrication to do all the subtle facial gestures we do to convey emotion. By having more sebaceous glands in the 'T-zone', it can (via gravity) keep our whole face flexible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the words \"how come\" used to ask why?",
        "response": "It is a shortened form of \"**how** did that **come** about?\" Just like when you ask *what's up*, you mean \"what is up (new) with you?\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I was holding a compass on the moon, in what direction would it point?",
        "response": "For any real compass, it would do nothing as the moon has no magnetic field and nothing else would be strong enough to move it. with an ultra compass of no friction, it may move due to suns particles so that it would point towards/ away from the sun (i dont feel like figuring out which). Your body may have enough electric field so that it always pointed towards you, but then holding it in your hand would ruin that effect. the earths magnetic field would not be strong enough to be detected out there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When is it legal for a comedy show to mock a company while using the company's real name and when is it not?",
        "response": "Companies can sue for defamation if they feel that the joke makes false claims about their product. Most large companies don't actually do this [because it's horrible PR](_URL_0_), but many comedians and shows would rather not take the risk.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes an incandescent lightbulb to glow? What determines the frequencies of light that it gives off?",
        "response": "The electrons passing through the tungsten filament collide with tungsten atoms, depositing their kinetic energy into thermal energy. The tungsten filament heats up to ~2000-3000K from these collisions, and hence radiates like a black body of this temperature (to first order). Edit: It's probably also worth mentioning that at these temperatures, most of the light emitted by the filament is infrared radiation, which is completely invisible to our eyes. Most of this infrared light is absorbed by the glass, causing it to heat up. The bulb gets quite hot, as you may know from your personal experience, but not nearly as hot as the filament is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does depression make it so hard to get out of bed, clean my room, make good meals, etc.?",
        "response": "To give it in an actual eli5: depression not only makes you sad but also makes your body feel weak. Your brain doesn't make enough 'happy pods' so that makes you sad and when you are sad your body says \"well I don't want to do this, I want to lay in bed where I feel safe and maybe I'll feel better that way\" almost like when you get sick and your bodies natural response is to sleep it off for a while.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we stop enjoying music if we listen to it too much?",
        "response": "The same reason we murder our spouses, familiarity breeds contempt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do google/microsoft/firefox care if I use their browser or not?",
        "response": "Ad revenue. Firefox gets millions of dollars a year from Google for using their search engine for the Firefox start page and as the default search bar at the top right. Google increases it's own revenue by doing the same on Chrome, and Microsoft is pushing IE more now that they have Bing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the current relations with the U.S. and Bosnia-Herzegovina?",
        "response": "Still good. Its like friends who went to high school together and are going to different colleges so they mostly chat over Facebook and maybe see one another on spring breaks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does first past the post voting work, and what other voting methods are there?",
        "response": "In First Past The Post voting, for every election, each constituency elects exactly one representative for some body. It literally becomes a winner-takes-all thing for each kind of election. For instance if you live in a State that has a 30 seat parliament, then there would be 30 districts and in each district, one seat for that parliament would be up for grabs. The typical system used in Europe (bar the UK which is also First Past the Post), is proportional representation.  In proportional representation you use bigger voting districts which each elect a larger number of people to some body. For instance, in that same state as earlier there may be only 5 districts where each district elects 6 people. In such a district then, if for instance Party A gets 50% of the vote, party B gets 33% of the vote and party C gets 16% of the vote, then the seats in that parliament for that district would got to: Party A: 3 seats, party B: 2 seats and party C : 1 seat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there so many abandoned cars in the woods?",
        "response": "Drive car into woods, file a stolen vehicle report, collect insurance money. same reason they wind up in water bodies as well.  Insurance fraud",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do you date water?",
        "response": "> The scientists analyzed water they found 2 miles deep. They focused on noble gases such as helium, neon, argon and xenon. Past studies analyzing bubbles of air trapped within ancient rocks found that these rare gases could occur in distinct ratios linked with certain eras of Earth's history. As such, by analyzing the ratios of noble gases seen in this water, the researchers could deduce the age of the water. Also: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How close can a planet like earth be to a another earth sized planet?",
        "response": "If you are fine with bound rotation (they appear in the same place in the sky all the time), then the orbital dynamics discussed by /u/dukesdj are not an issue, and you just have to keep them outside the Roche limit for liquid bodies - a few times the radius. At a (center to center) separation of 5 times the radius the planet occupies about 3% of the visible sky. It would be ~30% larger than Jupiter in [this video](_URL_0_) - very impressive. Without bound rotation, tidal gravity will change the orbits in some way (depending on the rotation) - the system won't be stable over long timescales.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we discern useful information from photos of deep space?",
        "response": "This is a pretty massive question, but broadly speaking, the two things you can get without any significant spatial detail are: -Flux. How much energy is the source putting out? How does this compare to theoretical predictions for what you're looking at? You can usually measure this just from something like number of photons recorded by a CCD detector. Measuring fluxes at different specific energies or different wavebands can be useful for things like synchrotron sources that emit across the entire electromagnetic spectrum. -Spectrum. What do you see when you disperse the light from the source through a [diffraction grating](_URL_0_) or something else that gives spectral information? What emission or absorption lines are present? There are a zillion diagnostics for just about any physical properties you can think of, based on both line emission and on continuum emission.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do you text in Chinese?",
        "response": "Pinyin and knowing the tones.  Chinese has a writing script based on roman alphabet which is what kids and beginners use when first learning the language. This is called pinyin. This is basically the phonetic transcription of the language.  There are then 4 corresponding tones in Chinese. Flat (1), Rising (2), Falling-Rising (3) and Falling (4).  The word 'train-station' in Mandarin is huǒchēzhàn. So you type it out like that but add the tones by adding a number after the corresponding character. (But not every character has a tone.) So huǒchēzhàn would be huo3che1zhan4 and this would type out as 火车站",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does some glassware have an irridescent sheen to it when you hold it up to the light at certain angles?",
        "response": "It's probably depression glass. Carnival glass is older than Depression glass. It is “colored, pressed glass with surface iridescence fired on, made in America between 1900 – 1925.” (This is the definition Marion Hartung gives in her “First Book of Carnival Glass” 1960. Hartung is to Carnival what Weatherman is to Depression, and her books are known as the definitive reference works for Carnival glass pattern identification.) Making Carnival glass was a two step process. First, the glass was pressed in the molds. After it was done, metallic salts were sprayed onto the pieces and they were re-fired, resulting in the iridescent finish. Different effects were achieved by varying the color of the underlying glass and the combination of metallic elements. _URL_0_ So pretty much chemicals were added to the firing process of glass for the cool look.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come both nuclear fusion and fission release energy when they are doing the opposite thing?",
        "response": "It has to do with nuclear binding energy, which is the energy you'd need to feed into an atomic nucleus in order to separate all the protons and neutrons from each other. It's kind of like the potential energy of the nucleus. Nuclear binding energy is largest in iron, and is lower in both lighter and heavier elements. This means that, if you fuse atoms lighter than iron, you'll get a product with a higher energy requirement to break apart the nucleus. But since energy is conserved, extra energy is released that balances out the difference in binding energies between the source atoms, and the product. If you go in the other direction, splitting apart elements heavier than iron results in products that have a combined binding energy that is higher than the starting atom, and so once again, energy is released. Conversely, fusing elements heavier than iron, of splitting apart ligher elements, both *consume* energy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can tornadoes only get so big?",
        "response": "Tornadoes have a life cycle, whereby the RFD (Rear Flank Downdraft), an area of air descending at rapid pace, completely wraps around the tornado's vortex and cuts off it's air supply, and weakens it's vortex and ends the cycle. In order for tornadoes to grow in size they require a continual warm air supply. When it inevitably gets cut off, the size of the vortex will diminish.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sticky saliva after a workout or run.",
        "response": "Disclaimer: I'm not a specialist Saliva is composed of some parts mucus and some parts water. If you're dehydrated, there's less water and more mucus. The difference in consistency is the stickiness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it still solicitation for sex if I ask a hooker to make me a sandwich for what ever she charges then we both consent to have sex afterwards?",
        "response": "I am fairly sure this is how a lot of escort services work without getting into too much trouble. You pay for the \"date\" and if sex happens, well that's between two consenting adults! I think you may need an actual lawyer to answer this question as it is probably incredibly complex and would vary based on states/countries.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "East and West Pakistan; why on earth did the British think this was a sensible idea?",
        "response": "A similar question was answered by /u/jar2010 _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Native Americans ever attempt to discover lands out west?",
        "response": "_URL_0_ /u/eternalkerri posted several trade maps in an older thread, that showed how Native Americans had trade routes from coast to coast, prior to European contact. So tribes clearly had indirect (and some direct) contact with tribes far away, through trade. One key is that moving to a different area meant massive changes in lifestyle, which is why many tribes suffered terribly when they were placed on reservations far from home.  Would the average Cherokee in the Carolina have known a lot about the West Coast? Probably not, any more than a French peasant in 1300 would have known a lot about the Russian Steppes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there an effect the moon has on the atmosphere similar to the effect it has on the ocean by creating the tides?",
        "response": "These comments are a bit misleading. The atmospheric tide caused by the sun is overwhelmingly due to thermal tides, much unlike the gravitational tides caused by the moon and to a lesser extent, the sun. The moon's (and the sun's) gravity has little to do with atmospheric tides.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm in a bad mood. Physiologically speaking, what's going on? Are there well-understood neuro-biological factors keeping me from enjoying my work? Is there a theory about the evolutionary benefits of being surly?",
        "response": "First: your question and subquestions are all buzzwords and things that don't belong. Evolutionarily whatever is not required. Physiologically is pretty hard to answer (individual differences). Neuro-biological blah blahs.  You're in a bad mood: that's emotion. There is a wealth of knowledge on emotion from psych, neuro and cognition studies. We need to firm up your question: * You're presuming that mood is aggregate chemical reactions * Re: Outlook: you mean someone who's just kind of a dick and always grumpy vs. someone who is often cheerful and oblivious? I don't think there is a way to set up a study to follow \"the grumps\" and \"the happies\" for a longitudinal study... What is it exactly that you want to know about mood/emotion?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Alcohol companies are funding anti-marijuana campaigns. How is this not illegal, as they are technically paying off to have the competition go away, thus creating a monopoly?",
        "response": "You're misusing the word \"monopoly.\" The alcohol companies don't have a monopoly on mind-altering substances any more than car companies have a monopoly on wheeled transport. They want to keep another substance from possibly taking away customers and are happily paying to do so, but its no more or less illegal than pot growers funding campaigns about the hazards of booze if they wanted to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does things like, pulling a hair, popping a pimple, getting a hard massage not feel bad?",
        "response": "I've found a three things painful on occasions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is happening neurologically when it takes somebody several moments to recall or remember something?",
        "response": "I bet there will be a good attempt at an ELI5 answer, but I doubt there is good one for this. Current accepted science does not have a satisfactory answer for most questions regarding the brain and consciousness... I know many of the reddit core population aren't into abstraction and ambiguity but it seems that's very much what our current level of understanding requires a bit of.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people explicitly post pictures doing drugs and not get prosecuted?",
        "response": "How do you prove in court that the white powder was cocaine? Answer: you generally can't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we detect radiation from black hole if it absorbs everything?",
        "response": "The idea that black holes just suck everything in is misleading. Plenty of black holes have huge clouds around them, if these heat up because the black hole is pulling them in, they can release energy. Matter can be pulled in by a black hole, but so long as it does not pass the event horizon it can still be observed. So, like always, the information we gather comes from things outside of the black hole's event horizon, and to say the black hole 'gave off' radiation is a tad imprecise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How strong is the electric current in Earth's core that produces Earth's magnetic field?",
        "response": "[Here](_URL_0_) is a discussion on this topic, the first comment used the formula for a current loop and came up with a value of around 10^8 amps. The comments note that this uses the field strength at the surface when it should be at the core, so more like 10^11 amps.  I’m not really sure how valid of an estimation this is, as I understand it dynamo theory says the liquid iron motion itself is what causes the field, not the current through the liquid. So we’d be looking for equations that relate the motion of liquid to field strength as opposed to equations for current. Would think that also kinda throws out the concept of current flow. Could be way off on that though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is happening when we blush?",
        "response": "Your cheeks are turning red. B'dum, tish. It's the blood vessels in your face dilating in the same way that they do when you're hot, which is why you 'feel hot' when you blush - you're experiencing the same sensations due to the reactions of your body, and vasodilation carries body heat to the skin. It's essentially similar to a fight-or-flight response. You're in a situation where you feel a little uncomfortable, and your body is reacting by increasing blood flow so that you can respond appropriately.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is every device showing a low-pass characteristic?",
        "response": "Keep in mind that, when discussing realizability, the literature often assumes 'perfect' components, i.e. components which act exactly like their mathematical models. For example an ideal op amp has infinite voltage gain, infinite input impedance, zero output impedance and so on, al of which are impossible to achieve with a real component.  Therefore it is not possible to build a physical circuit that is equivalent to that transfer function 'on the edge'.  In practice, if nothing else, parasitic capacitance is going to limit your achievable bandwidth, even if the 'device' under consideration is just a piece of wire.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a person's own stem cells be used on them to treat a genetic disease when the defective gene is present in the extracted stem cells too?",
        "response": "One of the upsides to autologous transplantation is the ability to avoid immune rejection as well as complicated ethical and proprietary issues. The challenge here lies in, as you point out yourself, that the cells still contain the faulty genetics. However, we are getting increasingly better at [gene therapy](_URL_1_), and although we still have quite a ways to go before we master tools such as Cas9 (CRISPR) or viral delivery, the consensus seems to that we’ll eventually be able to correct most genetic diseases, and ‘fix’ the cells before reintroducing them to the body. You might be interested in reading about [induced pluripotent stem cells](_URL_0_). While challenges still remain, including fitness of cell/mitochondria and fully understanding and mastering the dynamic stem cell hirearchy, it's definitely an interesting field.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when our brains \"zone out\"",
        "response": "A special collection of brain regions becomes active to focus our attention inward - this collection is called the default mode network (DMN). Meanwhile, other brain areas, used to focus on things happening around you, become less active. The DMN has essentially taken over. Source: I teach biopsychology and just covered the DMN today in class.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are \"serving sizes\" not meaningful when they can be?",
        "response": "Serving sizes are a psychological trick that advertisers use in order to make things appear healthier than they actually are. The serving size can be set to anything they wish, be it a 28 gram handful of nuts or a half a cookie, but they have to represent the nutritional information accurately. So they make odd serving sizes, show that they have low calorie/sugar/fat content, and the consumer doesn't stop to think about the tiny serving size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't the Japanese government just shutdown the Fukushima nuclear plant?",
        "response": "If you mean shutting it down to prevent any further radioactive material to leak out. That won't work. Shutting down the nuclear plant will not suddenly make the radioactive material inside become not radioactive. It will still be radioactive and it will still leak out of the cracks. I am not sure if it is the radioactive waste that is leaking out or the actual radioactive material they use in the reaction though. Either way I am sure they did shut it down.  Imagine your car has a leak in the gas tank. If there is a hole in the tank, shutting down your car won't prevent your gas from leaking out. The hole is still there, the gasoline is still there so it will leak out.  Anyone correct me if I am wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If microwaves excite water molecules why is my bowl hot and my soup cold?",
        "response": "Because you are using a melamine bowl NOT appropriate for a microwave. Melamine is a very strong absorber of microwaves. Not only does it heat up quickly, it can reduce the intensity of the microwaves that make it into the soup.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do shower curtains attack?",
        "response": "I'm going to take a stab and say that the egress of one person starts a circulation airflow and the warm shower air is flowing upward and drawing cool air from the rest of the bathroom in under the shower curtain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I've heard Islam and the Arab Caliphates were heavily influenced by Persian culture and traditions. Why is that and what are some examples?",
        "response": "Persians dramatically outnumbered Arabs. They were vastly wealthier, had a tremendously larger cultural tradition, including literacy, and they were more urban and sophisticated. The Umayyads tried hard to keep the Arabs ruling the Near East segregated from local populations in order to maintain Arab cultural unity, but in the far-flung areas of Khorasan (what is today Uzbekistan) this proved impossible, and Arabs and Persians mingled a great deal. The Persians had more wealth and culture, so they tended to make the Arabs more Persian than the converse. A good example of this is when al-Mansour built Baghdad in the 760s. The city was arranged in such a way as to conform to Persian obsessions with astrology, and when Mansour was installed, he had it done in the manner of a Persian king.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Electroshock therapy",
        "response": "It's been while since I heard about it in the class, but I believe it \"reboots\" the neural connection by synchronizing it. When the shock goes through the brain, it essentially activates and depolarizes the neurons. When all the neurons are depolarized at the same time, all of them go through the hyperpolarized state where no impulses can be initiated. Then all the neurons have the chance to start working at the same time. But that's only one theory, and I'm not even sure if that has any credibility. Another theory is that after it hyperpolarizes all the neurons the neuron to neuron communication gets somehow reconnected, much like the way Ketamine does (read up on Ketamine and treatment of depression).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, with our current technology, is it still difficult to predict upcoming storms (in this cases snow) and their intensity?",
        "response": "There was an excellent AskScience thread a few weeks ago that answered the broader question of \"Why can't we predict weather accurately?\".  Link: _URL_0_ Essentially the answer is that the sheer number of variables is so great and the computational power and information required so vast that current models and methods are nowhere near being capable or accurate enough to give good localised, relevant (viz. time) information.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is 'shale oil', and how is it different than other types of oil?",
        "response": "Oil that's found today is found in certain types of special rock formations. It's easy to get oil out of sand because oil and sand are still a liquid so a filter separates them. However, some oil is in shale which is more like a rock sponge. Unlike a sponge you can't squeeze it to get the liquid out.  So to get the oil out you need to break all the tiny spaces in the shale to create one big hole that allows a large amount of liquid oil to flow.  The oil in shale was mostly discovered long, long ago, but no one could get to the oil in ways that cost less than the oil (drilling an oil well is very expensive).  Recently, we got better at angled drilling and can drill one well and extend holes in pinwheels away from the center and use a liquid to fracture an enormous amount of the shale around the well, which releases the oil trapped in it and allows it to be collected.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Otto von Bismarck famously anticipated that the next great European war would be the result of some 'damned foolish thing in the Balkans'. Who were the opposing forces that made such a conflict appear inevitable? Is there any consensus for why the region has so long been a powderkeg?",
        "response": "Interesting question. While we wait for someone to take on the task of plumbing its depths, you may find the discussion in these past questions helpful: 2. [How did the Balkans become the region of Europe most prone to ethnic conflict? Did either the Austro-Hungarian Empire \\(and predecessor states\\) or the Ottoman Empire have significant influence in this?](_URL_4_). /u/commiespaceinvader's answer isn't hugely focused on WWI in particular, but is incredibly in depth and relevant.  3. [This excellent AMA, focused broadly on the history of the Balkans, has some relevant information as well.](_URL_4_) 4. [Why was WWI considered \"inevitable\"?](_URL_4_) 5. [To what extent did ethnic and nationalist tensions in the Balkans contribute to the outbreak of WWI?](_URL_4_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can magnets be used to model atoms and the strong nuclear force?",
        "response": "Not as simply as that. One of the ways that the strong force is modeled is called lattice quantum chromodynamics, where quarks are placed on the vertices of a digital lattice and the interactions between them are calculated with a computer. It is possible to set up a real-world system of atoms trapped in an array of electromagnetic traps, created with clever optics at very low temperatures. Depending on how this trap is designed, the neighboring atoms interact with each other in different ways, and it may be possible get this lattice of atoms to behave like a lattice of quarks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly goes on in my TV screen when I am regulating brightness, sharpness, contrast etc.?",
        "response": "The terms are actually not what you think they would be:    Brightness is the max brightness for white, it affects highlights.   Contrast is the min brightness for black, it affects shadows.   Sharpness deepens black-ish pixels and brightens white pixels (still dependent on the max/min values) to falsely mimic actual sharpness. Actual sharpness has actual contrast, the difference between white and black.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are antibiotics and why is it a bad thing when cows are raised with them.",
        "response": "Antibiotics are medications which consist of chemicals that interfere with a bacteria’s metabolism and kill them. However, bacteria are living things and as such, they evolve. When you take too many antibiotics for no reason, you’re putting them in an environment that they will try to adapt to, becoming resistant. The problem with feeding them to livestock we eat is that we are exposing ourselves to more and more antibiotics, which allows bacteria to evolve. A channel on YouTube called Kurtzgesagt made an excellent video about these “[superbugs](_URL_0_)”, and I highly recommend you check it out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I had a monopole magnet and placed it on a table, will it have strong attraction to the earth's magnetic field that it will \"fly\" to the opposite pole?",
        "response": "The Earth's magnetic field lines don't have \"poles\" (ends). The form loops. The monopole would go around and around, continually absorbing energy from the Earth's field. The longevity of the galactic magnetic field (hundreds of millions of years) puts a strong limit on the cosmological monopole density. See page 28 of [this](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't car manufacturers design vehicles which detect if someone is trapped inside when there is already tech that can tell if my seatbelt is unbuckled?",
        "response": "The tech that tells you your belt is unbuckled is nothing more than a piece of plastic that gets pushed by the tip of your belt clasp when you insert it. Tech to determine if someone was trapped in a wrecked vehicle would be prohibitively expensive. Probably so much so that no one would buy the vehicle it was installed on. Also there's the issue of what tech would rescue crews use to read the cars tech, then you'd open a can of worms of standards and protocols.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don’t all water-soluble gases dissolve in ocean water?",
        "response": "To answer the broadest question, all water soluble gasses do dissolve in ocean water. To the secondary question: we do have seas of carbonic acid. Check out [this link](_URL_0_). The calculations start on page five, and they should answer your questions. If that’s no good, reply and I’ll get back to you when I wake up?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you sterilize meat using a vacuum?",
        "response": "to my knowledge space won't kill bacteria/microbial life, but it will in most instances merely prohibit or inhibit growth. As bacteria can often survive dormant in a space vacuum. Radiation in space however may influence or kill some microbial life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Post-Traumatic Stress Disorder",
        "response": "PTSD is basically just bad memories on steroids. A person experienced an event so disturbing and shocking that they cannot forget it no matter how hard they try, causing them to have extreme cases of anxiety and panic attacks which gets in the way of their daily life; like sleeping or socializing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many x-ray scans (medical ones) can a human withstand before showing signs of radiation poisoning?",
        "response": "It's not radiation poisoning he's worried about, but increasing your risk of cancer. [Link](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does saving the receipts from all of my various transactions help me?",
        "response": "If you do it correctly, you can use a lot of things you buy not just at home but also for your business, making their purchase a deductible business expense.  From having a home office, to storing work materials in the garage, to purchasing stuff at Lowe's or Home Depot or Office Depot, to the miles you drive your car, many things you do are deductible from taxes for business use. Just do it legally, like Exxon and GE and Bank of America does, with a CPA. And a big part of doing it legally is... ( wait for it )... **having receipts** to show the IRS when they ask why you deducted so much income from your taxable amount.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it common for American houses to have issues with carbon monoxide?",
        "response": "I do not think that carbon monoxide issues are all that common in America. although, on occasion you will hear about an unintentional poisoning and subsequent death(s). The problem with carbon monoxide is that it is odorless and will put a person to sleep and then effectively suffocate them. Yes, you can shut your self in a garage (car park) and leave your car running and you may kill yourself. The real danger and concern is a in-house heater or possibly water heater, while in use, leaking carbon monoxide into the living environment and being odorless, going undetected and killing everyone in the environment. We have carbon monoxide detectors specifically for this purpose. Older homes, (plus 30 years) with older equipment are the most concerning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does the salt in salt water originate from?",
        "response": "Salt in bodies of water comes from the land. As rivers flow over land, they dissolve salt and other minerals. When a body of water has no outflow, dissolved salt is deposited into it and stays there as water is evaporated away at the surface, increasing the total salinity until the concentration reaches some kind of equilibrium with salt depositing to the ground underneath it. This is the case for the ocean and for some inland bodies of water like the dead sea and the great salt lake. Most inland bodies of water (like lake Tahoe and the great lakes) have inlets and outlets, they're basically just a very wide and deep portion of a river. The dissolved salt flows right through them in small concentrations like any other river.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you tend to be more tired if you have more sleep than you normally would?",
        "response": "You sleep in cycles. There's REM sleep followed by four consecutive stages that lead you into deep sleep before the cycle starts over again.  Ideally you want to wake up between cycles. Waking up in the middle of a cycle, for instance because you doze off again will make you feel tired because you got yanked out of a sleep cycle in progress.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any place where I can find all the surviving Latin and ancient Greek writings?",
        "response": "No, there isn't. The closest things are:  For Greek, The [TLG](_URL_0_) (Thesaurus Linguae Graecae). This *is* a corpus of Greek texts covering almost everything from 8th BC to 1453. You need a licence to access it and the best way to do that is through a university. For Latin, the [PHI corpus](_URL_1_) covers Latin literary texts up to about 200 AD. For Later latin you need to go elsewhere, likewise for epigraphy. For Patristic texts, still the most comprehensive collection is those by Migne, the Patrologia Latina has not been surpassed for scope; most of Patrologia Graeca can be found in the TLG. Of course, for individual texts, they are often surpassed by more recent critical editions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can I have a cold or other illness, brush my teeth during that time, and then later on not get sick again from that same tooth brush?",
        "response": "Once you have fought off a specific cold virus, your body has gotten good at fighting it off. So if you encounter it again in the near future, your body will fight it off this time before you even get symptoms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Joseph Kennedy lobotomize his daughter, Rosemary Kennedy, to preserve the reputation of his family?",
        "response": "Found a [source](_URL_0_) describing the lobotomy on p. 179 of Personality Theories: Critical Perspectives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wondering what the other bands seen when running an undigested plasmid through a gel are from.",
        "response": "If you run an undigested plasmid through a gel you are going to see super-coiled DNA, open circular DNA, and full length linear DNA. They are the same size fragment but have different shapes hence their varying migration through the gel. Summarized [here.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Rust must be a major concern on seagoing ships. What technologies and techniques are used to prevent damage?",
        "response": "One strategy is to use a galvanic or sacrificial anode. Simply put, this is a chunk of metal more electronegative than the hull of the ship. When properly affixed, oxidation reactions will prefer the anode to the hull, reducing rust on the ship at cost of a non-structural and easy to replace chunk of metal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a symphonic orchestra work?",
        "response": "I'm a commercial electrician and can't play any musical instruments. That said, I love classical music. Often I look at the big construction sites as a symphony. There's so many people there in so many different trades, all working together to finish the building (in my case, mainly office buildings). Granted I work with people with all levels of experience, but at every site I see the masters of every construction trade doing their work.  When a master tradesman is doing their work, it's like a dance, so graceful and elegant. You wouldn't think of a construction worker as graceful, and their personalities are usually anything but that, but a master of any trade doesn't use tools, instead, their tools are like the instruments of a master musician, they become a part of the person, like a third arm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did ancient & medieval sword owners usually carry around those huge heavy weapons all day/every day, or is that just an invention of Hollywood?",
        "response": "Which huge, heavy weapons are you talking about? The average single-handed sword is 1.2kg (~3lbs) in weight, and when strapped to a baldric, is not particularly cumbersome.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I touch something sticky my hands become sticky too. Why doesn't my tongue act the same way as the rest of my body does when it touches something sticky? (serious)",
        "response": "The saliva in your mouth acts to deactivate that, specifically to prevent that from happening.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The scientific reason behind why your body works more efficiently alkalized",
        "response": "One of the job of the blood is to carry Carbon Dioxide from the tissues to the lungs to be exhaled out. And the blood does this by converting the the majority of the CO2 to H2CO3 (bicarbonate--as the the baking soda stuff.) Bicarbonate is known as a buffer, which means that it is able to donate and absorb hydrogen atoms keeping the pH of the blood (and by extension the rest of your body) constant at 7.35 to 7.45. A blood pH of 7.55 (or above) or a blood pH of 7.10 (or below) is enough to kill you. So in effect, the best thing you can do to keep your body pH correct is to KEEP BREATHING (oxygen), eating that salad will not do anything one way or another.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How haven’t the constellations changed in thousands of years?",
        "response": "They *have* changed. Just not very much. Stars are *extremely* far away. The reason they don't seem to change much is the same reason mountains don't seem to change much when you look at them while you walk around. But over time these little differences add up to differences that can be seen. Same as when you eventually hike up to the foot of the mountain and get to see it up close. It is called [stellar drift](_URL_0_) in the case of stars.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What determines the radius of curvature of a rainbow?",
        "response": "See [this](_URL_1_) thread for a pretty good description, with diagrams, of what causes rainbows. However, I think it's clearer to think of a rainbow not as a \"circle,\" or a curve at a fixed *distant* position in space, but rather as an entire [*conical surface*](_URL_0_), with the vertex at your eye. It makes sense to talk about the half-angle of that cone (about 42 degrees), but its \"radius of curvature,\" [strictly speaking](_URL_2_), would depend on *which* circular cross section of the cone (i.e., how far away) we're talking about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do standard BIC Lighters work? They appear to be a liquid, but are released as a gas.",
        "response": "Butane gas is contained within the body under pressure. This pressure condenses it into a liquid, dramatically increasing the quantity of fuel that can be stored in a given volume (if the butane were stored as gas, the lighter would be several dozen, if not hundred, times larger). When you push the activation nub (the red button/lever) it opens a valve allowing the butane to leave. When it leaves, the pressure drops and the butane converts back into gas all on its own. If a flame or spark is present, it will also ignite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it considered disrespectful if you don't remove your hat for the National Anthem?",
        "response": "My mom used to make me take my hate off when we prayed. (religious family) When I was younger I always thought it was because the hat blocked Jesus from hearing my thoughts. :D",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the Antebellum American South, what would happen if a white woman gave birth to a mixed race child? In particular, what would happen to that child?",
        "response": "u/georgy_k_zhukov answers this in part in [this comment]( _URL_0_ef9gdqk) to the [related thread](_URL_0_) about white male - slave female sexual relations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Without behavioural cues, are birds with little or no sexual dimorphism able to distinguish a male from a female?",
        "response": "I would attribute it to them knowing the tiny differences and being extremely sensitive to them. Remember their eyesight is key, so being able to resolve minute details that you aren't keen to is on their list of advantages they have. Even without that, animals are generally very acute at recognizing members of their own species. Sheep know every other member of their flock even though their eyesight is poor compared to birds and they can easily look identical to any other animal. Like humans they actually have entire specialized sections of their brain dedicated to resolving each other. Birds in general have less complex social neurology and rely on \"sign stimuli\", so for instance the bird you mentioned with sexually dimorphic eye color would first identify the shape of the bird as one I'd itsown, and then look at the eyes (red hues are extremely pronounced in birds who scavenge, so this would be glaring to them) in order to determine the rest of their behavior. [[relevant citation]](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If caffeine tolerance is high enough that desired effects are not felt, why are some negative effects like sleep disturbance still felt?",
        "response": "Caffeine shuts down the part of your brain that produces \"I'm Tired\" hormones. The first stage of tolerance is when your body makes more \"I'm Tired\" hormone factories, requiring more Caffeine to shut them all down.  Cut the Caffeine and now you've got all these extra factories putting out twice as much than the norm making you tired all the time. Stay clean for a couple of weeks and things will regulate.  It's possible that with excessive use over time, your body has just given up, stopped making new factories, and shut down the others. This would make it hard to sleep, and will likely take longer to regulate.  However, you should also do some navel gazing to see if Caffeine is the true problem. Are you stressed and not sleeping? Is your diet screwed up? Not getting enough exercise?  Caffeine is a short-term supplement. If you \"require\" it to start your day, it's time to cut it out and reset your system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If there are infinite numbers between two integers, how do you get to the next integer?",
        "response": "Think about it in another way: - There are an infinite number of integers between 0 and infinity (by definition). We know what the end result of the infinite series is, so we don't need to demonstrate each individual integer. It works in the same way with the infinite amount of numbers between any two integers; we know what the end result is, so we don't need to show everything in between to get there. Or if you want to think about it more logically: - The difference between any two integers is a tangible form of maths, i.e. the difference between two apples and three apples is one apple. The difference is not the sum of an infinite number of infinitely small fractions of an apple, even though it logically could be.  The fact that we can separate an integer into an infinite number of infinitely small fractions is a practicality, rather than a requirement to reach the next number.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for an object in space to be stationary?",
        "response": "Stationary relative to what? It could be stationary relative to one planet but not the other. In the space...who is moving and who is not? Also according to the Big Bang theory, the universe is still expanding so in a sense nothing is stationary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does blue on your phone stimulate your brain, but orange doesn’t",
        "response": "When your eyes see blue light, your brain suppresses the production of melatonin, a chemical that makes you sleepy. So as long as you're seeing blue light, you won't be as sleepy. This is because humans evolved for millions of years in which the only time we really saw the color blue was during the day. Now that we have computer and phone screens to look at long past sunset, it can really mess with how your body prepares for bedtime.  TLDR: when you see the color blue your brain still thinks its daytime, and you won't get as sleepy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to body parts after amputation? What is the process?",
        "response": "They go into a plastic bag which is clearly marked to be medical biowaste, this bag is placed into another container which is later picked up and delivered to a waste processing plant and incinerated there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the divergence of the electric field proportional to charge density?",
        "response": "So divergence conceptually represents the flux in or out of an infinitesimal point, integrating this over some volume will give you the total flux through the surface. Because a point charge gives off a radial field, any integral of flux across a closed surface containing a point charge will be proportional to the charge contained within (gauss's law), you should draw some pictures and try and intuitively get why this is true. The divergence theorem says the volume integral of the divergence of a equals the integral of flux across the surface of said volume, so the volume integral of the divergence is also proportional to the contained charge. Then differentiate both sides with respect to volume, and you can see that the divergence is equal to the charge per volume, or charge density.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a car in neutral stop faster in icy conditions than one in gear?",
        "response": "I call bullshit on this. Skidding, under any condition, is a function of traction. As long as you aren't pushing the accelerator while attempting to stop, the power to the wheels at idle is negligible and would not contribute significantly to stopping distance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many U.S. states have capitals in small and rather insignificant cities?",
        "response": "Yo ho ho! Yer not alone in askin', and kind strangers have explained that the choices were usually made on geography, or on some historic significance of the place: 1. [ELI5: How come state capitals in the US are usually not the state's largest or most important cities? ](_URL_6_) 1. [ELI5: Why are so many State capitals in the US not the biggest city? ](_URL_0_) 1. [ELI5: How is the capital city of a country/state decided? ](_URL_1_) 1. [ELI5: Why are capital cities often not the largest cities/financial centre in many countries or vice-versa? ](_URL_4_) 1. [How come state capitals in the US are rarely the largest city of the state? ](_URL_5_) 1. [ELI5: How are capital cities chosen for a state/province/country? ](_URL_2_) 1. [ELI5: Why isn't the most well-known city in a U.S. state considered it's capital. ](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Theory Thursday | Academic/Professional History Free-for-All",
        "response": "What are your thoughts on accounting for individuals' psychological factors to explain an event? Maybe not to the psychoanalytic extent, but winking in its direction: f.e. \"His ability to rebel, learned in his youth, is why he could lead the revolt later in life.\" (a) Can we use sources to reconstruct a psychological profile? (b) Since 'mental illnesses' are culturally constructed, which means so too is overall outlook, can we reconstruct the *overall* psychological milieu enough to judge one person against it? (c) Is this just a particular strain of Great Man theory?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does it means that United Health pulls out of Obamacare?",
        "response": "United Health is an insurance company. They must make a profit to stay in business. Their quoted premiums were not enough to cover the cost the health care provided under their policies. So the company will no longer lose money on these policies. Those insured will have to find other companies whose premiums are likely to be higher. But the company is still offering health insurance policies. They are still in business. They needed more subscribers than they got and their costs were too high.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what happens to lactic acid ingested from food like fermented dairy?",
        "response": "Lactic acid technically isn't metabolized by the body, but when in the body the acid loses a proton and becomes lactate, its conjugate base. Then the lactate is carried in blood to the liver, where it is converted by enzymes into pyruvate, which in turn is converted into glucose, then dumped back into the blood to be used by other cells. This process is called Gluconeogenesis, and keeps your blood glucose levels normal, even during intense exercise!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the limiting factor of Ancient Roman technology?",
        "response": "There's no one thing that would be the limiting factor in all those cases. Broadly though, I guess you could make the case that at least militarily, they didn't *need* to be more advanced then they were. They kept pace, and exceeded the capabilities of the enemies they had, so there was little need to advance beyond that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Bologna is a deli meat for people with eyes.\" - Mitch Hedberg",
        "response": "I'm pretty sure /u/letsdoyoga is incorrect about the meaning. What I'm pretty sure the meaning is that bologna doesn't taste like regular deli meat, only because of its appearance would we assume it's deli meat. If you gave a blind man bologna, he wouldn't classify it as a deli meat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the astronomical map created by scientists missing parts?",
        "response": "Because our own galaxy is in the way, obscuring our vision of the stuff behind it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a battery supply enough electricity to keep a motor turning (albeit, very briefly), even though it \"died\" during previous uses? ie, an electric toothbrush that you keep forgetting to recharge.",
        "response": "It takes time for the ions to flow from one terminal to the other in the battery. The battery can \"die\" when there is a build up of one ion at one terminal and a depletion of another ion at the other terminal. If you wait a while though, the battery \"comes back to life\" after the build up has had time to diffuse through the battery and the depleted ions can diffuse toward the lacking terminal. The specific ions will depend on the type of battery involved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the feeling of love for another person?",
        "response": "Oxytocin, dopamine, serotonin, norepenipherine. There are a lot, mainly the first three. Oxytocin is associated with bonding, dopamine associated with pleasure and serotonin with happiness. The feeling of being in love with another person is attributed to activity in the nucleus accumbens, and anterior cingulate gyrus; which are the same areas responsible for addiction to substances like cocaine or heroin. In fact, the chemical activity responsible for love probably doesn't differ too much from the chemical activity associated with addiction to drugs/other things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I’ve read that when caterpillars are in their cocoons, they dissolve completely into goo; no original parts survive in the butterfly. How is the butterfly made from the goo? Is there an embryo that grows and uses the goo like a yolk sac? Or does the goo somehow arrange itself into new body parts?",
        "response": "\"Certain highly organized groups of cells known as imaginal discs survive the digestive process. Before hatching, when a caterpillar is still developing inside its egg, it grows an imaginal disc for each of the adult body parts it will need as a mature butterfly or moth—discs for its eyes, for its wings, its legs and so on. In some species, these imaginal discs remain dormant throughout the caterpillar's life; in other species, the discs begin to take the shape of adult body parts even before the caterpillar forms a chrysalis or cocoon. Some caterpillars walk around with tiny rudimentary wings tucked inside their bodies, though you would never know it by looking at them.\" _URL_1_ There's a great radiolab show where they address this: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the strength of a password solely a function of its length?",
        "response": "If someone only uses lowercase letters, there are 26 different possibilities for a given character. For a 12 character password, the number of different combinations would be 12^26. Now, if someone is using both lowercase and capital letters as well as numbers, there are 56 different possibilities for a given character. The number of different combinations would then be 12^56, which is exponentially higher.  Another reason numbers are important is that certain password cracking programs only look for English words and common names, a list that can be exhausted very quickly. Throw a few numbers into the mix, and there are far more possibilities.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are humans designed to eat meat? I get that we have canines, but aren't our digestive tracts too long?",
        "response": "Much like our mouths being somewhere between the mouths of carnivores and herbivores, the length (and structure) of our digestive tracts as compared to similarly sized animals is somewhere between that of herbivores and carnivores. If we had been designed to be herbivores, not only would we have another source for certain b-complex vitamins (besides meat), but our digestive tracts would be longer, and would probably contain additional stomach chambers or other means to process cellulose. Had we been designed as carnivores, our tracts would be rather shorter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do tennis players yell and grunt everytime they hit the ball?",
        "response": "If there is a forceful exhalation of air at the same time that the core abdominal muscles engage it may give more power.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the disadvantages of not owning a credit card?",
        "response": "It's difficult to rent a car or hotel without a credit card",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take an eternity to change the channel in every hotel ever?",
        "response": "Im not 100% sure, but my best guess would be the delay occurs as the TV's in your room are receiving a signal from a single antenna (source) located elsewhere and then forwarded on to your TV. So the delay is the sending the request to the central hub and then it giving it back. Also from my experience a lot of Hotels have older, and/ or generic branded TV sets which are also slower to go about this process.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Hi Reddit, My girlfriend is dyslexic, and is likely to end up failing Year 12 English, despite the fact that she is extremely intelligent and does hours of homework every night, which I find incredibly unfair. Is there anything I can do to help her?",
        "response": "As a year 12 student I would think she has already sought help for her dyslexia. If for some reason she hasn't encourage her to get that specialized help. Not sure what else you could do except be supportive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any possibilities of having non-spherical planets out there?",
        "response": "[We live on a not-exactly-spherical planet](_URL_0_). The earth is spinning, which has squeezed it slightly, into an oblate spheroid. It is possible that there are planets that are spinning faster and are flatter. However, one of the defining features of a planet is that it is so massive its own gravity has pulled it into the shape of a spheroid, so everything that's considered a planet will look like a sphere (even if it is a bit squashed). That doesn't mean that there's cannot be something out there with all the physical characteristics of a planet except for the shape. We made up the definition of \"planet\" to classify what we have seen. We might eventually find something oddly shaped that looks enough like a planet for us to update the definition. Perhaps there is such a thing and we'll never find it. The universe is a big place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast does Kinetic energy travel?",
        "response": "What is traveling in your scenario is a longitudinal pressure wave, passed from one marble to the next, at a particular speed that depends on the density and structure of the marbles - the speed of sound in the marbles. This is much slower than the speed of light, so there is very much a delay from the time you push the marble on Earth to the time most distant marble moves. The reason that it's not instantaneous is that the marbles are not, in fact, perfectly rigid. They flex and bend (not much and very quickly). When you push marble A, it very slightly compresses the marble as it pushes against marble B, which slightly compresses and pushes against marble C, etc, etc. This pressure wave travels the whole way down to the last marble, which moves and allows the other marbles to relax.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is that Orbit physically correct?",
        "response": "The flower petal orbit is called \"apsidal precession.\" it's an elliptical orbit still at any one moment, in a sense, but the orbit is rotating around the star. I do not have an advanced enough understanding to do much better than the wikipedia article does, but in the absence of more expert answers: _URL_0_  > There are a variety of factors which can lead to periastron precession, such as general relativity, stellar quadrupole moments, mutual star–planet tidal deformations, and perturbations from other planets So as I understand it, a combination of: asymmetries in the bodies making their centers of gravity not remain stable as they spin etc., gravity tides deforming the shape of the star and planet in a way that correlates with the orbit and thus disturbs it, and time dilation from the planet changing relative speed during an elliptical orbit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I've heard about white Christian slave owners in the antebellum American South. We're there slave holders of other religions/ethnicities in American history?",
        "response": "I don't know the answer, but can point you toward a potential source: I took a class called \"Free Blacks in the Old South\" at William and Mary in 2000 or 2001, taught by professor Ely. He was published on this topic, I'm sorry I can't remember his first name.  Nonetheless, fascinating topic and class.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a Hydrogen atom Ionizes and becomes H+1, what happens to the single proton that's left?",
        "response": "Totally different.  Chemistry comes down to the configuration of electrons in atoms and molecules. The nature of the nucleus has a bit of influence on exactly what the energies are for the electrons, but really the electrons are where it's at. Two atoms with the same number of electrons but different numbers of protons behave chemically MUCH more like each other than two atoms with the same electron number and the same proton number.  H+, or protons, do many of their own things that H or H- do not do. The whole of acid/base chemistry is built on protons, for example. Detailing all of that would take up quite a bit of space on its own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are police officers given paid leave while under investigation while other occupations have nothing similar?",
        "response": "They are given paid leave because they are simply under investigation. They may have done nothing wrong. Itd be bad to just take a week or more of someones pay if they did nothing wrong. What do you mean other occupations have nothing similar? I cant think of a situation thats similar that could arise in another occupation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are children from younger parents generally healthier than children from older parents?",
        "response": "The evidence is conflicting and confounded, largely because later parenthood is not randomized. People who have kids at older ages are likelier to plan the pregnancy, want the kid, and fulfil its needs; they're also somewhat healthier than average because they were able to get pregnant / get someone pregnant at an older age. Then you separate paternal from maternal age (difficult statistically, but the effects appear to be different) and things get even more complicated. Some conditions are more prevalent in children of older parents (Down syndrome, dwarfism) but if you don't have one of those then we really don't know. You do have the bonus of being born to two people who age well, at least to age 45.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for strong emotions to cause a healthy heart to skip a beat?",
        "response": "Yes... A 'skipped beat' is actually due to a cardiac event referred to as a Premature ventricular contraction (PVC), in which a beat occurs before it would be expected in normal sinus rhythm. This PVC is then followed by a compensatory pause as the heart returns to sinus rhythm, causing one to feel a 'skipped beat'. In cases of extreme stress, there is increased activation of the hypothalamic-pituitary-adrenal axis, which in turn causes an increase in systemic catecholamines (ie epinephrine, norepinephrine, dopamine). Epinephrine will bind to B1 receptors on the heart to increase the influx of Calcium, causing enhanced electrical activity in the heart and predisposing one to have a PVC. In some cases, the increase in catecholamines can be so great that it actually causes a series of symptoms similar to a heart attack in what is referred to as takotsubo cardiomyopathy. TL;DR Yes, emotional responses can cause a heart to 'skip a beat'",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a person suntan through an ordinary house window?",
        "response": "[This wikipedia article](_URL_0_) states that: \"Ordinary window glass passes about 90% of the light above 350 nm, but blocks over 90% of the light below 300 nm.\" Since UV light is in the range 10 nm to 400 nm, I'd say suntanning behind a glass window would be highly ineffective.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we get \"chords\" of light?",
        "response": "I'm going to disagree with others here. When you mix a C and a G you get a major fifth because of the frequencies of the sounds. When two notes have a 3:2 ratio of frequencies, you hear a major fifth. If you were to examine the wave, you would see that the two waves are 'added together' into a single, but more complicated, wave. [Graph 1 - two waves that represent 'individual notes'](_URL_0_)  [Graph 2 - the sum of those two waves, forming the 'perfect fifth'](_URL_1_) When you mix red and green light, *your eye* sees yellow. The two waves do not combine to form a wave with a frequency corresponding to yellow light. Rather, our eyes record red light (through the cone cells which respond to red) and green light (through the cone cells which respond to green) and our brain perceives this as yellow light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What caused the Great Depression?",
        "response": "This was a great answer in my opinion. You should search first before posting in ELI5, as many big historical topics have been covered with great answers in the past: _URL_0_ But it is pretty old, so we'll see if people want to give a new take on it:",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is MRI scanning used to accurately determine age?",
        "response": "Here are a couple of articles on the techniques. It is not 100% but counts on the following: FIFA uses wrist MRI for assessment of skeletal age to determining degrees of fusion of the distal radius growth plate.[14,15] In this method, the degree of fusion of the distal radius was graded independently into six classes in which grade I means completely infused and grade VI means fused growth plate. They concluded that complete fusion (grade VI) occurs at the age of 17-18 years. Original article with MRI technique: _URL_0_ Alternate lower cost method using ultrasonography: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a natural lake not drain completely into the ground it is above?",
        "response": "Because the water is under the ground under the lake bed as well, thats basically what it was doing until it became fully saturated and started to collect a pool",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why NOT to outsource?",
        "response": "In many cases, the old saying \"You get what you pay for\" applies. Some companies are actually moving back to the United States because they have found that the quality of work they're getting overseas isn't up to their expectations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "any historical language specialists here?",
        "response": "You might want to ask this in /r/linguistics as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Doctors Make an Artificial Pulse on a Body For an Autopsy, Why Can't This Essentially Bring Somebody Back to Life?",
        "response": "Well if you do it to someone who's undergone brain death, you are essentially preventing the total death of the body after it began to totally shut down due to a lack of brain function. However, assuming we have a corpse that's been dead for let's say a few hours, it won't work because their tissues have already died. Our cells need large amounts of nutrients and oxygen to keep functioning and when deprived they die very fast. Even if you start resupplying them with more later on, it's too late, their ability to function has broken down. The equivalent would be forcing food into the stomach of a man who just died of hunger. It's too late, he can't digest and process that food anymore. That ship has sailed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I put two mirrors across from each other, then put an object for them to reflect and take it away, would the mirrors continue to reflect that object from each other? Why or why not? (Better explanation inside)",
        "response": "As others have mentioned, even if you had two perfectly parallel mirrors and perfectly perpendicular light, the imperfect mirrors will absorb all the light pretty quickly, but here's another wrinkle: the beam of light would fall to the Earth at 9.8 m/s^2 due to gravity!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When we're sick with something like a cold or the flu, what's actually happening in the body that's causing us to feel nauseous, body pain, headaches, congestion, etc.?",
        "response": "The body releases a set of signalling proteins called interferons. These proteins basically tell the cells they touch that there is a virus running loose and to heighten their defenses. They cause most of the symptoms you feel, because they make it difficult for a virus to reproduce. Most of the symptoms of being sick are actually due to your immune response to the virus, rather than the virus doing damage itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how do dead pixels spread across a screen?",
        "response": "If anyone can explain also how a vertical line of dead pixels in my monitor came back to life, I would appreciate that as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What technologies are there so that your credit card information cant be stolen while in your wallet?",
        "response": "Information on a credit card is presented in three ways 1.) In printed or raised lettering on the face of the card 2.) Encoded on a magnetic strip on the rear of the card 3.) Stored within a microprocessor located on a chip embedded in the card If a credit card is located within a wallet, it's safe to say that interception via #1 is impossible straight off the bat. Interception via #2 requires that the magnetic strip be exposed as the sensor needs to be incredibly close to it, and must scan across it cleanly. Interception via #3 is impossible because there's no way to get the credit card information from the EMV chip. How it works is far beyond the scope of ELI5, but the entire transaction is encrypted; furthermore, transactions beyond a certain value are further authenticated with a PIN known only to the card holder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So many classic christmas movies show orphanages as a thing, I haven't seen or heard of an orphanage in that sense my whole life. Do we no longer have them? why not? what happened to the classic TV type orphanage?",
        "response": "They aren't really a thing any more in the United states, I believe this happened after ww2, However I could be wrong about that.  They've mostly been replaced with group homes/boarding school type environments. Also fostering is fairly big too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is AIDS almost impossible to cure?",
        "response": "Cos 1) it hijacks your own system to reproduce. 2) it's main mode of attack is to destroy your immune system. Imagine trying to get rid of invaders when all your guards have been taken out. 3) scientists have found that HIV virus have been known to lay dormant in certain nooks and crannies of the body, and come out again once you stop treatment.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is infertility such a problem in humans, but not an issue with the animal kingdom?",
        "response": "Usually enough animals are able to reproduce to keep the species going, but then that's true of humans too. Infertility is a problem for individual humans, but not for humans as a species. Individual animals may be infertile too, but they are not able to complain about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In WWI did the Allied officers shoot cowards on sight?",
        "response": "* [Desertions in WWI] (_URL_0_) * [PTSD and Therapy from WWI Onwards] (_URL_1_) These answers I've given before should be pertinent; /u/elos_ and /u/NMW could probably also comment. As to your question:  > When the Allied officers rung the bell to go over the trenches Whistles were typically used, but given how cliché they are, and the shift away from trenches by 1917, I can't imagine they were terribly common.  > did they shoot the soldiers who disobeyed? No; for one thing, even among soldiers that received the death sentence, I am aware of no soldiers, certainly in the Franco-British forces, that flat out refused to go over the top, with the exception of the French Army Mutinies in 1917, and that did not result in mass shootings. More so, in the British Army there was a complex legal process to go through, that was actually quite fair; only 10% of those given the death sentence (346 out of 3080) actually were executed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "whats the difference between inductive, abductive, and deductive reasoning?",
        "response": "Consider the following phrase: \"Where there's smoke, there's fire. Smoke is made when things are on fire.\" Inductive reasoning is when you go: \"Since there is always smoke when something's on fire, when there's smoke, there's fire.\" Since every time you've seen A happen to B, C happens; C happens when A happens to B. Abductive reasoning is when you go: \"Since there's smoke, something must be on fire.\" \"If you see C, then A must be happening to B.\" You know the conclusion: that there's smoke. And you know the rule: smoke is made when things are on fire. And then reason the precondition. Deductive reasoning is when you go: \"Since something is on fire, there must be smoke being made.\" Since A is happening to B, there must be C. You know the precondition: that something is on fire. And you know the rule: smoke is made when things are on fire. Thus reason the conclusion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the ideal gas law selective to certain types of energy?",
        "response": "> However, my teacher said collision is the only way that energy can be absorbed and that can be accounted for the ideal gas laws. Why is that? Why can't all types work for ideal gas laws? Because the word \"ideal\" in ideal gas means that you're *assuming* that there are no interactions between gas molecules, nor with an external potential. If you want to include more sophisticated interactions, your gas is no longer ideal by definition. And example would be a [Van der Waals gas](_URL_0_). The equation of state is modified slightly, so that it's not longer as simple as PV = nRT.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why am I hungry before I sleep, don't eat, then wake up not hungry anymore?",
        "response": "Hunger isn't just the feeling of an absence of food in your stomach. Hunger is a sensation caused by your brain when it detects that your immediately available energy (a chemical called glucose) doesn't match up to how much it thinks you need for your current activity rate. When you sleep, you aren't very active, and your body can get by on reserves of energy (a chemical called glycogen, stored in the liver) that take longer to convert into useful energy. Immediately after you wake up, you're still in a restful state, so your brain doesn't think it needs to tell you to get more food.  Once you've gotten up and started your morning routine, you might find that you begin to feel hungry again as you become more active, and your brain starts to realise that you will soon be needing more energy. And then it's time for breakfast :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what did England gain by issuing the Balfour Declaration?",
        "response": "simplified: The timing was simply at the culmination of a long process begun when Britain joined the war as part of the overall policy question of what would happen to the various components of the ottoman empire once toppled. The actual process was accelerated in mid1917 due to military operations in Palestine itself.  Britain also was using it as a way to try to use Jewish people on the non allied side to switch.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is a 'gut feeling' or instinct? Why do most people follow it?",
        "response": "It cannot be anything but a product of our own experiences and environment. Regardless of moral compass we condition ourselves to what is truly right or wrong in our own scope of reality rather than that of the majority. The gut feeling is simply an emotional and/or physical response to something you perceive as right or wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which tribal societies assimilated Western ideas into their mythologies ?",
        "response": "I don't know if it is entirelly related to the adoption of western ideas, but the Guarani people in the Rio de la Plata basin were monotheistic, and the Spanish and Portuguese missionaires took that to their advantage. You can look at this as assimilation of religious concepts. Source: Santillana's Ciencias Sociales 7/6 (it's my textbook from last year of primary school)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does the computer understand the code?",
        "response": "Here's my ELI5 explanation: When the computer runs code, it actually translates it into smaller and simpler languages. You start with something like this in C:   printf(\"Hello, world!\\n\"); Then the computer translates this into assembly code, which is simpler, but harder to read. It might look something like this:   MOV AL, 1h   MOV CL, 2h   MOV DL, 3h This assembly code is so simple that each command can be translated into bytes. Something like:   01001001 00101001 001001001   00100101 00101010 001010101   00101011 00101001 001010101  And that's how the computer understands your code.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When does a hill become a mountain?",
        "response": "Many geographers state that a mountain is greater than 300 metres (1,000 feet) above sea level. Other definitions, such as the one in the Oxford English Dictionary, put the hill limit at twice that. Still others make distinctions about the degree of slope (including two degrees or five degrees). In Scotland, meanwhile, landforms with distinct summits are called ‘hills’ no matter what their height. But in America, there are several ‘mounts’ that are less than 300 metres (1,000 feet) tall. So, essentially, a hill becomes a mountain when someone names it as such.  Source: _URL_0_ Edit: Source",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't Obama just appointed the Supreme Court Justice already?",
        "response": "He has. The Senate needs to confirm his appointment, Merrick Garland, in order for him to actually take the bench, though. The Senate refuses to hold hearings on his nomination, let alone bring it to a vote.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do game programmers use odd percentages to determine damage/outcome?",
        "response": "Most likely, they've got a few tuning knobs behind the scenes. They might, for instance, start with 30%, then say \"well, we need to nerf that class by 7%\", and now it's 27.9%. Then they say \"hmm, we should buff this spell by 2%\", and now it's 28.458% - and so on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many patterns are possible in the Android unlock screen?",
        "response": "It's been answered by a Google engineer here _URL_0_ Answer: a bit less than 400000",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a sewer system doing wrong when methane gas builds up?",
        "response": "Improper ventilation can cause the buildup of sewer gases. I believe that stagnate water in the sewers also contributes a lot to the build up of sewer gases. This is usually caused by blockages such as when too many people are illegally dumping oils and solid items down the drain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do kidney stones hurt so much?",
        "response": "They hurt because they are a solid object, with edges, being forced through a tube that is too small, and designed for liquids only. Its doing damage as it goes through the ureter and urethra, pain is the body telling you that damage may be occurring.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Did Obama win a Nobel Peace Prize?",
        "response": "As a way to snub George W. Bush.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So humans regenerate skin cells and all, and that's cool, but if we constantly make new skin cells, why do I still have freckles, when birthmarks might fade over time?",
        "response": "Because freckles are constantly being created as the melanin(sp?) in your skin reacts to the sunlight  Whereas a birthmark is more of a 1 time event and can be \"overwritten\" with fresh new cells. Much like a scar",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any \"laws\" governing our language?",
        "response": "I'm a linguistics student, and the only one I can think of off the top of my head is [Grimm's Law](_URL_0_) in terms of named laws. That's not a law describing how things work, though, it's a description of how certain sounds changed into other sounds. There are some things that are rules in English, like the order of determiners, adjectives, and numbers before nouns in English. Considering the following: (*whatever means \"whatever is ungrammatical.\") * The/my three red rubber balls * *The red three rubber balls * *Red rubber the three balls * *The red rubber three balls * *The three rubber red balls There are also some phonological (sound-based) rules that are always true. So, for example, the plural in English comes in three forms: [s], [z], and [əz]. [s] always follows unvoiced sounds and [z] always follows voiced sounds. I can't think of an example where this is not true.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why haven't cat breeders created domestic cats that are as loving and social as dogs?",
        "response": "Have you ever had a good cat and raised it from a kitten? I've had two cats that were just like dogs. Ripley was my first cat ever, and I taught him sit, stay, fetch, etc. He was my buddy, always at my side. Never needed a leash when we went outside or anything. He was just a random kitty from the street, too. Nothing special to anyone but me.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that when athletes have a low heart rate it's considered good, but when the average person has a low one it's a sign that something's wrong.",
        "response": "It actually doesn't necessarily mean something is wrong in the average person, either.  But the difference is that in athletes this is the result of the heart changing due to conditioning. Working out exercises your heart muscle tissue and allows it to pump more efficiently, and other changes in the body lower the oxygen demand. So this change is *physiologic.* Whereas with an average person they don't have those changes, so the slow heart beat is more likely to be an issue with the electrical signals that tell the heart how fast to beat. This issue would be *pathologic* because it is not part of the normal way the heart functions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an animal know how to look up at our eyes when we give attention to them?",
        "response": "The same way you look down on him, which is not at your eye level. I'm not trying to be smart, but people have this terrible tendency of dissociating themselves from the animal kingdom. In the world of ethology and biology, we're all in the same boat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we feel the physical aspects of emotions in our chest/stomach region (a knot of anger/fear or butterflies in your stomach)?",
        "response": "Your body has a fight or flight response. When you are scared or ready to fight, your body gets ready to act. Your heart starts to beat faster, your pupils get bigger to look for predators/enemies, you start to sweat, and your body stops digesting food to save energy for the fight or run.  Your body also has a rest and digest response when you feel safe. Your heart rate slows down, your pupils get smaller, your body redirects blood away from your muscles to your gut so you can digest food. You can sleep or you can digest food that you've eaten.  Your emotions are sensed in your brain, and impact how these two systems operate. So seeing your crush literally makes your heart race. Anxiety can give you a bad feeling in your gut.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is a human brain transplant achievable? If not, why?",
        "response": "For any organ transplant, you need to connect the new organ to the host. For most organs, that means some rational number of blood vessels and physical attachment to the surrounding structure.  For a brain transplant you'd have to reconnect all the individual nerves...it would be like trying to replace a computer processor with tens of thousands of super tiny pins with no connector. We don't have the surgical techniques to do it with enough speed or accuracy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many antacid pills would you need to take to turn your stomach acid into water and what would be the ramifications of that?",
        "response": "I'm not sure about all antacid pills, but at least most of them are not simply an alkaline substance to cancel out the acid. They are a buffer substance where the active ingredients form conjugate acid/base pairs. So they work by normalising your acidity level to a pH very close to the equilibrium point of the buffer solution. If you have excess acid, the buffer solution's equilibrium will shift as the conjugate base is \"used up;\" as this occurs, only minor shifts to the pH of the buffer solution are seen. This is the same for a shift in either direction of the equilibrium until all of one of the acid/base pairs are gone and the buffer solution breaks down.  So taking large amounts of antacids would simply create a very robust buffer solution in your stomach at whatever the pH is at equilibrium of that solution. depending on the ingredients used, they might have other laxative effects or something like that, but nothing major would occur unless you managed to take enough to poison yourself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does pasta have numbers on the box? i.e Farafelle no. 65",
        "response": "Pasta is extruded through dis. The number on the box is referring to the di that was used to make that particular shape of pasta.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are nucleons greater than the sum of their quarks?",
        "response": "Yes. The three valence quarks in a proton make up about 1% of its total mass.The rest comes from the binding energy holding them together. The quarks in nucleons are confined, you can basically talk about protons and neutrons as discrete units.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the TSA require a max limit per bottle of liquid/gel but no limit on the number of bottles?",
        "response": "Because the TSA's rules are arbitrary and meaningless.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the book Moby Dick, Ishmael uses “shillings” “pence” and “pounds” to buy things while in Massachusetts. Is it accurate that Americans would still have been using British money in the 1820s? If so, why?",
        "response": "Foreign currency was officially considered legal tender in the United States during the first half of the 19th century after Congress [passed a statute](_URL_1_) in 1806. The practice continued until it was discontinued by the the [Coinage Act of 1857](_URL_2_). The Act also specifies the rate of exchange for coins from different countries.  This [Crooked Lake Review article](_URL_0_) re-published coin conversion tables from the 1849-50 Rochester City Directory, showing an English shilling at 0.23 cents. According to the article, \"Each merchant would have to be a numismatist to recognize each of these foreign coins. To make things a bit easier, merchants could buy coin-weighing scales with the counter weights in the shape of, and bearing the same devices as, the actual foreign coins they were to be weighing.\" Published in 1851, the events of the book (even though it's told as happening \"some years ago\") would have taken place precisely in this timeframe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between a monoclonal antibody and a polyclonal antibody?",
        "response": "A single immune cell that makes antibodies only has instructions for one kind of antibody. If you take this cell and grow it in a lab from a single cell (single colony), it produces monoclonal antibodies to a single part of a target. On the other hand, you could take a bunch of immune cells that each recognize different parts of the same large target, and grow them up in a lab. They would produce a variety of different antibodies, all targeting the same overall thing, but in different ways. These are polyclonal antibodies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is that shockwave feeling you get in your stomach/chest after just barely avoiding injury?",
        "response": "That would be the feeling of adrenaline going through your body. It is a hormone (or chemical to keep it simple) released by your body in the event of potential danger or injury which primes your \"flight or fight\" response. It has many side effects, but it is designed to help you react quickly by speeding up your pulse, sharpening some of your reflexes, giving more fuel to your muscles, widening your pupils and improving blood clotting in case you get injured and bleed . It can also dull sensation of pain temporarily so you can either get away or still fight (depending on the situation).  It can make you feel shaky, anxious and jittery but it is our evolutionary survival mechanism when we face a predator or attacker or come up against some other situation where we may be injured or need to react quickly to survive. A potential slip down the stairs would certainly trigger it.  edit: I should proof read more",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do individual moving charges create a magnetic field?",
        "response": "An individual moving charge *does* produce a magnetic field. For a point charge moving arbitrarily, the potentials and fields are given [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do lights flicker, and do all of them flicker?",
        "response": "Your Christmas lights are cheap AC LEDs. Basically they're two strings of diodes that are pointed in opposite directions with no driver or smoothing components which add costs. The voltage coming in looks like a sine wave going up and down. When it rises to a certain point (~30V usually) the diodes will conduct and create light until the voltage falls below the threshold and they turn off, the voltage continues downward until it hits the negative threshold and the other string turns on. This results in 7ms of full light, 2.66 ms of no light, then 7ms of full light again giving you the strobing effect on moving objects The light in your bathroom is unlikely to be an incandescent if you see flicker (unless you have it dimmed) as an incandescent filament heats up and stays hot acting like a low pass filter, this means that even when the voltage is at 0 it is still producing some light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why when we receive bad news do we physically feel our heart drop?",
        "response": "Here's my best educated guess: When you receive bad news a few things happen in the body which ultimately makes you feel as though your heart drops. Your amygdala signals strongly within the brain as well as your sympathetic nervous system. The fight or flight response kicks in and your blood pressure increases as well as your heart rate. Your eyes will even dilate and there are some studies I remember reading a while back that even state that memories formed during these moments seem to be \"slowed down\" which would imply your senses are more than likely heightened during these instances. So, it feels like your heart is dropping, but really it's you feeling your body and heart reacting to the news.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were communists so against democracy?",
        "response": "Just a reminder to people considering to post: historical examples only please, and preferably well sourced. Not 'your opinion as a communist', not 'this is what I think is wrong with democracy'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do human bodies build up tolerance to alcohol/drugs but not daily medications like antidepressants/cardiac​/etc meds?",
        "response": "I can't speak for the other meds, but you absolutely can build up a tolerance to antidepressants and painkillers and the like",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why cant I eat raw eggs in cookie dough but when I order sunny side up eggs its totally fine?",
        "response": "You can eat it - the risk is about the same. Meaning very, very, very low. In the case of e.coli, far more outbreaks are caused from produce than from meats and dairy. So if you aren't a vegetarian you are already ahead of the game safety-wise. I wouldn't suggest taking chances with children or the elderly with compromised immune systems, but for yourself it's far less dangerous than getting in a car.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any part of the body that cannot be accessed surgically?",
        "response": "This is often case specific, but generally speaking, there are certain organs or regions that do not respond well to insult. Tissues such as brain, muscle and nerve do not regenerate (or not very well), so any of these would be more susceptible to damage. Also, highly vascular tissues are more difficult to perform surgery on for obvious reasons. There are some other parts of the body that are very difficult to access for anatomical reasons. One example would be the pancreas which is surrounded by many organs and vessels and offers no easy access for surgeons. With that being said, surgery can still be performed on all of these organs, often with minimal lasting injury. Hopefully this somewhat answers your question, let me know if you are looking for something more specific.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it hurt when things like lemon juice and salt get in to an open wound?",
        "response": "Both lemon juice and salt contain electrolytes that, when introduced into the wound, make the local environment electrolyte-rich. This stimulates pain receptors in the wound, which, being nerves, are sensitive to electrolyte imbalances (especially of sodium as with salt).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In a car, does a sudden cease of deceleration cause a slight acceleration?",
        "response": "You're right, the car will rock back and forth on its suspension like one of those \"animal on a spring\" toys you see at playgrounds.  The car will lean forward onto the front suspension during braking. When you let up the brakes, it will rock backwards to lean on the back suspension, and then back again. This rocking will very quickly die off, but it is probably what you are feeling. Edit: In regards to your question, the rocking may cause a slight oscillation in the speed of the car. The car could be modeled as a swinging pendulum being carried by a walking person. The body of the pendulum has an oscillating speed relative to the ground, but the pivot point of the pendulum will travel at a constant speed. The question then becomes, where is the pivot point of the car? I would assume the point is somewhere along the ground, in between the axles. I'm not sure how valid that assumption is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the moon is tidally locked to Earth, how are there craters on the side facing Earth?",
        "response": "I assume your question is essentially how do things hit the near side of moon if the Earth is in the way. The Earth is far enough away from the moon that there is definitely room for an object to slip past. In fact the gravity of the Earth can bend the trajectory of objects into the moon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In times of war, do the attacking forces generally try to avoid cultural icons like Big Ben or the Cologne Cathedral, or are they treated like every other structure and subject to bombing raids, etc?",
        "response": "I just finished Thomas Madden's book about Venice and he talks a little about this in WW2.  Basically there was a concerted effort on the allies part to not bomb Venice at all. They could afford to do this of course because there was very little strategic value in Venice.  There was however a single bombing campaign to destroy Axis shipping that was going through Venice. It was done with a great amount of planning and precision and they were able to take out the targets without harming the city. The citizens of Venice watched the raid from their rooftops.  The book also includes the quote \"Provided you weren't Jewish, Venice was the safest place in Europe to be during WW2\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is well water safe to drink when stagnate water is not?",
        "response": "Various anaerobic bacteria are commonly found in stagnant water, this bacteria are harmful to humans. Well water is ruining and well oxygenated there for most of the time does not have harmful bacteria. But is not always the case. Well water can get contaminated, So it needs to be constantly monitored.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long were humans walking around completely naked? What is the oldest evidence we have of humans covering themselves?",
        "response": "hi! this question may be more up the alley of /r/AskAnthropology or /r/AskScience, but fyi, here are a couple of previous posts that may be of interest [Do we know when people started covering up specifically their genitals with clothes for purposes other than warmth?](_URL_3_) [When/how did wearing clothes become the cultural norm?](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the \"best\" English version of the New Testament for someone interested in its historicity and the technical details of its translation?",
        "response": "The other commenter mentioned ESV, which is a good translation. Many scholars, however, are partial to the NRSV...which--although also a revision of RSV (as ESV is)--relies on up-to-date scholarship a bit more than ESV does (and has some less transparently theological/confessional translations). Also, many people recommend the New Oxford Annotated Bible--which contains the text of NRSV but has commentary and annotations by scholars. The NASB is probably the best *literal* translation, preserving the Greek syntax well.  Although this isn't exactly my favorite translation itself, the NET Bible has *fantastic* notes alongside the text, which delve into the scholarly issues quite a bit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do prisms split apart the different colors of light, but lenses don't?",
        "response": "Lenses do too. The phenomenon is called chromatic aberration. Good lenses, like camera lenses, have corrective doublet elements glued to them to compensate for the effect. If you have high index eyeglasses, you can see the effect by looking at a thick black line on white paper. It will be blue on one side and red on the other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did Aaron Swartz do wrong and why?",
        "response": "He downloaded a bunch of scientific journal articles from MIT, allegedly with the intent to distribute them for free on the Internet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we use one \"international timezone\"?",
        "response": "It's called ['UTC'](_URL_0_) - it's a time standard that's free of time-zones & used when you need to coordinate things across zones. There's no *technical* reason we couldn't use UTC for everything. China only uses one even though it covers 5 zones worth of territory. For the rest of the world people like to have 9am be sometime in the morning and noon be midday - it's a social issue, not a technical one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does combining Playstations (or any other computer) into a \"cluster\" create a supercomputer?",
        "response": "Depends on the type of job you're running. Different types of jobs can benefit from massively parallel processors, like you'd get by combining a bunch of smaller computers into a \"bigger\" one. Say you had a list of 100 million numbers that you had to add up. You could do it on one processor but it would take X amount of time. So you take the numbers, split them in to 100 groups, run each of those groups on a processor, then combine the 100 results. The resulting process takes that much less time. But there are also jobs that don't parallelize very easy. If your algorithm requires the result of another algorithm, you end up waiting on the first one to complete before you can start the next one. In that case, you want faster single processors more than a bunch of possibly slower processors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Ionization energy?",
        "response": "An ion is an atom that has gained or lost one electron, leaving it with a positive or negative charge - this is the loose definition of ionization. Ionization energy is the measure of the amount of energy required to remove one electron, thereby ionizing an atom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Trading Places\" and FFOJ. How exactly did they do it?",
        "response": "It has been many years since I have seen the movie, but I thought it was something along the lines of them knowing the upcoming production about the orange harvest. The prediction of the harvest will send the market in a predictable direction so if they game the system and drive the market in the other direction they can get the Dukes invested in the wrong end. When the market reverses their wealth is wiped out. I believe the instrument was buying on margin... when you buy on margin you promise of making good at the end of the day. By getting them heavily invested at the wrong end of the day they have to make up the difference in price.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"ELI5:\" The difference between C3 and C4 plants?",
        "response": "When most plants(C3) get hungry they get their ingredients(CO2) from the air outside and use it to make food (sugars).   Sometimes it gets really hot and the plants(C4 this time) don't want to go outside to go shopping so they stay inside but then they still get hungry so they have to find creative ways to use up all the ingredients in the pantry like making \"taco surprise\"(a 4C compound instead of 3C)  Other plants(CAM) know that they won't be able to make dinner during the week so they make a big batch of food and store it in the freezer so they easily reheat it and have food when they want it",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I have a cup with 1 drop of water and I fill it with water, drink half of it, fill it again, drink half and so on. How many times will I have to repeat to make the molecules of the first drop \"disappear\" from the cup?",
        "response": "That's highly random and will depend on how you fill the cup, the temperature of the water, the geometry of the cup, how you drink it, and how long it sits between filling and drinking. If the fill and drink are relatively turbulent it may take millions or billions of fills before every single molecule is gone. A single drop has a mind boggling number of water molecules in it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many color combinations are possible with choosing 4 out of 7 colors if colors can be repeated and which formula is applied in this instance?",
        "response": "7^^4 = **2041** of possible combinations Someone correct me if I'm wrong, but this should be it E: Wrong, it's **35**, see below",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do you need to ‘warm up’ your car before driving in cold weather?",
        "response": "Mechanic here. No, its slightly better for the engine to not warm it up. Engines take the most wear and tear on cold starts and the quicker it gets up to temp the better. That does not mean hop in and drive it like you stole it to warm it up. You want to drive it nice and easy until its warmed up. Now when I say \"slightly better\" i mean the difference between getting 500k vs 550k out of an engine. So if you want to warm it up before you get in it, go ahead. The difference isnt big enough to worry about, so dont feel bad if you just hop in and go.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a perceivable day/night on the far away planets?",
        "response": "Yes there is, but much less noticeable. Even from the voyager 1 probe (which is much father than any planet) the sun is still about as bright as the full moon. It would appear much smaller in the sky, but would still be very obviously far brighter than any other object in the sky, and the only thing bright enough to cast visible shadows (at least to our eyes.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do server farms/data centers create?",
        "response": "> but what does the farm actually make? Is it upping the RAM of the site? The server farm *is* the site. A website is just a series of files which are accessed remotely. They exist on a computer which is connected to the computer on which you are viewing them. The computer that holds and provides the files which make up a website is called a \"server\" (it \"serves\" the files to anyone who requests them). Big sites have lots of users and one computer would be overwhelmed. If you take a bunch of servers and put them all together it is called a \"server farm\", sort of like how a farmer might raise a pen of chickens or cows. Having a bunch of servers means the load of serving all the people who want to see the website can be split up between them and be successfully managed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who Considered Themselves Roman",
        "response": "I don't think I'm sure what exactly you're asking - do you want to know who considered themselves Roman after the fall of the *western* Roman Empire? Or who considered themselves Roman during antiquity?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "PHYSICS: If the water particles in a wave don't move forward, how do surfers move forward?",
        "response": "Surfers are sliding downhill on the face of the wave. Since different portions of the water rise up, one after another, if they time it just right they can keep sliding downhill for a long time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are three primary colors used, instead of two, four, or twenty?",
        "response": "Primary colors are sets of colors that can be combined to make a useful range of colors. For human applications, three primary colors are usually used, since human color vision is trichromatic. For additive combination of colors, as in overlapping projected lights or in CRT displays, the primary colors normally used are red, green, and blue. For subtractive combination of colors, as in mixing of pigments or dyes, such as in printing, the primaries normally used are cyan, magenta, and yellow,[1] though the set of red, yellow, blue is popular among artists.[2] See RGB color model, CMYK color model, and RYB color model for more on these popular sets of primary colors. Source - [wikipedia](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Do We Know That Ammonites Had External Shells?",
        "response": "A couple of things; first, one must not forget that the closest phylogenic lineage to the ammonites is the [*Nautilidae*](_URL_0_), and *they* have external shells to this day. Furthermore, with the exception of the complexity of the septae, the use of the shell appears homologous between the 2 lineages. Second, there have been a few instances where there was preservation of soft parts in some ammonite fossils, those specimens showed no significant soft tissue on the outside of the shell.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the hurricanes \"curve\" when they get close to Florida instead of just continuing straight?",
        "response": "Air currents 'push' the hurricane one way or another, in my comment below you will see a pretty interesting site.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does an organism's water consumption rate tell us about that organism?",
        "response": "Yes, all of those things, and also the organism's water use efficiency. For instance, Kangaroo Rats can go their whole lives without drinking liquid water. They are are able to utilize the \"metabolic water\" which is a byproduce of certain steps in cellular respiration as their primary water source.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is the red cross so concerned about Creutzfeldt-Jakob Disease?",
        "response": "Creutzfeldt-Jakob is a terminal disease that wastes away the brain. There is no cure and while there have been some progress in developing blood tests for the prions that cause the disease, its not to a point where you would want to risk infecting someone with degenerative brain disease.  There's relatively little chance of people getting infected from blood transfusions, or of you actually having it, but considering how devastating an infection is they do not want to take chances.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does head lice always spread in schools?",
        "response": "Anywhere you get many people in close proximity, you can have lice infection. Stories from concentration camps show they had to deal with lice, soldiers talk about the issue and many other situations.  Schools are just a modern example of many people close to each other in one building.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How am I able to know if a sound is coming from far away or close by?",
        "response": "Echoes and sound reflection. A sound from far off will bounce off the landscape, which causes an echo effect. The sound then will be blurred out, creating a \"far off\" sort of distortion. Sounds from close by are clearer as they haven't been blurred out in this way. There are rooms that have been so completely isolated from sound and echoes that you actually will not be able to tell the distance by sound alone. Lots of strange things happen to sounds in these rooms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does this German sign mean?",
        "response": "> **NATO military bridge classification signs**. Posted near bridges and viaducts and indicates the safe load-carrying capacity of the bridge for military vehicles. [source](_URL_1_) [See also](_URL_0_) To ELY5: It means that tanks and trucks that are heavier than that number can't cross the bridge or else the bridge might fall down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Scott Aaronson: \"...the ability to solve NP-complete problems would give us 'godlike' powers - arguably, even more so than the ability to transmit superluminal signals or reverse the Second Law of Thermodynamics.\" < - how come?",
        "response": "Have you read the [survey](_URL_0_) Aaronson cites in the footnote, specifically section 10?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do large American cities like New York and San Francisco smell bad?",
        "response": "There is a lot of trash accumulated, and it needs to be stored until removed, so there are lots of trash cans, dumpters, etc. Also, there are large homeless populations (and drunk people) who relieve themselves on streets, in alleys, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My friends have always told me that LSD hangs around in your spine for years after you use it, which I always assumed was a fairy tale. However, I'm curious about the actual effects of LSD and why users experience flashbacks. Can anyone elaborate?",
        "response": "Medically speaking, LSD is metabolized quickly (half life of 175 minutes). That being said, it can be concluded that even if LSD somehow crossed the blood-brain-barrier and entered your CSF (cerebrospinal fluid), it's metabolism is so rapid that it would not be there for any relevant period of time. Leading theories on the phenomenon of \"flashbacks\" point to 2 possible major causes: #1) The flashback is similar to PTSD (fear conditioning) where the user had a \"bad trip\" and certain cues later on in life can bring the person back to that trip. This would be facilitated by your memory circuits in the hippocampal region of the brain. #2) Use of LSD inhibits and/or activates certain neurons, which when stimulated, can give the impression that one is \"tripping\" again. This isn't because the drug is still in your system, but is because the drug has modified receptors in the brain permanently. The region thought to be affected would be the lateral geniculate nucleus of the thalamus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if an organism had two Y chromosomes?",
        "response": "It would completely depend on the species since not all organisms have sex regulated the same way. In humans, the X chromosome contains some important genes that are not present on the Y chromosome. As a result, a YY human could not develop.  However, it would be possible to have a XYY human. This could happen naturally as a result of a \"mistake\" in the production of the sperm or egg. Based on real-life instances of this occurrence, it seems that having the extra Y chromosome doesn't have any major symptoms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a computer know how long a \"second\" is?",
        "response": "The motherboard has a quartz crystal on it which vibrates at a known frequency. The motherboard uses this to keep track of time. The button cell battery on a motherboard is to pass on electric current through the crystal, which is what causes it to vibrate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we truly taste many things only after we swallowed them?",
        "response": "Your nose and throat are connected, so a lot of that 'taste' is actually smell. The sense of taste itself is just the initial feeling of sweet/sour etc that prepares our body for different types of foods.  This is why it can be much more bearable to eat or drink things we don't particularly like if you have no sense of smell or hold your nose when you swallow it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any evidence that some civilization regarded other apes as being related to humans in someway?",
        "response": "South-american indians believe all animals once have been human and are therefore related. In what is today Brazil's coast, most populations used to have antropophagical practices. Alberto Mussa notes that, although most tribes hunted and ate monkeys and apes among other animals, some of them were known to avoid monkeys due to their similarity with humans.  Sources: Eduardo Viveiros de Castro - Cosmological Deixis and Amerindian Perspectivism (_URL_0_) Alberto Mussa - A primeira história do mundo (World's first story, not yet translated into english, i believe)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the fundamental reason the American economy is considered \"shaky\"?",
        "response": "It's not 'shaky' in any mathematical sense. There is a sense that the current gains may be temporary. If they are not, then raising the interest rate is a good idea. Lowering the rate always gives a short term boost to the economy, so raising them now lets us stock up for a future crisis. If things are only barely succeeding though, it could prevent the growth many have been looking for.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why can't Syrian refugees stay in Turkey? Isn't it safe?",
        "response": "Turkey hasn't been particularly welcoming to them. That, and there's a lot of them. They are sending out notices to refugees saying they'll have to [wait years before they can work legally in the country](_URL_0_) and their government isn't very friendly to them.  That, and many are Kurds, which Turkey just does not like, especially with Kobane and Rojava being as they are now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does sunscreen actually work to prevent sunburns?",
        "response": "It's a protective layer that blocks or absorbs the harmful UVA and UVB ray from the sun. Depending on the ingredients in the sunscreen, they can physically block the rays (like titanium dioxide), or absorb the rays (like oxybenzone) before they reach your skin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you carbonate any liquid?",
        "response": "It depends on what you define as \"act in the same way.\" Carbon dioxide is going to have a different solubility in every different liquid. The way it interacts with ethanol-water mixtures for example can be very different than mostly pure water (you can find [a lot of numbers](_URL_0_) if you want). The solubility might also be affected by the acidity of the solution as once it dissolves it likes to form carbonic acid. However, on the larger scale the way the system behaves will be the same. Some will go into solution, some will remain in the headspace and pressurize the container. Upon opening up to atmosphere some will come out and create carbonation. It will just be the magnitude of how much goes in and comes out that will change.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't water moisturizing?",
        "response": "Water doesn’t stay applied to skin very well due to oils naturally produced by the body. The nice thing about lotion and other moisturizers is they are much better at staying in contact with the skin instead of running off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many \"frames per second\" does our eye see in?",
        "response": "Your eye has no fps. Your eye is continouous feedback to yourbrain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's going on when your heart is \"thumping\"? Does your body vary the strength of heart beats, as well as the heart rate?",
        "response": "Yes, cardiac contraction force can increase. Also, the rate can change, as can the stroke volume. You might like to start reading with this: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Why can't you use electronic devices while taking off and landing in an airplane?",
        "response": "There is a minimal chance, practically nonexistent(in a modern aircraft) that your device might interfere with the airplane electronics. Now takeoffs and landings are so critical that practically nonexistent is too much of a chance. And why should everybody risk their lives so you can play on your phone, or why should your kids life be at risk because that person cannot stop his movie. But nah the risk is practically none existent. TL;DR: Risk is negligible, just be a sport and humor everyone and turn it off, or in case you cannot, hide it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the earth being 1 degree warmer so significant?",
        "response": "> If the weather was warmer by a degree on average every day there would be no difference. Well, that isn't what is being talked about. Instead think about how much energy is required to heat up the entire atmosphere and surface of Earth by one degree. A huge amount! That much energy being at work in the atmosphere can mean more powerful weather effects in the short term or in a specific area. Also think about how it gets colder as you move toward the poles. At some point water starts to freeze to ice. Now if you raise the overall temperature by one degree this would mean that point where water freezes consistently would move closer to the poles by some amount. As the change is very gradual this might mean like 100 miles, in a strip all the way around the planet for both poles. How much area is that?! And it isn't like that line is always in the same place throughout the year so ice melting at different times than normal can translate to unpredictable changes in the weather.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can US territories vote in primary elections, but not in the general election?",
        "response": "US Territories are not States. They have chosen to not become full members of the Federation and so do not have the rights of full members of the Federation.  The primaries are not actually a part of the governmental process. They are internal methods that the parties use to choose who their representative is. Since the parties are not actually a part of the government there is relatively little regulation as to what they choose to use as their criteria for choosing their representative. They do not even have to hold a vote for citizens to vote in (as seen in Colorado). They happen to allow the territories to give their opinions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast do electrons \"move\" in a conductive substance?",
        "response": "Not very fast. On the order of millimetres per second.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When converting Black and White to color, how does someone know what colors to use to match the real colors?",
        "response": "> how does someone know what colors to use to match the real colors? They don't. It's pretty much all based on guesswork or firsthand account. You can get the tone right, of course - a light grey shirt is a light *something* color, maybe pink, maybe sky blue... it's certainly not maroon or forest green. And, of course, if you know the person in the image and know they have green eyes and were wearing a red shirt and brown pants while posing by their dark green car, it makes it much easier to colorize it properly. But if you don't know what color it was supposed to be and you don't know anyone who was there to tell you or there are no firsthand accounts.... you guess.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can’t we only eat monosaccharides as a source for energy if that’s what our body breaks down carbs into anyways?",
        "response": "We certainly can eat these as an energy source. But they don't last long, and they don't contain the other nutrients we need -- not just for energy but for construction, such as protein and calcium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that I'm extremely hungry (pains and growling) when I wake up after eating food right before I go to bed?",
        "response": "This is a fairly common occurrence and has to do with buildup of acid in the stomach while you are asleep. It might help to not immediately get up and eat when you wake up, as your body will get used to it and will start producing acid in advance. It could also be a symptom of various illnesses. For more info _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is hot coffee that has gone cold disgusting, but iced coffee/cold brew delicious?",
        "response": "Your initial premise is subjective and flawed. Hot coffee that's gone cold is enjoyed by many people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do lips still sync up in slow motion music videos?",
        "response": "One way to do this is to film people moving at normal speed, but the music they're lip syncing to is sped up. That way when they slow the video down and play the song at normal speed, the song is playing normally, the lips still match as long as they sped it up the right amount in the original recording.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Rh in blood, and why does it matter?",
        "response": "A, B, and O are types of blood. Rh factor represents a protein that's present in blood. Either you have it (+) or you don't (-). It's important because, if you have a negative Rh factor, your blood will perceive (+) blood as a foreign body and try to fight it off (like an immune response to infection). If you have Rh + blood, however, you can generally accept Rh - blood. In all blood transfusions, the patient must be monitored for any adverse reaction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people get the urge to destroy things, even their own belongings, when they get angry?",
        "response": "There was a similar discussion on this subreddit a few years ago. Check this out. _URL_0_ This was the top answer. By MrPaleontologist • 4y \"Here's an explanation I learned in an animal behavior course - it's called a redirected attack. Animals do it, just like us. Basically, when we get angry at another person, we have the urge to attack them in some way. But for a variety of reasons (including that attacks are energetically costly and that actual attacks can shatter social bonds) it's actually more adaptive to redirect the attack at some other object. Thus, if I get furious at you, I'll most likely slam my hand on the table or smash something instead of punching you in the jaw and smashing your skull. Gulls have been observed to do this in territorial disputes. Instead of attacking each other, they usually will violently pull grass out of the ground in a manner similar to how they behave if in a physical confrontation.\"  I hope this helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a supersonic aircraft gets hot from compression heating, does that mean that the air behind it is colder because it transferred heat to the aircraft?",
        "response": "Not exactly, remember that airplanes aren't coasting, they are generating power from their engines, that heat ultimately is dissipated into the atmosphere. Also, consider a similar scenario: re-entering spacecraft. The spacecraft doesn't have engines producing heat as it re-enters but it is converting gravitational potential energy and kinetic energy to heat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Secret Service become bodyguards?",
        "response": "It's actually hilarious. There's a book called Stealing Lincoln's Body that lays the whole story out. Basically, some counterfeiters had this idea to bust their friend out of prison, they would steal Abraham Lincoln's body from his grave and hold it for ransom. The plan went off worse than a three stooges skit on both sides. One of the secret service guys had a shootout with a different secret service guy without realizing it, and half of the graverobbers were undercover agents. It was pretty hectic, but that event caused the secret service to start presidential protection details too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are airplane (and some car) seats not designed to conform to the human vertebral column?",
        "response": "The most likely reasoning is that properly designed seats take up room and taking up more room means less seats which means less money to make.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen of the sun was slightly farther or closer in the orbit?",
        "response": "Virtually nothing. The earth **already** gets closer to and further from the sun on the order of millions of miles every year. It would have to be a fairly large change in distance before it would have a significant effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it when in a heavy rainstorm, sunglasses can actually help make your vision clearer.",
        "response": "> Wearing polarized sunglasses when driving in the rain during the day will help a driver see better. Polarized sunglasses work to block horizontal components of scattered or reflected light, which means they help counteract the scattering of light that atmospheric effects like fog or rain have on daylight.  _URL_0_ Everything gets all shiny when it's wet so even though there's less bright light on a rainy day there's still a bunch of light scatter, glare, and reflections. Wearing polarized lenses, not just any pair of sunglasses will do, helps reduce those effects",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are cars with manual transmissions so predominant in Europe but increasingly difficult to find in the US?",
        "response": "There's not a big market for them anymore. The US has more drivers, we sit in more traffic, roads are more wide-open, and we drive further. Modern technology negates the gas mileage difference in auto and manual transmissions. Plus, they're just not making as many cars with manuals anymore. I love driving stick, but it's hard to find a new car with a manual. I wanted a Charger, but a stick shift just isn't an option.  Smaller cars and sports cars still have manual options. Smaller cars are more popular in Europe. Americans prefer bigger cars.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a country expand its borders by changing the direction of a river?",
        "response": "Sounds to me like you're asking a question about international law, when you ask \"would this be legal?\" International law is often more a question of politics than of legality. Historically, before there were international legal tribunals available to arbitrate such a dispute, I would say that \"legally\" it's probably determined by who has the most guns/swords/pointy things. If you're asking about modernity, well, it's a bit different but not much. Generally, these disputes are resolved by bilateral negotiations between the parties. You can actually get a decent sampling of how these types of disputes are currently being resolved by looking at this wikipedia page: _URL_0_ If two states didn't want to engage in a bilateral negotiations, they could appeal to the ICJ, the International Court of Justice. One of the party's could bring a complaint to the ICJ. The other party could object to the jurisdictions, which usually happens. Then the ICJ might issue a ruling on the merits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did all of the love and fascination for Jennifer Lawrence go away basically right after her nudes leaked?",
        "response": "She hasn't had any movies come out lately (and no, I'm not counting Serena because it sucked and there was no publicity gauntlet). She'll come back when the Mockingjay Pt. 2 publicity machine really gets going. 'Love and fascination' feeds on interviews and public appearances, and when a celebrity isn't doing that, people move on to the next big thing. It's the same thing with Taylor Swift -- she feels ubiquitous now, but that's just because she had an album release recently and has singles coming out every few months. In years when she doesn't put out new music, she isn't nearly as big a deal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are electrons, protons, and neutrons actually spherical?",
        "response": "Recent experiments have demonstrated that electrons are indeed \"spherical\" (i.e., there are no signs of there being an electric dipole moment in the electron). Or at least they're spherical to within 1*10^-29 cm. Scientists have observed a single electron in a Penning trap showing that the upper limit for the electron's \"radius\" is 10^-20 cm. So that means electrons are at least 99.999999999% spherical! Read the recent experiment: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did they measure the CMB (Cosmic microwave background)?",
        "response": "The CMB is measured in the microwave (and millimeter-wave) region of the electromagnetic spectrum. If you had microwave eyes and looked in a direction that was away from the plane of the Milky Way, you'd find that the 2.7K CMB was actually the brightest thing in the sky. If you go to [this page](_URL_2_) and scroll down a little you'll see [this picture](_URL_3_). The top panel is the brightness of the sky at 53GHz (about 2cm wavelength) smoothed to 10 degree angular resolution... ie very uniform. Another way to look at this is to plot the brightness of the sky vs wavelength, looking away from the ecliptic and galactic plane, as shown in the [second figure](_URL_1_) of [this web page](_URL_0_). What you can see from these is that the CMB is actually very bright compared to anything else, as long as you look at the right wavelength.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When will we get actual physical images of an exoplanet?",
        "response": "Ten years ago. A [bunch of exoplanets](_URL_0_) have been directly imaged. Of course these are specs of infrared light. If you mean a visible light photograph that looks like an \"artist's conception,\" then possibly never. There are hard physical limits to how much resolution you can get, and exoplanets are very small and very far away. Remember, the best images we could get of Pluto from Earth [looked like this](_URL_1_), and that's in our own solar system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much of an oven was a WWII tank in desert conditions?",
        "response": "*Desert Warfare: German experiences in World War II* by Major General Toppe mentions briefly that the crews just had to take it. With the hatches closed. What's worse, sometimes what ventilation system they had had to be shut down to reduce fuel consumption in combat! Tank or no, it also mentions that it was customary to give 3 hour rest period at noon whenever possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't any of the American Ebola patients have privacy dealing with their sickness? Aren't patients supposed to have medical privacy?",
        "response": "The medical staff protect their privacy, news teams have no such inhibitions",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much did hunter-gatherers walk and run on a typical day?",
        "response": "Check out the article on [persistence hunting](_URL_1_). Basically, we think early humans hunted by chasing after animals until their prey collapsed from exhaustion. Humans are uniquely suited for this because: * We run on two legs, which isn't as fast as running on four legs but is much more energy efficient, allowing better endurance. It's completely possible to run non-stop for days, as demonstrated by [this guy](_URL_0_). * Because we run upright rather than on all fours, we expose less surface area to the sun during the hottest part of the day, reducing the risk of overheating. * Also, no fur and limited body hair means our bodies aren't as well insulated and it's easier to release heat into the environment. * Our sweat mechanism is designed to cool us down when we do overheat. Other animals also sweat, but few sweat as profusely as humans. Panting is the more common method for regulating body temperature and isn't as effective.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the powder you put on top of a drink stay in a pile at the top?",
        "response": "The surface tension of the liquid vs. the weight of the powder you're putting on it. And because it's a powder, there's not a single \"focal point\" to break through the bound layer of liquid at the top of the glass like there would be with, say, the edge of an ice cube so it increases the weight the milk can hold ever so slightly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there no Grape flavored Yogurts?",
        "response": "Chobani made a grape yogurt, but I don't think it sold very well. Grape and yogurt doesn't really mix in a way that is large scale marketable to consumers. Yogurt can be kind of sour, mixing that with grape is not a flavor many people can get behind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference between 32-bit and 64-bit Windows installations, and their relation to the hardware.",
        "response": "ELI5 answer: Have you used a calculator? If yes, you will notice there is only a maximum number of digits that a calculator displays. Let's call this capacity. There are two types of hardware - 32-capacity and 64-capacity. Since all software are mathematical calculations at the very basic level, you need separate types of calculation for 32 and 64 capacity hardware. Hence different software.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has the recent declassification of the records of the french army mutinies of WW1 shed any new light on the events?",
        "response": "This was brought up somewhat recently, so you might enjoy the discussion in [this thread](_URL_0_) on the topic of the declassification of French Army documents.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a 'legal document' legal? Can I write my own contract with somebody?",
        "response": "Yes you can. In fact, you don't even need to write it down for most things! Legal documents are just documents that have a purpose to do with law or legal arrangements.  To have a contract with someone, all you need is an offer (I.e. one person lists terms to which they will agree to be legally bound), acceptance (the other person tells the first person the terms are accepted) and consideration/exchange of promises (each person is promising something to the other, e.g. to pay money, to give an object, to provide a service or benefit).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how to safely use the pirate bay",
        "response": "What are you using it for? Where are you located?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Advil/Ibuprofen affect your body after a night of drinking?",
        "response": "This isn't a \"story.\" It is a well-documented interaction. The drug reduces inflammation in the body but has a common side effect which is increased risk of ulcers in the stomach because it prevents the formation of mucus (which protects the stomach from the acids in it). Pair this with alcohol, which thins the blood, and you have a situation where you have higher risk for developing bleeding ulcers in the stomach and blood which clots less readily. Upper GI bleeds are no joke.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does increasing the average temperature on Earth by less than 10 degrees have such a large impact?",
        "response": "Imagine you are on a seesaw, ballancing in the very middle. Now take one step to either end and you will go down. One step isn't that much, however it is enough. Now imagine how large a step back you would have to take to get the seesaw back in ballance. With that I mean is that there is a point of no return.  For the seesaw that means that you will not get it back in ballance and one end will touch the ground. For the climate it means that it will change so drastically that much of the planet will become unsuitable for human habitation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the atomic correlate of light passing through tranparant material more easily than through non-transparants?",
        "response": "The electrons of the material don't scatter or absorb the wavelengths of light the material is transparent to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is some food when warm much heavier on your stomach than when cold?",
        "response": "It has nothing to do with viscosity. In your brain, the hypothalamus, which regulates the sensations of hunger and satiety receives many inputs from different parts of your body. It also receives a sense of temperature from both your visceral organs and the rest of your body. Low temperatures promote increased hunger and thus increased food intake. High temperatures lower your food intake because it stimulates the satiety center in the hypothalamus. I just recently answered a question about appetite [here](_URL_0_). If you'd like a more in depth answer you can take a look there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Canadians get stereotyped as being \"polite\"",
        "response": "By being really polite. In my opinion because they were founded by a certain section of the British that valued politeness, as did the Ynited States, but then the US broke off from the UK earlier, and also got an extra helping of Scots-Irish, Italian, Irish, Spanish, and Latin to brash them up a bit more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it feel normal to sit back down in your chair, but if you sit in someone else's it feels warm? Why can't we feel our own butt warms?",
        "response": "When you sit in a chair it will change to the temperature of your body. So you wouldn't know the difference because the temperatures would get to the same degree as you currently are. Other people's body may be at a higher temperature at the time so you will notice the difference as the chair would be as warm as the person was.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "We all know that as we look at more distant objects the further in time they are. My question is aren't we also looking back at *less* volume in the universe since the universe then was smaller than it is now? Do we need to consider such (foolish?) things.",
        "response": "> If we're in an expanding universe as we look further away the universe should be smaller than it is presently It was smaller in the past. It is not small any more.  > Do we need to consider such (foolish?) things. Yes, and it leads to [many different distance definitions](_URL_0_) in astronomy/cosmology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The XKCD blue eyes question",
        "response": "Someone correct me if I'm wrong, but the brown eyed people and the green eyed guru will never leave. They only know that they don't have blue eyes. The brown eyed people know that there are at least three eye colours: brown, blue and green. Once all the blue eyed people are gone, they don't know if their own eyes are brown, green or - as the puzzle suggest - red. they might be chequered for all these people know. The guru doesn't know her own eye-color, either. The blue-eyeds are ignoring it fore their counting excercise, because her colour doesn't change what she said: I can see at least one person with blue eyes. She would have seen the same thing regardless of her own eye colour. If her eyes had been blue, nothing would change. She would not be counted. Well, I think the guru would have \"left\" the island in the sense that she'd get stabbed to death by everybody else for ensuring they were stuck ion the island either forever or at least another 100 days ...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did people stop carrying proper shields into combat?",
        "response": "according to John France, shields became less and less popular at the end of the thirteenth century (along with shrinking in size) due to advancement in armor technology. Plate mail became so effective that the shield, which had until then been the most effective equipment for turning blows, became more bother than it was worth. At the battle of Agincourt (1415) the french knights greatly favored greatswords and polearms to shields and one-handed weapons. Shields were still used at Jousts until the sixteenth century, to deflect the lance-blow, but they were generally much smaller than medieval shields. Light infantry and skirmishers armed with hand-to-hand weapons also continued to use shields until the 18th century, while gun-wielding infantry and pikemen, which were the norm since the late 15th century, didn't use shields at all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that long distance shooters tend to use bolt action rifles? Can a magazine fed semi-auto not do the same job?",
        "response": "A semi-automatic weapon uses either some of the recoil from a shot, or gas from the shot to cycle it's action. This means that the action begins moving while the projectile is still inside of the weapon. The motion of the action moves the gun, and can affect the accuracy of the shot.  A bolt action stays in place and remains a solid unit the shooter manually works it. This reduced amount of motion leads to greater accuracy.  Great strides have been made in making the actions of certain semi-auto weapons more stable and accurate, and there are a lot of solid options available. At the end of the day though, if we're talking the absolute best weapon with each type of action, in the hands of a highly skilled shooter, the bolt action will win out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what's the point of having 2 kidneys?",
        "response": "Because if it fails you're left with no kidneys. And that REALLY sucks.  It's nature's redundancy system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During WWII, how did Germany reconcile their Aryan supremacism with their alliance to Japan?",
        "response": "Adolf Hitler spoke about how much he admired the Japanese people. He spoke of them as having pride in their race due to their limited mixing with peoples of other races. To Hitler keeping one's bloodline pure should be the goal of all races.  He also spoke of them as having a long and proud history that rivaled that of Germany's. He basically viewed them as honourary Aryans.  * \"Hitler\" by Ian Kershaw",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "People say that the British were really the revolutionaries in 1763, while the colonists were the conservatives trying to preserve the status quo. How is this true?",
        "response": "This comes from the reason for the revolt. After the English Civil War the colonies had been basically operating by themselves with little interference from London. However after the seven years war and the glorious revolution the new British state was heavily in debt and so needed to raise taxes. For London it looked like the colonies hadn't been contributing much to the empire. As such they began to increase their control over the territory and increase taxation. The American colonists didn't like this as they'd gone through decades of running their own affairs. Now they tried to come to an agreement on this by demanding a member in parliament seeing that if they must pay taxes then they should have a say in both its design and use. When London refused the local elites decided it was better to go it alone. The argument going that they were only trying to preserve the status quo. Hope that helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "IF sound could travel through space, how loud would The Sun be?",
        "response": "_URL_3_ \"In 2006, NASA discovered \"space roar\" —a sound that's six times louder than what they expected to hear when they eavesdropped on space. Inexplicably weird, right? Stuff to Blow Your Mind explores.\" A really good podcast in general if your into multitasking while also being entertained.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a single speaker, such as earphones, produce highs and lows at the same time",
        "response": "[This figure should help explain it.](_URL_2_) A shows 4 waves each with different frequencies and C shows what you get when you combine those waves together. (Ignore B and D). A combination of different sound waves creates a single wave with a unique pattern. So instead of a speaker moving in and out by same amount (wave amplitude) at a steady rate (wave frequency) it does a mixture of varying amplitude and frequency to create one sound wave that sounds like what you get when you combine lots of different sounds.   Copy pasted this from last time I answered a similar question - [_URL_1_](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do seagulls tap the ground constantly with their feet?",
        "response": "It's something called worm charming: by causing the ground to vibrate the worms are encouraged to surface. It's something humans do (or used to do) as well to use them as bait for fishing. Stomping the ground (with your feet or with a shovel) will bring earthworms to the surface. Supposedly this is because it is similar to the movement of moles, a natural predator of earthworms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does smoking cause cancer?",
        "response": "Smoke from cigarettes (or anything else) contains chemicals called carcinogens. The main thing that these chemicals do to cause cancer is change your DNA, the blueprint that each of your cells uses to copy itself. Most of the time, changes just cause the cell to die because it messes itself up. However, sometimes these changes make the cell keep copying itself and never dying and you build up a massive number of cells that aren't working correctly. That is what a cancerous tumor is. Because the smoke carries the chemicals through your breath, smoking most often causes cancer in areas directly connected like the lungs, mouth, and throat. Some of the chemicals go into your blood and are carried around your body and they can cause cancer pretty much anywhere.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I move a 1 lightyear long \"stick\", why wouldn't the other end move instantaneously?",
        "response": "Because there's no such thing as a perfectly rigid material. The compression wave from you pushing one end would travel through the stick at the speed of sound, so even if you could push enough energy into your end of the stick, there'd be a huge lag before anything happened at the other end.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is data mining? What are some real world applications where data mining is used?",
        "response": "Data mining simply means to find the data that interests in a mountain of data. (Just like you want to find this minerals that interests you in a mountain of rock when doing actual mining, hence the name). Take google as an example. They collect a lot of data about you when you use their services. They then use cleaver computer programs to try to sift though that massive amounts of data to find that they are interested in: information they can use to target ads to you. But the principle is the same no matter what the data is and what you are looking for.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did any general or army in the history used the \"spies\" as they are portrayed in the game \"Team Fortress 2\"?",
        "response": "A specific example somewhat similar that I can think of is during Operation Entebbe (Israeli commandos sent to free hostages in Uganda), the Israeli troops travelled towards the airport in vehicles meant to mimic that used by Idi Amin, to avoid arousing suspicion. However, they came in a black Mercedes and accompanying Landrovers, and one of the Ugandan guards realized Amin had recently switched to a white Mercedes, so the Israelis were forced to shoot the guards. Additionally, there was a lot of confusion during the 1948 Independence War, because the Israelis and Arab Legion used identical armoured vehicles, and Israeli troops wore kefiyyahs (as was the fashion at the time), making it difficult for both combatants and civilians to determine who was on which side (and both Israeli and Arab commanders used that fact to their advantage on several occasions, such as at Lydda).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Realistically (if that even applies here) how would space combat work?",
        "response": "This question is dealt with in extraordinary depth [here](_URL_0_) if you're interested.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "New credit cards offer me 0% APR for the first 18 months but now the credit account I've held in good standing for years is charging me 22%. Why isn't this the other way around?",
        "response": "Because the new card is trying to entice to you to switch to them so that later when the APR goes up they’ll make money.  It’s the same concept behind cell phone carriers, internet/cable providers, gyms, etc offering amazing deals upfront and then raising the fees later.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Somebody commits a murder but is found to be criminally insane. What happens then?",
        "response": "It depends. If the person is found to be incompetent to the point he or she did not understand that an act would result in death, he or she may be found not guilty by reason of insanity, but still be treated for the mental disorder. Such treatment would generally involve confinement in a maximum security mental hospital. An example would be if the person had the mental function of a five-year old and thought that hitting someone over the head with an anvil would result in the person chasing road-runners, (aka, the cartoon defense) he may be found not guilty.  On the other hand, if you have a belief that you are an Angel and that voices are telling you to kill someone or you will be tortured as a demon and you pick someone to kill, you may still do prison time. The reason being, you made the conscious decision to kill someone. It doesn't matter that your belief caused you to kill. You may get a lighter sentence and mental health care, but you would still do prison time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"unity\" when referring to nuclear fusion?",
        "response": "Unity here means 1 \"...resulting in a fuel gain greater than unity.\" is exact synonym of \"...resulting in a fuel gain greater than 1.\" fuel gain is defined by the ratio of enery produced by the fuel over energy consumed to make the machine work. If it's below unity (ie below 1) your machine is consuming energy. If it's greater than unity (ie greater than 1) your machine produces energy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does everything liquid...",
        "response": "Liquid is just a state of matter; any element can be a liquid given the right conditions (temperature, pressure). Most liquids that are fit for consumption are basically things dissolved in water because water is liquid at standard temperatures and pressures, is abundant, and is a universal solvent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can it be cheaper for NASA to contract SpaceX instead of running their own missions?",
        "response": "To generalize a fair amount, NASA has always been where the scientists worked while defense contractors were where the engineers worked. So in the glory days of the Apollo missions, you had NASA scientists figuring out the environmental conditions and then companies like Rockwell and Grumman actually designing the vehicles. In the modern day, all of the science necessary to build space vehicles is largely done and all that remains is the engineering. Since the engineering has always been handled by private companies rather than the government and operations isn't a particularly complex task, it makes sense for private companies to take over most of the task.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What physically happens to the body in a morphine overdose?",
        "response": "Painkillers (such as morphing, heroin, OxyContin, etc) relax muscles as well. In large enough doses, the person is literally unable to move a muscle, voluntarily or otherwise.  This means that the diaphragm, which is the muscle used to breathe, cannot contract. The person suffocates because the brain can not activate the diaphragm muscle to contract(breath in).  In even larger doses, the heart can stop as well, though most people die from suffocation rather than their heart stopping.  Don’t do drugs, kids.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will the US financial economy ever recover to the same degree of the mid-2000 collapse? Interest rates on bank CD's etc. Is it possible to surpass previous levels of financial security somehow?",
        "response": "The economy is generally very cyclical, so...yes...we can expect the economy to boom and bust over and over again. As for your specific examples, using higher interest rates as a generalized barometer for \"the economy\" isn't a very good yard stick. It is reasonable to say that our very low interest rates currently are the result of conditions in the economy that aren't good, but...high interests are an equally large problem as they decrease investment. For example, increases in interest rates correlate to [slower growth in the stock market](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a pull switch work?",
        "response": "Do you understand how a \"push\" switch work? It's like a ballpoint pen: the button can take two positions (up and down) and there's a coil trying to push the button up. When you force against the coil and release, it changes from up to down or the opposite. When it's down, the circuit is closed and the light is on. Well, a pull switch is basically the same, except that instead of pushing a button from the top, you're pulling it from the bottom. Some pull switches have more than two positions, where each pull would make a wheel rotate to the next position.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Does Install Shield Do?",
        "response": "InstallShield is a tool to build installers. It's not the only way to build installers, but it's a pretty common one. Saying \"why do programs need it\" is like saying \"why do people need Chrome\" -- they don't, but it's quite convenient and so is fairly popular.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it sunnier in the summer and cloudier in the winter?",
        "response": "Several factors but if I had to oversimplify... Because it is hot or cold... Ambient temperature and barometric pressure (air pressure) affect the condensation temperature and dew point. In simpler words if it is hot the air will take more water if it is cold air will take less water. Cold air with lots of water tends to condensate the water forming very small droplets that in turn form clouds/fog. I'm no meteorologist so there might be more to that story that I don't know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fast does something have to move through our field of view for the movement to be noticeable?",
        "response": "This question is impossible to answer with a single number. The threshold for motion detection changes as a function of: 1. Object contrast. Higher contrast objects are more easily noticed.  2. Size of the object. Larger objects are easier to detect.  3. Light level. Motion detection is more sensitive in rod circuitry (low light) than in cone circuitry (bright light).  4. Retinal eccentricity. Objects in peripheral vision need to travel a greater distance to be detected than objects in the fovea.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did flight evolve?",
        "response": "Those are some of the most common theories of how it could have happened. * Wings evolved from arms used to capture small prey. (This seems rational, so we can ask whether the ancestral forms were actually doing this.) * Wings evolved because bipedal animals were leaping into the air; large wings assisted leaping. (This is possible; any amount of wing could assist leaping. Remember that we first need phylogenetic evidence for a bipedal running or leaping origin.) *  Wings were used as sexual display structures; bigger wings were preferred by potential mates. (This is a non-falsifiable evolutionary hypothesis — we cannot test it.) *  Wings evolved from gliding ancestors who began to flap their gliding structures in order to produce thrust. (This is reasonable and possible, but only with phylogenetic evidence for an arboreal gliding origin.)  [source](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a hostage negotiator convince the hostage-taker to release the hostage?",
        "response": "Fatigue, mostly. Most hostage situations are unplanned, and the hostage-taker is under a large amount of stress trying to manage a situation that has spun out of control. This is exhausting, and usually, all the negotiator has to do wear them down by waiting them out. The only leverage they have is if they authorities believe they will kill hostages, a more serious crime than anything they are likely facing. But if they do kill a hostage, the possibility of further deaths will usually justify the risk of ending the situation by force, almost certainly killing them. The negotiator gentler lets them know death or surrender are their only real options. Also, the purpose of the negotiator is not just to end the situation peacefully. They are evaluating the hostage-takers state of mind to determine when to use force, and to manipulate them into a situation where force will be most effective.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our thoughts, in our minds, are in our first language, how do animals perceive their own thoughts?",
        "response": "Not everyone thinks in words or sentences, many humans think in pure emotion, in colours or sounds, or in action impulses. Also, thought-wording doesn't always come to us in our first language, when I was learning American Sign Language in high school, some of my thoughts happened in ASL instead of spoken English. As the years between high school and now grew greater, I slowly switched back to spoken English for thought-wording. Animals have vastly differing languages from critter to critter, so those with true repeatable \"words\" (some birds, some dolphins, etc) probably incorporate them into some thought, while others may think only in action or emotion impulses.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does gerrymandering matter?",
        "response": "Let's say you have a \"state\" of 100 people. 60 of these people are registered Awesomecrats, and 40 are registered Coolicans. Now say these 100 people have to be divided into ten districts. One districting scenario would end up with six of those districts containing only Awesomecrats, and four containing only Coolicans. The number of Awesomecrats and Coolicans elected to office would mirror the makeup population at large. Now, suppose instead of dividing it up that way, each district had 6 Awesomecrats and 4 Coolicans. It still adds up, but now it's highly unlikely that more than a few Coolicans will be elected to office.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What determines the axis of a black hole's accretion disk? Is its orientation always stable?",
        "response": "The accretion disc of any collapsing dust cloud emerges from the shape of the cloud and the initial velocities of the particles. As opposing momentums cancel and similar momentums combine, the cloud gradually develops a spin which reinforces itself by first accelerating the surrounding orbiting particles into having a complementary momentum, and then pulling them into an impact which adds to the angular momentum of the disc. After a stellar object (and an accretion disc) have built up this angular momentum, its orientation is very resistant to being changed, exactly like a gyroscope's (and why we put rifling in our guns to make bullets spin when they are shot out). The orientation can change, though, similarly to how there's a precession in the Earth's rotation. It just takes enormous forces to do so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the noise your belly makes when you are hungry, and how/why it's made.",
        "response": "It coincides with you being hungry, rather than being caused by it. When you're hungry, your stomach releases hormones telling your brain \"hey there's no food here, go get some\". Around that some time, your intestines will clean out the intestines. Usually, they will contract around food to squeeze it through, like squeezing toothpaste out of a tube. But when you haven't eaten, it does smething called a migrating motility complex, where it pushes food from the start of the intestines to the end. It basically picks up scraps that you left behind.  During this movement, gases and liquids move around in your intestines, which cause the rumbling sound. If you put your ear to someone's stomach you can hear rumbling almost all the time, but when a large movement occurs, it becomes much louder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Between distant galaxies is space stretched or created to expand the universe?",
        "response": "It is, in my opinion, more appropriate to say new space is being added between galaxies. But that light crossing that distance is being stretched.  The way I think is apporpriate to look at space-time is that space is the set of all possible measurements you can make with a ruler, and time all possible measures on a clock. So, as the universe gets older, there are more possible measurements to make between two points. More \"space\" has been added.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If space is a vacuum how do space craft propel themselves? Where does the thrust come from in a void?",
        "response": "Conversation of momentum.  Imagine you're at rest in space holding a bowling ball. So the total momentum of the system (system == you + bowling ball) is 0. Throw the bowling ball away from you. So it then has some nonzero momentum. You must also therefore have a nonzero momentum in the opposite direction to keep the total momentum 0.  Same idea, except spaceships use gas instead of bowling balls.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to a text message after being sent, but before being received?",
        "response": "text messages go through cell service which is available when you have almost no service. Group messages are considered multi-media-messages and require a data connection, which you didn't have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there no English language surnames with \"of\"?",
        "response": "If Wikipedia is correct in that surnames took until ~1400 to be common among the English, then I have an answer.  French was still the lingua franca, bad pun intended, among the elite for 3 centuries while surnames were beginning to catch on. You would have to pick de / d' if you were well-to-do, and it is likely the relatively elite who would take up the custom of surnames first, then the middling merchant class, then the peasantry. Even the word 'surname' came from Frenchmen. French was the language of Parliament and the courts until about that time. The Pleading in English Act of 1362 forced the courts et al. to speak in English, and record in Latin, replacing French. The first king to take his oath in English and not French was Henry IV (1399-1413). His son Henry 5.0 was the first to be able to actually write in English (all of this since 1066 of course.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there ever a place where communism worked as intended?",
        "response": "One must define communism because this word is thrown around a lot.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The reasons behind the student protests in quebec canada",
        "response": "The price of college tuition is going up, by about $1800 Canadian per semester. The students are unhappy about being charged more for tuition and decided to protest. Some students are just there to get an education and will pay the increase. Some were unhappy about the increase but had a peaceful protest to keep tuition low. Some were unhappy and more or less decided to riot against the government. Many observers point out that Quebec will still have some of the lowest tuition costs in the Western world after the tuition hike and therefore have low sympathy for the rioters.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did sailing ships ever have a second crew to keep sailing at night?",
        "response": "Provided there was a full compliment, there were shifts, or watches.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "where did the video game term \"boss\" (referring to enemies much more difficult than average) come from and why is it still so prevalent?",
        "response": "Because the \"boss\" was generally the person in charge of the operations in a game or level. Much like a boss is in charge of employees in a workplace. This then came to mean any enemy that was significant to the story, completion of the level, or was simply significantly stronger and/or unique. For instance, there's the game boss, which would be the final enemy of a game, a level boss (self explanatory), mini-boss (a single strong enemy in a group) and pseudoboss (normally a unique enemy that gives you something for beating him).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we open our mouths when we are surprised by something?",
        "response": "To take in extra oxygen for your muscles because you are in shock and preparing to run/fight/",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do phone boot logos always seem so choppy when phones are capable of 60fps?",
        "response": "When a phone is just booting up, it is not able to access every part of the phone yet. Kind of like when you just wake up and can't solve a math problem. If it is \"capable\" of 60fps, that doesn't mean it will always operate that way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do gut microbes get passed from mother to child if the microbes live in the intestines and the baby passes through the vagina?",
        "response": "Populations of \"fecal\" microbes are also found on the skin (especially the perineum) and overlap significantly with organisms normally found in the vagina. Check out this body site map: [_URL_0_](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does swallowing mucus prolong a cold?",
        "response": "Related question: does swallowing this mucus as opposed to blowing it out cause a sore throat or stomach discomfort?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do animals that only eat meat or only eat specific types of plants get all their nutrients the way humans are recommended to get?",
        "response": "Specifically using cats as an example.  Cats are obligate carnivores, cats can only eat meat.  Cats can produce vitamin C in their bodies.  Humans can’t, humans need to eat vitamin C. Humans are not cats.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Looking for book recommendations r/e the Battle of Moscow",
        "response": "I read *Moscow 1941: A City and its People at War* by Rodric Braithwaite a few years ago and found it to be really interesting. I'm unsure of its reception among the scholars of Soviet Russia, but from my recollection it has quite a bit of discussion of civilian life in Moscow at the time of the battle. I'm not sure I'd say it focuses on the civilian perspective so much as it tries to take in all of the major aspects of what the city was like at the time (including military, political, etc.).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the word for 'mum/mother' sound so similar across nearly all languages?",
        "response": "Äiti, haha, nënë, walida, unitsi, pia, hooyo... Your premise (\"nearly all languages\") is obviously false. Related languages, however, are likely to share some words - especially words that would be very old. English is related to a *lot* of languages through the Proto-Indo-European root language, from which *mother* derives, and from which Latin, Germanic, and Slavic languages get the word (and those three families cover the vast majority of modern Europe).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Tell me why my beer foams over when my drunk buddy hits his bottle on the top of mine",
        "response": "There was a great video to a similar question, but I can't find it. It's a process called cavitation. Essentially when the bottle jerks downward, the beer stays where it was. If you watch in slow motion you can see a vacuum that forms at the bottom of the bottle and as the carbonated liquid slams back downwards to fill the vacuum a chain reaction occurs forcing the foam up and out of the bottle. Also, as a five year old I encourage you to lay off the sauce.  Edit: I'm drunk. You should probably listen to someone with better credentials.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What qualification did Spartan women needed for their name to be put on their grave?",
        "response": "Spartan women were buried in unmarked graves unless they had died in childbirth. Men were buried in unmarked graves unless they had died in battle. Source: undergraduate Greek class, this book: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the 'Library of Babel', exactly? How can it anticipate everything I write?",
        "response": "*The Library of Babel* is a story about the titular library, which contains all possible arrangements of letters in books of a standard length. This means that it must contain all knowledge of the universe, but tragically, it is indistinguishable from all falsehoods, since the arrangements are mere random letters. (Not to mention that either is hard to find among the gibberish.) Are you referring to the website that implements this concept? Instead of storing all the possible text, it generates it according to a set of rules, allowing retrieval of any \"book\" on request and being theoretically complete, without actually having to actually store all that data.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a \"credit score\" and why is it so important in US?",
        "response": "> Why would I get a loan I dont need, to pay for stuff I can already afford? To prove that we can be trusted in purchasing things we cannot afford immediately. Buying a house in the US can easily cost over a million Leu equivalent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it easier to get off a push bike and walk up a hill, rather than riding up the hill?",
        "response": "Gears, or lack thereof. Essentially, you get better leverage on the hill with your legs than with the relatively short pedals. But if you have enough gears to increase your leverage, it’s no effort at all, just slow.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the planets in our solar system in the same vertical plane?",
        "response": "The orbits of the planets are coplanar because during the Solar System's formation, the planets formed out of a disk of dust which surrounded the Sun. Because that disk of dust was a disk, all in a plane, all of the planets formed in a plane as well.        Stolen from Ask an Astronomer at _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why so some power plugs (Australia specific) have two metal prongs while others have three metal prongs?",
        "response": "The 2 pins are live and neutral. The third pin (not always present) is the earth pin, which in case the appliance is faulty/damaged etc. The electricity will return to earth via this cable and not through you and your heart killing you!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do flights in America seem to cost ten times as much as European flights?",
        "response": "I just looked up prices on a few intra-Europe flights and it does appear that there are some great deals to be had on European flights, but when requesting specific dates like most people do the prices are in the same ballpark as US prices. Also remember that the US is larger than all of western Europe put together!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do your pupils dilate when you take Psychedelic drugs?",
        "response": "depends on the drugs or your definition of psychedelic. if you mean sensory hallucinations (drugs known as hallucinogens) then its because they generally act as stimulants (another word for drugs that overclock your brain) and since your eyes are now processing more light back at the cerebral end and your heart rate is up to feed your brain (as well as your eyes coincidentally), then you dilate (vasodilator and pupillary dilate) this dilation is therefore twofold - your eyes are literally able to take more light on, and also the nerves that stimulate your heart are closely related to the nerves that dilate your eyes. i would go so far as to say that the phrase \"you need to open up\" has a very literal meaning here, because your emotional openness is almost a gradient of how much you can activate and control/digest the info from this cluster of nerves, called your sympathetic and parasymphatetic nerves",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are bugs so good at getting in the house, but so bad at getting out?",
        "response": "If there are a lot of bugs outside only one has to find its way inside for you to notice. If there is one bug inside that bug specifically has to find its way outside for you to notice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the US is a constitutional Republic why does everyone call it a democracy?",
        "response": "Democracy means people vote. A Direct Democracy: The voters vote for laws themselves.  A Republic: The voters vote in officials, whose job it is to represent them by voting in the smaller, yet more powerful bracket . This is a type of democracy.  Sometimes, even in the US, voters vote for laws directly. This is called a referendum.         Generally, we have our elected officials make choices us for because there's *so* many things to know and do - it would be too time consuming for millions of people to go out everyday and on budgets and tax policy.        Next time someone says \"the US isnt a democracy anyways! It's a republic!\" - you'll know they're an idiot.  However, there's a lot to say about a democracy being fair and ethical. At what point does voter suppression and disenfranchisement mean a democracy is no longer that? That's an entirely different conversation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In American courts, why do you have to refer to the judge as \"your honor\"?",
        "response": "It's because of our roots in the British legal system. There, the courts are considered a direct extension of the Queens (or Kings) will; as such, when you call a judge \"your honor\", you are referring to their position and respecting the monarchy, rather than the actual person wearing the robes. That's also why judges are only referred to as your honor during court, as opposed to when they're just wandering around in public (unlike something like the title of doctor, where the respect is seen as something personal and inherent to the doctor). Now obviously the American legal system is not a representation of Elizabeth, but we kind of branched into representing a more abstract notion of justice, so we still use your honor. Also notable is that we don't extend such niceties to politicians, who after the revolution were explicably not tied to the divine will of a monarch. Hopefully this also informs the idea of the severity of contempt of court",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the star that created our solar system and the non-hydrogen elements on earth?",
        "response": "Most likely, it wasn't a single star. The heavy elements - beyond carbon and oxygen - are mostly produced in stars that go supernova. In fact, the solar system lies in a \"bubble\" called the [Local Bubble](_URL_0_) that is believed to be a remnant of one or more of these ancient supernovae.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When someone is sentenced to death, why are they kept in death row for years?",
        "response": "Because they're appealing their case. The government is very lenient about allowing death penalty appeals to go forward (and even *requires* them a lot of the time), because it's impossible to undo or compensate for a mistaken execution.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was sulfur used for wounds in WW2?",
        "response": "A class of chemicals known as sulphomanides were the first antibiotics to be discovered and used in a systematic way. They were derived from a drug called Protosil, discovered by the Bayer Corporation in 1932. This was actually a red dye, which had no effect on bacteria outside of a living organism. Inside one, the dye was broken down into several molecules, one of which had the antibiotic effect. This molecule was isolated, and called Sulphanilimide. Powdered Sulphanilimide was used as an antibiotic during WW2, especially in combat situations, as you mention. It's use greatly reduced the risk of infection from wounds. As it's systematic name is too complicated for daily use, it was commonly shortened to Sulfa. Nowadays, penicillin derivatives and similar chemicals are used for the same purpose, but these were not commonly available at the time. The method for mass-producing penicillin was only discovered in 1941, and even this produced a low yield compared to modern techniques.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between powered wheelchairs and mobility scooters and why choose one over the other?",
        "response": "Powered wheelchairs are usually intended for people who need them on a permanent basis- meaning they cannot walk or stand at all.  Motorized scooters are usually for people who can't walk unassisted or for long periods of time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a sailboat sail into the wind?",
        "response": "The short answer is: It doesn't. At least not directly into the wind. You can sail close to the direction of the wind.  The wind on the sail acts a bit like a wing on a plane. The wind flowing over the back of the sale moves faster than the front, which creates lift. This lift will push the boat forward and sideways.  The force pushing you sideways is very strong, so you have a keel under the boat. This goes down under the boat and is filled with lead weights to keep the boat from tipping. The end result is the boat leans quite a bit, but doesn't tip, and moves forward. If you wanted to go directly into the wind you couldn't. Instead you would tack. It would look like a zig zag pattern, with overall progressing heading into the wind, but never sailing directly at it. Imagine switchbacks up a mountain. You can't go straight up, but you can go back and forth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Let's say a 25-digit code is flashed in front of my eyes. Do I now subconsciously 'know' that code?",
        "response": "Maybe if you had \"photographic\" memory (which is related to strong sensory memory). But that would also require you to keep processing that sensory memory in order to move it into long term memory. What we can see and work with quickly is generally capped. For example, [Visual Working Memory caps out at about 4 items](_URL_0_) and [subitizing caps out at about 7](_URL_1_) (subitizing is how you can quickly tell there is a certain number of items that you see, without counting them individually). EDIT: Should clarify that Visual Working Memory is different than Working Memory, which is also involved. You can deal with more objects in Working Memory (as lolmonger posted) than in Visual Working Memory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does our sense of taste generally prefer unhealthy things (pizza, burger etc.) over healthy ones (broccoli etc.)?",
        "response": "We evolved as wild creatures where crucial nutrients like fat, salt and sugar were hard to find, so we crave them. Now due to modern technology/agriculture they're everywhere, but our urges haven't changed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were wheel alignments performed on automobiles before the modern wheel alignment computer machines came out?",
        "response": "You measure the space between the fronts of both tires and you measure the space between the backs and you adjust things until the two measurements line up",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do graphics that show how gravity works always depict spacetime as a 2-dimensional surface (like a stretchy piece of rubber with heavy balls sitting on it representing planets & stars) - and how would it look if spacetime was shown in 3 dimensions?",
        "response": "Because a 3D sheet would require working in 4 dimesions which can neither do nor comprehend. When you have the 2D sheet the gravity is shown by moving in the third dimension. So on a 3D sheet gravity would be shown by moving in the fourth dimension. Also it would add nothing to the explanation to add the extra dimension were it possible",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do some parts of the light spectrum actually travel more slowly?",
        "response": "Light only travels at c when it is in a vacuum.  Light passing through matter travels slower. The amount of slowing depends on wavelength.  So, while inside a prism or lens (or air), yes, different colors of light travel at different speeds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My voice I hear in my head.",
        "response": "There was a study done that shows when you read silently you actually combine several different sensory systems, including your auditory system. The part of your auditory cortex that usually responds to speech also processes written words as if they were spoken. So that \"inner voice\" is actually something our brain \"hears.\" While there are no actual sound waves, our brain responds as if there were.  Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If medical science continues to advance, theoretically, how long could humans live?",
        "response": "> This was probably due to better nutrition and modern medical advances. Arguably, most of the increase in life expectancy is due to better public health practices rather than medical advances. In the early 20th century, many diseases were on the decline as a result of safer drinking water and better sanitation practices. Life expectancy in the US was rising even before the widespread adoption of medical advances such as antibiotics and vaccination. Many Americans by and large did not have access to competent medical providers until several decades into the 20th century. Additionally, many American doctors were behind European doctors in scientific knowledge. In particular, many countryside doctors were reluctant to embrace germ theory and there were still doctors in the 1920s in the US practicing medicine the way a doctor would have in the 1820s.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does giving birth hurt, even though it harms reproduction? why was it not removed through natural selection?",
        "response": "Human reproduction is limited by two of humanity's most useful advantages: We stand upright and are very intelligent. Standing upright requires a relatively narrow pelvis. Being very intelligent requires a relatively large brain, and therefore skull. Yet the skull must fit through the pelvis at birth! So a middle ground is found and we are adapted to have babies born relatively undeveloped, so their skull bone plates are not fused yet and their brain is smaller. It hurts, but pain isn't a limiting factor on reproductive success. A consequence of being born undeveloped is that human children are vulnerable and delicate. They need constant care and protection to survive, and so have frequent cries that their parents are biologically wired to respond to. So we have covered why childbirth is painful and babies are annoying little shits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is silver chloride so insoluble?",
        "response": "I think that you're right in that the lattice is very stable and hard to break apart. But, it is also important to take into account the products - silver and chloride ions apparently cannot form strong enough bonds with water to compensate for the breaking of the lattice And the reason for that is probably 'something something size, something something orbitals'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Illegal immigration vs immigration vs refugees vs asylum seeking",
        "response": "Refugees and asylum seekers are requesting legal permission to stay in a country, because of problems in their home country. Illegal immigrants are staying in a country without permission.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is happening to cause pain in our chests when we hold our breath? Or put another way, how does oxygen flow prevent pain?",
        "response": "The real reason you feel the need to breathe is because of the carbon dioxide building up in your blood. Taking in oxygen removes the dissolved carbon dioxide from your body. So basically, the real reason you can't hold your breath for very long is that you need to expel the carbon dioxide from your body. You actually have plenty of oxygen still in your blood when you feel the need to breathe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could there be an intelligent civilization in the ocean that we just haven't found yet?",
        "response": "Deep ocean is mostly cold, empty and has little energy and nutrients (almost all of that falls from the surface). Brains consume lots of energy, if your food is sparsely distributed and there is very little of it, big brains don't make evolutionary sense. No matter how smart you are, your options are limited by environment.  If there would be intelligent species in the deep ocean, it would probably be like Eskimos. Small population trying to survive in demanding environment. If you want to build civilization and advanced culture, you need to concentrate many individuals on same place, have free time and specialization. Farming enabled humans to create civilization. I don't think it would be possible in the ocean. No sun, no energy. [Advanced civilizations consume lots of energy](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Aspartame (artificial sweetner) really that bad for you?",
        "response": "Maybe, maybe not. There are people who cannot tolerate the products that it is metabolized into and therefore should not consume aspartame. It is a [rather specific disease](_URL_0_) and you'd know if you had it. There were cancer scares, but they seem to have been scientifically overblown. Current opinions are that not only is aspartame not carcinogenic, the concentrations that lead from consumption are not high enough to be dangerous. All studies on other concerns were found to be groundless, as the concentrations of the metabolites that are suggested as dangerous are much smaller than would be found in other foods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do TV ratings work in the UK?",
        "response": "Television ratings in the UK are measured by an organisation called BARB. They have a [page with very informative videos explaining how they get their figures](_URL_0_), but to answer your specific questions:  > What if people record a show but never watch it, would that be counted? No. A recorded programme that is not watched within 28 days will never be counted.  > What if you record a show whilst watching it live, then delete the recording later, is that counted as 2 ratings? No. Recording the programme does not count as watching it. It has to be viewed either live, or within four weeks of first broadcast, for it to get counted by BARB.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the grammatical differences between parentheses \"( )\", square brackets \"[ ]\", and squiggly brackets \"{ }\"?",
        "response": "I dont know about overriding, but [ ] are used to insert words into quotes in order to make the quote more clear to the reader. This also tells the reader that the words were added by the author.  \"Went to the park to play.\" \"[We] went to the park to play.\" The second example provides clarity to the subject matter of the quote.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Working class opposition to unions.",
        "response": "In many cases it simply comes down to fear. For example, my father's place of employment tried to unionize. Management started rumors that they wouldn't be able to afford it if a union came in and would have to shut the sawmill down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From 1950s to today, what caused exponential increase of US housing prices",
        "response": "It wasn’t really that dramatic of an increase. Stocks increased way more in the same period.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How sea life can exist at such extreme depths.",
        "response": "They're adapted to those depths. In fact, if such creatures are brought to the surface, they bloat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What part of the brain contains and controls your active consciousness?",
        "response": "There are numerous lesion studies that show you don't need your entire brain to exhibit consciousness. Active consciousness is surprisingly resilient. You can even retain most of your consciousness after having an iron spike through the head. _URL_0_ Since a frontal lobotomy will leave a patient alive but not exhibiting consciousness, it is easy to conclude that the connections between the frontal lobe and the rest of the brain are required but seeing the last study, we can't say for sure how many connections (as a percentage) are required.  Part of the problem is in defining consciousness. Is a person who can't retain new memories beyond 15 minutes conscious? What about someone who can not remember their past? Is introspection a requirement of consciousness? All these things require multiple, overlapping brain regions.  So the TL;DR is that there is no single part of your brain that is the seat of consciousness. Consciousness is rather a function of interaction between many parts of the brain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly are Lagrange/Lagrangian points?",
        "response": "They are equilibrium points where the gradient of the gravitational potential of two orbiting bodies in the rotating reference frame of the orbit is equal to zero. In a rotating reference frame, the gravitational potential has not only a term for each of the masses of the orbiting bodies, but also a centrifugal force term. The places where this potential surface is flat (local maximum, minimum, or saddle point) are called \"Lagrange points\". The equipotential surface meeting L1 is called the [Roche Lobe](_URL_0_) - if a star fills this surface, matter will start to pour off of the star onto the other body, be it another star or a compact object like a white dwarf, neutron star, or black hole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Is \"Converging Evidence\"??",
        "response": "When different researchers in different disciplines arrive at the same conclusion independently, that evidence is said to \"converge.\" So Darwin's theory of evolution is supported by converging evidence from archaeology, phylogenetic trees, etc etc etc. This also applies to different statistical models and research institutions. If Harvard, Yale, and the CDC all come to the same conclusion without sharing data or methods, then that evidence is said to \"converge.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is riding a bike a skill you can basically learn once and then never have to relearn while other skills degrade if unused?",
        "response": "It is connected with the amount of effort you put in in order to learn a skill. Bike riding involves the coordination of many parts of the body which while learned develop many new connections in the brain.  As time goes by, if you don't ride, some of these connection will start to degrade, but because there are so many of them most will remain and you will be able restore the knowledge quickly.  Playing an instrument or even speaking a language will work similarly - you can forget particular words over time, but once you decide to re-learn it or start speaking it will come back pretty quickly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why my brain absolutely has to have blood in it every single second with proper pressure or my consciousness shuts down?",
        "response": "Blood supplies oxygen to the brain. Without oxygen, the cells in your brain suffocate and die. It's really as simple as that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Switzerland determined to always be neutral?",
        "response": "Two reasons: 1. Self Defence - by staying outside of military blocs and refusing the participate in military conflict, Switzerland reduces the likelihood that it would be dragged into conflicts.  2. Internal Unity - Switzerland is made up of a number of different linguistic and cultural groups (speaking Swiss German, Swiss French, Swiss Italian and Romansh). Taking sides in Europe could lead to infighting between the Cantons and potentially the breakup of the country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If two people are in a dark room of 40 degrees Celsius, one is wearing a white shirt and the other is wearing a black shirt, will the one wearing a black shirt get more hotter than the other person?",
        "response": "I don't know infrared characteristics of the white shirt versus black shirt - those colours fall in the visible spectrum and the absorption of infrared light may not follow the same trend. However, we can still analyze this situation even if we disregard infrared radiation. All objects emit black body radiation, which encompasses a range of wavelengths, some of which lie in the visible region. Since the two people (or, for the sake a simplicity, equal volumes of water) and everything else in the room - but let's disregard those for now and assume everything is in thermal equilibrium - are at the same temperature, both persons will emit the same amount of visible photons. However, since the black T-shirt will absorb these photons more readily than the white T-shirt, the black T-shirt will get warmer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is e-invoicing important for banks and other financial institutions?",
        "response": "It saves them money. Printing and mailing invoices is expensive and with today's technology it's a completely avoidable expense if you can convince your consumer base to agree to it. Large companies with lots of consumers who need invoices 12 times a year are the most motivated to phase them out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does all domestic government spending go back into the economy?",
        "response": "There are three factors at work here.  1. If I spend the money in a different country, it doesn't go back to the right economy.  2. If you spend to much money it will cause inflation, which will be bad.  3. Some people believe that government shouldn't spend money. They believe it for different reasons. Some don't have a good idea about economy, some do it for political reasons (small government) and some do believe in the Austrian School of economics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What the small bumps that are always on my arms. They start right about where short sleeve stops and end at my elbow. More info in text.",
        "response": "It is probably (I am not a doctor/dermatologist) a very common skin condition called [Keratosis Pilaris. ](_URL_0_) The best treatment is diligent exfoliation and moisturizing. I like a sugar+oil scrub in the shower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some people more intelligent than others if we all have the same working parts in our brains?",
        "response": "This entirely depends on how you're measuring intelligence.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a human were on a planet with weaker gravity, would bird-like flight be more feasible?",
        "response": "On Saturn's moon Titan, this is possible. From Wikipedia: \"The atmosphere is so thick and the gravity so low that humans could fly through it by flapping \"wings\" attached to their arms.\" _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I, a person with no criminal record, were to go out and kill a random person, how would the Police catch me?",
        "response": "Actually, someone like that is pretty hard. A stranger killing another stranger is a difficult case. However, they would obviously first look for any screw-ups: if you left DNA, they might, for example, have one of these \"everyone in this city gives a sample\" operations going.  But let's say you avoid everything: a perfect stranger, a perfect murder. No DNA, no witnesses, a city you don't live in that is big enough for you to not be noticed or remembered, a spot secluded enough that you can get away before the murder is called in, no travel records, no nothing. Then they won't catch you. But the point is, nobody is perfect, and nobody is the perfect killer. A single mistake will trip you up, and then the hunt is on. Doesn't necessarily mean you'll be caught if you only had a minor screw-up, but these cases aren't forgotten - you'd have to watch your back for the rest of your life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can you visualize something if it's higher than 3 dimensions?",
        "response": "You can't. Hardly anyone does in its natural state at least. What we do is, transform a higher dimensional object into 2D and see only some parts of it at a time using some reasonable geometric features.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Ted Cruz (Born in Calgary, Canada) eligible for US president when there was a whole lot of discussion about ineligibility on Barack Obama due to his birth certificate?",
        "response": "natural born citizen is required however that phrase is not defined in the constitution.  Chances are if he runs someone will challenge in court. The supreme Court will make a decision and the growing consensus among constitutional scholars that a person born abroad, but legally deemed a U.S. citizen at birth, is “natural born” enough, Cruz would be allowed to run and serve if elected.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can an ant see a tardigrade?",
        "response": "[Not really](_URL_1_). You are correct in assuming that it depends on the size and eyesight of the ant. They cannot see all that well. They mostly detect polarization and the general level of light. Detailed features are beyond the capabilities of their compound eyes, or their brains to interpret the visual information. [Tardigrades](_URL_2_) are generally 0.3 to 0.5 mm in length, while ant size varies by species - some, like [*Monomorium minimum*](_URL_0_) are only 1.5 mm, but this is still larger than most tardigrades. The little water bears would look like little vague fuzzy blobs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any animals with a non-equal probability of offspring being male and female?",
        "response": "Absolutely, and the ratio is not always constant. One example is [sea turtles.](_URL_1_) Hotter incubator environments produce higher ratios of female offspring, and that's become a real problem due to climate change. For a less extreme example but one closer to home, [human birth ratios slightly favor males.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some of the biggest lakes in the world all concentrated in the great lakes region?",
        "response": "The Midcontinent rift and Saint Lawrence rift left basins that were further eroded and filled with meltwater by glacial action of the Laurentide ice sheet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people so bent out of shape about pennies costing more than a penny to make? They're not single use items and can last 100 years. Additionally--is there anything manufactured so cheaply that lasts so long?",
        "response": "According to [this](_URL_0_) they lose 0.83 cents per penny produced and 4.41 cents per nickel produced. However, they make 7.1 cents per dime produced and a whopping 16 cents per quarter produced, noted [here](_URL_1_)   The earnings of the dime and quarter far outweigh the losses incurred from producing pennies and nickels (known as seignorage).   As for why people are upset at them, it's because the idea of a 1 cent coin when prices could (relatively) easily be fixed at multiples of 5 cents kinda makes people wonder why they'd keep producing a coin that incurs losses at around $55,000,000 per year.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone explain why calculators disagree with my paper and pen, here?",
        "response": "If A is the cube root of 100,000 and x is any not-too-large number, then the cube root of 100,000+x is approximately A+x/(3\\*A^(2)). With x=1, this says the cube roots should differ after the 4th or 5th decimal place. If you want to find real solutions to x^(3)+y^(3)=z^(3), then it's really easy, just pick any real x,y and then z is determined by a cube root. If you want this to be close to an integer, you can find \"near misses\". For example, there are integer solutions to x^(3)+y^(3)=z^(3)+1. In this case, if you take Z=(z^(3)+1)^(1/3), you'll get a solution x^(3)+y^(3)=Z^(3) that is a near miss. Famously 1729=9^(3)+10^(3)=12^(3)+1 is such an example.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How to determine if someone has received a vaccine?",
        "response": "Yes, you can. Basically, they draw blood and then put bits of virus/etc. in the blood sample and test to see if the immune cells react by producing antibodies. However, usually they just ask parents to provide official forms signed by their doctor that they've received the vaccination.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't cigarette companies just put tobacco in their product? Why is all that other crap in there?",
        "response": "i remember reading a comment on here from someone who used to work in a tobacco production plant, and he said in cigarettes there is literally nothing added to the tobacco, aside from menthol in menthols and flavorings in flavored cigarettes, all of which are food grade. all the additives that are in cigarettes are either in the filter or in the paper. so, basically, all they do add is tobacco. and the source can be found [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A priest has told me that there is evidence that suggests a universal religion once existed, until it split into the different religions of the world. Is that true?",
        "response": "Out of curiosity, what was the sect of the priest? I've never heard a historical argument for an *actual* universal religion from any clergy but it's relatively common among Catholics, at least the Jesuits I've had the longest conversations with, to hold that in all world religions there is a tendency towards a Catholic (I.e universal) truth. In any event, it might be helpful to know this priests background, these kinds of arguments as put forward by a Catholic might have a different take than those of a Unitarian Universalist, or for that matter Muslims who often hold that people are born sort of \"naturally\" as Muslims.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is a Mobius strip actually a 2-dimensional object, or is it a representation?",
        "response": "The confusion here comes from the confusion of \"infinite length\" with \"no end\". The Mobius strip does not have infinite length, any more than does a circle. Mathematically speaking, the Mobius strip is a 2D manifold, which basically means if you zoom in enough it looks like a plane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When they're making the new GTA 5, do they simple build on the pre-gen programming, or do they have to start from scratch?",
        "response": "It would be nearly impossible to get it done in a reasonable amount of time if they started from scratch. The first rule of programming is don't redo someone else's work if you don't have to- it's a waste of time. That's why you see so many games these days use [Epic's Unreal Engine](_URL_0_). One person does the work once to make the engine, and they design it in such a way that they can improve it as the hardware improves. Valve's Source engine is just a variant of the Quake engine that they've been improving for almost 20 years. In the case of Grand Theft Auto, it looks like Rockstar built their own engine that they've been using and improving for the last 8 years, and they'll most likely continue to use it for a while.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do the two guys in the middle of the bobsled do?",
        "response": "They contribute to the initial acceleration of the bobsled, and help steer by leaning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people from Israel called Israelis instead of Israelites?",
        "response": "Biblical Israel and modern Israel are two different countries. Modern Israel only became a thing in the late 1940s",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did HIV start and spread?",
        "response": "The current theory is that it began as a similar virus infecting apes in Africa. A person (or possibly several people on several occasions) got some of the ape blood into theirs (perhaps by cutting themselves while butchering an ape for food) and had the misfortune to be susceptible.  From there, it has spread to almost all corners of the Earth by sexual transmission, or by blood to blood contact (sharing needles, or even having someone's blood on an open cut).  HIV replicates insides it's victim's cells, eventually causing AIDS, where a person's immune system is increasingly damaged, so that they cannot fight off other infections and eventually die. However, there are many new drugs which help suppress the disease in many people, allowing them to live rather long and healthy lives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did men domesticate cats?",
        "response": "Actually, if I recall correctly? Cats are one of the few animals that domesticated themselves. Humans never actively tried to domesticate cats, but rather they just kinda moved in because they didn't really see us as a threat. They came up to us before we came up to them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Exactly how can marijuana be legalized on a state level when it's still illegal on a federal level? More in message.",
        "response": "State & local police are under no obligation to enforce Federal laws prohibiting marijuana. Federal agencies are under no obligation to follow state laws legalizing it. The Obama administration has said it will not pursue MJ cases in states where it has been legalized, as long as it's done in accordance with state laws. This position is non-binding and could change at any time and might change with the next president. One thing that the states have done, in order to keep things from pissing off the feds and other states is require all MJ to be produced and consumed within state boundaries. Transportation of drugs across state lines, even if both states allow them, becomes a major federal issue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the Flint water crisis fixed yet?",
        "response": "The Flint water problem isn't fixed yet because there are miles and miles and miles of pipe that need to be replaced and that takes a lot of time and money. It will get fixed, but it won't happen overnight. Or even in less than several years because they have to dig up every pipe in the damn town.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How widely accepted is the theory that native Americans came to america through Alaska millions of years ago?",
        "response": "Millions of years ago is a negative, my friend. However, much evidence has been gathered to show that the Native Americans came from Siberia/ Asia thousands of years ago (usually considered to be about 12,000). The genetic composition, facial features, and technology level are consistent with Asian populations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it, that when my hands are cold, warm water feels scalding hot?",
        "response": "Medical Student here. I believe this has to do with a type of nerve called nociceptors. These are essentially sensory neurons that sense a variety of things, such as thermal stimulus. Nociceptors can be \"upregulated\" that is, they can become more sensitive when they are exposed to certain conditions, such as the cold, meaning that when another stimuli is presented, such as warm water, the nociceptors are more sensitive towards it, causing it to be a greater response.  This is not a completely accurate response, but the mechanisms behind nociceptors can become rather complicated. TLDR; Nerves become more sensitive when they're activated. Hot water causes the sensitive nerves to over react.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is red perceived as a color but wavelenghts inmediately below it are perceived as heat?",
        "response": "All the wavelenght have energy that you can feel as heat on your skin if it's powerful enough. There is two phenomenon that happen, which will explain how you perceive it. 1) Our eyes can detect a portion of light wavelenght. We call that visible light, but the wavelenght themselves have no special value except that our eye can see them. We can see red, but not infrared. 2) Everything with energy emit electromagnetic waves as radiation. That wavelenght that any object emit depend on it's temperature. Look at your oven heating element. It's glowing red because it reach a specific temperature so it radiate in dark red. A fire have a higher temperature so it radiate orange/red. A plasma torch have an even higher temperature and will look blue. Well the same thing happen with object colder. At room temperature object still have energy that they radiate, but they radiate in the infrared. That's why we think of infrared as the heat signature, because you can see the infrared that everyday object and people emits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people cover webcams with tapes on laptop? Should I do it?",
        "response": "I know a guy at work who covers over the red \"camera on\" led. Why? He had a program installed that snaps a picture of anyone who sits in front of the machine. He doesn't want potential impostors to know they're on camera.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between \"who\" and \"whom\"",
        "response": "\"Who\" is a subject pronoun and \"whom\" is an object pronoun. For example, in the sentence \"**I** gave **him** a taco\", \"I\" is the subject of the sentence (the person/thing that is performing the action) and \"him\" is the object (the person/thing being acted upon). So we use *who* in the sentence \"**Who** gave **you** a taco?\" (because the *who* is the active role and *you* is the passive role), whereas we use *whom* in the sentence \"To **whom** did **you** give a taco?\" (because the *you* is the active role and *whom* is the passive role). **tl;dr**: use **who** to replace *I/you/he/she/they/we* and **whom** to replace *me/you/him/her/them/us*.  edit:fixed stupid typo. Thanks, parsley61.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the dodecahedron and the icosohedron have the same number of distinct nets?",
        "response": "The dodecahedron and icosahedron are duals of each other. The dodecahedron has 12 faces and 20 vertices; the icosahedron has 20 faces and 12 vertices. If you take either one and put a face where there is a vertex and a vertex where there is a face, you turn one into the other. This is what underlies that common number. Likewise, a cube and an octahedron are dual and both have 11 distinct nets. The tetrahedron is self-dual, so we don't get an interesting result here. (It has 2 distinct nets.) You can read about nets [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is maple syrup electrically conductive?",
        "response": "Probably slightly. Maple syrup is mostly sugar water, which is not very conductive, but there would also be other ions and minerals in the syrup since the sap is the \"blood\" of the tree so it contains all the necessary chemicals for survival.  I think a bigger drawback is the price of maple syrup, due to the monopoly controlled by the quebec union of producers",
        "source": "sentence-transformers/eli5"
    }
]