[
    {
        "query": "Why is Turkey so upset over labelling of the Armenian genocide? It was so so long ago.",
        "response": "Why is the US so upset over the labeling of US treatment of Native Americans as a genocide?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what came first? Nipples or live births?",
        "response": "Live births came way before nipples. Nipples are really only found within mammals because nursing their young with milk is a predominately mammalian feature. Depending on how you want to define \"live\" birth. It can also be seen in invertebrates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What wavelength is \"white light\"?",
        "response": "The term \"white\" in science typically means everything wavelength has the same strength. You may sometimes hear the term \"white noise\" which means that the noise at every frequency (or wavelength) is the same. Similarly, we give the name \"white light\" to a set of wavelengths that have the same intensity over a given wavelength range (most often the visible wavelengths). That is to say if you were to measure how much green light compared to how much blue light there is in the spectrum of a truly *white* source, those numbers would be the same. We are often lazy with language and use 'white' light to mean light that contains all (visible) wavelengths, and loosen our restriction that the intensity at each wavelength must be the same. We often say the sun emits white light, but the truth is, the sun emits a continuous spectrum which peaks in the blue/green part of the spectrum - not truly *white* light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Vans & SUV’s only have the windshield wiper in the back? How come cars don’t have it as well?",
        "response": "It's all about wind. On a vehicle with a flat back, there's not enough downward force on the airflow to keep the window clear enough so as to protect the visibility.  So in order to account for that, they put windshield wipers on those with flatter back windows.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What all do we know about the Mongol Scouts that were supposedly spotted outside Vienna?",
        "response": "In Jack Weatherford's \"Genghis Khan and the making of the modern world'\" he mentions that the Hapsburgs captured a Mongol officer. He turned out to be a former Christian and Englishman who'd come into the Mongols service by way of the Holy land. He references Gabriel Ronay's \"The Tartar Khan's Englishman\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does crushed ice cool water faster than a block of ice that's the same size.",
        "response": "You've increased the surface area of ice/water interacting. In a block, water is only contacting the ice on the outside of the block. When you've crushed it, you've got far more contact.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do human females have their period every month whereas most other animals go into heat only once or twice a year?",
        "response": "Primates are very social and sexual animals. Humans have a very high risk of miscarriages or issues where embryos fail to sustain. Monthly periods are an evolutionary advantage that allows the body to rid itself of pregnancies that don't work out to keep the female healthy and infection-free.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Graphic Cards like Quadro 6000 so expensive, even though they dont look like something that special?",
        "response": "_URL_0_ pretty thoroughly explains why; basically consumers don't need features like ECC ram on their GPUs and double precision floating point capability and are designed run 24/7. These customers basically have more money than you and they help offset the cost of r & d of consumer grade equipment",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does \"Tribal sovereignty\" work in the United States?",
        "response": "(Worked as a lawyer on the Navajo Nation). With difficulty, and with nobody knowing the exact boundaries. The tribes are clearly above the states, but Congress also has the right to modify agreements with them at will. The tribes have the right to their own foreign policy (in theory)-- which is why they declared war separately on the Axis powers. In addition, Congress will also often limit the application of bills to the tribes, and the larger tribes have their own legislatures and judicial branches. The Navajo, for example, are basically their own state, with territory the size of West Virginia and 250,000 on rez tribesmembers. However, Congress in the past has disbanded reservations entirely, so much of this basically works off of a system of mutual restraint, especially on Congress' side. There's an upcoming Supreme Court case on the right to modify treaties without public statement that is going to have major impacts on this structure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is medication in Europe sold mainly in blister packs vs bottles like in the U.S.?",
        "response": "I am not in Europe but it is the same 2-week/one-month thing in my country. This practice is to prevent drug abuse and to encourage people to see their doctor before using another/more drugs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Milky Way's center, the solar system, and you are points that form one line, how far would you be from the solar system to view Milky Way similar to the Mac OS Mountain Lion desktop wallpaper?",
        "response": "[I believe this is the image you are referring to](_URL_1_). It is a picture of the [Andromeda galaxy](_URL_2_), which is 2.5 million light-years or 2.4x10^19 km from Earth. Andromeda is a similar size to the Milky Way, so your question is essentially the same as asking how long it would take to get from here to Andromeda. Right now Voyager 1 is [moving about 17 km/s](_URL_0_), so *at that speed* it would take **44 billion years** to get to where Andromeda is now (Andromeda will actually have collided with the Milky Way by then, but that is beside the point). However, Voyager will continue to decelerate as it leaves the sun, and even after it is very far from the sun it will still be gravitationally bound to the galaxy, so it will never escape under its own power. For that you would need to get up above 525 km/s, which I think is beyond our current technology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Can't a Perpetual Motion Machine Exist?",
        "response": "The law of conservation of energy. even if a machine is as efficient as possible, some of the energy is always transformed into other forms, like heat, and is radiated/dissipated, and lost from the system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between Suni and Shite Muslims?",
        "response": "Since the top-voted comment is really long, the best explanation I can provide is one I found in the book *An Incomplete Education*. Basically, the groups are divided on who is the rightful successor to Mohammed. The Sunni believe that the first four caliphs (his right-hand men, as it were) all represent the legitimate successors to Mohammed, and thus represented legitimate religious leaders through the middle ages (they actually *did* rule in Arab lands until the break-up of the Ottoman empire). Shiites, on the other hand, believe that Mohammed chose his true successor to be his son-in-law, Ali, who was also the fourth Caliph. There's also a thing about whether the Mahdi (who will create a global Caliphate) has already come and is hiding (as the Shiites believe) or has yet to appear (as the Sunni believe).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ayn Rands Philosophy and why it's frowned upon",
        "response": "Ayn Rand's views are completely contrary to my own (personally I think she was a sociopath), but I've read The Fountainhead and Atlas Shrugged. I enjoyed the Fountainhead as well, despite my political views, simply because it's a good story with fairly compelling characters. Atlas Shrugged is more of a manifesto on her philosophy, which is essentially just pure selfishness. She believes that altruism, i.e. helping others, is evil. And that the only moral thing a person can do is care only for their own desires. It's frowned upon because that's the opinion of, at best, a very unpleasant person, and at worst, a dangerous psychopath. Atlas Shrugged is much more unabashed in displaying this ideology, so you should read that too to understand why she is frowned upon, because The Fountainhead isn't quite as... aggressive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do we know about Prophet Muhammad with 100% (or at least 95%) certainty?",
        "response": "> Uttered the Quran I believe the Qur'an was put into writing decades after his death. Realistically, how likely is it that Muhammad is the single author of the Qur'an?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do caterpillars go through metamorphosis to become a butterfly, instead of just being born a butterfly?",
        "response": "It is a form of specialization. Caterpillars are really good at eating and growing.  Butterflies are good at covering great distances, finding mates and producing offspring. A butterfly right out of the egg would be unlikely to find enough food to survive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do gut instincts work?",
        "response": "Your brain has two modes of thought. A fast, intuitive decision making system and a slower, more methodical one. The fast system (what you call gut instinct) is for making quick decisions. It is trained on pattern recognition. That is, does this current situation look anything like a situation you've seen in the past? If so, what was the correct outcome in that past situation. The fast system tends to be focused on immediate consequences and is very vulnerable to biases and prejudices. The slower system is when you stop and think logically through a problem. It takes a lot more energy and time. This is often employed when you are confronted with an entirely new situation. If you want to read more about these two systems and the benefits and failures of each, I highly recommend the book *Thinking Fast and Slow* by Daniel Kahneman.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If space is primarily empty vacuum, do gas particles such as those in nebulae diffuse into said vacuum?",
        "response": "Yes. Due to the random movement. But that nebulae has mass and therefore gravity which holds the gas in. It the same as asking why air doesn't escape earth's atmosphere. Because it is held by gravity. But some air does escape.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did \"American\" become the demonym for citizens in the United States?",
        "response": "Actually, the English residents of the colonies were called \"Americans\" well before 1776, as far back as Jonathan Swift and Alexander Pope. If I recall correctly, Jonathan Swift mentions having an \"American\" friend in [A Modest Proposal.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does ‘welding’ work?",
        "response": "Super generally you just melt metal, they mix, and then when they harden (almost immediately) they are fused together. Like melting 2 flavors of ice cream then refreezing them. here is a list of welding processes: _URL_0_ The basic differences are how things are heated to melting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are fevers helpful?",
        "response": "A fever is the body's attempt to kill intruders(bacteria, viruses, etc) by making the conditions inside your body less ideal for said intruders. Unfortunately, your body also happens to be in your body so you suffer the effects of the raised body temperature such as sweating. A really high fever is the body saying \"I'll kill this intruder or I'll die trying.\" Fevers don't outright kill intruders, but they do weaken them which helps your immune system fend them off. The reason you don't feel great when you have a fever is two fold: A) Your body is diverting all of it's energy to fighting whatever bug you have which means taking away energy from other places B) The biological processes in our bodies are suited to work best at body temperature. When that temperature is too high then those processes don't work as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Shanghai cold and Tijuana hot?",
        "response": "It's worth noting that Shanghai is not a cold city, it's generally considered to be subtropical and rather warm, but it gets snow fairly regularly(1-2 times a year). This is really more to do with a major high pressure system called the [Siberian High](_URL_0_) and Shanghai having a relatively humid climate.  Basically this high pressure system plays a huge role in weather across Asia and really the entire northern hemisphere bringing snow to places that otherwise would not see snow, generally where it meets tropical air in the Pacific Ocean. It's quite similar to what can sometimes happen on the east coast of the United States when polar air pushes the jet stream south and places as far south as Florida can see frost and rarely a snow storm, but the Siberian high is stronger and further south meaning that it affects Shanghai more regularly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Biologically, why is male pattern baldness a thing?",
        "response": "Some people had a mutation that induced DHT receptors in the hair follicle.  Those people still managed to reproduce just fine so it kept getting passed down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that Police officers seem to get less of a punishment when caught doing something illegal?",
        "response": "OP didn't specify any particular locale, but this seems to be getting out of hand in America and i just really wonder when we're going to get angry enough to force change, if ever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What had a greater effect on economic growth in nineteenth century America, advancements in manufacturing or advancements in transportation?",
        "response": "Yes. The two are really hard to differentiate. Advancements in transportation allowed manufactured goods to reach broader audiences, while advances in manufacturing led to a desire and ability to improve transportation using the tools that industrialization allowed. The two were so intertwined that I don't think you could easily make the distinction between them. There is an old argument by Eric Williams in *Capitalism and Slavery* that sugar plantations spurred the Industrial Revolution in the late eighteenth century, and the capital from that allowed manufacturers to produce more goods which in turn led to trains and steamboats to transport them. Check out Seller's *Market Revolution* for a very very detailed look at the nineteenth century.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If hot water freezes faster, but a higher temperature differential causes things to melt faster, then there must be an optimal temperature for using water to defrost something like a fridge or a windshield?",
        "response": "/u/nwob is right: there is no \"workable math about the increased freezing rate at higher temperatures\" because the Mpemba effect is not always observed, and neither consistent nor well-characterized when it is. The reason you should not defrost frozen objects with very hot water is that the rapid heating may damage the object (see [thermal shock](_URL_0_)). Glass, for instance, may crack or break with sudden heating or cooling. Some plastics may permanently soften.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can blocking NMDA receptors promote neuroplasticity?",
        "response": "Synaptic plasticity involved the up regulation and down regulation of certain synapses. NMDA is responsible for long term potentiation which is involved in the upregulation part of synaptic plasticity. High frequency activation of NMDA receptors greatly increase the concentration of calcium ions in the cell. The cell also goes through positive feedback and upregulates the amount of NMDA-Rs at the membrane, creating more responses in the future. However, NMDA can also act in the opposite direction with low frequency excitation (i.e. not enough to cause effects post-synaptically). This causes the receptors to be down regulated/internalised and causes long term depression. If you block NMDA, you stop both these processes and stop all neuroplasticity. Hope this helped.  If you want this in a paper: check out \"NMDA Receptor-Dependent Long-Term Potentiation and Long-Term Depression (LTP/LTD)\" by Luscher and Malenka. EDIT: forgot to say, I'm a pharmacology student.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In MWI, is there a dynamic probability distribution, and if so, what is its characteristic/its mechanics? Does local reinforcement of a choice increase the amplitude of the choice across multiple realities?",
        "response": "You aren't providing a whole lot to go on here, but the \"dynamical probability distribution\" provided by the MWI is exactly the same as in ordinary quantum mechanics. It is given by the Born rule. The answer to your second question is \"no,\" nothing done in one world affects other worlds, other than in the ordinary way of influencing worlds downstream of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Overwatch x Living Tombstone questions",
        "response": "During matches you can change characters to counter (or deal with being countered by) characters on the other team. Like with TF2, if you've ever played that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The American tipping culture",
        "response": "I don't know all the details but alot of it involves you working to get a tip based on your service to the customer. If you don't do a good job you'll get a small/no tip, whereas if you go above and beyond to be helpful, fast and friendly, then you get rewarded for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how did the \"old\" Reddit team lose control in the first place?",
        "response": "The same way any other start up does. You have an amazing idea for a new company, but you don't have money to pay employees, rent office space, buy equipment, etc.  You go to an investor like an angel investor, they offer to fund your company in exchange for the money for a percentage of the ownership. After a few months, you go to various other venture capitalists, they agree to fund your company some more, again for a further percentage of the company.  Eventually you might be 10-20% owner of the company, because you sold the other 80-90% to investors. Since you no longer are majority owner, the majority owners can (and do) put some of their preferred staff on the company's management team to insure their investment is being properly used.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the backs of credit cards say \"Not Valid Unless Signed,\" yet I have never been turned away when using my unsigned credit cards?",
        "response": "It's supposed to be an extra security measure against identity theft. The merchant can compare your signature on the back of the card to the signature you give when you purchase. You used to do it on a hard copy but now they have the digital signatures, which make pretty much everyone's hand writing look terrible.  Most retail places have some sort of policy where the employees are supposed to verify the signature. They just don't put effort into enforcing them and the cashier/sales person/ect. probably doesn't care enough to check.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Greenland shark's top speed is less than 3 km/h and they spend most of their lives blind, how do they survive?",
        "response": "Most sharks rely very little on eyesight for hunting; chemosense (smell) and electroreception are thought to be far more important for most species. I don't know the studies on the Greenland shark specifically, but for the closely related sleeper shark, we have very little data on its pattern of predation when actually killing an animal. Cruising speed, estimated from PATs or other tracking methods, doesn't rule out brief bursts of energetic pursuit or capture.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who was Rasputin, How influential was he, and How did he really die?",
        "response": "Rasputin's actual influence on the court was relatively negligible. He had some sway on the Tsarina, but Alexandra had limited power. One of the most salient evidences of this is that Rasputin always opposed Russia's entry into the war. That said, rumors of Rasputin's debauchery helped to sap the monarchy of its prestige and moral authority during a particularly acute time in Russian history. Before and after his death, many came forward to claim that Rasputin really ruled Russia, but this was largely a combination of scapegoating and scandal mongering (pamphlets dealing with the sexual degeneracy under the aegis of Rasputin were huge sellers in the post-February popular literature). Thus while Rasputin the man had very little influence, his image had greater sway.  *source* Figes, Orlando, and B. I. Kolonit︠s︡kiĭ. *Interpreting the Russian Revolution: The Language and Symbols of 1917*. New Haven, CT: Yale University Press, 1999.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do stores like dollar general make profit?",
        "response": "Cheaper off-brand products bought in bulk. Think of it like this...You have Scotch-brite brillo pads for washing dishes you can buy at a Wal-Mart for $2 right?, Where as Dollar General sells the knock off \"Scot-brit\" brillo pads for $1. It costs the \"Scot-brit\" company 20 cents per pad they make, They sell them in bulk to the retailer at 40 cents a pad for 50,000 pads to distribute to all their stores nationwide, Which they sell for $1.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Double Slit Experiment.",
        "response": "A good way to think of this is that it's not *nature* that behaves weirdly. Nature is not the one with the problem, *we* are. We are so used to dealing with objects like waves and particles that we can not wrap our heads around things that behave as oddly as quantum objects. Remember, particles and waves are simply *models* we use to describe behavior of quantum objects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can lasers travel extreme distances in space without degradation?",
        "response": "The biggest problem is divergence. When you shine a laser across a room, 1 mrad of divergence (1 part per thousand) seems pretty small, but when you shine a laser 250,000 miles onto the moon, the spot is 250 miles across.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What benefit there is to losing consciousness?",
        "response": "1) Basically yes, although the mechanisms very _a lot_ and brain damage is a very complex issue. 2) Why do you think there's a benefit? Just because it exists doesn't mean it's selected for in evolution. It's like asking \"what's the benefit of bones breaking when subjected to extreme force?\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If mountains are measured from sea level do they reduce in height as the oceans rise (global warming or daily tide)?",
        "response": "No. See: [Mean Sea Level](_URL_0_).  It's an average height of the sea level that is used *as a datum from which we* measure elevations.  I don't really know what else to say. It's not really an ELI5 question, as there is just one, simple answer.  Edit: Added words in italics for clarity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the heaviest thing in the universe per cm sq?",
        "response": "If you exclude black holes, some of the densest objects in the universe are Neutron Stars. [Wikipedia](_URL_0_) describes their density:  > Neutron stars contain 500,000 times the mass of the Earth in a sphere no larger than Brooklyn, United States  And  > This density is approximately equivalent to the mass of a Boeing 747 compressed to the size of a small grain of sand, or the human population condensed to the size of a sugar cube.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my music sound slower when I exercise?",
        "response": "Your body's internal clock is set based on your heart rate, which usually is the exact beat of the BeeGees' \"Staying Alive\". When you exercise, your heart rate increases to the beat of other, better songs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some noises (rain, flowing water, a rotating fan) soothing to humans? Are these same sounds soothing to other animals?",
        "response": "Some noises [like fans] are good psychoaccoustic maskers. Fans produce sound over a wide spectrum of our hearing and are good for masking (making seem non-apparent) the sounds of things like your house settling [as it cools], the fridge kicking on, your partner tossing in bed, etc. They also help move the air which prevents over heating [people tend to sleep better when the air around them is cooler]. We get used to fans over time and that's why it helps/soothes. I imagine if you never slept with a fan on you'd probably find it bothersome for the first while. Things like ocean waves crashing work for basically the same reason. Though in that case people might have an affinity for nature but the basic principle is the same.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When burning a CD, does a 4x vs a 1x write speed change the quality of the end product? Is there anything different about a 4x vs any other speed other than, speed?",
        "response": "I always thought this harkened back to the old days of CD burning, where buffer underruns occurred frequently. A buffer was created for the data being burned, and if the buffer emptied before the burning process is complete, it would fail.  Burning at a slower speed (1x) meant you didn't empty the buffer and cause problems. However if your PC could handle it, you could attempt to burn at faster speeds (4x).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did family members find out if a relative died during WWII?",
        "response": "As with most countries, by telegram. Typically they would inform the family that the relative was missing, e.g.: _URL_2_ As noted, a letter (usually from the CO) would follow. Of course, some of the missing turned up, I believe the Red Cross would get lists of POWs and inform the armed forces, who would then inform the families. This is a poor picture, but you can just make out the message: _URL_1_ If the person was found to have survived and not in enemy hands the good news would be shared: _URL_3_ In some cases the individual themselves would send a telegram basically saying \"I'm still alive!\". Sadly, all too often a telegram was received, confirming the relative as dead.  Of course for those confirmed dead the telegram was rather final : _URL_0_ If you search for \"ww2 telegram\" on google images you will find may scans/pictures of similar telegrams from all over the world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How modifying battery in psp allowed to hack it.",
        "response": "A lot of systems have a \"service mode\". This is built in by the manufacturer to have access to functions that a normal consumer will not have. Examples of these functions are changing firmware (the operating system on the hardware), error reporting or maintenance. By modifying a battery, the PSP is tricked into starting up in its \"service mode\", which allows also changing the operating system of the PSP. This mode is what hackers abused to change the operating system, so that it will no longer check if the inserted game is legal. This means you can play pirated games. edit: typo",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "NSFW Can someone explain to me what this thing is inside this girl's vagina? NSFW",
        "response": "I'm gonna file this under \"things I am not going to click on\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there restrictions on how a person’s body can move based on their size? For example could you teach a 7ft2 person to do a perfect double somersault or does their size mean they would never be able to do it like a 5ft tall gymnast?",
        "response": "Yes there are restrictions. The taller and larger you are the harder your body has to work for you, so there’s going to be a significant drop off in agility and perhaps flexibility. Taller people tend to suffer from joint issues at a higher rate than average, are more likely to suffer from blood clots, back pain, etc. This can be seen in the NBA quite prevalently. Wilt Chaimberlain was 7’ something and had like a 4 foot vertical, played volleyball, you get the idea. He’s probably the most agile, freakishly-tall athlete ever. Remember our bodies are optimized for a certain size and weight, so when we’re talking about extremes on either end there can be unexpected side affects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do infants that rely on sign language communicate as poorly as infants that use their voice or are they well spoken due to a more 'tangible' language?",
        "response": "I forget what age, she was probably 2, but my niece learned a few words in sign language and it helped communicate her needs, such as thirsty, hungry, and so forth. All around the time she learned to to talk. So her parents would make the sign and say \"thirsty\" so she learned to say it but sign it as well so there was less miscommunication or frustrations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do nut packages display the warning \"May contain nuts\" instead \"Do contain nuts\"?",
        "response": "I assume you mean packets of peanuts. Peanuts [aren't actually nuts](_URL_0_). Someone with a nut allergy may not be allergic to peanuts, and vice versa. So if you had an allergy to nuts, but could eat peanuts fine, it is important to know if the packet may contain traces of nuts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the faucets at my University produce hot water almost instantaneously but the faucets at home take a full minute just to start warming up?",
        "response": "Large buildings use *recirculating hot water* in which a fresh supply is piped throughout the building at all times. Small buildings don't, so you need to run the water until newly heated water reaches you from the water heater.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how can my friend shake his eyes back and forth but I can't?",
        "response": "I feel like anyone can do it, you just have to know how. It's like whistling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are houses in the U.S. built out of sticks and thin wood?",
        "response": "They don’t, and a lot of older houses are built from brick. Tornados are incredibly powerful though, and buildings of any material don’t really stand a chance. The strong ones can toss about cars and rip trees from the ground like it’s nothing. A brick wall has no chance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Reddit's obsession with John Cena",
        "response": "The majority of the internet has an obsession with John Cena. All of it spawned when a radio show did a prank call or \"phone scam\" telling the person being pranked that they could see the WWE Superslam(Not a real event) and watch John Cena wrestle. There's a video from where it all started, just by looking up \"John Cena Prank Call\" on YouTube.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How integrated were the Saxon and Viking communities in 10th-11th Century England?",
        "response": "One can observe the names of towns around much of the Midlands (that's Middle England to outsiders)and much of the Eastern coatline of Britain in general, and see which settlements were Saxon, Viking and later Norman. Trade happened throughout and some elements of inter-marriage sparked the journey to integration and eventual english identidy, but for the 10th-12th centuries, most kept to their own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is iron important in the human body",
        "response": "It binds to haemoglobin (the stuff in your red blood cells) and makes it work, haemoglobins' job is to carry oxygen around your body, so if you have no iron, you have no oxygen carrying stuff which means you have no oxygen which means dead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between real, reactive, and apparent power (electrical).",
        "response": "This is not real explanation, but look at this picture (picture is worth 1000 words), it sums it pretty well! _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when my leg \"falls asleep\" and why is it so uncomfortable when it \"wakes up\"?",
        "response": "The feeling of pins and needles in your legs, also known as paresthesia, is your muscles gasping for air. Basically, your legs had pressure exerted on them (like choking someone's throat) or were put in a contorted position (like a bent water hose). This cuts off the blood circulation to the cells in legs. The feeling is caused by your nerves sending signals to check if everything is okay after an extended period of deprived oxygen. There was a new story where a girl had to have her legs amputated, cause she passed out drunk with her legs under her, and the circulation cut off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my phone reception strength vary so much when the phone is completely stationary?",
        "response": "Environmental factors such as: * Other broadcasts (phones, radio, satellite...) * Reflective/absorbent surfaces (walls, planes, you, strange groupings of dust in the air...) * Other stuff I can't think of. The tower may be busy with other calls and told your phone \"I can't deal with all the traffic on channel A please go to B\", and B happens to have worse reception for your area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "While swimming or having a bath, how much water do we absorb through our skin and where does it go? Does the type of water impact the amount absorbed (Saltwater vs Fresh)?",
        "response": "Except for the outer surface, your skin absorbs almost no water -- it's waterproof. Notice you can't stay alive in a lifeboat just by putting lots of seawater on you. Yer not alone in askin', and kind strangers have explained: 1. [ELI5: Why can't you treat dry skin by soaking it in water? ](_URL_3_) 1. [ELI5: How is skin waterproof even though it's composed mostly of water? ](_URL_1_) 1. [ELI5: Why doesn't water moisturize my skin in the way lotion does? What's the difference? ](_URL_0_) 1. [Am I absorbing any water through my skin when I take a shower? ](_URL_4_) 1. [Why does lotion absorb into my skin but water doesn't? ](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why would Microsoft buy commercials during the Olympics to promote a free web browser?",
        "response": "I.E. defaults to Bing for it's search engine. Bing sells ads that make Microsoft money. Firefox defaults to Google (This is because google pays Firefox for doing it.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that when you uninstall something on your computer, there are still folders related to what you uninstalled left behind with nothing in them ?",
        "response": "On Windows, you can't immediately delete a file that is being accessed by some application or service. Consequently, you can't remove the directory that contains this file, even if you don't need it anymore. Now, you can tell Windows to delay the file's removal until it's closed (no longer accessed). That's why the file will be gone eventually. However, there's no way to tell Windows to delay the directory's removal until it's empty. Hence, occasional leftover empty directories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Strange Solar Optical Phenomenon",
        "response": "Yep a sun dog, they usually come in pairs, at equal distance on each side and with a halo. [I saw one a couple weeks ago in Canada.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do pickles have 0 calories?",
        "response": "They have some calories in the form of sugars, but since pickles are just cucumbers in vinegar or brine (neither of which contain usable calories) then the only calories that come from it are from the cucumbers themselves.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was Edward Mordrake a real person? There's surprisingly little information considering his apparent affliction.",
        "response": "No. [The Museum of Hoaxes](_URL_0_) has a thorough debunking. He was invented by a 19th century poet called Charles Hildreth. There are other clues that the story is fake, too: the \"heir of one of the nobelist peerages in England\" would have relatives and forbears, but no such surname appears anywhere.  The story also says that he never claimed his title, except under British law one could not disclaim a peerage until the [1960s](_URL_1_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I put a room temperature beverage inside my fridge, it seems like it takes hours to get cold, but if I take a cold drink out, it gets to room temperature in like 30 minutes. Why is this?",
        "response": "It is due to the specific heat capacity of water and the size of the two \"rooms\" The water in the drink requires substantial amounts of energy to be exchanged to cool down or heat up. The fridge actually has very little air in it and your warm drink actually warms up the fridge whereas your room is large and the circulating air doesn't cool down all that much by comparison so the heat differential isn't as great for more on specific heat capacity - _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we measure the temperature of stars and quasars up to 100,000,000°? How do we know it's that hot?",
        "response": "The color of the light! I'm a material scientist not an astrophysicist so I eagerly await being told exactly why this is incomplete. The peak wavelength of a star indicates its surface temperature, it's called Wien's displacement law. The wavelength is inversely proportional to the temperature. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my computer get slower over time?",
        "response": "I read your question as \"Is it because I accumulate more and more **flies**\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do viruses (the type that make you sick) come to exist? Are they living?",
        "response": "I can only answer your second question, but I hope this will help you too. No, viruses do not live. They need other living things, like bacteria or animals, to reproduce. They can't reproduce by themselfs, like bacteria. So they do not live, because the ability to reproduce is a criterion whether somthings lives or not.  But on the other hand, viruses are more than dead matter. They consist of RNA or DNA and proteins, which can be also found in cells from a actually living species. I did my best to explain it :D but I'm just a guy with an online-dictionary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I'm in a group of ten people taking turns guessing a number from one to ten, when would I be most likely to guess right?",
        "response": "Actually, assuming the numbers are evenly distributed, everybody has a 10% chance of winning! First person: Obviously, a 1 in 10 chance, i.e., 10%. Second person: 90% chance the person gets to go; if she does, it's a 1/9 chance of winning, so overall odds of winning: 10% Third person: 9/10 that second person got to go, and 8/9 that second person did not succeed, and (9/10)(8/9)=8/10, so 80% chance third person gets to go. His odds of winning are 1/8, and so overall odds he wins are (1/8)(80%)=10%. This just keeps on going, producing 10% odds for everyone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If an object acquires near-light speed and its observed mass increases manifold , will its interaction with other objects through gravitational forces change as well ?",
        "response": "The actual mass does not increase. It just get's harder to get it to move faster and faster *as if its mass was increasing*. But the object does not gain mass in its own (or anyone else's) perspective (reference frame).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so important to stay awake after sustaining a critical injury?",
        "response": "As a neurological intensive care nurse, I can tell you that we keep patients awake primarily to monitor neurological status. That is in the neuro ICU though. In other ICUs, they monitor your stability with frequent vital signs (as do we) but also by periodic checks on your level of consciousness, which is directly related to your cerebral perfusion and can suffer for a large number of other reasons besides low blood pressure/volume. In the movies, when healthcare professionals are shown trying to keep a patient awake, it is because they are concerned that there is an acute change in the mechanisms that facilitate wakefulness. Anyone will wake up (and stay awake) if given enough painful stimuli (e.g., sternal rub, pinching, etc.). If the patient does not, it means that they are acutely decompensating and in need of emergency medical attention. This is why all life support (BLS, ACLS) begins with an attempt to arouse the patient.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we target beta amyloid plaque with ubiquitin?",
        "response": "We can't just tag proteins with ubiquitin willy nilly and it's likely the plaques accumulate because overwhelm the protein degradation pathways in the first place. And there's the whole location thing. Proteasomes are inside the cell!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't militaries invest in anti-nuclear weapons, rather than the weapons themselves?",
        "response": "We have. Anti-ballistic missile defense systems (ABM) have comprised a huge research and development cost since the 1980's. The US alone has spent something like almost 1 trillion dollars since the 80's developing ABM technology. The systems are currently deployed throughout parts of the US and the world. How well it works is still up for debate but the investments have been made.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we breed with other species?",
        "response": "An important distinction is that species *are not completely rigid*. Remember that species are a semi-arbitrary distinction between organisms, and some two species are more closely related than other two species. Also important is the time that has past since one species broke off the evolutionary path that produced another species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the 60 Minutes Story and Benghazi. What did they say and why is everyone so upset now?",
        "response": "Their Benghazi story presented the view that the US government responded badly to the attack in Benghazi, as told by a guy who claimed to have been there. The problem is that he *wasn't* there, and in fact had earlier told the FBI that he wasn't there. So either 60 Minutes knowingly ran a false story, or they didn't bother to fact check the story before running it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a reasonably fit person got on an exercise bike and pedalled for hours and hours, could they come off the bike with pounds less fat on my body?",
        "response": "Apparently 3500 kcalories = 1 pound of fat. (The average daily caloric requirement for an adult is 2000-2500 kcalories.  Most of that is spent on maintaining your body temperature.) Biking 1 mile burns about 31 kcalories.  Therefore, you would have to bike just under 113 miles to burn off 1 pound of fat. The average sustainable speed for a bicyclist in good condition is about 10 miles per hour.  Therefore, in 24 hours, one could bike about 240 miles = 7440 kcalories, or just over 2 pounds of fat. Probably easier to do it in shorter increments. Sources: google Edit: forgot a k or two",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are gay pride and black pride encouraged while straight pride and white pride are considered as racist ?",
        "response": "No one considers \"straight pride\" to be a racial issue... So let's say they are called racists and/or bigots. That is mostly because things like \"straight pride\" and \"white pride\" is proposed by racists and/or bigots. Whiners who want to crash the party being held by historically oppressed minorities of people because they feel they deserve some attention also. But the fact is that every single day since the founding of America has been \"straight pride\" and \"white pride\" day. Straights and whites have never been oppressed by the law or social constructs. Gay pride and black pride is just a way of saying \"We're now going to have a parade because the rest of you are no longer allowed to murder us if we do.\" Note that there are parades full of subsets of white people who were oppressed and abused at times. Italians, Irish, Armenians, etc. You don't see WASP parades because WASPs have never been abused in this country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From where does Earth get energy to rotate around itself and revolve around the Sun?",
        "response": "Earth is falling towards the sun, for the same reason that you'd fall to the ground if you jumped - gravity! Why doesn't it hit the sun though? Well, orbits are just when you move sideways fast enough to miss the object you're falling towards. That's we use the term free fall... in space, you're always falling, you just keep missing what you fall towards. It got that from when it was formed. And since there's no air to slow it down, it just keeps going. Rotation is the same way. It started so long ago, but nothing had made it stop. Orbits do eventually decay, though! And spins slow down to where the day and year are the same length. The Moon is already there, that's why the same side always faces us. No worries, it takes so long to happen that you don't need to worry about it in your life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a physical constant relating to gravity that equals the speed of light?",
        "response": "The constant in Einstein's equations that relates the stress-energy tensor to the left side of the equation (a complex differential geometry function of the metric) is 8pi G/c^4, about 2x10^-43 meters/Joule.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is r/TwoXChromosomes now a default sub. When it seems to just be straight up sexism. If this sub was male oriented the outcry would be tremendous.",
        "response": "Oh I'm sure this will be a rational, polite discussion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would evolution occur faster or slower in a highly diverse population?",
        "response": "I think the speed of evolution is more related to changed conditions than overall diversity. The latest theory of evolution is that it happens in short bursts as a result of changes in the environment, rather than at a slow and constant rate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How our bodies decide to grow at any given point?",
        "response": "Growing is governed by growth hormones released in the body, and hormones, generally made by the brain, are like messengers in your body that give orders to your cells to do particular things. Growth hormones are made in high amounts during childhood to make the body grow, but production naturally declines as you get older. You grow less as you get older.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that the average human can store tens of thousands of words in its vocabulary, but if asked to list them all by hand it would be very difficult to name from memory even a fraction of that?",
        "response": "The way I see it is, we don’t remember just words we remember the ideas behind and relationships of the words. That makes it really hard to remember words if we aren’t thinking of the context of the words.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/How is it that Koreans consistently dominate most of the competitive gaming scene?",
        "response": "The Korean pro gaming scene has its own television channels, stadiums, sponsors etc. It's a much larger sport there than NA, SA or Europe. It also has been going on for a much longer time. Koreans are paid a livable wage to play there even on b and c teams.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come an Xbox, which features 6 year old hardware, can run modern games smoother than my recently built PC?",
        "response": "Most popular games come out on the Xbox 360, the PS3, and the PC. Out of the three choices, the Xbox 360 is the most popular and has the oldest hardware, so the games usually get designed to run really well on the Xbox 360 first. After the game is done, they really quickly make versions for the PS3 and the PC, then release them all together to sell to you. The game is designed specifically to run on your Xbox 360 in the first place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why not use a lumbar puncture to drain CSF to reduce ICP?",
        "response": "Ultimately, you have to keep in mind what the root cause of the increased ICP is. If it's a mass or some other parenchymal issue, rapidly dropping the CSF pressure in the spinal space via a tap can lead to a transtentorial herniation, which can outright kill the patient. In patients with a subarachnoid bleed, the rapid drop in pressure can also lead to worsening of the bleed. This is why (for example) many physicians prefer to get a CT of the head before doing an LP for suspected meningitis.  If hydrocephalus is the cause of the increased ICP, it can be relieved via a drain or shunt (with slow, controlled rates of removal). If it is not the cause, remember that CSF only accounts for about 10% of the volume in a normal head, you would not relieve much pressure before causing other side effects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Einstein's Theory of Relativity is based on the principle that the speed of light is the same for all observers. How did he deduce that and how do we prove it now?",
        "response": "For one thing, in order to work Maxwell's equations require that the speed of light be constant. One of Einstein's big leaps was realizing that this wasn't just a mathematical quirk, it represented physical reality.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would a 4th dimensional object passing through our dimension look like?",
        "response": "Your example is a great analogy of what it would look like in 4D to 3D: it would look really weird to us. Depending on the shape in 4D, it could look like different things. Using your example, a 4D ball would look like a sphere that grows then shrinks then disappears. If the shape was irregular, it would look even stranger. Imagine a plane moving from the top of your head downwards. When it gets to your arms,there would be three shapes (torso and two arms) and then eventually the two arm shapes would disappear. Similarly, if you started a vector (3D space) at the \"top\" of a 4D object, a bunch of random shapes might appear. The best way I've heard the fourth dimension described as is \"across.\" Imagine a bunch of rooms on super-imposed on one another, but not able to interact. A 4D being could reach \"across\" the rooms and be in all of them. Even though it's a cartoon, Rick and Morty [has a great example of a 4D being in these rooms](_URL_0_). Hope that helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are those weird stickers with nonsense words that people place on signs about?",
        "response": "Far left is a sticker for participating in a 10k run, mid-right is a turtle, far right appears to be an identification tag of some sort, and I don't know what mid-left is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "North Carolina's bathroom situation",
        "response": "Conservative politicians are trying to deny people the right to use the restroom assigned to the gender they identify with. Edit: It's pretty simple and shouldn't be an issue, and never was until conservative politicians needed a replacement for the gay marriage issue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were the French really as incompetent as they're made out to be during WW2? Specifically in reference to the Maginot line?",
        "response": "The Maginot line worked, it forced the Germans to go around it and this is exactly what happened and what the French expected.  The major miscalculation was the armored thrust through the Ardennes, this was considered impossible (in the speed that they did it). So while the main French (and British, Belgian) forces where in West-Belgium to stop the the big attack the Germans cut them off by moving over the East flank (and other places) which are the Ardennes then quickly making a run for the coast. Relief map of Belgium: _URL_1_ The speed of the attack kept the allies off balance the entire time and the political situation in French was heavily damaging them, they where divided and the communication was not there. Not between the military and government or within the military. Animation of the invasion: _URL_0_ They did break through the line after the Dunkirk evacuation and the Fall of Paris.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to build a tolerance to radiation?",
        "response": "Depends on what type of radiation. You can build some tolerance of uv at the wavelengths that do damage to your skin by producing more melanin which acts as a sunscreen of sorts. But for the kinds of radiation you are thinking of, like gamma for example the answer is an definite no.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is a capacitor used tune to one frequency",
        "response": "Well its not just the one capacitor. I assume you're talking about old radio tuners?  The capacitor is in series with an inductor. Inductors are short circuits at low frequencies and open at high frequencies. A cap is the opposite. By putting them in series, you form a bandpass filter that shorts at low and high frequencies with a peak in the middle. Changing the capacitance with a varactor changes where that center frequency is.  Google \"analog filter design\" if you want more in depth information, because there is more nuance to it (how wide do you want the isolation? How much boost or cut?).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if it was found that the Higgs Boson particle is non-existent?",
        "response": "Three possibilities: a) The Higgs mechanism is correct and we find the Higgs. We now have a specific reason for why particles have mass. b) The Higgs mechanism is incorrect, but there is some other reason for mass, like extra dimensions or technicolour. c) There is no Higgs mechanism. The masses of all the particles are simply extra free parameters in the SM (which raises the complexity of the model). Any one of those are possibilities, but in no way invalidate any other aspects of science. I don't know why that would even be a question - the successes of science to predict experiment are blatantly obvious through all of the technologies we currently use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If radio waves dissipate and aren't able to be separated from background noise after a small distance traveled (a couple light years), what's the point of SETI?",
        "response": "Kind of complicated to explain. Basically what you say is true of earths basic radio communications. Since we aren't looking to blast our signals in any particular direction, they get really quiet, really fast. On the other hand, a focused signal can travel very far depending on how much power is used to send a radio signal. The premise is that extraterrestrial life has similar or better technology than us (and we can detect \"earth like\" or \"possible life\" planets in the galaxy), that they would detect that Earth is earth-like, and would blast it with radio signals to see if we can receive and respond to them. Such a radio blast, if enough energy were used, could easily travel a few hundred light years, but its still a very narrow window that we are looking at to try and detect alien life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we celebrate the end of the American Civil War? \"Reunification Day\" would seem appropriate.",
        "response": "Well, the premise of your question is off. You'll be pleased to know that Memorial Day was created in the wake of the Civil War to commemorate the fallen (Called Decoration Day at the time). Its only in the 20th century that it has become a more general purpose holiday for all military dead. I won't pretend like I can fill you in on the details of its creation and transformation from ACW to all-purpose holiday, but that as to the premise of your question, we do celebrate it, in a sense. The better question (which I don't really have a great answer for), might be \"What was the genesis behind Decoration Day, and how did it turn into the more generally themed Memorial Day?\" Similarly, Veterans Day was created as a commemoration of World War I (Then called Armistice Day), but morphed into a commemoration of all military veterans.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you're not supposed to ever button up the lowest button of a suit, why do they exist?",
        "response": "It's a silly reason, really. Originally, jackets were *supposed* to be done up all the way. But at some point, people decided it looked better if they 'flared out' around your waist (since this was typically the widest part of the body... at least if you're a wealthy over-indulgent Earl). Having the fabric pulled in around you could look silly, and so they stopped buttoning it up. Since then, manufacturers have started tailoring jackets to intentionally take this into account, *but they never removed the button*. [EDIT] As some other commenters have remarked, it is like a vestigial remnant of times gone by.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does toothpaste stick to the sink so well but easily falls off my toothbrush?",
        "response": "When you first put it on your toothbrush, you are putting on slow, and there isn't enough force to push it down.  When it hits the sink, it most likely happened because it dropped out of the tube from a height of a foot or so. That means that it hits with a good bit of force, and that forces squishes it into the porcelain surface. If you were to gentle squeeze it directly on the sink, you'd find that you could gently pick it up from there. Think about a human gently laying on a bed of nails versus a human landing on a solid concrete surface from a high fall. In the first case, the cohesive forces of the body are able to hold it together because not a lot of force is being applied and even though every individual every is small, it is spread out a lot. In the second, the cohesive forces are overcome instantly by an impact, and it doesn't matter if the surface is relatively smooth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does turning on lights / flickering lights make sound? Do light make sound?",
        "response": "Light doesn't make sound. Without knowing what kind of lights you are talking about or getting too technical, it's basically the case that rapid electrical fluctuations can cause different conductive elements to buzz due to vibrations caused by rapid heating/cooling or rapid changes in the magnetic field produced by the current.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Taoism exactly and what does a Taoist believe/practice?",
        "response": "Try [The Tao of Pooh.](_URL_0_) That might be suitable for a 5yo. Otherwise \"it is what it is\" pretty much sums up Taoism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much longer can the Earth sustain the human population? What will 'run-out' first?",
        "response": "There is a difference between sustaining the human population and sustaining the current human culture. Humans as animals can (and do) live on far less from a resource perspective than humans as consumers of non-renewable and rare-earth resources. In one scenario, you want to ask when water won't be clean and food won't be available. In another scenario, you want to ask when we won't be able to drive cars or make flat screen TVs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cup phones work?",
        "response": "When you speak into the cups or cans or whatever your voice is making the air vibrate which makes the cup vibrate. Vibrations travel better through tighter (denser) things so when you tighten the string it pulls all of the tiny strands together and makes it really great for vibrations to travel through. Then the second cup acts as a speaker and starts vibrating the air again so you can hear it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do any other species besides humans bury their dead?",
        "response": "Elephants have been seen using sticks and other plant matter to throw onto and partially bury their dead friends and relatives. They also show behavior similar to humans visiting graves of loved ones, such as stopping by old skeletons when they pass by and caressing them with their trunks. They've even been seen \"burying\" other animals and enacting typical mourning behavior, at least one of which was a sleeping human who had a very rude awakening. Elephants are crazy smart, man.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is happening in the brain when someone is unconscious?",
        "response": "We don't know exactly what is happening but here is the best guess. Anytime someone is unconscious (that is not medically induced) they have either sustained a traumatic head injury or are seizing. We know that the brain stem is usually spared because they are breathing and the heart continues to contract. The exception to this of course is when a seizure affects the midbrain and thus the occulomotor control goes out the window. We also know that the \"working memory\" which is in the prefrontal cortex, is damaged, as well as the hippocampus. This accounts for the memory loss of up to a minute before the incident. Other than that there is cell death.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water have no smell?",
        "response": "Smell (aside from taste) is the best sense for determining the toxicity of something. Because water does not have any toxicity or nutrients, and it is everywhere, humans did not need to evolve the ability to smell water, and so we didn't. Edit: the nose is just a chemical detector. There are certain chemicals that a human needs to detect for survival, such as the chemicals in rotting flesh etc. Humanity evolved to detect those chemicals, and had no need to detect harmless things like water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does resting my hand between my thighs warm me up?",
        "response": "You have a lot of nerve endings that control your hands. Perhaps warming them *tricks* your brain into thinking you are more warm than before. Check out this [homunculus](_URL_0_) to see the brain proportion that is dedicated to controlling certain body parts. As you can see, lips and hands require a lot of nerves and brain to control them (and to feel sensation from them).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do walls or doors affect wifi internet's speed?",
        "response": "Network engineer here. Your wifi router and your computer's wifi card will lower their speed to compensate for signal loss. Reception sensitivity is greater at lower speeds.  Example: If you have a wireless-G router, the maximum possible speed is 54 Mbps. However, as you get further away (or add obstacles such as walls or doors), the speeds will decrease to as low as 1 Mbps. If you have an Internet connection faster than 1 Mbps, you'll notice a significant decrease in your Internet speed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the police catch speeders before radar?",
        "response": "Have you ever been driving down the road and seen white patches on the road? Those patches are an equal distance apart. The police would time how long it took a car to get from one patch to the next. Multiply that out and you've got how fast they were going. There were other ways they did it, as well (such as just using other stationary references they knew the distance between, or if the officer was driving also, timing how long it took for the car to pass them/some other spot).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the moon is slowly drifting away from the Earth, does that mean it will no longer be tidally locked in a few million years?",
        "response": "The mechanism here is the Earth's rotational orbital momentum is being converted into the moon's orbital angular momentum. This will happen until the Earth is tidally locked to the moon, like how Pluto and Charon are locked to each other. However, I believe that the timescale for this to occur is so large that the sun will envelop both in a planetary nebula before that happens.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cigars smell good, but cigarettes smell horrible?",
        "response": "Cigars and pipe tobacco use real, raw tobacco (of course, dried and all the usual stuff you hear about them doing in colonial times). Cigarettes are ground, processed, and treated with chemicals to make them burn longer and have a taste. Plus, cigars are wrapped in tobacco leaves while cigarettes are just wrapped in paper.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the Shingles virus cause a rash?",
        "response": "As you know, but I'm restating, Shingles is merely a reactivation of the varicella zoster virus. The primary infection is commonly called Chicken Pox. After the primary infection, some of the virus will stay sequestered in the dorsal root ganglion of your nerves.  The reason it manifests in the way it does is that when it reactivates it reactivates along a nerve branch. On your skin we call this a dermatome. It simply means the area of skin innervated by a particular nerve branch. This is the reason the blisters happen in a patch. The virus has been reactivated in that dermatome. The reason for the blistering is that it goes from the nerve fiber endings into your dermis. As a fun note, herpes simplex virus acts very similarly but goes dormant in the trigeminal nerve ganglion (for cold sores) and the ganglion assigned to the genitals (for genital herpes).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that we can breed a lion with a tiger and not a human with another type of Ape?",
        "response": "We have 23 pairs of chromosomes, other apes have 24. A viable offspring needs the same number from each parent, it can't have 23 pairs and one extra lonely one. Other species can create hybrids because they happen to have the same number of pairs, such as lions and tigers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/How is my white hair turning back to my natural hair color?",
        "response": "As you age the deposition of pigment on your hair in the follicle becomes a little funky. Depending on how you treat yourself it can get better or worse. Maybe the new hairs growing are the ones with better pigment deposition?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The lead up, the fall and the aftermath of the Roman Empire",
        "response": "It all started with them trying to raise their debt ceiling...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly does hot liquids help with a soar throat?",
        "response": "When you have a sore throat, there is usually mucus that is essentially stuck. Hot liquids will help loosen that mucus making it less sore.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "single payer healthcare",
        "response": "This is ELI5!! Keep it simple, people. Single payer is basically Medicare for all. We would pay a tax and basically all our doctor and hospital visits would be covered. No more need for deductibles, out-of-pockets, and all that other bullshit related to private insurances. So it's not only better, but MUCH cheaper, too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come the music while on hold with almost any tech support line is really distorted, and yet the automated voice/assistant is perfectly clear?",
        "response": "Music is more complex than a human voice. With a standard rock band, at least three or for things are making noise at any given time: drums, padding instrument (guitar/piano), bass, and some melody (voice/guitar). It's hard to compress that amount of information into the sounds quality phones have, and phones tend to go only with what's loudest or sounding most recently. Comparatively, a single voice is simple.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is \"home field advantage\" so important in professional sports?",
        "response": "Well, in baseball, the field isn't standardized, so there's an actual advantage there for some players (it's why some parks are hitters' parks and some are pitchers' parks). For everything else, it's mostly a psychological advantage that comes from having your own crowd cheering you on. But there are other factors: if you're on your home field, you might be more well-rested, because you didn't have to travel. You're probably more used to the weather, especially in areas like Denver (thin air) or Florida (humid) or Minnesota (cold). They're small advantages, but possibly important ones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the justification for the existence of Kelvin to measure temperature if its just and off brand version of Celsius",
        "response": "It is the *corrected* version of Celsius, in which zero in actually zero (roughly, the point of no heat), and thus it works correctly for chemistry and physics. By contrast, zero in Celsius was arbitrarily set much much higher, at the freezing point of water, because people found that handy for daily life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can people who have had their corpus callosum severed multitask?",
        "response": "Sure, it's theoretically possible. Kim Peek was this guy who was born with a lot of brain deformities, but one of the major ones was he lacked a corpus callosum. Look him up, he was a really interesting guy, and he was the inspiration for the Rain Man movie. He was a savant literally spent his time memorizing everything he could, in a ton of different subjects, and he when he read, he read the left page with his left eye and the right page with his right eye. It's honestly absurd the sheer volume of information he ended up memorizing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could we have better & bigger telescopes based on the moon compared to the orbital ones around the earth?",
        "response": "Yes, this is something that has been considered. It hasn't been done yet because it's been too expensive, and for many telescopes you don't gain much over just putting it into orbit. But there has been discussion on putting a radio telescope on the *far side* of the Moon. The advantage here is the Moon would block out the stray radio transmissions from Earth. You would need a network of satellites to communicate with the telescope from Earth though. I don't think there's any specific plan to do this yet, but it's something that astronomers have thought about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Considering Iraq's superiority in technology, man power and resources, how did they fail to win the Iraq - Iran war?",
        "response": "Quick clarification question: what do you mean by Iraq's superiority in man power?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly are rubber bullets and how do they not kill?",
        "response": "Rubber bullets are \"Less than lethal\". This means that normally, being struck by such a \"bullet\" or projectile, is unlikely to result in death by acute trauma. Complications from the blunt force trauma may cause death. A rubber bullet is usually much larger than a standard bullet, minimizing the chance of this bullet from breaking the skin and entering the body. This type of bullet is also projected at a velocity considerably less than that of a standard bullet.Because of the considerable size and velocity difference, this type of bullet slows rapidly at distance. Pretty much, this type of bullet is similar to being struck by a baseball thrown by a professional pitcher. While it is unlikely to kill, it serves as a deterrent by causing pain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Please ELI5: How do you learn to program? What is the actual process, or both learning and of programming?",
        "response": "I read the same \"Teach yourself C++\" book about 10 years ago, and I *still* can't program C++!! The reason of course for that is that I don't work with C++. You have to use a language regularly to actually know it. But also, another reason is that those Sams books aren't really that good. I can't recommend a good book to learn programming but I can say that you shouldn't give up trying just because the book isn't good. Get another book, but more importantly keep trying.  A *great* website to ask programming questions and get good answers is _URL_1_ . Get started. Get a foundation in a language. Try to do something with it (anything at all, e.g. an mp3 renamer as megashark16 suggested, or as I did in college a math homework problem solver which basically just calculated the problems to give answers. The learning process was in figuring out how to convert the mathematical equations into code.), and if you have questions don't hesitate to ask the pros at stackoverflow.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do historians take Gunnar Heinsohn's \"male youth bulge\" theory--attributing European imperialism to demographics--seriously?",
        "response": "follow-up: i've heard the same explanation for the routiers causing trouble in france centuries earlier; was there really a consistent imbalance in europe for such an extended period of time?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the criticisms/short-comings of interpreting a city's safety based on crime PER CAPITA?",
        "response": "The likelyhood of you becoming the victim of a crime in your last example is 50%. In Smallville and Gotham it is 1%. Or 1 in 2 compared to 1 in 100. Smallville and Gotham are equally safe and way safer than scary Incestville.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are baby animals cool with humans/other species, but adult animals are not?",
        "response": "Most animals have the instinct to rely on larger creatures (usually their parents) to survive. Partially because they are not ready to defend themselves yet. Baby birds can't fly away, baby cats don't have the strength to attack, etc. If you raise the animal from birth, it will think of you as a family member, but anyone else might be seen as an intruder. When they mature into adults, they will still remember you as \"family\", but they might have other instincts that guide them to try and dominate you, which is why that one chimpanzee killed the lady that owned him after many years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In an uncomfortably cold environment, can consumption of capsaicin/spicy food (temporarily) increase perceived comfort?",
        "response": "Capsaicin mostly activates local *pain* receptors that detect heat, but it does not trick the body into thinking that it's overall temperature is higher than it is. Capsaicin would do nothing to reduce the discomfort of feeling cold and actually make it worse by stimulating a sweat response.  The key is that local sensors that detect tissue damage from extreme heat and sensors that detect overall body temperature are different. Capsaicin activates the former and does little to fool the body into thinking it is warmer than it actually is. If you pay close attention, you'll notice that the sensation of being burned is way different from the sensation of being overheated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the moon appear whiter in color as seen from the surface of the Earth than as seen from the surface of the Moon?",
        "response": "It is because the exposure of the astronaut's camera was properly set.  If you see the moon in the daytime it looks grey because your eyes are adjusted for daylight. At night your irises open and it looks brighter. It still looks grey to me.  BTW the fraction of light reflected from an astronomical body is called its albedo. The moon's is 0.13 while the earth's is 0.30-0.35 depending on cloud cover. [This photo](_URL_0_) shows the earth and moon in one shot taken from a million miles away. You can see that the moon is darker than the earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do a lot of US tv shows seem to be showing scenes in Mexico through a yellow filter?",
        "response": "Because it contributes to the illusion that we are looking at someplace hot and dry where the sun is really bright.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can chimps pass down cooking?",
        "response": "I studied chimps for several years. One big issue with teaching them how to cook is you must first teach them how to make fire. Making fire would likely prove a bigger obstacle than actually learning that cooked food is better than uncooked. Chimpanzees have been demonstrated to have a capacity to understand cooking and even prefer cooked food to uncooked food: Cognitive capacities for cooking in chimpanzees. Warneken & Rosati. Chimpanzees have developed and use intricate toolsets to get to termites, honey, hunt galagos. Unless provided with human technologies (ovens, stoves, etc.) chimps would be unlikely to learn how to make a fire but even if the skill was learned, the act of fire-making would be difficult if not impossible due to the morphology of their hands. (They have tiny thumbs)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since all the oceans are connected how come there is so much variance in water color around the world? blue, green, clear, brown, etc.... It would seem everything has been around for so long it would have had time to \"merge\"",
        "response": "The ocean isn't a stagnant pool, massive underwater currents constantly circulate the ocean. The different colors you see come from various sources, the depth of the water, temperate, algae, mineral content. Like you get that *gorgeous* light blue in the Caribbean because the water is shallow near the islands and is reflecting some of the blue tinted light off the white sand. (The light is tinted blue for reasons that I'm not smart enough to explain).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Escargot vs. garden snails",
        "response": "I don't eat snails but I do know that the ones they breed are guaranteed not to be poisonous, unlike some that you might find in other places.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a number base system (besides base 10) that makes the relationship between some fundamental masses or constant simple integer multiplication?",
        "response": "Well, in base 1369.003, you would get a 10:1 ratio. This is applicable to any proportion you want.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long does it take water to hydrate you?",
        "response": "A study showed that drinking 600mL of water can hydrate someone from “mildly dehydrated” to “full hydrated” in 45 minutes. Electrolyte levels seem to not have an effect as Gatorade did not work faster than water in this study. While the sample size is small (10 participants), the data should be roughly accurate. Water takes time to travel down the digestive system, reach the intestines and get absorbed. Then it needs to circulate through the body & reach the kidneys, before being passed out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they get bottles to break over people's heads so easily in movies?",
        "response": "It's usually sugar glass. Here's [the wiki for it](_URL_1_) IndyMogul also [has a good how-to video](_URL_0_) if you want to make your own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do integers have different sizes depending on the architecture of the computer? (64bit, 32bit)",
        "response": "The highest 32bit number, decimal 2,147,483,647, is in 32bit: 1111 1111 1111 1111 1111 1111 1111 1111 And in 64bit, that same number is: 0000 0000 0000 0000 0000 0000 0000 0000 1111 1111 1111 1111 1111 1111 1111 1111 Your question is basically the same as: how do the everyday, decimal numbers 982374 and 000000000000000982374 have different sizes. Which they do, because the latter provided more blank space for potentially larger numbers. We might in every day usage have supposed that that six-digit former number if increased to a million would simply warrant a seventh digit place - yet a computer, if expected to handle a seven-digit number, must be *guaranteed* a seven-digit slot.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/how does salt melt ice and snow?",
        "response": "Salt doesn't melt ice and snow, it lowers the freezing point of water. This means that the temperature must be lower than the normal 32 degrees Fahrenheit/0 degrees Celsius to freeze. [Freezing point depression](_URL_0_) is what's known as a [colligative property](_URL_1_), along with lowering of vapor pressure, elevation of boiling point, and changing of the osmotic pressure. In the case of freezing point depression, [this website](_URL_2_) describes a good way to think about it:  > As the molecules (of water) try to pack together to form a solid, the solute (salt) particles act as obstacles that block the solution (water) molecules from packing. This requires the solution molecules to have even less kinetic energy (molecules becoming slower).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the scholarly consensus on the validity of Chinese historiography?",
        "response": "What im more interested in is what has caused this sort of viewpoint to become more 'common'. When i was studying briefly in the University of Auckland a few years back, one of the History teaching staff was quite insistent that the study of History, and History as a idea, is a purely western concept and that the only 'real' history is that of the west or when done in a western style.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Before we had the ability to record sound, did people understand that their voices sounded different to everyone else?",
        "response": "Probably. A good impersonator could imitate someone and the person might be like \" That doesn't sound like me!\" and people around them could say \" Yes it sounds exactly like you\" So yeah.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our reflections look better or worse in certain mirrors?",
        "response": "Because sometimes the mirror gets bent concavely or convexely. This even slight bend causes you reflection to distort a little. It's the same way that funhouse mirrors work. Also lighting in the room of whatever mirror you are looking into would affect how you look",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a solid from of nitrogen?",
        "response": "Yes, it freezes at 63 K (-210 C). If you're working with liquid helium, you often have a system of liquid nitrogen that you have to be careful not to freeze with the helium. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do hospitals do with amputated limbs/body parts that they couldn't reattach?",
        "response": "Flagged as medical waste and handeled as local law allows, most cases it's incinerated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does X-ray crystallography work?",
        "response": "When x-rays are shot at a crystalline sample, they scatter off of each atom. The scattered x-rays from each atom interfere with each other, and a diffraction pattern forms at the detector (this is why the technique is also called x-ray diffraction). Just like how the distance between slits changes the resulting pattern in a double-slit experiment, different arrangements of atoms result in different diffraction patterns. For a 2-D lattice, the Fourier transform of the diffraction pattern gives you a 2-D map of the electron density, which is essentially the locations of the atoms on the lattice. To get 3-D information, the sample is rotated and diffraction patterns are obtained for different angles, which can be correlated and have Fourier transforms applied to determine the 3-D lattice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were Conquistadores really mitaken for Gods?",
        "response": "These two previous posts cover your question _URL_0_ _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why everything sounds louder at night",
        "response": "I guess its because of that everything is more silent at night, if that makes any sense...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly do pirates in their tiny boats manage to get aboard such large vessels to take it hostage?",
        "response": "With a ladder and guns.  Ever see that movie Captain Phillips? Go watch that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Graham’s number, how is it (theoretically) calculated, and how big is it?",
        "response": "Its a number suggested as a bound for a mathematical problem. The problem is to do with subgraphs of hypercubes (cubes in more than 3 dimensions) and grahams number is a suggested lower bound for the number of dimensions needed in that hypercube. It can't really be calculated, as in, I couldn't write the number down and show it to you. If I divided the universe into its smallest unit (Planck volume) and wrote one digit of grahams number in each of the smallest conceivable spaces, I still couldn't show you grahams number. Its normally expressed in knuth-up-arrow notation, which is a method of expressing big numbers by compressing them into a set of rules.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is bicarbonate?",
        "response": "Bicarbonate is HCO3(-). It acts as a buffer keeping your blood within certain pH values.  It is formed when H2O and CO2 are combined in red bllod cells by carbonic anhydrase(an enzyme) to make carbonic acid, H2CO3. This carbonic acid quickly breaks down into H and HCO3. When it reaches the lungs the bicarbonate is separated back into H2O and CO2.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "On what extent does the recent increase in arctic ice caps contradict what scientist have believe until now?",
        "response": "[Here](_URL_0_) is an interactive graph showing Arctic sea ice extent since 1979. While the extent of sea ice has rebounded from the very low levels of 2012, the levels are still nearly two standard deviations below the 1981-2010 average value for Arctic Sea ice extent and slightly above any other levels for the past 6 years. The overall trend is still downwards.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can someone explain sister cities to me LI5?",
        "response": "When two cities are about the same size, have the same factories, or have mountains and rivers like each other. They form a partnership and agree to be friends. They usually exchange gifts like statues or art. Then, people from each city visit each other and see how they do things in their city.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's happening in the human body when it gets chills?",
        "response": "Our body decides if it's too cold or too hot based on signals from the brain (hypothalamus, to be precise). Both shivering and feeling\"chills\" are a reaction to situations where the body thinks it is cold. Shivering is a mechanism to warm your essential organs. When you have fever, or have certain types of infections, chemicals called cytokines are released in the blood, these go and mess with the temperature control of the brain, or they reset the \"normal\" temperature. So your body suddenly feels like it's cold, because the \"normal\" temperature has been messed with and pushed from say, 35.0 °C (95.0 °F) to > 37.5–38.3 °C (99.5–100.9 °F), leading to you \"feeling\" cold, even though you are actually warm. This usually settles down quickly, except in certain illnesses where these chemicals keep getting released (Typhoid, for example).  Source: I'm a Physician",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't clouds rainbow-colored?",
        "response": "Sometimes they are! And it was one of the most beautiful things I ever saw...[circumhorizontal arc clouds](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how does Melatonin wake you refreshed and helps you sleep at night?",
        "response": "Melatonin's main job in the body is to regulate night and day cycles or sleep-wake cycles. Darkness causes the body to produce more melatonin, which signals the body to prepare for sleep. Light decreases melatonin production and signals the body to prepare for being awake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the origin of the force that holds a gyroscope up?",
        "response": ">  Since the center of mass wont accelerate on the z axis That's not true, the center of mass is out in the air. Gravity applies the force to the center of mass, that moves the center down, the pin in the middle pushes up and it applies a torque to it, that torque is applied to the gyroscope, and it resists the torque which is what keeps it up. I don't want to just make a mistake on something the wikipedia already covers, so read up on [gryoscopic precession](_URL_0_), but the end result is this setup ends up trading radial velocity around the support for stored energy in the gryoscope poprortional at a rate porportional to acceleration.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does a complex number have a polar form if the real part is 0?",
        "response": "Any complex number z has a polar form r\\*exp[i\\*phi]. The principal argument (phi) of a purely imaginary number is pi/2 or 3pi/2. This is easy to see if you draw it on an Argand diagram. To find the angle, you just need to solve tan(phi) = Im[z]/Re[z]. If you take Re[z] to zero, tan(phi) goes to infinity (positive or negative depending on the sign of Im[z]). This happens at pi/2 (or shifts from pi/2 by n\\*pi for integer n).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the US is around 17 trillion dollars in debt, how can people continue to live their everyday lives without any noticeable change? What is the problem that the debt is actually causing?",
        "response": "National debt is not the same as personal debt. In fact, national debt is a very very good thing. All of those debts that add up to 17 trillion dollars have hard-set timetables for completion, no, China cannot \"call it in\" and ask for all of their money back.  National debt is a good thing because it means that other countries are happy to loan to the United States, and they are confident that they will get their investment back and more. Confidence is the driver of economies in a virtuous cycle, so as long as other countries keep loaning money to the United States, the US economy will be healthy. The day the US stops borrowing money is the day that the economy crashes worse than ever before.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are photos taken by cell phones more grainy when the lighting isn't that good?",
        "response": "The camera has to compensate for the lack of lighting by increasing the sensor's sensitivity (nowadays commonly known as ISO). Higher sensitivity means that it is also more sensitive to random noise, which results in grainier images. Better cameras have larger sensors which are less affected by this noise, so they can shoot at a higher sensitivity without as much noise.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't I remember any memories before the age of 6 or 7?",
        "response": "You know how mom and dad kept telling you not to climb the back of the couch? Well... You didn't listen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do probiotics actually work? Do we really understand gut bacteria well enough to regulate it?",
        "response": "You aren't conflating the two. Two points: one, probiotics are getting huge because there's money to be made, not necessarily because they work. Second, just because we don't understand how they work doesn't mean that they don't work.  Basically, our understanding of the GI microbiome right now is extremely limited, and even when we do have science to back up probiotics, that science is *way* more limited than claims that probiotics make in the marketplace.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much energy is lost through sound during collisions?",
        "response": "That's an interesting question. One thing that comes to mind right away is that it seems much easier to measure than predict since we can record sound from a single point some distance away and make some rough assumptions about the shape of the wave. An interesting complication is that the nature of the colliding objects and the medium in which they're colliding is involved. Obviously there's no sound in a vacuum so all the potential sound energy would probably be trapped as heat. The density of the fluid as well as the hydrostatic pressure would determine how many molecules had the chance to steal some of the vibrational energy from the colliding objects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does ordinary matter exert force on dark matter? Or is it a one-way interaction?",
        "response": "The \"force\" holding the galaxies together is gravity. We speculate the existence of dark matter because, based off of the math, there simply is not enough matter existing in X galaxy to exert the gravitational force detected. Therefore, we postulate that there must be an unknown, undetectable form of matter that must be present in order to account for the levels of gravity. Dark matter is basically just matter we cannot detect, both would have gravity and both would exert gravitational force on the other.  One place that we are starting to look for dark matter is in labs deep within the earth. I read awhile ago that they are conducting experiments in forsaken mindshafts in order to test for dark matter (since there would be too much interference from neutrinos and other forces on the surface).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Kubrick's 'Dr. Strangelove', a B52 bomber avoided radar detection by flying just above the ground, as low as possible. Was this a viable tactic, and if so was it ever put into use?",
        "response": "Nap of the Earth is a fairly common tactic, and I found [this planning document from 1988](_URL_2_) that mentions the reduced airframe life of the B-52 under NOE flight:  > Therefore, the figures presently being used may or may not be reflective of future usage in light of new low level flying patterns required by the necessity of the aircraft to remain close to the \"nap of the earth\" in the new conventional role.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "One reason for the success of the Mongols was down to their infamous horse archers, why dint medieval Europe copy this unit type after seeing their effectiveness?",
        "response": "A significant aspect of the Mongol horse archers was their way of life (horsemanship, bow hunting, nomadic ways) and how that contributed to their military success. Europe can't just copy a unit of horse archers because it takes a life time to become a master horseman and/or archer. The Mongolian steppe lifestyle basically forces all of their men to become masters of these two aspects which are both practical life skills on the steppe and incredibly potent wartime skills.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Habsburgs had an elaborate burial tradition: their hearts, intestines, and bodies were all buried in separate locations. When and how did this originate?",
        "response": "Follow-up question: was this only done by the habsburgs, or were there other important dynasties that did this as well (eg Hohenzollern, Capet+cadet branches, English monarchs, etc)?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a new country was formed and wanted to make it's own fiat currency, and the international community recognized it, how would the value be determined?",
        "response": "It's determined by international trade. Maybe I'm in the US and want to buy tomatoes from you and you want to buy a hard drive from me. So you offer me 10 dollars of your currency and I accept it if I can buy enough tomatoes from you to equal the value of the hard drive. In practice banks step in on each side trading money in and out of the accounts so we can both use our own currencies. But it's ultimately tied to our ability to buy things. If you run out of tomatoes for me to buy then I'm not going to sell you the hard drive unless you give me more for my hard drive, and maybe I'll do it when I can buy a truckload of peaches from you instead. The exchange rate is whatever we agree on the price for our hard drive in each of our own currencies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all produce is grown in an open climate, why does some produce like broccoli need to be stored in a fridge, while some produce like avocados can be stored at room temperature? How come some can be stored either way also, like strawberries or grapes?",
        "response": "When fruits/vegetables are growing, they're part of a living plant. When you harvest them, they're no longer being supported by a living plant & you want to keep them in an environment that prolongs their freshness. Look at a slab of meat. That used to be an animal. Animals are fine *until you kill them and cut them up* and then they start to rot fairly quickly unless you do something to preserve the meat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is “aren’t” the right word to say for “aren’t I” when that is literally “are not I”? For instance, it would be “Why are not I asleep”",
        "response": "Because it is a conjugate pronoun/adverb. If that makes any sense.  \"Why aren't beds firmer\" \"Why are not beds firmer\" \"Why are beds not firmer\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do ‘good’, ‘mood’ and ‘blood’ not rhyme?",
        "response": "Language changes based on how people use the words. And sometimes it has to do with the word origin.  & #x200B; Blood is Blut in German and blōd in Old English. So in Old English that would have been spoken the way we say the word Blowed (or bloat), and then the pronunciation changes over time. Also spellings of words that came before printing can change over time based on the scattered different printings of words.  & #x200B; This makes the word good interesting because it used to rhyme with blood (like go-d, blowed), and in German it's like Goot.  & #x200B; The last point to make is to never trust English. It doesn't strictly follow rules like other languages because it's a mish mash of a bunch of different languages which get changed over time based on how people use the words. The words Knife and Knight used to pronounce the K and it became lazy to say the word without the K and that stuck. Like people saying Wanna instead of Want To.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Objects in mirror are closer than they appear\" why?",
        "response": "Why do they appear closer? Because the mirror isn't flat. It's slightly parabolic. Why is it parabolic? It gives you a wider field of view and makes your blind spot smaller.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is (and isn't) history?",
        "response": "Twenty years is generally regarded as the break point between journalism and history. At the other end and going back in time, history is generally regarded as being supplanted by archaeology when the perception of the past is defined by artifacts rather than the written word. Both zones are a bit grey, however. For places and times when written records begin to exist, archaeology continues to shape our perception of the past. And some historians, being a generally sneaky lot, tend to sneak into the current period (that is, into the time that is less than 20 years ago).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do hotels determine which room each guest gets?",
        "response": "I am friends with many people that work at one of the largest hotel software management companies in the world. They have software that tracks room use and selects a room based upon multiple factors: 1) Is a room with your requests available (two queens or a king) 2) Has the room been cleaned and is ready 3) Is the room ready, but has a known problem. Some times they'll avoid using rooms with a leaky faucet until maintenance can fix it. However, if the hotel is busy, they'll use the room anyways and hope you won't mind. 4) Lastly, they keep track of wear and tear on the room. If one room is being used disproportionately, they'll modify its selection. This will depend upon how hotel management wants to replace items. Do they want to do a complete building renovation every five years or do they want to do a rolling renovation as rooms become worn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where are the spacecraft that record solar activity stationed?",
        "response": "> NASA's Solar Dynamic Observatory captured this view of the event. SDO is in geosync orbit. The GOES satellites (primarily used for weather monitoring) are also used to measure the intensity of solar flares (not shown in those videos).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are cigarettes only sold behind the counter while alcohol is on the shelf?",
        "response": "The Cigarettes are much easier to steal, I believe. If you notice the small \"hip\" size bottles of alcohol are also behind a counter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there no measuring unit for darkness?",
        "response": "Light is measured in lumens. The reason there is no measure of darkness is the same reason that there is no measure for shortness, or coldness...because there is already a measure for length and heat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that I can tolerate or even enjoy my own farts, but can't stand other people's? I assume I'm not alone in this phenomenon.",
        "response": "We're all like that. LPT: Next time your buddy lofts one in the car, claim it as your own. He'll be grossed out at his own fart if he's not sure if it was his or yours. I did that to my wife a few days ago. In the car, the smell creeped up into my nose and I could tell she was trying not to laugh. It was bad. I started laughing and saying I was sorry for doing that, and rolled down my window. She dry heaved.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did birds develop the ability to fly?",
        "response": "As far as *how* they formed wings from my understanding the most common theories are that winged animals evolved from their gliding ancestors who started to flap their gliding organs to produce thrust instead of a steadily declining glide and through evolution wings evolved. As far as *why?*.  * To escape predators easily, if you were one of the first animals to fly, you were one of few.  * It is also presumed that the previous reversed is also true. Flying animals used their flight to catch prey off guard, in the way hawks etc do today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where there many Moslem-Christian marriages in the period of the Crusaders for political reasons? How were these perceived by the general public?",
        "response": "There was almost a marriage between general Al-Adil, the brother of the famous Saladin, who had fought by his side during the Third Crusades, and the sister of Richard the Lionheart of England, Joanna. Richard, who had been fighting for weeks in Syria, was having a tough time with taking Jerusalem from Saladin. However, due to the friendliness of both men, the two generals starting getting close to one another, and began seeking peace. This marriage would have brought joint control over Jerusalem. The condition was that Al-Adil would have to convert to Christianity. The marriage fell through because Joanna refused to marry a Muslim, and Al-Adil refused to convert.  More on the marriage here, in this documentary : _URL_0_ Source: *Charles River Editors. Legends of the Middle Ages: The Life and Legacy of Saladin (Charles Rivers Editors), Kindle Edition.*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is going on in your muscles between weightlifting sets?",
        "response": "A few things. During quick high intensity movement nearing maximal effort your body builds up lactic acid as a metabolic by product. Depending on your tolerance and training you may be able to build up more or less before exhaustion. Once finished the body begins to clear the metabolic byproduct as efficiently as it can(with training this process becomes more efficient). Also the first energy way your body produces ATP for energy is via the phosphocreatine process. This is extremely quick and the bonds break quickly not relying on oxygen which is a longer process. Depending on how long your rest is gives more time for phosphate ions to reestablish bonds with unused creatine ions. Source: ^exercise physiologist",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If humans evolved to better survive, why would we develop an urge to kill ourselves?",
        "response": "Most of us don't have an urge to kill ourselves.. If you're talking about the thoughts that many people have about possibly doing something suicidal, such as randomly cranking your steering wheel one way and crashing into a tree, use the search bar on the right and look for 'intrusive thoughts'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why has gold been coveted throughout history?",
        "response": "Gold is remarkably unreactive, so appears as native metal; i.e., you dig it out of the ground and it is ready to go - there's no smelting or processing required. On top of that, it's very sparkly and doesn't tarnish. on top of this it is easy to work with. All of those things make it a prime metal for decorative work. Its scarcity is what gives it great value. From there, those factors play together to create demand and hence it's coveted. We have since found it's also a useful electrical conductor, and can be used in a range of other processes. But all of the recent stuff is secondary to the easy to work, sparkly, unreactive and uncommon properties which got it where it is today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is pragmatism and what are the opposing views?",
        "response": "Pragmatism is the idea that you should be practical and do what seems most logical and reasonable at any given moment. Also that you should judge actions you take by their results. If your actions don't accomplish what you wanted, then try something else. Opposing view would be [Dogmatism.](_URL_0_) The idea that there's a rigid moral code that specifies every little aspect of human behavior. And if you ever do anything outside the code, you're a bad and evil person because you dared to think for yourself. Also you need to stick to the code regardless of how your actions (dictated by the code) impact the real world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Aren't people in congress who took money from people not forced to abstain from a vote?",
        "response": "Because then all I'd have to do to stop something from passing is donate small amounts of money to some people who supported a bill.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come dads feel antipathy towards their daughter's boyfriends but not towards their son's girlfriends? Do mothers have similar feelings about their children but vice versa?",
        "response": "The antipathy is largely exaggerated for comedic effect in media. IRL, it's a case-by-case basis and often it's not even there, especially for younger, more progressive generations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen with two telescopes?",
        "response": "Okay.... This blew my mind and got me thinking..... I've reached the conclusion that you wouldn't be able to see anything because the focal point of the far away telescope is right At it's own eye piece. So the focus would be WAY off, and that's only if you could get it aligned correctly. Have you ever looked through binoculars and then taken your eyes away from the eye pieces? The edges become black until the view shrinks into a tiny little dot that moves around depending on your viewing angle, which doesn't take much movement at all to move to the point where the for disappears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Besides aerodynamics, what factors influence the changing styles of cars and other automobiles throughout the years?",
        "response": "Government crash test safety regulations have had a massive effect on the design of cars, far more so than aerodynamics. The tall doors, narrow windows, thick pillars, blunt front ends, and high rears that define virtually every sedan these days are largely to pass crash tests.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people lose coordination while playing VR games?",
        "response": "Have you played it? There's big difference between looking lifelike, and looking good enough to throw off your senses. If it's good enough to make you believe it's moving, your mind is getting different signals from your equilibrium and balancing sensors (in your ears) and your eyes.  Think about it like motion sickness, even if you know you're moving in a car, your body still gets confused and you get sick.  The same thing is happening here. Your eyes are telling your brain you're in a moving cart, or falling down, and it responds and gets confused.  No matter how enlightened you think you are, or in touch with your body, when your eyes get deceived and they send the motion signals to your brain, there's nothing you can do about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A scene from the movie Gravity - SPOILERS AHEAD!",
        "response": "You're right to be confused. It is 100% wrong as depicted in the movie, and a lot of people of wondered about why they made such a grave error considering the rest of the movie was *somewhat* realistic. It is likely that the reason this happens in the movie is that it makes things more dramatic. Artistic license is a real thing, and directors often employ it for emotional or dramatic effect. It bugs us science types, but that is the world we live in!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How the repeal of some provisions of the Glass-Steagall Act in 2000 led to the economic problems of 2008-present.",
        "response": "Glass-Steagall made it illegal for certain companies to own other, financial companies. In effect, this meant investment banks (that invest in other businesses) and commercial banks (where you go to save your money) couldn't be owned by the same people.  The Gramm–Leach–Bliley Act removed this provision. This meant that companies that gambled on other businesses (investment banks) and companies that did home loans and deposit and so forth (commercial banks), could become one institution. It meant that investors could gamble with more money than they could have previously. Bigger rewards for the banks, but a bigger risk that ultimately made the recession worse because all banks were now exposed to investment failures instead of just investment banks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can muscles be naturally more efficient and stronger ?",
        "response": "Two things to consider: Strength relies primarily on muscle recruiting. When you are trying hard for the first time, you are probably only firing like half your neurons and thus half your muscle fibers. Most gains at the beginning of a strength training program are made neurologically, as your brain learns to fire all of the neurons at the same time (even though we never fire them all, we can get a lot better than half). This is the biggest difference between muscles of the same size that are strong and weak. With similarly trained muscles of similar sizes, there are two anatomic differences that matter. Length of muscle/bone, and where the tendons attach. Those have to do with geometry of the situation, which is why people with short arms bench so much more than people with long arms. This is a secondary concern however.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we launched a giant mirror into space, could we use it to observe earth in the past?",
        "response": "Hypothetically, a big mirror with a clear line of sight that's far enough away could possibly reflect light back at us and show us the past. But since we'd never be able to send it away at anything approaching the speed of light, there wouldn't be much of a delay (at least not until it got far enough away, which would take **ages**) and therefore it wouldn't show us stuff from too far back - and we'd never, ever be able to see anything from earlier than the point at which we launched the mirror anyway.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are radio ads allowed to use loud, disturbing noises such as car horns, sirens, and cars zooming past us?",
        "response": "It's illegal to simulate the official Emergency Alert System sound, but not car horns or other sirens. I don't know whether this is the FCC's choice or a First Amendment issue, but I would guess the FCC thinks it's a First Amendment issue so they haven't done anything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do smaller animals have faster heart rates than larger ones?",
        "response": "This is for mammals only, and it's because of metabolism. Small things cool down faster than big things, so small things need to burn more energy to keep warm, so small things have faster heart rates. It also helps that it's easier to move a small thing than a large one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "who and how do they determine how many calories are in a particular item of food?",
        "response": "A calorie in your food is the amount of energy that is needed to raise the temperature of one kilogram of water by 1 degree Celsius. This is done by burning the food in something called a bomb calorimeter. That is a box within a box. A sample of food is put on a dish in the inner chamber of the calorimeter, fill it with oxygen and seal it. In the outer chamber a measured amount of water is filled. An electric spark in the inner chamber ignites the food. As it burns it raises the water temperature in the outer chamber. The amount the water heats tells us how many calories are in the food. If the the temperature of the water goes up one degree it has one calorie.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "please, the different defensive formations in American football. I'm listening to sports talk radio, and they just mentioned that this one guy would be used in nickel packages. I'm a football fan, but I just don't understand what these mean.",
        "response": "A nickel defense is used when the defense expects the offense to pass--when the team on offense has to get a lot of yardage, or perhaps is behind and needs to score quickly.  A nickel defense uses five (hence the name) defensive backs--that is, players who play well back to cover receivers from the offense coming down the field to catch passes. Normally, a team playing on defense would have only four players back. Teams could also run a dime defense, which adds an additional defensive back to the nickel to make six players defending against the pass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How will fusion be turned into electrical energy?",
        "response": "I think what op means is how do we transfer the heat of fusion into the water if the fusion reaction isn't allowed to touch anything. To answer, there are three ways to transfer heat; conduction (touching), convection, and radiation. If conduction isn't available there is still sufficient convection and radiation to get the job done.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between ham and pork?",
        "response": "Pork is the general name for meat from a pig. Ham is (usually) the top of the leg that has been brined and then cooked. This adds flavour, preseves it (more applicable before refrigeration but still somewhat useful) and creates a more appealing texture when cooked. You could apply this technique to pretty much every cut of pork but it works best with pieces that need to be slow cooked, as quick-cooks like the terderloin or chops are tender and flavourful anyway. Source: am chef.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there tension between athiests and believers in the ancient world?",
        "response": "linking older threads is not intended t imply that the question has been answered to its fullest extent or that new answers are discouraged. But the OP may be interested in reading the threads below: * u/XenophonTheAthenian on [How were Atheists treated by Greek / Romans?](_URL_1_) * u/i-ate-a-penguin on [Were there atheists or agnostics in the Ancient world? What did they believe and how were they treated?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the \"races four\" mentioned in the 1919 version of God Save the Queen?",
        "response": "In temporal order: Britons/Celts, Angles, Saxons, Normans.  You know, the ones that a white, imperial power would actually want to put in their national song! We wouldn't really consider these \"races\" today, but rather \"ethnic groups.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we discover planets that are so far away?",
        "response": "Usually exoplanets are discovered by looking for a characteristic wobble of stars in a telescope. Because gravity from planets will affect the spin of their star, stars with planets will appear to wobble back and forth compared to other, naked stars. Then, by calculating the expected size of the star and the size and frequency of the wobble, they can make an educated guess as to the size and distance of the exoplanet from their star, or even if there are multiple exoplanets.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does that typical fridge taste come from when you've had a jug of water or lemonade standing in there without a lid for a couple of days?",
        "response": "Basically there are food particles all over the fridge, and they accumulate on everything. If you leave something uncovered, it they will accumulate directly on your food/drink. You can avoid this and have a \"fresh\" fridge by keeping an open box of baking soda inside.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are some of Pluto's moons really ellipse shaped?",
        "response": "They are not ellipse shaped, but they are not spherical either. Objects that aren't big enough for gravity to pull them into spheres have potato-looking shapes. The cutoff is around 200 kilometers radius: _URL_0_ New Horizons did recently get some images of Pluto's smaller moons. [As you can see](_URL_1_), Nix looks like a potato.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is the common cold? Why haven't humans developed immunity?",
        "response": "A variety of viruses cause the same effect of common cold. For example; Once you have caught a specific strain and your immune system cures you, then you have immunity (antibodies) to that specific cold virus for the rest of your life (or so, immune system responses do tend to fade with time, hence booster shots). But still, the big problem is there are over 250 coronavirus and rhinovirus strains which cause what we call the common cold. That is why some are head colds, and some are chest colds. Different strains of virus.  We've evolved a lot to deal with them, probably no one dies of common cold. Still viruses are small and they mutate way faster than humans. So yeah, there is still the problem of common cold.  Although, in theory if a human were to live 260 some years, he'd be immune to common cold as he would have developed immunity to almost all the common cold viruses.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do places like Hooters get around anti discrimination laws?",
        "response": "Title VII prohibits employment discrimination based on things like gender, race, and age.  [Title VII also, however, allows for discrimination based on protected characteristics (except race), when that characteristic is what is called a \"Bona Fide Occupational Qualification\" (BFOQ). To be a BFOQ, being a member of that group is essential to the job.](_URL_0_) Hooters was sued by the Equal Employment Opportunity Commission (who argued that Hooters was primarily providing food, which you don't have to be a woman to do) and they argued that their waitresses main function was offering \"vicarious sexual entertainment\" to their customers. They settled out of court for over $3 mil and agreed to start having positions available for men (bartender, host, etc). The entertainment industry tends to be the most successful when arguing for this kind of exception.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are calories more important to weight loss/gain than the weight of the food being eaten?",
        "response": "Think of your body like a fire. Adding tons of wood to the fire will make it burn yes, but also wet wood is heavier, so shouldn't that make more fuel? In the same way, how much heat will you get from throwing gas on the fire. Think of gas as calories, they can be immediately burned, while the wood (fat) takes more time but is a better form of constant energy. So it isnt how much in weight you eat... but how much of that weight will stick you to (and more importantly how much is usable)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a zombification virus ever exsist? Is there anything similar to it that exsists?",
        "response": "There are a number of organisms that disrupt/hijack the brainfunctions of other animals, turning them into mindless vessels that serve only to procreate the first organism. [Toxoplasmosa gondii](_URL_0_) is one such parasite Nowhere near hollywood zombies though, but the potential does exist.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were WW2 armies able to train large numbers of conscripts in complex tactics, an achievement which had eluded many previous armies?",
        "response": "There was a lot of training involved for D-Day. A huge difference between the WWI and WWII (or at least D-Day), is that WWI was already on the mainland and under threat. Reinforcements were needed quickly. Before D-Day, the Western Allies had the time to deliberate and prepare for their great offensive on the mainland. Another part is that as time went on, the conscripts and volunteers may not be any better in skill or training, but the officer corps was strengthened and training techniques were honed. The run of the mill conscript didn't really need to know complex tactics, all they needed to do was follow orders from the officers who did.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who was that one Egyptian Pharaoh who let artists depict him accurately?",
        "response": "I believe you are thinking of pharaoh Amenhotep IV or Akhenaten. Depictions of him are thought to be radically different from other pharaohs. I am at work and on my phone so i cannot really contribute to this discussion. But i am reasonably certain this is who you meant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Talking to a sales representative he implied knowing my browsing habits, based solely on me visiting his website (or perhaps through my email address). How can I know what advertisers know about me?",
        "response": "When you visit a website, it can store a little file in your pc with some data on it, these are called \"cookies\". Since the introduction of \"LocalStorage\" it was the only way to keep info on the client (you) side. Allowing the \"keep me logged in\" feature to work in any site. But since the ad and user info bussines became a thing, they can be used to track you almost everywhere on internet. That \"share on facebook\" button on a recipe blog? Reads the facebook cookie, identifies you and sends the info to facebook. That adsense banner on a news site? Reads the google cookie, identifies you and sends the info to google. All of this without you being aware and with your consent. What? You didn't consent it? Remember those Terms and Conditions you never read when you created your Facebook or Gmail? Yep. And then they sell that info to whoever wants to buy it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I open a non-text file with a text editor a bunch of symbols and text appears, where does this come from?",
        "response": "From the file. All files contain just a sequence of bytes, and then it's up to the program that reads the file to make sense of it according to some specific file format that defines what the bytes mean. Text editors don't usually check whether the content of the file looks like sensible text, they just assume you know what you're doing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Venus and the Goldilocks Zone",
        "response": "Not with its current atmosphere. The difficulty with Venus is that it's got so many greenhouse gases that it gets absurdly hot - this is pretty much independent of the existence of plates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the Belgian involvement in the Algerian war of Independence?",
        "response": "The nation of Belgium and its armed forces was not involved in the Algerian War. There are no existing records or sources that reference any involvement of the Belgium armed forces for the French cause. Are you certain that this fellow you ran into said that he fought under the Belgian flag? There is of course the possibility that he was a Belgian man in the French paratroopers or perhaps more realistically, a Belgian French Foreign Legionnaire.  I also find it very hard to believe that someone belonging to the paratroopers would find themselves being captured in 1962 when the FLN (and other insurgent groups) were essentially limited to their bases and areas and were actively being fought into tighter and tighter spaces as a result of the Challe offensive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since we are in a world that uses radio waves left and right, Would a lifeform that sees radio waves (Like how we see light) be blinded by the amount of radio waves?",
        "response": "This is a bit speculative of a question but I can answer in terms of telescopes. It depends on how much there is. We see optical wavelength light and we are bathed in it, yet we can still see. A sensitive optical telescope can still see sources in the sky if there are other lights around, it's just that it becomes less sensitive to fainter objects, which is the same reason that you can see less stars at night in a city than in the countryside. Similarly, radio telescopes can see the radio sky but need to be in radio \"dark\" locations away from cellphone signals, wifi, etc. If these things are around you, you can still see objects in the sky if they are bright enough, but fainter things will be difficult to see. So, you should build a telescope in a radio quiet zone in [Green Bank](_URL_1_), WV, and not [Shanghai](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the Democrats trying to accomplish with this sit-in?",
        "response": "They are trying to garner so much public support for their cause that republicans are forced to work on some legislation for the control of firearms. Specifically they believe there should be real background checks, no guns for those on no-fly/terrorist watch-list and that there shouldn't be process exceptions for gun shows.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Bitcoins. What are they, why are they sketchy, how do you get them, and why are they better then Runescape-currency?",
        "response": "Bitcoins is the currency of the internet. It's sketchy because bitcoins are used to transact on the blackmarket. Getting bitcoins is like putting your computer on a parttime job. I don't remember the specifics but it's something along the lines of doing number crunching.  You can't buy drugs and guns with Runescape money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can copper treat infections and kill germs, specifically?",
        "response": "Copper is pretty effective in killing bacteria. It still isn't clear exactly how copper kills bacteria. One mechanism proposed is that copper takes part in Fenton-like reactions which generate hydroxyl radicals. These reactive oxygen species then can cause cellular damage and ultimately death. Macrophages may also use copper to destroy pathogens they have engulfed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a public restroom at a mall need a box for needles and other disposable sharp instruments ?",
        "response": "For the hundreds of thousands of diabetics that have to give themselves insulin shots in public bathrooms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the air quality in major cities today worse than cities in the early 20th century like Birmingham which were industrial hubs?",
        "response": "This is largely dependent on which specific city you are trying to look at. I'm not sure of any city in the United States that actually has lower air quality levels than they did in the early 20th century even with population expansion.  In the developing world you can definitely find cities like this. Beijing and Mumbai are obvious examples.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do electrons know where to go?",
        "response": "The same way water moves down a pipe: the forces applied to them make them move in that direction. But that's not *totally* accurate. While there is some electron drift when electricity flows, most of them don't move too far--the pulse of electricity down a wire is less of actually flowing electrons and more a wave of excited electrons, in the same way that a wave in the ocean has more to do with the water going up and down than front-to-back.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Just what sort of 'arms' does the second amendment refer to?",
        "response": "The Articles of Confederation, which preceded the Constitution, had this to say about arms and militia: _URL_0_ _but every State shall always keep up a well-regulated and disciplined militia, sufficiently armed and accoutered, and shall provide and constantly have ready for use, in public stores, a due number of filed pieces and tents, and a proper quantity of arms, ammunition and camp equipage._ ~ Which makes it rather clear that the arms are meant for _military_ units - supported by state-supplied ammunition and artillery; along with other supplies needed to keep a military unit functioning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Old bayonet found in Swedish forest",
        "response": "This looks to me to be a [brown bess bayonet](_URL_4_), which were issued in Sweden as m/1808 and m/1812. The dimensions certainly fit, and the markings would suggest that this one was issued to the southern battalion of the Gotland Militia (Gotlands Nationalbeväring), as indicated in your [third picture - 7) S 2584, where 'S' indicates the battalion](_URL_2_). Other examples may belong to 'M', middle, 'V', Visby, and 'N', Northern battalions. Sweden [purchased 23000 muskets](_URL_0_) of models 1762, 1794 and 1809 between 1808 and 1812 from Britain, so this bayonet may well be of British manufacture, stamped in Sweden with the unit markings. I don't have a source which could reasonably estimate its age, but based on your measurements it could be a [1780 Short Land Pattern](_URL_3_) or a [1796-1819 BO India Pattern](_URL_1_), so the highest estimate would place it at around 240 years old, though it must be understood that this is far from definitive and at best speculative.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are suicidal thoughts such a common side effect of so many medications?",
        "response": "I’ll add that some antidepressants (like Prozac) have black box warnings for increased risk of suicide because these medications can improve a person’s motivation before they start to improve their mood. Typically we say it takes up to 6 weeks to see a full benefit from antidepressants. Now, say you’ve got a patient who is extremely depressed, and they’re so low that they don’t even have the motivation to attempt to kill themselves. Then they start Prozac, and after 3 weeks they start to notice an increase in energy and motivation, but not mood, because that may take longer. Now they go out and buy a gun or rope or whatever and attempt suicide (and may or may not succeed) whereas before they were still depressed but didn’t act on it because they were frozen in inaction. This is how it was explained to me by my psychiatry attending.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a house burns to the ground, why is the chimney still standing solidly behind the remnants?",
        "response": "The chimney is designed to not catch on fire for obvious reasons. So it's usually brick (which isn't flammable) while the rest of the house could be wood (which is flammable).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do smelling salts work?",
        "response": "The way I understand it, the ammonia irritates the nose and lungs, which causes you to reflexively inhale and take in more oxygen. That nervous system impulse also helps trigger alertness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how is a \"feels like\" temperature calculated.",
        "response": "Wind pulls moisture from things. That moisture contains heat. Humidity changes how much of that moisture and heat the wind can take. It can be calculated between wind speed, humidity, and actual temperature or measured with what is basically a thermometer wrapped in a wet sponge. Thus, the static temperature is -2 to a dry piece of glass, but not to a watery human that can be chilled by the wind and evaporation of sweat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the current science of using Nicotine in treatment of ADHD?",
        "response": "Nicotine and Cancer: I'm not an expert, but to the best of my knowledge, you can not get cancer from Nicotine itself, the carcinogens in cigarettes are related to Tobacco and it's additives. E-cigs are popular now because of this, though no long term studies have been done, and the \"fake smoke\" agent in them is carcinogenic at crazy high levels. Interesting topic, had not heard about any nicotine treaments for ADHD.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Southern US become so conservative?",
        "response": "It's hard to gauge what \"conservative\" means in this context, so I'm leaving the real meat of the question alone for a moment. I will say that the Puritans (as part of a broader religious category known as congregationalists) did not settle in the southern colonies in significant numbers. They were mainly concentrated in New England while colonies which later formed southern states tended to be dominated by Anglican denominations (and, in the case of Maryland, Catholicism) while later incorporating Methodist and Baptist influences. I'm probably simplifying a bit, so any experts on religious history should correct me if I'm wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if a civilian took the laws in their own hands (Catching criminals, helping the police etc.). Are there any legal restricitions against doing this, like Batman does?",
        "response": "There are two main legal restrictions. First, much of what the police do is illegal for a regular citizen. Police can detain people on reasonable suspicion, while more citizen's arrest laws usually require you to witness a crime. So a what would be to the police a routine stop, for you would be false imprisonment, or even kidnapping, and if you used force, assault. Second, police have what is called *qualified immunity* when performing their duties. That means if they make a mistake and something bad happens, they are not personally liable. Ordinary citizens do not. If you tried to effect a citizens arrest, and accidently injured a bystander, you could be financially responsible, even if the arrest was justified.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did an \"attractive\" person look like in your particular time period?",
        "response": "Fidel Castro was something of a sex symbol in Cuba during the early 1960s, that is until it was discovered he had skinny legs which is a major turnoff in Cuba.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When working out extremely vigorously (ie.Sprints, deadlifts) why after you're done with the workout do you sometimes throw up?",
        "response": "The primary cause for experiencing nausea and vomiting after a rapid and strenuous workout is dehydration. When you exercise, the effort used in the activity makes you sweat and lose both moisture and salts from your body. A lot of heat is generated within the body when you exercise. It is important to cool off for a few seconds between sets of exercises, or else the body loses vital nutrients as well as moisture. Heat exhaustion is the leading cause of dehydration.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Help identifying this Parish Seal from Germany?",
        "response": "Siglum parochiae borsumensis = sigil of the parish of Borsum. Borsum is a small village 10miles away from Hildesheim. If you need help translating the letter let me know. Part of my studies is learning to read/transcribe 18th century letters.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Vatican Latin actually Latin?",
        "response": "One must be careful; the Latin you might have learned in school is not the Latin your everyday Roman spoke. It was a poetic Latin hugely influenced by Cicero, whose rhetoric is seen as the peak of written Latin. Your everyday Latin to any time of the Roman empire was way \"easier\", less structured and complex in Syntax and vocabulary.  Vatican Latin is going a middle way. We call it Church Latin, a Latin, which shows strong influences of the classical Latin of Cicero, Caesar and co. but also influences of modern day Italian in the way it is spoken or vulgar Latin and written Latin of the middle ages and late antiquity. Church Latin is not the same as the classical Latin in the tradition of Cicero, but it has many similarities. Summarized one could say: It is not the Latin the Romans spoke, but shares many similarities with the Latin of Cicero taught in schools up to this very day.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My supermarket now only sells flouride free tooth paste. Are there any legitimate reasons to do this, or is it just mass paranoia?",
        "response": "A study that was in Nature found that fluoride in toothpaste was beneficial.  > The results showed that less wear was produced in the presence of the fluoride toothpaste than in the presence of the non-fluoride toothpaste with an otherwise identical formulation (P < 0.001), and that the amount of tooth wear in vitro was not significantly affected by differences in fluoride concentration and hardness of enamel. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the numbers in technology double?",
        "response": "it is the nature of binary mathmatics.  Computers use base 2 mathmatics. where we have 10 digits in each place 0-9 computers only have 2 digits they use 0 and 1. So with only the ones place, you have 2 possible outcomes 0 or 1.  When you add another digit you then have twice as many possibilities...just as we have 10 times the possibilities when we add the second integer to our base 10 system....so 00 01 10 and 11 are our possibilities.  Again adding another digit only doubles the possible combinations;  000 001 010 011 100 101 110 111 at 8 digits you have 2^8 =256 possibilites at 16 bits you have 2^16 =65536 which we round down to 64k",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the English alphabet A-Z? Who put the letters in that order?",
        "response": "I think uvw are together because u and v used to be the same letter. Like they just used v for the start of the word and u in the word. And so there were vv and uu letters used before w and some how the double-you became the the name of the letter even though it looks like double-vee and so they are a family and need to be together! Also I think Y is related to them but not sure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have Astrophysicists ruled out rogue planets as the source of \"unexplained mass\" in the Universe?",
        "response": "Could it contribute? Yes.  Is it a major factor? Unlikely.  A star like our sun accounts for 99% of the mass of our solar system. Jupiter accounts for the plurality (maybe majority, I don't remember the exact ratio) of what's leftover, with the other gas giants coming in distantly after.  Dark matter accounts for 90+% of *all* the matter in the universe, which means your need millions of times the number of stars as rogue planets, or tens of millions, or hundred of millions, depending on the mass of the planets - and our star is not close to the most massive.  As a note: dark matter doesn't contribute to expansion; dark energy does. Dark matter works against it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Beatles fans prefer the mono releases over the stereo releases?",
        "response": "If you listen to Revolver in stereo, you'll notice one side has the guitar, bass and drums, and the other aside has the vocals (and, in Taxman, the tambourine). Back in 1966, most people had mono systems. When you listen to the album in mono, the two separate tracks get stacked on top of one another, and you hear the vocals and instruments very clearly. This is how the album was intended to be heard, but with the advent of stereos the effect is lost. (I reference Revolver specifically because i finally understood all the mono/stereo hullabaloo when i heard that album in mono. Breathtaking, the difference)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does time actually change when going really fast?",
        "response": "> would the people on the ship only feel as if it was say, 15 years as opposed to 150? Yes, they would feel like only 15 years had past (or however long, depending on how fast they were traveling).  > Would the same people on that ship be alive upon arriving because their time was 'slower', and have only aged 15 years as opposed to people on earth aging 150? Yes.  > or is the whole time slows down thing more metaphorical in meaning? It's not metaphorical at all, though it certainly has philosophical implications.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- Why do cars have a button to switch off traction control..",
        "response": "Because there are certain situations like being stuck in the mud, snow, or sand where traction control hinders the process.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how much would a diamond deflect a bullet on direct hit?",
        "response": "Diamonds are hard, not tough. The diamond would shatter. You can break a diamond with a hammer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Legally, why is Justin Bieber able to get away with ridiculous things like drag racing while drunk and high without a public endangerment charge and serious jail time?",
        "response": "Realistically, cops and courts really only go after the DUI part. Being high - if you get taken in you get held until you're sober, you might get a court date. Underage drinking, same deal. First offense DUIs usually result on some fine or very small stint in jail, one thats not really served due to overcrowding. Other consequences against your license depends on the DMV of the state.  People have a perception that any of his charges result in huge jail sentences, they don't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Historians, what is your day job, and how has your history degree (if you have one) affected your career and/or life?",
        "response": "History is my full-time, day- and pretty frequently night-job as well. If you're curious what it's like to do research, I've been thinking of writing a long post for AskHistorians on the experience.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the grey and white checkered blank/transparent space in photos work?",
        "response": "It's not actually transparent, nor it is checkered, it just designates a specific color or color range in picture as transparent and displays it to you as checkered so you know it's transparent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Schrodinger's Cat. Why is it so fascinating?",
        "response": "This has been submitted pretty often in ELI5. [Here](_URL_0_)'s a pretty good thread on it, particularly:  > Some guys noticed small stuff works funny, because for example small stuff can teleport through other small stuff. > Schrödinger was like 'haha can you imagine if the whole world worked like that? We could have cats dead AND alive at the same time! That'd be ridiculous!' and ever since people have misunderstood and thought that he was saying the opposite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does cell phone technology have a far greater range than wifi technology?",
        "response": "Because its designed to.  The longer range you have to cover, the more interference you will get from other transmitters fighting over the frequency. Wifi units are specifically built using a low power transmitter, since 99% of the time you only need to reach 50ft or less. They also use the 2.4ghz frequency, which is a singularly awful frequency for sending signals a long distance because it likes to be absorbed by everything, further reducing propagation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why gasoline puddles are all rainbow-y",
        "response": "The gasoline forms a thin film on top of the water, which gives the puddle two surfaces, the surface on top of the gasoline and the surface on top of the water. Light reflects off both of these surfaces, and if the layer is exactly the right thickness, light can get trapped between the layers and bounce around a bit between the two surfaces before being reflected out again. This is an example of a [\"standing wave\"](_URL_0_). But the thickness that the layer has to be to create a standing wave is different for different colors of light. White light contains all different colors of light, though. Because the film is different thicknesses at different spots, different colors form standing waves at different spots depending on the thickness there. You see this effect on other thin films that aren't a uniform thickness too, like soap bubbles. edit: Standing waves in light are a special case of [interference](_URL_1_), which is a more comprehensive description of the phenomenon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can’t space vehicles use a principal like weather balloons to get beyond the atmosphere before firing rockets?",
        "response": "The fuel for the rocketry stage is heavier than is feasible to lift with balloons— using buoyant gases to lift it would be expensive and unwieldy to have enough lift. Plus, starting from a stable platform to launch from gives a better flight path.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that both atomic fusion and fission produce energy?",
        "response": "The key to understand is that it's not as simple as \"fusion produces energy\" and \"fission produces energy\". It depends on *what* is being fused, or *what* is being split. You can't just take the same elements and go \"fusion/fission/fusion/fission/etc\" and expect to get energy out of it! Take a look at [this graph.](_URL_0_) It charts the binding energy per nucleon that you alluded to in your post. Note that this graph peaks at Iron. If you combine element smaller than Iron (like hydrogen) you get energy from fusion. If you tried to fuse two heavy elements together, you would *lose* massive amounts of energy. Likewise, splitting uranium gets you energy (because its bigger than iron), but if you split helium into hydrogen, you'd lose energy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how did Mendeleiev create the periodic table, and how new elements, unknown to him, fit right in.",
        "response": "The table was developed in a time when new elements were being discovered very rapidly (about one per year). This was basically a new field of learning so scientists were learning newer and newer things about chemical elements. Mendeleev was one such scientist. In studying the elements, essentially, he discovered if you arrange them by atomic weight, then the elements have properties which repeat at different intervals. For example, Chlorine, Bromine, and Iodine all have similar properties, as do Krypton, Rhodium, and Cesium; and Calcium, Strontium, and Barium. And the differences between the weights here are roughly the same (\\~45). But, organizing the periodic table like this required him to put in gaps where there weren't elements that fit this pattern. We would later discover the elements that fit in here, for example Gallium and Germanium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does all my body fat go on my stomach?",
        "response": "It's called hormones. It starts distributing evenly until you reach a certain bf %. At that point, you produce more aromatase enzyme than normal, leaving you with elevated estrogen and lower testosterone. At this point, fat accumulates on your midsection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I don't really understand insurance. Explain?",
        "response": "It is a company that bets on bad things not happening to you. So health insurance, for example. A whole bunch of people pay money but the vast majority of them never get cancer so in general they companies take in way more money than they pay out. Same thing with car insurance. Most people never get in accidents and never make insurance claims so the money keeps piling up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Fermat's Last Theorem",
        "response": "So you know what Pythagoras' theorem is, I take it. If you've got a right angled triangle with sides of length a, b and hypotenuse c, then a^2 + b^2 = c^2. There are integer solutions to this equation, where a, b and c are all integers. Like 3, 4, 5, or 5, 12, 13. Fermat's last theorem says that integer solutions are impossible if you replace the exponents with any number higher than 2. So you can't have a solution to a^3 + b^3 = c^3. Put simply, you can add two perfect squares together and get another perfect square. You can't do this with cubes, or any other power higher than 2.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Bullet dropped vs. bullet fired...",
        "response": "While the effects of drag would be different slightly (a fired bullet facing horizontal, vs a dropped bullet facing downward), these are negligible at the speed the bullet is falling. The fired and dropped bullet will land at the same time. Horizontal velocity has no bearing on the vertical velocity. Both the horizontally fired bullet and the dropped one start at 0 m/s in the vertical direction and accelerate at 9.8 m/s^2 downward.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why some men don't have refractory period after ejaculation?",
        "response": "Not an expert - some males do not produce the hormone prolactin (perhaps from a mutation) and avoid most of the refractory period, essentially the repression of dopamine, and thus can experience continual arousal after ejaculation. The sex columnist [Dan Savage](_URL_0_) has a lot to say about this topic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What skill goes into abstract art that seem really easy to make such as splatter paintings?",
        "response": "This is a somewhat loaded question, but one cold logical explanation is that virtually every famous abstract artist has spent years and years working on non-abstract things that gives their work merit and respect. Beyond that, abstract art incorporates fundamentals of design, such as rhythm and color coordination, which are not constrained to photo-realism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a circle is the most efficient shape in terms of area to perimeter, what is least efficient? Is there a 3D equivalent?",
        "response": "There is no \"least\" efficient. Wrinkles make an object less efficient in terms of area and perimeter, a wrinkle takes away area but adds perimeter. There's no limit to how wrinkled something can get, so there isn't a least efficient, you can always find worse.  For instance, the [Koch Snowflake](_URL_0_) has infinite perimeter and (if you start with an area 1 triangle) has area 8/5. In 3 dimensions, the [Menger Sponge](_URL_1_) has infinite surface area and zero volume.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a black hole cause the creation of new heavier elements?",
        "response": "Yes it is a thing, though as far as I understand, still poorly known about. Look up black hole nucleosynthesis. It happens in the accretion disk of the black hole. The inward-falling matter, even before hitting the event horizon, is crushed to huge densities and enormously heated by friction and release of gravitational potential energy, as well as exposed to large fluxes of subatomic particles. This does trigger some amount of fusion. See [here](_URL_0_), for example. Black hole nucleosynthesis probably doesn't go beyond anything reached in supernovae detonations, though, because an absurdly massive neutron flux is necessary to create the heaviest elements, and I don't think there's a better place for a neutron flux than the surface of a neutron star being born.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can animals understand music?",
        "response": "It's hard to classify exactly what music is. Apparently birds and whales make calls based on the same patterns/rhythms that humans do, birds going as far as making pitch changes that we find attractive. This is animal to human music though.  If youreverse the system, it's hard to say since animals can detect frequencies outside our range. Few animals will care for melodic pitch change while the rhythms we use probably won't be noticed. I would think that if the music you make imitates the calls of other animals, then yes, it might be enjoyed. Otherwise it's outside their sphere of understanding and I would say it just sounds like all the other noise they hear.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we hate Richard Nixon.",
        "response": "He's not actually that hated. I would say that certain circles actually still hate politics of presidents like Reagan or Bush younger. Nixon is still, though, ridiculed in popular media like in Futurama. Reason for that are [these few lines.](_URL_0_) It's even funnier because he clearly was a crook: He gave orders to physically break into Democratic party head quarters and wiretap their discussions. This led to the Watergate scandal (office building where they brake into was called Watergate), which eventually forced him to resign as the president.  He didn't start the Vietnam war, but was president during it and started the withdrawal of American troops from Vietnam.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does China hold so much US debt? How does China artificially adjust the value of their currency?",
        "response": "China doesn't hold that much US debt. I think in all, they have something like 8-9% at most of all US debt, most of which is held in US treasury bonds.  China controls their currency by controlling the amount of their currency on the market, and they're intentionally devaluing it. This allows them to pay workers less, produce products cheaper, and thus have their products cheaper on the international market.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does ice melting raise the water level? Ice is less dense than water.",
        "response": "Ice is on the ground above the sea level. When it melts it runs downhill until it runs into the sea. Yes, when an iceberg melts the sea level does not rise. The sea level rose when the iceberg fell in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do pension funds get a deficit and how is this allowed to happen?",
        "response": "Don't forget that the managing parties can completely ignore life expectancy, return rate, and beneficiary vs. contributor ratios that change. This is the MASSIVE issue with Social Security and pensions. We assume a retirement age of 65 is still as reasonable as it was 100 years ago. Combined with a shrinking working population aka child per family rate, the pool of funds is draining faster than the work force can fill it. But suggest an increase in the retirement age or means testing and you can start packing your office to get ready for the next Congressman.  Source: am actuary",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Balance sheet vs. Income Statement vs. Cash Statement",
        "response": "Income Statement: has all the revenue (sales) and expenses (cost of operating the business) and ends at net income Balance Sheet: snapshot of your company's assets, liabilities, and owner's equity.  Cash Flow Statement: starts with your net income from the income statement and shows the flow of cash in your company - what is the cash that is being spent going toward and where incoming cash (not sales) comes from (i.e. Operating Activities, Investing Activities, Financing Activities). After adding in-flows and subtracting out-flows, you end with remaining cash that goes to your balance sheet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the rules that must be fullfilled to create competitive telecommunications market?",
        "response": "The buyer has to be free not to buy, the seller has to be free not to sell, information has to be symmetrical, and there has to be enough providers that groups of providers can't affect market price. Telecoms fail at nearly all of this. Modern society almost mandates a cell phone, so the buyer is *almost* compelled. Obtuse contracts mean that information about services provided is hidden behind pages and pages of legalese. There aren't enough providers to provide meaningful competition. Prices and services are heavily dependent on where you live, not to mention that for some people there is only one provider that gets reception at places like your home, your work, or your favorite hangout.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Astronauts and Submariners still fed \"real\" food instead of some kind of Nutrient paste/Liquid thats much easier to store?",
        "response": "Because psychological health is also something that is a major concern for long term events. Having nutrient paste or liquid diets is very very demoralizing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how did ancient civilizations know they were about to be declared war on?",
        "response": "An invasion by a foreign power in the Ancient/Classical World usually didn't come out of the blue: preparation for campaigns took a huge amount of planning, logistical enterprise and time. For example, the Second Persian invasion of Greece (480-79 BCE) took, according to Herodotus, a full 5 years for the Persians to prepare for. The amount of logistic build up that had to take place for a campaigning army to be gathered on a foe's borders for larger civilisations, and the close proximity of smaller states, (Think warring Greek city states no more than 100 miles from each other) precluded \"surprise\" attacks.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are electronics cooled in space?",
        "response": "Radiation. Everything emits thermal radiation, with the amount and frequency depending on the temperature of the object. If the heat emitted this way exceeds the heat generated internally and received from outside sources, then the object will cool down, which will reduce the amount of thermal radiation emitted, until an equillibrium is reached. The lack of cooling by heat conduction and convection, like we have here on Earth, does make cooling of satellites and other spacefaring objects more challenging. Especially since some scientific probes have instruments that need to be kept at wildly different temperatures. So you may have some part of the probe having to be kept very cool, while another part has to work at a much higher temperature. Managing heat on stuff in space is a complicated, but ultimately solvable, puzzle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you have to \"crack\" a glow stick to get it to light up?",
        "response": "The glow is produced by mixing two chemicals together. One of the chemicals is inside of a glass tube in order to keep them separate until you want to mix them. The cracking sound is you breaking the glass tube and allowing the reaction to happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a person with normal sight see a single photon of light emitted in a dark room? Assume the most visible wavelength. If not, how many would be needed to be detected?",
        "response": "Technically speaking, yes. However due to certain neural filters only allow the conscious brain to recognize light when at least 5-9 photons arrive in less than 100 milliseconds. If we did not have this filter there would be too much optical \"noise\" in darkness, so the filter is an important adaption, not a weakness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is happening to this plant?",
        "response": "In maize, \"crazy top\" sometimes occurs to a plant, where the flowers become leaves. It is caused by an infection. _URL_0_ BUT, Your plant's leaves look very uniform and pretty healthy looking. Could it be a different species from the other picture?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Pykrete have the physical properties that it does?",
        "response": "Composite materials are strong. Combining a brittle substance with a flexible one yields a strong material that can be much stronger than either material alone. Wood fibers add flexibility allowing the material to have some ability to bend and return to it's shape, like the rebar in concrete.  The combination of wood fiber and ice has a very low rate of thermal conductivity, so it doesn't melt as easily as just ice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did we estimate temperatures at Jupiter's core? What about temp inside a nuclear explosion fireball?",
        "response": "Temperatures for stars are easily determined - different elements produce very specific light signatures, and the signature changes very predictably as it is heated. These signatures are produced by the glow of the element itself, and by what wavelengths of light it absorbs at that temperature. So the color of a star tells us what it is made of and what temperature it is (at the surface). Estimating core temperatures is more complicated, and involves comparing the total thermal radiation at the surface, guessing changing composition of the planet with depth, etc. What we are really doing is quantifying how much total energy is within the object, then guessing at how concentrated that energy is. Temperature of nuclear reactions are far more accurate, if not simpler. Since we know exactly how much energy is produced by each type of reaction, on an atomic level, we simply apply that to the number of reactions expected to take place in a given time and volume. It's a bit more complex, but that's the crux of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can animals feign injury?",
        "response": "I don't know about attention from humans, but there are birds that pretend to be injured and limp away from their predators to lead them away from their nest. The term you are looking for is [distraction display](_URL_2_). [Here](_URL_1_) is a nice video demonstrating this behavior. Note the fluttering wing. Edit: as for the text post, you can condition animals to behave in all sorts of ways to get a reward. See, for example, Skinner's famous work on [superstition in pigeons](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Russia invade Europe after Napoleon's failed invasion of 1812?",
        "response": "Russia was one of the leaders of the Sixth Coalition (1812-1814) against Napoleon. Russian soldiers formed a large portion of the men who forced Napoleon out of Germany. In fact, Russian soldiers captured France's capital in the Battle of Paris in 1814.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a plant chimera only be something like a \"grapple,\" or could there be a tree which produces both grapes and apples?",
        "response": "It is quite common, as long as the plants are of compatible varieties and are closely enough related. Grafting plants together, especially root-stocks to shoot-stocks is a very common practice. Generally it is restricted to closely related plants in the same botanical families, and generally, within there, only amongst closely related genuses.  Certain varieties of apple, pears, and quince may be mutually intercompatible by grafting. I have heard of pear-quince grafting, but I am not sure how apple fits in. They are all in closely related genuses in the family Rosaceae. A surprising one that works really well is potato-tomato grafting. Potatoes and tomatoes are closely related to each other and will graft successfully, producing rather poor tomatoes and rather poor potatoes, but it is interesting. And as a fun fact, tobacco and tomato are both in the Nightshade family (Solanaceae) and are compatible by grafting. So \"Tomacco\" is actually a completely plausible botanically.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When watching a movie where the setting is a high populated area such as a city or park, are all the people in the background actors or actual people? [8]",
        "response": "Some film makers do shoot live on city streets. They hide their gear and/or shoot with longish lenses. A famous example of this is the scene in Midnight Cowboy where Dustin Hoffman has to improvise when a car almost hits he and John Voight. _URL_0_ Lost in Translation is supposed to have lots of shoots made on the fly and some of the chase work for The French Connection was shot on the streets illegally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that, when depicted, our fingers are the first to twitch when regaining consciousness?",
        "response": "That's just a Hollywood cliche. It has no real world tie-in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could sodium phenylsulfamate be used as an alternative to sugar?",
        "response": "Apparently it has been tested. The second hit on googling \"sodium phenylsulfamate\" is [Synthesis and taste properties of sodium monosubstituted phenylsulfamates](_URL_0_) tl;dr- it possesses only a sweet aftertaste. derivative compounds were almost all bitter, and none were only sweet. I know you were thinking that since we know the sweet receptor structure, and we have some things that bind weakly to it, why can't we just predict the perfect structure to make the perfect sugar substitute? In theory this should be possible, but our current theories just can't make these predictions yet, so all you can do is test everything and hope to get lucky.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are squareroot, cuberoot, powers, sine, cosine, tanh, erfc etc. complex functions computed on various platforms when all computers can really do is add/subtract/multiply/divide?",
        "response": "Calculus, for the most part. It turns out that you can represent the vast majority of things you need to calculate with what's called a *power series.* So you take a function and, through some algorithm, turn it into a power series. A power series is an infinite sum of some more easily solved function, where you just replace one of the variables with increasing numbers.  In pure mathematics, what this means is that if you add up an infinite number of terms, you'll arrive at the exact answer you're looking for. In practicality, you only add up the first few terms--which still gives you a good approximation of the answer. It's very easy to get the answer to such a small amount of error that the error is irrelevant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What percentage of the sun's power gets to Earth?",
        "response": "This is basically the answer to the question \"If a sphere is drawn around the sun with the radius of Earth's orbit, what fraction of the sphere is taken up by the Earth itself.\" To answer this you simply divide cross sectional area of the Earth by the surface area of this imaginary sphere, which is about 0.45 billionths.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people lose and maintain their weight easier than other people?",
        "response": "sure. to lose weight you have to be a caloric deficit. your friends are consuming less calories than they are expending, you are not. it's as simple as that. figure out your TDEE and then subtract 500 from that number. that's your daily caloric goal. you'll lose one pound per week at this rate. couple side factors to consider: they may be more active than you; activities, jobs, etc. they may have more muscle than you (the more muscle you have, the more calories you burn while sedentary).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Physics] as there are anti-matter equivalents of sub-atomic pieces, could there an anti-electromagnetic spectrum?",
        "response": "No. Unlike protons, neutrons, and electrons, photons are their own antiparticle, so \"antilight\" is the same thing as light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are subreddits like /r/RapingWomen and /r/cutefemalecorpses accepted and what kind of people go there?",
        "response": "1. Go there to see what kind of people they are.  2. If you don't like a small subreddit, probably don't advertise it on a very large, well-read subreddit. I bet you drew a few hundred people to both of those subreddits, just by putting them in your title.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes people \"light\" vs \"heavy\" sleepers?",
        "response": "Genetics, age, lifestyle (caffeine, alcohol, etc), sleep disorders can all affect how light or heavy of a sleeper someone is. Younger people generally sleep heavier. Some people are just naturally heavier or lighter sleepers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the difference between a kraken and a leviathan",
        "response": "A Kraken is a mythical monster that is basically a gigantic squid or octopus.  A Leviathan is a mythical monster that is most often described as an extremely fast sea serpent. It is also mentioned in the bible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we predict the weather perfectly for the next day?",
        "response": "The weather is dependent upon thousands of variables, of which we can only accurately measure a dozen or so. We can do a good-ish job of predicting the weather tomorrow, because those dozen variables we CAN know are a major influence over that short time frame. However, over longer times frames those tiny variables that we can't keep track of start to play a bigger and bigger role until we are relegated to basically guessing at the weather a month from now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What planets have we developed surface maps of?",
        "response": "We have maps of Mercury, Venus, Earth and Mars. One Orbiter has mapped Mercury. I'm unsure of Venus, but one orbiter mapped the surface with radar. The earth of course. And Mars has been extensively mapped. The other planets are gas giants so they don't have a surface to map. The moon while not a planet has been mapped with great detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Do Hand Warmers Work?",
        "response": "I'll try again.   Pure powdered iron when it is oxidized or \"rusts\" releases heat. Yup, rusting releases heat it's just we never notice because it's the surface area of things like a car bumper are relatively small and the rust occurs slowly over time.   Hand warmers are physically small but since the iron is very finely powdered the total surface area of all that iron dust is huge. So you have a lot of the \"rusting\" or oxidation of iron occurring and that releases heat which is noticeable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the possibility of Puerto Rico becoming the 51st state of the US?",
        "response": "It's highly unlikely. Congress would need to approve it, and the Republicans would never support the addition of a state whose electoral votes would almost certainly go to the democrats in every presidential election. Then there's time money issue. If admitted to the US, Puerto Rico would be the poorest state in the us. Not a lot of US politicians want to take that on. Also, just over half of Puerto Ricans approved of statehood in a 2012 vote. If the us approved statehood, you'd have quite a few Puerto Ricans actively working against it. It might happen someday, but not anytime soon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that long, straight, flat sections of paved roads can act like mirrors?",
        "response": "When the ground is much hotter than the air, it creates a layer of very warm air just above the ground. The difference in density causes light passing from the cool air through the warm air to bend aka refract. Similar to how a pencil looks broken and larger when you put part of it in a cup of water. Same concept but with hot air and cold air instead of air and water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cars make a ticking sound for a few minutes after turned off?",
        "response": "It's contraction of the various metal bits that were heated by combustion, and are now cooling. Sometimes that contraction causes an individual piece of the car to exist in either tension or compression, which is only alleviated when the force gets to great and something slips marginally. That slip produces the popping sound you hear. You'll notice the same kind of pops if you have an oven range with resistive heating elements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The gap between 0-4 oz is different from the 4-8 oz of the label of the bottle.",
        "response": "It looks like a mistake in labelling to me, but you can simply check if it is correct: 4 fl oz of water have a mass of 118.3 grams. Put the bottle on a kitchen scale and tare. Then fill the bottle to the 4 oz marking and put it on the scale. If it reads ~118g the labelling is correct. Repeat for 8 ounces, and check if the scale reads ~236 grams.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I understood that Hitler was against Modern art, is there truth to that and if so did the Nazi's destroy works of art because they were Modern?",
        "response": "I think and I know Goering did, many people collected art, exspecially modern one. Many paintings are lost, some were discovered, again. Last year was a big case, where art was discovered. A man lived with many paintings in his home (his dad was a collector in ww2) and he sold from time to time a painting for living, on the black market. Knowing about him an Goering makes me believe, that the Nazis didn't destroy that much. They sold it and many big people stole it. It's more complex, but I am not native english and have to do more research about it, too. I believe many paintings are still in private households and maybe the owner don't know about it or, if they know they will keep it or try to sell it illegal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the relationship between Theodore Roosevelt and his distant cousin Franklin D. Roosevelt like?",
        "response": "PBS just released [\"The Roosevelts: An Intimate History\"](_URL_0_) a seven part series by Ken Burns. It covers the personal and political lives of Theodore, Franklin and Eleanor Roosevelt. There is a lot of information in the series detailing the complicated relationship between Teddy and Franklin Roosevelt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some of the most stunning scientific advances seem to disappear into obscurity?",
        "response": "The reason is that science reporting in the mainstream media is notoriously sensational. Some scientist comes up with some novel way to diffract light or something. The reporter obviously doesn't give a shit about math or optics. So they ask some question like, *could this, theoretically, be used to hide things?* and the scientist rolls his eyes and is like, *sure, maybe, some day*, and the reporter is like, *super, scientist invents cloak of invisibility! that's something I can lead with!*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't Sweden's garbage system work in the U.S.?",
        "response": "It's difficult to answer this without sounding condescending. Basically there is a tradition or expectation in the US that if something can't be done for a profit it's not worth doing. There is very little political will to push for \"the greater good\" especially with services that are left to the states, counties, or cities. The American public is still very anti-socialist even to their own detriment. Even something as simple as streamlining garbage collection is basically impossible to do if your proposal has to do with spending tax dollars on it. Note: I'm not advocating either way, however there are some very silly traditions in the US that have very little logical basis in 2015.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so hard for manufacturers to switch to USB type C, despite all of its benefits over type A/B?",
        "response": "They have stockpiles of A/B and years old designs. Keep in mind your brand new shiny phone coming out this year was first designed probably 1+ years ago.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I see hundreds of birds a day, how come i rarely see a dead one?",
        "response": "The same reason you don't see dead humans. Dead animals tend to get disposed of pretty quickly, in one way or another.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come the number of a Xbit processors is not increasing as fast as the number of a Xbit memory?",
        "response": "The number of bits in the processor doesn't need to be as large as the size of memory. If you want to store/do twice as many things then you need to double the amount of memory, but you only need to increase the bus width/address size (\"the number of bits in the processor\") by one bit. Going from 32 bit to 64 bit increases your number of possibilities by a factor of about 4 billion. That would be like going from 1 KB to 4 TB of memory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is clean coal?",
        "response": "The term \"clean coal\" is a myth brought about by the coal industry's public relations team and really the correct term is coal pollution mitigation. There is no such thing as clean coal. Coal is the dirtiest of the energy production fuels and there is no way to really use coal in a clean fashion, but there are ways to mitigate the pollution. However, all methods essentially swap one pollutant for another pollutant so the trade off is marginal. There are a number of different methods, but none of them have proven to either be successful for large scale use or they are just so expensive that they are economically unfeasible.  Do date, no \"clean coal\" energy source is in use. Clean coal is an oxymoron that is purely sold to the public for political purposes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it even important for some people that the moon landings were \"faked?\" How is the idea relevant and meaningful to anyone alive today?",
        "response": "> How is the idea relevant and meaningful to anyone alive today? It's about whether or not we can trust what the government says. Getting to the moon was/is a pretty big deal. If they lied about this, what else are they lying about? Global warming? 9/11? Roswell and aliens? (and so on). Is the president's state of the union also a lie? Similarly, how did they fake the whole thing; the launches, the pictures, the movies, the space rocks, the news coverage, etc. TL;DR - it's about whether was can trust what the government tells us.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can fabric be \"waterproof\" but let the air get through ?",
        "response": "Probably is \"Water Resistant\", but not \"Waterproof\". Water has something called Surface tension. This explains why drops and droplets are formed. Also explains why water seems to form a kind of jello when dropped on a table, put a few drops on the table and check it. Waterproof means that something is completely impenetrable by water, usually they use plastics in this kind of clothing. Water Resistant means that it can resist water under certain conditions: Usually they means some small splashes and a bit of water. What's happening under the microscope is that air gets through the fibers because it does not have surface tension but water does not go into the spacing between the fibers: The surface tension \"holds\" the water in a bubble and only with enough force (fast jet of water or a lot of water) it goes through the fabric. Water Resistance is archieved by having small spacing between the fibers or by using an hydrophobic coating / colouring. (hydrophobic means that's a water repelent)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was horse theft considered an offense punishable by death?",
        "response": "there is an old joke about this. usually some young lawyer sees a judge that often commutes the sentences of murderers, but never horse thieves. when asked about it, the judge responds \"some men need killing, but there are no horses that need stealing\".  In practical terms though, two major points. Horses are very easy to steal, being inherently mobile, so strong punishments were enacted as a deterrent. Second, losing your horse was much worse than losing a car the horse and its saddle and gear were an immensely valuable piece of property, more like a house than a car, and often a source of livelihood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In many fantasy stories, female warriors wear \"boob plates,\" or armor that is shaped around their breasts. In real life, what did female warriors in medieval times wear while fighting?",
        "response": "I can't think of any medieval female warriors. Who might be an example?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do physiologists differentiate between mental disorders and personality?",
        "response": "Psychiatrist and/or psychologist? There is a [manual](_URL_0_) for it with the various criteria. One of the general criteria for personality disorders would be that it \"lead to clinically significant distress or impairment in important areas of functioning,\" which is really the main difference between an odd personality and a personality disorder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can we insert DNA into the mitochondrial chromosome like we do with bacteria?",
        "response": "Yes.  There are targeting sequences that you can use (a sequence of DNA included in the gene construct) that will mark the gene for insertion into the mtDNA. [example of use](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do pharmaceutical commercials always tell viewers to see their ad in a magazine? Do people seriously buy a magazine just to look at an advertisement?",
        "response": "It's because they can't always fit all of the legally required fine print into the commercial -- side effects, warnings, etc. Take a look at a pharmaceutical ad in a magazine sometime, and you'll find that it's probably two pages, back-to-back: Pretty drug ad on the front, and page o' text fine print on the back. And this is called \"covering your ass.\" The advertisers don't expect people to run out and find the magazine ad, but once they've told them too, they can say, \"Well, we warned you...\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is Net Neutrality, and why is it such a big deal?",
        "response": "Net Neutrality is the idea that the Internet Services Providers are not gatekeepers. If you sign up for Internet, you get the whole Internet.  Part of what makes the Internet incredible is the fact that it exposes you to so much content from all over the world. For the first time, we have a medium where people can directly exchange information without going through some sort of gatekeeper. We aren't limited to the news that the New York Times thinks is important enough to fit in a newspaper. And anyone who wants to create a business on the Internet has just as much a chance of succeeding as anyone else. Things that are against Net Neutrality would be Comcast deciding to block their customers from accessing Netflix because it competes with their own On Demand offerings. Or charging you extra to access shopping sites that aren't Amazon, because now no new shopping site can really be successful- they'd start off without anyone having access to their business.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I blow into a straw that's in hot tea, does the tea cool down?",
        "response": "Yes, but I think it would be less effective than blowing on top. When you blow on the top of the liquid, you're removing a small layer of evaporated liquid. Evaporation carries away a bit of heat from the liquid, and you're blowing that away, leaving the remaining liquid to be cooler. Or in simpler terms: the fastest molecules can break free of the liquid to swarm in a gaseous state above. You can then blow away the fastest molecules, leaving the slightly slower molecules behind, and the overall temperature of the liquid drops slightly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to urban planning after the fall of Rome?",
        "response": "Urban planning student here: Urban planning, as it currently exists, is an invention of the 19th century. It was a reaction against industrial cities, largely by public health boards. tl;dr: No perceived cities to plan; no urban planning. p.s. There are many ancient cities that were laid out in a grid including Harappa, Pakistan. Contemporary North and South American cities' cores are usually grids laid out by military engineers and surveyors. Notable exceptions include Boston.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't Mercury a Dwarf Planet?",
        "response": "Dwarf planets don't have to be small, scientists have [redefined what it means to be a planet](_URL_0_) (and a dwarf planet) to help identify exo-planets. Mercury sits well in the boundaries of being a planet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If genetic mutations are random, how come things like \"autism\" and other mutations, occur more frequently? Our DNA has so many ACTG's, I thought mutations were randomly dispersed amongst them... Not clustered/more probable for certain regions.",
        "response": "From purely an information theory point of view, there is no reason to expect a one-to-one correspondence between DNA mutations and detectable traits. Some biological processes have a large number of base pairs that all have to go right to succeed. In other cases there are multiple copies of the same gene, and you are going to have to mess up a bunch of them for the results of the mutation be evident.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are air conditioner temperature settings so inaccurate?",
        "response": "You might have one of those thermostats that operates with a metal coil. The metal contracts/expands depending on temperature, triggering the AC to cool or heat the room. Now, if the coil has been over extended repeatedly the tension in the coil gets weird and it starts to contract/expand differently than what it was originally calibrated to, making the AC act inconsistently. Check to see if there is a heat source close to the thermostat that can affect it. Sometimes people place a lamp or something too close to it. For cars, I have no idea.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's up with names in the Middle Ages?",
        "response": "Fixed surnames passed from father to son only became the norm in western Europe in the 14th century. Earlier aristocrats very commonly distinguished themselves based on their place of birth. Giles de Argentan was, unsurprisingly, from a place called Argentan. They also used bynames, based on a salient personal characteristic: Robert Guiscard (smart ass), William Rufus (the red), etc. In the case of Hugh Capet, Capet is just a byname of uncertain meaning that distinguished him from his father, Hugh the Great. The habit of calling all the subsequent kings of his dynasty Capetians is a modernism - they are the descendants of Hugh Capet, not people who would have answered to the name of Capet. Nor would Richard I have thought himself a Plantagenet - Plantagenet and Angevin are both terms used to retroactively describe the line of kings descended from Geoffrey, Count of Anjou.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Google Fiber significantly increase download speed?",
        "response": "Google owns the backbone infrastructure for their fibre network. Generally broadband connections slow down at a much more local network, and in improving the connectivity at this level they improve end user speed. Imagine a water pipe that has to supply a whole neighbourhood, and everyone trying to use that. Google effectively hugely increased the size of the water pipe to that area. Further up the chain, the pipes have been big for a while now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I rotate a cup of tea, does the water rotate with it or stays like it was?",
        "response": "The water will be pulled along by the side of the cup, spinning it and creating a vortex in the liquid. It will not spin all at once like a solid object would; the outside will spin first, and spinning will slowly propagate inward. It is also not likely that it will 'line up' with the cup in the same way when you stop spinning it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it suddenly feel like our hearts drop everytime we see or do something startling like a teacher calling us over to their desk?",
        "response": "The release of adrenaline (more accurately called Epinephrine) is a hormone released by your adrenal glands, preparing you for a fight or flight scenario.  The release of adrenaline speeds up the beating of our hearts and it's that fluttering sensation that makes it feel like our 'heart is dropping', when something scary or nerve racking is happening.  EDIT: Grammar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sometimes my eyes are tired, but my body isn't and vice versa. What's the deal?",
        "response": "Your eyes have muscles connected to them, and those muscles can become tired and/or sore if overworked for very long. I used to experience the tired eyes feeling quite a lot when driving at dusk, before I got polarized glasses . I'd feel like I just wanted to crawl into bed soon as I got home. But once I got home I'd find I was wide awake.  Even now, with good glasses (with anti-glare coating) focusing on a fixed distance (e.g. staring at a monitor) too long, or looking through glasses that are smudged (such that part of your view is out of focus) for more than a few minutes makes me want to just close my eyes for a while.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When the atomic bomb was dropped on Hiroshima, why did mechanical watches stop at the moment in time in which the bomb detonated?",
        "response": "Probably because the pressure and heat from the bomb damaged the mechanical pieces. Clocks and watches have parts with very tight tolerances, they can be easily damaged just by dropping them (this is especially true of older watches), so it's not hard to imagine that a nuclear weapon could inflict similar damage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Over time, do the wavefunctions of the electrons in our human bodies oscillate (not particle spin, but the actual wavefunction) like standing waves?",
        "response": "The time evolution of the wavefunction for a particle in an energy eigenstate is just a trivial phase exp[-iEt/~~h~~]. This is a complex number with modulus 1, and a phase which advances linearly in time. The probability density function in coordinate space is equal to the modulus squared of the wavefunction, so the time-dependent part just cancels with its complex conjugate. In other words, the probability density function ends up not being time-dependent for particles with definite energies (at least in the ground state, in an excited state it will have decaying time dependence due to couplings with external fields).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could I outrun a tornado in my car?",
        "response": "I think the more important question is: could I outrun a car in my tornado?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come some holidays are based on a certain date while others are based on a certain day of the month?",
        "response": "Back in the 1970's the US government decided to move some holidays to Mondays so that people could have a 3 day weekend and get more rest and enjoyment from them. Certain ones were not moved, religious ones such as Christmas and Passover since those were not the purview of the government or ones whose significance owed to the date, 11/11 for instance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can one trust the modern scientific/medical consensus when past consensus among medical professionals included lobotomies and labeling homosexuality a medical disorder?",
        "response": "As imperfect as it is, science is the best tool we have for separating trust from fiction. There isn't really an alternative that doesn't amount to wishful thinking. Also, both of your examples represent *advancements* in science. Homosexuality was considered to be just a form of depravity...labelling it as a mental illness was the first step in realizing that it wasn't just a behavioral choice.  And people once thought what we now understand to be mental illnesses to be evil spirits, demons, imbalanced humors, and other such sources. Realizing they emerged from the brain's biology represented an improvement in our understanding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cats react when they're scared by arcing their back and having their hair stand up?",
        "response": "It makes them look bigger. Its their main way of saying \"Yo, I'm ****ing big and I'll kill you if you mess with me.\" Its a fairly common behavior in general. Even humans will do it. We try to look bigger than we are to intimidate our enemy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do you call the small broken up islands that surround northern land masses like Greenland?",
        "response": "I believe the word you are looking for is \"archipelago\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If affected by caffeine differently, are there other ways to stay awake without caffeine?",
        "response": "If it isn't already in your (or the doctor's) plan - I highly recommend asking to have your thyroid hormone levels checked. Underactive thyroids can cause so many random symptoms to appear and be different from one person to the next. Caffeine is often recommended to be reduced or eliminated if the thyroid is abnormal.  You obviously have adverse reactions to caffeine, so definitely it's something that your body doesn't process well. Vitamin B and vitamin D supplements can be helpful, as well as a balanced diet: carbs + protein + moderate fats.  Also look into aromatherapy. Certain essential oils diffused nearby can help keep you alert but calm at the same time. Might ease the migraines too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the air get cooler when something like a fan blows the air faster?",
        "response": "It doesn't change temperature, it just passes air over your skin more quickly so it can remove body heat faster.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the amount of energy a creature requires contribute to the length of it's life?",
        "response": "There are many things that can contribute to life spans, lifestyle, metabolism requirements, genetics. Telomeres are one genetic control on life span, and is specifically why [lobsters can live for such a long time](_URL_2_). In some cases, it may be a [single gene](_URL_1_). If you're interested in a thorough read, it's a book from 2003, so it might be a tad outdated, but [Mattson](_URL_0_) has a volume on the topic. Energy can play a role, but it's not a clear linear relationship. Coral colonies have been found to be 4000+ years old, sponges can live a long time, koi fish can live 200 years, which obviously don't need as much energy as a whale. The short answer is, it's complex and a lot of interplay between factors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could you (and how would it work) gain energy from eating pure ATP?",
        "response": "It would be possible, if your digestive tract could directly absorb ATP. (I can't say whether it does or doesn't) But I think it more likely the ATP would end up being hydrolyzed by the high acidity of your stomach before that could happen. Even if you could eat it, it wouldn't be very efficient. Sugar and fat contain much more energy by weight. A glucose molecule produces 38 ATP molecules, so it has 38/(507/180) = 13.6 times as much energy by weight. Fat even more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How/When/Why did the Byzantines change it's language to Greek?",
        "response": "Greek was prevalent in the eastern part of Roman Empire even in the times of Augustus. Latin was used as the official language in the military until the reign of Heraclius (610-641 AD) when it was replaced with Greek. Latin was used among native population even after that in North Africa until it was taken by Arabs in 699 AD, and of course in Italy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some swear words considered worse than others?",
        "response": "Your basic question is: why do words mean different things? They have different histories, have different basic meanings, and are used in different ways--so it makes sense that they would be interpreted differently.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Physics] When boiling water on stove, why does water make a noise that gradually increase until right before boiling point?",
        "response": "I know exactly what you're talking about, OP. The noise is caused by tiny air bubbles forming at the bottom of the kettle and then collapsing as soon as they leave the hot bottom surface. Once the entire volume reaches the boiling temperature the bubbles stop collapsing and instead reach the water surface, so the noise stops. You can hear this better in a metallic tea kettle because it's enclosed and acts as a resonator, amplifying the sound.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do gyms have mirrors facing the equipment?",
        "response": "So you can see yourself working out and make sure you have proper form. Secondly, mirrors give the illusion of space, making the gym appear larger and more appealing.  Also, some gym-goers are the vain kind of people who would like watching themselves work out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did groups of Deserters in the First World War really organize and take up on old Battlefields?",
        "response": "As is always the case, there is always more to be said on the topic but here is an answer I provided to a similar question: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the age of the universe is equal to the inverse of the Hubble Constant, wouldn't this make the age a constant too?",
        "response": "Frist of all the Hubble constant is not a real constant as it varies over time. Often the term Hubble parameter is used for arbitrary times and Hubble constant is the Hubble parameter now. Concerning the age of the universe: The inverse of the Hubble paramerer = age of universe just works pretty well, because of the energy content of our universe. For example a universe with the same hubble parameter and 100 times the matter content would be significantly younger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why a huge country such as the US has relatively little variation in dialect.",
        "response": "Dialects in the US have only had about 300 years to diverge from a common source: the dialects spoken in the early colonies on the East Coast. In the UK, dialects have been diverging for like a thousand years, so there's been much more time for variations to happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the Big Bang Theory",
        "response": "The universe is of finite age, and the objects in the universe were once much closer than they are today. As a consequence, the early universe was exceptionally hot and dense, resulting in states of matter and particles not observed in everyday situations today. The most direct evidence for the Big Bang is the existence of the [cosmic microwave background](_URL_0_) - a dim radio glow across the entire sky that is almost completely uniform. This is the \"light\" (now shifted far outside the visible range) of the last time space was in the proper state to be opaque. The existence of this background was a prediction of the theory long before it was observed, and agrees to fantastic precision with the theoretical predictions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Subatomic particle radii",
        "response": "Defining a radius for non-fundamental particles is somewhat fuzzy, but it's usually based on a metric such as the average (mean square) radius of the charge probability distribution. For example, in a proton one obtains a radius of 0.8fm using this method and while the charge density does extend past this value, it decreases roughly exponentially.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can I tell if an object is accelerating?",
        "response": "First of all, I am not really sure what you are asking. Your question appears like you have something quite specific in mind, but I can't tell what that is from your description. Could you try to be more precise? One precise thing you asked, which can be answered is:  > > but I'm talking about when you don't know if the velocity is changing. Maybe the observer's velocity is changing  The observer can do tests to assure that the she is in an inertial frame. If the observer concludes that her frame is indeed inertial, then she can use a measurement of a change of relative velocity to some object to conclude it is accelerating. However beware, if the acceleration is due to gravity, such as being in orbit or freefall, things are a little different and beyond the scope of this answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does \"daddy issues\" mean?",
        "response": "It means that because daddy was emotionally distant or absent entirely, etc., the girl will crave approval from the current man in their life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "out of everyone who uses reddit, how is every post so averaged out in upvotes and downvotes that its rare to see anything above 4000. How come there aren't more landslide upvoted posts?",
        "response": "Reddit fakes it. If you read the FAQ, it says that it artificially adds downvotes to discourage spammers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "It's often lamented that the great majority of ancient Greek and Latin literature is lost, but how much did survive?",
        "response": "You might be interested in a previous thread:  * \"[What percentage of classical works are 'lost'? Can we estimate this with math?](_URL_0_)\" 12 comments, over 2 months old. * One user talks about surviving 5th Century BCE Athenian plays and other evidence to estimate what has been lost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when the body receives an electric shock? Is it an electrolysis reaction?",
        "response": "The electricity flows through the most conductive material. Fat is not conductive, it is more of an insulator. Interstitial fluid is more conductive as it is salt water. The most conductive material is the nervous system and veins.  The passing of electric current is always done more like the game telephone than passing a note. One electron is given to an atom and then it passes another on the next atom. It isn't the same electron.  Yes, the heart is effected. But it is surprisingly robust. That is why using paddles takes so much current. A small shock usually will not harm the heart or interrupt it's processes. Please stay away from outlets and power lines.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Last week, I ran out of shampoo and washed my hair with a bar of soap for a few days. Remarkably, I survived the experience. Can anyone tell me about the point in time at which we started to use \"shampoo\" instead of just soaping-up our hair?",
        "response": "Another interesting question is: When did we begin using foreign products to clean our hair? I had a similar situation to yours but decided to forgo shampooing. Years later here I am and have not used any shampoo since. Hair does a very good job of cleaning itself so I would figure that shampoo products were fairly modern, or if not, would be more used in a society that heavily styled it's hair with other products.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are photons emitted with a direction?",
        "response": "Welcome to the Mott Problem: _URL_0_  It's pretty much exactly what you're asking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A Florida circuit court told Lawmakers they had until today to redefine the law to allow smoking of Marijuana for medical purposes. What happens if they don't comply?",
        "response": "In this case the issue is that the lawmakers had passed a law which contradicted a previously adopted voter initiative, something the court ruled it could not do. They were given a period of time to redefine the law to comply with the voter initiative and if they do not comply the law will be struck down in its entirety.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If supernovas are massive enough to become black holes, why do the stars themselves not become black holes prior to going nova?",
        "response": "Something along the lines of the force of nuclear fusion trying to pull the star a part is counter balanced by the force of gravity attempting to crush it to a point. Once the star runs out of fusible material the force of gravity is no longer balanced and the star collapses into a black hole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Puffy vests. If it's cold enough to need a warm torso why don't you also need warm arms?",
        "response": "As long as you keep your body core warm the circulating blood will keep your extremities warm. So you don't actually need the sleeves in most cases, they just make you more comfortable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Might some irrational numbers be a terminating decimal in another base?",
        "response": "You can prove rather easily that a real number *x* is rational if and only if there exists an integer base in which *x* has a repeating expansion (which includes terminating expansions). You can then prove that if *x* has a repeating expansion in *some* integer base, it has a repeating expansion in *all* integer bases. Hence *x* is irrational if and only if there does *not* exist any integer base in which *x* has a repeating expansion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "As a college student and beginning programmer, how do people write code for a 3d environment?",
        "response": "Could you please further elaborate what you mean by 3D environment? I can't really imagine what you mean by that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when Earth's magnetic poles are reversed? And what causes this?",
        "response": "Other than what direction the compass points, nothing major happens. Our magnetic poles have been shifting constantly and gradually for all of history (magnetic North pole moves 10-40 miles every year), and a sudden reversal of poles would never happen. They change because of the shifting magnetic properties of the metals inside of the Earth, and by tectonic activity such as volcano eruptions placing more magnetic material in one area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Writing a historiography paper on the North African campaign of World War II, where should I start?",
        "response": "*War Without Hate: The Desert Campaign of 1940-43* by John Bierman and Colin Smith is an excellent book and has plenty of sources.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is 100 dollars worth less than 100 dollars in some states and more than 100 dollars in others?",
        "response": "The cost of living varies from area to area. Things like population density, demographics, available jobs, state/local taxes, distance from shipping routes, etc. all affect how much things cost. For example, many fruits and vegetables are cheaper in the midwest and southwest than they are in, say, New England because they are grown there and its easier and less expensive to get them to stores. Similary, $2000/mo could get you a big house with land in many parts of the country, but would only get you a 500 square foot studio apartment in New York or San Francisco.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for the earth to have a 'super rain cloud' for example, the size of the United States?",
        "response": "I once ran across a chart showing monsoon size vs. the ability of the atmosphere to contain water. Such a chart would provide the maximum possible precipitation from a storm event. Many major monsoons contained the maximum amount of water vapor based on their size. There was no theoretical limit to the size of a monsoon (area/volume) in that chart though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did cable and internet providers in the US become monopolies?",
        "response": "You're asking two separate questions: 1) Cable companies are referred to as natural monopolies. Because you don't want five companies trenching lines in one neighborhood when competing with one another, like power and phone companies, only one is given access to lay line in a certain area. 2) The FCC was significantly deregulated beginning during the Reagan Administration. Previously, there were restrictions placed upon media consolidation and how many entities a given individual/corporation could own in a specific market. The idea was to prevent a monopolization of the media by concentrated interests. Over the last 30 years, this idea has been tossed out in favor of removing almost all restrictions from media ownership, which allow conglomerates to gobble up more and more stations, to the point where a select few companies now control virtually all forms of media and technological access (telecom, internet) in this country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some seniors have a hard time learning basic computer skills even though it seems very intuitive to most people?",
        "response": "Take a field you're inexperienced in. Let's say baseball.  A professional baseball player says, \"Swing the bat like this.\" And he shows you how. So you do the same. But then you mess up on the next swing. You forgot all his talking points/mechanical error/missed something he said.  So in the end you couldn't swing the bat very well.  Then you ask, \"Why swing the bat in the first place? I don't even like baseball.\" So you put the bat down. This is what it is like for seniors. It doesn't matter as much to them, and they didn't grow up into computers and iPhones and such.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does [m]y pee break into two streams sometimes?",
        "response": "Semen has dried at the tip of your penis and is partially holding exit point shut... probably.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Calculus Derivatives",
        "response": "Derivatives are rates of change. Everything else about them is real calculus and beyond the bounds of this forum, though definitely interesting and worth your time. Good luck.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does this kind of \"investment\" works?",
        "response": "That's not an investment, it's a loan. Some people literally live paycheque-to-paycheque and cannot don't have $1000 to spend if an emergency pops up. For example, after rent, utilities, groceries, internet, phone bills, gas, etc. a single person might only have a few hundred dollars to spend every two weeks. Let's say their car breaks down and they need $1000 immediately to get it fixed to be able to get to/from work. They don't have $1000 lying around, so they take out a $1000 loan. Yes, they know they'll end up paying more than $1000 back, but given their financial situation it is easier for them to pay maybe $200 weekly for 6 weeks than paying $1000 in one shot. There will always be people who need quick cash and there will always be people willing to profit off them by charging interest. EDIT: Just realized you wrote $200 weekly payments for 5 weeks... that's still $1000 so no net gain. Typo?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Germany have such a huge share of scientific discoveries and Nobel prizes in the late 1800s/early 1900's?",
        "response": "hi! you may be interested in some previous related posts * [Prior to WWII, why were German scientists so good at what they did?](_URL_0_) * [What made post-unification Germany such a scientific and industrial juggernaut?](_URL_3_) * [How did Germany overtake Britain in industrial output by the early 20th century, despite the former's lead and straightforward advantages?](_URL_5_) * [Why did Nazi Germany produce such valuable rocket scientists compared to other nations? Is this a misconception?](_URL_2_) * [What led to the German scientific powerhouse of the 20th Century?](_URL_4_) * [Is there a reason for why so many renowned scientists/inventors were German, historically?](_URL_1_) * [Why was it that Germany produced so many scientific innovators around the turn of the 20th century?](_URL_6_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is blood flow directed within the brain?",
        "response": "*Metabolic autoregulation* whereby regions of greater metabolic activity cause increased local production of mediators such as C02, lactate, H, K, ADP which cause dilatation of local blood vessels and increased local blood flow. The cerebral circulation also is maintained across a broad range of blood pressures by its mechanism of *myogenic autoregulation*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is sipping water better than gulping it when ill?",
        "response": "When someone is ill, and nauseated, drinking fluids too quickly can trigger vomiting. Sipping fluid can allow them to consume more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was different in older camera sensors that caused way more light trails?",
        "response": "In ye olden times, cameras used detector tubes which charged up when light hit them, and this charge takes time to dissipate. If there's a particularly bright light, the charge caused by the light's image won't have dissipated by the time the next frame is ready to be captured. Then the CCD was invented, which doesn't suffer from this problem. Some cheap ones do exhibit horizontal or vertical lines under bright lights, though, due to the way the pixels are read (the charge is shunted along a row/column to be read at the end). I don't know the details, but that's the gist of it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "According to metric expansion, is there \"new\" space being created between galaxies?",
        "response": "Space isn't really a \"thing\" that is being stretched. All that is happening is the distance between points is getting bigger. Space is also not divided into a number of planck-length \"pixels\". The planck length is important, and you do get some interesting physics happening below that length scale, but it is not actually an indivisible unit of space, except in some not very widely accepted theories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If getting to Mars is so important, why aren't projects crowd funded in some way?",
        "response": "Taxes are basically non-voluntary crowd funding social projects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Our cell phones update our pictures and contacts to the cloud, why can't a planes black box do the same?",
        "response": "Because it lost contact. The point of the black box is to store information *after* the plane loses contact. All of the pertinent information prior to losing contact is already transmitted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Difference between MZ and DZ twins?",
        "response": "You've either misunderstood your science teacher, or he is wrong, as evidenced by the fact that every paper you've found contradicts his statement.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any evidence that playing a frequency similar to that which our brains interpret would cause it to temporarily change?",
        "response": "Are you asking whether human bodies have some kind of resonant frequency in the way that, for example, a wine glass does? I don't really understand your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does my browser translate the website URL into the website IP?",
        "response": "Q: \"Is there a big database somewhere?\" A: Yes there is a big database somewhere. There are many. The Webbrowser does not act alone in translating URL to IP. The process is involves also the underlying OS. The browser first sends the request to the OS. The OS checks its local store (eg: C:\\windows\\system32\\drivers\\etc\\hosts) and then sends the request to a remote DNS server (database). The DNS server may be at your ISP, or it may be public (eg: 8.8.8.8 Google DNS). The DNS server replies with the IP of the requested domain. Lists of domain names and IP addresses are maintained by the various domain registrars, and they are constantly aggregating with each other with any changes to IP/domains that occur. Changes to an IP address of a domain can take up to 48 hours to propogate world-wide, but usually occurs much quicker.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were Tasmanian Aboriginals aware of the existence of the Australian mainland by the time Europeans showed up?",
        "response": "As far as we know, no, Tasmanian Aboriginals have been isolated from the mainland ever since the flooding of the Bassian Plain 8000 years ago, although its possible they might have ancestral memories of arriving from another land, in terms of actual contact there is no evidence for any contact. Also, the Tasmanian Aboriginals did not have any of the very useful technologies that the Australian Aboriginals had. So, again, its possible there were memories, but there was definitely no contact.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a flu \"season\"? Also, do other viruses and bacteria have time frames during which they are more active?",
        "response": "It's cold outside. Everyone goes inside to be warmer, and to avoid hypothermia. Now you have many people concentrated in a small area. Germs now pass along easier. Viruses die quickly without a host but now they can find hosts easily.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do most people audibly scream when scared/surprised?",
        "response": "Being scared or surprised often meant danger. The instinct to scream is an alarm to those around us that there's danger nearby.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the rivalry between Boston and New York start?",
        "response": "It's not just Boston, everyone has a rivalry with New York because New York is the biggest city in the country and the center of finance. It enjoys two key geographical advantages, low grade communication between the Great Lakes and the coastline, and a large natural harbor. These advantages were accelerated by the Erie Canal, which opened in 1825, and then by railroads that followed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a RADAR dish spin?",
        "response": "Why does your head turn? So you can see more of your surroundings. It's the same for a radar dish. If it was fixed, it could only 'look' in that direction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Olympic athletes make money?",
        "response": "Endorsement deals. These make top athletes serious amounts of money. They also frequently do advertising work for various products. Its also worth noting that a lot of athletes come from money, or otherwise do not need to worry about their own finances before starting training, in order to commit enough time to it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do some cars have one white backlight and one red backlight?",
        "response": "I'm not sure but looking at other Mazda 3s, and the odd split in that pic, I'm going to say you're looking at a split screen pic of 2 different cars with different rear lamp configuration.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What cause the flash of light as this cavity collapses? [Video in text]",
        "response": "It's possible that it's sonoluminescence, which is a flash of light produced by a rapidly collapsing bubble. It could also be something more mundane, like the illumination light reflecting off the bubble into the camera at a more direct angle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was nightlife like for young men who stayed in the US during World War II?",
        "response": "Anecdotal: My grandfather turned 17 in 1945, but to this day describes World War II as the greatest time of his life. Why? \"Well, someone had to stay behind and offer comfort to all those ladies whose husbands were at the front.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come whenever you get knocked out, you can't remember a few seconds before it actually happened?",
        "response": "When memories are formed in your brain they are first formed as part of your short term memory (or working memory) before being \"transfered\" to your long term memory. IF you receive a blow that knocks you out it can (like the situation you are thinking of) interrupt the transfer of these memories to your long term memory so you forget what happened.  Like if you unplugged your computer before it had finished saving your game.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Ernest Rutherford know for sure that the result of the famous gold-foil experiment wasn't down to the space BETWEEN atoms?",
        "response": "You're not focusing on the most important detail in your summary--that **a small fraction of the alpha particles were strongly deflected**. The model he was comparing against was Thompson's ['Plum Pudding Model](_URL_0_)', in which electrons exist inside a uniformly distributed positive charge. **Were this model correct, none of the alpha particles would be strongly deflected**. The positive charge must be compact compared to the distribution of the electrons to explain the deflection. Whether or not the non-deflected alpha particles passed 'between' atoms or through them is immaterial to his result.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do virtual particle pairs borrow their energy form? (In a vacuum)",
        "response": "Particles to not spontaneously appear out of nothing. Energy and momentum are always conserved in every process. Virtual particles are a useful calculational technique, but they do not exist in the way that you are imagining.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Fragile telescope mirrors and launching them into space?",
        "response": "Telescope mirrors aren't as fragile as you might think. There's a 2.7 m telescope in Texas that was shot (yes, shot with a handgun) several times. The operators of the telescope just covered up the holes and kept on going. Telescope mirrors are much thicker than you'd expect and have support systems that ensure the mirror doesn't sag or bend.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the moment of death always associated with \"the light going out from one's eyes\"? Does this actually happen or is it just a metaphor?",
        "response": "Absolutely not. If you have ever looked into something's eyes when they die the pupils dilate and focus become unfixed. The eyes begin to look waxy. The spark of life you literally see leave their eyes. Its the most heartbreaking thing I have ever seen. I know this because I work with wild animals, wildlife. I have seen many animals die and it never ceases to be something that signifies the intake is dead. It's horrible. I hate it. But it's legitimately also metaphor for the soul leaving the body.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the name of the city Cairo have anything to do with the Christian symbol of Chi-Rho?",
        "response": "Cairo is an Anglicization of the Arabic \"Al-Qahirah,\" meaning \"The Vanquisher\". As such as far as I'm aware the English similarity to \"Chi-Rho\" is purely a coincidence, as it sounds nothing like that in Arabic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are prunes such a good laxative?",
        "response": "Sorbitol will do it everytime and prunes have a lot of it. The fiber alone isn't enough.. but it helps. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a digital scale operate?",
        "response": "There's a tiny accordion of metal foil encased in a nonconductive flexible backing. An electric current is run through the metal foil, and the resistance is measured. As the accordion is pushed together by the weight on the scale, the resistance changes according to a known mathematical formula, allowing you to calculate the weight based on the resistance measurement. This accordion assembly is called a Strain Gauge.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we feel the need to shake (fidget) our legs when sitting down? I find that I, and many others, do this while in class during a lecture or when I'm simply bored. This happens when I'm not nervous or agitated.",
        "response": "Your brain shoots signals down there to make sure you aren't asleep.  When you're sleeping or at rest in general, your brain actually paralyzes your body so if you're running in your dream, you won't actually get up and run into a wall. As you're laying in bed your brain sends signals to your muscles to see if it's properly paralyzed.  This also leads to that feeling of falling before suddenly waking up. Your body was in the midst of locking down, but the scale suddenly tipped back to full control. I'll link to a YouTube video that explains this well when I have access to a computer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly are those people at the doors of Walmart checking on your receipt? And can they legally stop you from leaving after you have already paid for the items you are leaving with?",
        "response": "They serve a few purposes. The publicly espoused reason is so that they can check and see if you've been double-charged for anything, for instance. That's the \"benefit to customers\" that companies will try to claim. In reality they serve as a deterrent to theft, somewhat, due to the fact that people aren't as comfortable leaving with stolen goods when there is a person watching you leave. Thieves would rather have an open exit with no people around for miles. It forces people to acknowledge when they set off the security alarms, instead of continuing to hustle out of the door under the guise of \"there was no one around to explain myself to\". Can they legally stop you? They can ask you to stop, but they have no actual authority or ability to force you to do so, nor are they expected to do so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people get domain names before domain name registries were available?",
        "response": "They didn't. There has always been domain name registration. If you mean the companies like GoDaddy etc, they're just registering you with the actual registrar (Network Solutions) for you, for a fee.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is it about cockroaches that makes them a health code violation, and something that people generally see as disgusting?",
        "response": "Cockroaches tend to live in dirty conditions, harboring a lot of bacteria. They get into things like food and spread the bacteria, which can get people sick. People in general find insects gross, because we know they can be harmful or cause disease (due to bacteria that come with them).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In American healthcare, what happens to a patient who isn't insured and cannot afford medical bills?",
        "response": "60 percent of all bankruptcy in the US are tied to medical bills.  The common refrain you hear is \"anyone can go to the emergency room and get treatment\" and that is not untrue. However, people do not go to the ER for routine care that can prevent problems. If you went to the ER because you had a strange growth they would identify it as a cancerous tumor but that treatment wouldn't be an emergency so you would either have to find charity care or die a slow painful death. Some local governments (states or counties) have welfare care (the dole for health care) but you have to qualify & that takes time and you probably have to not have a job or a very poor paying one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some waiting rooms ban cellphone/other electronic device usage even if silenced?",
        "response": "I suspect it's easier to ban them all than to deal with people in the waiting room who feel the need to blabber away on the phone in their loudest outside voice about highly personal matters while they're waiting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "is fire considered to be a gas?",
        "response": "Fire is a process that *occurs* in gases.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the iPhone 7+ have 2 front cameras?",
        "response": "It doesn't, it has 2 rear-facing cameras. One is the normal 28mm focal length and the other is 2x at 56mm (all are full frame/35mm equivalent of course). This simply means you have a lens that is more \"zoomed\" in without losing quality. [This should help](_URL_0_). So, you can see 2x as far without cropping.   They aren't the first, I forget the phones, but one has a normal one and a super wide angle fish-eye and a different phone has a second identical camera that's monochrome (B & W, technically grayscale), this allows it to capture more detail by overlaying the color information, so color accuracy is the same but there is more detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do my arms stay at a natural bend more right after I finish curling?",
        "response": "As the muscle gets filled with blood, it's in a more contracted state. The bicep releases tension to elongate the arm, and contract to bend at the elbow. When that muscle is pumped up, the muscle is shorter, meaning the arm will sit (at rest) at more of a bend.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't an electron's velocity and position be found at the same time (Heisenberg's Uncertainty Principle)?",
        "response": "Think of it this way,  A sine wave has a very well defined wavelength (which is related to momentum), it repeats itself in an ordered reliable fashion, but you can't actually ask *where* the sine wave is except that it's everywhere and fills the number line. Contrast this to a peak, like a well localized Gaussian curve. It has a well defined location, roughly *here*, but if you decompose the peak into a sum of sines and cosines, you get a broad distribution of different wavelengths, there is no longer is a unique wavelength associated with the Gaussian curve like there was with the sine wave. The tighter the curve in space, the broader the distribution of wavelengths.  This in the uncertainty principle as seem from [Fourier analysis of waves.](_URL_0_) It's a nice way to *see* the uncertainty principle in a visual manner and not as black magic, but as a natural consequence of wave behavior.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are more people developing allergies than before, or are we as a society being more accommodating to those who have the allergy?",
        "response": "There seems to be a connection between allergies and parasites. It is believed by some scientific communities that the decrease in hookworm infestations has increased susceptibility to allergies, and some allergy sufferers have voluntarily infected themselves to treat it. [link](_URL_1_) EDIT: [another link](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't spacecraft burst into flames? (Thermodynamics Question)",
        "response": "The Energy is being converted into Kinetic Energy rather than Thermal Energy. Instead of all of the particles being given random motion by the energy, they are all accelerated in the same direction so relative to the spacecraft, the particles are all moving randomly in roughly the same way as they were before.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When using carbon dating and similar techniques, how do we know the age of the object it made up, rather than the age of the carbon or other isotope from when it was formed in a star?",
        "response": "Carbon dating works of the natural rate at which Carbon 14 (an unstable isotope) decays based on its half life. When things are alive, everything in an environment has an equilibrium of C14 as carbon is being continually being transferred between organisms. When they die however, there is no more carbon addition, and the organism becomes \"out of sync\" with the rest of the environment, for lack of a better way of phrasing it. We can then identify the age of it by extrapolating backwards to find the time period when it was in equilibrium with the environment. It's pretty good for the most part, but obviously it leaves a lot of room for error, which is why the dates we get from carbon dating a very broad estimates.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If one were to start reading up on Marxism and Communism for the first time which book(s) should they start with ?",
        "response": "If you're looking for opposite views on Marxism you might like Karl Popper's *The open society and its enemies* (two volumes, the second one deals more directly with Marx) and *The poverty of historicism*. *The open society* draws parallels between the philosophies of Plato, (Aristotle,) Hegel and Marx, and, **to simplify very much**, traces the origins of 20th century totalitarianism back to the latter two, specifically their predictions of a development of society towards an utopian future. Popper calls the belief that it is the job of social scientists and political philosophers to predict future developments of society \"historicism\", and criticises that in *The poverty of historicism*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there some sort of science behind disintegration?",
        "response": "I presume you mean something like [this](_URL_0_). You fire a visible beam at somebody, they freeze in place with a startled expression for half a second, and then they vanish cleanly with no smoke or evidence of great heat on surrounding objects. Put simply, that's impossible. To give you a visual for what is possible, have some videos. [Naval IR laser vs drone](_URL_2_) [Cutting laser vs pizza](_URL_1_) Note the smoke coming from the pizza. You cannot simply destroy matter (you can, but converting a redshirt directly to energy would blow up the whole Enterprise). There must be something left of the target.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a good book on the Vietnam War that accurately portrays what it was like for combat soldiers?",
        "response": "I'd recommend Christian Appy's *Working-Class War: American Combat Soldiers and Vietnam*. Gets the job done. There are plenty of books on the subject though, so I would recommend reading several authors and perspectives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens in the body if you don't masterbate for like weeks or months, for both men and woman?",
        "response": "ELI5: Why have so many people recently started spelling masturbate as masterbate on reddit? Am I missing out on an in-joke somewhere? Is it some semantic shift underway?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't optometrists and dentists work in hospitals?",
        "response": "Some hospitals do have doctors that focus on teeth and optics. But most of the time these are lumped in with bone and nervous system specialists. The simple fact is that they don't need them there. People waiting for a dentist don't want to have to navigate through a hospital, and hospitals don't want to deal with everyday stuff, hence why few hospitals have actual clinics in them, most of the time are just walk-in clinics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any evidence to suggest that Homo Sapiens and Homo Neanderthals communicated or worked together in any meaningful way?",
        "response": "Yes. They not only lived near each other but they actually mated. Humans today carry some Neanderthal DNA. (about 0.1% to 4% or so depending on the person.) We know this because we have mapped the genome of Neanderthals. Using bones found in the Vindija cave in Croatia, scientists extracted Neanderthal DNA. Using these samples they assembled the Neanderthal genome sequence. Here is some info on that. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't babies get morning breath?",
        "response": "1) they don't have teeth yet/don't eat solid foods yet 2) their mouths stay moist most of the time (a big cause of bad breath is dry mouth) thanks to their natural nose-breathing/drooling  3) every night a magical fairy comes in & fills their mouth w/ Gypsophila, sort of like how your parents leave an air freshener in their car",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are cartridge based video game systems inferior to disk based ones? Also, why did cartridge based system not have load times?",
        "response": "They are larger and hold less data. They are also significantly more expensive to produce. They don't have load times because there's no moving parts. It's solid state memory. No laser needing to read a disk.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During America's election of 1864, was there any attempt to have the Confederate states vote?",
        "response": "**The Union point of view:** Secession is illegal, yes. Thus, by pursuing illegal secession, they have rebelled against and rejected the United States government. Their senators and representatives willingly walked out of the halls of Congress at the start of the war. They have since formed their own government in opposition to the United States government. Why would such traitors be given the ability to vote? **From the Confederate point of view:** Through secession we have lawfully rejected the United States government and formed our own Confederate government in its place. The entire point of the war is to reject Union authority over the South. Why would we legitimize the United States government by claiming a say in its affairs, thus acknowledging its claim to sovereignty over the South we're fighting to free?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did West Germany get punished either formally or informally in international sporting events in the aftermath of World War 2?",
        "response": "Yes, both Germany and Japan were banned from the first World Cup ([1950 in Brazil](_URL_0_)) and the first Olympics ([1948 in London](_URL_1_)) after the war had ended. They were both still under Allied occupation at the time. The East German football federation hadn't been formed by 1950 to attempt to qualify for the World Cup even if they could have. Italy and other Axis allies weren't banned from either competition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were there any human populations that ate at 100% animal-based diet? Were they healthy?",
        "response": "The Inuit ate (and more traditional Inuit today) eat almost all meat. They have been doing fine. Protein poisoning is avoided by eating a lot of fat. They don't eat 100% animal-based food though, they also gather some plant material.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a vending machine tell the difference between a $5 and a $1?",
        "response": "Some vending machines recognize the image printed on the dollar bill much like facial recognition on your iPhone camera. Some vending machines recognize the little metal lines in dollar bills you can see if you hold them up to the light because they're different for every bill and the machines know therefore which bill you're inserting. It depends on the type of machine and where in the world it is, but that's basically how it happens.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Someone diagnosed with ADD/ADHD explain what it's like.",
        "response": "You are trying to read and a dog is barking...Each bark totally takes over your attention and you can't concentrate on reading b*BARK* because*BARK* because *bark* because the *bark* the dog won't shut up. You can't ignore it..In the classroom,or anywhere else,the same thing happens...Can't read if there is a tv or radio on cause it overrides your thought \"Hi I'm A Mac\" process \"And I'm A PC\" and you HAVE to attend to it even though you don't want to. In a party, you can hear several conversations at once and it's hard to listen to one. That's my experience anyway.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"muscle memory\"? Is it just an idiomatic phrase or does it have a scientific basis?",
        "response": "As a side question, is it possible for one to simply have that muscle memory \"forget\" certain actions? (without anything significantly traumatic happening). As one year, after maybe 9 months in between high school seasons one year, I completely forgot how to throw a baseball and had to work all the way up again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a bat was on the phone, could it perceive the room on the other end using echolocation?",
        "response": "There are a plethora of reasons the answer is NO for. Right off the bat I can come up with: - Ultrasounds emitted by bats are way higher pitched than phone lines cutoff frequencies - Echolocation is largely based on triangulation, and you cannot do that with a single sensor receiving the return signal (i'm talking about the microphone at the far end of the line): you need a spaced out array of at least two (in this case, the bat's ears, which BTW are far more sophisticated than normal ones) - Echo from the local phone hand piece would overwhelm every signal coming back - Bats can't use the phone EDIT: added a point about bat's ears",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why (or how) is the age of the Methuselah Star older than the universe?",
        "response": "It's quite simple - it's not older than the universe, and nobody in astronomy is claiming that it is. Most of the articles and headlines that have claimed the star appears older than the universe just don't understand uncertainties. It's certainly an *old* star, but a more accurate headline would be \"age of star is consistent with age of the Universe\". Much less interesting though. ;-P",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A question about the history of a place name in the UK - \"Nanjizal\"",
        "response": "hi! well, it's apparently [Cornish for \"low valley\"](_URL_1_) or perhaps [\"howling valley\"](_URL_0_), so you might try to track down some Cornish speakers/linguists in /r/Cornwall, /r/Linguistics or /r/AskUK for more information.",
        "source": "sentence-transformers/eli5"
    }
]