[
    {
        "query": "What would happen if a fighter jet, lets say an F-22 , attempted to travel into space? What variables would make it unable?",
        "response": "First, read this _URL_7_ That will clear up a couple of misconceptions you might have about space that would lead to this question. Short answer, to get into orbit you need engines capable of delivering sustained thrust without external oxygen, and jet engines can't do that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can something be proven as random?",
        "response": "Depends on what you mean by 'something' and 'random'. Could you give an example? A sequence can be shown being [statistically random](_URL_1_) within a [confidence interval](_URL_0_). But you can't determine if it is truly random or deterministically generated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could someone named Stephen King become a writer using their name?",
        "response": "Yes they could. you can't copyright a name. You can trademark a specific way the name is written (font, colors, etc) so a guy named McDonald can open a burger shop with his own name but he probably can't use big Golden Arches and a clown dresses in red and yellow. Generally the rule is you can't confuse or try to trick the public into thinking you or you business is associated with the more famous version. So a second Stephen king could write a book but can't use a picture of the famous Stephen king (which would create other issues of publicity rights) All this is general and may defer based in state law",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Historians of Ancient Rome, Why is it that the Romans failed to conquer the Celts?",
        "response": "They... didn't fail to do so? Rome conquered Celtic Gaul, Hispania, and parts of Brittain. Are you confusing Celtic and Germanic?  The only Celts that escaped Roman conquest were those in Ireland. Ireland escaped conquest because the Romans in Brittania were busy dealing with rebellion from the Picts the one time they actually considered invading. After that, they built Hadrian's wall and gave up on conquering more land in the region.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can countries report GDP growth (like US was around 2.2% growth in 2018) that is different than the % change in GDP (like US GDP was 1 trillion dollars higher in 2018, compared to 2017, which is 5% higher)",
        "response": "Growth has two parts, increased production/consumption, and increased prices. Prices isn't what we care about in growth, so inflation is removed from it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that some people retain accents after learning a language while others don't. For instance my girlfriend was born in Iran, moved to the US at 12 and has no accent whatsoever. While others have lived here for 20 years and sound fresh of the boat.",
        "response": "People's brains just work differently. Variables include, but are not limited to - Age, natural linguistic abilities, desire to change, use of language(s), etc. I would suspect those that maintain their accent tend to use their native language when speaking to others who also use speak that language natively. Where as a child, wanting to fit in with the friends at school, will use primarily the target language, learning its specific pronunciations so they sound \"normal\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is anti-matter? Can it be created? Or is it impossible?",
        "response": "This is more of a physics question than chemistry. We really don't know much for a fact about the chemistry of antimatter but in theory it is exactly the same as regular chemistry.  > What is anti-matter? Antimatter is basically the opposite of normal matter. Electrons instead of having a negative charge have a positive charge (called positrons), protons instead of a positive charge have a negative charge (called \"anti-protons\", disappointing I know\"). If you imagine normal matter as the crest of waves in the ocean, antimatter is the troughs.  > Can it be created? With great difficulty. It can be made in very small quantities through high energy interactions in particle accelerators, and then the challenge is to isolate it from interacting with any other matter where it would annihilate itself. One big question in physics and cosmology is why the universe appears to be mostly normal matter and not antimatter because there isn't any known reason why normal matter would be more common.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do all of the victims of ISIS beheadings look so calm and nonchalant?",
        "response": "I've read it's because they do so many mock executions and tell them that they just need to do it for pictures and videos. After ten or fifteen times of the posing, over the course of weeks or months, the captive generally looks more clam.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were we able to determine the distance from the Earth to the Moon?",
        "response": "Basically, you have the build up the answer in stages. First you [measure the radius of the earth](_URL_2_).  [Next you measure the radius of the moon and the length of the lunar orbit in terms of earth radii. Then you measure the distance to the sun in terms of earth-moon distances.](_URL_0_). Then you measure planetary distances in terms of earth-sun distances. [Read all about it here.](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could someone please explain (Li5) why the US allows random pork to be added to proposals and why line item veto are not used?",
        "response": "In the court case Clinton v. City of New York (1998), the US Supreme Court declared the line-item veto unconstitutional. Basically it held that the line-item veto allowed the President to create laws himself rather than Congress, violating the separation of powers. Lawmakers place those earmarks in the bill for a pet cause or their home district, and there are no restrictions as to how relevant an addendum needs to be to be included in a bill. Everyone claims to be for regulation of earmarks, but in practice they're all for it, because they all do it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you own land on the moon? Could a nation form on Mars?",
        "response": "Right now all of space is more or less agreed to be neutral territory. Whenever the day comes that someone starts forming permanent colonies on extra-terrestrial bodies, there will likely be a very serious and very important global discussion on how ownership of these bodies will work. Right now there is no clear plan in place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if air is injected into your blood stream? A very small amount? A syringe worth?",
        "response": "Thanks everyone for their answers. Now I will second guess injecting air into my veins.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the point of having \"common\" names, as well as scientific names for species?",
        "response": "The common names generally come before the scientific names. The common name is just what people normally call that animal in their language or region. Scientific names are needed because common names are very imprecise. Sometimes many similar species will be grouped under the same common name, so you need scientific names to distinguish between them. Sometimes a single species will have different names in different places (even where people speak the same language). And sometimes people in different regions use the same common name for completely different animals. Scientific names provide a way to unambiguously refer to a specific species, across the entire scientific community across the whole world. Scientific names are also structured so you can tell if two species are related from their names.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does combustion only occur in the presence of oxygen?",
        "response": "Combustion is an oxidation reaction between a fuel and an oxidant - that's the definition. One often focus on atmospheric oxygen as it is a readily available oxidant. You can still have combustion in the absence of oxygen, as long as you provide the oxidant in the reaction. This is, for example, how the typical firearm cartridge works - the propellant burns because an oxidant is mixed into the powder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between college, community college and university in the US in terms of the credibility of one's degree? Do all of these even end with one getting a degree?",
        "response": "Community Colleges are 2 year colleges that offer trade certificates and Associates degrees. Sometimes, they'll cooperate with a state college or university in order to offer higher degrees in specific programs. These are run by the county (usually) or city (sometimes) and designed to offer a wide variety of education. Colleges are 4 year institutions that offer up to Bachelor's degrees, as well as trade certificates and Associates degrees. They're typically state funded or private institutions. These are smaller institutions which offer a smaller number of degrees, and are generally specialized. An art college, or a STEM college, for example. Universities are 8 year institutions that offer all the way up to Doctorate degrees. These are either funded by the state or privately. Universities have many colleges within them, and can offer a wide variety of degrees. Think about places like Harvard, that have a Law college, a Medical college, a Business college, a Divinity college, etc, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do countries coordinate speed/direction/altitude of satellites so none of them collide?",
        "response": "The distance between things in orbit is vast, and Earth orbit is a huge place. Put simply, the chances of any two things colliding is very, very slim despite there being thousands of active satellites in orbit and many more pieces of smaller space debris because there is just so much space between everything However, for the most part, they can track the satellites. Because we have such vast knowledge of physics, we can accurately predict the different orbital patterns, and how to launch them to prevent possible collision. It's still possible, but unlikely.  Edit: Also, another reason is that most of our manmade satellites travel in similar orbital bands at similar speeds within those bands. This means they’re moving in the same direction at specific heights, sort of like an imaginary conveyor belt moving around Earth. There’s not really much chance of one satellite catching up to another and, even then, the chances of a collision are low. [Source](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does the money that is given to charity for Africa in the last 50 years go if the people there are still in poverty?",
        "response": "In countries where corruption, bribery and theft are an integral part of daily business. Money, food stuffs, clothing and medicine etc can disappear long before It reaches those in need.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what happens to stuff (hair, dirt etc) that gets into our eye socket?",
        "response": "It gets flushed out with tears. The eye itself is surrounded by muscles, so particulate cannot really do more than get behind an eyelid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do \"dead\" batteries work when I take them out of my remote and out them back in? Sometimes it works if you just wiggle them.",
        "response": "The chemical reaction that occurs in a battery to create electricity also produces hydrogen bubbles. When these bubbles are created faster than they can dissipate, they can cover the anode in the battery which stops the chemical reaction. Removing the batteries from a circuit allows the bubbles over the anode to dissipate thus allowing the battery to work again. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a body spins faster than its escape velocity, would something be able to last on its surface?",
        "response": "If a body spins faster than its escape velocity then it would actually lose parts of itself, unless it was somehow glued together. Any object on the surface would be flung off of the surface, since it would take more force than gravity can provide to keep it there. Then you notice that any rock or piece of the planet is no different than any object you can imagine placing on the surface. So the surface of the planet would be flung off as well.  I take it you mean the surface of a planet, or something similarly massive and gravitational force is the only thing holding it all together. Also, I am assuming that you are at the equator, since at the poles you wouldn't have this effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if we have enough grain and milk sitting in silos around the USA to feed the world why do we give farmers subsidizes to burn it instead of using that money to give it away?",
        "response": "To stabilize the price. Too much supply will result in price drop which will drive lot of farms out of business which will decrease the supply and cause price spike.  We are doing this to stop volatility in prices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is outsourcing good for anyone besides the stock holders?",
        "response": "You're assuming that if a product is currently made in the US and then portions or all of the product are then outsourced, the difference in the before and after cost would go straight into profit. If this were the case yes, this would mainly benefit the stockholders and nobody else except possibly employees of the company. In the real world, generally most of these savings are passed on to the consumer to keep a product cost-competitive (which benefits both the consumer and the company), whether you're talking assembly, mining, skilled labor such as programming, etc. _URL_0_ tl;dr: The cost of an iPhone 6s would only cost 5% more if it were simply assembled in the US. However if all of the components were produced in the US (With raw materials still being imported), this would raise the price by around $100. It's impossible for an iPhone's raw materials to all be sourced from within the US so at least some of the mining NEEDS to be outsourced.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people want to buy broken/water damaged iPhones​ for cash?",
        "response": "Broken electronics still have components that can be used, or resold for profit. They're also full of useful and valuable metals, such as gold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are ambulance services owned and used privately when police and fire are run by towns and cities etc?",
        "response": "In the USA, the government has opted to stay out of the whole medical arena as much as it can. As soon as they can put you in the care of a non-government health organization, they do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who was allowed to join the Teutonic Order as a knight, and how would it alter a person's life?",
        "response": "Most knights who served under the Teutonic-Livonian joint state came from other countries, and rarely came from the local populace. Many served Orders in Germany, Prussia and many of the crusader states (until they were destroyed the by Sunni Muslim). It wasn't till later on (not 100%, mid 13th century), when the Grandmaster of the Teutons gained increased control of local populations and inducted the previous landed nobility. Said nobility could join the order, but still serve their estate. With that in mind, most equipment came from the Knight and not the order. At this point in history, a knight of any calibre was compelled to maintain and buy their own equipment rather than be equipped by the Order. Members of the Teutons would receive a standard wage, and a cut of loot gained from sieges and raids in the Northern Crusade. EDIT: Added Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Introducing: The official AskScience chatroom on Freenode!",
        "response": "Following freenode's naming conventions you should be in #reddit-askscience due to it being an official channel for a subreddit. (Feel free to ask a staffer in #freenode for more information)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Auction Theory Question",
        "response": "What are they willing to pay? If they're willing to pay 120 they'll all be sold at 120. Easy way to see it is to say that if you see at least one item below 120 someone will obviously bid.  The subject is called game theory. There's lots of research on different types of auctions",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an athlete using smelling salts work?",
        "response": "Smelling salts release ammonia gas. If you breathe in this gas, it irritates the insides of your nose and lungs to such an extent that it stimulates your sympathetic (\"fight-or-flight\") nervous system. This is an autonomous part of your nervous system that, when activated, has all sorts of arousing effects on your body, releasing adrenaline, increasing your heart rate, opening up your lungs, increasing blood flow to your skeletal muscles (while decreasing it to your digestive system), and generally preparing your body for action. For athletes, these effects may be desirable and performance-enhancing, although perhaps especially so for athletic feats that require quick bursts of action. Smelling salts have also been used to revive athletes that have been rendered unconscious (e.g. boxers), because their arousing effects counteract the fainting response.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that shows like Family Guy are able to get away with a more \"liberal\" agenda while being broadcasted on a network like FOX?",
        "response": "Please use the search bar.  * [what is the difference between Fox \"Hollywood\" and \"Fox News\"? They seem to have contradictory interests politically and appeal to entirely different audiences. How do they get away with keeping the same brand without abandoning viewers?](_URL_0_) (273 comments) * [ELI5: Why is fox news so conservative when Fox Channel tv series, such as glee are very liberal in their ideals?](_URL_1_) (177 comments)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our voices crack when we are on the verge of crying?",
        "response": "When you're upset your throat muscles tighten which makes everything in you throat tighten up as well, such as your voice box and esophagus. This is why you may also find it hard to swallow food or drinks when your upset.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A question about gravity, spaceships and rubber balls",
        "response": "Your friend is right. This is what happens in a [Vomit Comet](_URL_0_). Your reasoning breaks down when you say  > To me, it seems like ball will have an acceleration pulling it down equal to gravity, and no upward force since both it and the ship are moving at the same speed, so it should fall to the ground. The whole spaceship is also accelerating due to gravity at exactly the same rate, so from the perspective of inside the ship the ball will not move.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do other countries (outside of the US) have little or no commercial breaks on TV?",
        "response": "As an example, I believe England has their stations technically run by the government, kind of like PBS here The US on the other hand leases out different bands to companies (nbc, cbs, etc) so they have to pay for their costs",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does being submerged in water feel significantly colder than walking around in the same air temperature?",
        "response": "Specific heat. Water has a higher specific heat than air so water will take more energy from your body than the air will. Remember, the world wants to equalize temperature (which is a measure of kinetic energy of the molecules)... Specifically temperature is proportional to how fast a molecule vibrates and if you put two molecules at different temperatures together then they will exchange energy on interaction until they are both vibrating at the same frequency. Water takes a lot of energy to change how fast it vibrates and as such your body loses a lot more energy when heating water than it does when heating air and as such it feels colder (as we feel temperature based on the exchange of energy, if we gain energy then it feels hot and if we lose energy then it feels cold).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the hole in the ozone layer?",
        "response": "Here's a neat article about it: _URL_0_ Though I know most don't come here for a long read so here's the tl;dr: The hole being discovered contributed greatly to its reversal. Had it not been, it would have been quite a catastrophe. It's expected to be completely healed by 2050.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If identical twins are genetically identical, why are their often various physical differences?",
        "response": "Appearance is based on both genetic and environmental factors. Fingerprints are a perfect example. The exact configuration of fingerprints is based on specific placements of the fingertips and toes as the skin on them develops; they are essentially 'wrinkles' that get locked in place because they form at a specific time. Because this exact placement is different for everyone, everyone's fingerprints - even twins' - is different. One twin may get slightly more oxygen or nutrients than the other in utero because of the placement of the umbilical cord, or where they are in the womb, so one twin may always be slightly bigger and heavier than the other. Birthmarks like moles develop almost entirely randomly (although the number of them a person has has a genetic component), so they will be different as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the mainstream film industry able to produce so many movies which are identical in a lot of aspects and a lot of us still don't get bored?",
        "response": "i think you're looking at it the wrong way; they make so many movies identical BECAUSE we dont get bored of them. The average movie goer likes familiarity and reliability. Movies play it safe because viewers like to play it safe as well.  Hell, there have been studies showing that the average movie goer actually LIKES spoilers in their movie trailers. They like to know that a movie will be exciting enough to earn their money before they even go.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When there are multiple people talking around me or there is a lot of noise around me, how am i able to choose what I'm hearing and comprehending? Does it work like a camera focusing on the image in the foreground then refocusing on an image in the background?",
        "response": "> The cocktail party effect is the phenomenon of being able to focus one's auditory attention on a particular stimulus while filtering out a range of other stimuli, much the same way that a partygoer can focus on a single conversation in a noisy room. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between Prussia and Germany",
        "response": "After the Holy Roman Empire fell apart the area of modern day Germany was home to a large collection of independent states in a confederation. By the 19th century Prussia had become the most prominent and militarily skilled of the german states, which lead to them forming a unified German state in 1871.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Alabama and say, parts of Morocco and Algeria are on the same latitude(?), why is it relatively warm in the African counties but it's snowing in the American ones?",
        "response": "I can't say I know a concrete reason but I would say it is related to the fact that temperature in any given place is much more a matter of air and water currents than longitude or latitude. Much of Africa experiences warmer temperatures for a variety of geographic and barometric reasons which have nothing to do with their position relative to the equator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do soda filling machines fill up bottles so quickly without the bottles exploding?",
        "response": "Counter pressure. The bottles are pressurized to the equivalent pressure of the soda going in. Bleed a little pressure off and the bottle fills up. remove the fill tube and screw on cap right away. All this is done at near freezing temperatures so the soda isn't as volatile. It's the same way as for beer and sparkling wine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why the magnetic field of earth flips every few hundred millennia",
        "response": "That's a question with a very complex answer. And I'm not sure I can really do the answer justice in an ELI5 setting. But here goes: The earth is a magnet, but not like a bar magnet. More like an electrommagnet. Deep inside the earth there is a core of molten metals that swirls all around one another and that motion causes a magnetic field. These motions aren't stable but subject to changes in current wich likewise have an effect on the magnetic field that's produced. For a more detailed answer I think I'd have to refer you to /r/askscience",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does closing schools for several months in the summer have any educational or learning-process benefits?",
        "response": "It is actually counterproductive, from an educational and learning-process perspective.  Across nations, the best correlation with student test scores is the number of school days per year. In South Korea, they have 220, and their students perform the best. In the USA, we have about 180, and our students fall in the middle of the pack among developed nations.  Source: Howard S. Friedman Interestingly, many US schools have worked on the hypothesis that the long break leads to a decay in learned material, and some have switched to a 9 week on, 3 week off, schedule (Wake County, NC). There is no strong evidence that this practice positively impacts test scores. Schools have not taken to boosting the number of school days per year, probably because it would require a 22% increase in tax collection to pay for the increased number of school days.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some creatures 'stop evolving' - sharks and horseshoe crabs are often quoted as 'not having changed in x million years'?",
        "response": "It's a mix of topics here, but there are some points to ponder. 1. For many of the classic 'living fossils', it's not really true that they haven't changed. Take sharks: yes, sharks lived with the dinosaurs, but none were the species we have today (no hammerheads, no great whites, etc). Same goes for the Coelacanth. 2. Many of the living fossil examples have bodies and forms so simple that even drastic internal changes wouldn't show in fossils. This would cover things like worms, sponges, bacteria, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "is it possible to have a solar system located outside of a galaxy? And if so, how would things change if our solar system existed in such a spot?",
        "response": "Yes, this has been found, but presently it's thought that stars only form inside galaxies, so these star systems are thought to have been thrown out of galaxies due to galaxy collisions. One example is the star HIP 13044 and its planet, [HIP 13044b](_URL_0_), which was found in a stream of vagrant stars that loop around the Milky Way. Astronomers think this stellar stream is all that remains of a dwarf galaxy that once orbited the Milky Way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the flu virus continually mutate (requiring us to get new vaccines each year), but other viral diseases (such as chickenpox) do not?",
        "response": "Influenza, like many other fast mutating viruses (common cold, stomach viruses, anything you can get year after year) is an RNA based virus. RNA is like DNA, except it only has one strand, not two strands like the DNA double helix. This one stranded structure is less stable and makes the virus more prone to mutations. However, this obviously works to the virus' advantage, as it has gotten around all of our attempts--natural or technological--to stop it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do cars, especially new cars depreciate so fast?",
        "response": "Value isn't what the seller thinks it should be worth, it's what a buyer will pay. If you drive it off the lot and in a few weeks decide to sell it, it might be worth (to you) 99% of the value of a new car, so you try to sell it for $200 less than what you bought it for. The buyer will weigh in his mind, \"Do I want this car, or a perfectly brand new car for only $200 more?) They will go for the new one almost every time. So you have to lower the price until it makes it worth someones while to purchase it new. That is the depreciation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The universe is flat",
        "response": "The concept of \"flat\" when referring to 3D space means that for example you cannot travel straight in one direction and end up back where you started from. Or maybe you measure a triangle between three points and the angles between the points add up to 180 degrees; if they didn't space isn't flat in that area. While local warping of spacetime does occur, on the whole the universe is flat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This may be a dumb question, but when I turn off my lights, where does all the light go?",
        "response": "It gets absorbed. Light travels really REALLY fast so you aren't going to see it get dimmer gradually or anything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is spot reduction impossible? Doesn't taking yohimbine hcl have the effect of spot reduction?",
        "response": "> Why is spot reduction impossible? There is no mechanism to metabolize fat in specific areas of the body. The required sugars are drawn from everywhere via the blood regardless of what muscles are worked, or what herbal quackery is rubbed in certain places.  > Doesn't taking yohimbine hcl have the effect of spot reduction? No, it is a stimulant and aphrodisiac. As a stimulant it can be useful in weight loss, but the various herbal products on the market are of unreliable dosing and caution should be exercised.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Best book for Greek mythology",
        "response": "Bullfinch's Mythology is a good general book that contains the myths themselves. It's an easy read, but it's extremely informative about the intertwining myths.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I sneeze when I walk outside into the bright sunlight?",
        "response": "From wikipedia: The photic sneeze reflex (also known as photoptarmosis, colloquially known as \"sun sneezing\") is a condition of uncontrollable sneezing in response to numerous stimuli, such as looking at bright lights or periocular (surrounding the eyeball) injection. The condition affects 18–35% of the population, but its exact mechanism of action is not well understood. Glad i couldn't help",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the president briefed on non national news stories(small town tragedies, murders, roller coasters getting stuck on upside down loop for hours)? Or does he just read that type of news in the paper or online like the rest of us?",
        "response": "He most certainly does not get his information like the rest of us, that is unless you have a team of advisers and analysts who distill out all the important information from the news and from internal information gathering sources and give you daily briefings. They may indeed read the paper too, but...that's more about ritual, relaxation, the morning cup-of-coffee and so on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If insects use the moon to navigate at night, how do they navigate when it is a new moon, or any other phase in which the moon is only out for a short time at night?",
        "response": "The main theory is that they just use the moon as a landmark to help them fly in straight lines... But that there are other cues they use to navigate. Apparently this is too short for ELI5... It's like if you were using the morning sun to help you walk in a straight line. Even if the day becomes cloudy, there are other things you can use to try to move straight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would it be possible to create garments from bee fur?",
        "response": "No. The fibres are too short. You need a certain length of fibre to twist together into the thread, otherwise there's not enough friction to hold them together.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Auto industry price-fixing",
        "response": "Because that's not price-fixing. If Toyota called Honda and made an explicit agreement to price the Civic and Corrolla the same, that would be price fixing. There is no reason to believe that that is occurring",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't the coils of an electric stove shock me if I touch them while turned on?",
        "response": "Electricity isn't passing through the part that you can touch. There's an internal copper coil that the electricity passes through. It's surrounded by an insulator (an electric insulator, but not a heat insulator), which is in turn surrounded by the outer metal sheath that you're touching. [Here's an illustration](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does hitting a flashlight that has gone out make it turn back on?",
        "response": "The flashlight has loose contacts which the jostling reconnects. If it was out because the battery was depleted then hitting it wouldn't do anything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What can we perceive/measure about the curvature of space?",
        "response": "Imagine you're in a spacecraft in space, but close enough to earth to feel its gravitational pull. You are directly above earth (imagine in a 2d plane) at 0 degrees. Now push the space-craft with an initial acceleration in the x-direction and just coast. You will end up 90 degrees to the left of earth ( you will move in a circle and end up where you started after a certain time ). You just moved in a straight line in curved space.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were the 13 colonies of the new world that belonged to Great Britain called?",
        "response": "They were called the 13 colonies. There were the Middle Colonies, Southern Colonies and New England. They were hardly united early on. In an average conversation they might just say \"West Jersey, Pennsylvania, New York\". As far as I know they just said 13 colonies or British North America.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After death, can the brain still function to a degree? Can neurons still carry signals for a period of time?",
        "response": "The real danger to brain tissue is ischemia and the cascade of problems associated with it that occurs when blood flow stops completely. It only takes 5 minutes of limited blood supply to cause irreparable damage to brain tissues and 20-40 minutes will completely kill myocytes. This doesn't necessarily answer your question but it does mean your window for electrically reviving the brain in any way is extremely short. Also, many of the results from an ischemia cascade can disrupt an electric signal being carried through the brain far before that 20 minute mark.    In addition, the brain is not well known enough yet to reliably stimulate regions to retrieve memories or stimulate conscious thought. It may be possible though, to stimulate part of the brain to give a sense of pleasure in a dying patient.    _URL_0_    --Please be aware I am not trained in the medical field. This is all from some quick research. If you have more information, please add it!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In WW2, in the pacific theatre, were paratroopers being used at the beach landings, just like in Normany?",
        "response": "The Imperial Japanese Navy had several elite infantry units known as the Special Naval Landing Forces (SNLF). Several of them were trained in paratroop duty, and notably conducted airdrop operations in several battles in the Dutch East Indies. Their primary deployment was as blocking forces in conjunction with landing troops to inhibit enemy movement and to cutoff forward units. They were never deployed in large numbers owing to their small size and after the DEI campaigns were reorganized into more traditional land combat units.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it okay for restaurants/hotels to advertise as kid friendly, but people lose their mind when they say they are not kid friendly?",
        "response": "Most people don't care or are happy to have some places be child-free. There is just a loud and obnoxious minority of parents who feel the need to constantly shove their children in other peoples' faces.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does chugging 4 glasses of water in under 3 minutes make you feel bad if water is good for you?",
        "response": "Overhydration and fullness are what you are feeling. Your body maintains a steady and delicate balance with your hydration. By introducing a huge amount of water into your system it needs to diffuse that water and it will cause multiple things to happen including dropping your blood pressure, salt content, fats and lipids ratios, increasing your heart rate and otherwise making you feel like crap for a few minutes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are agendas like climate change, deforestation, drinking water shortage and such which are necessary for basic survival of life not the most important topics of discussion for a country. Why is economic development the most important topic of discussion today",
        "response": "Climate change, deforestation, drinking water shortage aren't actually *problems*. They're *potential sources of problems*. So we really can't address them directly - at best we can address predictions of what problems might emerge. But how would we address those potential problems? With *money*. If we don't first secure a solid economy, we can't solve any upcoming problems. So it's really a combination of only solving problems where you have enough information to seriously address them and a hierarchy-of-needs concept where the economy is more important than the environment (if you've got a great economy and a bad environment, that's fixable - the reverse is not true).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do helicopters have different numbers of blades and what are the benefit of 2 blades or 4 blades?",
        "response": "I'm looking around the internet and seeing lots of people speculating about it.  The most plausible explanation that I'm coming across is that having more blades increases blade area without increasing length, allowing you to have more lift with lower blade tip velocity and reduced blade sweep area. However, having fewer longer rotor blades allows the engine to operate a lower rpm and reduces the number of moving parts that need to be maintained. Also more blades means more weight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why has the United States not invaded North Korea (in recent years), especially after having been threatened repeatedly?",
        "response": "Because while N. Korea might talk a mean game, they're basically harmless. Much of what you see in terms of N. Korea is purely spectacle make to build this image that they are this badass. In reality, N. Korea probably wouldn't be able to take over a Walmart in Texas. They're basically like a child who's threatening to hold his breath. Sure, he could do it but he'd only hurt himself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there no Russian cars in the United States?",
        "response": "Import/Export of cars is expensive, and the farther they have to go, the more expensive they get. Plus having a car from another country means maintenance can be really difficult, making the demand lower as well. I can use Malaysia as an example - as I understand it, due to the way that import cars were taxed/dealt with, the primary car dealer you went to was Proton. Everyone had a Proton, and other brands of cars were fairly rare or a luxury item. More recently (last 3-5 years) I've noticed more American/European cars. So a Russian car manufacturer would have to have enough demand in the US to ship cars all the way over and deal with the additional costs of export taxes/fees, which are added to the price of the car, which will likely make it non-competitive with a similar US car.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are mammals never brightly coloured?",
        "response": "This is probably going to go down as a /r/badscience answer, but here goes.  Animals that are brightly colored use their color to convey a message to other animals. Poisonous frogs are brightly colored so predators will see them and recognize the danger of eating them. Others, like birds, are brightly colored to be more attractive to mates (hence the males being bright while the females are dull). Mammals began to lose the need for those non-verbal, color-based communication. Scents and pheromones communicate fear or mating interest. Audible cues can convey warning messages. Additionally, mammals' color patterns can help them blend in to their enviroments, making hiding from predators, or sneaking up as a predator, easier. Rather than use bright colors, some mammals do use visual patterns. Zebras, cheetahs, skunks, etc, all have similar fur patterns, which helps identify them to other members of their species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[META] thoughts on ELI5 and askreddit/askscience...",
        "response": "I disagree somewhat. I think that sometimes people take the 5 too seriously. Meta responses like \"I'll tell you when you're older\" and \"A five year wouldn't ask that\" when referencing anything remotely adult-oriented are utterly useless. Posts that start off with \"Well, Timmy\" or take on an excessive tone of condescension are just annoying. The goal should be explain in layman terms, it doesn't have to be explained in 5 year old terms. If someone asks about the financial crisis, for instance, you should explain terms like \"default\" and \"credit rating\" and other finance terms, but you don't need to replace \"money\" with \"candy bars\" - everyone knows what money is, and it just looks stupid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are sage and salt used to keep \"bad spirits\" out?",
        "response": "Centuries old connotations derived from folk lore and religion.  Salt is used to purify and preserve food, so it is seen to do the same in a spiritual manner. Thus you can purify an area with the ritualistic casting of salt in some belief systems, and impure things (such as ghosts) cannot cross a boundary line drawn in salt in those belief systems that believe in ghosts.  Sage is similarly seen to have properties of purity and cleansing power. Additionally it is associated with various gods that you end up entreating to aid you when you do the ritual cleansing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a large amount of barnacles attached to a whale affect him negatively?",
        "response": "I found this [online](_URL_0_)  \"For the most part, whale barnacles are harmless, even in astoundingly large numbers. For example, one humpback whale can host 1,000 pounds of barnacles without any problems. However, a few exceptions to the rules of commensalism can occur. On some whales, too many barnacles can cause drag. Minor skin irritations or infections may arise. On the plus side, the barnacles can actually protect the whales, like a suit of armor. Gray whales have been known to roll over when under attack from other whales, presenting their enemies with a back covered in hard, spiny, immovable soldiers.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are there more people in North America with allergies than in other parts of the world, such as Hong Kong?",
        "response": "One possible reason is that antibiotics are more common in the United States.  Source: _URL_0_ Another reason is that culturally it’s less acceptable in the US to let kids get dirty.  They aren’t exposed to as many allergens, so they never develop a tolerance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do flies smash them-self into the walls and ceiling?",
        "response": "Because they're dumb. They really don't have a lot of mental capacity. They just land somewhere, push their face into the ground, if it's food they eat it, and if not then they fly somehwere else. Add to this their horrible eyesight, which is only really useful for noticing large objects that try to squish them, and that's it really. In nature, they can easily do that. They might bump into a leaf or something, but who cares. They're so light it doesn't hurt them. And they breed so quickly, it doesn't matter if thousands die from being stupid, there are still thousands left.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long a distance when I'm shooting a rifle do I need to take the coriolis effect into account?",
        "response": "This was asked yesterday, and somebody posted [this](_URL_0_) as an answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Intermediate interbreeding populations?",
        "response": "Absolutely, it is [known](_URL_0_). It is expected that this is one of the major ways that speciation occurs. Your friend's definition of a species is the most common and probably the most useful one - but no definition is foolproof.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a flu \"season\"?",
        "response": "I think it has to do with the fact that during flu season it is generally colder outside, which cause people to be indoors more. If everyone is inside, it increases the chances of coming in contact with someone who has the flu. I think My virology teacher said something like that. Also new flu shots are needed each year because influenza undergoes antigenic variation, which is a type of mutation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can/do elements exist where electrons and protons are replaced with positrons and anti-protons?",
        "response": "The chemistry of antimatter should be extremely similar if not identical to that of matter. Any difference due to CP violation will arise from loop-level contributions, so will be tiny. This is very difficult to verify experimentally. So far only antihydrogen [^1](_URL_0_) and antihelium [^2](_URL_1_) have been observed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do all kinds of vertebrates have tails?",
        "response": "Evolution doesn't select for useful traits, but rather select against traits that reduces the chances of an organism to pass down their genetic material. So in the case of the pig it is possible that having a tail did not give them a disadvantage in term of survivability and thus chances to pass down their genetic material, whereas for humans having a tail might have some detrimental effect on survivabilty.  Hopefully this is somewhat helpful, I am sure someone else can answer your question better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do printers print white when the cartidges only hold black, yellow, cyan & magenta ink?",
        "response": "They don’t print white. They leave the white areas blank, which leaves the white paper exposed. If you printed the same design on colored paper, the white areas would show up as that color.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why cancer kills people?",
        "response": "These cells displace other cells. Say you've got a tumor in your lung. The tumor cells don't ever stop dividing- and they do it faster than your good lung cells. For whatever reason, your body doesn't recognize that it needs to get rid of those tumor cells, so the tumor grows and pushes out the good cells, like weeds over grow and kill plants. That lung tumor isn't just in your lung, either. Pieces can break off and travel to your heart and brain, where they'll grow and push out normal cells, without actually benefiting your body. Usually, people die because they couldn't sustain function with the few cells they had left. Cancer can also cause holes in tissues (like the heart) and cause ruptures, brain bleeds, and aneurysms. Tl;dr: cancer is like a weed that chokes out the plants you want without giving anything back",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the military still using 60 year old jet designs, when cars from the same era are already antiques? Why do jets seem to become obsolete so much more slowly than other complex machines?",
        "response": "The product cycle for aerospace in general, and military aerospace in particular, is extremely long due to cost and technology. If you're going to spend that much money you want to get the most use out of it and it takes a lot of new technology to overcome the cost barrier for a new product.  Nothing in modern use is in the same state it was when it was originally designed; most of those products have been getting periodic updates their whole lives. And some missions just don't need upgrading...the B-2 is awesome when you need it but when you just need to drop a lot of bombs a B-52 does just fine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is any particle possible?",
        "response": "Not any combination of smaller particles is allowed. Any stable particle must have no net charge under the strong force; that is, it must be \"color neutral.\" However, since only the quarks have colors and quarks can come in any of the three allowed colors or anti-colors, this isn't an issue as far as determining what kinds of composite particles can be built. Additionally, stable particles must have integer net electric charge; again, the only elementary particles in the standard model with fractional electric charge are the quarks, so this is a limitation on what kinds of particles can be produced. We can't, for example, have a meson made up of just two up quarks, since the result will have an electric charge of 4/3. I think there are other limitations as well, but I can't remember them at the moment. At the least, this gives a good gauge for what kinds of particles are not allowed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If humans colonize Mars, will our bodies (circadian rhythm, etc) eventually adjust to the slightly longer day?",
        "response": "actually, in experiments in which for a few weeks people didn't have clocks or windows so they had no idea what time it is, the people naturally went on a cycle closer to 24.5 hours (i can't find the study now) this wouldn't be the thing that people need to worry about on mars. the cold and lack of pressure are much much bigger hurdles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What goes on when a website is \"down for maintenance\"?",
        "response": "They are either updating and testing the code, they're fixing some problem that they've discovered, or possibly replacing some hardware (servers, networking stuff) that needs to be changed or replaced for some reason.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any organisms that live their entire existence in the air?",
        "response": "There are living bacteria in clouds. I don't think any are native to clouds, but I wouldn't be surprised if a fair number spend an entire generation (the duration of a bacteria's \"life\" is a bit hard to define) suspended in the air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that we can't use something to make our facial hair grow rapidly?",
        "response": "Don't worry, before long you'll be wishing there was something to slow it down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can butterflies remember being caterpillars?",
        "response": "Yes, and it's actually quite amazing that it happens at all. The caterpillar's body breaks down to reorganize into it's adult form yet does retain memories. This was discovered using your example, conditioning. Caterpillars were conditioned to avoid a scent and remembered it as adults. However, it seems events are more likely to be remembered in older caterpillars than younger ones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do distant neurons know to connect with each other to create new pathways?",
        "response": "Most synapses are formed during development and the number of synapses in humans peaks in early development. This process is largely governed genetically during development. This synaptic maximum is followed by a period of synaptic pruning that ends in adolescence. A lot less neurogenesis or synaptogenesis is taking place in the adult brain. Recent studies have shown that some does occur, in contrast to long-standing ideas that there was no neurogenesis in the adult brain. Synaptic pruning is associated with learning as is synaptic plasticity, which is the strengthening or weakening or synaptic connections, but I don't think that synaptogenesis has been associated with learning in the way that you are imagining. TL:DNR: The vast majority of synaptogenesis is developmentally patterned based on a genetic program and then from there synapses are pruned in childhood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does smoking a cigarette make me have to poop?",
        "response": "Cigarettes contain nicotine which in addition to being the main addictive ingredient is a potent parasympathetic agonist. Stimulation of the parasympathetic nervous system results in an increase in motility and relaxation (decreasing tone) of the gastrointestinal tract thus speeding up the processing of food in the gut and intestines. This buildup of feces in the colon increases pressure thus making it easier to relax the voluntary sphincters that cause defecation. This does not occur if smoking non-nicotine products (ie. Marijuana) since there is no nicotine present.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the atmosphere temperature affect how far a signal can travel?",
        "response": "There is almost no effect from temperature, but sunlight charges particles in the ionosphere and allows radio waves to bounce or skip between the atmosphere and the Earth's surface to travel long distances (mostly at shortwave frequencies, approx 2~28 MHz, or so)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our bodies first make us hungry instead of using excess fat?",
        "response": "Your body converts food to excess fat; this is for things like insulation, energy reserves, etc, before it begins to break down proteins and muscles. To convert food to fat, it has to first be digested then converted.  If it used the \"excess\" fat first, it would have to undo all of that. What that would imply is that it converts (requiring energy) food to fat, then convert it from fat to energy (again, not a 100% efficient mechanism, as the conversion requires energy). That is a wildly inefficient process, where it is much easier to say \"I'm hungry\" and eat, then convert the excess to fat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do SONAR systems actually produce such loud noises?",
        "response": "They use an array of giant transducers. When electricity gets passed through them, they vibrate and produce the “ping” that gets transmitted into the water. They are so loud that from the inside of the ship or sub, it sounds like a sledgehammer hitting the side of the ship.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does sleeping in class feel so refreshing?",
        "response": "Been awhile since I slept in class, but I can tell you a ten-minute nap in the middle of a workday feels like the greatest thing ever. As I understand it, there’s plenty of science to back up the benefits of a short midday nap. I think the key is you have to keep it under 30 minutes, or else you enter into a deeper sleep cycle, and then it’s a lot harder to wake up (and you’re much groggier when you do).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is double clutching? How and why do you do it when shifting?",
        "response": "Well, the alternative is granny shifting which, of course, will cost you the race against Toretto. Nobody wants that - but who can really blame you? He's the best there is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that my phone can record in HEVC (h.265) in real-time but my desktop takes hours to convert videos to HEVC?",
        "response": "Your phone has a specialized processor just for encoding video. While this is possible on the computer, it requires a combination of hardware and software that you may not have, so most programs just default to using your normal CPU which is slower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that two people in the same room will feel the temperature differently--one cold, even though he's wearing a sweater, and one warm even though she's in short sleeves?",
        "response": "The equilibrium temperature of our bodies depends on a multitude of factors. We generate heat through our internal bodily processes and heat is exchanged between our body and the surroundings through a combination of processes, conduction, convection, radiation, respiration, and evaporation (of sweat). People differ in size/weight/metabolic rate/etc, and they generate internal heat at varying amounts. So from a physical standpoint, certain people can be hotter or colder than others. But also comfort is very psychological based and a matter of preference.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The California Energy Crisis of 2000 and the Enron Scandal",
        "response": "As for the energy crisis, basically Enron would cut off the power supply so that the cost of electricity would skyrocket, and then turn it back on in order to make more money. Enron in general, that was mostly down to a type of accounting they used that let them declare potential earnings, so that it always looked like they were making loads of money when they were, in fact, losing money. I would recommend the documentary \"The smartest men in the room\" If you want to learn more",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(presumably) we could eat raw meat before fire, therefore why did we start/evolve to cooking meat food to the point it can poison us?",
        "response": "Raw meat is dangerous to us because we store and transport it for long times, which allows disease causing organisms to grow in the meat. Before cooking food we would probably have eaten the meat on the spot, which would have eliminated many of the threats we face from raw meat. However, wild carnivores are at high risk for parasites from eating raw meat, and presumably humans would also have been at risk. Cooked meat, and food in general, may actually be the reason why we grew larger brains. Cooking food \"pre-digests\" it, which means that our digestive system has an easier time extracting energy from food. Since brains are extremely energy expensive, this may have allowed our brains to grow larger, which would have been advantageous for our ancestors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many swimming pools not allow children to wear life vests, even if they are coast guard approved?",
        "response": "Because they aren't foolproof, but some people act like they are. People do drown wearing life vests sometimes, especially small children because they can't maintain their head above water consistently even with a life vest.  If you're putting a child in a life vest, clearly you know they can't swim, but for some reason parents will put a child in a life vest and turn their back on it for plenty long enough to drown - leaving it up to the life guards. The life guards are there to save lives under extraordinary circumstances, but if neglectful parents with poor judgment put kids in life vests and ignore them, the life guards are given too much to monitor and that endangers all the swimmers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't our immune system attack & kill off our gut flora?",
        "response": "Because the inside of your intestine is technically outside your body, where the immune system for the most part isn't present, and also because the intestinal microbiome participates in regulation of the immune system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The star cycle, as I understand it, goes from a young, bluish star, through to a white, then yellow, then orange star, then a red giant. Why doesn't it become green?",
        "response": "Because the 'color' has to do with predominance, they're not a solid color like a crayon. Green's right in the middle of the light spectrum, so it's at the 'peak' of a bell curve of colors, with an equal amount of spectrum on each side, [so it looks more 'white'](_URL_0_) than green.  As you get further to the edges, the color gets more skewed, so it's more visible. Note that in your list, white falls in the middle -- that's where green should be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the science behind Bosley and other hair restoration services?",
        "response": "Your body has different types of hair follicles in different places. Follicles are basically little spots in your scalp or elsewhere on your body that produce new hair.  The most common type of baldness is male pattern baldness, which affects only the top part of the scalp. There is a hormone in your body called DHT that over time will stop the follicles on top of your head from growing hair (when you suffer from male pattern baldness). All of the hair follicles in your scalp get exposed to it, but the ones on the side and back of your head are resistant to its effects.  This is why when you take a hair follicle from elsewhere on the body (like the back of your head) and transplant it to the top of your head, it won't eventually stop growing hair like the original follicle did. Even though it's been moved, it is still resistant to DHT. There are a lot of other factors involved and other types of baldness, but that is a simplified explanation of what's going on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are PhDs and medical doctors all called doctors when they do completely different things?",
        "response": "The term \"doctor\" originated for university graduates generally. In English, we came to associate it with a *doctor of medicine*, but doctors of law, philosophy and theology have been around for centuries. The precise term for a medical doctor is a *physician*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does placing a plastic bag over a credit card help a device read its magnetic stripe better?",
        "response": "The best demonstration I've seen about this is drawing black ink strips on a piece of paper, like a bar code. If you smudge it with your finger, then between the black bars there will be lots of intermediate shades of gray. However, if you put another sheet of paper over it, it will be easy to see the solid black bars and the bits of gray in the middle will disappear.  Switch the ink out for magnet card stuff, and that's a pretty simple approximation of why it works.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the brain divided in two parts?",
        "response": "This is due to something called \"bilateral symmetry\", a basic body plan that developed extremely early in our evolutionary history. It probably comes down to the benefits of having a spare organ in case of injury, such as a extra arm to feed oneself or an extra eye. Greater levels of symmetry have developed as well but having two seems to avoid an injury being invariably fatal while not spending too many resources on redundant features.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If most Muslims disagree with the actions of violent fundamentalist extremists, why isn't there a stronger reaction against it?",
        "response": "Many Muslim leaders in the Middle East have spoken out against these extremists, even from the huge Islamic university in Cairo (the name escapes me at the moment). They have even said that those like ISIS can no longer even be considered Muslims. It's just not publicized much in the West.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Zinc, iron and copper are heavy metals. Does the body ever fully heal from poisoning of these metals?",
        "response": "Just because something is a metal, and in the general sense \"heavy\" does not magically make it a \"heavy metal\". Heavy metal poisoning generally refers to lead, cadmium, mercury, and arsenic. your body CAN excrete zinc, copper, and iron, and of course you need a certain amount of these metals in your body to live. Iron is a very important part of your blood, so you don't die.  A distinction must be made between normal dietary levels of these metals, chronic toxic levels, acute toxic levels, and excretion disorders.  Copper, Zinc, and Iron have very *low* toxicity, so you really need a heck of a lot of iron (or copper or zinc) *or* an abnormality in how your body disposes of excess metal. Wilson's disease causes a buildup of excess copper, for instance.  tldr; those metals are not \"heavy metals\" and are not \"toxic\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the origins of the saxophone?",
        "response": "It was created by a man named Adolphe Sax. Long story short, it was created as a bridge between brass and woodwind instruments in french military bands in the 1800s. Sax started at the lower end with bass saxes, and he then went on to create tenor, alto, soprano, and all other crazy sizes! If you're interested, there's a book called \"Devil's Horn\" (I'm sorry I don't remember the author! ) about the history of the sax and it's place in music. It's fasinating!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In order for the world to progress, there is an urge to clean our oceans and stop overfishing. How do we do it?",
        "response": "There is an urge to progress? People are polluting because recycling and cleaning are expensive; we are eating all of the fish because we're hungry. When there are almost no more fish, and the ocean is too dirty to use, people will try and clean it up, even if its harder to do then than it would be starting now. The problem is that while some people want to do whats best for the future, others what to do whats most profitable today, so exploit common resources. No one really knows what to do about it. If you feel strongly, start a business collecting and recycling floating plastic, or maybe inject mercury into deep water fish in a seafood market to scare people off eating them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a seed \"know\" when to start growing?",
        "response": "It knows when it reaches a certain temperature and light. It will need a drink of water when dry they get thirsty too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't Asian countries being terrorized on the same level European and American countries have?",
        "response": "1) Most do not have global influence either economically or militarily. They may be major powers locally, but only 1-3 depending on how you define things has any type of reach beyond the local region.  2) With the exception of South Korea the Asian countries all keep fairly tight control on their news networks so even if they did have terrorist attacks it is not likely that the outside world would hear about them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Magnets and Compasses",
        "response": "Opposite polarities of a magnet attract. Take a bar magnet and hang it on a string. The north end of the magnet points north. For the north end of the magnet to be attracted toward the north direction, there must be a south pole in that direction. The north pole is actually magnetically south. So the north end of your compass will also be attracted to the south end of a bar magnet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The feeling in my throat when im holding back tears",
        "response": "When you're about to cry, your brain detects that your body is under stress. It automatically sends signals out into your nervous system, including one to **increase air intake**. The opening in your throat that leads down to your lungs gets wider, to accommodate deeper breathing and so on. The shaking feeling is possibly down to your swallowing muscles spasming against the opening muscles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the _URL_0_ door knocking audio clip do such a good job of making it sound like the audio doesn't come from your headphones?",
        "response": "Ha, had the speakers on when I played that audio clip and the cat **freaked** out. Apparently that knock knock fools animals into thinking someone's at the front door too. Your brain determines the location of a sound's source by a few different factors. Namely, distortion differences between each ear, and delay in which ear hears the sound first. Technology has gotten good enough that with proper equipment it can re-create those effects and trick your brain. We usually use the term \"binaural\" as in \"Two ear\" to describe the effect. One of the most famous examples of binaurual audio is the \"Virtual haircut\" clip _URL_1_ where they demo a technology designed to create the effect. Lots of ASMR artists and other people do it too, one popular device these days is [a 3Dio twin mic setup such as this](_URL_0_). With two microphones and extremely accurate recreation of the human ear shape (it affects how sound bounces about), you can recreate a whole room's soundscape effectively.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is energy of matter quantized?",
        "response": "Well, an extremely unsatisfying answer is that when you solve the relevant equation (Schrodinger's equation) you get that there are only certain energy levels allowed. That's just the way the math plays out. Kinda like how 2x+1=5 allows just one value of x, except that these equations are considerably more complex (although not THAT complex-- there's no reason a high-schooler couldn't understand the particle-in-a-box problem, for example). But, to maybe help make this more accessible, keep in mind that this quantization isn't just a quantum effect. Take a rope, nail the two ends down, and solve equations for what it can do; you'll see that it follows the same quantized pattern as quantum-mechanical systems. It's that end-nailing, and its imposing of what are called \"boundary conditions,\" that gives you discrete energy levels, not anything specific to quantum mechanics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the start of world war 1 really as stupid as it seems to me from my understanding of it?",
        "response": "[The FAQ has many good answers about the causes of WWI](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I am a policeman in Victorian London before the dawn of forensic science. How to I go about solving a murder? What are my chances of success?",
        "response": "## From the FAQs: ## **Topic Overview with several good threads:**  [Crime and punishment in the past](_URL_1_) **One comment related specifically to Jack the Ripper:**  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do Chefs Do? Do they cook the food I eat? Tell others how to cook?",
        "response": "1. Food network is divorced from reality. Those guys step in to film and then screw off to the juice bar. Depending on the size of the restaurant/company chefs may be cooking every day, just management or conceptual chefs. Or somewhere between. There are different levels of chef. Chef de partie is the boss of a station, chef de cuisine is the boss of the kitchen, sous chef is the second in command, executive chef is an abused title which essentially means corporate or conceptual chef - but now everyone with a white jacket throws that around to inflate their worth. I'd say as a rule, the higher you are on the ladder, the less you actually cook. You tend to stand at the pass and look over things or plate food, rather than actually cooking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If China is a communist state, why are there so many multi billion dollar companies and free markets?",
        "response": "Modern China was founded with communist principles in mind. But after Deng Xiaoping took power, he decided to move China toward a more capitalistic economy. But the Communist Party still rules China and therefore they still are labelled \"communist\". Similarly, the US isn't completely capitalistic because there are government regulations and also government-owned businesses (such as the post office). It's really a label more than anything else. EDIT: Another thing to point out is that a lot of those \"billion dollar companies\" are actually owned/operated by the Chinese government. For example: Industrial and Commercial Bank of China. They have branches in the US now too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why if I drink salt water will I become dehydrated, but if im dehydrated they will give me an IV of a Sodium Chloride mixture?",
        "response": "Your body actually contains a decent amount of salt, and in fact you need that salt to be there in order to survive.  But the concentration of salt inside your body is far lower than the concentration of salt in sea water. Sea water has so much salt in it that your body cannot effectively use the water, and enough salt in it that the body cannot filter it out and discard it before it starts causing problems.  The relatively small amount in your IV is useful to your body. The relatively large amount in salt water is very bad for your body.  There are many things that are fine or even helpful in proper doses, but which become very dangerous in large amounts. Even plain ol' water can kill you if you drink enough in a short period of time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The rules of Cricket",
        "response": "Marvelous game, really. You see, the bowler hurls the ball toward the batsman who tries to play away a fine leg. He endeavors to score by dashing between the creases, provided the wicket keeper hasn’t whipped his bails off, of course. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What newspaper article is being read at the end of the movie Dunkirk?",
        "response": "It was a reprint of Winston Churchill's famous \"we shall fight on the beaches\" speech, which you can read [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the 2016 elections, why are the Democrats aiming to take the Senate but not the House of Representatives? Would it not be beneficial to aim for both?",
        "response": "It would be beneficial, but taking the Senate is much more likely due to the lower amount of vulnerable seats in the House.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do hamsters find hamster wheel so fun?",
        "response": "In nature, hamsters have large territories and are largely solitary dwellers. We keep them in tiny cages and often with other hamsters, which goes completely against their nature. They would naturally run around marking vast territories (which accounts for their strong odor), mating prolifically (because they are food for lots of other animals), and generally being rodents. When they hop on the wheel, it lets them at least vaguely fulfill their natural need for running some distance. It's not much but it's all they have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does Vaseline or similar products mean by: “Petroleum Jelly”?",
        "response": "The product is a jelly made from petroleum. It’s literally in the name. It originally was a byproduct of oil drilling that built up on the rigs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that when all other species show their teeth it is an act of aggression but when humans do it, it's a friendly gesture?",
        "response": "The smile evolved in primates approximately 30 million years ago, humans got it from there.  Evolutionary biologist think it evolved from a submission response. IE it used to be a I submit to you, co-opted to an I approve/am happy.  What does this have to do with teeth? The submission response was in turn an adaptation of a fear response.  I am scared of you, so I submit to you.  Many fear responses involve the bearing of weapons or making yourself seem bigger, see cat's arching backs or hissing.  TL:DR: used to be fear look - > submission look - > approval look.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are ice hockey players allowed to beat the shit out of each other?",
        "response": "So that the aggression is not taken out dangerously against the boards with two players traveling 30mph.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If birds are descended from dinosaurs, why are they warm-blooded?",
        "response": "\"If mammals are descended from reptiles, why are they warm-blooded?\" Answering a question with a question. ;)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone provide any information or sources on the history of food storage?",
        "response": "Well in the US from the peak of the railroad in the 1800s until the widespread adoption of electricity and refrigerators, ice boxes were used. There was a whole industry around producing and harvesting ice blocks in colder climants. The blocks were shipped via insulated railcars and then distributed by delivery men. The ice box was essentially an insulated cabinet where you put the block of ice and stored your perishables in with it. I think before the industrial revolution, for the most part, food would have had to been presevered to keep. Things were eaten quickly or made in to preserves, smoked, salted, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Lincoln say \"All men are created equal\", not \"equally\"?",
        "response": "All men are created equally, implies that there is something about the act of creating men that he's addressing - how were they created? They were created equally. All men are created equal, is a description of the men. What are the men like? The men are all equal",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Two bodies of water meeting and not mixing",
        "response": "To mix, some force needs to actually mix them. If the two liquids (yes, they are both water, but there's other stuff in there too, and they can be different temperatures too) then the denser one will stay on the bottom and the less dense one on top since it would float.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "They say the fool/court jester was the only one allowed to tell the king the truth/insult him to his face. Is this even remotely true?",
        "response": "Hi there! Jesters seem to be a pretty common topic for questioning around here and in fact show up in our beautiful FAQ.  [Jesters!](_URL_1_) [Bonus Jester question not in FAQ](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it more fuel efficient to turn off your vehicle for 1 minute then start it up again or to just leave it running?",
        "response": "leave it running, you spend a lot of gas on start up. If its like 5-10 minutes then turn your car off, but if its literally a minute then keep it idling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "when someone else starts puking why does it gross out others and make them want to puke?",
        "response": "This is an automatic response people have. Likely it have allowed people to live longer as puking is a natural response to being poisoned and when one member of a group have been poisoned the rest of the members of the group have also likely been poisoned as the group tends to eat the same meals. So when one member starts puking other members of the group who also puke even before presenting other symptoms of being poisoned will have a better chance of survival as they might get rid of the poisons in their stomach. However other members of the group who do not show this behavior may digest more of the poison and could die from it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is passive voice almost universally looked down on? (no pun intended)",
        "response": "It depends on the style of writing. Passive voice is the norm in many types of technical writing. However, passive voice is generally frowned upon in writing intended to entertain (such as fiction or journalism) because it has a distancing effect for the audience. You end up with a bland chronicling of activity rather than being thrust in the middle of the action.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many doors have those indentations/panels on them?",
        "response": "The type of door in your photograph is called a \"six-panel door\". The design is today something of an anachronism, but originally the panels would be separate pieces of wood set within a robust \"lattice\" of wood frame members.  This design allowed each of the structural elements to expand and contract independently in response to changing temperature and humidity, which helped prevent the door from warping, and ensured a better seal around the door-frame. Today most six-panel style doors used in residential construction are made out of an aluminum shell filled with insulation, making the six-panel door an example of skeuomorphic design.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When the US set up the 100:1 discrepancy between Cocaine and Crack sentencing was it recognized that the effects would be racially biased? Was the decision itself racially motivated?",
        "response": "I though one reason for the disparity in punishment was black activists pushing for harsher punishments, as they felt the government was purposfly doing little to end an epidemic problem in their communities. Could someone tell me if I am wrong or misinformed ?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a limit on the number of radio telescopes that may be networked together?",
        "response": "Check out _URL_0_ the first cluster of radio telescopes called 'Meerkat' has been completed in Carnarvon, South Africa, and is already gathering data. This huge network of radio telescopes will be completed in the next decade across several countries around the World.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Billion dollar a year aid to Egypt",
        "response": "The aid is military aid, and it doesn't come in the form of cash, but rather credit to buy American weapons. It's purpose is to maintain political stability in the region in order to maintain oil supply and protect the canal. It's secondary purpose is to maintain the military industrial complex; in order for the weapons manufacturers to stay a float(and be ready for war) they need a constant supply of contracts. The money comes from American tax payers... Obviously.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some TV stations \"bleep\" out profanity while others just cut out the audio and other actually replace the profanity with other words?",
        "response": "It depends on the movie studio. Some require them to dub while some require them to cut it out, I have never heard of/experienced them beeping it out for modern movies (mainly for late night talk shows). When required to dub, some do intentionally make it a poor quality (obvious) dub and hilarious as well, like with Snakes on a Plane and The Bug Lebowski.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come touch screens only work when they come in contact with skin and not other things?",
        "response": "Most touch screen sense the increase in capacitance when something conductive gets very close to the screen. Metal or conductive rubber can also affect touch screens.  Edit: Capacitance is a property of capacitors. Capacitors are made of two conductors separated by some insulating material. The screen has two independent transparent layers of horizontal and vertical lines. A finger adds to the capacitance on the lines. The position is determined by measuring the capacitance and finding the lines with the highest values.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I often hear the humans can outrun/outwalk a horse over long distances What was a typical daily/weekly travel range of pre-mechanized cavalry unit vs that of an infantry unit? Is there any work that compares these numbers between different cultures?",
        "response": "If I could add to this: What about just normal couriers (a single runner vs. a single horseman)? Also, any info on merchant travel times? A man, his wares in a cart, and his oxen/horse, what kind of time would such a person make while traveling.   I suspect these questions along with OPs would all be answered by the same person so hoped to throw a little more into the pot. Thanks!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you have a rod of material a lightyear long with a button at one end, and you pushed the other end, why does the button at the far end not get pressed at the same time you push the other end? (Picture in description)",
        "response": "No material is inflexible. A push through a solid moves at the speed of sound in that material. An impulse through [boron](_URL_0_), which has the highest speed of sound that I can find, would still take 18399 years to propagate a light year.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How historically correct the Asterix and Obelix book series were.",
        "response": "To about the same degree that Tom and Jerry is a documentary about mouse and cat interactions. Some broad facts about gaulish and roman culture are there (e.g. the fact there were druids, there was a great chief called Vercingetorix, the roman outfits were pretty accurate).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How often could pre-modern medieval peasants eat meat?",
        "response": "The 1000 year medieval period is marked by revolutions in agriculture, including:  * invention of mortar board plow * inventions in animal harnessing leading to productivity leaps * shift to 3 field tillage * development of varied cereal crop types * expansion of water-driven mills * expansion and enforcement of exclusive rights of nobility to hunt * development of fish ponds  All of these lead to significant changes over time which affected animal husbandry, farming and the general peasant availability of and access to meat. I'm going to ask you to be more specific about what period you mean by 'medieval peasant'. It changed *a lot*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is intelligence in humans hereditary?",
        "response": "[This study](_URL_0_) was able to put a lower bound on the heritability of human intelligence at about 40-50%.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you’re tired, why is it harder to keep your eyes open than it is to walk?",
        "response": "Being physically tired and sleepy are different things. Being sleepy is like your brain being tired, not your muscles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people weigh less in the morning compared to the previous evening?",
        "response": "Lose lots of water by breathing and perspiration. Many people don't realize just how much water is lost through breathing, but it is actually a very significant amount.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do express drug tests work? How are they made?",
        "response": "Basically, they work by a technique called ELISA. An antibody designed to fairly specifically bind the drug of interest is linked to something that produces a visible change (such as a color change). The antibodies are made by injecting animals with large quantities of the substance you wish to detect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a water spout form?",
        "response": "A water spout is not rising vapor. A water spout is a tornado and forms the exact same way: the thermal energy in a front of warm, humid air powers a rotation along the boundary where it meets a body of cooler, dryer air. When a section of this rotation separates from the overhead cloud layer and the free end contacts the ground/water then a tornado/waterspout is formed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the rules/beliefs associated with Postmodern Ethics?",
        "response": "A great summary is [here.](_URL_0_) Postmodern ethics suggest that there is no absolute standard of right and wrong, but rather, we choose to adopt such standards either through personal decision or through group (society) decision-making. These may be due to pragmatism, due to tradition, due to a religion we have adopted, or some other reason -- but the core concept is that *there is no absolute right and wrong, just a system of values we have chosen.*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the banking system like in medieval times?",
        "response": "The question covers an astonishingly diverse time period and area. Narrowing the focus will produce better answers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it better to brace your body or stay loose in an accident/fall?",
        "response": "Obviously every crash is different and some things will work better in one situation than they would in another, but the brace position in an aircraft crash, or bracing against a car seat have a very specific purpose. In any collision there are multiple impacts. In an aircraft crash there is the impact of the plane hitting the ground, you hitting the inside of the plane (seat, floor, controls, whatever the object is), and your internal organs (biggest concern being the brain) hitting the inside of your body. The brace position is an attempt to remove, or at least lessen, the second of those impacts: you hitting the inside of the plane. By placing your body against the seat in front of you, or against your legs (depending on the position used) you are already against the object you are likely to hit and will therefore push against it instead of impacting it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Best of June Award Winners",
        "response": "Woo! This means more to me than receiving an entire year's worth of tribute from Tochtepec! Thanks to all who voted and to all the other candidates who wrote up fantastic answers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Discretization of Space-Time",
        "response": "No. There is no reason to believe that space or time (or both) is quantised, and basically no way to make sense of the idea that they are. The Planck units are valid and, occasionally, useful units of measurement. They are not fundamental truths of nature. They're just ratios, and ascribing profound mystical significance to them basically amounts of numerology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I want the most accurate reading, should I have my outdoor thermometer in the sun or in the shade?",
        "response": "The shade will give you the most accurate reading for the air temperature. If you put it in direct sunlight, it would head up via radiation, possibly beyond the temperature of the air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What native societies made it through the \"scramble for Africa\" without much traumatic change? Why?",
        "response": "Not sure if this answers your question, but the African country of Ethiopia remained independent for several centuries until four years before the outbreak of World War II, much after the Scramble for Africa (and even then, regained independence shortly after World War II began). In the 1890s, [Italy tried to gain control of the country](_URL_0_), but they failed. By the start of World War I, only Ethiopia and Liberia were independent in Africa. (Liberia technically was colonized by returning slaves from Africa, so they were in essence, the first \"colonial power\".) EDIT: As /u/WhenTheRvlutionComes has said, Ethiopia definitely went through major changes. However, it certainly faired much better than its compatriots who were practically forced into poverty by their colonial rulers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Hexagonal water; does that term even mean anything? Is there any truth at all in this claim?",
        "response": "No. There is no truth to this whatsoever. Water is two hydrogens, and an oxygen. The shape they make is ^ (less of an angle though). The pointy bit of water (the oxygen) is - charged, and likes to stick to the bottom parts (the hydrogens) because they are + charged. But these interactions are constantly forming and rearming no matter what water you have. A 5 or 6 sided water molecule just doesn't exist. A few water molecules may associate with each other for a billionth of a second, but that's it.  EDIT: besides, crystalized water is...... ice",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't they make contact lenses that act as sun glasses? Is it possible?",
        "response": "There's nothing stopping you from having tinted lenses. They actually do make tinted lenses for people who have trouble seeing colour correctly, to help then distinguish shades. However I imagine the main problem is that you can't easily take off contact lenses, so unless you know you're going to spend all day outdoors they might become annoying.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big were the waves on Pangaea?",
        "response": "Waves are generated by wind blowing on the ocean. There are two main factors: 1) the speed of the wind and 2) the distance over which the wind acts, i.e. the 'fetch'. I'm not aware of any reliable estimates for wind strength during the time of Pangaea. There are scientists who run atmospheric circulation models for alternative continental configurations such as Pangaea but I doubt we could say with much certainty that the winds at that time were either significantly stronger or weaker.  That leaves the issue of fetch. In general, the greater the distance the wind blows over, the bigger the waves but that only holds up to a certain point - about 1000 km. Beyond that the waves are fully developed and additional fetch doesn't lead to bigger waves. The Pacific is about 10,000 km wide so it already exceeds this critical limit. Therefore I don't think there is a strong reason to believe that the waves at that time were any larger than what we see during big storm events now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people figure out how old ice is?",
        "response": "I took many geology classes so I might be able to answer this with my limited knowledge! So basically they extract something called an ice core. They have this super long drill that they use to drill deep down into the Antarctic ice shelves and extract a huge long cylinder of ice. They then analyze the small air bubbles that have been trapped in the ice and use Carbon-14 dating to make an estimation of how old it is. Very useful to determine what the atmosphere was like and what kinds of green house gasses were around.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is abstract art (such as Picasso's) considered an 'art'? I feel like I just don't 'get it'. People pay millions for works of Picasso I could replicate in minutes.",
        "response": "You *could* replicate it in minutes, but Picasso wasn't replicating anything. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Nazis learn other languages prior to invading countries or did they employ translators? For example, did a few soldiers get made to learn Czech before they annexed Czechoslovakia?",
        "response": "Czechoslovakia actually has cohabited by Germans Czechs Slovaks Hungarians Ukranians Polish etc for a very long time. After World War I and the sudden decline of the Austro-Hungarian monarchy, the newly found Czechoslovakia had more germanspeaking inhabitants than slovak ones. When Germany invaded there, Prague, Brno and the some other areas were still mainly german, but obviously people also spoke czech, the same goes for some parts of Poland. Unfortunately I don't know about the other countries invaded.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are the different strains of marijuana different? How are they grown/modified to be different?",
        "response": "Just to throw some confusion on the fire, there's also Cannabis Ruderalis. It's native to eastern Europe and central Asia. Because of the low THC content though, it's not really consumed recreationally. I have read that it has been gaining popularity as a hybrid with outdoor growers for it's pine like taste and the natural ability to withstand frost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the high middle ages, why didn't independent dukes simply declare themselves king?",
        "response": "It obviously depend from place to place. For example in England at the time of the Saxons there were plenty of little countries, whose ruler did take the title of king. The countries that were created in the spanish Reconquista (Navarre, Castille, Leon, etc.), were all governed by a King, more or less self appointed. In other places in continental Europe, where the authority of the Pope or of the Emperor was stronger, a ruler would have to ask his overlord about changing his title. For example Roger II of Sicily, Count of Sicily and Duke of Apulia and Calabria, was able to ask the a Pope to transform his domains in the Kingdom of Sicily (after a series of wars and after his son captured the Pope in battle !).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does salt and ice make it colder, but at the same time when you put salt down on snow, it melts it faster?",
        "response": "Putting salt on ice doesn't make it colder or change the temperature of things at all. It only lowers the temperature required to make water a solid, which is why ice begins to turn back into water (it's not cold enough anymore).   If you're wondering why you mix ice and salt when using things like an ice cream churn, it's because having 32 degree Fahrenheit (or less) water helps by creating more contact area with the ice cream tub. So by having literally ice cold water, it helps freeze the ice cream faster than having ice cubes stacked around it with minimal contact.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Africa so full of violence?",
        "response": "One answer: Its all the fault of white people. That answer is allowed, indeed encouraged to be said in public. Other answer: Its all the fault of black people. That answer is racist, and may get you arrested in some places. At the very least, sacked from your workplace. Another answer: Its complex, and multifacited. Nobody has time for that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our extremities :prune: in water but not our face, backs, legs, etc.",
        "response": "Current theory is that wrinkled skin on your fingers and toes gives you a better grip underwater, or on wet surfaces in general. This wouldn't be a useful trait on those other areas you mentioned. Evidence for this is backed up by showing that people with damaged nerve endings in their hands and feet don't get wrinkled up when they are wet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do companies like Gazelle buy old and broken cell phones?",
        "response": "Used electronics contain (trace) amounts of valuable metals and minerals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How practical is it to duel wield guns?",
        "response": "its pretty terrible. Especially since pistols are already difficult enough to shoot straight",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "As I understand it, the sky is blue because shorter wavelengths are scattered by the atmosphere moreso than longer wavelengths. If the blue rays are scattered in random directions, how do they reach our eyes?",
        "response": "Question 1: Some of the light from the Sun that was originally headed in another direction is scattered toward your eye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Roman Empire develop when Hadrian was emperor?",
        "response": "If may ask for a bit of clarification, what do you mean by “develop”?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so hard to put socks on after a shower or getting out of a swimming pool, even though you dried the feet?",
        "response": "The pores of your feet open when exposed to water for long periods of time. This causes water to continuously come out of your pores, which is why you'd usually have to towel yourself a couple times after showering. Once the moisture is expended from your opened pores and they begin to close, your skin overall becomes very dry.  Returning to your question: your socks stick to your feet because your feet are not fully dried yet. The fabric absorbs the remaining water from your pores as you tightly wrap it around your foot and ankle, causing more friction between it and your skin. This ultimately damages your feet soles, and commonly causes a condition called eczema (dry, breaking skin).  To avoid this, you should properly dry your feet, and then remoisturize them with a good lotion before putting on socks.  Hope this was informative :) I tried to not use big worded terminology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your throat hurt when you are sick?",
        "response": "Not sure how true this is off pain but many symptoms are caused by your immune response Once a pathogen is detected by an immune cell they release a bunch of signalling molecules (cytokines and chemokines) to attract other immune cells and mount a response. The immediate innate response causes inflamation which = redness, swelling, heat and pain. These are mostly caused by increased local blood flow. I guess a sore throat is probably caused by some sort of process like this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do kittens go into a state of paralysis when grabbed by the scruff?",
        "response": "you can also use scruff training for teaching discipline, but only for kittens not adult cats. I wish I'd known this when I adopted mine as kittens. My 3 cats are all rescues, grew up with no mum so they have a bad habit of biting, nipping & generally bratty behavior that kitty mom would discipline out of them. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do you need to bring your temperature down?",
        "response": "A normal fever doesn't need to be brought down and has some value because the elevated temperature causes immune responses to function quicker and causes some germs to function worse. However, a very high fever is not a normal response and means that something is going seriously wrong in the body. Excessively high temperatures (over 104 degrees) cause the brain to begin to die, so the temperature needs to be brought down to prevent this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does sitting on a toilet for too long make your legs go numb, when sitting in a chair does not?",
        "response": "There are a few factors at work here : Moſt chairs are deſigned to ſit at about knee height ; they generally ſupport your back, and more importantly, your butt and legs.   Toilets are uſually lower, and they are made with a large hole in the middle, into which you ſink a little. This lower height, lack of ſupport, and ſlight ſinking cuts off the circulation of blood to your legs, cauſing them to fall aſleep.  One other important thing to note is, that when ſitting on the toilet, people tend to hunch over, which compreſſes the nerves, hindering the blood flow to the legs and feet. Sitting like that is actually not very good for you, or for your bowel movements—the beſt way to do your buſineſs is to ſquat, but moſt toilets in the Weſt don’t well lend themſelves to this manner of uſe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is airport security looking for in liquids, and why are some liquids treated differently than others?",
        "response": "Did you have your name on the medicine? Basically, there has to be a little give and take, some people *need* to take liquids on a flight",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since dolphins breathe through their blow hole, how do they make noises with their mouth?",
        "response": "Dolphins fall under toothed whales, called odontocetes. One of the differences between toothed whales and baleen whales is their number of blow holes. Toothed whales have 1 blow hole while baleen whales have 2. The \"missing\" blow hole is a highly specialized structure called the monkey lips, also called phonic lips. These vibrate to produce high frequency sounds like those used for echolocation. This sound is amplified and focused by the melon, an oily tissue above the rostrum (beak), which functions as an acoustic lens. Vocal cords in dolphins are not known to have a function. They can make noises with their mouth, but it's from snapping their jaws shut.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Neurotransmittors (such as serotonin, dopamine, oxytocine) causes us to feel something when they bind to a certain receptor (mood changes, etc.), but what does this lead to? What happens that makes us feel that way?",
        "response": "They bind to a certain receptor. What you are feeling is your brain responding to chemical interactions. There is no magical part of us that \"feels\"; it's all just our brain doing things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Old English more German or Danish?",
        "response": "This is more of a linguistic question, but English and German are both West Germanic languages, while Danish is a North Germanic language. So, English is closer to German than Danish. In fact, Low German is, next to Frisian, one of the closest languages to English, as all three are part of the Ingvaeonic subset of West Germanic languages.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How websites like QuiBids that sell MacBooks for $70 make money",
        "response": "The price of the item starts at $0.01. Now, let's say that you want to bid on the item, which raises its price to $0.02. You don't just say, \"I bid on this item.\" Instead, you pay $0.60 to bid on that item (you \"buy bids\"), and that $0.60 is non-refundable. So now a bunch of people have bidded up the price of the item. Let's use your example of a MacBook selling for $70. Various bidders have paid $0.60 to raise the price by a penny 6999 times. That's $4,199.40 in non-refundable bidding fees. The winner then pays $70 for the Macbook. So all told, Quibids has made $4,269.40 on the MacBook auction, but it *looks* like a good deal because the final price is $70. This ignores the fact that the people who lost the auction collectively spent thousands of dollars in fees.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible there was life on Mars long before there was life on earth or would that just make for good science fiction?",
        "response": "Yes, it is possible. We have no evidence at this point, however, to support such a hypothesis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly do finger and toe nails grow? How does the nail visibly move, and carry marks like bruises along with it, while staying completely attached to the entire nail bed?",
        "response": "It's kind of like a suction cup. The nail makes a good seal(see [hyponychium](_URL_0_)) with the skin below that makes it hard to pull off. Ever slid a suction cup along the glass? It's easier than pulling it straight up. The nail slides along the skin below in a similar way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How likely is chicken to actually have salmonella?",
        "response": "> Annually, non-typhoidal Salmonella causes approximately 1.2 million illnesses, 23,000 hospitalizations, 450 deaths, and an estimated-$365 million in direct medical costs in the United States. [CDC](_URL_0_) An otherwise healthy young man or woman might just get the runs from eating undercooked chicken, but children, the elderly, and anyone with a compromised immune system are at increased risk for serious illness if they ingest even a small amount of salmonella bacteria. Different strains of salmonella can be drug-resistant as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Muscle Atrophy. Or how muscle loss happens in general.",
        "response": "Much of the body has a \"use it or lose it\" behavior. Muscles need vital energy, so if the muscles aren't being used, the body will prevent some losses of energy by not rebuilding muscles. Whereas, when you work out, the things like lactic acid that build up from muscle waste (the burn you feel, when you 'feel the burn'), also signal the body to rebuild muscle in greater amounts. So, since you did use it, you might need some more for next time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did primitive humans deal with bone fractures?",
        "response": "assuming we are talking about homo-sapiens and not some other hominid, they would basically do the same thing we do.  If they could they would rest until it healed (that is if the infection didn't kill them), they probably would have the bone set incorrectly or poorly leading to a limp or other problems. They would then need the help of their tribe to get them through life. If life got too hard, and the tribe couldn't help them they would most likely die. There is nothing special about our modern human healing ability, they have found ancient skulls where people have done brain surgery and the patient likely survived. Humans heal pretty well if they can avoid getting infections, and even in poor circumstances humans can survive an awful lot of punishment. Short answer: they would heal if they could, die if they couldn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can we not re-freeze something after it has thawed?",
        "response": "If you mean food, you _can_ refreeze it, and assuming it was defrosted safely you could even thaw it, cook it and eat it without a problem. However, freezing has the effect of bursting cell walls (the water in each cell expands), which can cause a deleterious change in texture. This is especially noticeable in meat. Freezing once doesn't normally make things too bad, but twice will make the meat somewhat mushy and unpleasant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if you forced yourself to stay awake for a week?",
        "response": "I think it's dangerous. I used to have mad insomnia. I had to take a pill to force me to pass out and fall asleep. I once didn't take it for 3 days. On the third night, I honestly had some crazy hallucinations. It looked like the chairs in the room were dripping sand, the books were made of snakes, the computer's wallpaper's planet looked like it was spinning. There was also a map of Skyrim up on the wall, and when I shifted my eyes, the map streaked across the wall. It's weird stuff. It's also highly unhealthy and makes you feel sick. Hallucinations: 10/10. After affects: 0/10. Don't recommend.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does semen sort of solidify when it reacts with water?",
        "response": "_URL_1_ _URL_0_ The process has less to do with protein denaturation per se and is more so a regulated mechanism analogous to the coagulation of blood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Ayn Rands fiction taken as a guide for politics and economics by so many?",
        "response": "The funny part is that Rand isn't any more conservative than she is leftist (and she isn't very much of either). I guess she's associated with the right because her economic opinions are more well known than her social ones, and those, in a cursory glance at policy suggestions, fit right-libertarian more closely than any other well-known political philosophy. But she was a stringent atheist and Atlas Shrugged is as harsh on religious institutions as it is on socialists. Her positions on sex, personal relationships and charity are decidedly not right-wing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we care if species go extinct?",
        "response": "Once a specie go extinct, it will NEVER come back.  **Earth** is the **only** planet that we know of that has millions of animals of different kinds, who live and thrive here. If animals were to go extinct all the time, we would kill out the planet, we are literally deleting beautiful animals of different kinds from the universe because they most likely dont exist in the same \"version\" on any other planet in another galaxy (if there is other life).  This is the **one** and **only** planet that has the species of animals that we have (Most likely).  And also it can dramatically impact the food chain, will also leads to more species going extinct.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come anti-trust/monopoly laws are no longer pursued in the United States?",
        "response": "They still are Comcast was allowed to buy NBC , but had to sell the Hulu piece off. Couple years later Comcast wasn't allowed to buy Time Warner .  Also Sysco foods (distribution) was blocked from buying US foods Those two come to recent mind",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm a Catholic living in one of the 13 Colonies during late 1776. Which side am I most likely to support?",
        "response": "If I can add something: what was the Pope's reaction to the rebellion?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In terms of the standing-wave model of electrons, what are chemical bonds?",
        "response": "If you have an electron near one nucleus, some bound orbitals exist, with the shapes given by what you've seen in your chemistry textbooks. Now consider a diatomic molecule with covalent bonds, where you have two nuclei close by, and some electrons which are bound to both nuclei. Again, some stationary state wavefunctions exist in the potential formed by both the nuclei. This is a basic example of a [molecular orbital](_URL_1_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is everyone so obsessed over Nikola Tesla? What could he have really done?",
        "response": "What do you mean by \"could\"? He did plenty things, like inventing AC power and the induction motor, among a [long list of other things](_URL_0_). People generally like him because they view him as an underdog who wasn't given all the recognition he deserved, especially given his battle with Edison, in which Edison acted like a complete dick. Some people also like his more oddball ideas that weren't realized, such as large scale wireless power transmission. This wouldn't have worked anyway, because it's enormously inefficient and would pretty much fry all the electronics around it. Such experiments were a lot more practical back when the main concerns were light bulbs and motors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why am I unable to talk comfortably or walk normally in my dreams sometimes?",
        "response": "There could be. I don't think sleeping and dreaming are very well understood, but we do become paralyzed when we sleep so that we don't act out our dreams. When the paralysis fails to happen, we sleep walk, and sometimes we stay paralyzed for a little while after waking. I have dreams where I yell but no sound comes out all the time. Maybe it's because in the dream I am aware that my real body is actually not able to yell.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how Floyd Mayweather accounts for his money.",
        "response": "The same way Bill Gates does it-- he doesn't do it, someone else does it all. There are people and entire companies who's job it is to be money mangers, any person who is sufficently wealthy (and that bar is lower than you'd think) never touch, see, or interact with their money and wealth. It's all handled by a professional.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for humans to make sounds (with our voices) that we can't hear?",
        "response": "No. The typical hearing range for humans is sounds between 20 and 20,000 Hz, while the human voice ranges from about 65 Hz for a very low bass, man to possibly 3,000 Hz for a very high pitched female scream. Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When birds fly, do they know where they're going every time or do they just land wherever?",
        "response": "I live near a long string of parks. Over decades I have watcher the behavior of Canadian geese in particular. Groups will do to the golf course or another pond on a regular schedule. They fly a direct route between these locations. They definitely know where they are going. I remember one terribly windy winter day when a group wanted to go up wind about three miles. They all took off, but one goose could not keep up the pace in the wind. The lead pack turned around and landed while the tired goose rested. I don't think they ever visited the other pond that day. I have seen many examples of such behavior. Other observations: you can tell how far a group is going by how high they fly. Geese flying from pond to pond may fly 100M above the ground whereas birds going 10 miles or more will fly 500m or more high. I conclude they know what they are doing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Because blood gets made from our marrow, does getting a marrow transplant from a different blood type change your blood type?",
        "response": "actually, it can. you can wipe out enough of the host's cells, establish the graft's cells, and end up with what is referred to as 'chimerism'.  one of my recent patients is status post allogeneic bone marrow transplant and is a total chimera. her blood type is changed, from a to ab, and she no longer has the allergies that she used to have.   so, yes, it can. she must take immunosuppressants constantly to prevent graft versus host.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My tongue at the end of a USB cable attached to my laptop counts as an unrecognized device",
        "response": "Yes: the port can detect *something* is attached, but can't tell what it is, because your tongue doesn't communicate via the USB standard :-P",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come humans seem to be the only animal that require whiping their ass after shitting?",
        "response": "You might not like the answer. Other animals don't need to wipe because they can reach around and clean themselves with their tongue. They still clean themselves as needed, I'm surprised you haven't seen the dog doing it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't you pick up a bullet and put it back in your gun and shoot it again?",
        "response": "Please try and google what a bullet is and its reaction when firing.  A bullet is placed in a cartridge with gunpowder and a firing mechanism. When firing, the gunpowder is ignited and the bullet comes out flying. If you pick up the bullet and place it in the gun, there won’t be anymore powder and it’ll be like placing a rock in a gun. Nothing happens.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does an electric guitar and a solid-state amp or a tube amp work?",
        "response": "When you strum a string on an electric guitar, the string moves through a magnetic field produced by the pickups. Because it is a conductor moving through a magnetic field, it distorts that field. This distortion of the magnetic field creates an electrical signal that the guitar then transmits to the amplifier. The amplifier then uses that electrical signal to open and close a transistor/vacuum tube pathway, similar to a dimmer knob on lighting. That transistor/vacuum tube is attenuating a higher power electrical line in sync with that electrical signal from the pickups. The result is an electrical signal that matches the vibration of the strings, amplified sufficiently to drive a speaker cone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Haiti, a country who conquered the Dominican Republic and who supplied Simon Bolivar with troops and material to liberate south america, lives in such poverty? What happened that led to such a decline?",
        "response": "Haiti became its own country when there was a slave rebellion against France. This caused a panic among the European slave owning powers that it would start a trend, so they put a naval barricade around the country. As a brand new free country the Haitians doled out land evenly, which didn't allow them to take advantage of systematic efficiencies. The result of reduced outside *and* inside resources was extreme environmental damage. Look at a satellite image of Hispaniola and you'll see a lovely green Dominican Republic and a much more brown and tan Haiti.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I'm sitting on my couch and my phone signal switches from 4G to 3G or drops from 5 bars to just 1, what is happening to cause it?",
        "response": "A sort of related issue I've wondered about to follow. If anyone can eli5, thank you.  ELI5: Why is it that when I'm connected to wifi on my phone, it'll randomly disconnect to make me connect to 4g,3G,let, or some other communication classification?  My personal conspiracy theory is that it's planned to trick me into using up my data.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the seed the spicy part of the pepper?",
        "response": "The seed isn't the spicy part of the pepper, it's the membrane *inside* the pepper that's spicy. Since the seeds are connected to the membrane, they get spicy oils on them & scraping them off often removes a bunch of that membrane so people erroneously believe that the seeds are spicy. Why are peppers spicy? To stop most animals from eating them and digesting the seeds. Birds, OTOH, eat peppers because they *don't* taste the spice & seeds pass through their digestive systems unharmed. This means a bird flies away and spreads the seeds over a larger area than something like a squirrel would.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does seeing flashing lights give some people seizures?",
        "response": "It's called photosensitive epilepsy, and only people who are predisposed to it may get seizures by watching this sort of thing. The thing is that seizures are caused by the majority of brain cells firing all at once over and over again, drowning out any information that they are supposed to compute. In regular people, the brain chemistry stops that from happening, but it happens more easily in people with epilepsy. When you watch something flashing over and over again, it causes your vision brain cells to fire in sync, but this shouldn't spread to the *entire* brain. But this does happen when someone with photosensitive epilepsy has a seizure. They say that stimuli flashing at about 10 times a second is worst at causing this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Amtrak stations go to small cities.",
        "response": "It mainly has to do with routing. A lot of rails are going to and from Chicago. Bloomington happens to be on the route already, so it was inexpensive to add a station. The demand does not need to be too high to justify the stop. Meanwhile Louisville isn't along any route. The tracks exist, but there are not any Amtrak trains going into and out of Louisville. The demand would have to be very high to get a whole new route added. If there was the demand, I'm sure they could run a chicago - orlando line, and that would run through kentucky, and stop at Louisville or Lexignton, but I'm guessing demand isn't that high, so they just route those passengers through Washington DC.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people thousands of years ago discover simple yet effective remedies for disease?",
        "response": "Trial and error, random discovery (accident), or observing other animals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At the end of the movie \"Trading Places\", what went on at the stock exchange that made it so that Eddie Murphy and Dan Akyroyd made all that money and the Dukes went broke?",
        "response": "insider trading. the rich guys thought that orange juice stocks would be really low. so they sold all of their orange juice stocks. eddie murphy and dan akroid bought them. then when the market opened, orange juice was really high, and the good guys sold for a lot, while the bad guys tried to buy to recover. that is my understanding. **Bonus:** in Coming to america, eddie murphy gives big huge stacks of money to two homeless guys. they are the rich guys from trading places. **EDIT:**according to chrispdx's link, i am wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you feel tired after watching a film, even though you have just sat there for two hours?",
        "response": "You won't be experiencing physical fatigue, as you stated you have just sat there for 2 hours. It will be a combination of mental exhaustion and straining your eyes for extended periods of time. The mental exhaustion is down to the fact that you are concentrating on one thing for a very long period of time and studies have shown most people's concentration peaks at 45 minutes, after that time you actually have to put effort into focusing which can lead to feeling tired. The eye strain is from looking at a screen for a long time, this can be exacerbated if the screen is bright and you are watching it in the dark or if you are too close/far away. Hope that clears it up!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Nintendo not want Super Smash Brothers to be competitive?",
        "response": "Because they want the game to appeal to a larger casual audience primarily. The sorts of things that make a game competitive also make it harder for casual players to enjoy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do \"Electronic warfare\" aircraft actually do?",
        "response": "Jam enemy radar. Protect their own radar. Anything that makes friendly targeting capabilities easier and make enemy targeting capabilities harder. Thats a very basic explanation Methods of doing so are rather classified",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the brain of someone with a higher cognitive ability physically different from that of someone with lower cognitive ability?",
        "response": "I think using the technical definition of \"physical\" would mean the answer *must* be yes. All cognitive phenomena are the result of *something* in the brain--chemical, structural, whatever, but it can't exist if it's not physically explainable. I realize you may have meant more like \"are the differences macroscopically visible,\" but worth all saying all the same.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can Netlifx offer a great selection of movies and series without ads running ever fifteen minutes, yet traditional cable tv can’t, even though they charge customers much more than Netflix does?",
        "response": "Netflix offers a very similar value proposition to HBO. Subscribers pay a monthly fee and get a selection of movies and original programming and neither show ads. The monthly price of premium cable channels is very similar to the price of Netflix.  Cable is a bundle of channels, offering in total far more content than Netflix (though it's a very broad bundle so only a small portion of the channels appeal to most subscribers). While the bundle price is higher, but each channel gets far less than Netflix gets (most channels get less than a dollar per month from each subscriber's cable bill) which means they supplement the monthly fee with ads.  The other major difference is a cable bill also bundles together the content and delivery of said content. To fairly compare the price of cable with Netflix, you'd have to include some or all of your ISP bill too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come police officers, etc, are allowed to gain so much weight?",
        "response": "Well... when you have police forces that need people, you gotta take the trained ones you have, and keep supplementing. Two... the radio is faster than the most fit of officers. So it's enough to hunt and contain rather than tackle, in some cases. That'd be why it's called 'backup.' If you were to suspend/fire all the out of shape cops, you'd have them being out of a job, most of them, by 50, if not younger. What do you do with those guys? And where are you going to get your replacements? We already have cop shortages as it is. Best to keep the ones we can, goes the idea, so there we go. Pudgy cops. Should they have better standards? Proabably. But are you going to sacrifice for a couple of years or more from your current situation to be the replacment, only to be told in 10 years, \"Get out fatty/wheezer.\"? There ya go. Oh yeah. Unions. That too. :p",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do hallucinogens \"edit\" what you're seeing?",
        "response": "Nope, that's not how it works. Your eyes sense light, and your brain does everything else. Recognizing that some of the image is a ball and some of it is a dog is all in your brain. Hallucinations are not image edits, they are your brain saying \"I see my dead Grandma\" when that's not in the light pattern. Optical illusions are images that trick the light = > ideas process, it's not very perfect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I drink a blue gatorade, I pee a yellow stream. Where did the blue go?",
        "response": "Ever give Gatorade to a kid still in diapers? The colorful portion of Gatorade comes out of the other end... Not when you pee it out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How serious is an accusation of malicious selective quotation? [this is in the context of the Holocaust, so I'm nervous]",
        "response": "Honestly that's what we historians do sometimes. We find the evidence we're looking for, whether or not it's there. What I mean is, if you look for something you'll generally find it even if it's not there. Weber talks about doing this in ~~Imagined Communities~~ Peasants into Frenchmen. He says that he finds evidence in a book he's read several times, simply because he's looking for this different evidence now. Sometimes we distort history in favor of our views, intentionally or unintentionally, it happens. There will always be evidence for both sides. It's possible your author did not intentionally mistranslate the German etc. I think if we attempted to eliminate every book that had any bit of \"wrong information\" we would be left with no History books. No one gets it right 100% of the time. You also have to define what wrong information etc.  Hope this helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During a large combined arms battle (e.g. Kursk) would Anti-Aircraft gunners try and aim at enemy aircraft/avoid friendly aircraft or would they just fill the sky with fire and hope for the best?",
        "response": "Each battle had different dynamics of aerial warfare, but ground assault craft, which would be the gunner's primary target primarily came in shifts. As seen with Kursk, for example, it wasn't really that both sides were sending in close air support at the same time. The German wave would hit, then re-arm, then the Soviet wave would hit then re-arm. This was in part because they tended to fly missions *en masse*, thankst to the relatively small amounts of potential air time, low munitions transport capability and the general inaccuracy of air support, and as such leaving at a different time tended to naturally result in a cyclical approach.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Rocket launch: mission launch sequence control box, could anyone explain how this works?",
        "response": "former Boeing Delta IV guy here - I used to build the screens FMA (flight mechanics advisor) would use for launch, plucking data directly out of the Telemetry screen. There are stations that advise on different items - signal link, flight surgeon, vehicle health, etc. The different components report \"ready\" or \"error condition\" to prove the subsystems are functioning correctly. So each \"station\" has their own green light showing all systems go. An error can be reported or waived depending on conditions. With all stations showing a 'go' signal, the final launch sequence can start. Magic Button probably initialized the launch sequence, meaning, prime turbopumps (fuel), and detonate the EED (electronic explosive device). That's launch. This description is very general, and not specific to your photo.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the observable universe 90 billion light years across if it is only 14 billion years old?",
        "response": "There are two reasons why observable universe is bigger than 28 bilion ly. Firstly thanks to finite speed of light we see into the past but the universe have expanded since then so if it were possible to see as it is now observable universe would be much bigger. Secondly cosmic speed limit doesn't apply to space itself only things within it. Very distant galaxies fly away faster that the speed of light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you get skin indentations from clothing or leaning on something, what's happening on a cellular/biological level?",
        "response": "Physiologist here: Your body is a bag (skin, tissue) that contains a bunch of smaller water-filled bags (cells) that are surrounded by more water (what is technically called interstitial fluid).   Pressing a textured pattern against the skin causes higher forces to be imparted on the skin by raised surfaces - resulting in more water being pushed aside in the tissues in and underlying the skin. This is grossly observed as the pattern of a textured fabric/wall/whatever temporarily imprinted in the skin.  Over a few minutes of removing the textured surface, the interstitial fluid redistributes itself, and the textured imprint on the skin disappears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I want to learn about the middle ages",
        "response": "I have two relevant books called \"Life in a Medieval Castle\" and \"Life in a Medieval Town\" by Joseph and Frances Gies. They're both excellent and accessible, and I believe even G.R.R Martin used them for research when writing ASOIAF, for what's that worth. The books are comprehensive and entertaining reads. I would also suggest \"The Time Traveler's Guide to Medieval England\" by Ian Mortimer. These books cover the \"everyday\" stuff. I don't have too many recommendations when it comes to arms and amour yet, sadly. All these books provide information about the more mundane parts of medieval everyday life, which (to me at least) helps me connect to medieval life and its people on a much closer level. They are all introductionary and don't delve _too_ deeply, but they are great starting points for future studies if you find the topics interesting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was life like in Texas while it was the independent Republic of Texas?",
        "response": "There would be a lot of tension between Texas and Mexico. Mexico, despite losing the Texas independence war refused to recognize Texan independence. There was a border dispute between Mexico and Texas over where the boundary would be. The threat of Mexico was one of the factors that led Texas to request joining the Union in 1845. This would lead to the Mexican-American war which led Mexico to lose California and New Mexico to the United States.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do oceanic animals traveling long distances ever introduce invasive species?s?",
        "response": "Their migratory patterns are very formulaic and set in stone, meaning that if they had brought new species to an otherwise inaccessible part of the ocean, it would have happened a while ago. But yes, it's possible. If a new species of crustacean, for instance, were to attach itself to a turtle and ride it during migration season, what you described could very well happen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people get the auto toilets to flush when the sensor stops working?",
        "response": "For all the auto toilets I've seen, there's a button on the front or on the side that enables you to flush it without the sensor. Hopefully the ones you're using have one, too. Good luck!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we just shut the Fukushima Reactor down by inserting control rods?",
        "response": "Control rods absorb radiation that passes through them. The structures they are used in are built with hollow spaces so that inserting or removing them controls the speed of a nuclear chain reaction by preventing radiation from one part of the reactor from reaching another.  They are not magic pins that make anything less radioactive. Put a control rod in a pound of plutonium, and you still have a pound of plutonium. Still just as radioactive. Some of the radiation that hits the control rod might get absorbed, but the plutonium is not less radioactive. Nor can diffuse of radioactive material be easily reversed. It's not like the rod seeks out and traps the radioactive material. It would be pointless as putting a rod of something chemically neutral in a vat of toxic waste. You still have a vat of toxic waste there. Using explosives weapons technology on nuclear waste would, of course, just disperse the radioactive material and make the problem worse.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a \"double-yolk\" egg was fertilized, would it, hypothetically, hatch 2 chiclets? What about a triple-yolk?",
        "response": "It depends on if there was a bird embryo on each yolk. The babby chicken is the little white (or red) goopy wisp thing you see on the yolk. The yolk is just the chick's food supply.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the name the Hittites used to refer to themselves?",
        "response": "That is, in fact, because they did not name themselves like a distinct ethnic group (which makes sense, since they never were a homogenous ethnic group).  Instead, they called themselves \"men/sons of the land of Ḫatti\", or, written LU.MES URU ha-at-ti. (Please note that out ot formatting reasons, I did not use special signs) There are some variations like LU.MES URU ha-at-ti-KI, which is probably based on old hittite URU ha-at-tu-su-um-ma, implying \"people of (the city) of Hattusha\", but a word like \"Hittites\" does not exist until the end of the 2. millenium BC. Source: J.Friedrich e.a., Altkleinasiatische Sprachen (Und Elamitisch), in: HbO 2, Keilschriftforschung und Alte Geschichte Vorderasiens, Leiden/Köln, 1969, S. 125-126",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are we so precise about time, to the point where we skip skipping a leap year every 400 years, when our reference points are millions of miles away in space?",
        "response": "really precise time is done with really precise clocks  that use atoms and light for their little tick tocks. --- but for leap year extensions, there are easier comprehensions. to find the way, just count every day. --- in four years you're short, so add one more just for sport but in four hundred years you've gone too far. the correction, however, is not too bizarre --- just leave the calendar alone, and you'll find it hasn't grown. and so this is the case. every time has its place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long have civilizations been using Lighthouses and where we they first used?",
        "response": "The oldest lighthouse I know of is the Tower of Hercules in Spain. It was built by the Romans in the 2nd century and it's still used to today. The design is somewhat complex so I'd surmise that the concept of a lighthouse predates it by quite a bit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there going to be a WW3? Why weren't there any major wars like WW1 and WW2 in the past 67 years?",
        "response": "Albert Einstein said it pretty well: \"I know not with what weapons World War III will be fought, but world War IV will be fought with sticks and stones.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between a sow cow, toe loop and any of the other jumps in figure skating?",
        "response": "[Differences in the way you take off and the way you land](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Spartans use bow and arrows?",
        "response": "I think it's worth noting that the Greeks did had kind of cultural disdain for archers. In Ilias, it's quite clear that anyone who had a bow was somewhat of a coward. (That doesn't apply to the gods, or Odysseus, by the way. Why, I don't know). Given that \"no real man\" uses a bow, and that \"real man\" were hoplites, it doesn't surprise that aforementioned Herodot and Thukydides kind of expected the reader to know how that there were lighter troops in the battles as well. This is, by the way, a thing we can see in the roman historians as well. They often downplay the role of anyone other than their heavy infantry and a bit earlier, their cavalry. Especially, they often \"forget\" to mention mercenaries and other \"light\" troops. It doesn't stop here, in the Middle Ages, historians often downplayed the role of troops other than heavy cavalry. So, all in all, it's about how they wanted to be seen, not how they were.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "For televised football games, how do the lines and graphics on the field work?",
        "response": "The answer is a huge amount of computing power. A 3D model of the field must be programmed into the computer first, indicating where each yard is, as well as where all the bumps and slopes on the field are. The cameras are mounted on special rigs that monitor every movement the cameraman makes. The computers are programmed to recognise various different colour palettes so they can tell where the players are, so as not to draw the line over the players. When all of this setup is complete, it takes [8 computers and 4 people](_URL_0_) to do the actual job of drawing the 1st down line on the pitch.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are gas prices so much cheaper down South then North?",
        "response": "Lots of oil refineries in texas and the south, so the cost of transporting the finished product is lower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If honey never spoils, why does my honey have an expiration date on the bottle when the only ingredient listed is honey?",
        "response": "It's for quality. Even if it doesn't spoil when stored properly, honey can develop an off flavor over time. The date is a conservative estimate for when it might start to go off - not in the sense of being unsafe/spoiled, but in the sense of not tasting as good anymore. It also helps stores and warehouses with stock rotation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why lonely women are associated with having cats",
        "response": "It's a stereotype that, since women doesn't have a husband or kids, she adopts cats in order to take her mind of her situation. It's associated with filling up the house, since she doesn't have actualy people to do so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a corporation like Activision-Blizzard think King Digital (maker of Candy Crush) is worth 5.9 BILLION dollars?",
        "response": "King Digital has about 315 million (common) shares outstanding, and earned a little north of $1.75 per share these past 12 months that puts a very rough estimate of their annual earnings at $550 million. When one company buys another, the price can usually be ballparked as some multiple of the company's proven earnings. This multiple reflects the fact that they're not just buying the company's assets as things stand now, but also its value as a going concern (its earnings going forward, which will presumably continue to grow). A multiplier of 10-11 isn't terribly uncommon for businesses in this sector. Plus, setting aside the on-paper value, a blue-chip veteran of the gaming industry like Blizzard/Activision no doubt sees additional opportunities for synergy buying up a huge chunk of the mobile gaming market for itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are inmates on death row for so long?",
        "response": "Aside from the literal struggle to obtain the lethal injection drugs, the legal process includes nine total steps, the first being a direct appeal which is given to everyone sentenced to death. From there, post-conviction proceedings can take place with the second stage of the appellate process. That's when defendants can raise issues such as juror misconduct, newly discovered evidence, or ineffective assistance of counsel. One appeal may have two or three issues and one appeal may have 10 or 12 issues. The more issues that have to be looked at, the longer time it's going to take for that appeal to be pushed through the system. And many appeal several times.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the Continental Army use bayonets hafted on poles as spears during the revolution?",
        "response": "Christopher Ward's rather venerable \"The war of the revolution\" doesn't mention this that I recall. To the contrary, he repeatedly mentions that the continentals often lacked bayonets to begin with. \"With zeal and with bayonet only\" doesn't mention it either when outlining the differences in armaments and equipment.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Beyond formatting, is there a reason why the Lanthinide and Actinide series are separated from the rest of the periodic table? Are there tables that include them within? If so, are there rules for including them in specific coumns, or is it a free-for-all?",
        "response": "> If so, are there rules for including them in specific coumns, or is it a free-for-all? A periodic table should have the elements in atomic number order so it's not a \"free-for-all\", but there is some debate about whether group 3 should include the first elements of the lanthanides and actinides (lanthanum and actinium), or the last elements (lutetium and lawrencium). In a 32-column table that means deciding whether scandium (Sc) and yttrium (Y) should go next to the alakaline-Earths as they are in this example _URL_4_ or should instead go over on the right next to titanium and zirconium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Cloning Dinosaurs: Are scientists making progress?",
        "response": "Barring someone cloning a chicken (yes, birds are dinosaurs!) I doubt you'll ever see a cloned dinosaur. Cloned mammoths are much more likely since we have quite a lot of frozen tissue and the fetus could be stuck in an elephant. Soft tissue of dinosaurs (to the extent that it has even been found) is limited to a few leftover proteins IIRC. Not really something you can clone.   A better bet for getting dinosaurs is reverse engineering them from birds. It would be tricky but in theory you could get a decent raptor by tinkering with the genome of birds to re-express tails, teeth, and hands. Unfortunately there is no National Institute of Mad Science to fund doing that sort of research (I'm totally founding one if I ever get rich though). If you could bring back a dinosaur, it would probably do fine in our atmosphere. The whole \"higher levels of oxygen\" thing actually applies mostly to insects which lived long before dinosaurs appeared.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "WWII: Field Marshall von Kluge's farewell letter to Adolf hitler, a question about a reference to the Eastern front",
        "response": "He's probably referring to Field Marshal Paulus, who in Soviet captivity became an outspoken critic of the Reich after his capture at Stalingrad. Paulus took over the Sixth Army following Reichenau's stroke, and was tasked with holding Stalingrad when it became clear that it would be encircled. Goering promised that the Luftwaffe could deliver the supplies needed to keep it operational until relieved. In reality, they could deliver about 1/4 of this in the best weather. Manstein's effort to relieve them failed, and Hitler issued Paulus a promotion to field marshal on the assumption that he would commit suicide. To that date, no German field marshal had ever been captured alive. Paulus surrendered what was left of the army the following day. Only 5,000 of the original 300,000 survived captivity, including Paulus himself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we only hear about mexican druglords? If they sell most of their drugs to the U.S, who buys them, smuggle , and distribute them there?",
        "response": "Usually large Mexican drug organizations have networks inside the US they use for smuggling and distribution. They may also make deals with established American or international organized crime groups to distribute their drugs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do people think that 'dog shaming' photos are funny?",
        "response": "The dogs aren't actually being shamed; dog's can't read, and don't know why they're wearing a sign, or that the sign is in any way \"bad\".  It's considered funny because it ascribes human emotions to dogs, and most people find anthropomorphizing animals to be humorous (see: lolcats, and related image macros).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the party doing the gerrymandering know in advance which regions will vote for whom?",
        "response": "In some cases you base it on demographics and assumptions. In some cases you base it on polling. But depending on the scale, you. An also base it on returns for local and national elections as aggregated by districts, regions, polling, etc. You dont have to know who voted for whom to know that this polling center gets 70% one way and the one on the other side of town leans 70% the other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Booster shots, why is there a time frame?",
        "response": "It's a way of helping ensure the vaccine takes effect and that your body develops the protection (antibodies) it needs from the vaccine. For instance, a vaccine given one time might effectively develop protection in 85% of people, but then you give them the second shot and that percentage goes up to 95%.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does vertigo work?",
        "response": "Brain makes you scared of shit that it knows are dangerous so you don’t fall off and die. Like how people who are from countries that don’t have poisonous animals or spiders are naturally scared of snakes or spiders, it’s programmed that way for protection out of evolution.  My cat is scared of cucumbers as it resembles snakes. He’s never even seen a snake or encountered anything dangerous to him. The only thing dangerous in New Zealand are sharks, and Australian immigrants tired of losing the rugby to us. He’s just programmed to not like snakes, probably has no idea why he freaks out at cucumbers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Snowden considered by some to be a Traitor?",
        "response": "I definitely don't see him as a traitor. We deserve to know how shady our govt is. And some of the shit they're pullin is pretty fuckin shady. Hooray for Snowden!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why credit/debit cards implemented chips",
        "response": "A swiped card uses a magnetic strip and the information contained on it is static, it stays the same every time, so if that same information is skimmed, it can be used by thieves until the user catches the fraudulent purchases. A chip, however is part of a process called tokenization. It has the same information but transfers it in a different way every single time, and the card issuer knows which way it will transfer it each time and will always transfer it in a different time. In fact is has been used very effectively around the world which led to fraud in the United States being a disproportionate amount of the fraud worldwide. So while an inconvenience, it is much less inconvenient than a stolen identity and stolen funds. It would also help if the United States would shift straight to chip and pin (i.e. Every transaction requiring a pin not just debit) instead of chip and sign.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there anything to the recent papers suggesting the speed of light is variable in real space? (link to paper in linktext)",
        "response": "Well, I can say that there's no observational evidence to support the speed of light being variable. The article you linked says only that a certain group of theorists have come up with an idea which could imply a variable speed of light, but I'm afraid I can't really evaluate their theory because I'm not a quantum physicist.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you're busted for committing a crime in a foreign country, what can the police do if you don't provide any identification and refuse to speak?",
        "response": "Which country? Some will do much worse than others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people not like Calluses and how can I create them 'automatically'?",
        "response": "I was a gymnast and I would get calluses on my hands from doing the rings, high bar, and parallel bars. The problem with them is that they would form on certain parts of the hand, but if they were not trimmed, they would rip at the surrounding good tissue creating havoc. I ripped my hand bad many times from not keeping the calluses trimmed properly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a “floater” float?",
        "response": "If there's a high proportion of lipids (fats) in the stool it will tend to float as fats are less dense than water. The majority of the stool is water and other proteins and organic compounds that are denser than water but the lipids give stools their buoyancy.  Ah I'm talking crap. Literally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is gas cheaper/more expensive in certain states?",
        "response": "Some states, such as California, have more strict regulations on how the gasoline is refined. This usually comes along with an increased cost. In general though, states may have different taxes on gasoline purchases, resulting in different prices from state to state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is that some some bugs lay on their back when they die?",
        "response": "Bug legs are similar to how hydraulics work, moving fluid around inside to make them extend and contract. When the bug dies, there’s no pressure extending the legs outwards so they all curl in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do pictures from phones have different file sizes?",
        "response": "> I don't understand how pictures without editing have different file sizes, do certain colors somehow take up more space than others? You're on the right track. Cameras (and phones) save images in compressed (and usually lossy) formats. Which means, essentially, that the file size of the image is not only a function of its pixel resolution, but also a function of the complexity of the image (essentially how difficult it is to identify and simplify patterns within the image). So images that are very complex with many different elements and shades of color are a lot more difficult to compress and will take up a larger space whereas very simple (e.g. solid color) images will take up only a minimal amount of space.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does Autosomal DNA code for Mitochondrial DNA?",
        "response": "Mitochondria actually have some of their own DNA. They are, after all, descendents from bacteria. However, some of their required genes have actually moved to the nucleus, so a mitochondria cannot survive on it's own. The reason why people talk about mitochondria being maternal is because you can only inherit mitochondria from your mother. They are contained in the egg prior to fertilization, and as far as I've understood it, no mitochondria from sperm will get into the egg upon fertilization.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is a coat hanger able to pick up radio waves when replacing the aerial in a car?",
        "response": "The aerial is just a fancy coat hanger. \"Radio waves are a type of magnetic energy generated by a transmitter and a transmission antenna. The antenna on your car is built to pick up the magnetic energy of the radio waves and send it to the car's radio receiver, which in turn isolates and amplifies the radio waves you want to listen to. The antenna works on a simple principle. The passage of the radio waves over the antenna's mast produces minute electrical charges. Depending on the length and other details of the antenna design, particular radio wavelengths are captured more easily than others. The design of a car's radio antenna takes into account the differing frequencies of the AM and FM bands to provide good reception with either.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, if there is ONE FLY in my ENTIRE HOUSE does it have to be in the room I'm in?",
        "response": "You can only notice flies in the room you're in. Also, it's probably not the only fly in your house.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would someone who could suddenly hear for the first time in their life be able to phonetically understand their own language?",
        "response": "> But, if the first sound they hear, were a recording of someone talking, would they be able to understand what was being said? If they were born deaf? No, not at all. In fact, it's very possible that they'll *never* be able to understand speech. Neuroplasticity can re-organize parts of the brain that don't get used, and the the areas of the brain that normally develop to interpret audio input will almost certainly be commandeered for other functions to some degree as they grow up with a total absence of sound.  Depending on the age when they gain hearing and the degree to which the relevant areas of the brain have been subsumed for other functions, they might have an extremely difficult time even being able to comprehend sound itself, let alone interpreting complex things like speech.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I have a dream in which I'm being shot, stabbed, or otherwise physically attacked, why do I feel a sensation in my body as if it's actually happening to me?",
        "response": "Pain isn't caused by being hurt, its caused by signals being sent to the brain. I suppose if you think its happening the warning signals are still sent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the importance of the French presidential election?",
        "response": "The French election is seen as a good measure of where Europeans and Western society as a whole sit as it relates to populism. The past year saw a huge rise in the number and success of more populist candidates and feelings, most notably the Brexit vote and the election of Donald Trump.  Le Pen, who finished in second place in the election and will now compete in the run off vote is seen as similar to candidates such as Donald Trump and stands for similar populist ideals. Her success, therefore, is seen as an indicator for how the populist movement is growing/stagnating/declining throughout Europe and the Western world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do single-cell organisms facilitate their own actions? (e.g. how do white blood cells know to target bacteria)",
        "response": "Basically, they communicate with other cells by having receptors for specific chemical compounds. If a neighboring cell releases that compound, it will bind to the receptors of the other. Every receptor has unique biochemical pathways that result in cellular activity. There are entire volumes of books filled just to explain just how exactly this happens however.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are our backs so poorly designed?",
        "response": "Because it's not designed. It's a process of evolution. There was no committee that sat down to design the perfect back. Our line hasn't been walking upright for very long and so we still have a back that hasn't changed much from when it evolved for walking on all fours and since some back pain probably isn't going to stop you from surviving and breeding, and most of the problems happen after you're 30 anyway, there isn't much selective pressure to change it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Toys or other paints/plastics that change with water/temperature.",
        "response": "It is called [thermochromism](_URL_0_). There are a number of ways to achieving it. The simplest way is to use a solvent with a fairly high melting point, and a dye that changes colour depending on whether it is dissolved in the solvent or not. The material thus displays one colour when it's cold and the solvent is solid, and it displays another colour when it's hot and the solvent melts, dissolving the dye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a leather strap sharpen a razor?",
        "response": "> How can this possibly sharpen a metal blade? It doesn't sharpen it, it hones the blade. When you sharpen a blade the edge is made very thin. It is so thin that it is flexible, and can easily be curled over by use or even accidentally while sharpening. This makes what would otherwise be a sharp blade a bit blunt. By running the blade backwards against the leather strap the curled edge can be straightened back out, returning the blade to peak sharpness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does space shrink when you travel close to the speed of light?",
        "response": "Yes - you are absolutely right, and your reasoning is absolutely spot on too. This is known as [\"length contraction\"](_URL_1_). It was hypothesised by Albert Einstein, and has been [proven experimentally](_URL_0_) many times since.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I have bad vision without glasses, but can see perfectly clear underwater.",
        "response": "Light bends whenever it goes from one material to another. For normal people this means that light bends the right amount when it goes from the air outside of your eyeball to the inside so that it’s clear, but when it goes water- > eye it doesn’t bend enough and things look somewhat blurry. In your case your eye is bad, and it doesn’t bend the right amount when going air- > eye, so normally you need glasses to make it bend more and appear clear. However your eye just happens to be in about the right spot for the water- > eye bend, so things look clear underwater. Note that that’s not necessarily a general rule; it just happens that your particular prescription is close to the difference between the water/air difference.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does contamination occur in other experiments with HeLa cells, and why is it such a problem?",
        "response": "dirtymirror is right on and as to how they get into other cultures: not using disposable pipetts/not changing tips. They survive cause they're hearty lil dudes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Comcast & other ISPs get away with all the bad stuff they do, and how can I, as a regular citizen, fight against them?",
        "response": "They have large sums of money and our Government and people in general are easily persuaded by bribes. Encourage reddit and other sites to do a slow day or slow hour that would slow down the entire site to the speed that the 'Slow Lane' would be. Also create a subreddit for your city or area and organize a march or protest at a local comcast office or headquarter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are kitchen knives sharpened by pushing the blade into another surface, while straight razors are sharpened by dragging the blade against another surface?",
        "response": "You are confusing honing with stropping.  When you sharpen a straight razor you DO push blade first. You only lead with the spine of the razor when STROPPING. Honing (AKA Sharpening) is essentially grinding the metal down to the shape of a blade. This is done on a wet stone (AKA honing stone), blade first STROPPING (what you see done to a straight razor on a leather strap) is not done to \"sharpen\" the blade in the sense that it's reshaping the metal. Stropping sets the \"fin\" on the blade. Metal has many layers, so the heat and abuse a razor gets from the act of shaving disrupts the fine microscopic edge of the metal. With tiny metal flakes going every which-a-way (think bed head) after stropping the tiny metal layers are all lined up and organized (think mohawk) When you hone a razor, you do indeed go blade first. It's only when stropping that you lead with the spine. Source: Been shaving with a straight razor for a while and owned knives for even longer. Also /r/wicked_edge",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since we're aware of the elements required to create water (H2O), are we able to do so? Are the elements scarce/abundant? If not/so, why don't we just create water and supply it to places in need?",
        "response": "The elements of H2O are Hydrogen and Oxygen, two gasses. They're not all that common in their raw form because they react with things, so they're normally in compounds, like water. You can get hold of pure hydrogen and pure oxygen quite easily though - the easiest way to do it is to use electrolysis to split water. Water is extremely common compared to almost anything else. It takes a lot of energy to split water into hydrogen and oxygen, and when you combine them back again to form water, you get a lot of energy out. You can power a rocket with it. None of this is more practical than just piping water to somewhere that needs it. Edit: BTW if you think \"there are no stupid questions\", have a read of some of the lower-rated replies to this post.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Do We Call A Spouse's Family by Brother In-Law, Mother In-Law, etc?",
        "response": "Because they are now legally (in law) your family member. So while they're not blood related, they are related \"in law\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can somebody explain interest rate? If I have $200,000 loan with 3% interest rate over 30 years, how would I owe $600,000?",
        "response": "The interest is compounded. So once compounded the total due becomes $206,000. (200,000*1.03) Then the $206,000 is compounded the next cycle. (206,000*1.03) $212,180 so on and so forth. This is why it's good to pay off early and make more than minimum payments. At least I believe this is the answer. Could be wrong but look into compounding interests and you should have a clearer picture.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do species which exhibit sexual dimorphism also exhibit higher degrees of behavioral difference between sexes?",
        "response": "I think I understand what you are asking. So for example in something such as birds of paradise the males look very different to females, and behaviourally they are different because males exhibit display behaviours to attract females which is something only the males do. So therefore the sexual dimorphism is linked to behavioural differences. However as far as i know they behave similarly other than when trying to breed. I think this carries true for most species exhibiting sexual dimorphism because most sexual dimorphism is due to mating dances/displays etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do photons compress, like bouncy-balls, when reflecting off of mirrors?",
        "response": "Photons are, to the best of our knowledge, points particles, with no internal structure or size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "when playing music at a rock show, what's the purpose of feeding a loudspeaker back into a microphone?",
        "response": "Guitar amps & speakers aren't like stereo amps & speakers. They tend to color (or even distort) the sounds coming out of them based on how loud they are. If a guitarist likes the amp sitting at a \"6\" but you need a \"9\" to be heard, it will ruin the sound. You also need to consider that guitar amps just aren't big enough to give you good sound in a large club or stadium. To get that level of volume, you need PA system with much larger amplifiers (that, ideally, don't distort sounds). If you mic up all the guitar amps, you can run it all through a central mixing board where the sound guy and make sure everyone's playing at the right volume to sound good everywhere in the venue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it so difficult to explore the deep ocean?",
        "response": "I'd just like to add one thing to the comments about pressure. The deep ocean is also really dark and you can't see very far. Seems kind of obvious, but I think it's important to keep in mind - you have to explore it a tiny patch at a time, out to the range of your floodlights. Contrast that with land, where even on flat ground you can see for a few miles, or space where you can see for much, much further.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the smoke to appear after firing a rail-gun?",
        "response": "That is the barrel literally evaporating. There is such a high current being discharged across the rails it's turning into a plasma. Durability is a big issue with these types of weapons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the armour that King Baldwin IV of Jerusalem is usually depicted donning with the steel mask?",
        "response": "Sorry to be so short, but there's really not much to this one. The 2005 film Kingdom of Heaven invented the mask for artistic reasons (I guess audiences weren't ready for simulated leprosy), and some more recent depictions have run with it. It's not really a piece of armor, and there's no evidence that Baldwin or his contemporaries wore such masks, certainly not in battle. While perhaps very intimidating looking, it would starve the wearer of oxygen in a damned quick hurry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we still need SIM cards?",
        "response": "First of all, we don't need SIM cards. GSM networks (most of Europe, and T-Mobile and AT & T in the US) require SIM cards, but CDMA phones (many parts of Asia, and Verizon and Sprint in the US) haven't used SIM cards until very recently. With the CDMA vendors, you had to visit the carrier's stores to switch phones. Personally, I prefer SIM cards. With a SIM card, I can decide what phone I'm going to use in a given situation. I can bring a good smartphone to work, then swap the card into an old feature phone when I'm going to be in a bad neighborhood or if I'm doing yard work or other physical work where I might damage my phone. A few years ago, I ended up utterly destroying my phone in a strange city in the middle of the night. Despite the extensive damage, the SIM card was okay. Because I had a SIM card, I was able to find an open store, buy a prepaid phone from the same carrier, and swap the SIM card into the new phone. No calling the carrier or proving my identity required.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Review of YouTube Series \"Real Crusades History\"",
        "response": "hi! there's lots of room for commentary on various aspects of these videos, but you can get a great start in this thread, which includes links to a handful of other posts about similar claims  * [What is the consensus on Real Crusades History?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the traditional \"toy soldier\" Christmas decoration's uniform based on a real regimental uniform or a generic/composite uniform? If a real one, which one?",
        "response": "For starters, some examples of French Napoleonic uniforms: _URL_0_ And English Napoleonic uniforms: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the point of the butterfly stroke?",
        "response": "It was faster than the breast stroke but legal according to the way that the breast stroke rules (at least the arm motion was) were written until 1952.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does your W-2 form do?",
        "response": "Companies use W2 forms to tell you, and the government, how much you made from them, and how much they gave to the government on your behalf in taxes. You use this to determine if you paid too little tax and have to pay more, or too much tax and get some cash back. The W4 is what you use to help tell your employer how much tax they should hold from your paycheck so that you *ideally* over/under pay as little as possible. Alternatively, some people \"work 1099\" which basically means the company doesn't pay taxes on your behalf and instead only lets you and Uncle Same know how much they paid you so that you can file your taxes appropriate. There are some regulations on who can use a 1099, and those rules have gotten tighter if I'm not mistaken.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that the liver can (to an extent) regenerate but other vital internal organs cannot?",
        "response": "I have a feeling that ELI5 here should be like this: liver is like a sponge. If you cut out a part of it it's still a sponge, it still does work. And as it's made of cells that can be grown one to each other rather freely still maintaining the overall organ functionality - it can regenerate. Other organs are like a balloons that contain more balloons (in which you'll find another set of balloons and so on). If you cut a balloon, it will lose its shape, functionality and what's contained inside. It will break down and will not regrow by themselves to the same shape (highly specific shape)... Therefore half of a liver is a functional liver with half of it's capacity and half of a heart is just leaking ;) And heart simply can't be leaking as it's a pump.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain like I'm 5 what is beyond the 3rd dimension.",
        "response": "The easiest way (for me) to conceptualize the fourth dimension is to consider time as the fourth dimension. Unlike the other three dimensions where we are free to move about, we are being forced forward through the forth dimension at a fixed speed (one second per second).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does our body react to sadness by producing tears?",
        "response": "We can smash atoms together and discover ~~there~~ their internal parts, but when it comes to a bodily function that we, as a human species, has dealt with for years, we still do not have a definitive answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can Israel be considered a colonial power in Palestine? How? And if so, did the British pave the way? How?",
        "response": "I'm not an expert in this subject, so I can't answer your question itself. However, I suspect one problem you're going to encounter is that the term \"colonial power\" is a controversial term to be applied to a controversial issue. Without more context, it might be hard for someone to answer your question while also avoiding politics.  So, perhaps you can expand on what you mean by \"colonial power\"?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When using self-checkout registers/till, how do they prevent fraud without checking ID or having a signature?",
        "response": "Merchants don't generally check your ID or signature even when a cashier checks you out. Ringing up your items yourself doesn't really do anything to change this equation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Panel of Historians V",
        "response": "Guess I'll throw my hat into the ring. I had planned on waiting a bit longer, but since I'm going to be in an AMA panel soon, I might as well try to get my flair now. \"Eastern Woodlands\" is probably the best term available; Americas blue or Prehistory black could both apply, but I'm leaning blue myself. Sample Posts: [Siege Warfare in the Eastern Woodlands](_URL_5_) [Potential for \"Rebellious Teens\" among the Miami](_URL_6_) [Cahokia society and politics, based on observations of related historic nations](_URL_4_) [Tlingit Warfare](_URL_6_), considerably outside the Eastern Woodlands, but I felt like the post was a good example anyhow.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a certain amount of electrons allowed in each orbital, when orbitals are not clearly defined?",
        "response": "Orbitals are clearly defined as solutions to the Schrödinger's equation, which are probability amplitude distributions labeled by the quantum numbers (eigenvalues of the equation). Since electrons obey the Fermi's distribution, only one electron can occupy a give state labeled by the set of quantum numbers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was the #MH17 Plane shot down?",
        "response": "Rebels with little to no military training were provided with anti-aircraft missiles by a completely unknown foreign power that rhymes with \"Dussia.\" Since the people operating this equipment were not very well trained, they couldn't tell the difference between an enemy military plane and a commercial jetliner and, as a result, murdered 298 people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In double jeopardy (law) a person cannot be tried for the same crime twice. What if they outright say that they did it after being found innocent?",
        "response": "As an extra note, in many countries a confession is not enough to convict you. You can be lying, trying to protect someone else, searching media attention, an so on. You will need to provide some extra evidence to be convicted. For example some details of the crime only the author should know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is hard water, and how do water softeners work",
        "response": "Hard water has a high mineral content mostly calcium and magnesium. The most common method of water softening uses a filter-like device that exchanges the calcium and magnesium out for sodium. Hard water is not as good for cleaning cloths. It also has a tendency to leave some mineral crud that can wear out plumbing and hot water heaters faster.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I donate part of my liver to someone, the liver regrows. What if in the future I need a new liver? Can I receive a portion of my exliver from said person who received it? Will I need immunosuppressive drugs?",
        "response": "You need the basement membrane to be intact for you the liver to grow correctly, which is why we only transplant lobes of a liver... if your transplant a slice, or portion of the liver , the cells regrow, but not the structural units like sinusoids and portal system. So basically it would be useless.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the Hubble Telescope have a variable depth of field or just a very deep one?",
        "response": "A very deep one. Depth of field is not really a term that makes much sense for telescopes, because everything is so far away that we can just treat the incoming light as entirely parallel. The focus is at \"infinity\". The distances are so large, even stuff in our own solar system can be observed with the same focus setting as stuff across the universe. It's all at \"infinity\" as far as the optics are concerned.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone provide me with an explanation I can understand about the difference radio active terms?",
        "response": "Becquerels are a measure of the number of decays occurring. One becquerel is one decay per second. This doesn't necessarily tell you very much about its effects on anything else; it's just a measure of the activity. A rad is 0.01 grays, and usage of rads is generally frowned upon in favour of grays, which are the SI unit. This is a measure of the energy absorbed by a sample of matter from ionising radiation. Sieverts are a measure of the amount of damage done by radiation absorption, and is a function of the amount of energy absorbed (measured in grays) and a weighting function for how much damage is done by the particular type of radiation in question; alpha particles (which are helium nuclei), for example, have a much higher weighting factor than beta particles (which are electrons or positrons).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there actual science behind shampoo types (such as \"for frizzy hair\", \"for damaged hair\", or \"for curly blonde hair\", etc.) or is it all just marketing?",
        "response": "There is to an extent. A colleague who worked as a product scientist in hair care explained it this way. You may be familiar with serums that people apply to curly or frizzy hair to help the hair settle (these products usually contain silicone)? Shampoos for \"dry\" or \"frizzy\" hair may contain more of the silicone ingredient which will cling to hair after washing and help it smooth down. Shampoos for \"thin\" hair or that are \"for volume\" will contain less of that silicone product and therefore less product will remain on the hair after washing, theoretically making the hair less weighed down and more voluminous.  Shampoos for \"color treated\" hair supposedly contain gentler surfactants to clean the hair and therefore the shampoo should take off less of your color when you wash with it, Amounts and specific ingredients vary by brand.  Some of it is science, or theory, at least. A lot of it is marketing. The industry is not strictly regulated so take it all with prudent skepticism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it possible to move a house/building?",
        "response": "So, we actually moved a house and the process is pretty cool. We bought a house at auction for less than 3000 dollars and moved it. This was about 15 years ago.  Step 1 remove the roof. Labeling the pieces for easy reassembly. Step 2 depending on how many stories the house is you place supporting beams along the floor joists of each level, ours was a 1 story with a loft so it was a bit wonky. Step 3 section the house into parts that will fit on a traditional flatbed. Ours was divided into 4 sections Step 4) the actual drive is planned out ahead of time with the specific dimensions of each piece at the time we had to pay 50 dollars per powerline that had to be taken down and put back up. Step 5) deliver and put it on the foundation and put it back together.  Edit: we moved the house over 20 miles so that may be a factor",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the solar cycle reset?",
        "response": "It's a fairly complicated process but the diagram is not the full cycle. Once you go past the last picture, the tightly wound up magnetic field lines get lifted up through to magnetic lift with the Coriolis force twisting the lines into loops. At some point these loops will break the field line and reconnect forming a shorter less twisted line. This reconnection removes the east west component of the field and leaves the polodial field with an opposite polarity. At this point you are 11 years past the first picture, the whole process goes through the same cycle again just with reversed polarity and presto you end up at the original state again after some 22 years. Just a very rough sketch of the process, but should give you an idea how it works in principle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Islamic State in Syria and Iraq able to access the Internet?",
        "response": "Why would the world want to shut down a source of intelligence? All communications out of those locations are being monitored. Sometimes they fuck up and give us their plans.  Also, in my opinion, the powers that be do not want the recruitment to stop. They either want to weed out who can be converted, get them in one place to kill them, or keep the terrorist funding gravy train rolling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Why is the qwerty keyboard configuration slower than the alphabetical form?",
        "response": "It isn't that they specifically typed faster. It is that certain letters that are used frequently in combination were typed too fast...causing them to lock together in typewriters. They needed to move the letters that go together often to places on the keyboard that won't cross and get stuck. We type just as fast with qwerty. It is just that certain letters rarely get typed in succession that would get locked together.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can countries decide to use foreign currency as their own? Wouldn't they be dependent on the foreign counties and wouldn't that cause some kind of deflation? Example: Kosovo using the euro.",
        "response": "Hopefully that currency is really stable, like the dollar. UAE I believe pegs their currency to the US dollar because their oil-dominated economy would have huge inflation/deflation levels because of changing oil prices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can you think of a culture that existed 1000 years ago, anywhere on the planet, where people (at least most people) didn't believe in corporal punishment as an element of good parenting?",
        "response": "The best I can do is point at the San people, who are hunter gatherers in the southwest of Africa. Their culture has likely persisted in the same location from the Paleolithic era, because it's so inhospitable there they wouldn't have many people trying to take from them their lands. Their childrearing philosophy is notable for its leniency towards children. \"Children have no sense\" is the most commonly applied aphorism, and children generally aren't the subjects of corporal punishment.  This is from college classes, but here's a source that basically backs up what I'm saying._URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Electronegativity related to acidity?",
        "response": "Fluorine atoms that are a few carbons down the chain make an alcohol more acidic because their inductive effect draws the negative charge away from the oxygen atom in the conjugate base and spreads it more evenly through the molecule, lowering the overall molecular energy. If you're talking about the atom to which the proton is directly attached, there's more at work than just electronegativity. In this case you have to remember also that sulfur is considerably larger than oxygen. If a sulfur atom acquires a negative charge, the charge is spread out over a significantly larger volume of space, putting the resultant conjugate base at a lower energy level than the equivalent oxygen species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you’re throwing up, why do you continue to dry heave once everything from your stomach is expelled?",
        "response": "You throw up because your brain thinks you're suffering from poisoning, and that's the only solution it has. It doesn't actually care about if your stomach actually has anything in it. Until the perceived \"poisoning\" goes away, it continues the \"corrective action\".  Coincidentally, this is why people get motion sickness: when the visual data your eyes give you conflicts with the motion data from your inner ear, the brain short circuits and assumes that you have been poisioned - why else would the ground be moving like that! - and so begins the \"purge everything\" protocol.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Another question about matter and antimatter.",
        "response": "particles can only react with their corresponding antiparticles to result in annihilation (through the electromagnetic interaction) into a photon. so no, a proton-positron would not annihilate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Several questions about residential mold growth, toxicity, and remediation",
        "response": "Hey AskScience! Let's leave this one to the experts please. I know that many of us have had to deal with mold in the home, etc. but we'd really like to keep this in the realm of science! Thank You!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do scientists achieve \"Near Zero Kelvin\"?",
        "response": "The Third Law of Thermodynamics says that it is impossible to reach 0 K in a finite number of steps in a finite time, but we can get really close. There are a bunch of techniques on how to reach low temperatures and I won't try to describe them in detail, but here are some informational sites Helium-3 dilution refrigerator: _URL_3_ Magnetic refrigerators (this is for larger systems): _URL_4_ Laser cooling (this is for small numbers of atoms. This is what they use for making Bose-Einstein condensates): _URL_4_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do males lose a lot of heat through Testes?",
        "response": "No, the testes are located outside of your body to keep cool, they are not really well vascularized as you suggest. So no the body does not want heat to radiate to them, they are not a significant point of loss and thermal regulation of your nuts is important as body temp would not allow proper sperm development. Source- 3rd year med student, I chopped a dead guys nuts apart.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would actually happen if someone paid off people's student loans via hacking?",
        "response": "because they're not hacking, they're doing a denial of service attack. They dont get inside and get to find out information and change things. They're just attempting to make so many connections at once the server can't handle it. It's the difference between infiltrating a building like a spy (hacking), and forming a picket line (DDOS, taking a service down)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does big, strong animals like horses submit to human even though they could rule us all?",
        "response": "If you are a horse that kills a person you get put down and you never breed and your genes die with you. If you are a big dog that kills a person you get put down and you never breed and your genes die with you. If you do this to 100 million dogs over 100,000 years you end up with dogs that generally speaking wont try to murder you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do scalp and muscle massages feel so much better when someone else gives them to you?",
        "response": "The current understanding as to why it doesn't feel good when we try and massage ourselves is linked to a feature of the brain called \"efference copy\". Basically the brain cancels out or ignors certain signals in order to operate more efficiently or effectively. Have a look at the definition: [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Harvard considered the best University in the world? How are the rankings of Universities determined, and by who?",
        "response": "They aren't. They're considered *one of* the best universities in the world, but not the single best.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between the Sunni and Shia sects of Islam, and why is there so much hostility between them?",
        "response": "The Shiite group believes that only descendants of Muhammed should be leaders in/of the religion. The Sunni group believes that \"good\" (\"good\" meaning following the Quran and doing their religious duties well, etc.) should be the elected leaders in/of the religion. That's the main difference between the two, historically. A few differences in religious practices and and beliefs have fed fuel to that fire, probably leading to the relationship the groups currently have with each other after centuries of being at odds with each other.  Edit/Note: This was an extremely general, broad answer, which I am aware of. Also, there were a few mistakes in the statement, and I apologize for that. The knowledge I have on Islam is not extensive by any means, so this was just me trying to offer an answer without being entirely incorrect. Thanks guys!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How this tile blade works? (as many details as possible)",
        "response": "It isn't a friction saw actually, it's called a Wetsaw. Basically there's a tray filled with water under the saw with a pump that sprays water directly on the blade. The blade doesn't have teeth like a normal saw blade, its a continuous circle coated with industrial diamond dust. The diamond cuts through the tile, (it's not wood in the gif) but not soft material like flesh, due to the lubrication from the water. Source: have been setting tile for 8 years, using wetsaws for 15.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't the German forces better utilize their naval assets (u-boats) to destroy troop ships while crossing the channel on d-day?",
        "response": "you would have thought they would have mined the channel as well",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the world population growth rate declining?",
        "response": "When women are better educated and don't have to worry about whether their children are going to survive, many times they prefer to do something different with their lives. Even when they want children, they'll postpone to later in life, after they've achieved enough to have a satisfactory sense of accomplishment. And of course having reliable means of birth control, and availability of safe abortions contributes to women's abilities to plan their families.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Fire door occupancy, what is it? And why it's important?",
        "response": "It is the maximum number of people allowed in a building legally because it is the maximum number of people that can safely and reasonably exit a building in a set period of time if there were a fire.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does YouTube transfer money to the people who make videos",
        "response": "Not sure if it works this way for everyone, but this is how it works for me. Once a month the money you've accrued gets transfered to your AdSense account. Once that AdSense account hits at least $100 that then gets transferred into your bank account.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the Insert key on a keyboard have a light up like Caps Lock, Num Lock, and Scroll Lock?",
        "response": "Because insert itself *doesn't* toggle. It commonly changes the editing mode of many programs, but the program itself remembers that, not the computer or the keyboard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Noether theorem explains the constant speed of light?",
        "response": "Noether's Theorem does not explain the constancy of the speed of light. Noether's Theorem identifies conserved quantities, which means that you have something that can take all sorts of values, but for any given (isolated) system, its value won't change. Thus, for example, in two different collisions, the momentum will be conserved, but the value of the momentum in each case can be different. The idea is that if you set an initial value for something, the equations of motion are such that that something does not change its value -- but different initial conditions would have produced a different value. The speed of light is a constant of nature. It has the same value no matter who does the observing, no matter the situation. The constancy of the speed of light is still associated with a symmetry; [Lorentz invariance](_URL_0_) is the symmetry that causes there to be a speed that takes the same value for all observers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have ancient viruses ever been found?",
        "response": "somewhat relevant: there are actually \"ancient viruses\" found in our own DNA. Virus-like elements anyway... _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were the demographics of the US military in the 1950s and what filtered/sorted different demographics into different positions? Pilots and aviators were very disproportionately WASPs, weren't they?",
        "response": "One thing to remember is that with only small exceptions, pilots for the US military were, and are, officers. And even in the 50s that meant having a college degree. So while it is certainly not beyond the pale that some groups were discouraged from applying, the larger gatekeeper would have been higher education in general.  Since if you weren't in school you couldn't join ROTC, or later apply for OCS.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the cause of the American Civil War?",
        "response": "For an in depth answer, check out this [wonderful post](_URL_0_) in r/AskHistorians.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does an image get pixelated when I enlarge it. Yet the same image can be put on a huge billboard with no loss of quality?",
        "response": "You were not using the same version of the image, apparently.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can planes fly upside down?",
        "response": "Bernoulli's principle isn't just about the shape of the wing, it is about the angle the wing makes with the relative wind direction (angle of attack). The greater the angle, the greater the pressure differential, and the greater the lift. Having the top of the wing curved allows you to cheat a little bit, and get more lift than you otherwise would. If the wing was symmetrical (as it is with a lot of fighters) or curved on the bottom (as it would be when you are upside down), you lose some of the lift, but you can more than make up for it with angle of attack. Also, most airplanes are not designed for aerobatics like upside down flight. Those that are will have many design features, including wings designed with inverted lift in mind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/how did we develop a sense of rhythm and why do we enjoy music?",
        "response": "Possibly as a way to form cohesive groups- Even been in a big group of dancing, or chanting people? You know the way you lose your sense of self to a certain degree, and feel a sense of well being connected, more or less, to being here doing the same things as these people in the same place as these people? Imagine being a little tribe of hunter-gatherers on the Savannah and doing this on a regular basis with your tribe, and the benefits on group cohesion it'd have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do people who exercise regularly have a different tolerance for pain?",
        "response": "Yes, they do. All people have the same pain threshold. However, athletes have a higher pain tolerance than their non-exercising counterparts. A study by Jonas Tesarz found the highest tolerance levels in football players & cross-country skiiers.  Other studies have mentioned the psychological impact of frequent exercise, noting that repeated exposure to muscle soreness/pain brings a higher tolerance.  To read more on the subject, you can always check out [The Journal of the International Association for the Study of Pain](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get goosebumps?",
        "response": "I think it goes back to the days when our ancestors were more likely to be covered in hair. By 'flexing' the hair follicles, it would make the hair move away from the body a little bit, allowing for an insulating layer of air to be close to the body, thus keeping us warm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain why people succumb to \"mob mentality\" like im five.",
        "response": "Have you ever seen a swarm of birds, fish, insects, really any massive group of animals? They function as one at least somewhat cohesive unit. Humans are highly social apes, and when we \"swarm\" we also act as one group. You are \"hardwired\" to develop a compulsion to act as part of a group. Ever been in a large crowd at a concert, sports event, any other event, they start chanting and you get the urge to join in? That's the impulse, it's an evolutionary mechanism to make you function as a member of a group. If you have a group of monkeys or apes and one starts acting up, it is contagious and will work up all the other primates in the group in some capacity. We are apes, primates, and animals, subject to these same instincts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are most poisonous animals brightly coloured?",
        "response": "The predator species can develop in a way that they avoid the certain pattern. For example I've recently read a study that virtually all monkeys are predisposed to fear snakes (trait which have evolved long time ago). That explains why lots of people fear them, even though humans have evolved to be the best predators on Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What effect does centripetal force of the Earth's rotation have on our weight?",
        "response": "Centripetal force is:   Force = mass x radius x omega^2 The force of gravity (your \"weight\") is:   Force = G x mass_earth x mass_you / radius^2 The ratio of centripetal force to gravity is thus:    F_C   radius^3 x omega^2    ----- = -------------------------   F_G   G x mass_earth  Substituting values for everything except the radius of the Earth yields:   radius^3 / 7.538x10^22 m^3 The Earth's radius varies between 6356 km and 6378 km. So the centripetal force will be between 0.340% and 0.344% of the force of gravity. EDIT: Forgot to include 2pi in omega.  Values corrected.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(Possibly ELI12): Taylor series",
        "response": "Polynomials are wonderful. They are, in many senses, the simplest possible functions. We can do just about anything we want with them.  Almost all functions are not polynomials, but are much uglier and harder to deal with.  What Taylor series do is allow us to approximate any differentiable function with a polynomial. This is extremely useful not only for approximations and numerical estimates. In addition, the same technique applied to an infinitely differentiable function produces an infinite series which equals this function on a given interval. Again this can be much easier to work with than the original function. As an example, an area in combinatorics called generating functions has to do with building functions whose taylor series have a given sequence as coefficients. If you compute the taylor series of 1/(1-x-x^2 ), for example, you find the fibonacci numbers. This is a powerful technique which allows much analysis that wouldn't otherwise be possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Anglo saxons and the Vikings question",
        "response": "Hi there, I've answered this very question before [here](_URL_0_). The TL/DR of that link is that while the Anglo-Saxons would have been very aware of who the Vikings were, English society had changed greatly over ~300 years of settlement, Christianity and intermarriage with the British population, and English literary sources took great pains to emphasise the Pagan and foreign nature of the Vikings as an effective propaganda tool.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Global Warming and the Green Zone(please read more than title)",
        "response": "You're not uncovering land that has soil with the necessary nutrients and broken down soil that allows plants to grow. You're uncovering barren rocks and what soil there is doesn't have any nutrients. Also for the most part what you are doing is: 1) uncovering water that is blue-green and absorbs much more heat from the sun than the reflective white ice did.  2) melting permafrost that had trapped carbon dioxide and other carbon (non-decayed animals and plant material) that is now released into the atmosphere.  3) the time it takes for a tree to grow and capture carbon is very long and that is only temporary carbon storage until the tree dies and begins to decay.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to the earth/soil beneath large cities over time?",
        "response": "It really really depends on the type of geologic environment you're building on. In NYC, it's mostly alluvial, so the foundations of the buildings go very very deep, whereas in Finland, you can build a highrise just on almost the open ground because the bedrock is on the surface.  Buildings are no where near heavy enough to cause any kind of geologic phenomena (earthquakes) if that is what you are concerned about.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do flies get into surfaces where they don't fit into",
        "response": "I suspect that the body of the fly is smaller then you suspect and it can get deformed.Holes in net to keep insect out is smaller then that for a reason. Look at [_URL_0_](_URL_0_) for a human trough a hole. The limitation for a human is the width of the chest and the width of the head (you can turn it 90 degree). So humans can fit trough smaller holes the you would expect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a material that will not bounce, regardless of mass and the height from which it is dropped?",
        "response": "At a basic level, you'd need a system (the object dropped and the object its dropping on) to be able to expend all of it's energy into places other than elasticity. One of the more common forms of this is breaking. A lot of things that have an elastic nature get to a speed or mass that reveals a breaking point. So if something made up of atoms completely separated, then I suppose i wouldn't bouncing in the common sense.    The answer to this question also lies in your definition of bouncing. I'm certain there isn't a situation where there isn't some form of \"bouncing\" at a molecular level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; why does does it hurt more to hit a cold body part?",
        "response": "Your body reacts to coldness by decreasing blood flow in your limbs in order to keep your core on operating temperature. As low blood flow = less function, your fingers and toes start feeling numb and you lose dexterity as they're stiffing up, which is all a result of your nerves being numbed as well. But interestingly enough, probably for safety reasons, your pain receptors still work, unlike many others. So this means, that the input you normally have is \"turned off\", while pain is the only one still being \"transmitted\", which can be compared to being on a concert with a crying baby next to you (you won't really notice) or being in a quiet room with the same baby (really annoying).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does lumens work?",
        "response": "Let's look at what a \"40W\" light bulb means first. \"40W\" means that the bulb consumes 40 Watts of power. Exactly what a \"Watt\" is doesn't much matter. The point is that it measures how much power the bulb *uses*. Incandescent bulbs waste about 90% of their energy as heat (which makes Easy Bake Ovens work). This makes about as much sense as comparing car engines based on how much gas they use, rather than how much horsepower they have. Lumens, however, are an actual measurement of how much light a bulb emits. It doesn't matter if you're a wasteful fluorescent bulb or a super-efficient LED - rating the bulb in lumens gives you the same result. The problem is that saying \"40W equivalent\" is a meaningless term and has no basis in reality - it doesn't measure the power consumption *OR* the actual light output. Just assume that they're lying to you. A 40W bulb generally puts out 4-500 lumens of light. Claiming a 100 lumen light is close to that is just **wrong**.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would the AC electric field between a parallel plate capacitor look like?",
        "response": "It would look the exact same, except that the magnitude would vary with time, and occasionally it would reverse. Every cycle the + and - side would swap twice, and in the times between each side would slowly reduce to zero.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From an evolutionist standpoint, if warmth is necessary for survival, why did humans evolve without fur?",
        "response": "We lived in warm places and didn't need fur to live. Losing it made us cool down better when exercising, enabling us to endurance-hunt other animals who cannot exert themselves as much continuously over a long time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Why does paper get weaker when wet?",
        "response": "ITT: So much misinformation.  Paper gets weak when wet because hemicellulose and cellulose (what wood pulp is mostly made of) relies on hydrogen bonding to stick together. Hemicellulose is extremely hydrophilic (water loving), and the water gets between the molecules. It loves to bond to water, but the bonds are loose enough that the water can escape. Once the water is gone, the cellulose molecules are bonded together strongly enough for what we use it for. There are no glues.  In the tissue industry, wet strength resins are added to protect these bonds for towel production. For bathroom tissue, this property of cellulose and hemicellulose is highly desirable so that you don't plug piping.  Source: process engineer in the paper industry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does Hitler have a death certificate?",
        "response": "Probably not, given the circumstances of his death and the later political situation. After his death and subsequent semi-cremation (with gasoline, in a bomb crater, with Red Army troops closing in), the Soviets pretty quickly captured the area. Despite the fact that they actually possessed what are very likely to be his remains (they were buried and later destroyed by the KGB), it was the official position of the USSR that Hitler was hiding in the West after the war, so they wouldn't have issued any sort of death certificate.  They took this position for ideological reasons: Fascism was a logical extension of liberal democracy according to Marxist thought (this is a vast oversimplification), so ideologically the Western allies were ideologically aligned with the Nazis and were thus protecting them after the war. This shows up elsewhere in postwar Soviet propaganda as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Russians abandon so many buildings after the Soviet Fall?",
        "response": "Very simply said: Costs. It would cost more to tear down a building, and to refurbish it for something else, than just abandon it and don't have to pay upkeep.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is so special about go pro type cameras that can't be done with just any video camera.",
        "response": "They are a small, light, durable, relatively inexpensive camera that comes with a protective waterproof casing. The casing has a stand that can easily be mounted on a variety of surfaces. The result is a camera that can be used in harsh environments without breaking, and is cheap enough that if it does break it won't bankrupt you to replace. There are a number of camera that can do this, but GoPro was the first to combine these features in an easy to use product.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does the toilet bowl crack when you put a lit firecracker in it.",
        "response": "When a firecracker goes off in air, the energy is transferred to the air around it, making a relatively large explosion in comparison to water, but since air is so thin and lacking in density, the explosion doesn't do much real damage. In water, however, the explosion will be smaller because it takes more energy to move water than air, but because the water is much denser than air it has more destructive force. Think of it as the difference between getting hit by 40 mph wind and 40 mph water. The wind has no way of knocking you over or harming you at that speed, but the water could do some damage. This is why the firecracker in the water of the toilet shattered the toilet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you photoshop something \"out\" of a picture, how do you recreate what is behind it?",
        "response": "You use piece of the surrounding background, an additional photo of similar appearance or your paint it back like a painter would.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were the taxes and economic policies that Britain imposed on America in the 18th century really that unfair?",
        "response": "I'm going to let Trib173 or one of the more knowledgeable early American historians answer. But one thing you should keep in mind that is British rule in America was largely one of benign neglect. Britain was largely absent from the colonial system. Now take that in the context in a government that was all of a sudden very real and on your door step and you can see why the colonists were panicked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Alexander the great cross into Italy?",
        "response": "I discussed this question a while ago [here](_URL_0_). Italy was certainly known to the Greeks; indeed, much of it was settled by Greeks, which is why some of the finest surviving Ancient Greek ruins are in Italy. But there wasn't much there for Alexander until after he'd dealt with the more obvious, more legitimate, and more attractive opponent in the East.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the frets on a guitar smaller the higher you get, when the frequency-delta separating two notes actually increases the higher the notes are?",
        "response": "Because an octave interval is equivalent to doubling (or halving) a frequency. 16 - - - - - - - - 8 - - - 4 - 2 1 8 is closer to 4 than it is to 16.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we all work together cooperatively and be a \"big happy family\"?",
        "response": "Find a definition of \"happy\" that we all agree with, and a means of achieving it and I'm sure we all can be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we hear our own voices differently than how we actually sound?",
        "response": "Because you hear your voice conducted through the structure of your skull. Others simply hear your voice mouth to ear.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were slaves ever used for fights such as in the movie \"Django Unchained\"?",
        "response": "No evidence has been found that stuff like this ever took place with any regularity:  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do people get the urge to write obscenities on toilet cubicle walls?",
        "response": "I used to see it a lot more before the proliferation of smartphones. Basically, boredom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is OPEC and how is affecting oil prices?",
        "response": "They are a collection of the biggest oil producing countries. They had a meeting to decide whether or not to slow down oil production. They decided not to slow it down and because there is plenty in surplus at the minute then supply is greater than the demand which forces down the price.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do communication satellites like those used for GPS or Television service thousands of transmit/receive signals at once?",
        "response": "GPS and Television are bad examples, because those are broadcast-based technologies. GPS and Television satellites broadcast the same signal for everyone to receive, so they don't need to worry about addressing thousands of signals; they only need to transmit one signal. There are, however, communication satellites (Satellite phone, satellite internet, etc) that do have to communicate with many devices, which /u/thephoton describes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is this I'm looking at? (I'd ask a more specific question but I honestly do not know how)",
        "response": "Interest is the first step good sir. I do not know the exact gas used in this experiment but it is a gas that is denser than air. The tin foil itself is light and is originally filled with normal air but sits atop the denser gas which produces a buoyant force greater than the tin foil + weight of air and thus the boat floats. However when the cup is used to scoop out the denser gas and the gas is poured into the boat, the denser gas displaces the air and causes the density of the boat to increase thus causing it to sink. With most gases like this I believe you can inhale it and it will lower the pitch of your voice, acting the opposite of helium. This denser gas has the same appearance of air (transparent) and thus it makes it look like magic even though the tank is filled with a gas different than what is above and outside the tank. Just imagine the invisible gas is akin to water as they are both denser than air and consequently you will get the same effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the movie Django Unchained a character called Dr King Schultz is portrayed as a Liberal minded German Bounty Hunter who is appalled at American Slavery but while also carrying around an almost Prussian like identity. Is he based on any historical precedent/would a person like him exist in 1858?",
        "response": "Could you clarify what about Schultz you found to be \"Prussian\" as opposed to more generally \"German\"?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Greek and Latin served as the foundation for many languages, how were Greek and Latin words derived?",
        "response": "Greek and Latin are both part of a language family called Indo-European. Linguists believe all languages in that family derived from a common origin language they call Proto-Indo-European. [This is a pretty neat \"family tree\" of those languages](_URL_0_) that was making the rounds online recently. But for more specific details, I think [this page has a lot of good information](_URL_1_) about how Proto-Indo-European evolved and split into the more modern language groups. In the column 7 families on the right, \"Hellenic\" is what would give rise to Greek, and \"Italic\" would give rise to Latin. (\"Germanic\" would give rise to English, although our language picked up a lot of vocabulary words from the other branches along the way.) Then, [this other page of theirs](_URL_2_) has more modern breakdowns of how those language families evolved starting in about 2000 BC and going to the modern day.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How likely is it that we know \"the true\" history in the past 100 years, since it's widely known that “History is written by the victors.” ?",
        "response": "So the trope of \"Winners Write History\" is hardly as clear cut as your premise pivots on. It has been addressed here in the past, and I would highly recommend you check out /u/agentdcf's excellent response to [\"How do Historians get around the \"silent evidence\" problem or the \"Winners write history\" problem?\"](_URL_1_) as well as /u/restricteddata's answer to [\"Why should I believe what a historian writes?\"](_URL_0_). Hope that helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do neutron stars generate a magnetic field?",
        "response": "Neutron stars are made up of more than just neutrons. Neutronium is only stable under intense pressures, near the surface of the star the pressure diminishes due to the reduced amount of overlying material. Consequently, neutron stars have a \"crust\" of material of different composition. The deepest parts of the crust contains electrons mixed with neutrons and nuclei, the outer part of the crust is entirely atomic nuclei and electrons (electron degenerate plasma similar to white dwarf star material). The mantle is made up of a [nuclear pasta](_URL_0_) where superfluid neutronium mixes with nuclei and electrons in various shapes depending on density. Even in the core there are protons, electrons, and muons. All of these things aside can contribute strongly to magnetic field production. The core of the neutron star is a superfluid which can carry charged electrons and particles in currents, setting up the potential for very strong magnetic dynamos.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are pyramid schemes?",
        "response": "Pay me five bucks and I'll tell you. Then for every person YOU convince to ask me I'll give you a dollar! You only have to convince six people and it's pure profit for you!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Genghis Khan look like? Is there any truth in the claims that he had red hair and green eyes?",
        "response": "Here's a previous thread discussing the subject, if you're interested: _URL_0_ Edit: /u/quickspore made a great post in there, since I have been asked to link to specific users who answered the question then.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does our body want to move when we hold in our pee?",
        "response": "A full bladder is uncomfortable and creates a sense of urgency in our mind. The conflict between the desire to take action to relieve the stress and the fact that circumstances don’t currently permit us to, gets translated into various rhythmic displacement behaviours. These include humming to ourselves, clenching and unclenching muscles or hopping from foot to foot, despite the fact that remaining still and calm actually allows you to last for longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are numbers such as Pi and e actually calculated?",
        "response": "There are different ways, especially for pi. I'll focus on ones that are easy to understand, which may not be the most efficient. Because the tangent of pi/4 radians (45 degrees) is 1, the inverse tangent of 1 is pi/4, and by approximating the inverse tangent function as a polynomial series, we can calculate it as: pi=4 x (1 - 1/3 + 1/5 - 1/7 + 1/9 - 1/11...) This is Leibnitz' formula (although it was known earlier in India), and is really slow (it takes hundreds of terms to get a few digits). e is the limit of an exponentially growing process as the rate gets smaller and smaller. That means we can calculate e as the limit of (1+1/n)^n as n goes to infinity. (1+1/1000)^1000 =2.717, for example. Another formula for e is the sum of reciprocal factorials: e=2 + 1/2 + 1/6 + 1/24 + 1/120 + 1/720... where each denominator is 1x2, 1x2x3, 1x2x3x4 etc. These formulae involving sums will make sense if you've taken a class on calculus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would conserving water in Michigan affect the water crisis in California?",
        "response": "It would not have any effect. Without some reasonable way to transport massive amounts of water over long distances, the water supply in MI doesn't really have any way to influence CA's water supply.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was New Horizons 72 seconds too early for the Pluto flyby?",
        "response": "It's a matter of error percentages. The time from launch to flyby was almost 10 years, the distances span millions of miles, and yet the error was only 72 seconds. It's like dividing 20 by 3: technically it goes 6.666... forever but at some point it's \"good enough\" to say it's equal to 6.667 or something because you don't really care about the difference of .00000000001 or whatever it is. Any number of little approximations like that could have caused the discrepancy. Something that immediately comes to mind is that perhaps the measurement of the craft's speed was off by a fraction of a percent. Or maybe the calculations of how the Sun and Earth and Jupiter and Pluto would gravitationally pull the craft were off by a bit. Or all those at once, plus other problems.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How powerful were telescopes used by Galileo Galilei and Giovanni Cassini?",
        "response": "The [Wikipedia page](_URL_1_) gives an idea how the view might have been:  > Galileo’s best telescope magnified objects about 30 times. Because of flaws in its design, such as the shape of the lens and the narrow field of view, the images were blurry and distorted. Despite these flaws, the telescope was still good enough for Galileo to explore the sky. The Galilean telescope could view the phases of Venus, and was able to see craters on the Moon and four moons orbiting Jupiter. [And](_URL_2_)  > He shares with Robert Hooke credit for the discovery of the Great Red Spot on Jupiter (ca. 1665). Around 1690, Cassini was the first to observe differential rotation within Jupiter's atmosphere. You need to see quite some details on Jupiter to discover this. [Maybe something like this](_URL_0_), probably better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The physics behind luge. How do the athletes strategize?",
        "response": "\"*Lie flat and try not to die.*\"    -- Carmen Boyle (Olympic Luge Gold Medal winner - 1996)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pain is obviously the way of the body telling us something is wrong, but why can it get so severe that it cripples us?",
        "response": "Under normal circumstances, such as a cut or small wound, the body tells us that there is indeed an injury. Or doing something anatomically inappropriate, sticking your finger in boiling water, or touching something sharp for example is a defensive mechanism from your body that tells your brain \"Don't do that again.\" Most of the time, these types of insults to the body are not crippling. When an injury occurs to the body that is beyond this normal realm, it tends to be a crippling pain. Such as an amputation of a leg, broken bone, or large wound. Before modern medicine, these would have likely killed the individual. Things that elicit crippling pain tend to be very severe in nature and life threatening. Once a pain threshold is met, many people typically loose consciousness anyways, another defensive mechanism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if it requires so much less energy to perform work (like lifting weight) than to generate heat, why do engines generate so much waste heat?",
        "response": "Well a combustion engine essentially runs on small explosions, which generate a lot of heat. Its old technology that generates a lot of waste.  Electric engines don't generate much heat at all. That's why we typically don't have to water cool them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do hotels have open WiFi with a landing page to type the password, instead of a regular passworded WiFi network?",
        "response": "Many hotels have you log in with your room number and last name, so that only current guests can get access. For the ones with a single password, it's probably so they can make you agree to the terms of use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen to digital security if we had a massive spike in computational power?",
        "response": "We use that computer to make more complex and incalculable encryption. Cat and mouse. The ability to crack my encryption got better, so I just build better encryption",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why it's dangerous to look at an eclipse.",
        "response": "Staring at the sun can expose your eyes to harmful ultraviolet rays. When the sun is its normal brightness, this is hard to do (but not impossible) because it will cause you physical pain, and your pupils will contract as much as they can. It's also pretty pointless, since the Sun is normally so bright that you can't make out any features when you look at it.   During a full/partial eclipse, it is possible that the moon will dim the total brightness of the sun enough that you can stand to look at it for some time without flinching away in pain, and your pupil might not even contract all that much. But you will still be getting too much harmful UV.   Today's transit of the Sun by Venus is more like any normal day, since the Sun will still be very bright and painful to look at. But some fools might be more motivated to force themselves to stare at it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Scotch-Irish considered one group, and separate from English, when they are different countries with different beliefs?",
        "response": "I believe the confusion here stems from the usage of the term \"Scotch-Irish\" to denote the ethnic group in question. Scotch-Irish does not actually refer to a collective grouping of both Scottish and Irish peoples. Scotch-Irish is another (sometimes considered pejorative) name for Ulster Scots, which were a group of ethnic Scots who settled in Northern Ireland as part of an English state-sponsored plan to colonize Ireland and dispossess its landowners. So, in a simplified sense, Irish refers to ethnic Irish living in Ireland, Scottish refers to ethnic Scots living in Scotland, and Scotch-Irish (Ulster Scots) refers to ethnic Scots living in Northern Ireland. Source: Jane Kenyon, Jane Ohlmeyer, *The Civil Wars: A Military History of England, Scotland and Ireland 1638–1660*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that we need social interaction so much that we get attached to inanimate objects in the absence of it?",
        "response": "Because normal humans are intensely social creatures. We originated from creatures a lot like [this](_URL_0_) and basically we're not a whole lot different today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Asexual Reproduction vs Sexual Reproduction: Which is better at adapting?",
        "response": "Circumstance would factor heavily into it. We know that nature's usual approach to problem solving is to throw up random solutions until something seems to work, and then throw variations on that until something works better, and so on. No need for any higher order planning; if it's not suited to the task, it's eliminated, and what survived is being constantly evaluated.  So how fast you can adapt depends on how fast you can run through generations and how many changes you get to test with each generation. [Sexual reproduction](_URL_1_) seems to be better at producing those variations (but takes longer), while the fastest reproducing organisms (e.g. [bacteria like e. coli](_URL_0_)) tend to be asexual (but you get fewer variations per generation).  Given that we see plenty of examples of both there isn't one that's universally better than the other. It all depends on what the organism is adapting to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Hollywood avoid equal opportunity laws?",
        "response": "Equal opportunity laws only count when the candidates for a position are equally qualified. If a character is supposed to be a particular race then requiring an actor to look & act as a member of that race is a [bonafide occupational qualification](_URL_0_) and it doesn't count as *illegal* discrimination. It's important to note that they can't discriminate on *actual* race but rather **apparent** race. A light-skinned black man could get passed over for a role for not being \"black enough\" while a dark skinned Indian might qualify for it. On top of that, acting ability is far too subjective for anyone to make a meaningful discrimination suit stick.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How has Mongolia retained its independence?",
        "response": "It only broke free in 1921.  I would say the primary reason it is independent is because (from wikipedia)  > As of 2006, 68.4% of Mongolia's exports went to the PRC, and the PRC supplied 29.8% of Mongolia's imports When goods cross borders, troops do not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to develop our night vision?",
        "response": "It is not that easy. While our eyes do in fact get used to seeing in dark places it won't be easy for them to see perfectly. We have a series of light sensitive cells inside our eyes. Some of them get \"burned out\" when looking at bright light, but they quickly heal when no longer exposed to light. This causes us to \"get used\" to dark places. While they may take even a day to get completely healed, there can be no further improvement in their work after that. So long story short: not really.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to estimate cooking time knowing three simple factors?",
        "response": "Different forms of matter conduct heat differently. A piece of celery is going to cook differently than a piece of steak, for example. Shape would also impact cooking time. A 1kg chicken in a perfect sphere will have a different cooking time than a 1kg chicken that’s been turned into a skinny rope.  These are two examples that come to mind, but I’m sure there’s more. Heat transfer isn’t consistent, and a lot of things can impact it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are food calories measured?",
        "response": "Did you bother looking it up yourself? This has been asked a million times here already. The search feature is invaluable. Use it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come New York City is so expensive yet 8,000,000 can live there?",
        "response": "There's cheaper areas in New York City. It's bigger than you think. Manhattan is ridiculously expensive, Brooklyn is pretty expensive. Queens is somewhat reasonable. Staten Island and the Bronx aren't bad. Also people are willing to live in tiny places in Manhattan. So someone might pay $1200/month which is pretty affordable to live in Manhattan, but the place will be tiny. For example [this lady](_URL_0_) is paying $700/month to live in Manhattan. Of course her place is a tiny 90 Sq feet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren’t protein supplements FDA approved?",
        "response": "Weight-loss and other diet supplement related items don't have to have FDA approval. Therefore, they don't get it basically so they don't have to really prove that it works and they don't have to keep their facilities that clean.  I'm not sure why they never got put into the category of having to get the approval. Probably because it started as a relatively small product market and it's hard to draw the line. Pediasure (sp?) and weight loss/meal replacement shakes are practically the same thing, but are marketed differently. Would they both need FDA approval?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I steal a game/music from a store and am caught there's up to a $500 fine, but if I download it instead then the fine is up to $250,000.",
        "response": "If you steal a game/music from a store then you are accused of Theft. That has either a fine or jail time as a punishment. Now when you download a game or a song, then you are also uploading that song. That means that you not only downloaded a copyrighted work without paying for it, you also made it available for others to copy it from you. Now the company can sue you for the loss in revenue because of your actions. Thats mostly what the big fines are for. But for the most part, its a way for them to scare people from downloading stuff online which they haven't paid for.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't Coke done a partnership with Fallout (or any similar situation)?",
        "response": "Fallout is probably just a little too R rated for Coke to be comfortable with. One parent group getting butt hurt over exploding headshots could lead to negative publicity that would undo any marketing tie in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to be \"moonburned?\"",
        "response": "According to the [cited article from the Wikipedia entry](_URL_0_), moonlight is approximately 500,000 times weaker than direct sunlight, in terms of overall intensity. According [to this article](_URL_1_), the Moon is approximately even in reflecting most wavelengths of light, except at 190, 620, and to a lesser extent 400 nm (where it is significantly lower). We consider UV light between 10 and 400 nm, so on average the amount of UV light being reflected from the moon is slightly lower in proportion to the overall average.  So how much UV is being reflected from the moon? Not much at all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the whole story with the Syrian refugees in the news?",
        "response": "Basically, due to the Syrian civil war nearly 11 milion people have been displaced. Many of those settled in neighboring countries like Turkey, Egypt and Libya. The problem is that those countries have become unsafe for refugees. The new Egyptian government is hostile to the refugees and is forcing them on to Libya, however in Libya the government has all but collapsed and IS is on the rise there. In Turkey there has been a wave of attacks on refugees and increased fighting by the Kurds. This is causing many refugees to flee those countries, and most are seeking the safety and stability of Europe. The problem is that Europe, seeing that these people are not fleeing from their country of origin has labelled them as migrants instead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did engineers figure out trajectories needed to get to the moon?",
        "response": "> It’s not like they can just point the rocket at the moon and blast off.  You're right. They know how big Earth is and how fast it's moving, and they know the same about the moon. All that's left is to figure out where each will be at a certain time to get the payload (lander, shuttle, or whatever) from Earth to moon when launched to a certain spot on the moon from a certain spot on Earth. Basically, r/theydidthemath. Lots of math.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if two people moving faster than the speed of sound tried to have a conversation. Flash/Quicksilver for example.",
        "response": "If Flash and Quicksilver were running next to each other, and Flash said something, the sound would never reach Quicksilver's ears. If Flash was in front, Quicksilver could hear him, but Flash couldn't hear what was said back. If Flash stopped while in front, he could hear what Quicksilver was saying, but it would be time reversed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can Koch snowflakes have an unlimited perimeter when the sum of a decreasing geometric sequence approaches a limit?",
        "response": "The perimeter is not a decreasing geometric sequence; it is increasing. After each iteration, the number of sides of the Koch snowflake increases multiplicatively by 4, and the length of each side decreases by a factor of 3, so the perimeter after n iterations scales with (4/3)^(n), which is an infinite sum.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do MRI machines make so much noise? Xrays, ultrasound machines, and CT scans are quiet?",
        "response": "An MRI machine uses giant electromagnets. One of them, the stronger and bigger one, is on all the time, but the other is switched on and off in rapid pulses for each measurement. Even though none of the metal inside the machine is magnetic, the coil moves each time you do that. You could compare that to the noise caused by an electric transformer, except that it's huge and very close to your ears when inside the machine. Xray, CT and ultrasound are quiet because they don't have such large coils. The ultrasound is just a speaker that generates very high frequencies (which you can't hear), an X-Ray just has a very small rotating metal bit inside of its tube which doesn't cause much noise at all. CT makes some sounds because it is a giant rotating x-ray machine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can you have phantom pain, how does it work?",
        "response": "Pain is a sensation in the mind. When you feel pain, it's a signal that transmits from the hurt location through the nervous system to the brain. After amputation, the start of this trajectory is gone, but the rest of the nerves that handled it, as well as the part of the brain that interpreted it, is still there. The cut-off end of the nerve can occasionally send incorrect signals, which are interpreted as phantom pain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were ancestors of humans able to breed between each other?",
        "response": "evolution doesn't happen in sudden jumps. You don't have a member of one species suddenly give birth to a member of a new species. Its very small changes over a very long time, so any two individuals in the same time should be able to continue Breeding with each other",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I remember in a college history class a student that immigrated from a middle eastern country. Commented that word \"Moor\" was a just insult by Europeans and not really a accurate name. Is this true?",
        "response": "Hi, there have been a few comments about the origin and use of the term \"Moor\"; you may be interested in these * /u/XenophonTheAthenian in [When did \"Moor\" start referring to Africans rather than Mediterranean Muslims?](_URL_1_) * [Can you please explain the relationship between the Moors and the Berbers?](_URL_2_) * /u/Miodi in [Why are Moors depicted with a black/dark skin when they were Berber and Arab settlers?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come my dog has enough energy to play fetch across the yard all day long, but I get tired after running a mile?",
        "response": "I'm going to rip this from /u/hadman : **\"Because they're doing exactly what they want. They don't have to convince themselves to perform menial tasks for some future reward like most humans do, and so their bodies don't rebel. You'll see that people who are doing exactly what they believe in/are passionate about have similar levels of energy.\"** (Answer to a similar question from 2 years ago.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a red tinted camera lens make underwater photos look better?",
        "response": "A red filter is red because it absorbs colors that aren't red (allowing only red light to get through to your eyes). Water acts as a blue filter. A red filter absorbs a lot of that excessively-blue light, yielding a more natural-looking balance of colors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How could an asteroid that's only 6mi wide cause a mass extinction event?",
        "response": "The meteor won't do anything to the Earth itself.  What it will do is throw up a cloud of dust that blocks most of the light from the Sun from reaching the surface. This cloud not only blocks infrared heat but also blocks visible light. Alot life on Earth derive food from plants, either directly or indirectly, which uses visible light. No food, starve to death.  Most life on Earth also live in a comfortable zone of temperature. If that temperature drops in the matter of months and doesn't come back up, alot of life won't be able to proliferate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are free divers like Guillaume Néry able to go into the depths on a single breath?",
        "response": "Free divers (people that dive down long distances) have tricks to dive deep. To keep the oxygen inside them for longer, they take advantage of something called the divers reflex. The divers reflex slows your heart rate, it's activated by jumping into cold water. Another thing they may do is hyperventilating before they jump in [DON'T TRY THIS, IT'S DANGEROUS]. Hyperventilating before let's you lower your level of co^2 which is something your body needs to get rid of when you hold your breath. When you breath your body get's rid of co^2 and takes in oxygen. Your body builds up co^2 quicker than it's need for oxygen. By lowering the levels of co^2 before you jump in you can stay in until your oxygen runs out. Free divers also usually have very large lungs to hold in more air so they can stay underwater for longer. I'm not fully sure how they combat buoyancy but it definitely is a challenge. Here's a link that goes more in depth _URL_0_.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the steam released from nuclear reactors radioactive?",
        "response": "Massive oversimplification, but: A.The fuel is clad in tubes, so there isn't any direct contact between the fuel and the cooling water.  B. the cooling water isn't directly turned into steam. It is kept under pressure to prevent it from boiling. C. The superheated cooling water is pumped through a heat exchanger. The water in the heat exchanger then boils, and that is where the steam in generated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Theory Thursday | Academic/Professional History Free-for-All",
        "response": "During my studies, we learned about David Irving's Holocaust-denial(although he denies his own denial).  My question is what do you other professional historians and \"amateur\" historians(to use the correct term, not to talk you down) think of his and other historians denial of something as certain as the Holocaust. I know that in history, you can't say anything is a fact other than that we truly know nothing, but some events are more \"true\" than others.  Is he ruining it for everyone by denying it, or are we historians such a trusted group that a few individuals can't deligitimize us? And to further this, what do you think of the internet as conveyer of history? Communities as this are rare, and misinformation is easily spread. Speaking for myself, I'm afraid of the spread of misinformation, but being active in spreading well researched information should be able to keep it down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Facebook privacy and does that disclaimer I'm seeing actually do anything?",
        "response": "The disclaimer is a good way of discovering who in your friends list has a high school level understanding of contracts and End-User License Agreements, Terms of Service, etc.  Legally it holds as much ground as going outside and saying, \"I declare bankruptcy\" does to ease your debts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that I have to point my remote control at my cable box in order for it to work, but my wireless PlayStation controller will still work even if my PlayStation is located behind me?",
        "response": "Your playstation controller is using radio waves (specifically microwaves in the 2.4ghz band) which are expanding outward, more or less in a sphere, and are capable of penetrating some solid objects. Your TV remote is likely using infrared light which is invisible to the human eye. It will generally travel only forward from the remote, and will be blocked by most solid things (including the remote itself, which is why it generally goes one direction). If you can't see through it, your remote probably can't either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When 15-35 knights in the Order of Dobrzyń decided to march into pagan territory and attack Dobrzyń Land, how did they think they'd have a chance? Were they just very religiously motivated, or did they actually have very good armor and horses and were just unlucky?",
        "response": "1) They didn't \"march into pagan territory to attack Dobrzyn land\". Dobrzyn land was the territory they received from Konrad of Mazovia, and it was Polish rather than pagan Prussian (similarly the Teutonic Order would later receive the Chelmno Land). 2) The 35 you're talking about were knight-brothers. There would be other members, servants etc. so their actual fighting strength was higher.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Some questions on the characteristics of Julius Caesar.",
        "response": "Caesar is an enormously complicated figure who has had as much written on him as anyone not directly responsible for starting a religious movement. He is also such a complex personality that everyone reading of him comes away with a different impression.  Side note: There is a really interesting book called *Caesar: A Life in Western Culture* by Maria Wyke that is a sort of \"biography of biographies\", taking individual episodes of Caesar's life and showing their reception in different periods of history. Definitely worth reading. Anyway, my point is that you will really need to go back to the sources. Granted, digging through Cicero's letters, reading the *Pharsalia* and parsing through the commentaries is a bit much for a ten minute presentation, but I definitely think it is worth it to read Plutarch and Suetonius--or at least Suetonius. Neither of these are particularly long and they are both a lot of fun, so it is definitely doable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there so few blue, green, or purple mammals?",
        "response": "[This column](_URL_0_) has an in-depth answer, focusing specifically on the absence of the color green. But as it turns out, mammals are only capable of generating brown-black pigment (the melanin that gives skin its tan) and reddish-yellow. These are the dyes which, in various combinations or absences, are responsible for the limited mammalian color palette.    It turns out, amazingly enough, that other terrestrial vertebrates can't create blue or green pigments either! The array of [cool colors](_URL_1_) we see in birds, amphibians, and the like (as well as many brilliantly-colored insects like tropical butterflies) are actually caused by microscopic structures in their feathers or skin. These structures refract the light that bounces off of them, like a prism or a CD, causing us to perceive them as a particular color.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can news outlets call elections with less than 10% of precincts reporting?",
        "response": "In addition to the official numbers from the precincts, they also use exit polls. In all but the closest races, they have a decent idea of how things will go even before voting starts, from polls taken leading up to election day.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do years feel progressively shorter as we age?",
        "response": "Routine. When you're young, life is full of new experiences and change. But there comes a time when established routine takes over and there is less to differentiate one day from the next. A steady diet of get up, go to work, come home, kiss the wife, beat the children, go to bed get up, go to work etc. causes one day to blend into the next and the years blast by and you're suddenly old.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does alcohol dehydrate you?",
        "response": "You make a hormone called vasopressin. One of the functions of it is to maintain water in your body. Alcohol inhibits the production of it. As a result, your kidneys don't reabsorb as much water as they would otherwise, and instead you whizz it out.",
        "source": "sentence-transformers/eli5"
    }
]