[
    {
        "query": "Why can't you roll down a car window after the car is submerged under water?",
        "response": "The water pressure pushes in on the window. This makes it extremely hard to move up and down because the window is pressed against the gaskets in the door.  Similar to how if you put an empty shoe on the floor, you can easily slide it around by pushing with one hand... but if you try to push the same shoe with a person's weight in it, it will be nearly impossible to slide.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why some things that aren't a real evolutionary threat (i.e. spiders) such common phobias?",
        "response": "I think spider phobias are partially due to other people having spider phobias. As a child being told that something is scary (or seeing that other people are bothered by something) can be enough to cause us to develop the same fears.  Another theory, many phobias have a trigger that helped create them. Basically, something unpleasant happened to us as a child and we associate it with spiders causing a fear/dislike. This might be something as insignificant as walking into a spider web and disliking it. Finally, the idea of something small that could be anywhere and could deliver a poisonous bite is quite scary on its own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When do I use \"effect\", and when do I use \"affect\"?",
        "response": "Usually, \"affect\" is a verb and \"effect\" is a noun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is in between galaxies?",
        "response": "The 'intergalactic medium' (IGM) is mostly a rarified plasma. The heating mechanism depends on the particular environment -- the gas between galaxies in clusters tends to be very, very hot indeed (millions of kelvin), and emits in the X-ray. This is generally heated via gravitational shockwaves, as the gas falls into the massive gravitational potential of the cluster.  Other galaxies, with very active central black holes, can also dump energy into the IGM (which heats it up).  (EDIT... some people are taking issue with 'gravitation shock waves'. I was trying to say 'shock heating' in a non-fancy way).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could whole milk remove rust from an old cast iron skillet?",
        "response": "You're thinking of calcium metal, whereas milk contains calcium +2 ions. The ions are already in a +2 oxidation state and thus won't have any ability to reduce the iron oxide. Better to just scrub the rust off and reseason the skillet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what causes food cravings for foods that aren't necessary for survival?",
        "response": "Most of it is psychological. You've probably heard the term \"comfort food\", these are foods that are familiar, comforting, and make you happy. People most often crave these types of food when they're stressed, the sensations related to eating are already relaxing, but add in the aspects of familiarity and nostalgia and you have a strong urge to bake a lasagna or whip up some pancakes",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how could cities like New York build extensive subway lines in the early 20th century, but these days it seems like a simple extension of a current line costs an arm and a leg?",
        "response": "When the subways were first built there wasn't much in the ground. Now a hundred years later, there's a bunch in the ground. Sewage, water mains, cable, electricity, it all has to be rerouted if a new route cuts through them.  The subways weren't cheap in the first place. It cost about 35m for the original subway which is about a billion today. Count all the logistics of moving everything and you can see why adding an extension would be so expensive",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does hollywood insist on remakes and reboots?",
        "response": "Because there is an already established audience. Saves a lot on marketing therefore more profit. It's all about the money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is gravity made up of?",
        "response": "Gravity in general relativity is the curvature of the spacetime. Practically, it is the changing in how you measure lengths and times. In a more full theory of quantum gravity, which we do not yet process, there almost certainly would be some characteristic quanta which we'd call the graviton. This graviton would then be responsible for the exchange of energy and momentum between bodies with mass in a similar way the photon mediates the exchange of energy and momentum when two electrons bounce off each other.  > Light is made of photons,electro magnetic waves are made of electrons You've got this mixed up a bit. Electromagnetic waves *are* light and they are made up of photons. Electrons are just electrons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do non-clinical people (receptionists, etc.) in doctor’s offices wear scrubs?",
        "response": "People in reception, particularly in small offices, may wear a variety of hats during the day. Just because they are in reception at that moment doesn't mean they can't do other things where scrubs may be helpful. But primarily it becomes a uniform. Most of the other people working there wear scrubs so wearing them becomes a way to recognize an employee and show a uniformity of image.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does choking someone really work like the movies? Shouldn't the victim stop struggling from passing out rather than just dying immediately?",
        "response": "No, movies aren't accurate at all when it comes to choking and yes, the victim would absolutely pass out before dying. There are two types of chokes. Ones that restrict breathing and ones that restrict blood flow to the brain. The latter of the two has a much more immediate effect. With blood chokes, a person can lose consciousness in a matter of seconds, as the flow of oxygen-rich blood is stopped from reaching the brain, but it takes several minutes for the person to actually die. If this weren't the case then (stubborn)people competing in grappling events or mma would be dying all the time from choke holds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Holland is famous for its windmills. Did flour prices in medieval and early modern Holland fluctuate based on how windy a month was? Did millers mill more grain when it was windy and build stockpiles?",
        "response": "While u/amp1212 has provided a great answer, it is also worth noting that the association of the Netherlands with windmills is also due to their widespread use in the creation and maintenance of polders and reclaimed land, where they pump out water. Most existing Dutch windmills were used for this purpose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Cisa passed. What does this mean realistically, especially when states like California are passing privacy laws that seem to contradict the bill.",
        "response": "The local and state governments now have a system of extracting \"cybersecurity\" data from US companies which includes logs of your online activity that US websites and internet service providers have collected.  > it will move responsibility from private business to the government, thereby increasing vulnerability of personal private information, as well as dispersing personal private information across seven government agencies, including the NSA and local police.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do birds grow feathers?",
        "response": "Birds can re-grow feathers, (if one is damaged in a fight or accident) but it takes a while. If the feather is one of several needed for flight (e.g. the wing and tail feathers) a wild bird will be at a serious disadvantage. Captive birds will need to have it repaired and even then it will be weak until a new one grows in to replace it. Young birds will molt or shed their feathers periodically as they grow. I think adult birds molt on a yearly basis but I'm not sure. They're definitely not like human hair that keeps growing until it breaks, or falls out.  Hopefully an avian expert will be along that can explain better and in more detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do hackers find/gain 'backdoor' access to websites, databases etc.?",
        "response": "One time I was able to exploit a popular shopping cart to purchase any items I wished, at whatever price I wished. They have since fixed this window, so an example of the process was as follows: - Load up your cart with expensive items. Like 10 laptops, etc - Apply a 10% off promo code - Remove expensive items from the cart - The 10% discount dollar amount remained applied - Add new items you want to your cart - Enjoy massive discount With a little basic math, I was able to buy anything I wanted for any amount I wanted. To avoid instant detection, I discounted items around 90% instead of going all out free. All in all I got about $4,000 worth of solid merchandise for about $300 over the span of 3 months.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does one get into the deep web?",
        "response": "The \"deep web\" is just the parts of the world wide web that are not indexed by search engines. For example places that require login, like your private Facebook page or your e-mail. The term is often confused with the *dark net*, which requires to TOR browser to access.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "William Tecumseh Sherman and others were named after a famous Native American. Was this particularly common at the time, or was this only in Tecumseh's case?",
        "response": "Follow up, did Sherman ever express any sort of sense of connection with Native Americans based upon his name and presumably his parent's interest in the Natives?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How computers handles large numbers.",
        "response": "There are two ways. Your calculator likely uses [floating point arithmetic](_URL_0_). Instead of holding the number as-is, it holds two numbers - the mantissa (m) and the exponent (e) - which represent the number m\\*2^(e) (and one extra bit is used for the plus/minus sign). The number 2^64 is can then be represented using m=1 and e=64. It is also possible to represent large numbers in software with an array of numbers. Just like we can represent number of any size using a series of digits, you can for example represent 64 bits with two 32-bit numbers - the 1st number represents the higher order bits and the 2nd number represents the lower order bits. This makes the arithmetic a bit complicated of course - when you add two numbers, first you add the lower order bits, figure out what the carry would be, and then add the higher order bits along with the carry. You can use the same method to represent number of any size (96 bits are three 32-bit numbers, and so on).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why there is a limited amount of internet bandwidth",
        "response": "Each of the main cables connecting the continents and major cities can only carry a certain amount of bandwidth at a time, to balance this out and make sure everyone can get access they impose speed and data usage restrictions to make sure nobody uses too much of the network's capacity at once.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which came first, the virus or bacteria?",
        "response": "Viruses are dependent on other organisms to survive, so my guess is bacteria or some other microorganism came first.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Considering a lot of deep space images are 'coloured in' what are the actual colours of the images released by NASA etc.?",
        "response": "It's not so much that they're just colored in as it is that different frequencies of non-visible light are given corresponding frequencies of visible light so that the image can be displayed visually. The pictures themselves are technically accurate, they're just from a viewpoint that humans don't typically have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the most dangerous non-wartime city in history?",
        "response": "Pompeii.  All jesting aside, the slums of Victorian London were very bad.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the quantum chemistry model why don't the negatively charged electrons fly into the positively charged nucleus?",
        "response": "Every electronic orbital has *some* spatial overlap with the nucleus (although it’s only non-negligible for s orbitals). So the electronic wavefunctions *do* “make contact with” the nucleus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the camouflage skin of Octopi, Squid, and Cuddlefish match their surrounding color and texture so accurately?",
        "response": "They have highly specialized cells that get a signal from the brain when it detects a certain surrounding colour and then expand or contract in order to change the pigment in the cells. You can notice that they’re never fully campouphlaged but only partly and being under water helps them become ‘invisible’.  Due to lack of time I’ll post a link here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can black holes have a net non-neutral charge?",
        "response": "> Considering that charge is conserved, is the same true of charge?  Good observation, you are indeed correct. Black holes can be charged. In fact, the charge leads to two event horizons. The singularity would also have negative mass and thus be repulsive.  * _URL_0_  Presumably this difficulty and nonphysical result would have to be addressed by the yet unknown full theory of quantum gravity. As an aside, Hawking radiation for a charged black hole should more intensely emit charged radiation thus making the black hole more neutral over time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did exotic fruits such as bananas and pineapples when first brought to Europe, reach Britain without rotting during the long trip.",
        "response": "The banana had been cultivated in Asia for quite some time (Alexander the Great's empire encountered them in India). An article I found stated that large international traffic began only in the late 19th century with the development of refrigerated transport. Other articles I found made mention of dehydration, which I imagine might have been a primary way of doing business before refrigeration, but I couldn't find anything dedicated solely to dehydration to be sure.  Main source: Banana. Columbia Electronic Encyclopedia, 6Th Edition [serial online]. September 2013;:1. Available from: Academic Search Premier, Ipswich, MA. Accessed December 30, 2013.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can you only reheat things in the microwave once?",
        "response": "Why can't you reheat things in the microwave twice?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I just read an old article today about a 480 lb woman who died after a 6 hour surgery to remove her from her couch. She was physically fused to the couch after not moving for 6 years. How is this actually possible?",
        "response": "Surgeon here. The following description may be NSFW. She did not become fused with the couch. Like others have pointed out, this is impossible. But imagine her entire backside is an open wound, with exposed muscle and fat and bone, and the entire thing is slimy and full of pus. This can make it very hard to tell where she ends and the body fluid soaked couch begins. She likely did not die as a result of the surgery. I would be she was being separated from the couch because someone called the hospital due to severe infection and she died of massive overwhelming sepsis while the wound was being debrided.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Court of Swords in the Warlord Chronicles- Is it accurate? Discussion on Trial by combat in general",
        "response": "There is probably room for someone to specifically address Wales, but meanwhile you might find interesting [this earlier thread](_URL_0_) with an answer by /u/mikedash on trial by combat in Britain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if you told a police officer that you didn't understand your rights after hearing the Miranda warning?",
        "response": "Explain my rights to me... like I'm five?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't the word \"whom\" used more often?",
        "response": "Hi, I'm a linguist.  What you call \"grammatically correct\" is not grammatically correct. It is prescriptively correct, based on a bunch of rules made up out of the blue by a small group of self-righteous rich men in the 18th century, who thought that they knew what \"perfect\" language \"ought to be\".  The truth is that language changes, and it changes pretty fast. Starting around a hundred years ago, the word \"whom\" started to make an exit from the English vocabulary. Today, it's pretty much gone, only used in hyper-formal speech. It does not appear often, because it sounds extremely similar to the word \"who\" so that listeners often can't tell the difference anyway, and because English has already lost it's case distinction, so it's use does not help speakers understand a sentence any better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it sometimes so hard to get the first sneeze out but the following ones come so easy?",
        "response": "Sneezing is a process not unlike rebooting a computer; it traps foreign particles in the nostrils and sinuses, and regulates the beating of cilia (Microscopic Hairs,) inside your nose. To start these processes, a sneeze fires a pressurised blast of air through your nose, which leads to a few awkward seconds before the sneeze where the body builds up air to create the sneeze. This is also why you often hear the telltale \"AH! AH! AH!\" Before the \"CHOOOO,\" indicating inhalation. After this, the rapid respiration bought on by a sneezing fit is enough to fuel the cycle, until your nose is cleared and you return to normal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get eye gunk?",
        "response": "Is called rheum, is made up of (from the cornea) mucus, skin cells, dust and other debris. It's found around the eyes nose and mouth, all of which secrets one or more of the above when you sleep. It does not serve a purpose, it is instead a byproduct of the above who in the case of your eyes serves as a lubricant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is dawn light (pale, white) different from dusk light (harsh, yellow)?",
        "response": "temperature. dawn heats up the atmosphere. dusk atmosphere is already heated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "References to \"God\" in ancient historical texts like Livy",
        "response": "Probably just a feature of the translator. The translator for [this edition](_URL_1_) (a Reverend, coincidentally) makes no mention of \"God,\" but a lot of references to \"gods.\" [book 1](_URL_1_) [book 2](_URL_0_) [book 3] (_URL_4_)  [book 4] (_URL_3_) [book 5] (_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a way to find the common ancestor between any two species?",
        "response": "You're looking for what is called the Last Common Ancestor. Determining relationships between species is done through morphology (less used now) and DNA comparison. There's a whole subfield of biology called phylogenetics that studies these relationships through DNA. Richard Dawkins wrote a beautiful popsci book, *The Ancestor's Tale* that uses this concept to link humans to all life and explain many concepts in biology along the way. If you're looking for a database, using wikipedia's page on the two species in questions and going backwards through the classification tree until they meet is not a bad way of going about it. You can do a similar exploration with the online [tree of life project](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do wormholes have mass?",
        "response": "Wormholes would be affected by gravity the same way everything else is, even if they didn't have mass, since gravity is the curvature of spacetime. If you place a wormhole near the surface of the Earth, it would fall down. See [this comment](_URL_0_) from /u/adamsolomon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people complain about illegal immigrants taking jobs? Shouldn't they complain about the companies who give illegals jobs?",
        "response": "The is nothing to be explained other than the person that hire those illegal immigrants are of the same nationality of the person that complains about it.  Very often those who hire illegals are complaining about it too since they feel that they cannot compete legally.  Finally, \"Taking jobs\" that most citizens don't want is a very bad argument. Most of the jobs that illegals \"take\" are daily jobs with little money that provide no income security nor benefits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there tornadoes in Europe?",
        "response": "Yes. In fact, per unit area, the UK gets more (reported) tornadoes, whirlwinds and waterspouts than ~~anywhere else~~ any other country in the world*. The difference is that we don't have the big open plains environment that allows truly massive storms to develop, so what we get are usually no more than an F0. In the US you have a conflagration of factors which produce very strong tornadoes - you have a very wide flat basin plain across the centre of the country, over which cold polar air can interact with warm tropical air. In Europe and Asia these air masses have a very much harder time coming together because we have the Alps and the Himalaya respectively.  *See wazoheat response below",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the energy density remain the same in an expanding universe?",
        "response": "This isn't exactly correct. The energy density of the universe is decreasing with expansion, as a finite number of photons and baryons are occupying a constantly larger and larger space. What is believed by many cosmologists is that there is a separate source of energy dubbed a \"cosmological constant\" which is invariant with respect to the expansion of space. In other words, when you double the amount of space through expansion, you double the CC energy. The short answer to your question is that (assuming the CC interpretation is correct) we have no idea. Research in this area is quite new, since cosmic acceleration was first observed about 15 years ago. But it would have to be a fundamental property of space.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If poaching is such a big problem in some countries, why don't we just set a bunch of elephants and rhinos loose in Oklahoma?",
        "response": "What? Do you know how many Elephants and Rhinos we have left? Not many Wouldn't they just get poached in Oklahoma? Also, Oklahoma is nothing like their natural habitat, that would be awful for them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do massive fires contribute to climate change like emissions and pollution?",
        "response": "a small percentage of overall pollution, but it is only a very small fraction of the overall scale of pollution. In contrast Human pollution is much much larger.  EDIT: This guy below sounds smarter than me, listen to him my answer isnt as detailed (/u/Tokyojokeyo)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do doctors' offices often use those weird scales where you slide those two metal brackets over numbers until the tip balances? Are they more precise than the digital scale I bought off Amazon for $20?",
        "response": "Mostly cost honestly, commercial electronic scales are expensive. [A quick google puts them at $375](_URL_1_) where the old style are only [$175](_URL_0_) And really, why would they ever buy a new one? How long as that doctors office existed? They probably bought the scale 20 years ago and haven't had to replace it yet. Also, the electronic ones are spring based, and can suffer somewhat from drift errors when their springs age. They need periodic calibration. The balance style is much less sensitive to this, their wear modes don't really screw with their calibration (that would only happen if you chipped the weights).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does sunscreen stop you from getting burnt?",
        "response": "Yeah it contains one or more ingredients that absorb or reflect UV radiation very effectively. So while sunscreen usually doesn't change how you look in the visible spectrum, at least not much, if you had UV vision it would look like being smeared in paint. The active ingredients can vary. Generally organic compounds tend to absorb the UV, while inorganic compounds like titanium dioxide tend to reflect and scatter it away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do business related professionals always use Blackberry Phones in TV / Movies?",
        "response": "Before the iPhone got popular, the Blackberry was the only phone with excellent text capabilities (email integration). Even today some professionals prefer it because of its great mechanical keyboard and its strong security.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A few months ago, I completely wiped my hard drive on my mac due to file corruption. Recently I had to open my network preferences and I found that there is still a record of every wireless Network that I have joined on this computer, going back 5 years. How/why did that data survive?",
        "response": "It was backed up to iCloud and restored to the computer when you signed in with the same Apple ID.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "HD video is offered in 480, 720, and 1080- where did those specific number come from? Who chose them?",
        "response": "_URL_0_ The FCC process, led by the Advanced Television Systems Committee (ATSC) adopted a range of standards from interlaced 1,080-line video (a technical descendant of the original analog NHK 1125/30 Hz system) with a maximum frame rate of 60 Hz, and 720-line video, progressively scanned, with a maximum frame rate of 60 Hz. In the end, however, the DVB standard of resolutions (1080, 720, 480) and respective frame rates (24, 25, 30) were adopted in conjunction with the Europeans that were also involved in the same standardization process. The FCC officially adopted the ATSC transmission standard (which included both HD and SD video standards) in 1996, with the first broadcasts on October 28, 1998.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Iron cant be fused into another element? How does other elements come to be? (astronomy)",
        "response": "It can be fused into a new element (its the only way to get higher elements) the problem is the fusion takes more energy than it produces so it doesn't happen as a fuel source for stars. When a star goes supernova though it can fuse higher elements, the more massive the star, the higher the elements it can fuse. Its a short process though so the abundance of elements above iron drops off quickly and is much lower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can’t we remember much from our infancy?",
        "response": "Short term memories are formed by transient synaptic plasticities and Long term memories are formed from these short term ones by Long Term Potentiation (its the most well accepted neural correlate for memory formation as of now). The short term memories are formed in the hippocampus which is very robust starting early age but the frontal cortex (also called as the neocortex where most of the long term memories are thought to be stored) develops even until the mid-20s in humans. From this perspective, infants may not consciously remember anything as the short term memories cannot easily get translated to the long term memories and get stored in the brain (we don’t truly know the chemical/physical nature of memory yet).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is 'opossum' different than 'possum'",
        "response": "Strictly speaking, they're two different families - opossums are found in the Western Hemisphere, possums are found in Australia and surrounding areas. But, you'll hear opossums called possums pretty regularly from average people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So just how likely is Yellowstone to erupt anytime soon?",
        "response": "[Here's a link to the last time a question like this was asked](_URL_0_) tl;dr You heard wrong. The odds of a large-scale eruption in your lifetime are vanishingly small.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans need purified water when animals can drink whatever water they want?",
        "response": "It's a safety thing. You could go drink water out of a spring and probably be fine. Maybe. But you run the risk of the water containing harmful bacteria. It's the same reason we cook most foods but animals eat it raw. Now, if you had always drank from that pond, your body might have adapted to those bacteria and they would be rendered harmless by you. But since you mostly drink purified water, your body isn't ready for contaminated bacteria. My dog has always had tap water, so he sometimes gets sick if I let him drink of natural water sources because he's no more used to those bacteria than I am.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are things n% water?",
        "response": "Heat it until the water evaporates, check its mass before and after and calculate the percentage",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you take drugs that make you sad or depressed, will your body compensate and be more happy in a non-drugged state?",
        "response": "Straight from the sidebar: Please keep discussion scientific (i.e. based on repeatable analysis published in a peer reviewed journal). Please do not just say \"depleting < your favorite monoamine > produces depression.\" [This is a vast oversimplification: \"the cause of depression is far from being a simple deficiency of central monoamines.\"](_URL_0_). To facilitate the discussion, please support your arguments with relevant sources and encourage others to do so as well. That is the point of Askscience.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we always told to maintain our fluids when we have a cold/flu? Is it for the same reason that we should always drink water, or is there a particular interaction between the common cold and hydration?",
        "response": "Loss of fluids is one of the quickest ways to die naturally, that's why diseases such as cholera are so dangerous. That said you tend not to have any immediate reasons to lose fluids during a bout of flu (vomiting, diarrhea etc.). But it runs along the same lines as the advice to eat well and rest. It's just to give the body enough energy to fight off the infection without wasting energy doing other things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly is the meat industry causing so much pollution?",
        "response": "Cattle being bred for meat eat and fart and poop. That's a lot of fart and poop. The gases get released into the atmosphere and add to the greenhouse gases.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "'There Will Be Blood'",
        "response": "I thought you were going to say that you didn't get how the petro-geology thing worked and I was about to say \"I DRINK YOUR MILKSHAKE!\" Silliness aside: Things that make that movie a classic: * The intense, sociopathic main character. * Brilliantly framed long shots that make you feel like you're really in the middle of the frontier. * Storytelling without dialogue (like, the first half of that film) * Other things... Haven't watched it in a while.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have so much Anglo Saxon literature but despite being much more widely spoken and used, we barely know anything about the Gothic language?",
        "response": "1. We know quite a bit about Gothic. We have a significant portion of the bible that was translated into it, along with some other shorter texts and inscriptions. 2. Anglo-Saxon kingdoms in England were more recent in history, and they left more direct linguistic and cultural heirs that would be more likely to take an interest in and preserve old writings in the language. By the mid 8th century, the last place ruled by people who would have considered themselves Goths was the narrow strip of northern Spain ruled by the kings of Asturias. Gothic had only ever been spoken by a small minority in Spain, and I'd if it survived into the 8th century, it wasn't destined to survive much longer than that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a word no longer sound like a word after saying it a bunch of times?",
        "response": "Because you start to hear it and see it as the letters and sounds it is made up of, not the meaning or the entire word itself together.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was monsanto allowed to sue farmers when monsanto seeds invaded their land and crops due to winds?",
        "response": "Monsanto has stated they don't pursue if they find trace amounts, but the harvests of some they have sued have been found to be 95-98% patented seed- far more than could be due to an accident.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does cutting this chocolate bar seem to alway have an extra piece?",
        "response": "The biggest of the 4 pieces grows as it moves to the right. It would not fill the whole space if you try this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some alcoholics suffer life threatening withdrawl symptoms when others with the same drinking habits don't when they quit?",
        "response": "Everyone is effect differently by alcohol due to age, weight, genetics, etc. With chronic alcohol abuse, parts of the nervous system adapt to functioning in the presence of alcohol (aka. tolerance). When the nerves are highly adapted to alcohol, removing it can drastically alter the function of that system, leading so side effects depending on what nerves adapted and how much they adapted.  The damage that quick alcohol withdrawal varies a lot and can be permanent, for example parts of the brain can die due to a sudden increase in intracellular calcium (not ELI5 but I think its an interesting mechanism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we walk into a room and then forget what we went in there for?",
        "response": "What people are saying is true, but in a survival point of view entering a new enivornment and immediately focusing on the new enivornment could be life saving.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do TV shows do the fake lines on the screens to make it look like a home recorder, when today they look the same quality?",
        "response": "To convey to the audience that the scene is taken with a recorder, in universe. They do a lot of shorthand like that. The \"shink\" sound of a knife being picked up. Dial tones on cell phones. People typing on computers and the individual letters appear on their face. It's not realistic but serves the story.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are these so expensive?",
        "response": "Half the reason why it's so expensive is because there's 4 coins that are 1 troy oz per coin of 99.9% silver. According to [Wolfram|Alpha](_URL_0_), the cost of the silver alone is nearly $135, so that's almost half the cost. The other reasons are probably shipping cost and markup to make a profit. I don't image shipping something from New Zealand is cheap, let alone shipping something with a little bit of value. They probably ship it insured.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a person who's married to an American citizen be deported?",
        "response": "If the spouse is a legal resident, it's simple, register with the government and change their status. If the spouse is undocumented, any attempt to change the status will likely result in deportation proceedings. There is no simple way to change from undocumented to legal status without the spouse leaving the country and applying for entry as a fiancée, which can take a very long time and will be rejected if there is any record of them being in the US illegally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Native Americans advance as much as Europe and other parts of the world?",
        "response": "Please consult our handy [list of popular questions](_URL_0_) regarding this - it's a question that's been asked and answered many times here. Short answer, the idea of being \"more advanced\" is a logical fallacy, and in many ways civilizations in the Americas were as advanced as any in the Old World.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Washing dishes, without leaving the water running the entire time.",
        "response": "fill up the sink with water. wash every dish using that water. then drain, then fill it up again and do the same thing to rinse. it'll clean it just as well. if the rinsing water gets too dirty you can drain it and fill it up again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In terms of molecular structure, what is cotton?",
        "response": "According to my Materials Science book, cotton is an example of a seed fibre, and so is a biological polymer. According to [this website](_URL_0_), the main component of the cotton fibres is cellulose. Cellulose is found in all plants, and as such is used to make paper, card, linen and, of course, cotton fabric. On a molecular level, the Cellulose is made of D-Glucose linked by 1-4 glycosidic bonds. This just means that the cellulose chain is made of many molecules of this simple sugar linked together in one long chain, called a fibril. These fibrils then form concentric layers of spiralling fibrils to form the basic fibre.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the frequency of peeing increase during our presence in swimming pools?",
        "response": "There's a lot of wild guessing here with no references, as per usual. Cold diuresis - When you enter a pool, more often than not the water will be cooler than your internal temperature. Your body detects this change in temperature and in order to protect from hypothermia it constricts your blood vessels and diverts some of the blood from your skin inward. This keeps your internal organs warm and reduces the rate of heat loss. Now your kidneys have no way of knowing this is happening, all they can tell is that the amount of blood flowing to them has increased. One of their jobs is to maintain the proper pressure in your circulatory system so they solve this problem of increased blood flow by getting rid of the extra volume the only way they now how. Peeing [_URL_0_](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Calorie Counting via My Fitness Pal?",
        "response": "Things like MyFitnessPal are tools for rough estimates when counting calories. Your settings apply some info for estimating the amount of calories you'll burn with normal activity. Say you're trying to maintain 1,200 calories a day. If you eat 1,200 calories, you're all set (+/- whatever you may burn by just going about your daily activities). But, if you exercise, and burn off 400 calories, you now have a sum of 800 calories, and you need to eat 400 more if you want to be at 1,200.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does NOS make cars go faster? Like in the Fast and Furious movies.",
        "response": "Gasoline requires just the right amount of oxygen to burn efficiently. Adding nitrous oxide provides more oxygen than just air alone, allowing more gasoline to be used and therefore more power produced per stroke. More info: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a civilian ship is asked to aid in a search and rescue operation, who covers the costs?",
        "response": "Its considered an ancient tradition and responsibility of all seafarers to provide aid to vessels in distress, in recent times this has been enshrined in international maritime law. There is no payment, just the knowledge that others will help you if you get in trouble",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we feel like shit when we're hungry, since we have fat to burn?",
        "response": "Apart from what the other posters said, I would say there's also a survival aspect on this. Fats are scarce and precious, in other times they were literally the only thing between you and starvation, so is not far-fetched to think that the brain would find a way to make you don't rely on your fat reserves as much.  See it this way: You can sit there and feel like shit, or you can go out and hunt, which is it going to be?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that some food items, when we taste them once, we continue having more and more, even if our appetite is full already?",
        "response": "Because things like fat, sugar, and salt are rare in nature. You are biologicaly driven to consume them in excess to create reserves. The food industry takes full advantage of these innate addictive properties.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why handmade products are more valuable than automatically made products?",
        "response": "There is supply and demand, with hand-made stuff taking longer per unit, they are more rare. They also tend to have a level of uniqueness since they aren't churned out with the exact same process. And some people simply value things knowing someone put a lot of time and effort into it. Still, it does depend on the product. If you need precision and a machine can do it better and cheaper than a person, the vast majority of customers will probably go with the machine-made product.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I need your help, AskHistorians! Has there ever been a case where a second son born in a monarchy has been chosen as heir over a living, first born son?",
        "response": "William the Conqueror chose his second-born son, William II, as his successor as king of England over his first-born son, Robert. Robert became duke of Normandy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much did the loss of the American colonies affect the economy of the British Empire?",
        "response": "Follow up. If the American colonies were so upset by the raised taxes from the French and Indian war how did other British colonies view the war of independence?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does turning airplane mode on and off make my phones internet faster?",
        "response": "My ex-wife works at AT & T in the higher end support area. Apparently, she's said, if you don't periodically have your phone re-sync with the network by power cycling it, things get a little weird. That can cause all sorts of odd behaviors and airplane mode causes the phone to do essentially the same thing as turning it off and on again from the network's perspective. I'd assume there may be certain benefits to an occasional full power cycle, though, as with any computer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What subjects were commonly taught to royalty and nobles from 1700 to the early 1900s?",
        "response": "One of the more unsual things that they learned (at least in the Austrian Habsburg family) were normal trades.  For example Emperor Francis II was a gardener and Franz Josef was a bookbinder.  But no idea if this was an oddity of the House of Habsburg or something that was rather common at the time and age.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why chips are superior to stripes on a debit/credit card.",
        "response": "I comes down to what the stripe holds. The stripe on a normal card holds your card number, expiration date, cvc number, and your name. If someone scans that card, they have a complete copy of that data and are able to make a transaction with it simply by writing that data to another card.  The chip on the other hand also holds this dstadata, but it is a bit trickier. It doesn't actually give this data away when scanned. The chip uses things like the time and date, card number, encryption keys, ect to make a unique number for that specific transaction, which is then sent to the bank, decrypted, then the transaction is confirmed. The most important thing is that each transaction may only have one possible number attached to it. This number is absolutely useless if you want to make future transactions using that card, while a stripe gives away all the data needed to make a transaction. The only way to make the transaction with a chip is to have the chip or the data stored inside of it (very hard to get).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't all games run on GNU/Linux distributions?",
        "response": "mostly because the tools that people use to develop games often don't easily translate to Linux operating systems.  So it might require an enormous extra effort to get it to work on Linux. Since the Linux market for gamers is so small it's often not worth the effort.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a person is brain dead, can their body heal wounds or broken bones?",
        "response": "Yes in principle, but brain death implies the person isn't breathing spontaneously anymore. However there are a lot of brain damage situations that involve permanent unconsciousness or quasi-unconsciousness and where the rest of the body may be fine as long as the person is given food and water Also it's normal for people with major trauma to be put in an artificial coma for a few days or weeks while their injuries heal a bit",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Shakespeare's Cleopatra was black. How did audiences react to a portrayal of a queen renowned for her beauty and charm in this way at a time when \"blackness\" was associated with unattractiveness and sin? What are the broader implications of this for her relationship with Antony and Caesar?",
        "response": "How would Cleopatra (or Othello) have been portrayed in Shakespeare play in Elizabethan times. Would they have found a dark skinned person to play these roles, or would they have used make-up? Would the makeup have been to make a person what we would consider black, or what we would consider middle eastern?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were 1930-40's era Nazi vehicles' headlights blacked out?",
        "response": "I'm by no means an expert, but I believe they were practicing a form of Light Discipline. _URL_0_ (Note, the article references The Great Soviet Encyclopedia, which \"might be outdated or ideologically biased.\", but in this particular case I'd consider the Soviet Encyclopedia a valid source.) Even modern military members are taught about light disciple.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Torque in relation to a car's performance?",
        "response": "ELI5: Torque: acceleration Horsepower: Top speed. For older than 5, It's a bit more complicated than that, there's a \"torque curve\" meaning how much torque you have at any given RPM. If you have torque at low RPM, you can feel the push coming off of a redlight. If you have good torque at high RPM, you can get a push once you're already moving, good for passing on a highway. If you have a \"fat torque curve\" you have good torque at both low and high RPM, a good car for driving on curvy roads.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do morbidly obese people burn through all that fat before starving?",
        "response": "Their liver will metabolize the fat cells releasing ketones and glucose into the blood stream. This will sustain the person until the ketones lower the pH of the blood stream enough to cause most bodily functions to cease.  Meanwhile their breath smells increasingly like rotten fruit and their farts like freshly welded mild steel. Point of interest: this is very similar to what happens to people of low-carb diets since ketones are a byproduct of glucose production from non-carbohydrate sources.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the first Indians that Christopher Columbus brought to Spain? Did they ever go back to America?",
        "response": "Of the ten Taino that Columbus abducted on his first voyage, only six reached Madrid; the other four were too sick to travel and were left behind in Seville. Of those six, only one - Don Diego Colon - returned with Columbus on the second voyage as his interpreter. As for the rest, Don Juan de Castilla became a servant for the royal family and died in Madrid two years later. The fate of the others is unknown.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do certain passages in music sometimes trigger a piloerector response (goosebumps/chills) in people?",
        "response": "That's a phenomenon called [frission](_URL_0_), and there's a a subreddit for it: /r/Frisson",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Wonderful Pistachio get sooo many celebrities to endorse their product?",
        "response": "Give a celebrity money and they will endorse just about anything. Something as non-controversial as pistachios is an easy sell. You go in for a couple hours, film a commercial, and walk all the way to the bank (ok actually your assistant does that because you have an appointment with you juice-bar coordinator about adding new fruits to your juice-only diet) Yes pistachios have tons of money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would an electroweak star look?",
        "response": "From my understanding of what an electroweak star is, it would look like any normal neutron star or degenerate remnant from a supernova. Just that a careful analysis of its mass would reveal that the pressure at its core would be greater than even a 'quark star' could support: hence the core would be supported by 'electroweak burning', rather than pauli degeneracy or quark degeneracy pressures. The wikipedia page on electroweak stars cites a new scientist article, D. Shiga (4 January 2010). \"Exotic stars may mimic big bang\". New Scientist. Wherein they are discussed at greater length. tl;dr: It may well look like an ordinary, albeit peculiarly massive, neutron star.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many canned foods have that same \"cat food\" smell when opened?",
        "response": "Um, can you elaborate on what canned foods, other than canned cat food itself, that you think smell like cat food?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What implications does the newly discovered Viking site in Canada have?",
        "response": "It's a bit too early for an understanding of the implications of the Point Rosee site. It hasn't even been confirmed to be Norse yet and nothing has been formally published on the matter. If it is a Norse site, that alone isn't shocking. The Vinland sagas talk about 2-3 Norse encampments in Vinland (someone who is more familiar with the sagas themselves can hopefully give the specific number). So finding additional sites in Newfoundland was always a reasonable possibility. If Point Rosee is Norse, it was probably only inhabited briefly, just like L'Anse aux Meadows and the handful of known Norse encampments on Baffin Island (Nanook / the Tanfield Valley site being the best known). If it turns out to be Norse *and* it was inhabited for a significant amount of time, that would be a departure from our current understanding of Norse interaction in the area. If the site isn't Norse but something else, well, then we'll have to wait and see.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far along was Germany's plan to invade the UK in World War II before they lost the Battle of Britain?",
        "response": "In addition to /u/white_light-king's comment, I would like to point out that a precondition to any variant of Operation Sea Lion was that the RAF had to be neutralized. As such, the Battle of Britain itself could be seen as part of the plan to invade the UK. As the Luftwaffe lost the aforementioned battle, the RAF was left as a credible obstacle to any invasion of the British isles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does spicy food sometimes burn your anus on its way out if there's no actual heat, just taste, and we don't taste things with our anus?",
        "response": "The spiciness comes from capsaicin. Capsaicin causes a chemical reaction very similar to what actually happens when you eat something thats hot temperature wise, hence the burning sensation. You don't have taste buds in your butt, but similar to your mouth and nose, it has sensitive mucous membranes that stuff can easily get through. The capsaicin passes through and causes the same sensation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it possible in the US to convict someone for several consecutive life-sentences?",
        "response": "It's so they're guaranteed to die in prison essentially. With multiple life sentences you're almost certain to not get out on good behavior, or if your conviction is overturned I believe. Get rid of one life sentence? Cool, you still have another to go. Or maybe more like you stated they do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A large body of water produces a tone when it's hit by rain. What frequency is the tone?",
        "response": "The sound of each water drop is not a pure tone (one frequency). It's a plopping sound that consists of many frequencies (Pluh-AHP! medium/low then gets higher). When you add a lot of them together, you get white noise of that same range of frequencies and ratios of frequencies, but now effectively chopped up in random blends and orders, instead of one coherent plopping sequence. Edit: found a spectrogram of rain (sort of): _URL_0_ So yeah, pretty much \"very close to white noise but biased slightly toward one end\" Apparently that one is artificially produced, but from a model that was trained on rain. Close enough for this general of a question. Finding it difficult to find an actual plain old real rain spectrogram, but it's definitely not going to be a pure tone either.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is my breath warmer and more humid when I \"haaa\" (to clean my glasses) than when I blow air through pursed lips (i.e. blowing out candles)?",
        "response": "Other than the speed of the air mentioned in the other comment, the actual air flowing past your hand is also cooler and drier.  A fast moving stream of air causes a phenomenon called entrainment, where surrounding air gets pulled into the jet you're blowing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there so many languages in which cats are referred to women's genitals ?",
        "response": "Because it's something small and furry, and to gain its favor you have to stroke it gently. It’s not hard to imagine courting a woman, going over to visit and sitting on her sofa, softly petting her fickle cat, to show how loving and patient and domestic you are. In English, of course, we also have the c-word, which comes from the word cunny, which sounds like coney, which is what English speakers used to call a rabbit. (In Spanish, conejo means rabbit but also is slang for vulva.) It’s not a coincidence that the words coney and cunny are so similar; both probably go back to the Latin for hole or tunnel. English speakers got tired of all the cunning puns, so we started calling them rabbits instead, and changed the first letter of coney to make the kid-friendly word bunny. It’s fun, knowing the etymology and slang uses of these words, to see places on the map like Coney Island or Conejo Valley.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do battery operated objects not work when the cell is in the wrong way?",
        "response": "Think of a battery like a water pump and wires like pipes (that are filled to begin with). The pipes aren't directional, so if you allowed water to flow in any way you want, you could get some unintended consequences, such as motors rolling backward, etc. Diodes are one-way pipes, so any water flowing through in the wrong way just gets stopped. As for the battery losing charge when put in the wrong direction, it shouldn't because it's not outputting any electrical energy and it shouldn't be outputting heat (though it might), so it's not losing any energy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do any other plants produce THC or is it reserved for cannabis ?",
        "response": "I don't have time to find sources but I can try to answer. No, no other plants produce THC. THC is exclusively produced by cannabis plants. Other cannabinoids are produced elsewhere, however; your body in one source.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In 1900, the population of Las Vegas was 25. Did someone actually count? How did the US Census handle gathering information in such remote areas?",
        "response": "Yes, the Constitution prescribes enumeration every 10 years, for the purpose of adjusting the representatives alloted each state. Thus, the Census Bureau must hire enumerators to make a list of all inhabitants, and this was typically compiled one small geographic area at a time. In much of the country, rural areas were listed by township and then by enumeration district (often a precinct or other political division); big cities were generally aggregated by ward or similar district. In the 19th and early 20th century, enumerators were most often schoolteachers, who typically had good handwriting and were available during summer months. [Here is the 1900 Census enumeration page](_URL_0_) covering Las Vegas Precinct of Lincoln County, Nevada. A well-known location on the Old Spanish Trail, Las Vegas was not nearly as remote as most areas of Nevada.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the USSR, how politically problematic was being religious? How much did it depend on position and time? Was there a difference between the treatment of Christians and Muslims?",
        "response": "In order to get some attention from the state repressive system in USSR one had to attract its attention. This could be done in various ways: sign a petition, discuss \"wrong\" topics, etc. Of course, members of some social groups were under more strict supervision. In your case it looks like a superposition of the two. Your dad's friend was in a supervised social group and he manifested himself by being officially ordained. Unofficial religiousness had less consequences of course. There were churches, there were priests. In various places there were different levels of \"common\" religion habits, e.g. in Belarus I've seen city administration office closed because of catholic holiday. This was impossible in Moscow or Leningrad. Scientific assessment of the question is difficult, because in literature it is generally viewed from the viewpoints of different religious groups. There are many books about Jewish religious movement in USSR, see _URL_1_ _URL_0_ Less about Islam _URL_2_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is happening in our brains when we constantly check the fridge for food with full knowledge that no new food is there?",
        "response": "Why do we check our timepiece (watch/phone) for the time when we've just done it a few minutes ago? Many things go into short term memory all the time - but it is exactly that - short term memory. Here today (now), gone tomorrow (or just a little later). If you looked into the fridge and did an inventory and wrote it down, you'd be much less likely to check it again and again - you'd have put the effort in to put the information into long(er) term memory. Also: we often look in the fridge not knowing what we want. Still hungry we check it again hoping something will \"click\" (yeah, leftover pizza, why not). But until something \"clicks\" the driving force (wanting something to eat) isn't fulfilled - so we check again...and again. - it's not LOGICAL - it's an emotional / physiological motivation driving us. Not a lack of data/information.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any real difference between a religion and a cult?",
        "response": "Many religions tend to accept questions and investigation, and don't encourage blind faith. Cults usually put blind faith first, and discourage any questioning of leaders decisions. Most cults are not run by their members, but by a very select few. Most religions are driven by the cumulative motives and beliefs of their member base. Just one man's perspective.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why should I get a flu shot?",
        "response": "I always look at it like this. A flu shot costs me about 15 mins and about $10. If I get the flu, it costs me a week of work and hundreds of dollars in lost income. Even if the shot only prevents me from getting sick once in my entire life, its still less expensive and time consuming than getting the flu.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can autonomous cars work without fail if there are still human drivers on the road?",
        "response": "They can detect and react to human drivers faster and more accurately than a human driver could. They can't work *without fail* ever, since sometimes things happen that simply couldn't be avoided, such as if you're following all the normal traffic laws and going through an intersection just as a speeding car turns around a corner and T-bones you. *Maybe* you could have swerved out of the way or slammed on the brakes or the gas with the one second of warning you might have, but even that could cause you harm. An autonomous car might even be able to do better! The point isn't to make them work *without fail*, but to make them work *with less failure than human drivers*, which is actually already pretty much the case.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Ming-era Chinese recognize European Jesuits as belonging to the same religion as Nestorians who had arrived 900 years earlier?",
        "response": "Followup: What relationship, if any, did the Chinese perceive between each of these groups and Manichaeans?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why the US military can't deploy military police officers in areas of the country with little police presence or cities that can barely afford a functioning police force like Detroit?",
        "response": "The US military is not allowed to operate on US soil save in the event of invasion or fighting those of treasonous disent (civil war). It is one of the protections that prevent the President from becoming a dictator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we feel the need to pet/scratch other animals?",
        "response": "mutual grooming is a pretty common social activity in the animal kingdom. Basically, if you're cool enough with an animal to groom them/be groomed by them, it means you're good buds. Edit: this dude said it better _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Sun's gravitational pull keeps the planets in our solar system from flying off, what keeps the Sun from doing the same thing?",
        "response": "The sun is orbiting the center of the Milky Way. Also, note that even if the sun isn't orbiting anything, what is your measure of \"flying off\"? If the sun is going in a straight line \"flying off\", nothing much will change to us. We will still orbit the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do medicines have names that are hard to pronounce?",
        "response": "Drug names are a weird special case where you have to throw out most of the normal rules for choosing names for products.  You can't have a name that describes what the product is, like \"3M high temp. masking tape\" because the substance has never existed before.  You can't name the drug after what it came from, because many thousands of drugs will come from the same few things \"foxglove\", or otherwise come from places that don't sounds good, eg \"bovine uterus ointment\", \"Fetal stemcell tincture\". There are rules for what you can't include in the name. No \"BetterThanOurCompetitorol\".  You are left with the marketing company trying to think of a word that \"feels\" the way that the drug would work if you took it. For example, Viagra = vigor, vitality. Celebrex = painkiller = makes you feel good.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does memory work for 3-4 year old children?",
        "response": "It's not that children have no memory at all - it's that, as we age, our brains overwrite unnecessary information with new information. *As adults,* we often can't remember things from when we were very young - but this doesn't say anything about a child's memory when they are still that age.  Some suggest there's a link between language ability and memory - such that your memory becomes clearer and stronger the more your language ability develops. Maybe that plays a role as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen to the oil deposits after millions of years if we hadn't drilled them?",
        "response": "The same as has been happening to oil deposits throughout earth history; they either get buried so deep that they get overcooked into tars, or they gradually escape up through natural seeps into the ocean and atmosphere. It is worth noting that the large volumes of hydrocarbons formed on oceanic plate would also end up getting subducted through plate tecontics - the overwhelming majority of ocean crust is subducted within 200 million years of its formation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Calculating the volume of a pool of water on a flat surface?",
        "response": "Of course, the pool of water has some depth. The exact depth would depend on the interaction of the liquid with floor. You would probably have to specify the contact angle to make a precise calculation.  The contact angle would depend on the exact composition of the liquid (add a tiny part of soap and it could change the result) and the composition of the floor surface. There's a lot of information here _URL_0_ if you want to read more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does catnip actually do to cats?",
        "response": "The active chemical in catnip, nepetalactone, triggers the same smell receptors that actual cat pheromones do (kind of like how hot sauce triggers your heat-sensing nerves, even though it's not actually hot, or mint tastes \"cold\"). So catnip smells like sex to cats, and that's pleasurable. Basically it's nose-porn. About a third of cats are not affected.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Moved from Southern to Northern hemisphere, and it feels like the sun rises in the west. Is my mind playing tricks on me?",
        "response": "In the southern hemisphere the sun arcs across the sky in the north, but in the northern hemisphere it does the opposite. Suppose you're facing south and watching the sun setting in the west; you then imagine the arc that the sun made over the course of the day in front of you. In order to view that arc in the same way (with the sun in the same position) in the southern hemisphere, you need to be facing north with the sun rising in the east. So for this view, you've been accustomed to associating it with dawn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "EILI5 why are insects drawn to light?",
        "response": "They are nocturnal and evolved to navigate by the light of the moon. But this smaller brighter moon is much much closer and messes with their internal compass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What lead to the United States and the UK becoming such strong allies after being at war with each other twice?",
        "response": "hi! you may be interested in this section of the FAQ (link on sidebar):  [Anglo-American Relations](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Climate change: Why do we always plot temperature as a function of time instead of the rate of change?",
        "response": "Also, when plotting rates of change you're at least doubling the uncertainties...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What year did ancient Egyptians think it was?",
        "response": "Hi there, while there's always more to be said on this topic, you may find the section of our FAQ on [Calendars and Timekeeping](_URL_0_) to be of interest.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are flights delayed or canceled during thunderstorms and snowstorms, even though planes are designed to be able to fly through rough weather?",
        "response": "They gotta take off and land. The winds can be problematic, only partially because of raw saftey but you don't want to make your passengers sick and scared for their lives from a rough ride they plane is capable of.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we unable to swallow more than a couple of times consecutively?",
        "response": "When you swallow with a bolus (chewed food or liquid), which is generally regarded as \"wet\" swallowing, your throat muscles contract to move the food down your esophagus into the gastrointestinal tract. This is called a [perstaltic sequence](_URL_2_), and occurs normally during a \"wet\" swallow or immediately following one. However, when performing \"dry\" swallows, peristalsis has been shown to be [less likely to occur in the esophagus](_URL_0_), and also [is weaker when dry swallowing](_URL_1_) than when wet swallowing.  Therefore, it gets increasingly difficult to dry swallow repeatedly because it's harder for your esophagus to generate a peristaltic sequence when it's not actually moving something through the tract.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there something like a Lagrangian point for a galaxy?",
        "response": "Short answer: any such situation would be unstable and we don't have the precision to measure it anyway. The expansion of the universe happens outside of gravity wells, where objects are too far away to fall toward each other. Interactions between galaxies are a fuzzy thing, with tidal forces being quite important due to the large scale of galaxies. If you had two galaxies in a situation like the one you describe, they would exert tidal forces on each other, stretching each other and moving closer. We can measure radial velocity-- the speed at which a galaxy is moving toward or away from us-- with a high degree of accuracy. Measuring distance is much more fraught with error, although we can often get a good distance measurement to within a few percent for galaxies in the local neighborhood. Measure transverse velocity, the apparent motion of a galaxy on the sky, is currently not feasible for anything outside the Local Group.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If ketchup needs to be refrigerated, why can restaurants leave it out ll day without any issues?",
        "response": "> If ketchup needs to be refrigerated It doesn't. Because of its high acidity, ketchup remains good for up to a month without refrigeration, and restaurants go though ketchup quickly enough that a single bottle isn't going to last a month to begin with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would metallic hydrogen look like? Would it be silvery like most metals, transparent or something else entirely?",
        "response": "It's an opaque grey metal, at least at room temperature. Now that I'm out of school I no longer have access to academic journals, so no citations, but I remember reading an article or two about scientists creating metallic hydrogen in diamond anvil cells. The pictures showed a phase that looked like how we think of most metals. As I recall, the pressures were somewhere above 300 GPa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ignoring horses and elephants, what other (more unknown) animals have historically been used in warfare?",
        "response": "Carrier pigeons were widely used for delivering short messages during the Great War. While wireless radio receivers did exist, they were still quite enormous and entirely impractical for infantry combat. Telephone lines only went so far, and often ended up cut. The homing instincts of these unusual birds offered an ingenious solution to the problem, though casualty rates were often high. At least one of them - yes, [one of the pigeons](_URL_0_) - was an officially decorated hero. He was instrumental in the salvation of the \"Lost Battalion\" in the Argonne",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it seem like Businesses MUST generate a higher profit every year or they are a failure? Why can't a business be happy generating the same amount of profit (Or even slightly less) than previous years?",
        "response": "That very much depends on the type of business. A private business can do whatever the hell the owner wants.  Publicly-traded companies are beholden to shareholders. Shareholders tend to invest in a company because they want it to make a profit, so that they can make a profit. And they tend to want as big a profit as possible. Shareholders can actually get together and *sue the company* if they think the leadership isn't doing enough to justify the investment.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do copper surfaces kill bacteria?",
        "response": "The TLDR is that nobody yet knows for sure. It's an important topic of active investigation in the scientific, food-preparation, and medical communities. It appears that copper in some way affects the membrane which surrounds each individual bacterium, causing the membrane to burst and the bacterium to die. The reason for this isn't fully understood but appears to be possibly due to some kind of mild electrical effect -- basically a bacterium on copper creates a tiny difference in electrical potential (i.e. voltage) and the bacterium gets electrocuted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do escalators' handrail belts move faster than the steps (not in sync)?",
        "response": "> Handrails and the stairs are on different gear systems and can fall out of sync over time. It's not always faster; I've seen my share that are slower.  > Newer escalators have safeguards to help keep this from happening. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the US have a rule that no President can do more than two terms?",
        "response": "George Washington was revered by Americans after commanding us to victory in our revolution. He could have been president for life, or something like a king, but chose to serve two terms and retire. This was an American tradition, until Franklin Delano Roosevelt, who served three terms and won a fourth, but passed away before he could serve it. A lot of people thought that it was not a good idea to defy that tradition, and made it into a law.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If red, blue, and yellow are the primary colors, and all colors can be made from them. Why do we use red, blue, and green on computers to make colors?",
        "response": "Red, blue and yellow are the reductive primaries; they are based on absorption of light. Red, green and blue are the actual primary colours and they are technically the only colours you can see. Your eyes have cones for each of the primaries (red, green blue) from which all colours that you see are formed. Reductive colours are formed by the substance absorbing all the light except the colour you see (which is reflected).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it ok to eat red meat raw, but not white meat?",
        "response": "Because red meat is similar to the color of the licorice, and licorice is made from a plant, so red meat is safe like a plant. White meat is the same color as snow, and snow comes from the sky, and the sky is where birds (white meat) come from, so it is less safe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Statue of Liberty's color was originally brown, why government didn't change it back to its originl color and maintain it?",
        "response": "It's called patinisation. Which might me completely wrong since I just freehandedly translated from my own language. Metals oxydate (iron and steel rust for example) when the are open to the elements. The air. Oxygen! In certain metals, this forms a layer where oxygen is bonded with the metal. This layer is now inert, meaning it won't change any further. So the underlying material now has a barrier shielding it from the atmosphere, so it won't oxydate any more. This layer is what you see on the statue if liberty. Same as many buildings where they used zinc as roofing material. They turn green naturally. It has a patiné. Preventing this is costly and requires continuus upkeep. Removing it means the layer underneath will do the same, leaving you with a slimmer layer every time you remove it. So let it turn green, it'll last longer",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do different types of wood used in the body and neck of a guitar affect the sound/tone?",
        "response": "The density of the wood (how close the cells are packed together) affects how the strings' vibration of the air bounce around inside the body of the guitar. The higher the density, the more the air waves bouce. The lower the density the less it bouces because lower density can actually absorb some of the vibration from the string.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there human sacrifice during Saturnalia?",
        "response": "What exactly *are* your sources suggesting human sacrifice?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When coffee gets cold in a french press, it still tastes great. When coffee from a coffee machine gets cold, it tastes disgusting. Why is this?",
        "response": "Hey! Former barista checking in. It has to do with the oils. Oils are used to roast the beans. By using a French press you use a brewing method called \"full immersion.\" Drip coffee is well, drip coffee. Coffee from a French Press is noticeably slicker than coffee from drip. These oils contains higher levels of coffee flavor and aroma that continue to develop as it brews. It tastes better in your cup at room temperature because the aromas generated by the oil are sticking around long enough for you to smell them. When the coffee is hot, the steam carries away those aromas and it's hard to taste anything other than coffee and hot. As it cools the beans show off their true nature. With bad coffee it tastes like pennies, stale potatoes, and a mangy cat. Fresh coffee will still have those oils and reflect the roasting technique, soul chemistry, species, and drying methodology. Tl:dr - French presses are dope and a bitch to clean. Check out an AeroPress. Just as tasty, 5/6 of the hassle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come some people have to hold their nose when they go under water while some people do not?",
        "response": "It's a comfort thing. Most people who have not taken proper swim lessons hold their nose when going under water out of fear of getting water up their nose. Those who have had proper swim lessons or are just naturally comfortable in the water learn how to control the air output from their nose and don't rely on physically holding it shut to keep water out of it. When it comes down to it though, it's all about what they feel is safe and what makes them comfortable in the water. Source: I was a lifeguard and swim lesson instructor for a few years",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does mixing Baja Blast and Pink Lemonade cause the drink to lose its color and become clear?",
        "response": "Does it go *completely* colorless? I am willing to venture that it's not colorless, but just \"gray\". Baja Blast is a rather intense blue-green color, meaning it probably transmits a lot of blue, green, and yellow light while absorbing red, orange, and maybe violet. Looking at the parts of the spectrum that is left behind, it wouldn't be hard to imagine pink lemonade transmitting precisely those colors while absorbing the same colors Baja Blast transmits. Thus, the perceived elimination of color comes from the fact that nearly all wavelengths of the visible spectrum are now being nearly equally absorbed by the mixture of dyes in solution, not by some acid-base titration or neutralization of the dye molecules.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does the vote to defund planned parenthood mean and how is it related to the govt. shutdown?",
        "response": "So, the House of Representatives passed a bill that would remove government funding to Planned Parenthood. That bill would then need to go to the senior half of Congress, the Senate, and pass there. Then it would go to President Obama, who has the power to veto it and will almost certainly do so.  Several Republican congressmen have said that they will refuse to vote on any US budgets that give money to Planned Parenthood at all, and since the Democrats are not going to just give up on funding Planned Parenthood, this means that it is likely that no budget will be passed for the upcoming year, and thus no federal funds will go anywhere and the US government will shut down until negotiations result in Congress approving a budget.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A professor showed me how he designed his wind turbine in the shape of an exponential(e) function to minimize friction. Why does that work?",
        "response": "There's not enough information here for a random redditor to help you, but why not ask the person who knows: the professor who showed you this in the first place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can just one viral body cause transmission of a virus, or is there some known critical mass necessary to infect others?",
        "response": "Depends on the Virus or bacteria. I don't know much about about virusses, but I know bacteria. For something like *Salmonella*, there would need to be cells in the order of 10^5 to establish a gastro-intestinal infection in a healthy person, mainly because our own gut microflora is good at out-competing invaders. For something like *Mycobacterium Tubercolosis*, some strains can establish a lung infection with as little as 2 cells, because they are able to evade being digested by Macrophages and can divide **within** them. Some strains of TB are also resistant to both first- and second-line antibiotics, which makes you effectively *screwed* if you live in a country where you can't receive extensive Chemotherapy. Sources: Brock Biology of Microorganisms 11th edition, Janeway's Immunobiology 11th edition, _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does everything taste a whole lot worse when you're sick?",
        "response": "Your nose plays as big a role in taste if not bigger than your tongue. Bite into an apple with your nose plugged and the aroma from the food cannot travel through your nasal cavity. Same thing applies when you are sick, your nose is stuffed up and scent cannot be converted to flavor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "i see pictures like this of the space program quite often, what do the lines and circles mean on the map?",
        "response": "The lines are the orbital path of the ship in orbit (in this case the Mercury capsule). Circles represent the communications/tracking stations used to keep contact with the ship.  In the early days relaying communications from mission control to the ship and back again was a bit of a trick to pull off.  [here is a map of the tracking stations](_URL_1_) _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What theoretically happens in the middle of two merging kerr black holes?",
        "response": "When two Schwarzschild black holes merge, there is actually a larger \"effective horizon\" that encompasses the two, that is bigger than each of them. With Kerr, it'll be more complicated (you also have the actual black hole region as well as the ergospheres). There are a few papers calculating what collisions would be like, but they don't have cool pictures. In fact, most of these papers seem to assume that the two black holes have their spins aligned, but in this one they consider the anti-aligned case: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't you be served alcohol as a drink underaged, but still be able to purchase ice cream, chocolates etc. with alcoholic content inside of them?",
        "response": "You cannot legally purchase alcoholic ice cream or chocolates in the US. These are things that have high alcohol content and are specifically filled with strong spirits.  But the various extract flavorings you are looking at fractions of a teaspoon in 1-5 gallons of material. That is not enough to even register as having consumed alcohol by the body. You cannot get drunk off of eating ice cream or candies flavored with an alcohol based extract.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Romance languages and Germanic languages share an alphabet?",
        "response": "They all belonged to a common cultural sphere, namely the Roman Empire and, later on, the Roman Church. Latin was the language of learning and religion, and the Latin alphabet was used to write the various vernacular languages. In the same way, the east was heavily influenced by Greek (until Muslim armies conquered it anyhow).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- How do hostile takeovers work?",
        "response": "There are a few ways of doing it, but the super simple version works like so: You want to take over the management of a company, or outright buy the whole operation. The company does not want you to do this. In most corporations, the shareholders vote for the members of the board of directors, and the board votes for the officers (president, CEO, etc.). If you want to take over control of the company, you buy up as much of the stock in the corporation as you can to create a large voting block. Sometimes you will need allies to do this too, buying their own stock to help you have enough of a vote. Once you get enough of a vote, you can vote to replace members of the board of directors with people that support your takeover. Then they can select friendly officers. Once you have enough traction inside the company, you make an offer to purchase all of the stock of the company, and your inside \"friendlies\" should have enough of a voice inside the company to approve the sale.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the Cocktail Shaker Sort algorithm work?",
        "response": "So basically it runs through a list of ranked elements. You usually want the higher ranks first in the list, so if it sees an element ranked lower then the next one down, it swaps them. It goes through the list in one direction, then once it reaches the end it goes back through the list in the other direction. It does this to avoid what are called \"turtles\", which is when an element in the beginning of the list has low rank. If the algorithm only went in one direction, the turtle would only trade places once for every iteration. Going backwards swaps the turtle every time it sees it until it is in its correct spot (somewhere in the bottom of the list). It's worth noting that, although it's a little faster than a bubble sort (which only goes in one direction) it is still pretty slow and not really used. There are far faster and more robust sorting algorithms out there. Cocktail shaker and bubble sort are mostly to teach people about sorting algorithms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does a heat engine always require a heat differential? Or are there engines that work on ambient heat energy?",
        "response": "You only get a net flow of heat from areas of high temperature to low, so a heat engine could only work off ambient heat if the ambient temperature was different from that of the engine (or can be manipulated into being different, the most commonly used way being to change the pressure of a gas).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did facial hair fall out of favor among United States Presidents?",
        "response": "Here are a few similar questions to help get you started: * [Why have there been no American presidents since Teddy Roosevelt that have had facial hair?](_URL_26_) * [When and why did it become taboo for American politicians to have facial hair?](_URL_25_) * [When and why did it become the norm for men to be clean shaven?](_URL_24_) Hope this helps! As always, further discussion and new answers are welcome and appreciated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does an excess of grease make you feel sick?",
        "response": "Your stomach contains acids and enzymes. Acids aren't very good at dissolving greases, bases are much better at it, but your stomach is acidic, not basic.  Eating a lot of grease fills up your stomach with something that it can't easily digest, and as a defense mechanism you'll feel nauseated so you eject it from your stomach by vomiting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water on skin combined with wind feel cooler than just wind?",
        "response": "Wind raises the rate of evaporation of the water on your skin, which makes you feel much cooler than you would if it was just the wind.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Physics] Can you fuse elementary particles and their antiparticles together, and what happens if you do?",
        "response": "Particles and their antiparticles can sometimes form bound states, such as [positronium](_URL_0_) and [quarkonium](_URL_1_). They can also annihilate to photons, or potentially other particles. For example, an important process in QED is e^(+) + e^(-) - > μ^(+) + μ^(-). In the process, an electron and positron annihilate, producing a muon and antimuon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do we know when our sun will go supernova?",
        "response": "Our sun will not go supernova, and when our sun begins to die, it will go big and red. We know this due to calculations that we do and observations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What pragmatic reasons are there for having children?",
        "response": "When you're old and decrepit and need someone to take you to chemo, and wash the urine-soaked sheets of your soon-to-be deathbed, you need someone to take care of that for free. Children are the only ones you can guilt into doing this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the purpose of a private drive?",
        "response": "it means the road is not built by the government, but rather by the little neighborhood division.  if you drive there without being asked to be there, it's trespassing.  whereas public roads, you can drive on for no reason.   also means that the division put up the money to build and maintain the road",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is so much of the ocean unexplored?",
        "response": "It's really big, empty, and hostile. The comparison to space is apt, since exploring the ocean floor requires equipment on a scale similar to what is needed for space travel, due to the crushing pressure and whatnot. Unlike space, the visibility underwater is pretty much nill and submersibles can't stay underwater for very long, so exploring the entire ocean would be like trying to cut your lawn with a pair of tweezers. Although we discover a new species on virtually every deep-sea dive, there isn't a whole lot of value in it, not to mention that most deep-sea species can't be taken out of their habitat without killing them. The resources that would be required to explore the entirety of the oceans vastly outweighs the value of virtually any potential discovery made there, not to mention that it would probably take centuries. Until someone has enough money and resources to blow it all on satisfying their scientific curiosity, science will be moving in more interesting and fruitful directions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why people are not required to wear their seat belts in public transport?",
        "response": "Because a bus has so much mass compared to vehicle likely to hit. They did a study of school buses. There was less injury without them.(students would hit each other with them) But the bus safety comes from being behind a tall padded seat. If you are in an aisle, much less safe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't flies or any small insect frightened when a being over 200x the size of them attempts to kill them? And why do they insist on always flying back when dodging said attempt?",
        "response": "There is no evidence that flies or small insects possess the capability to be frightened. Many insects also contend with predators much bigger than them for the majority of their extremely short lives.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "A lot of people in the US want a governmental healthcare option. Why can't we just make Medicare an insurance option?",
        "response": "Because many people in the US don't think it's fair for the insurance companies to have to compete with a government funded option that can offer insurance at very low rates. It would cause the insurance companies to lower their rates to compete and thus lose revenue and force them to lay off employees. As it stands, people under 65 who don't have chronic conditions don't have access to Medicare, so insurance companies don't have to worry about their much lower rates. Any government \"public option\" is shot down on these grounds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were the most common type of cars used for Bootlegging?",
        "response": "Funny enough, the history of bootleggers and moonshiners also blends into the history of NASCAR. The American Historical Vehicle Association has put together a short article on the subject that basically says during the 1930s and 40s [the Ford V8 coupe was preferred for it's speed.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do plant's rings tend to orbit with the equator?",
        "response": "It has to do with conservation of angular momentum. The planet is formed from a rotating cloud. In that cloud, particles are constantly hitting each other. Given long enough time, all particles going up have hit one going down, and they all end up in the same plane. Because the planet and the rings formed from the same cloud, they have the same axis of rotation and the rings orbit the equator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Before the \"discovery\" of the New World, were there any Sci-Fi authors that wrote about the possibility of an unknown continent?",
        "response": "This is not a direct answer to your question, but you might be interested in [this older answer](_URL_0_) by /u/sunagainstgold, on the topic of Science Fiction/Future fiction and/or the lack thereof in the middle ages.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If earth has a magnetic field, wouldn't that disrupt alot of our electrical equipment?",
        "response": "There's no \"if\" here. The Earth *has* a magnetic field. Likewise, there's no \"wouldn't\" here. It *doesn't* disrupt our electrical equipment. Furthermore, you probably mean \"electronic\" equipment, not electrical equipment.  The straightforward answer here is that the Earth's magnetic field isn't strong enough too interfere with *most* electronics.  That said, *very* sensitive instruments *do* have to be shielded against any interference, though usually local sources would overpower the global magnetic field.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If altitude is measured from sea level on earth, how do we measure the altitude on a planet with no water?",
        "response": "Arbitrary, likely measured from FPOC with the surface.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Quantum Zeno Effect",
        "response": "observe means interact with. It actually means to observe the result of particles interacting. The act of observing requires particles to interact (perhaps you shine a light, the photons will interact with what you are looking at, you observe the interaction of photons with the object). When particles interact they exchange energy. When certain particles are \"waiting\" to decay and some other particle begins to interact with it, that exchange of energy interferes with the decay process. So observing the particle \"trying to\" decay actually stops it from decaying.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do astrophysicists know the light that comes from this particular star is x light years away?",
        "response": "It's called parallax. The basic idea is that if you look at a star during one point of the earth's orbit and check it's position relative to something you know to be much further away than it (a galaxy, for example) then 6 months later do the same measurement and see how its position has changed, you can use the angle of this change to draw a triangle with the star in question and the two measurement points in the earth's orbit as the corners. Then it's just a matter of simple trigonometry to calculate how far the star is from the earth, since we know the radius of the earth's orbit. [This](_URL_0_) image illustrates it fairly well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the International Space Shuttle operate with the heat of the upper atmosphere",
        "response": "That's just a measure of how fast molecules are going on average. Keep in mind that there are *really* few molecules up there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any downside to booking a leg of an international trip separately?",
        "response": "Really the only issue is if/when your flights get delayed/cancelled, the airlines won't help you because the tickets were booked separately.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the science behind \"Crazy Russian Hacker\"'s way to open cans without tools?",
        "response": "Hi! In the video our host uses three cans without a pull lid. The industrial process used to manufacture those type of cans is by pressing the lid's edge to the can's edge, thus \"glueing\" the lid to the can. When you rub the top of the can on concrete, the friction wears out both \"glued\" metals, separating lid from can.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some countries (Sweden, Lithuania) has faster internet than others (USA, Germany, etc)",
        "response": "Well In general \"a small country\" can more easily heighten its average internet speed. For example there are regions in USA which have very fast internet, but there also regions that have slow internet or no internet at all. So the average for USA tends to be lower. Same goes for Germany. In case of Sweden which doesnt have a big population its easier to provide faster internet connection for majority of populations. Which hightens the average internet speed of Sweden. Same goes for Lithuania ( also a small country).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do jehovahs witnesses keep coming to my door?",
        "response": "Because they want you to convert to their religion. Can you be more specific about your question. It seems pretty straightforward. Edit: If you want them to go away tell them that you're a ex-jehovah's witness who has been disfellowshipped (excommunicated).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Animal Psych] Why do most animals recede their ears whenever something new/alarming is happening?",
        "response": "Biology might be a better tag here. Mobile external ears are fragile, and good hearing is important for most animals' survival. Many species also use ear position for social communication. They put their ears back when something potentially dangerous is happening to protect the delicate and very sensitive structure from being damaged, which is dangerous to the animal and also hurts a lot. Putting the ear back also tends to cover the ear canal (partly or totally), preventing stuff from getting in there where it could cause distracting irritation, intense pain, infection, hearing loss, possible death.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have shoulderblades?",
        "response": "It connects the upper arm bone to the collarbone. Many muscles attach to it. The \"why\" for its existence stems from our long evolutionary past.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a website like Credit Karma work, If you do not need to use a credit card?",
        "response": "They get the credit information from your social security number. They can then look up your data from the major credit reporting companies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does CRISPR or other gene editing go about overwriting cell information so they know to replicate the new type of cell?",
        "response": "CRISPR uses a protein found in bacteria to selectively cut segments of a cell’s DNA. Scientists are able to design these proteins to cut at the end and the beginning of a particular gene, effectively removing the gene from the DNA. When the cell replicates it copies the DNA that is now missing the removed gene, ensuring that all future cells replicated from the original one are also missing that same gene. For example, let’s say there is an embryo with 8 cells. If these eight cells are subjected to the same CRISPR treatment they will all have the same gene removed. As these cells divide and replicate all future cells will be missing the removed gene. This not only ensures that the organism is missing those genes, it also ensure that all progeny of that organism also are missing that gene. Using CRISPR you can remove a harmful gene from an entire lineage.  Source: BS in Biology so other people will certainly know much more but I think this is a good overview.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between the different type of steaks? (Ribeye, Porterhouse, Tomahawk, Filet Mignon, T-Bone, etc.)",
        "response": "Very simple answer: they come from different parts of the cow. slightly more involved answer: [here](_URL_0_) is an article explaining what all the different cuts are and where on the cow they come from",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does water taste “sweet” when you’re thirsty?",
        "response": "Water does have flavor based on what minerals are present, but when you’re thirsty it’s more satisfying.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can the gravitational pull between objects on earth be measured?",
        "response": "Yes, but generally only in experiments designed to measure very small gravitational fields. The first was the [Cavendish experiment](_URL_0_), measuring the attraction between a torsional pendulum and giant balls of lead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When scientific papers refer to the mass/size of the Mt. Everest (to compare), what numbers are they actually taking?",
        "response": "This is why *real* scientific papers use actual numbers and actual units, not \"as heavy as a fully loaded 747\" or your example. There is no official answer. They're winging it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does plumbing actually work? Why can toilets, sinks, and showers work without electricity (minus having hot water because electricity of course)?",
        "response": "> How does plumbing actually work? Why can toilets, sinks, and showers work without electricity (minus having hot water because electricity of course)? Sinks, showers, and toilets work because the water supply has pressure behind it. This is achieved with pumps (which require electricity) but can also be maintained by simply placing a reservoir of water in a high place. Water towers are a common example of this method of achieving a constant pressure on the water supply. In the same way that blowing on water in a straw will force out out the other end, the pressure of the water supply will force it out of the shower or faucet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Radio waves are omni-directional, why does a station go from clear to garbled and back again in a matter of inches?",
        "response": "The cause is **multipath interference**. Radio waves reflect off of things like buildings and the ground. As the waves expand out from the transmitter, part of the signal gets reflected and part travels directly to your receiver. The reflected part travels a longer path than the direct part so it when it arrives at the receiver it's out of phase with the direct part. Because the signal is a repeating wave, *sometimes* the reflected part is perfectly opposite phase as the direct part and it cancels the direct part out. Most of the time it's somewhere in between which doesn't totally cancel but interferes with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there not parachutes on commercial flights?",
        "response": "This has been answered fairly comprehensively before: _URL_1_ _URL_0_ I'm not going to delete the question, because although it has been asked before, it's not like it's being asked every week, but please remember to search before asking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can emotions be measured?",
        "response": "Yes. Measurements are largely indirect and are usually interpreted to be a specific physiological state. I'm not sure what polygraphs measure so I can't speak to that. [EEGs](_URL_0_) are extremely useful for this kind of thing. Specific combination of brain wave bandwidth amplitudes can pretty effectively determine physiological state. For example, brain waves in the 25-100Hz region are called Gamma waves. In general, the higher intensity from that bandwidth, the more likely you are in deep meditation or sleeping.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How large would the surface of contact between two perfect spheres 1 centimeter in diameter be?",
        "response": "In both cases, 0. They would only touch in a single point. Of course, this assumes the spheres as purely mathematical objects, once you move into the physical world, there's no such thing as a perfect sphere and the contact surface will be non-zero.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Humans used selective breeding to transform a wolf into a wide variety of other animals, for example, poodles and bulldogs. Why is this not viewed as proof of evolution? Am I missing something?",
        "response": "But if dogs evolved from wolves.... Why are there still wolves?  Kidding aside: All the facts point towards evolution and none towards creationism. So ignoring contradictory facts is just the way to go if you want to believe in creationism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Irish were able to field heavy infantry to defeat the Viking invaders such as at the Battle of Clontarf, why were they so unsuccessful fighting the Anglo-Normans?",
        "response": "Anglo-Normans attacked Irish with much greater technology, but better strategy, and also, try to remember that the Vikings at this point (when Anglo-Saxons really entered Ireland) were mixed in with the Irish. The Irish were not centralized. Their \"King\", Brian Boru, was gone...and he was gone soon after the Normans invaded England in 1066. After that, Ireland was subjected to England's force for centuries.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does one become a town crier in england?",
        "response": "My local town has one and they held auditions for the position. Pretty much a practical job interview. It’s a ceremonial position paid for by the local authority and held, usually, by men of a certain age who fancy themselves as very good public speakers with loud, commanding voices. They are paid positions but our local one was advertised as very much a part time job with the person having to be be available as required by the local council on special days throughout the year. I went to watch the auditions as I was in town and it was quite a spectacle. All the would be town criers were retired men with the aforementioned attributes who had held similar positions before as hobbies. All very red faced, good at ringing bells and shouting",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are NFL games broadcasted from the side field camera and not the cable camera directly behind the QB?",
        "response": "Then you wouldn't be able to observe the linemen and the defense. Try watching the game and observing how the line reacts to the play, and that's where the real action is. Good plays and yardage don't just happen, it starts from the linemen blocking, and it's interesting to watch how plays develop just from observing the line. You can usually tell how the play will go from watching them.  And if your team is on defense, you want to be able to watch what they do. The camera behind the QB biases which team is on offense. Football is a two sided game!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How to calculate position of an object moving under gravity towards another bigger fixed object, taking into account the change in gravity as it gets closer.",
        "response": "Yes, but you need to do some calculus to get there. Use the expression F = -GmM/r^2 for the force on your falling object, which gives you a = -GM/r^2 for its acceleration (F is force, G is the gravitational constant, m is mass of falling object, M is mass of massive object that it is falling towards, r is distance between centers of objects, a is acceleration). Then you can integrate twice to get an expression that features the radius as a function of time and the time elapsed. Given the initial and final radius you can easily calculate the time elapsed, but the other way round (calculate the time elapsed when you have the initial and final radius) is more complex so you may have to do that numerically. Check _URL_0_ for some steps in the derivation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What factor contributes in making a longer lifespan? Why do different species, have different life spans?",
        "response": "When cells divides the RNA gets duplicated and like on a xerox machine the quality decreases and the socalled telimeres get shorter with every division. When the telomeres are at an end, a cell can not divide itself anymore. The cell dies and so do old people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why cockroaches can survive nuclear Holocaust.",
        "response": "Radiation damages cells when they divide. Humans have cells that are constantly dividing, so radiation is dangerous to them at pretty much any point. Roaches don't have as much cell division going on as humans. Instead, their cells tend to divide in spurts when they are molting (shedding their old exoskeleton so they can grow into a larger one). Since only a few roaches in any given group will be molting at a given time, a single burst of radiation would only affect the molting roaches and most would walk away unscathed. However, all roaches will have to molt at some point (or die of old age if they're done growing) and lingering radiation would kill them when that happened. It would take a little while longer for the radiation from a nuclear blast to kill the roaches, but it would get the job done. This is also true for most insects, not just roaches. I'm not sure how this myth got pinned on them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Forgive me of my ignorance, but at what period of time did the practice of the King or Prince (Or leading of the country/territory) leading the charge, or at least participating in battles, change to not being active at all in the battlefield?",
        "response": "Not quite the same thing, but in Roman times it was considered an incredibly brave and honourable thing for a Roman commander to personally fight and kill the opposing commander. However it was also considered exceptional. I don't think it was ever the norm for commanders to actually be in the thick of fighting since they are there to command rather than fight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the combination of rice and beans referred to as a \"complete protein?\"",
        "response": "Proteins are made of amino acids. Whole grains and nuts are deficient in the amino acid lysine, but beans contain lysine, so if you eat beans combined with nuts/grains, you get all the amino acids.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do MOST women/girls have different form/motion than men when shooting a ball in basketball or throwing a ball in baseball or softball?",
        "response": "There is a Mythbuster's episode on this that analyzed it considering age as a factor. The finding? Males and females are both fully capable of throwing well, girls actually tended to be more accurate. Boys were more likely to rotate their bodies resulting in higher speeds. Diverging societal pressures as puberty hits draws males towards sports stars as inspiration for their forms, whereas females' form doesnt tend to evolve as much over time since they are less likely to watch professional baseball. Those women who do get into sports are just as effective as men at throwing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Electronically Speaking, How Does a Computer (or Calculator) Delete Stored Information?",
        "response": "On a computer hard drive they don't really get removed, unless you take extra steps after hitting delete. The computer takes those files and tags them with a special character that says \"these files are not needed, do not display them, and it's OK to write over this\". If you want to *really* erase a hard drive you can get free software that will overwrite the drive with random data multiple times to destroy all past evidence. On a calculator it simply stops supplying the relevant RAM with electricity for long enough for it to reset to a neutral state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Turning on/off double vision?",
        "response": "I found out I have double vision because I have a retinal tear behind my one eye. It causes it to lag and I have slightly a dropped eyelid as well due to it. I really would go to your optometrist as soon as you can. Anything to do with vision is VERY important and will not go away by itself!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so hard to make friends after you turn 25?",
        "response": "The biggest factor is opportunity. Young people are almost always set up in large groups due to school. This also happens at a time in their lives when they are very open minded. As you grow older your personality tends to solidify and you tend to judge other people more solidly then when you are young.  You also don't tend to reach out of your circle to find new people as often. Now yes most adults work in places with a large number of other employees but the ages of those employees tends to be much more spread out than the ages of your peers when you're in school, and there is far less time for flat out socialization in the work place.  **TL:DR** It's not you, it happens to everyone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What mechanisms do warm-blooded species have to regulate their internal temperatures that cold-blooded animals don't?",
        "response": "\\[Mammals break glucose down into H20 and CO2 to make ATP \\(adenosine triphosphate\\).\\]\\([_URL_1_](_URL_0_)\\) The chemical process is exothermic; it produces heat. That heat is either needed or not by the body at the moment. If the body is already warm enough, the heat will be released in the breath, through skin pores and sweat. If the body needs more heat at the moment, it will be routed to the internal organs. The hypothalamus is making all these decisions and giving commands via a cocktail of hormones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a difference in the way the brain process a sound depending on whether the sound comes from left or right ear ?",
        "response": "The brain processes sound from both ears in a symmetrical way (for a diagram see _URL_0_); in addition, information from each ear is combined and compared in several different brain regions, so theoretically there should be no difference between hearing from only the right or only the left ear. In practice, every person has quirks arising during development and through life experience. You might have a hearing difference that came from an ear infection, injury, asymmetrical development of the ear or auditory regions of the brain, or just the way your ear buds fit into the ear on either side. A related question might be whether you are changing the way your brain processes sound by consistently giving it unilateral input. It's very likely that you are, in ways that are probably reversible but maybe not well understood right now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between a gatling and a machine gun.",
        "response": "Another distinction is that classic Gatling guns were hand-cranked, while true machine guns (Maxim onwards) are self-powered:the exhaust gases from one round are harnessed to eject that casing and load the next cartridge. Thus when there is a problem with one round the machine gun stops working.  In a Gatling gun the gunner would keep cranking full-speed and get some serious jams (ammunition was pretty bad back then so it was pretty common)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't there any third world countries with a majority of white people?",
        "response": "Let me rephrase the question then. Why are there no poor countries with a majority of white people? I'm still very curious.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Capturing Momentum\" in Sports",
        "response": "Momentum is just the announcers way of trying to inform the viewers who they think has an advantage at a particular point in the game. It is also assumed that a team doing well will continue to do well. Doing well will increase the players confidence in their abilities, which could make them keep playing well. I think the term \"momentum\" itself is used because it is borrowed from physics, more specifically Newton's Laws of Motion. An object in motion tends to stay in motion, much like a winning team tends to stay on top of the other team in a game (not always, but you understand).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the origin of the stellar types classification letters?",
        "response": "The [Draper](_URL_3_) system used A through N in order, based on observable Hydrogen emissions. This was later cut down and reordered by [Annie Jump Cannon](_URL_0_) to use surface temperature, putting O and B at the top. [Non-Wikipedia Source](_URL_2_) [Stellar Classification History](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do most Microsoft Office programs ask me if I want to save when I close a document, even if I didn't modify it?",
        "response": "Because you did modify it. Or at least it was modified by the program ina away that isn't visible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long could you survive being in space unprotected?",
        "response": "You won’t explode, our bodies are pretty closed systems. You won’t freeze, heat transfer is far slower.  If you had air in your lungs they’d explode due to gas expansion in low pressure.  So I guess the answer is: how long can you stay conscious after completely exhaling? You’d just asphyxiate, so a minute or so. Maybe longer with tissue (read:brain) damage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did removing Pluto as a planet change astrology in any way?",
        "response": "Pluto, Neputer, and Uranus, aren't widely used in astrology, largely because they were only discovered in the past few centuries. There are some astrologers who use them, and even include some of the dwarf planets.  But I doubt Pluto's demotion changed much, astrology is still fake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- Why do some people look different when they first wake up in the morning?",
        "response": "You think your 7 month old is hotter in the morning?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why have \"the car of 2016\" already been awarded some places",
        "response": "Because the cars have been in design for a long time, and journalists have already seen them. The first 2016 model isn't going to roll off the assembly line on January 1st.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't employees at a business take items that have been abandoned there, but regular people/customers can?",
        "response": "Probably to prevent employes from trying to set stuff aside so they can take it as an abandoned item.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "EL15: Why did Oprah get sued by the beef industry for defamation when I pass billboards all the time from Chick-fil-A where they diss beef.",
        "response": "Winfrey and Lyman were sued — unsuccessfully, it bears remembering — for saying that beef is *deadly,* that the beef industry is *unsafe,* that eating a hamburger will kill you dead on the spot, and that — this isn't hyperbole, I'm quoting directly now — \"Mad cow disease makes AIDS look like the common cold.\" That's way more serious than \"Beef is yucky, eat chicken instead.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Freud's Theory of Penis Envy.",
        "response": "Almost all of Freud's theories have been disproven.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we unable to digest some hydrocarbons (such as petroleum and gasoline) while others (like glucose) are perfectly fine?",
        "response": "Because we don't have enzymes evolved to break them down into more usable chunks. Enzymes are VERY particular about what they work on - it has to be exactly the right shape and size. Even breaking apart glucose takes several different enzymes - each enzyme acts on a different carbon that makes glucose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does Apple have $53 billion in cash?",
        "response": "It's not literally cash. It's mostly liquid investments (ones you can turn into cash in a hurry). For example, stock is considered a cash-equivalent, since you can sell it the same day and turn it into cash. A big office building is not cash, because it would take forever to sell.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a reason why the Ancient Egyptians used a sickle sword instead of a (seemingly easier to produce) straight sword? What benefits does it have?",
        "response": "Related question: wasn't a very similar design also used by bronze age Canaanites? Was it a technology they imported from Egypt? How popular was the sickle sword in the bronze age near East, generally?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Chinese armies do against non-nomadic opponents?",
        "response": "In which time period are you referring to? Chinese history extends some four thousand years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is our peripheral vision really grayscale?",
        "response": "Its not greyscale, however, colour perception is significantly reduced compared to the centre of our vision. When you look at something directly, it falls on a part of the eye [the fovea] that contains only cone cells. These cells allow us to see in colour. However, outside of that small part of the eye, rod cells predominate, but there are still some cone cells. Thus, we can still discriminate some colour, but our brain does also fill in some information.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If every blood donation is screened for HIV, why is it dangerous to let a group with a higher rate of HIV donate blood?",
        "response": "Window period of HIV testing: this is the time between when you acquire HIV and when an HIV test becomes positive. If you donate blood between those two time points, that unit of blood may transmit HIV. Imperfect testing: the tests used to screen the blood supply for communicable diseases are very good, but not perfect. A population with a higher rate of infection with a disease has a higher rate of false negative test results. Using medical terminology, I am referring to the dependence of negative predictive value on pre-test probability for a test with a given sensitivity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What physically happens to the body when we're tired and how does sleep help?",
        "response": "“As far as I know, the only reason we need to sleep that is really, really solid is because we get sleepy.” This comes from William Dement, retired dean of sleep studies at Stanford University, co-discoverer of REM sleep, and co-founder of the Stanford Sleep Medicine Center.  This is really all we have : the rest is just guesses. We don't know why we need sleep. Once in a while a new theory appears, but for now, we have nothing conclusive apart from that. We know that sleeping is necessary because of experience (sleep-deprived people get worse and worse and eventually die), but we don't know the mechanisms behind this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why males are so reluctant to talk about their problems compared to females",
        "response": "Well, probably because it seems weak to us. We're constantly told to be a man, man up, take it all on the shoulder and that things shouldn't hurt us or we're weak, it's ingrained from birth that we have to be strong all the time. When you're under that kind of social pressure it's no wonder we don't like to talk about our emotions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do large airplanes retract their landing gear after taking off?",
        "response": "The landing gear cause a tremendous amount of aerodynamic drag at the high air speeds attained in commercial aviation. As a result, with gear down an aircraft can't fly as fast and burns significantly more fuel (for a large passenger jet, roughly twice as much fuel for the same distance traveled). Given that a jet might burn more than 100000 liters of fuel in a given flight, that does not represent a negligible cost.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were British loyalists generally treated in the American colonies during and post-revolution?",
        "response": "A brief answer is that they were not treated particularly well in many cases. During the war many loyalists took up arms and formed regiments to fight the patriots. Even those who did not fight faced persecution from the rest of the colony's inhabitants, including mob violence and confiscation of property and land. After the war many fled the colonies into Canada.  You may find some more detailed answers to your questions on these previous thread. * [Were Loyalists ever suppressed after the American Revolution?](_URL_0_) * [Was there anything like a Reign of Terror during the American Revolution?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Limitations of presidential pardons?",
        "response": "The president can pardon any federal crime comitted by anyone. Examples of federal crimes on Wikipedia include >  ... aircraft hijacking, kidnapping, bank robbery, child pornography, obscenity, tax evasion, counterfeiting, violation of the Espionage Act, wiretapping, art theft from a museum, damaging or destroying public mailboxes, immigration offenses, and [...] assassinating the President  There is an [incomplete list](_URL_3_) of people who were granted pardon on Wikipedia. For instance, there's [William Calley](_URL_0_), who was found guilty of murdering 22 unarmed civilians on the [My Lai Massacre](_URL_1_) and sentenced to life imprisonment, but pardoned by president Richard Nixon. (His boss, [Ernest Medina](_URL_2_), responsible for planning and ordering the whole massacre, wasn't even found guilty in the first place)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get tanned?",
        "response": "Sunlight has UV rays in it, which can be harmful to your skin. Your body detects this and releases a chemical called melanin to protect yourself. A side effect of this chemical is that it causes your skin to darken.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are dogs such good companions?",
        "response": "They don't understand where we were. Dogs are pack animals, they consider their humans to be members of their pack. When a pack member disappears, that's not good for the pack. Their sudden return is cause for happiness. Why they are so loyal in general is a little more complicated.  One explanation I have heard is that dogs trust humans. They are one of the few animals (counting humans) that recognize that everyone has a different perspective on the world. They recognize that humans see the world differently, and that we tend to know a lot. That's why they want human food so much, they see us eating it and assume that it must be good therefore they want it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does petting animals give us physical comfort?",
        "response": "Most mammals have special sense receptors that respond favorably to gentle touch, which is why the vast majority of mammals will enjoy being pet (or petting something soft). So gentle stroking feels good to them, almost as much as it feels good for you to do it. We also have a certain chemical in our body (oxytocin) which is related to bonding and affection. Research general states that this chemical is released while we're petting or sometimes even looking at our pets.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does time pass so swiftly while we are sleep?",
        "response": "Can't tell if trolling...! Time does not pass any more swiftly - it ticks away as it ever did. But our perception of time only exists when we are awake and aware of time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there no closed-form solution for n-body problems?",
        "response": "There is a solution, it's just not a very useful one. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If matter cannot be created nor destroyed where does the matter that black holes intake end up?",
        "response": "For a while this was a big question, but as it turns out it stays right there. With enough matter black holes can get bigger, but if they don't get anything for a long time they get smaller. This seemed impossible because nothing could escape a black hole. As it turns out black holes give off small amounts of radiation and extremely slowly after long periods of time a black hole can lose enough mass back into space to no longer be a black hole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is listeria contaminating cantaloupes?",
        "response": "For cantaloupes, it's more probable that contamination occurs when the fruit is cut, rather than leaching, because the hard rind of the cantaloupe prevents it's absorption. Since the rind isn't eaten, few people actually wash it before it's consumed. And so when it's cut, the bacteria from the outside gets into the fruit.  [Check out the fourth paragraph.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do radio stations get paid when they play someones songs, or vice versa, or does no one get paid or what?",
        "response": "Radio stations have to pay fees to ASCAP and BMI for the right to play copyrighted material. Over the air stations pay much higher fees than online streaming services.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any historical examples of an army causing a man-made \"natural\" disaster to attack the opposing side?",
        "response": "During the second Sino-Japanese war, as Japan was invading China the Chinese leader Chian Kai Shek ordered the dikes on the Yellow River blown up to cause a flood which slowed the Japanese advance. It was also later blown up again during the Chinese civil war.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the 3rd Party Doctrine not violate the 4th amendment?",
        "response": "The Third Party Doctrine has usually been justified on the basis that you have no reasonable privacy interest in information you're already passing off to other people. If you send a letter from to Johnny, the Post Office can't intercept it (without a warrant), but Johnny can give it to the police if he likes. The problem with this idea, of course, is that we provide our information to others with a limited expectation of what they will do with it. Nor was the doctrine designed with the situation in mind where the government is getting a nearly live feed of *all* information, rather than making targeted requests. As more and more of our important \"papers and effects\" are on third-party private infrastructure, a change in interpretation or the law becomes necessary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why old people like bingo?",
        "response": "Gets you out of the house. Can be social with friends and regulars. Potential to win money. No casinos in the area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During Prohibition, how did drinking establishments prevent themselves from standing out due to traffic/drunk patrons leaving.",
        "response": "Passwords to get in to certain clubs, secret rooms for drinking and private parties. Some establishments actually had tables whose tops slid apart to reveal a funnel through the stand, down into the floor and basement so all beverages could be immediately disposed of if the Bureau of Internal Revenue's Prohibition task force came knocking on the front door. In other cities, police corruption allowed certain establishments to continue supplying liquor as long as they were paid off. Some local judges declared the whole situation insane and would inflict the lightest punishment admissible, i.e, $2 fines, since there was no room in jails for all of the citizens of every class who would be brought in on charges after a raid or street sweep, unless, of course, it was a high profile case. In many instances, yes, the law was complicit in alcohol sales in most counties, to an extent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we still discussing if climate change is caused by humans and how many scientists believe this? It seems we can at least all agree there's a possibility it's caused by humans and we better error on the side of caution.",
        "response": "I never understood this either - surely the best recourse must be to err on the side of caution as the vast majority of scientists support it and do economic projections of how much it's gonna cost.  It's just good business to do so",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why bigger trucks use diesel and most cars use normal gasoline?",
        "response": "Diesel engines are more fuel efficient, which is important with heavy trucks. Most cars are gasoline powered because gasoline engines are cheaper to make, lighter, more powerful for their size, and emit less of certain types of pollutants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a restaurant emptying its fryer grease traps down the drain cause the sewer to back up, Or is it only other types of grease that do this?",
        "response": "Any type of grease or fat going down the drain can cause fatbergs to form and clog the sewer. That is why it is illegal for them to do that. They have to dispose of their used oil in a very controlled manner.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between CBT and DBT therapies?",
        "response": "DBT is a specific section of CBT.  DBT emphasizes how someone (yourself usually) reacts or acts in certain situations. Such as if someone says something bad to you, how do you take it. Or if someone says something simple, how or why does your mind take it to the extreme. Like a boss will say \"hey lets chat today\" and odds are they want to follow up or something, but why does your brain take it to the extreme of probably getting fired and everything is ruined. If that makes sense.  [Here's a site](_URL_0_) that has a bit more explanation  I'm not a psychologist or therapist BTW, but going through a DBT class actually and CBT with my individual therapist. I find it helpful and sometimes very difficult to dive in to every emotion, but it has definitely been helping.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can junk food have so much salt in it, but not taste extremely salty?",
        "response": "The sodium in salt binds with other elements in ither ingredients and creates new properties, including different flavors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the neutral pion an eigenstate of mass?",
        "response": "It’s not a mass eigenstate of the full Hamiltonian that describes all particles and their interactions, because the pions decay. This means that there’s an uncertainty (a “width”) in the masses of the pions, inversely proportional to their mean lifetime. Just considering QCD, the pions are indeed eigenstates of the Hamiltonian, so they’d have infinitely precise masses, and they wouldn’t decay if QCD were the only physics in the universe. However the mass of a bound hadron has little to do with the bare masses of the valence quarks that make it up. For example, the vast majority of the mass of a proton or neutron could not be explained if you assume that the mass of a nucleon is the sum of the bare masses of the three valence quarks. The same is true of mesons, the bare quark masses don’t necessarily mean anything when it comes to the mass of the entire meson.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "King Arthur - Legend, myth or truth?",
        "response": "More can always be said, but you may be interested in [this section of our FAQ](_URL_0_) -- u/itsallfolklore in particular has written often about the intersection of myth, folklore and truth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the risk of suicide higher when taking antidepressants?",
        "response": "I'm not a scientist, but this is what my abnormal psych professor theorized: People who are deeply depressed are so bogged down in the feelings of worthlessness, constant ruminations, suicidal ideations, etc., that they can't even muster the motivation to get out of bed.  However, sometimes when such a person first starts taking an anti-depressant the fog begins to lift, just a little bit. So, the feelings of worthlessness and suicidal ideations are still there, but the drugs lift them just enough to where they can motivate themselves to go out and perform the suicidal act they could only fantasize about before. edit: Yes, this is speculation and has not been proven, though it is a popular belief among many mental health professionals. The study below and others like it have been unable to confirm an increased risk of suicide in the beginning stages of antidepressant treatment: Simon, Gregory, et al. Suicide Risk During Antidepressant Treatment. Am J Psychiatry 163:41-47, January 2006. [link](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Fourth Dimension",
        "response": "Okay think about the world we live in, there are 3 ways we can measure something. Up/Down, Left/Right, Forward/Backwards. But there is a 4th, time. The simplest example is when you say you want to meet your friends at 3, but arrive at 5. They may not be there. But in 3 dimensions you are in the correct place, just not in the 4th because you are late. So in a way, you are 2 hours away from your friends.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come domesticated animals such as goats need to have their hooves trimmed to prevent injury? How do wild animals solve that problem?",
        "response": "i think most wild animals that have this done tend to take care of it naturally by just walking around on harder surfaces. rocks and wot not with wear the hooves down. domesticated animals tend to be kept in a field full of soft grass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Paramedics and other emergency responders get into apartment buildings",
        "response": "Depends where you live. I used to manage a large building in Hamilton Ontario. In that city, landlords/managers can give first responders a private door code to enter the building. I chose not to, because I lived adjacent to the lobby and generally dislike police, but most other landlords are on-board with the plan. So they may have their own code to get in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the school year start in September?",
        "response": "after the summer farming season kids went back to school.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Algorithms, how do they work and is there another way?",
        "response": "An algorithm is just a procedure. If your morning routine is \"Pee, shower, and make breakfast\" then that can be described as an algorithm. Is there another way? Well, I guess you could have breakfast first. There are always ways to change an algorithm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is water so important for the search for life in the universe? Couldn't that just be how life on earth works? Similarly, why do we assume a planet can only be this \"goldilocks\" distance from a sun in order to support life?",
        "response": "You have a good point. You can also ask what can be considered living. We only understand life as it is on earth. Thus we know wat we are looking for on these goldilocks planets. That being said, there may be an object in the middle of a planet that could be classified under our definition of living organisms. Those 7 characteristics of life. But we have no idea how other live an arise from something other that C, N, O and H molecules, and these molecules can only be used generally as animals on earth use it. Because of that we also know a certain temperature for these are needed with certain conditions. Thus we believe there is a bigger chance of finding life on planets with similar conditions. Hope this helps:)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do mathematicians imagine higher dimensional space?",
        "response": "The 'we don't' answer is more or less correct, but we can think of higher dimensions as functions. For example, four dimensional space is the collection of all 4-tuples. And countably infinite dimensional space is the collection of all infinite sequences, or functions from the naturals to the reals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is ice clear when sculpted/in a cube form but turns white when broken or smashed?",
        "response": "When it is sculpted and polish the surface is flat which will cause all the light that hits it to continue in the same direction (although slightly bent if the incident light is not orthogonal to the surface). When it is broken however it tends to break in very ''unsmooth'' ways. Therefore when hitting the surface the light gets it direction changed differently depending on the exact angle at the spot where that individual wave hits it. This is due to the fact that the process of [refraction](_URL_0_) is angular dependent. Therefore two waves that come in right next to eachother may get refracted very diferently because it are different microstructures where they hit the surface on the way in/out of the ice giving different angles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If movement such as water and wind can generate electricity. Would it be possible for earth's rotation around its axis to generate the entire world's energy demands?",
        "response": "As others have mentioned you would need an enormous space station. Okay say you built it though and somehow it was cheap enough to make the energy it produces valuable (it won't be). Anything you get has to *come* from the earth. Even if you can manage to take it without heavily damaging the planet there's only so much energy there. If you turn your turbine with the earths rotation then the earths rotation must slow. After some time it would all be gone and the earth wouldn't rotate anymore. Cue apocalyptic environmental catastrophe as the day/night cycle has become a year long event.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would a typical modern adult human who'd never seen or heard of a snake before instinctively know it was dangerous and which end to be worried about?",
        "response": "Monkeys are instinctively afraid of snakes, even captive-born monkeys that have never seen one (_URL_0_) but I can't find a source for apes. However, the part of the brain in the macaques that responded so strongly to the snake images is conserved across primate species, including humans. I'd say it's likely.  Edit: link was borked, fixed now",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does glass shatter in the web like pattern that it does?",
        "response": "Glass shatters when the stresses placed on it are higher than the material's structure can tolerate. Because it is a brittle material (unlike metal, which is ductile), it can't bend or deform - it just breaks, like a cracker.  The specific lines of breakage occur along the lines of high stress in the glass. When one region breaks, it relieves stress nearby, making fractures less likely to happen in the immediate area. As this process goes on, you end up with a spider web-like pattern.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the Mad Cow Disease? Why can humans get it?",
        "response": "I'm sorry to hear about your friend.  Bovine Spongiform Encephalopathy (mad cow disease) and the version humans get (Creutzfeldt-Jakob disease) are both caused by a \"corrupted\" or misfolded version of a certain protein that both cow and human cells make, called the prion protein (PrP). The disease doesn't spread as a virus or bacteria, your body puts proteins together by using existing versions as template. If that template is corrupted, the new copies are corrupted too. In the nervous system, misfolded PrP sticks together and grows into fibrous masses, destroying and displacing cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does blowing your nose/coughing up phlegm help fight a disease?",
        "response": "Phlegm / snot are the byproducts of your white blood cells attacking a foreign invader - whether that be bacteria, virus, disease. Usually my doctor will ask the color and consistency of both to determine if I need a booster or not. Coughing/sneezing them out typically won't help in the long run - the invaders have already been swept up in the ICE raid that is your immune system - the paddy wagon is your mucus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Rules Roundtable #8: The /r/AskHistorians Homework Policy",
        "response": "> I'm writing an essay on the development of the bolt-action rifle, and the effect it had on warfare in the latter-half of the 19th century. I've mainly been focusing on the Austro-Prussian War, and the clear dominance that the Dreyse showed over Lorenz Rifle, and the Franco-Prussian War, where the Chassepot in turn showed itself to be superior to the Dreyse. What I'm tripping up on however is why, after its strong showing (even if the French lost) the Chassepot so quickly was regarded as obsolete. If someone could help me out here, or point me in the right direction, that would be great! I'm actually really interested in this now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would it be possible to make a sandbox style game using Google Streetview as a template for a real city?",
        "response": "Google images are flat (2D). You would need to have 3D models for everything in the game, so you could theoretically pay programmers to model everything in google street, but you can't just paste google street into a game and be done with it if that's what you're asking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do currency values change constantly?",
        "response": "Like everything else, currency responds to supply and demand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do fraudsters use stolen credit card details to buy things that I think can be easily traced back to them?",
        "response": "You are considering fraudsters to be just like you. You have a fixed address. You own important things. You can be traced. The fraudster lives in a different world. Those airplane tickets may have been shuttles to Washington D.C. Buy, board, fly, leave. Three people may have flown a short flight. They were gone before they could be traced. A fraudster may do a thousand dollars worth of damage in order to get a few dollars worth of value. It does not matter to him or her. What matters is that their was a gain for them. Things can be bought online, then returned for cash. Fake IDs can be arranged that work to buy things. Then those things can be pawned.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't someone file a FOIA request to obtain Mitt Romney's complete tax returns?",
        "response": "Individual tax returns are not public information, so the IRS won't and doesn't have to release them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why clouds turn grey when it's going to rain",
        "response": "Thicker, denser, more water content. With less light passing through, they look darker, or greyer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a bubble in economics?",
        "response": "A bubble is when a commodity becomes highly over-valued due to market speculation. People see the price of something rising and think that they had better buy it before the price rises even higher so that they can eventually sell at a profit. This drives the price higher and attracts more speculators. Of course, people are going to want to sell eventually, and a dip in price can cause everyone to try to sell before the price drops too much. That's when the bubble bursts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are boogers made of?",
        "response": "The main ingredient is dried and semi-dried mucus secretions. This can also contain dust, dirt, fibers, and any other particulates from your environment that you breath in and get trapped in the mucus. This can also contain dead epithelial cells, nose hair, and if you have a cold or other infection, bonus white blood cells that are trying to eat invasive bacteria and viruses.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there stars that have begun to collapse into black holes, but stabilize before they fully complete the transition?",
        "response": "Would you consider a neutron star to be such an object?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are roundabouts so uncommon in the US even though research claims that they are safer and more efficient?",
        "response": "Real estate developer here. I know we aren't excited about using them in a private development because local code requires up to 96' circumference of right-of-way for a cul-de-sac or roundabout vs 50' width (26' street and 12' of r-o-w on each side) for a street or 4-way stop. The fire department usually dictates this by the size of their largest ladder truck that may need to turn around. The economics don't compare when you're selling valuable land by the square foot.  In a public project the city would have to buy more r-o-w which isn't popular.  I envy how much smaller and dense everything is in Europe. We have so much more land in the states and the code takes full advantage of that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the internal combustion engine work?",
        "response": "Suck. Squish. Bang. Blow. Air is brought into the cylinder and is then compressed by the piston. Gas is added and a spark is ignited to blow up everything. This pushes the piston down which in turn spins the drive shaft. Exhaust gasses are then released from the cylinder and the process repeats. Each cylinder in an engine is staggered in this process to create a smoother running machine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does sticking one foot out from under the blankets prevent me from getting too hot?",
        "response": "When you are warm, blood flows more readily to your hands and feet. When you are cold, blood flows away from them, making them colder than the rest of your body. This keeps your core (your torso) more consistent in temperature and protects from overheating or hypothermia (an extreme case of being too cold). As a result, on a warm night, much of your body's heat might be in your feet, where it can radiate away better to try to cool you down. In addition, your extremities perspire (sweat, though \"only pigs sweat\") very readily when hot. This explains why sticking your foot out can cool you down, just as much as why wearing good gloves and shoes/socks can keep you warm when it is cold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would our sun (Sol) be visible from Alpha Centauri?",
        "response": "Yes. The two Alpha stars together are about twice as bright as the sun, and the sun would have a magnitude of about 0.5, comparable to Vega as seen from Earth, from Alpha Centauri.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If food is used to produce energy in our body, what does sleep actually do?",
        "response": "Sleep is one of the things we still don’t understand very well. We know what not sleeping does to us, but the best we can tell about why we ‘need’ sleep is to ‘recharge’ and ‘rejuvenate’ and maybe clears toxins. It also speeds up some processes that occur while awake like healing and forming memories. But the primary reason we sleep, is to cure the feeling of being tired. Basically we know that not sleeping has harmful effects, and that sleeping fixes it, but we don’t really know why, biologically.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Morse code. Is it, it's own language or is it in English? How did it become universal?",
        "response": "Morse code isn't a language, it's an alphabet, although it uses the same letters as english. Individual letters are signified with a combination of dots and dashes, and words are spelled out as per normal. So you can use morse code with whatever language is compatible with the letters you have available to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some states deciding to constitutionally ban gay marriage if gay marriage isn't legal there anyway?",
        "response": "If it's constitutionally banned, then the state's courts can't declare that discriminating against gay marriages is illegal. So if a constitutional ban is passed, and the federal government does not require states to allow gay marriage, the only way to get gay marriages legal would be through another constitutional amendment.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does NORAD 'track' Santa.",
        "response": "Because of a wrong number printed in a magazine or newspaper back in like the 1950s that gave NORADs number by mistake for an advert to call Santa. The base commander decided it was fun for the kiddies and went with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some songs on pop radio stations just now start to be played when they are months to a year old?",
        "response": "The record labels control when radio starts playing music. I don't listen to pop radio much, but I feel like \"Take me to Church\" became popular without radio, then the label released it to radio.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the appeal of Protestantism to those living in Reformation Europe?",
        "response": "You should read Norman Jones' \"The English Reformation,\" and, if you're up for it, Ethan Shagan's \"Popular Politics and the English Reformation\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we use Latin for the abbreviation AD (anno domini) but English for BC (Before Christ)",
        "response": "a popular question! check out this post in the \"popular questions\" wiki*: [AD = Anno Domini, BC = Before Christ. Why is one Latin and the other English?](_URL_1_) and if you want to know more about years, check out this whole section... [How did the world agree on what year it is?](_URL_0_) *see the \"popular questions\" link on the sidebar, or the \"wiki\" tab above",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wont planetary mining cause a massive slump in the price of rare earth metals and commodities rendering them almost worthless in the future?",
        "response": "This is a fundamental flaw in the 'asteroid mining' plan, and not an uncommon one. Pricing of rare minerals is a function of availability and, yes, if they should become readily available the pricing will plummet. Not just that, but pricing is made 'at the margin' meaning a small increase in supply can result in a large drop in price and vice versa. Fun fact: aluminum used to be more valuable than platinum and now we use it for Coke cans and throw it away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would Europe profit by sending people to the moon again?",
        "response": "Profit. Not that much. In any case, the ESA isn't exactly planning to go to the Moon. They held a symposium (conference) about possible moonbase plans, not much more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Do American's Take Halloween and Costumes So Serious? Why Is It Such An Important Event In The Year?",
        "response": "The simple answer is that it's fun. A lot of people like to get artistic with their costumes and have fun dressing up with family and friends.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My friend said that he can open his car by pointing his car keys at his head. How legitimate could his claim be?",
        "response": "He's using his skull as a directional antenna, focusing the radiosignals in one direction. Imagine a garden hose set to spread, then you turn it into a thick beam.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much does an average human body cost, based on its chemical components?",
        "response": "Depends on what you mean exactly. You can go ask some human trafficking organizations to see what you'll get for complete humans in various places, you can ask after black market people and the cops to see what intact organs and tissues go for piece by piece, or you can trust /u/Rks1157 for his evaluation on what you'd be worth as literally just all the distinct chemical parts of you in separate jars.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all dog breeds today came from interbreeding certain types of wolf, coyote, and fox, why aren't they considered to have 'evolved' from them?",
        "response": "That's mostly a matter of semantics. When we use the term 'evolved', scientists are referring to the gradual change of a species over time due to natural selection. Dog species came from artificial selection, which is essentially man-made evolution. Plus when we use the term 'evolved from', we're usually refer to a separation of species. All breeds of dogs are still considered one 'species' - Canis lupus familiaris.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does too much acid in the stomach cause indigestion, rather than speedier digestion?",
        "response": "If you're saying \"indigestion\" to refer to acid reflux or GERD, the pain isn't from excess acid in your stomach. The symptoms are because the acid your stomach was producing to digest your food got into your esophagus. Imagine your stomach is like a balloon that has two knots, one at the top and one at the bottom. The knot at the top connects to your esophagus. The top knot is only supposed to open when you're swallowing and only just enough to let the food get into your stomach. When you have reflux, it's because your top knot malfunctioned and accidentally let acid up and out, instead of keeping it inside the stomach with the food. Stuff is only supposed to go out the bottom knot.  Edit: There are a couple of reasons your top knot might malfunction. Most commonly it's because it could become \"lazy\" and dilly dally before closing after you swallow. if the knot doesn't close when the food goes in, the food will displace some acid and some will get pushed up into the esophagus. Aka acid reflux or GERD.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do elderly people have 'that smell'?",
        "response": "There's [a chemical change in human body odor during old age](_URL_0_), which increases the production of a chemical called [2-Nonenal](_URL_1_). Humans actually smell different at all ages, though especially when they're very old, and [people are fairly good at determining the age of somebody just by how they smell](_URL_2_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What film/tv series gives the most accurate portrayal of the German army under the Third Reich?",
        "response": "There aren't actually that many German-centric war movies out there that actually are accurate. However, the best is by no doubt *Das Boot* when it comes to the ordinary U-Boat crew. As Super King before me said, *Downfall* is a great movie but not necessarily out of the perspective of an ordinary German soldier.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you get bags under your eyes when your tired and how does sleep effect this?",
        "response": "A lack of sleep causes the blood vessels in under your eyes to dilate which creates a dark tint under your eyes. Fluid leaking into your eyes can also make your eyes seem swollen and puffy, and can be painful. While lack of sleep can lead to dark circles under your eyes it isn't the only cause. Genetics, poor pigmentation, and aging can also cause the circles to be worse. Staying hydrated helps to prevent the circles even on late nights with not so much sleep. And be sure not to rub your eyes for an extended time and with too much pressure, this can rupture the tiny blood vessels and make your dark circles even worse.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If water is clear why does the ocean look blue from outer space?",
        "response": "Water has a very weak blue tint. It's only noticeable in larger bodies of water",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are human interactions under the influence of alcohol easier?",
        "response": "Imagine getting up, grabbing your chair, and flipping it. Merely by imagining it, you are able to map out the muscles you'd use to do it. You're able to plot how you'd go about it. You start to prepare yourself to actually do it. You prepare for the action, but are inhibited by a wide variety of factors, including knowledge that flipping your chair for no reason would be a very silly thing to do. In very simple terms, alcohol doesn't interfere without ability to think about doing things nearly as much as it interferes with the ability of thoughts to inhibit the actions you are considering. One of the more pleasant effects of this is that it makes all of the worries you have when you are talking to others less likely to stop you from following through with talking to others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we get the sinking feeling in our stomachs, or tingling in our hands/feet when viewing videos or pictures of heights?",
        "response": "The human mind can be tricked sometimes. When we view a picture or video of heights we feel vertigo. Your brain can't help but go \"oh shit this seems like a bad idea\" Of course it's different if you have a fear of heights then your bodies just giving off a big \"fuck no\" It's the same if you see a video of a truck or train coming right at you and you feel the need to flinch or jump out of the way. Brains are weird.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who has been worse off? Women as a class throughout history, or American slaves?",
        "response": "I think such a comparison is highly problematic. There's too many variables to compare the two groups equally (think apples to oranges.) For every instance of injustice towards women there's many instances of injustice towards black slaves, and vice versa. Instead of trying to make comparisons (which inevitably devolve into a game of 'who suffered more?') I think we're best off studying the issues separately as well as making a point to understand the intersectionality of racism and sexism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do animals know if another animal is a herbivore or carnivore? If so, do carnivores see them as an easy target?",
        "response": "As far as predator recognition goes it depends on the animal. A lot of aquatic animals use chemical cues to recognize predators, and some of that is learned and some innate. Mammals also seem to learn which other animals are predators. But most animals will also learn to generalize. So if (as a hypothetical) a squirrel has learned that a hawk is a predator, but a sparrow is not, he might also think that sea gull is a predator because of its size; and minnows will generalize trout, but then not extend that to pike. And robins that have never encountered a mammal will learn after one encounter that a stoat is a predator and will react accordingly the next time they encounter a stoat.      So prey species recognize the predators in their environment, but it's mostly learned.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we hear about new cancer treatments, but patients still just get surgery, chemo, and radiation?",
        "response": "Those new treatments are chemo... Not all chemo is the same. We have much better drugs than we did 30 years ago. For example, in 1975, a patient diagnosed with breast cancer had a 75% chance of being alive after 5 years. Today, that's over 90%.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are most windows (on buildings) rectangular in shape and not circular or triangular?",
        "response": "Well, from a construction standpoint, it's far easier to build using 90 degree angles. That would apply to the building as well as the window itself. Generally *easier* translates to faster and, (more importantly), cheaper.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "when the Feds raid the home of a drug dealer/drug lord and find stacks and stacks of money, where does this money go? Who gets to keep it?",
        "response": "For the most part, the organization in charge of the bust gets to declare it as \"windfall income\". In other words, the feds get to keep it for themselves. Edit: Spelling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is stopping us from having a functional, manned spacecraft and larger space installations?",
        "response": "Money.  The only major scientific roadblocks would be the effects of low-g on health and radiation. But with money, you can afford to send up enough shielding, at least for a panic room. And with money, you can build a big enough crew compartment to rotate to provide gs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does apple cider vinegar help digestion?",
        "response": "The short answer is \"it doesn't\". Nearly all the claims of apple ciders effects on health are unsubstantiated by rigorous science at best and pure fabrication at worst. You are correct in that a base is required to neutralize an acid. As such, *if* apple cider vinegar has any effect on digestion, it is definitely not through the neutralization of stomach acid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given that Roman Catholic Mass was in Latin until the Second Vatican Council, how well did the laity understand church doctrine?",
        "response": "Given that a comment by another participant clarifying that while the Catholic liturgy was in Latin, homilies were given in the vernacular was deleted I will provide a source. _URL_4_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't there a surgery to remove or alter the part of the sinus that overproduces mucus/snot for allergy sufferers?",
        "response": "First, the majority of allergy sufferers, have the main issue of sinus inflammation. A majority of the time, a stuffy nose is just that, an inflamed sinus. That's when you feel stuffed up, blow our nose, but nothing comes out. However, sometime there is an overproduction of mucus. However, if you were to remove that completely, the results would be worse than any runny nose you've ever had. A lack of mucus production would lead to a dried out cavity that would crack, bleed, etc. Any opening to the body (mouth, nose, genitalia, etc) needs to remain well lubricated for proper functioning of your immune system among other functions as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that my vision doesn't \"bounce\" when I'm walking or running? What does my brain do to stabilise the images from my eyes, and how does it know it should?",
        "response": "Two things are happening to correct for this. First, your eyes have lots of tiny, strong muscles that help them dart around. After decades of talking and running, your eyes are really good at compensating for the anticipated movement and keeping steady. Both your eye muscles and your leg muscles are being controlled by your brain, and so it can coordinate the movement of the two using knowledge of what is expected to happen to your body when you take the next step.  Second, what you see is not what your eyes are seeing. Your eyes send raw data to he brain, and the brain makes a picture using the data. You see that picture. Since processing data is boring, and brains are lazy, it usually just assumes parts of the image are what is expected to be there unless something stands out. This effect compensates for any minor miscalculation of the eye muscles resulting in a temporary bounce.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does meat decay in the vacuum of outer space?",
        "response": "No, in fact it would probably turn into something similar to beef jerky.  In space, the water would boil off, dehydrating the meat and if it was in view of the sun it would be slowly dehydrated and cooked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Help! I'm trying to finish my research paper before it's due!",
        "response": "Some periodicals do not list an author. The Chicago Manual of Style states, \"If no author is identified, begin the citation with the article title.\" Hopefully this helps you with your citation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the thought of eating something sour recreate the feeling of actually eating it, especially when other flavors don't act that way?",
        "response": "it's such a strong feeling that your body recreates it slightly, like how some people feel sick after looking at alcohol days after getting blackout drunk. you can feel the same thing slightly with very salty or bitter foods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What 'seeding' and 'leeching' have to do with downloading torrents.",
        "response": "Seeding is the act of hosting a torrent for others to download. Leeching is the downloading of a file hosted (\"seeded\") by someone else.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have there been movements in the 20th Century demanding or that women be conscripted on a par with men?",
        "response": "> Given that in many of said countries able-bodied men were either conscripted or liable to be drafted, were there any non-fringe movements in the first half of the 20th Century demanding that female conscription accompany female suffrage? There are a lot of generalities in your question, how do you define 'fringe' and 'non-fringe'? The group that I'm aware of that 'demanded' women should participate in the war effort to the same extent as men were women in the Soviet Union who wanted the egalitarianism that was started during the Russian Revolution, and continued into the 1920s and 30s, to be evident during the Great Patriotic War as well. For some of this history, see [Soviet Women in Combat: A History of Violence on the Eastern Front](_URL_5_). This, of course, does not apply to all women who served in the Red Army. Some 800,000 women participated in the war, but how many were coerced and how many volunteered out of egalitarian principles is hard to determine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if you launched a rocket in the opposite direction the earth was rotating with enough force to literally not be moving?",
        "response": "The knowledge you have is wrong. You do not need to be moving to go through time; that's good, because there is no sort of universal reference frame that allows us to say things are absolutely moving or not moving. If you were in a frame in which the earth moves at 365000 mph, you would observe some relativistic effects, but they're insignificant enough that wolfram alpha won't tell me exactly how much.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't police officers use non-lethal weapons?",
        "response": "Overwhelmingly police officers use non-violent and non-lethal weapons to control situations. You just don't hear about these because its not too interesting--its pretty rare to use lethal force. How many news reports do you hear of a police officer calmly diffusing a situation, or using a taser or just grabbing a person? Not too often",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is coughing sometimes associated with heart conditions?",
        "response": "In congestive heart failure, fluids that the heart should be pumping and circulating through the body start building up in places they shouldn't, notably the lungs. Hence - coughing. That's also why swelling of the extremities is so common.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference and role in USA between Police, FBI, Sheriff's Dept, Marshall's etc",
        "response": "Police: City level law enforcement.  Sheriff: County level law enforcement. Primarily focusing on the areas outside of cities. They tend to run the Jails, and will often provide police services for those towns too small to have their own police departments. State police: State level law enforcement.  FBI: Federal level crime enforcement. Missing persons, multi-state crimes, serial killers, drug trafficking, people trafficking, terrorism, etc. US Marshal: Federal level law enforcement, focusing primarily on those that skip out on bonds. They also protect those in witness protection program.  Some States also have elite police units like the Texas Rangers that function like the FBI but limited to their state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When people take videos from older phones, why is it that the video itself will warp so that straight lines become bent?",
        "response": "It is an effect of the lens bending the light of a viewing angle onto the CCD-chip which is a rectangular surface. Straight lines aren't bend perfectly and hence, they become curved as they are recorded.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the roman empire, why did the people from the provinces not trust the senate?",
        "response": "Hm. I don't actually know what you are referring to. Are you talking about any specific incident or event? Any particular time period? Any specific province?  Are you referring to the Roman Empire (I.e. the time after Augustus, when Rome was ruled by an emperor) or do you perhaps mean the time of the Republic? The senate continued to exist in the Roman Empire, but it didn't make many important decisions anymore... at least without prompting from the emperors. But the Senate did still provide many provincial governors. So: We'll need you to provide some more information so we can be sure what it is you're actually asking. As is, I doubt anyone will be able to help you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come sometimes my finger smoothly glides over the surface of my phone screen, but sometimes it drags and leaves a streak even if I just washed?",
        "response": "There are several factors that can affect how much resistance you have while moving your finger across your screen. For one, the harder you are pressing your finger down, the more friction there will be between your finger and the screen. You may do this without realizing this. Secondly, different amounts of sweat and grease may be present either on your fingertips or on the phone screen itself. If your hands are warm/sweaty or if it's warm in the air, you may get a more greasy interface between your fingers and the screen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people debate there were no planes in the 9/11 attacks, despite the thousands of witnesses?",
        "response": "\"Projections, man\" \"Paid off by the government\" Thing is, it's easy to come up with any sort of counter argument to something like this and because it's apast event it's generally difficult to prove them 100% wrong even though in the minds of the general populace they are obviously incorrect. Simply because people are free to form their own opinions on such an event, silly arguments like these arise simply because it's difficult to completely disprove a conspiracy theory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "did Native Americans pass disease to European settlers?",
        "response": "It is widely believed that Columbus and members of his crew brought Syphilis back from the new world. Obviously it's not as deadly as Smallpox but if left untreated (and they obviously didn't have antibiotics back then) it can blind and cripple its victims and eventually kill them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "looking for a few sources for ugandan cultures other then wikipedia.",
        "response": "look at the askhistorians book list. There are a collection of UNESCO histories of africa which are free and downloadable. While they are about a decade out of date they are still pretty good (not an expert but others here have confirmed it and i skimmed a couple of them a year ago). Not exactly sure what you are looking for though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do airlocks actually work? Where does the precious oxygen go? When the ISS pressurizes and depressurizes an airlock, is the air sucked back into the ISS or is it ejected into space?",
        "response": "A good fraction of the air is pumped back into the rest of the ISS. They do this because air is a precious resource up there (especially nitrogen, which unlike oxygen, cannot be generated from water electrolysis or burning lithium perchlorate). However the pumps cannot lower the pressure in the airlock down to zero, so *some* air is vented into space. It is vented slowly by valves so that no sudden decompression occurs when they open the hatch.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What long term damage does weed have on your body? (Assuming that you smoke 5-6 times per week)",
        "response": "Inhalation of any particulate matter (smoke, dust, air pollution, etc) is bad for your lungs, with potential results such as obstructive lung diseases like COPD.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there different types of food for breakfast, lunch and dinner? What makes the different food types more suitable for each meal? Such as cereal for breakfast, a sandwich for lunch?",
        "response": "Traditionally breakfast was a large, hot, easy to prepare meal with lots of fat and carbs to give the energy you need to get through a day of physical labor. Lunch was a smaller, cold meal eaten during a short break. Supper was a meal eaten at leisure after a full day of work. Dinner was a large, elaborate hot meal that took the place of lunch or supper, depending on when it was eaten. It sometimes marked a special occasion, like having a guest over. Based on these different purposes, different foods were served. Even though the meals no longer serve these purpose in much of the world, the foods have been engrained in our culture.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes Romaine Lettuce susceptible to E. Coli outbreaks?",
        "response": "It's not just romaine, technically anything food can be a carrier for E. Coli if it is contaminated with fecal matter from an infected source. E. Coli grows in the digestive tracts of infected individuals (animals, humans, etc.). In the case of lettuce, it might have been droppings from deer, birds, or even humans processing the lettuce who didn't wash their hands properly (nature does call when you're working out in the field, and there usually aren't sinks to wash your hands). Alternatively, sometimes when the food is processed (washed, etc.) the water source can also be contaminated with E. Coli. In the case of ground beef, because they gather together the meat from different animals, a single animal carrying the bacteria can contaminate an entire batch of beef (thousands of pounds).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Apple's \"Wave\", Whats is this technology?",
        "response": "Don't fall for that please... Microwaving any electronic device will basically fry the circuits and maybe even explode the battery. I preemptively curse the trolls who will inevitably down-vote this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the difference between “sex work” and prostitution?",
        "response": "Not really complex. Sex work means everything, from erotic cosplay, to camming, to making porn. Prostitution is just having sex with clients. It is a kind of sex work, but not the only thing. Although this would be a very weird thing to explain to a five year old lol",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How 3d printing works?",
        "response": "Think of a machine that could automatically make stuff out of a standard piece of LEGO. That would be pretty cool, right? Now shrink those pieces of LEGO even smaller, and eventually you could make really cool stuff that doesn't even look like it was made of LEGO because the pieces are so small. That is what a 3D printer does. 3d printers create objects 1 layer at a time. it does this by either welding metal powder together, or melting plastic, or otherwise leaving bits of stuff that is stuck together in a certain way. It does it layer by layer, and you can easily get any shape or item out of the raw material.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were the ancient techniques of lighting a fire underwater transferred from the days of Spongegar to the residents of Bikini Bottom today?",
        "response": "To put it simply, oral tradition. It's well known that several customs of the time, including the sport of jellyfishing, were passed down due to a combination of a strong local community and the ability to reproduce by budding. It's generally assumed that firemaking techniques were handed down in a similar matter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does the foam from a fountain soda start to disappear when touched by your finger?",
        "response": "Oils on your finger get into the bubbles and destroy surface tension causing them to collapse.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Health Care not cover Dental, Seems like teeth rotting out is bad for your Health?",
        "response": "Because Big Dentistry is always going to be able to give people not quite enough aneasthetic if it's profits are threatened. Or, possibly, because they've traditionally been different industries. Sort of the same reason that optometrists are generally covered under a different plan as well. Not so much that it doesn't make sense to have them all under the banner of health care, but that they aren't thought of in that sense so they tend to left out of initiatives that address them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do polarized sunglasses work?",
        "response": "Polarized sunglasses are made with what amounts to very, very tiny slits in the shading. This allows only light that is made up of either vertical or horizontal waves to pass through, but not both. Usually light reflects off a surface (like water, or snow) with the waves moving horizontally. So with vertical 'slits' in the sunglasses, those horizontal waves can't get through and are blocked, but the direct light in vertical waves can pass through. This reduces glare and helps to keep from being blinded.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does brushing your tongue harm your taste buds?",
        "response": "In actuality it may improve taste perception. _URL_1_ However, it may be different for some tastes vs. others (e.g., NaCl vs. citric). [1](_URL_0_) [2](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans sneeze multiple times in a row instead of just once?",
        "response": "You failed to clear the irritant with the first sneeze.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that you can't see through a person (or everything), despite atoms being 90% empty space?",
        "response": "The distance between the atoms is very small in comparaison with visible wavelength. The light does not have the resolution to differentiate the atoms from the empty space. You don't have rays of light that pass through the empty spaces. At this scale the medium is perceived as uniform with a refractive index and an absorption.  The absorption will be directly responsible of some of the attenuation. The rest of the attenuation is mainly due to scattering.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Earth became a black hole, what would happen if only your finger passed the event horizon?",
        "response": "The tidal forces would rip you apart before you reached it. It's not the strength of the gravity that gets you, it's the gradient, ie the rate at which gravity increases as you get closer, in the end, your fingertip would be pulled so much harder than, say... your legs, so that gradient would tear your body apart.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pixar and other animated movies use massive computers to render the films, which takes many days. My low-quality laptop can render 30 frames PER SECOND, often looking more realistic than these films. How is that possible?",
        "response": "Most of the computer generated movies are children's movies, and so there have been stylistic decisions to make them not look realistic. But if you compare things like model and texture detail, lighting accuracy, etc. in those movies, they're actually much more complex than the 30 fps games you're playing on your computer, even if those games seem more realistic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to gut flora if a person is dying of starvation or dehydration?",
        "response": "Depending on where in the gut you're looking at, it may change. During starvation, your stomach acid may become more concentrated, and stronger - thus a small amount of bacteria in the proximal duodenum (small bowel coming right off the stomach) may be killed. This would be very minimal, since there are glands in the proximal duodenum that release bicarbonate and neutralize the strong stomach acid. Further along, in the distal jejunum and ileum, and the colon let's say, I can imagine the flora there start to die off, since the job of this flora is to help break down various macronutrients (which for them is food), and during starvation, there is no more food reaching that far. Hope that answers your question",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do astronauts not go deaf from the sound of the launch?",
        "response": "The layers upon layers of protection built into the ship to protect them from other hazards also helps reduce the noise. As does all of the gear that they personally wear in case of a hull breach during launch.  We're still not talking \"silenced\" by any means, but it takes the deafening roar of a rocket launch and reduces it to more like \"I attended a Metallica concert in the 80's\".  It's still not as good as \"I didn't get launched into space/attend a Metallica concert\", but it's not a huge deal. Considering that most astronauts only rack up a few missions, your average college kid that spent a summer chasing the Grateful Dead has racked up more hearing loss than Buzz Aldrin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could someone explain to me what a paradox is?",
        "response": "A paradox is something that logically impossible. Look at the following sentence, an example of a paradox. This sentence is false.  If the sentence is truly false, then logically, the sentence must be true. But if the sentence is true, then it is false. This sentence makes no sense, but not due to using words that have no relevance to each other nor due to bad grammar, but rather due to the logic behind the statement.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How hot-wiring a car works. Is it really as easy as in the films?",
        "response": "Hot wriring is basically impossible on all cars made from mid 90s on. Joy riding is done primarily in old shitty cars these days and any car worth stealing will be done by stealing the keys. They tried fingerprint locks for a brief time but mafia/triad folk would just lop off thumbs. LifeProTip: If you own a car worth stealing, leave your keys out of sight but near your front door. Lets face it, the last thing you want is to be woken up by a guy with a bat asking where you keep your keys. Source: My mate's family had 3 mercs stolen in one night. Their neighbours saw it but were too British to call the police because they thought they were getting repossesed and didn't want to cause further embarrassment. The thieves left my mate's Alfa because they couldn't get the fucker started!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does a stuffy nose sometimes switch sides?",
        "response": "You nose contains the same spongy tissue as a penis! It's true! [Here's an article about why the nose does what you're asking about. ](_URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don’t animals get sick from eating raw foods?",
        "response": "They eat it when it's extremely fresh, in many cases, still alive. So, it has a similar risk to high-quality sushi: some but actually rather low. As for parasites, animals get them and just deal with it. Most animals don't really live too long in the wild. Maybe 10 years or so. Lots of carnivores or scavengers have stronger acid in their stomachs than humans so they can eat meat with a higher amount of bacteria in it and the body will just kill it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what point does the L.A. methane gas leak become more potent to the environment than the BP Deepwater Horizon oil spill?",
        "response": "Partial answer: [California participates in the cap & trade system put forward by the province of Québec](_URL_1_) (what a strange world world we live in where these kinds of strategic decisions occur at the state/province level instead of the national one). The price for a ton of CO2 is currently at [$12.79](_URL_0_); however, the gas issuing from LA is methane, so that would have to be converted in CO2 equivalents. The EPA says that a ton of CH4 is equivalent to 22.7 tons of CO2. And the LA methane leak is in the order of 1300 tons per day. Thus: 1300 tons x 22.7 x $12.79 = about $377 432 in carbon rights per day should be the going rate. Furthermore, the leaks have apparently been going for nigh on 2 months, so that would be a ballpark figure of around $22 645 974, without going into the actual intricacies of the system which would bring the total down a bit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the President leverage his inhuman debt to make money?",
        "response": "I'm not really sure what you mean but in general if you borrow money at 5% interest p.a. and use it to invest in something that returns 10% p.a. then obviously you make money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can high frequency (x-rays) and low frequency (radio waves) both travel through materials even though visible light cannot?",
        "response": "One way to understand how this can be possible: visible light can travel through solid materials as well (such as windows).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Computer drives start at C:, and not A:?",
        "response": "Ohh you younglings... The A: drive was the floppy drive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are we able to tell which time is right or exact?",
        "response": "There's an organization called the International Bureau of Weights and Measures based in France that oversees this.  Pretty much they reference a number of highly accurate atomic time keeping methods and set a universal time, which computers from all across the world set themselves to, including you're phone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do rockets (and shuttles in their day) not fall over when they are moving slowly at launch.",
        "response": "The fact that it is rising at all means that it is already countering the effect of gravity, at least in terms of up/down movement. As for falling over sideways, the rocket is designed so that the thrust is right under the center of mass; this, combined with the aerodynamic shape of the rocket, means that it's hard to push it \"off center\". The shuttles were designed so that the two rockets were symmetrical to get the same result.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Deformation of rocks - folds vs volcanoes",
        "response": "Heat is the main component - along with a moderate pressure inrease that pushes materials surrounding the intruded magma into the plastic/ductile regime.  The other is that we are not forming recumbent folds here - we don't need to fold things over on themselves. It is simply a case of pushing stuff apart due to pressure. Much of that surface deformation is indeed brittle. Which is why volcanic edifices are typically pretty unstable; flank collapses and debris flows are not uncommon - the only reason they're not always obvious is that volcanoes grow at such a (geologically) rapid rate that these scars get healed over by new material quite quickly. That bulge on Mt St Helens you linked to is a perfect example - lubrication of the faults under that bulge is exactly what lead to the slope failure and resulting decompression and eruption of the magma chamber.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't ladybirds get stung when they walk on nettles?",
        "response": "Botanist here: the \"stinging\" mechanism for stinging nettles are stiff little hairs on the stems that when broken off into the skin inject a number of chemicals that cause the stinging sensation and the primary reason for these hairs is to reduce herbivory by things like rabbits and deer. Ladybird beetles have a hard exterior exoskeleton (unlike humans with a rigid endoskeleton) that the needle-like hairs can't penetrate, so that's why they don't get stung. Not to mention that the nettles don't need to protect themselves from ladybird beetles because they're predators on other insects, and they don't eat plants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did they take the picture for Nirvanas Nevermind cover?",
        "response": "Interestingly enough, babies [instinctually know how to swim](_URL_0_). Although I'm *sure* there were parents and lifeguards like, RIGHT behind the cameraman ready to save the baby if something went wrong, there probably wasn't a lot of danger.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does momentum affect a flying insect inside of a moving vehicle?",
        "response": "The fly is working against the air currents in the car, which accelerate along with the rest of the car assuming you have the windows closed. If you jam on the gas, luckily the air in the car doesn't all pool at the back. It's similar how we can walk around on the Earth even though it's travelling ~30km/s.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In computers, what's the difference between worms, viruses, Trojan horses, and the like?",
        "response": "* virus - attaches itself to normal programs, and run when those programs are run, doing various bad things, including copying itself to other programs * trojan horse - a program you are tricked into running, that proceeds to to bad things, often sending sensitive information to someone outside the computer, or granting then access * worm - a program that once run, will try to access other computers on your network to run copies of itself",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does folding a piece of paper both ways help to tear a straight line?",
        "response": "Folding paper weakens the bonds at the fold. The outer bonds are stretched more, so folding both ways weakens both sides at the crease. When you tear, the rip follows the path with the weakest structure which is usually the crease.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is lambda calculus, and how does it relate to computation?",
        "response": "Lambda calculus is simply a format that any computer program is mathematically identical to. It's mathematically equivalent to a Turing Machine. What it means is that if something can be written as Lambda calculus, it is computationally possible, and if it can't, then it's not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did we go from Old, to middle, then to modern English?",
        "response": "Old English is Anglo-Saxon. The Angles and Saxons were Germanic tribes that moved to England and took their language with them. Their language was more similar to Germanic languages than Latin. Parts of it still survive today. It sounds NOTHING like English but if you listen carefully you [can hear english words](_URL_0_) Notice that at 1:14?, literally says \"That one good king\" or something really close to that. We can see the German influence in English really easily in [this video](_URL_2_) since they have a common origin. Now in 1066, a french dude named William from the north coast of France conquered England. Since he was french, state affairs were conducted in french. Over time the influence grew more and more so you ended up with Middle English which starts to sound REALLY close to modern english, as you can hear in [this video](_URL_1_) Give it another 700 years of people starting to say and spell things differently, and you get the language you and I speak now!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come when you put ice cream on warm pie, the pie melts the ice cream, but the ice cream doesn’t freeze the pie?",
        "response": "The hot pie is way above freezing temperatures, but the ice cream is only slightly below freezing. Both object's temperatures will tend toward equilibrium, but that average temperature will still be well over freezing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are humans almost irrationally afraid of spiders and big insects. Were our ancestors the same?",
        "response": "A great many people are not afflicted in the manner you describe. Children, and people who have a life style that allows them to avoid 'nature' tend to have this problem.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Pi programmed into calculators?",
        "response": "They don't need to put in the whole number. They just have to put it in to the point where the next digit won't change much at all. After the tenth digit of pi for example not much will change in your calculation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is overclocking in relation to computers? What does it do? How does it work?",
        "response": "CPUs work in cycles, usually expressed as \"2.6 (or some other number) GHz\". What that means is, a CPU can do 2.6 million \"things\" in a second. When someone overclocks their CPU, they increase that number. If we increase our 2.6ghz processer to 3.0ghz, it is now able to do 3 million things a second.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I don't know if this is allowed here but can someone explain how \"Post Nut Clarity\" works? (I am a 19 male so I just mean chemically)",
        "response": "We're biologically programed to procreate, so if they possibility is close at hand, our basic instincts might cloud our judgement. So afterwards, the need to procreate diminishes, and your thoughts clear.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a split brain hold a conversation?",
        "response": "Yes, and you can [see a patient who has undergone a corpus callosotomy having a conversion with Mike Gazzaniga in this video](_URL_0_). The important thing to keep in mind with these videos is that they are done in a lab environment. To be able to observe the deficits you need to control what information goes to what hemisphere. For example, they show a dissociation in preparing a motor plan for an object and naming it. To achieve this, they flash a picture of, say, a telephone to either the left or right hemisphere. This deficit would not be apparent in every-day life as the visual input would naturally reach both hemispheres (two eyes, two hemispheres).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can aluminum foil cooking be toxic?",
        "response": "What exactly do you mean by aluminum foil cooking?  If you mean simply using aluminum foil in cooking, the answer is no, both from a mechanistic basis and a statistical basis. From a mechanistic basis, aluminum foil is pretty much pure aluminum, and any material that would be released would be small amount of aluminum oxides, which aren't harmful. People regularly consume aluminum oxides as antacids (Maalox is aluminum hydroxide, which is a form of aluminum oxide.) If you got a chuck of aluminum metal, it would just pass through you. From an epidemiological standpoint, we use aluminum in cooking a lot, if there was a health hazard from it we would most certainly see it in the public health data.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "You can't copyright chord progressions. Could I release albums of music where I only use chord progressions used by The Beatles and call them my own?",
        "response": "This is like saying \"Could I just take the colors that Salvador Dali used and re-arrange them and sell paintings\" Yeah sure, you could. But a piece of art is more than just how the colors are arranged. If you're a shitty artist, nobody cares what colors you use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come bodybuilders can consume raw eggs no problem, but it is dangerous for me to undercook eggs?",
        "response": "It's not dangerous to undercook eggs. People eat runny eggs all the time. Raw eggs have a small chance of containing salmonella. Unless you're part of an at-risk population (very young, very old, pregnant etc.) then having a salmonella infection will, in most cases, just give you 2-3 days of food poisoning (fever, diarrhea and such).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for a mountain to escape the atmosphere?",
        "response": "In general, yes. On Earth, no. Mountains' height is limited by the strength of gravity, the shear strength (or compressive strength, depending on geometry) of the rock, and the density of the rock. So on Earth, the maximum height for a mountain is roughly 10 - 15 km. If this mountain is already on a high plain, then the actual elevation is the height of the mountain plus the elevation of the plain, but high plains are governed by the same physics. There's also some fuzziness on the maximum height of an atmosphere. On Earth, this is about 100 km, but in reality, the atmosphere is a continuum of particles that decrease in density as you go higher. But it should be obvious that on Earth, the atmosphere is about an order of magnitude higher than the tallest mountains. On a planet with very little atmosphere, it would be possible to build a mountain higher than the atmosphere. The moon, for instance, has virtually no atmosphere, so a mountain there could be considered to be \"above\" the atmosphere.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you wake up in the morning with a sore neck, and it hurts to turn it left or right, what happened during the night? What's actually causing the pain?",
        "response": "Simple acute muscle spasm, basically when you spend prolonged time in one position the muscles in your neck can tighten up and cause significant pain. Nothing at all to worry about, just move your neck around a bit and wait for it to calm down. Source: licensed physical therapist",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does your nose get stuffy when you cry?",
        "response": "There’s a small duct that goes from your eye to your nose. So when you cry , the excess fluid goes through this duct (the nasolacrimal duct) into your nasal passages.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Pre-Computer animation",
        "response": "One picture at a time. They drew lots and lots of pictures and then took a photo of each one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does user count determine the valuation of a startup/website if in cases like Twitter, they presently have no way to generate income?",
        "response": "Because if you have more users, when you eventually start to monetise, you'll make more money. There's a school of thought that says it is bad for a tech start-up to start to monetise - as soon as you do, investors will think \"oh, that's how much I can make\". If you just grow a large userbase, investors will let their imaginations run away with them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were static electricity shocks believe to be during antiquity and the Middle Ages?",
        "response": "Not discouraging further answers, but u/hillsonghoods wrote [this about a year ago](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did the North have the ability to adopt breechloading and repeating firearms on a wide scale during the Civil War?",
        "response": "So this isn't directly focused on your question, but [this older answer of mine](_URL_0_) does touch on it as part of the larger development of breechloading firearms. The key point to your question, as mentioned there, is that shifting production on large enough a scale would have been incredibly disruptive, so while arming on a unit-by-unit basis from a wide variety of small manufacturers was quite possible, an entire overhaul of the Union Army's armament would have been a very different, and near insurmountable. There were other more basic issues, as mentioned by /u/Bodark43 below, but at the end of the day, even if the Army brass had been gung-ho, a full turnover would have been nearly impossible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does North Korea seek to gain in firing a ballistic missile into Japanese airspace?",
        "response": "They seek to provoke the civilized world into negotiating with them. It's a repeating cycle. North Korea runs out of food, does something insane, and then agrees to stop being insane for food aid.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do birds fly suicidally close in front of my car when I'm driving along instead of just flying over it?",
        "response": "1. What seems terrifying to you is normal for a bird. They are evolutionarily adapted to move through the air at high speed and often very close to objects and other birds. Blowing through a tree at 40kph and not touching a single branch ain't no thang to a falcon. 2. Birds are (generally) dumb*. They have tiny, tiny little brains that are mostly dedicated to finding things to eat and not running into trees. They don't know what your car is, and cannot predict its movements, but so long as you maintain a constant speed and heading they can avoid it.  *Corvids and some parrot species are shockingly intelligent in some respects.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are modern humans stronger or more athletic than our pre-agricultural counterparts?",
        "response": "There is an argument using evolutionary theory that agriculture was only adopted to increase group fitness at the cost of indivual fitness. Lots of civilisation diseases started with the adoption of agriculture. So there is the argument that agriculture made civilisation possible but at the cost of pure indivual strength and physical prowess. There is lots of evidence that early agricultural societies had less than healthy members compared to hunter gatherers.  When you think about it, the indivual skills of a warrior in a large army is less important than pure numbers, most armies in the past were farmers called to war once a year, and yet the prevailed most of the time against nomad societies whos way of life made them formidable indivual warriors like the steppe people, just by numbers alone. Edit: If someone is interested where these theories come from, I recommend these books: _URL_0_ _URL_3_  _URL_1_ _URL_2_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the words \"Left\" and \"Right\" come from?",
        "response": "The word \"right\" is thought to come from the Old English \"riht\", which meant straight, good or proper. This comes from the concept that the right hand was the correct hand. [Source](_URL_1_) Conversely, left, it is thought, comes from Old English \"lyft\"meaning weak. [Source](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What processes caused the skin of some humans to become lighter (white) after their migration from Africa?",
        "response": "Current theory is that vitamin D (which depends at least in part on UV from the sun) was produced in lower quantities due to the northern latitudes receiving less sunlight. Consequently, skin lost melanin to allow more UV through. Populations with high fish diets that compensated for this, such as eskimos, retained darker skin color. I've also heard that wheat diets similarly lower vitamin D production, and \"Arabic-ish\" and European diets are heavily wheat focused, more so than, say, diets elsewhere. I don't have sources off the top of my head, however, so take that with a grain of salt.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are planes able to fly vertically.",
        "response": "Most planes can't fly straight vertically for any length of time without stalling (losing their forward momentum and plummeting).  The ones that can have *extremely* powerful engines relative to their size, like in fighter jets, which provide so much thrust on their own that they don't need the lift from their wings to maintain their upward momentum.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many times does Satan appear to someone in the Christian Bible?",
        "response": "You ought to ask this to r/christianity or r/catholicism, since this is a theological question and not historical.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you get bad cramps with diarrhea?",
        "response": "If it's something that your body isn't agreeing with and causing you to vacate your bowels it could be your bodies reaction by clenching your guts to force as much out as possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I run a program from the terminal in linux, I can press Ctrl-C and it quits instantly. In Windows and Mac OSX, why does force-quitting applications not work instantly (and sometimes take a fairly long time)?",
        "response": "This is not a operating system-specific; it's program-specific. In most terminals, ctrl-C sends a signal to the program, rather than input like most keystrokes send. This particular signal is SIGINT (an interrupt signal). If a program is specifically set to handle it, than it can do whatever it wants. Usually, whatever it wants means cleaning up after itself, and then quitting. Otherwise, the OS kills it. What you're probably seeing is a program that is spending noticeable time cleaning up. If you really want a program to quit immediately, SIGKILL and SIGSTOP are signals that can't be caught. There is no way to do this with the keyboard at the terminal the program is running in, which is probably for the best. You would have to do it from another terminal with the `kill` command (in UNIX, at least).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If light has no mass, then why can it be pulled by black holes?",
        "response": "Because Newtonian gravity is just an approximation for massive things moving slowly (relative to the speed of light) in weak gravity. The trajectory of light, in any situation, does not satisfy these conditions. One of the first confirmations of a prediction of General Relativity was the bending of light by the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Mathematically, how do scientists determine what is required for deep sea/space exploration? (i.e. how are calculations made for diving suits/space suits/helmets/etc?",
        "response": "I don't have much information for you, you may want to ask this question over in /r/engineering . The short answer is with lots of experimentation, and lots of trial and error. There's a reason why companies like boeing and lockheed have huge [R & D budgets](_URL_0_).  In addition to that much of that information gained is actually classified and not public knowledge. You can't just look up those formulas in your mechanical engineers manual.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How close, technologically, is the collective governments of the world to being able to create a \"Jager\" from Pacific Rim?",
        "response": "We definitely wouldn't be able to create the \"two pilots one mind\" functionality yet. Neuroscience hasn't progressed that far. Though I don't really understand from the trailer why two pilots would be needed in the first place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do old nasty hookers make money in that industry?",
        "response": "The nicer the hooker looks the more she can charge. I only got $20 and I want a blowjob that sweet looking 18 year old won't do it for that price but meth face Mary is willing to suck and swallow for that price.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the “white noise” you see on old CRT TVs?",
        "response": "Are you speaking about the noise you get when you tune to a nonexistent TV channel? That’s the noise radiated by everything around you. That’s the noise generated inside the TV tuner because it is warmer than absolute zero. All of that noise gets amplified (and the amplifier adds noise as well) and that manifests as the static you see on the TV.  Now days tuners are smart enough to know they’re not locked into a signal and they mute the audio/video streams.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is \"Boo\" the go-to means of expressing discontent in a public setting?",
        "response": "From etymonline:  expression meant to startle, early 15c., boh, \"A combination of consonant and vowel especially fitted to produce a loud and startling sound\" [OED, which compares Latin boare, Greek boaein \"to cry aloud, roar, shout.\"]; as an expression of disapproval, 1801 (n.), 1816 (v.); hence, the verb meaning \"shower someone with boos\" (1893).  Booing was common late 19c. among London theater audiences and at British political events; In Italy, Parma opera-goers were notorious boo-birds, but the custom seems to have been little-known in America till c. 1910.  [source](_URL_0_)  Edit: ELIactually5: It's a loud and surprising sound, and it's similar to what older languages used.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between an IRA and a Roth IRA?",
        "response": "Regular IRA: your contributions are tax-deductible, the income you get from it at retirement is taxed. Roth IRA: opposite. Paying tax on the money now, rather than later, is generally considered the better deal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were \"war elephants\" more useful in demoralizing the enemy than killing/incapacitating them in the classical era?",
        "response": "Followup question: how exactly did Hannibal get the elephants over the Alps, and what kind of casualties were there?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why we think we look worse when a picture of us is flipped ie from a forward facing camera?",
        "response": "I think \"worse\" in this context is just how jarring the differences are. We see ourselves reflected all the time. In mirrors and pictures. Flipping the image is just so different that it looks almost unsettling, hence \"worse.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a BIOS update 'brick' hardware?",
        "response": "The bios contains the basic functions of the motherboard. If it’s not properly loaded then the motherboard won’t be able to boot. If the mobo has dual bios then you can boot the other bios and flash the bad one. Otherwise you need to replace the memory chip on the motherboard that contains the bios with another one that has a good bios loaded, this is generally not user doable. Otherwise buy a new mobo or send it in for repair.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people have more 'energy' than others? In other words, is there a genetic difference between the person able to be active 100 hours a week versus the person who is barely able to work part time?",
        "response": "This is an incredibly complex issue. I can't provide a concise answer which would be meaningful (there are [multiple](_URL_4_) [lengthy](_URL_2_) [reviews](_URL_5_) on the subject of intraspecific variation in voluntary activity), but here are some traits which are correlated to activity levels, or just related ideas: Dopaminergic tone, such as in the dopamine hypothesis of [ADHD](_URL_1_); Age; [Thyroid function](_URL_0_); Circulating [Leptin](_URL_3_); Exercise; Spontaneous physical activity; Non-exercise activity thermogenesis;  This list is not exhaustive. As I said above, it's complicated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I have a question about the history of Computers.",
        "response": "Several things. First the Lisa was released in the early 1980s (30 years later). Also the Lisa was hardly cheap at the time, and IIRC, was one of the reason it never really got popular. So the size difference is simply engineering and better technological advances. One of the biggest was the transistor which was developed in the early 1950s and replaced vacuum tubes which were much bigger. This, unsurprisingly, made computers smaller. If I missed what you were asking please clarify. I'm not sure what you mean by reaction, I'm sure the government wasn't shocked by this, generally things improve and the government was involved in the technological advances.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my phone sometimes say I have bars, yet have no service?",
        "response": "That bar thing on your phone is kinda a lie, by design. The \"real\" reception you have is hidden in the phone and is actually super variable. Obviously if you see your phone going through wild reception variations a consumer would get confused, so we end up with the mostly meaningless bar graph.... The bars are an estimate, based on whatever standard the manufacturer feels like and may not represent anything about reception",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does grapefruit juice \"amplify\" drugs?",
        "response": "A compound in the grapefruit, bergamottin, stops an enzyme from being released. This enzyme breaks down a lot of medications in the blood, so if it isn't being released than the level of the drug could either be higher than the intended dose or be active for longer than it's intended to be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What has come of the Russia/Crimea situation? Is the Crimean peninsula now part of Russia?",
        "response": "It's not over yet. Russia now controls the Crimean Peninsula *de facto*, which means \"in fact\" (as opposed to *de jure*, which means \"in law\"). That basically means that the Russians are there taking over. Russia has also declared the Crimea to be a republic within the Russian Federation, and the city of Sevastopol to be a federal city. That would be the equivalent of, say, US forces occupying Newfoundland and declaring it to be the 51st state. The question is, what about the other countries of the world? So far, apart from Russia, only Afghanistan, Nicaragua, Syria and Venezuela have recognised the legitimacy of Russian rule over Crimea. Belarus is sitting on the fence, saying that Crimea is *de jure* Ukranian but *de facto* Russian. So at the moment, sovereignty of the Crimea is \"disputed\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What in your opinion is the best book regarding the history of the plight of black americans?",
        "response": "I would strongly advocate for [Self-Taught: African American Education in Slavery and Freedom](_URL_1_) by Heather Williams. It's academic but not terribly dense. The last chapter of the book includes all of the anti-literacy laws passed to keep Blacks from getting an education and from white abolitionists from helping them.  I'm also a fan of [They Were Her Property: White Women as Slave Owners in the American South](_URL_0_) by Stephanie Rogers-Jones because her research upends a great deal of what we think is true about people's lived experiences in antebellum America.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Optimal probability strategy for drawing numbers?",
        "response": "There is no difference when to draw. Lets replace numbers with colors and lets say there are 9 white and one blue ball, and you want blue ball. If You draw first, probability to get blue ball is 1/10 If you draw second, probability is 9/10*1/9=1/10 (probability first did not get blue ball times probability to draw blue of 9 remaining) If you draw third, probability is 8/10*1/8=1/10 (probability first and second did not get blue ball (1-1/10-1/10=8/10) times probability to draw blue of 8 remaining) ..... And if you draw last probability is still same: 1/10*10/10 = 1/10",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When something passes the sound barrier, a sonic boom is created. What would happen if, theoretically, someone broke the light barrier?",
        "response": "While nothing can go faster than the speed of light *in a vacuum* (such a speed doesn't really make sense), something can go faster than the speed of light in other things. Light slows down as it passes through things, which is why refraction works (e.g. for lenses). What you see is a sort of \"light boom\" which can be loosely understood to be like a sonic boom but with light. This is called \"Cherenkov Radiation\" and manifests itself as a bluish glow. It is sometimes seen around nuclear reactors. You can read the Wikipedia article and see pictures of this [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does keeping an avocado seed with the raw avocado 'meat' keep it from browning?",
        "response": "[Here's a pretty good write-up of why Avocados turn brown](_URL_0_) In short, it's the exposure to oxygen that makes the flesh turn brown. Keeping the stone (seed) with the meat does not prevent this in any way. Fun fact about avocados: the trees release enzymes preventing ripening of the fruit, once they're picked they lose the enzymes. This allows the fruits to stay \"fresh\" on the tree far longer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we appear taller to horses?",
        "response": "Equestrian here. Horses do not have distorting eyes, everything is seen just as natural proportions. Horses can see 350° around themselves because of their wide set eyes. Horses do not see us as any wider or taller than we actually are. When horses were first domesticated, they were smaller than they typically are today and have gotten taller through selective breeding. But then again, humans were also smaller.  Typical horses hold their head at about a human's eye level. So I think they would see us as equals. Or maybe because most horses are acclimated to humans when they are first born and humans look big to them when they are foals? Good question!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do things like \"bad\" bacteria in the stomach/intestine actually cause us to throw up? How does our body know there are \"bad bacteria\" there, and how does it know to vomit?",
        "response": "Most bacteria don't cause us to vomit. The ones that do, usually produce exotoxins that irritate the lining of the stomach. Interestingly, the bad bacteria that cause vomiting usually have pre\\-formed their exotoxin \\(like by sitting around in old potato salad\\) before you eat them. The toxin then irritates the stomach and signals to the brain \\(area postrema\\) to induce vomiting. In this case, it is usually not necessary to prescribe antibiotics to cure this stomach bug because you're not actually infected; the toxin is just an irritant. When you ingest bad bacteria that multiply inside your gut they usually cause diarrhea instead of vomiting. Again this is caused often by the formation of various toxins, however; there are a few key differences. One, in this case the toxins are lower in the GI tract and so they usually don't cause vomiting. Two, the bad bacteria in these cases have begun to multiply in the gut and are actively producing the toxins. In this situation antibiotics may be warranted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it feel like you can't breathe when you get a gust of wind in the face?",
        "response": "When a fluid moves rapidly, its pressure decreases, thus sucking things into it. You may have observed this when your shower curtain clings to the stream of water from your shower. Similar effect happens here and makes it harder to breathe in air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Physics] Why does a C on guitar sounds different from a C(of same pitch) on piano? How are our ears able to recognize the difference of sound between two different instruments even if they emit the sound of same frequency ?",
        "response": "When a musical instrument plays a particular note, in addition to the fundamental frequency, a large number of [overtones](_URL_1_) are also excited. These other frequencies are resonant with the fundamental frequency which was played, and are responsible for the distinct sound (or [timbre](_URL_0_)) of different musical instruments. So when you hear a piece of music, you're not just hearing the notes you'd see on the sheet music, but a mixture of a huge number of higher modes which depend on the instrumentation of the music.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Alpha and Beta rays can barely get through a sheet of paper, How much mass do you need to block gamma rays?",
        "response": "Typical gamma ray shielding you find lying around in a nuclear physics laboratory is blocks of lead a few inches thick. If you shoot a monochromatic, collimated beam of gamma rays directly at a piece of material, the gamma ray intensity falls off exponentially as a function of distance into the material. The exponential decay constant is called the \"attenuation coefficient\", and it grows rapidly with increasing atomic number. That's why materials like lead are good for gamma ray shielding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do astronomers denote the \"position\" of astronomical bodies?",
        "response": "There's no absolute frame. Positions may be described relative to the Earth, relative to the Sun, relative to the center of the Galaxy, or whatever. Right Ascention (RA) and Declination (Dec) are the normal coordinates used in astronomy, and they use Earth as the center of the coordinate system (because that's where we observe objects from). There's also the system of Galactic latitude and longitude, but even that uses the Solar System as a center.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If water is non-conductive how does is short electronics",
        "response": "*Pure* distilled water is non conductive. Most water however has impurities in it which are what conspire to make it conductive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Byzantine Reaction to the Holy Roman Empire.",
        "response": "Could you elaborate on what you mean by 'Did the position of the Eastern Empire change'? Are you referring to its position towards the Holy Roman Empire, or something else? To answer your question, I found a similar thread on this subreddit from years ago that seems to answer satisfactorily _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the perceived size of the moon actually increase as it moves from the horizon to overhead? Or is it just an optical illusion?",
        "response": "You win the bet. The moon does *seem* larger to the eye near the horizon, but it's an illusion. Images like [this one](_URL_0_) allow a direct comparison of the apparent size of the moon at different points above the horizon and show that it's constant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does static testing of large rocket motors increase Earth's angular velocity, or affect its rotation in any way?",
        "response": "No, but actually launching stuff such that it reaches exit velocity would have an effect. Basically you need matter to leave the earth entirely before it has an effect on angular momentum because if it doesn't then it will eventually return to earth, returning the angular momentum it stole in the first place. A rocket on the earth's surface would be able to change it's angular velocity if it were powerful enough that it's exhaust gases were able to leave the atmosphere at exit velocity. But in this case you'd basically need to be putting a nozzle on a mega-volcano in full erupt mode in order to get that kind of power. Even then, it probably still wouldn't be strong enough.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "With virtually infinite time, could we use selective breeding to bring out crazy traits in animals?",
        "response": "Provided that those traits appeared at some point, yes. We couldn't breed dogs to have horns unless at some point there was a dog who had the mutation to have horns. The same way that we can't breed humans to have gills, gills have to come around on their own, we can breed humans to all have gills once the mutation presents itself, but not until then.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do humans yawn and what's the purpose of it?",
        "response": "Both kind of, when inhaling a rush of air flows along roof of the mouth cooling the skull, and the long inhale increases oxygen coaxing a rush of oxygenated blood.  the purpose is to alert the person to wake them up. After the brain cools and fresh blood is pumped through momentarily the body is in full alert.  That's why when someone yawn's its not just cause they are bored its cause they are trying to pay attention. continous yawning is boredom cause they are repeatedly getting tired, yawning once usually signify's the person is really interested and trying to get their full attention on you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do crows seem to buck their head out when they walk?",
        "response": "Almost all birds have stationary eyes; they cannot move their eyes like humans can to look at something. In order to see anything while walking, instead of just a blur, birds keep their heads stationary and move their body. Then they move their head forward and repeat. It kind of looks like they are bobing their head.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can a person sing with another singer or music but not by themselves?",
        "response": "You don't have to find the note if it's being produced for you. If you start out sounding flat compared to the recording, you adjust. If you're rushing or dragging, the recording will pull you back into correct time. No such luxury when you're singing solo. It's like the difference between drawing from a reference photo and drawing with no reference at all. Try getting out pencil and paper and just drawing a giraffe. It won't look nearly as good as if you had a picture to consult.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If socialized healthcare would benefit all (?) Americans, why are so many people against it?",
        "response": "* Because Americans believe you are responsible for your own life and if you are poor and can't pay medical insurance it is your fault. * Because they think public healthcare means less choice, (which is completely untrue, you will have more choice: public+private) but a lot of people are misinformed. * Because it is a change, and people do not like change.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In beta decay, what causes an up quark to change into a down quark to change a proton into a neutron or vice versa? Why do they do this?",
        "response": "> I understand that the whole thing occurs due to the weak nuclear force to make, the nucleus more stable but what causes the quark to change? Yes. This is the answer to the questions in the title. \"How does a nucleus know\" to beta decay? It's simple: if there is an isobar (isobars are nuclei with the same A) with a lower mass, and the process violates no relevant conservation laws, the decay will happen. For example, [see here](_URL_0_). This is a plot of the masses of A = 104 isobars as a function of Z. It looks roughly parabolic, and the nuclei on each side want to move downwards to the most stable (lowest mass) species in this isobaric chain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do conspiracy theorists care if drones patrol our cities?",
        "response": "Do you care if the police install cameras in your house, your bedroom, your toilet, or your shower? Why? Unless you're committing a crime who cares? The idea is that people like having privacy even if it isn't to commit a crime. I don't think you're a conspiracy theorist if you'd like to have some degree of privacy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a thread in programming?",
        "response": "Imagine every thread being a worker under you, that has an individual timetable. A normal program gives you one worker by default, doing the stuff the source code wants it to. Each thread you open \"hires\" another one, where you can assign work to it, splitting some calculations you need basically at the same time, for better work efficiency (for large projects you might even want to hire and fire multiple workers over the course of the project).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Generators make a lot of noise, and in a vacuum there is no way for sound waves to disperse and therefore no loss of energy due to sound. does this mean generators would run more efficiently in a vacuum?",
        "response": "Nope, because that sound is coming from vibrations in the material which are going to be there whether there's air or not. The energy is already lost at that point. All that'll happen is that it'll turn into heat, which _also_ won't dissipate as well in a vacuum. It'd likely overheat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are those marks on your skin when you take a watch or a pair of socks off?",
        "response": "Your guess pretty well hit the nail on the head. Your body swells throughout the day. If you're seeing marks, then you swelled enough to let the socks/watch \"bite\" into you. Just like if you feel asleep on a hard object with a specific design, the socks/watch left an imprint into you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the difference between sleep and just laying down/resting?",
        "response": "Frankly, nobody knows for sure. It's one of the great unresolved questions in psychology and neurology. Hypotheses for the function of sleeping range from consolidating new memories to cleaning up metabolic waste products accrued in the brain. All we know that deprivation of sleep eventually incapacitates you no matter how much physical rest you get. Or, like some researcher once quipped, the only thing we know for sure is that we sleep because we get sleepy.",
        "source": "sentence-transformers/eli5"
    }
]