[
    {
        "query": "In the 1800s in \"wild west\" America were there neighborhoods that people lived in similar to today? Or were there singular houses spread out randomly?",
        "response": "The West is an enormous place so generalizations are difficult to make. That said, the majority of the region was and continues to be largely urban in its settlement. Since most people in the nineteenth century did not have a horse (contrary to the Hollywood-based stereotype), people had to be able to walk to work, shopping, places of worship, places of leisure, etc. This often resulted in tightly-packed houses. There was often room in the back (for an outhouse and also for a place for chickens or growing vegetables, etc., but the idea of a large yard surrounding a house and setting it away from the road is a fairly late ideal for the West.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Curiosity rover has three spectrometers. What is the need for having three?",
        "response": "There are actually four spectrometers on Curiosity. They are different instruments, and although they likely overlap a bit, they serve different purposes. At it's base, spectrometer simply means \"light analyzer.\"  [APXS](_URL_0_) is a Alpha Particle X-Ray Spectrometer, designed to be put in contact with rocks to measure elemental abundance.  [ChemCam](_URL_1_), Curiosity's laser, is designed to target a small amount of rock from a distance and then analyse the resulting flash of light using a telescope. [SAM](_URL_2_) aka the Sample Analysis at Mars sensor suite is actually three instruments, two of which are spectrometers (the third is a gas chromatograph). One is a mass spectrometer, which vaporizes a sample and determines what elements are present by their mass. The other is a tunable laser spectrometer that is used to determine if a number of isotopic elements are present (with more accuracy than ChemCam, as the SAM is designed to test samples that are aboard Curiosity).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does lemon juice prevent an avocado from turning brown / spoiling?",
        "response": "The browning is caused by enzymes that are released from the cells when they are cut. Enzymes are proteins which are long chains of amino acids which fold in a very particular way. If the 3D structure of the enzyme changes in any way, it's function will decrease or stop. The way the enzyme is folded is in part determined by the pH. Change the pH, such as the addition of lemon juice, the rate of browning decreases.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we know how close we are to the center of the universe?",
        "response": "We are at the center of the observable universe. Beyond that it is thought to be unbounded with no center.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why the waves don't interfere?",
        "response": "For waves to interfere, i.e. cancel each other out or amplify each other, they have to have a very similar frequency, as in \"almost the same\". Imagine a lake. You throw two small stones in it, 5 meters apart. The small concentrical waves around each stone will interfere with those from the other and build a nice pattern on the lake. If you now take a muuuuuch bigger stone and throw it somewhere in the lake, the resulting waves will be much higher and have a much larger wavelength. They will not interfere with the smaller waves in the sense I explained above, but will simply \"carry\" the smaller waves on top. The interference patterns from the two small stones will still exist on the big wave. Since all electronics are highly regulated, everything that emits data has a distinct frequency and often times a mechanism to switch to another one, if there s a similar device around to avoid interference. Was that ELI5 enough? :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have different blood types?",
        "response": "There are evolutionary reasons for different blood types. For example, those with type O blood may be more resistant to malaria, but more susceptible to [Helicobacter pylori](_URL_1_), a bacterium that causes ulcers. There are various other benefits and tradeoffs with other blood types.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we produce anti-matter?",
        "response": "There are some (not many) anti-protons in cosmic rays.  Positrons are sometimes produced by natural radioactivity. We make antimatter by colliding particles together with enough energy that the creation of a particle-antiparticle pair is allowed (conserves energy). In that situation, the pair will occasionally be produced, at a rate that depends on the interaction dynamics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Help with building a solenoid?",
        "response": "The important thing is to use an **insulated** copper wire. Use batteries and low voltage unless you know what you're doing. I'm going to sleep...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Big Bang and the observable universe diameter",
        "response": "It expanded faster than the speed of light. Speed of light (or more correctly of causality) is the speed limit for things traveling through space. Space itself has no such limitation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about the Thugee. Did the assassin cult realy exist, or was it an invention of the British empire's propaganda?",
        "response": "This is a controversial question that doesn't have a simple answer. What answers historians give have a lot to do with their own understandings of colonialism and since answers to those questions rely on still contentious theoretical debates there will be a lot of disagreement. There are a range of views amongst historians. On one extreme of that range is the positions that thugee was mostly an invention stemming from anxieties about an unknowable indigenous underworld, on the other end there are people who uncritically accept all British claims. In between there are many people who are interested in analyzing thugee as a real form of banditry that became distorted in the minds of the British. Personally I find the last option most convincing, but my knowledge isn't deep enough to referee that debate fairly. If you're interested in reading a recent work of scholarship that engages with and navigates these debates while offering its own convincing interpretation I'll recommend [this book](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were guerrilla-styled tactics not widely used until the 1940's?",
        "response": "Guerrilla style warfare was used in the American Revolution. According to [this](_URL_0_) website, guerrilla warfare was used as early as the Roman Empire and the American Revolution was actually the turning point of guerrilla warfare.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Before electricity, how did people get up on time?",
        "response": "[You could start here](_URL_0_).  There's also another article in the FAQ but I can't seem to locate it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Windows Phone so unsuccessful compared to other smartphones?",
        "response": "It came into the market late and is behind in multiple aspects. The app store is catching up but still behind android or ios. There are also some features that aren't available but should be. Give it time, they are gaining ground in the market.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Idea of Silver/Gold/Platinum",
        "response": "Reddit gets money, poster gets a false sense of achievement, and the giver gets to feel good about themselves for spending money",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is being smart genetic?",
        "response": "Yes, although it also has to do with upbringing and proper nutrition while growing up, as well as getting enough sleep etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes pears crunchy and granular?",
        "response": "[Sclerenchyma](_URL_0_) is the type of cell that gives pears their gritty texture.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many people care about the lives of celebrities to the point that celebrity news and gossip has become an industry?",
        "response": "By focusing on the rich and famous it makes them feel like they are included and their lives aren't so empty and meaningless",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have spelling mistakes in ancient or medieval texts ever influenced the subsequent development of that language?",
        "response": "I don't this quite answers your question, but I hope it does.  The development of a language is really a large thing, but I have an example in French which still influences how Francophones write today. I know if you can count it as a mistake per se, but the French word Nénuphar, also written Nénufar, was an adaptation of a word taken from medieval Latin, but initially from the Persian language. The ph letters are attributed normally to Greek inspired words, like Philosophie. The ph Nénuphar stood its ground and still does, even though the major language instances in the French-speaking world nowadays prefer to honor its roots by recommending to write with an f : nénufar. And like many things in French, it complicates the learning of the language. Yet again. Hope it helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is there so much money in the porn industry when porn is easily found for free online?",
        "response": "All those free porn sites are absolutely *lousy* with ads, haven't you noticed?  Ads are paid for by advertisers. They pay an amount based on how many people are watching. Since *lots* of people watch porn on a daily basis, they pay good money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is a SSD so much better than a larger, and cheaper, HDD?",
        "response": "All these answers are wrong...so far.  SSD's are hyper fast because their data retrieval rate is sub 1 millisecond, versus a hard drive which is typically 7ms.  > And is it not just a glorified USB memory stick? No. A typical SSD's (depending on which controller you prefer) read and write speed are near 500mb/s. A hard drive, at it's fastest, is, maybe 80-100mb/s. A high end computer's latency (aka, the thing that slows it down the most) is it's hard drive. Removing an analog hard drive for a digital hard drive dramatically increases it's speed when a hard drive is paged.  So, if you're a gamer, a level that used to load in 30 seconds, now loads in 4. Starting up your computer that used to take 1min, now takes 6 seconds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Russian computer, Setun, a ternary computer, offer advantages such as lower electricity consumption and lower production cost over its binary successor?",
        "response": "Computers can be built using any arbitrary radix. Some early machines were base 10. I can't find much information on Setun, however, nobody would claim the USSR ever had any sort of edge in computing, despite the country's strong reputation for maths. It is possible the limited electronics available in the USSR were more suited to ternary logic, but I cannot see how.  The advantage of binary logic over other radix is that the number of interconnections is significantly reduced. Also, in modern semiconductor computers (i.e. vs. tube) noise margin is important and binary systems have greater noise margin than ternary ones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do packets of dry flour still remain after you submerge flour under water?",
        "response": "Gluten! When flour granules come in contact with water gluten is formed. Gluten is tough and stringy (it is what makes bread so darned chewy and delicious) it is also a pretty good water barrier. The formation of gluten is so fast that when a blob of flour is dropped in water a shell is made around the outside of the blob protecting the insides from getting wet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is structural oppression, how is it different from other kinds of oppression?",
        "response": "Structural oppression is oppression which is built in structures which facilitate how some organization, society or the like works. For example law is one of the structures facilitating how a given society works. So laws limiting voting rights only to men is structural oppression of women. Or for example even though laws would guarantee everyone the same rights, if the people upholding the law (courts, police) systemically make decisions and take actions which oppress some group of people, this can also be considered structural oppression, as police and courts are the ones facilitating how society works, they are manifestation of the structures. Other kind of oppression is something that is done by private people, so for example even though women would have the right to vote, some group of angry men intimidating and preventing women of entering the voting place would be non-structural oppression.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Arabs write numbers like ٠١٢٣٤٥٦٧٨٩ instead of using Arabic numerals like 0123456789?",
        "response": "The numbers we use were orignally developed in india. Before the invention of the positional system (units, tens, hundreds etc requiring a concept of zero as a number) the Brahmi numerals were used in India. When the positional system was created the numerals (known as Gwalior numerals after the location of some of the earliest examples) were based on the earlier symbols (although I struggle to see it myself). You can start to see the modern system in these. The Gwalior script and the idea of positional numbers disseminated through Arabia and as time passed three variants of the symbols came in to being - the Sanskrit variant in India and the western and Eastern Arabic numerals. The western Arabic numerals are the ones that travelled on in to europe and then went through two or three more changes over the centuries until what we would recognise as modern numbers came in to being in the fifteenth century.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why when I press on my skin it leaves a white spot for a couple of seconds?",
        "response": "You have tiny blood vessels near the surface of your skin (capillaries). When you push on your skin you force blood out of them. When you release it takes a fraction of a second for the blood to return.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since our solar system is on the same relative plane, would we be able to leave the solar system faster by travelling \"up\" from that plane as opposed to \"out\" along it?",
        "response": "If you define the *solar system* to be the [heliosphere](_URL_0_), the bubble of space around the sun dominated by its solar wind, then traveling perpendicular to the ecliptic isn't necessarily going to get you out of it any sooner. If you're relying on gravity assist maneuvers for delta-v, you may in fact find it takes a lot longer traveling out-of-plane. Note that the shape of the heliosphere is not precisely known, and is unlikely to be a perfect sphere. That said, its shape is determined primarily by the interstellar medium and the solar system's motion relative to it rather than the ecliptic plane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can my computer be in hybernation mode when not charged? (my battery has died)",
        "response": "Hibernation is different from sleep. In sleep mode, the computer stops processing, but it keeps the system memory (which will clear if it loses power) going with a little bit of electricity. In hibernation mode, the system memory is dumped into some memory which doesn't clear when it loses electricity (like the hard drive) and then when you turn the computer back on it is detected and the system memory is restored. This requires no electricity to maintain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Meditations by Marcus Aurelius survive?",
        "response": "> were preserved by Christian monks They were preserved by the Byzantine state and people as well, and remained in the popular culture of that Empire throughout the Middle Ages. The Byzantine Suda encyclopedia/lexicon from the 10th Century writes in the entry for Marcus Aurelius *\"This man recorded the conduct of his own life in 12 books.\"*, which directly refers to his Meditations. Additionally, a great number of other entries in the Suda provide small quotes from his work. Many other Byzantine sources from other eras of the Empire's history also make reference to the \"philosopher Emperor\" and his book. Some Emperors, such as Constantine VII Porphyrogennitos and Romanos III Argyros even tried to emulate him.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Stumped me and my Dad: When I'm looking at a street light far in the distance on a dark night, why isn't/is my face illuminated, even slightly? Doesn't the light need to reach my eyes for me to perceive it?",
        "response": "Your eyes are receiving the light directly when you look at the light. If it has to reflect off a diffuse surface (such as your face), absorption and further dispersion occurs and very little light from this reaches your pupil. Think of it in terms of areas collecting light. Let's say your pupil is 5mm across. The same amount of light will hit your pupil as will hit a 5mm spot on your Dad's face. Most of the light that hits your pupil enters your eye. The identical amount of light that hits that 5mm spot on your Dad's face, however, reflects off in all directions so your pupil collects only a tiny, tiny fraction of the light hitting that spot.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is regional Australia (before you reach the outback) so fertile, yet so sparsely populated?",
        "response": "1) What makes you think regional Australia is fertile? Even much of the Eastern Seaboard is not that fertile. Soil in Australia is well-known for having much less organic content than those in other continents. Only tiny parts of the country, like Hunter Valley and the area around Brisbane, have rich soil. Source: [1](_URL_1_) [2](_URL_0_) 2) Modern civilisation took hold in Australia very late. It pretty much means the country has still not had enough time to reach high population density. 3) In terms of land use, the land that can be developed has been developed for the primary industry already. 4) Even if you go only 100 km inland, the summer will be scorching hot and dry. There is also a feedback loop of people not wanting to live in a place where you need to travel hours to get to the nearest Coles, which in turn keeps the inland areas from developing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Germany taking so many refuges?",
        "response": "As is the case in most \"Western\" states, our population is shrinking, yes. But we're not planning on keeping them here, really. So mostly we just feel obligated to help refugees in general, as humans, as one the richest nations, also at least in part because our older generations, those people that are in power, still suffer from a guilty conscience. We've always taken a lot of migrants, so it's nothing new in principle, only in quantity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that when you look at a clock the first second appears to take forever to tick, but after that it proceeds normally?",
        "response": "[VSauce did a great episode on this!](_URL_1_) 3:08 in length.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does my phone\\any electrical device know the charge level on the battery.",
        "response": "The phone can detect how much voltage it's power cells are putting out... as you use up the charge voltage will drop gradually. It can show you a good guess (percentage) on how much juice you have left by comparing what it's seeing from the battery vs the limits that have been set by the manufacturer.  There's a minimum, nominal, and max voltage based on how the cells are designed/built.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our bodies are 37*C, why does water at that temperature feel warm?",
        "response": "One important detail - 37°C is the CORE (i.e. inside your body) temperature. Your hands (which you most likely use to touch the water) are cooler, significantly so in some people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does someone overdose from drugs? What is the process that the body goes through?",
        "response": "Drugs mostly target specific binding sites (receptors) on neurons and block a specific chemical from binding to said site. If too much drug is introduced at once or within a certain time frame, this blocking can cause issues. For most heroin overdoses, the respiratory system is affected and the person stops breathing which eventually kills the brain due to lack of oxygen.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference (if any) between looking at the solar eclipse and just looking at the sun?",
        "response": "I don't believe it's an issue of solar eclipses being extra damaging, but rather an issue of people wanting to look at it. The sun is very bright normally, and burns our eyes when we look at it. This prevents us from looking at it. Whereas during a solar eclipse, our eyes don't burn, and we're able to view the strange phenomenon, unknowingly damaging our eyes in the process. I'm not sure what the light difference is, but hopefully I explained why so many people use goggles and what not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are obvious MLM's/pyramid schemes (like herbalife, huns,... ) not illegal in the USA?",
        "response": "The main reason is that they are not pyramid schemes. A pyramid scheme is a scheme where early investors are paid not out of profits from the investment, but from the initiation fees or investments of later members. There is no underlying business model (or, at least, not one capable of sustaining the business) in these schemes - they only exist because new members come in. In contrast, businesses like Herbalife _do_ sell product and most of their revenue does come from product sales. Now, you can make _more_ money if you recruit additional people to sell, but your profits still come from actual sales of product (be those from yourself or from your recruits). Maybe they _should_ be illegal because the recruitment is a bit deceptive, but they don't operate like pyramid schemes so they shouldn't be illegal just be cause such schemes are.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the people and governments in China, Japan, etc, react when they learned of the New World to the East of them?",
        "response": "In the 17th century Japan was only vaguely aware in the context of \"here is another place that is being completely overrun by Christianity\". Whether that played a role in the closure is uncertain. They did continue to update their maps of the world with the assistance of the Dutch, and were apparently aware of the existence of the United States by the time Perry arrived.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does putting alcohol on a cut sting?",
        "response": "It lowers the temperature threshold for certain skin receptors by as much as ten degrees. These receptors are responsible for tellin your brain when your skin is getting too hot. The alcohol activates those sensors ten degrees below usual so it feels like you’re burning although your skin and the alcohol may both be quite cool.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Marine biologists use submarines with bright lights to film deep sea creatures, many of which have very large, sensitive eyes. Are the retinas of these animals damaged by these lights, and do they try to avoid the subs?",
        "response": "Marine Biologist here, to answer your question the most truthful answer is \"we dont know\". Thats due to a lack of research, species specific responses and difficulty of accessing the deep sea. But that's not very fun or elaborate. [An interesting report here](_URL_0_) covers most of the bases. It seems in most species, bright light exposure temporarily removes the ability to respond to light stimuli. After some time to re-acclimate, the fish respond normally again. That would obviously vary with species, intensity and exposure time etc.  The only true permanent damage stems from UV exposure which wouldnt be emitted by ROV sub white lights.  EDIT: Reworded to avoid taser like vocabulary",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does milk \"smell\" ?",
        "response": "It is hard to know for certain and hard ot answer your question without smelling what you smell. Smell is basically small particles of whatever it is you are smelling, entering your oral and nasal cavity (Taste plays a role in smell - meaning when you smell a fart you are kinda tasting it too..). These small particles then, enter into [olfactory bulb](_URL_0_), stimulate your neurons through the olfactory nerve. These then send signals to your brain which you interpret as a smell. The reason you may get a bigger whiff out of the milk jug is because you have a higher, purer concentration of whatever chemicals in the milk you are actually smelling. Whereas in your cereal, that smell is diluted by the sugary, wheaty smell of cornflakes. SOURCE: Dental education, numerous anatomy and physiology classes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why we like eating very salty things.",
        "response": "Salt is relatively rare in nature on land. A early human ancestor who was to eat say... A order of fries might get enough salt to survive for a month, making it a high value item.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are some good history books written by non-historians?",
        "response": "I think there's an argument to be made that writing a persuasive, well-written and interesting history book makes you an historian, whether you're academically trained in history or not. For the sake of argument, however, if we called 'non-historians' all those who didn't have a history degree, then journalists have often made good attempts at writing history. They can use their investigative and analytic skills that have been utilised and honed in modern media to create works of history that are also made highly readable because of the author's journalistic background. Probably the best example of this would be Simon Winchester, a journalist who studied geology at university. He has delved into a variety of historical topics, from the history of the Oxford English Dictionary in *The Professor and the Madman*, to natural disaster history in *Krakatoa*, to early American history in *The Men Who United the States*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Switzerland able to remain neutral during WW1 and WW2",
        "response": "It's not worth it. The country is in the middle of the Alps and thus highly defensible--you can just bomb a few mountain passes and the country becomes completely cut off from the rest of the world.  And even if you make it in, the entire citizenry are armed and trained, so the fighting would be bloody. Also, the country has very little industry and natural resources, so you are not going to gain much from the occupation. The Nazi plan concerning Switzerland was to beseige them after they conquered Europe and basically starve them out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do e.g. yellow and red make orange",
        "response": "Yellow pigment absorbs mostly blue light, reflecting red and green light. This appears yellow to us, since yellow light itself is between red and green and thus stimulates both color receptors in our eyes a little bit (we can only truly detect red, green, or blue light). Red pigment absorbs mostly blue and green light. When you mix red and yellow pigments, you get something that absorbs lots of blue light, some green light, and no red light. And lots of red and a little green together is what we see when we see orange light (since it is closer to red than it is to green). So that is what we see!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm told that if you delete data from a computer, it isn't *actually* gone, and is recoverable - so if the freed up memory can be used for new data, how is it possible given storage capacity limits?",
        "response": "Imagine it like a whiteboard. You write information on it, and anything you want to keep you write next to it 'do not delete'. When you finally dont need this data anymore you just remove the 'do not delete' message. This doesnt mean the information you wrote on the board is gone, it just means that when you need to write something new you can wipe it and write the new thing over it. When people say it is recoverable what happens is they put the 'do not delete' message back and the computer can read it again. To ensure that data is really gone there are programmes that write junk messages over the data several times so that even if you put the 'do not delete' message back, the original contents arent there, or are badly over written.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does scotch tape make translucent glass transparent?",
        "response": "The glass itself is actually clear - it's just been frosted. By sandblasting or acid etching, they put tiny pits and scratches in the glass. This scatters light, giving it the translucent appearance. When you put tape on it, the adhesive fills in the little pits and scratches. This leaves a smooth surface for light to exit the glass without scattering, making it transparent.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What chemical makes kiwi's tangy?",
        "response": "I'm going to guess citric acid. 1-100mg serving size of kiwi fruit has 990mg citric acid, compared to 16mg in an apple. Kiwi: _URL_0_ Apple: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I hear lots of stories of life-threatening tumors disappearing between MRI or CAT scans. How does this happen?",
        "response": "This (spontaneous tumor regression/remission) does happen. As everyone has pointed out, it is really difficult to determine what cases are legit and which have just made their way into attention. This kind of thing is rare (dependent on tumor type as well), so there are a lot of reports and speculation about causes, but it is very difficult to conclusively figure out what is going on. I'm afraid the answer is disappointing. The best hypothesis that has the most support and scientific interest, and may or may not explain all the cases, is stimulation of the immune system against the cancer. Essentially some event (like a viral infection) that turns the immune system on against the cancer to destroy it (this explains widespread elimination in rapid time). Normally the immune system can't recognize cancer, but immunological stimulation by cancer and for cancer treatment is a well studied field.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When are people allowed to write something off as a business expense? How is it done?",
        "response": "The tax code allows business owners to avoid paying taxes on income that was spent on business expenses. If my business needs a new fax machine, then I can spend 200 dollars on a fax machine and then on my taxes I just explain that I spent 200 dollars on a fax machine and therefore I won't have to pay taxes on that 200 dollars even though I technically made that 200 dollars in income and would normally be subject to taxation on it. Businesses cost a lot of money to run and operate, and so the government feels like its fair to give people a break when they spend money on something that they need to keep their business afloat, and therefore were unable to spend that income money on themselves like most peoples income usually would be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it legal to film children naked, around naked people, etc. by big known companies like HBO? (I'm talking about the scene where the boy is sucking on lady Aryn's tits)",
        "response": "Those were probably prosthetic boobs.  Although there is a lot of leeway in the law for artistic depictions. So if you take a picture of some naked kids at the beach as part of a photography exhibition you're probably fine. If you took the same picture and posted it to r/jailbait you'd be legally fucked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do sites like cdkeys sell games for so cheap?",
        "response": "The theory is that they buy keys from other countries where the games are cheap. The reality is generally that they buy from suppliers no questioned asked where the keys are coming from and mostly they are coming from eastern european credit card laundering stuff.  They are generally legal for you to use, but against the terms of service of the games and also probably hurt more people than just pirating a game would have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In comments there is a link basically showing every country has debt. Shouldn't some of the debt cancel out? How does having a national debt actually work?",
        "response": "I've read only 10% of USA's debt is coming from China. Most of the federal debt is to private organizations, mostly banks and investment firms, inside the country.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Been reading \"The Wealth of Nations\" and I'm not sure I totally understand this excerpt.",
        "response": "The reason we trust a butcher, brewer, or baker to make our meals isn't because they are good people necessarily, but because we know it is in their interest to to do a good job because then they make more money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do films look so strange and unnatural when displayed on monitors with extremely high refresh rates?",
        "response": "Motion smoothing. The Empire Strikes Back was not filmed at such a high frame rate, but modern TVs can use interpolation techniques to \"reconstruct\" intermediate frames. [Here](_URL_0_) you can read about the effect and how to disable it on most TVs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does a brand new computer go form lightning fast processing to the eventual slow and sluggish processing?",
        "response": "This is a little too complicated to answer easily. . . Buuuut. . .  What causes the slowness isn't actually anything related to it's processor. It is related to a different bottleneck, and that's your storage. A hard disk drive has always been compared to a file cabinet. Imagine that you are the OS, and you're getting all of the files you need from this cabinet to start working. At first, it's pretty easy because all the files are nice and organized and all in one place. After a while though, a file may end up having multiple parts in different places in your filing cabinet. Doesn't slow you down too much because it's just one file that's strewn about. Eventually nearly half of the files you need are strewn about and you have to dig through the entire filing cabinet each time just to find a single file.  That's a process called disk fragmentation. Happens less and less these days though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What caused Pangea to separate and why did the landmasses separate in those directions?",
        "response": "The answer to both questions is Plate Tectonics. Earth's surface is made up of a series of giant 'plates' of material that slowly movee around the planet. They do this because right below the continents is a layer of rock that is very hot (due to the pressure caused by the continental plates), and not rigid like surface rocks, allowing for very slow movement of the plates resting on top. Over time, these plates drift around the world, periodically merging and breaking apart. Pangaea was only one of many such supercontinents. There were others before that looked very different. _URL_0_ These are the plates that make up our world. the shape of the continents and how they used to look and how they split apart is just a natural result of all of them constantly, slowly moving against each other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do scat porn \"performers\" do what they do without throwing up on the spot or getting ill in the longer term?",
        "response": "Fake pooooooo. No seriously. I read on reddit before that it's usually chocolate or something, and not actual shit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are toilets separated by gender yet disabled toilets are gender neutral?",
        "response": "For the most part disabled lavatories are single occupant, so it makes little difference whether they're gender-separated. Conventional male and female toilets are facilities where several people can use them at the same time, with the gents loos having urinals out in the open.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If passwords for websites are suppose to be encrypted or only known to the user, how come some websites can tell me I have entered a password I changed years ago?",
        "response": "They don't know the password, but they do know when you have set it. You tell them the password when you set it, but they don't remember the password, only its \"checksum\", or \"salted hash\", and forget the original password. which can be calculated from the original password and data that don't change during the lifetime of the account.  They don't have to know your password to check against it - they can just compute the checksum. They don't have to know the password to tell you when you have set it - they only need the timestamp for that. This is just an ELI5 explanation, as crypto is extremely complex, counterintuitive and hard to understand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Solid State Memory work with no moving parts?",
        "response": "Essentially, Solid State memory functions by creating \"cells\" that can be written on to, and require no energy to maintain. To be more specific, like with the interior of a CPU, we encase super-tiny mechanisms called Floating Gate (FGMOS) transistors into divots in sheets of ultra-thin colorless sapphire (like what we use for high end watch faces). These tiny transistors can store very specific electrical charges for exceedingly long periods of time, as they are insulated with highly electrically resistant materials. We essentially cram millions of these onto tiny chips, then stack several of these onto a single device. It's worth noting that as transistor sizes get smaller, SSD density rises. This is why a [1 TB USB 3.0 flash drive](_URL_0_) is possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Book recommendations on post-WWII reconstruction in Europe (West and East)?",
        "response": "Possibly \"After the Reich: The Brutal History of the Allied Occupation\" or \"Savage Continent: Europe in the Aftermath of World War II\" \"Postwar\" is an excellent book.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain sports betting like I'm five",
        "response": "I can't in all good conscience teach a five-year-old to gamble.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why when we get something small in our eye does blinking in quick succession stop the discomfort? Where does the foreign body go?",
        "response": "The debris adheres to the eyelid and is then carried to the corner of your eye near your tear ducts so that tears can wash it away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is eight-hour sleep a modern phenomenon? Did people of the past really use to sleep in two separate sessions each night?",
        "response": "[Here](_URL_0_) is an archived post that has a lot of discussion about sleep cycles of the past. No scientific consensus, but an accepted theory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would be the effect on the earth if all our energy was from solar power?",
        "response": "When sunlight hits the earth, some reflects back into space -- this is why you can see the earth from the moon. Replacing light objects with dark objects -- such as putting black solar panels in the desert -- will in fact decrease this reflection. Thus the earth will be slightly warmer. However, the amount of area needed is not huge, so the change will be tolerable, much less than the warming effect of burning fossil fuels.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How accurate are calorie counts on nutrition labels or at restaurants?",
        "response": "In the U.S., the FDA regulates the labels. Serving sizes are often smaller than what people typically eat in one sitting, which is something the new labels are changing. You can easily Google this, but I believe calories can be off by as much as 20% legally. Also, if there is less than 0.5 g of something like saturated fat, the label can show 0 g.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much (and what type of) weaponry did the US supply to Nazi Germany?",
        "response": "Why do you believe that the Nazi Germany war machine was at least partially based on weaponry supplied from the US ? As far as I am aware all the main weapons used in WW2 by the germans (ships, airplanes, tanks, guns, small arms) where designed and built by germans in Germany. This equipment was battle tested in the spanish civil war. The main exceptions were the designs and factories that were acquired in Czechoslovakia after the annexion in 38/39, before the start of WW2. The Skoda plants did produce quit a lot of the tanks used by Germany.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does spicy food feel like it cleans out our sinuous'?",
        "response": "\"Spicy\" is interpreted by your body as \"mildly irritating.\" So your body produces tears and mucus to coat your vulnerable parts (inside you nose and in your eyes) and flush out the irritating stuff.  When your body makes more mucus, your nose runs (out, or down your throat) and you might feel your sinuses clear out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do dams quickly collapse when the water level exceeds the height of the dam, rather than the water simply overflowing?",
        "response": "For concrete dams, it's because the water erodes the river bed beneath the dam, or erodes the walls to which the dam is attached. Spillways on concrete dams are designed to move the water away from the base of the dam to avoid this. Earthen dams have a different issue, but it includes erosion as a component. The video provided by /u/lockd0wn shows that seepage of water penetrating the earthen dam can turn it into mud, greatly reducing its strength and causing it to slump. Once slumped, the water pouring over the top quickly erodes a channel with releases more of the water, creating a higher velocity stream, which increases erosion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were African slaves in the American South selectively bred for desired traits?",
        "response": "Take a look at these two threads: _URL_0_ _URL_1_ However, answers are welcome in this thread as well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far along is hair loss research?",
        "response": "There was a r/science post about reversing the effects of hair loss on a genetic level as an accidental side effect of genetic \"triggers\" a few days ago. IIRC it should be available in. 2 years. Can't find link because i'm on my phone",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Southern United States lag behind in industrialization before the Civil War?",
        "response": "It's pretty well borne out when you look at the 'excel spreadsheet' of the Civil War; the only cannon foundry in the South was in Richmond, and New York alone surpassed the industrial production of the entire Confederacy. The North had more rail, more telegraph lines, three or four times the free population, and far more industrial capacity than the South. The basic version of why is just a matter of economics; the best rate of returns for southerners was buying slaves and the means to support them; industrialization has serious overhead costs, and slave labor is super lucrative. Besides, there needed to be raw material for factories to process, and the dominant industry of the antebellum period was in large part textiles. The mills needed cotton, and the plantation owners were all too happy to provide.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the camera add 10 pounds?",
        "response": "The camera doesn't add 10 pounds, our eyes subtract 10 pounds. We're just shocked when the camera is more honest than what we're telling ourselves in the mirror.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Historical basis for wicca/paganism?",
        "response": "Wicca is what happens when you let lay people come too close to historical sources. In the early 20th century, certain people started reading old medieval texts on devil worshipping and other justifications for burning people, and considered it an accurate description of contemporary practices. They were, by and large, complete fabrications of the medieval world, however. There were no real medieval witches, and beyond some women messing about with herbs in lieu of real medicine, there was no such thing remotely like Wicca before the 20th century. Most of the folk customs considered to be pre-Christian in their origin, like Maypole dancing, are too Medieval in their origin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why haven't we domesticated foxes?",
        "response": "There was an experiment years ago done in Russia I believe where a man started selectively breeding foxes to be tame and over 10-20 years selectively chose to breed only foxes that exhibited less fear of humans. The result? Their tails got more curly, their ears drooped instead of standing up like normal foxes. They were also considerably more frail and only lived about half the life span of their wilder counterparts. Some animals absolutely cannot be domesticated or it fails to be the same animal I believe. When you breed out centuries of necessary fear and aggression, you change the very makeup and the biological processes that these animals need to survive.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why in music, \"A B C D E F G\" is \"La Si Do Re Mi Fa Sol\" instead of \"Do Re Mi Fa Sol La Si\"?",
        "response": "No, because the C major scale is the only one with no sharps or flats. If you want an A major scale, you would have to use La Ti De Re Mi Fo Sa La  Most schools don't even teach that way anymore, they teach \"movable do\", where \"do\" is whatever note you decide to start the scale on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes those wavy lines that come off the road on a really hot day?",
        "response": "Density fluctuations in the air caused by the heat rising off the road in the near-infrared spectrum, causing light refraction... which also causes that \"mirage\", \"wet road\" or \"mirror\" effect we sometimes see.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between partial (∂y/∂x) and full derivatives (dy/dx)?",
        "response": "\"f(x,y)\" implies that x and y are independent variables. so y would not be a function of x. Otherwise you might write f(x,y(x)). In that case you could not vary x without varying y, so the partial derivative doesn't work. As others have said, partial derivatives are directional derivatives. The \"full derivative\" of a multivariable function is the gradient, which will give you a vector or matrix describing the change in the function that depends on every independent variable. A partial derivative with respect to x is when you take the dot product of the gradient and the unit vector in the x direction. This is also why you don't ever divide by it on its own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do tow truck operators tow parked cars?",
        "response": "Auto tech here, I can easily put almost any car into neutral from outside the vehicle via the shift linkage, which is usually just a press fit connection. Also if the parking brake only engages the rear wheels, so if the vehicle is RWD the the tow truck can just lift the vehicle from the rear and the front will free spin. Additionally if the vehicle is FWD the tow truck will tow the vehicle from the front axle as the rear will free spin. Furthermore tow companies make use of all sorts of dollies that can move a vehicle any way the operator wishes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In America, why are most street signs green while others are blue?",
        "response": "It depends on the type of sign, and, in some cases, the specific sign. [Here](_URL_0_) is an overview of the different colors, while [here](_URL_1_) has specific signs that make for good examples. Specifically, green is \"used as background color for guide and information signs, and for legend on permissive regulation and parking signs\" and blue is \"used as background color for traveler services information signs, emergency evacuation route signs, and as part of interstate and some state route markers\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do firefighters know when fires are started by cigarette butts?",
        "response": "Generally, certain areas will have been on fire longer than others. Sometimes that's indicated by the spread of the fire over time, other times that's indicated by which areas are burnt more than others. If they can figure out roughly where the fire started, they can start looking at objects near there that plausibly could have started a fire. Maybe there are chemical traces, maybe there are burnt remnants of something.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "New Zealand is much more temperate than the rest of Polynesia. How did the pre-contact Māori grow crops?",
        "response": "The key difference between agriculture in NZ and the rest of Polynesian was the absence of both coconuts and taro, staple crops in Polynesia, which do not grow in the colder NZ climate.  Instead, Maori cultivated kumera (sweet potato) and yams, both of which they bought to NZ with them, in much larger quantities than they were grown in the rest of the Pacific. Kumera and yams can both survive and grow well in the NZs climate. They also cultivated the (native) cabbage tree, which is good source of both sugar and carbohydrates.  Along with these crops, Maori ate fish and birds, and the roots of (native) fern trees.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "are there documentaries about hitler's rise to power?",
        "response": "To my non-historian's eyes, the BBC series: [The Nazis: a warning from history](_URL_0_) is pretty decent. The first two episodes covers their rise to power.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was the last time a warship was boarded and captured?",
        "response": "On January 23rd, 1968 The North Koreans boarded and captured the Us Navy ship Pueblo. However, this was classified as a Banner Class Scientific Research Vessel at the time. To get the crew back, the US had to admit the Pueblo was a Signals Intelligence gathering ship. There is a questionable doubt if the Pueblo fits your criteria for being a warship.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did women first begin to remove hair off their body (legs/armpits/genitals)?",
        "response": "You may be interested in the “[When did women start to shave their legs/armpits?](_URL_0_)” section of the Popular Questions pages, found in the sidebar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have we ever whitnessed an impact of a non artificial object on the moon?",
        "response": "Yes, an impact was observed during the last eclipse _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't a fan heat the air in a room? Isn't heat just excited molecules, so more motion is more heat?",
        "response": "It does, but the heat generated by the fan (most coming from operating the motor) is quite small compared to the size of most rooms. However, since the only heat that really matters is the heat of the air adjacent to your body (or whatever else you're trying to cool), the circulation really does help keep you cool, even if the room is getting very slightly warmer in general.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it easier to parallel park in reverse rather that forward especially since it’s easier to see in front of you?",
        "response": "It's because of the way the wheels are set up. \"Most\" (almost all) cars have front wheels that turn, which means that your turning radius when going in reverse is different than when going forward. Additionally, the direction of turn is swapped making alignment easier when backing in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why people often forget what was their task when moving from one room to another?",
        "response": "It’s referred to as “location amnesia”. Oh wait, have to run back inside for something important (wallet, phone, keys etc.) After that thought, your brain is now processing movement into the other room. Also, as soon as you enter another room, the brain is flooded with the new sensory information of that room. All the moving and sensory info gets uploaded into the area of the brain where that task was being stored. It’s like opening up an app on your phone and then immediately calling someone. Your brain is focused on getting to the new location and processing what it’s seeing in the new location to remember that thing you were looking for.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the first nation state?",
        "response": "The general consensus among scholars of international relations^1 is that the [Peace of Westphalia](_URL_0_) in 1648 established the system of sovereign nation states as we understand the term today. If one accepts this as the beginning of \"nation states\" as we now use the term, then the answer to your question is that there is no \"first\" state, but rather that many of the countries of Europe, [including many that we still recognize today](_URL_1_), all become legal national entities together at once. I can't comment with any expertise on non-Western regional histories in that period, but in Europe this marked the transition point from an era of competing kingdoms and empires to an era of distinct nation states that recognized each others' legitimacy as legal entities. --------------------- [1] Lecture, Peter Katzenstein",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do we consume the Virus and Bacteria that our immune system kills?",
        "response": "The body is reasonably effective at recycling, so wherever possible the amino acids will be recovered from these pathogens by digestion in lysosomes or through the activity of shredders (proteasomes) . Carbohydrates and fats are presumably oxidised, utilised or broken down for components for other processes. Your body doesnt really worry too much about the source of these things. Its basically the same things youre already made of, at level of components. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some erasers leave skid marks across the paper rather than crumble up and fall off?",
        "response": "Erasers aren’t all the same quality, and beyond that can harden and degrade over time. The cheap pencil topper erasers tend to be the worst. Once they’ve hardened a bit, they’re not going to do as good a job, whether that means smearing or just crumbling to bits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How Bill Cosby is not in jail?",
        "response": "Because he has not been convicted of a crime in court. If a crime is not prosecuted within a certain time period, in can't be prosecuted. This is called statute of limitation. His victims are suing him in civil court. Civil courts can asses monetary damage only.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the skin colour of certain parts of a black person, like the palms or the sole often much \"whiter\" compared to the rest of the skin?",
        "response": "The amount of melanin in the palms of your hands can't show through the skin there. It's a different type of skin (different nr. of layers) than the rest of the body (except palms of our feet). That's a trait shared by all humans. Same as why do we have two eyes. That's why you can't get tan palms of your hands, regardless of the colour of the rest of your skin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes something to have a smell?",
        "response": "Molecules from it break off and float around in the air. Your nose picks them up, and your olfactory center \"reads\" them. Yes this means exactly what you think it means, when you smell poo.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly IS radiation?",
        "response": "When you ask about radiation, you're probably asking about what's known as \"ionizing radiation\". This is the kind of radiation that's very harmful to life.  There are three basic types of ionizing radiation, alpha, beta, and gamma. In very simple terms, alpha and beta rays are just pieces of atoms spewing out. When an atom splits, sometimes pieces go flying at very high speeds. Picture it sort of as a grenade exploding: little bits of grenade fly everywhere. Gamma rays, on the other hand, are like very powerful X-rays, or very bright light. Atoms can also emit these when energy is released from within them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can i prove that the earth is round?",
        "response": "Go to a port and watch ships sailing out to sea (especially when something really tall like a carrier or an oil platform is being towed out). Bring your binoculars. If you watch carefully you will observe that the bottoms of the ships disappear below the horizon before the tops.  If the earth were flat, you would expect to see the ships just keep getting smaller and smaller, but never appearing to dip below the horizon like they do. (You could theoretically do this on land, too, but then someone could argue it was an accident of local topography - that the land just happened to drop away slightly in all directions from where you picked to stand.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are lazers/lazer guns possible in real life like they are in fallout or starwars for example?",
        "response": "No, lasers would be invisible (probably) and not make any noise. They would be a continuous stream and most likely be used as anti aircraft weaponry before being used as standard troop weaponry",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Mathematics] Are there vector spaces where no discrete set of vectors form a basis?",
        "response": "I think what you mean to ask is \"does every vector space have a *[Schauder basis](_URL_0_)*?\". In the context of Hilbert space theory, having a Schauder basis is equivalent to separability, and since the Hilbert spaces used in QM (to my understanding) are always separable they always have Schauder bases. (Nonseparable Hilbert spaces do exist though).  > A question I've had since learning QM is wether there exist vector spaces V where the dimension is 'larger than Aleph_0' Strictly speaking the dimension of a vector space refers to the cardinality of (one of) its [Hamel bases](_URL_1_) (which, by the axiom of choice, always exist but can't always be constructed). The familiar L^(2)(ℝ) for example has uncountable dimension even though it has a Schauder basis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the number 2,147,483,647 the maximum number for many stats and gold cap for many video games?",
        "response": "_URL_0_  > The number 2,147,483,647 (or hexadecimal7FFF,FFFF16) is the maximum positive value for a 32-bit signed binary integer incomputing. It is therefore the maximum value for variables declared as integers (e.g., as int) in many programming languages, and the maximum possible score, money, etc. for many video games.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does paper stop glass from breaking when shipped?",
        "response": "Mostly just that it keeps the glass from whacking into other glass things it’s packed near. The wrinkled paper wrapped around it would provide a little cushioning, too.  Normally when packing a big box, making sure that everything is immobilized in the box will do the trick.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the universe is expanding in all directions, does that mean that the universe is shaped like a sphere?",
        "response": "Here's a 2D example. Take a semi-inflated balloon. Glue a bunch of pennies on the surface of the balloon. The 2D surface of the balloon is an analog to our universe. If someone starts blowing up the balloon even more, each of the pennies is moving away from each other, and the surface area of the balloon is expanding. From our 3D perspective, we can see the shape of the balloon. But if your entire universe is the 2D surface of the balloon, it doesn't really have a shape. It just is. And somehow, it's expanding.  You can take the same principles, and add another dimension to be our universe. The planets and stars and galaxies are all of the pennies glued to the surface of the balloon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you put icecubes in a high power blender for x amount of time, but kept it at a temperature below zero, would it eventually break down into water?",
        "response": "No, but you could form it into an extremely fine powder. At some point the agitation of the blender isn't going to be enough to split the tiny crystals, or the cooling isn't going to be enough to prevent the energy input from heating them enough to bind together again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Nazi Germany so fixated on Heavily armoured tanks rather than improving their anti-tank shells and technology to combat the Soviet KV tanks?",
        "response": "Germany did make some inroads into advanced anti-tank guns, most notably with their squeeze-bore anti tank guns like the [Pak 41](_URL_0_). These gave excellent penetration but they needed tungsten-carbide shot to be effective. Tungsten-Carbide is also needed for machine tools to make weapons. As Germany had limited supplies of Tungsten Carbide she had to decide between throwing this scarce material at enemy tanks or using it to make machine tools. Machine tools were quite rightly decided to be the best use and the squeeze bore guns were withdrawn from service.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Politicians raise millions of dollars during their campaigns even for just the nomination. What is this money spent on and why is it so expensive?",
        "response": "I know a little bit about this, because my husband ran for office. Most of the money we raised went to advertising - campaign signs are expensive, mailings and postage are expensive (a single 5x7 glossy mailed to 10k people, cost about $9K dollars when you factor in design, printing and mailing). Some (very small) amounts went to a fundraiser we had (we paid for food, which we cooked and served ourselves). When the election was over, we gave small checks to two of the people who'd done a ton of work for us, and gave the rest to another local candidate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why so many of the refugees are men",
        "response": "Because you can claim refugee status for your whole family.  One family member (usually the man/father/husband) makes the journey, and if their refugee status is granted, the rest of the family can join them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does the bond money go after bailing someone out and why do you only need to pay 10%?",
        "response": "The bondsman pays the bond to the court and once you've made all of your court appearances he gets it back. He charges you the 10% for you borrowing the money until your trial is finished. Bail isn't a \"fee\" that you never get back, it's just a cash guarantee that you aren't going to run away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a theoretical limit to how much science can ever possibly tell us about the universe, and a boundary to which technology could not advance any further within those laws of science?",
        "response": "If there are things which are not ever conceivable with mind, yes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is taking a shot of 100 proof alcohol the same as taking 1.25 shots of 80 proof?",
        "response": "Essentially yes. Except for the additional water in the 80 proof alcohol. But there is just as much alcohol in both shots so it will have the same effect on your blood alcohol content.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know whether a sound is coming from in front or behind us?",
        "response": "Your brain uses not only the volume difference but the time difference to localize a sound source. In terms of distinguishing whether something is in front of or behind you, where the volume and time will be equal for both ears, your brain actually analyzes the changes in frequency that occur to the sound based on the path that the sound takes to get to your ear drum. Because of the way your ear, ear canal, head, and shoulders are shaped, each path introduces different frequency artifacts that your brain can detect and use to localize the source. from Principles of Neuroscience 5th edition: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what the deal is with Hugo Chavez?",
        "response": "I know this is not an actual answer but if you are interested you should check out a documentary called \"South of the border\", its not really good but the first minutes about venezuela are spot on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Ouija boards work?",
        "response": "You need at minimum one troll and one sucka.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to imagine a modified space to get pi = 3?",
        "response": "The answer to your questions, yes, it is possible to change the ratio of circumference to diameter by warping space. But no, pi would still be pi because pi can be defined independently of the spacetime you consider it on.  The question is not new, here's just a few answers to it _URL_0_ _URL_1_ _URL_2_ _URL_3_ _URL_5_ _URL_4_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In math, is the order of operations arbitrary? Meaning is there a real reason x and / comes before + and -, or is that just the order we decided and as long as the operations are consistent and that's what really matters?",
        "response": "[Order of operations](_URL_1_) is just a convention used to resolve ambiguities that arise with the use of [infix notation](_URL_2_) (i.e., where addition is written \"3 + 4\" with the plus sign between the two quantities being added). Different notations which exclusively use prefix/postfix binary operations do not require any order of operations because they are inherently unambiguous - for example, [reverse Polish notation](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't Google just offer their service for free until Spotify dies?",
        "response": "If a big company pours millions of dollars down the drain in an attempt to drive a competitor out of business, they eventually have to make that money back. As soon as they try to make that money back, the market is again open to competitors. And now the large company is in the hole financially while the new player isn't. It would never work in the long run unless they could somehow prohibit new players from entering the market. Which many companies do in the form of regulatory capture - that actually works much better than trying to outspend the competition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the physics behind this hand-cranked electric train?",
        "response": "You have a hand cranked DC generator powering the tracks and a train with a DC motor in it. Turn the crank one way and the train goes along the track. Turn the crank the other way, you get the opposite polarity and the train comes back.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it when you bend a plastic item it turns a whitish color?",
        "response": "The white color is the result of [crazing](_URL_1_), the formation of tiny cracks/voids in the material as you bend it past the limit it can survive without damage. The crack surfaces scatter light in all directions, which is what makes them that opaque white.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I \"lose my voice\" what is actually happening?",
        "response": "So you have these things called vocal cords, which are basically folds of skin that will vibrate and tighten in special ways when you speak in order to form sounds. After a cold or other viral infection, these folds and the structures around them get all swollen and irritated. This affects the way they move and your voice can sound funny. Sometimes these structures get SO irritated/swollen (or coated with mucous) that they don't move at all, which means you cannot produce sound!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any explanation to why my hands and feet are always freezing cold?",
        "response": "Sounds a little like [Reynaud's phenomenon](_URL_0_) [This site](_URL_1_) offers some other possibilities",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why so many people in Libya were ready to unite to fight against Gaddafi but not against ISIS?",
        "response": "Because they were overthrowing someone who controlled all of Libya so the militias could be the petty kings of their own little fiefdoms afterwards. Now they don't care if some individual fiefdoms fall prey to ISIS, because they only care about their own clan territory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the draw weight of a historical Yumi (Japanese bow)?",
        "response": "You would do far better to search on military forums, as there are no historical records of an actual number to it. There is no direct data that is reliable enough to draw a conclusion, unlike Chinese, Turkish and Middle Eastern, and European bows that still survive or were measured with quantitative draw weights. Not to mention that there are so many variables such as arrowtip, armour, range, penetration of various materials, the ability to wound v. kill, and so on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are specific impulse and thrust in rocket engines, and how does the relationship between the two affect rocket performance?",
        "response": "Specific Impulse (Isp) is a measure of the efficiency of the engine, and thrust is a measure of the power. If you don't have enough thrust, you won't get off the pad. It's mostly important for taking off to orbit. Otherwise, you'd prefer high specific impulse to minimize the amount of propellant you need to carry into orbit, and you don't care so much about thrust because there's nothing wrong with taking a little longer to deliver your impulse, especially if it gets you more efficiency. Note that there's nothing that says an engine has to have either high Isp or high thrust; it could have both, but typically trade-offs are made in the design process.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does one mean when they say \"Time is the fourth dimension\", does it function like the other spatial dimensions?",
        "response": "It means you can specify the coordinates of an event with three spatial coordinates and a time coordinate. 5th Street and Third Avenue on street level at 5 PM is a coordinate in four dimensions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it truly possible to make a computer program that deletes its entire self and any evidence it was there in the first place?",
        "response": "Remember that the executing program is in memory, so it can delete any copy off the disk or whatever it loaded from, then reboot the system, which clears the memory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Is Visual Snow, Why Does It Exist & Does Every Human Have It?",
        "response": "It’s considered as a disease, or at least as a symptom of a disease (Lyme disease, for example), so no, everyone does not have it. It happens when a part of you cerebral cortex goes into overdrive, causing your ocular nerves to misinterpret information. As for what it is, you can picture it as the visual noise on a broken TV.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will I hit a baseball farther if the pitcher initially throws the ball faster?",
        "response": "Yes, you understand correctly. It's easier to hit a home run if the pitcher throws a fastball. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were Ancient and Classical Egyptian relationships to cats?",
        "response": "/u/cleopatra_philopater cleared up some of the misconceptions concerning the \"worship\" of cats in the answer to [Cats held a special place in Egyptian society. What were the views of other Mediterranean cultures on this practice?](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens after a black hole is formed? Does it just grow and never go away? What will it be in the long run?",
        "response": "Currently black holes that form only grow. They emit Hawking radiation, however - very weak but still present. In the very distant future, when there is not much left that can fall in, Hawking radiation will win and the black holes slowly lose their energy (and therefore their mass) until they evaporate. It is unclear if they will go away completely or if there will be some sort of remnant left.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Why are increased suicidal thoughts a mentioned side effect of antidepressants?",
        "response": "They affect hormones. Hormonal changes can sometimes swing you off balance and complicate the symptoms you already have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you get hungry after a night of drinking?",
        "response": "Several reasons. One is that alcohol reduces inhibitions (of all types) so we’re more likely to binge eat food we like without thinking, especially in social situations where everyone is enjoying food. The second is that alcohol specifically affects the hypothalamus and other parts of the brains and triggers a hunger response. The third is that most alcohol is quickly metabolised and can boost blood glucose level, and then absorbed, leading to a drop in blood sugar and triggering hunger. Same as when you eat simple carbs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people from Manchester called Mancunians?",
        "response": "Manchester's original Latin place name was either *Mamucium* or *Mancunium*, depending on the source and time. Over many centuries, this ended up becoming the name *Manchester* that's used today. *Mancunian* is simply derived from the older place name. A side note, but it's not uncommon in the UK for demonyms to be derived from an older root: * Liverpool: Liverpudlian. * Manchester: Mancunian. * Newcastle: Novocastrian.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do lobbyists actually lobby congress?",
        "response": "This podcast by the Planet Money team at NPR explains a lot about this: _URL_0_ They visit some of the events and talk about how it works.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How we can determine that a species is extinct. How can we be sure that there are none left on Earth?",
        "response": "Species thought to have been extinct have actually been found not to be extinct. It's not unheard of. You can't absolutely prove they are gone, but it's compelling evidence if they appear to be entirely absent for a prolonged period of searching.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how someone can \"lose\" their memory, but still remember how to talk/walk.",
        "response": "Because there are different types of memory that are 'stored' differently. The two most important types here are Episodic Memory and Semantic Memory. Episodic memory is recalling specific events or experiences. For example, if I asked you what you had for breakfast this morning, that would come under Episodic memory because you're recalling a specific event. The other is Semantic or Procedural Memory, which is remembering facts, concepts or skills. So, for example, you know what the word 'notebook' means, but you don't remember exactly when you learned that word, or remember when you learned what a notebook was. So, when people lose their memory, they may lose a portion of their Episodic memory, but they still retain their Semantic and Procedural memory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do wall street firms (like the one Mitt Romney ran) make money acquiring businesses and shutting down the entire operation?",
        "response": "Think of it like a car. Maybe you have a car that's only worth $1,000USD. You sell the engine for $500USD sell the transmission for $300USD sell the wheels for $50USD each, you've already made back your money and now anything else you sell is money in your pocket.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does game testing work?",
        "response": "They hire a shitload of testers to play through the same areas, actions, scenarios, etc over and over again. A lot of people think \"Video Game Tester\" means you get to play all the new cool games first. In reality it means you get assigned to jump at a tree 500 times to see if you glitch into the model, or start a conversation with the same NPC 100 times wearing every hat in the game to see if hats cause a bug.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that even when I'm close to my router, i never have wifi speeds close to what I'm paying for on my internet plan?",
        "response": "A common point of confusion for people when talking about internet speeds is that they are usually quoted in \"bits\" while the computer measures in \"bytes\". A bit is a single unit of binary information which is either a zero or a one. A byte is a standard functional unit of information composed of eight bits. As a result the speed the computer will display will be 1/8th of that which your internet provider would be advertising. Obviously the provider prefers to advertise the bigger number and the only way you can tell the difference is by checking the units.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I touch my forehead skin with my fingers, which touch feel will be received faster into my brain?",
        "response": "The sensory information from your forehead will reach your brain faster, however, you will perceive both sensations as occurring at the same time. The reason why signals from your face reach your brain faster is because they have much less distance to travel. Somatic (touch) information enters the brain through one of the cranial nerves, while information from your fingers travels up your arm, into the spinal chord, and then up to the brain.  Because information processing takes time, your conscious perception of touch is slightly delayed. Your brain is able to recognize that even though the information from different areas arrived at different times, they still represent the same event and thus will be interpreted as happening at the same time.  Sensation and perception are not the same thing, and I think this question illustrates that point well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't jurors allowed to talk about a court case, yet the media can publish details about a court case in the newspaper?",
        "response": "IIUC, the fear is not so much that you spill details on the case, but that you are influenced by people from outside the courtroom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Who was Unidan, what happened to him, and why should I care?",
        "response": "Unidan is a doctoral candidate who was ridiculously active on reddit. Wherever there was a biology/ecology question, that guy would get called in and answer. Because of this and personality he was/is very well liked here, to the point where he has a [Museum of Reddit entry](_URL_0_). You should care because he was a good guy and I can't think of anything he bad he could do to be banned. I don't know what happened to him, I'd like to know more too.   Edit: I messed up, upon a google search he isn't a professor, he's a doctoral student who teaches classes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when somebody puts you on the spot and your mind \"blanks\" for a second",
        "response": "You're stuck between a physical and mental reaction.  It's spastic that a sub designed to explain things to five year olds makes you write loads of words before it will let you post but that's beurocracy for you. So yeah, ignore all of this, the answer is in the first 8 words up there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[political sciences] When addressing a controversial issue, like legalization of drugs, why can't lawmakers make a trial-law, trying out how it will work out for some time, and then deciding wether to let it stay or not?",
        "response": "We do have a fairly good method for enacting laws on a temporary or trial basis, and it's called a [sunset provision](_URL_1_). A sunset provision is basically an expiration date for a law or regulation that will cause the law or regulation to cease being in effect if the law or regulation is not reauthorized. Often, however, a law or regulation will sunset not because it was demed a failure but due to changes in the policitcal climate of the legislative body. A good example of this concept in action is the [Federal Assault Weapons Ban](_URL_0_), which sunsetted in 2004.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do municipal water towers freeze during the Winter?",
        "response": "No, they're filled at night and drained during the day. The turnover alone should be enough to keep them liquid since the water is always moving. In areas with extremely low temperatures they may be equipped with insulation or even heaters/agitators to ward off extensive freezing. Frozen water expands with incredible force, and this will destroy all the equipment if the tower is allowed to freeze significantly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come our brain can create auditory and visual hallucinations from schizophrenia for example, but we cannot do it willingly?",
        "response": "We associate only parts of our brain with \"doing things willingly\". For example, we cannot (generally) willingly feel less or more anxiety, hunger, desire, and so on. Similarly, we cannot (generally) willingly experience blackouts, goosebumps, hallucinations, and so on.  In short, we are much more than a concious being, and we exist in/as a body with all kinds of functions that we have (generally) no conscious control over.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What really happens in an addicts mind when they decide to give something up to continue using?",
        "response": "I gave up music to continue using percosets. Sold my turntables, drum machines, speakers, laptop, etc for money to buy few enough 30s to hold in one hand. I'm off now for over 3 years, but I never did get enough cash to sink into getting new stuff. I'm thinking back now trying to remember what was going through my head to justify it all and I honestly don't remember thinking anything. I think once you accept that you're not the only one at the cockpit of your actions, it's easy to dodge the fault and avoid holding yourself responsible. And also once you acknowledge that your control over your life has been compromised, what's greater than that? You've already lost the thing you're 'giving up'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does Earth have the most varied elemental composition in the solar system?",
        "response": "Well, if you just mean total number of elements, we win. Every known natural element can be found on earth, and we have synthesized some, so we have more than any other planet could ever have.  Now most of these synthesized ones have a half life of less than one second, so we don't have them now, but we have made them before.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does cooling the body (ie cold shower, standing in a cooler) burn calories as the body re-heats itself?",
        "response": "Yep. It's called adaptive thermogenesis. And if you stay cool long enough your body may start making more brown fat, which warms the body and burns more calories than white fat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can mountains disrupt the paths of hurricanes?",
        "response": "Yes, you would be correct. Land essentially suffocates hurricanes. Mountains, because they are large, choke the moisture out of the hurricane rather quickly and stop the circulation. Depending on the size of the hurricane and size of the mountain, the hurricane could reform if it were to interact with warm water again. But mountains do a good job of stopping them. There’s a certain range of mountains called hurricane killer or something similar and I can’t remember where they are without having to dig for it. But anyways, to simply answer your question: Yes. Mountains do stop hurricanes Edit: Grammar editing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Does Data Actually Cost the Mobile Operators?",
        "response": "Your phone company is paying for bandwidth not data. It's not about how much they download, it's how much can they download at ONCE. 1gb a second, 500mbit, 5gb etc. But what about things other than the cost of data? Someone has to pay to put those mobile towers everywhere. Someone has to pay to replace those 3g pieces with 4g pieces when you're looking for something faster. The cost of data is there because it covers their operating costs for everyone to use the data across the whole month. The actual data costs very little. But there is a lot going on behind the scenes to get the data to you.  Check out some details from a financial report for your phone provider. Look at how much money they made last year and how many customers they have. It's not a huge profit per head.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are mice/rats usually used in scientific experiments?",
        "response": "Because they closely resemble humans in many ways, like biologically and behaviorally. Plus it's hard to hide ten thousand dead monkeys.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some exercises really have a noticeable effect on my muscles and others just makes my muscles tired?",
        "response": "In the first scenario (curls), you're working your muscle near its maximum ability. This causes small tears in the muscle, and your body rebuilds those tears stronger than they were before as a way to adapt to it (get stronger). In the second scenario (circles), you're not working your muscle as hard as you can: you're just working it so *long* that it's exhausted. It wasn't beyond your muscle's ability. What *does* improve in that scenario is your muscle's endurance. If you did arm circles to absolute exhaustion every day, you'd be able to do it for longer and longer. Your arms may not get stronger, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how peanut butter went from America's most common lunch to something more toxic than anthrax.",
        "response": "I think you are thinking of allergies. Peanut butter is still as awesome as ever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to your vocal cords when you lose your voice?",
        "response": "Yo ho ho! Yer not alone in askin', and kind strangers have explained: 1. [ELI5: How does losing your voice work? ](_URL_9_) 1. [ELI5: What happens when you lose your voice? ](_URL_6_) 1. [ELI5: What happens when you \"lose\" your voice? ](_URL_8_) 1. [ELI5: What happens to our vocal chords when we lose our voice? ](_URL_7_) 1. [ELI5: what happens when you \"lose your voice\"? ](_URL_3_) 1. [ELI5: What's actually happening when you lose your voice? ](_URL_0_) 1. [ELI5:What is happening when you \"lose your voice\"? ](_URL_4_) 1. [ELI5: what exactly happens when you lose your voice? ](_URL_1_) 1. [ELI5 what happens when you're losing your voice. ](_URL_2_) 1. [ELI5 What happens medically when you lose your voice? ](_URL_5_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the Presidential Pardon work, and can the President of the U.S. pardon anyone?",
        "response": "The presidential pardon can pardon anyone of any crime, except ~~his (or theoretically her if a woman was ever elected) own~~ for any impeachment. The pardon is unique in that it cannot be overturned. It has its uses. For example, president ~~Ford~~Carter pardoned the draft dodgers who fled to Canada to avoid the Vietnam war.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"The last man on earth sits alone in a room, there's a knock at the door...\"",
        "response": "If there are no more humans left in the world (i.e. \"the last man\" is LITERALLY the last man) then what is knocking on the door? Something inhuman but intelligent enough to knock. Let your imagination run wild...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are personality disorders so difficult to treat?",
        "response": "Because personality is individual and no no two personalities are exactly the same so it's almost impossible to make a drug for each and every personality type. This implies they can only generalize and make drugs for certain parts of the personality that cater to the bigger part of society with issues such as bi-polar, multiple, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do batteries work?",
        "response": "Electricity, as you may know, is the flow of electrons from one place to another.  So in a battery, you put two different metals in there. One of them has extra electrons that it wants to give, the other one is missing electrons and wants to take them. We call this an electrochemical reaction. Electrons flow from the anode (the negative end) over to the cathode (the positive end.) Eventually the anode stops being able to give up electrons, so either the battery is dead and you have to chuck it, or else you have to apply external current to reverse the flow of electrons (in a rechargeable battery)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how are companies such as Amazon allowed to get away with horrendous work environments in the US",
        "response": "Because the US legislature isn't going to be passing any workers rights laws anytime soon. And the US public hates union with a passion so going that route also won't help.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take an hour to close a $40k auto loan, and 30 days to close an $80k mortgage?",
        "response": "Two big problems are (1) houses are usually sold used, and require inspection, and (2) it's often necessary to check government records to confirm that the \"owner\" is really the owner and free to sell it. Also, the process is set up to support much larger mortgage amounts. $80k is unusually small.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the highest contiguous series of whole numbers you can make with three cubes (each with a single digit on each face), and how do you label each cube?",
        "response": "To get up to 99, you have to have doubles of every number (to make 11, 22, etc.), this is perfectly accomplished with 3 dice, but there's no room to spare (total of 18 sides to count 0-9 twice, with 6/9 combination). Just by swapping the 0 in cube 2 with the 4 in cube 3 (other combinations may work too), you can get to 110. After that, you will need a 4th cube with a third 1 on it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when you break the sound barrier?",
        "response": "Normally (sub-sonic) a plane creates sound waves which travel out in all directions. As you approach the sound barrier, the waves moving ahead of the plane are barely moving faster than the plane, so the compressed air just sort of piles up, causing buffeting and other problems.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From where did the KKK draw the names of its ranks and titles?",
        "response": "Initially, the Klan was founded in Pulaski as a place for local men to drink, socialize, and dress up in silly garb (among other things). Katz points out that the early Klan picked absurd and grand sounding titles as both a point of intimidation and as a tongue-in-cheek joke. Cheops1853 also makes a good point about taking names/rituals from southern fraternity traditions. Source: [Invisible Empire, Katz, 1986](_URL_1_), Also wrote my thesis on hate groups so I could probably scrounge up some others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people go bald in a symmetrical manner?",
        "response": "Assuming you're talking about male pattern baldness - Androgenic alopecia. Current theory is that there is a genetic predisposition for too much of a sex hormone (DHT), DHT binds to androgen receptors in susceptible hair follicles and, activates genes responsible for follicular miniaturization, causing hairs to shrink over time and eventually leave a bald patch. Hair loss is usually symmetrical because although there are different patterns of receptor/DHT distribution, typically one would think the distribution would be symmetrical bilaterally over the head, any other pattern would point to a non-random receptor/hormone distribution. Why symmetrical? I would hazard a guess that it's because the body generally develops bilaterally symmetrically - aside from organ placement.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Italy considered so corrupt, in comparison, to other European countries?",
        "response": "It simply is that corrupt. Organized crime is still a major issue here, you may know about that whole Mafia thing that started there. All areas of government, from parties to legislative panels, are littered with corruption. Business sees this corruption as well. The corruption is such an issue that it affects foreign relations, economic growth, and most advancements of any kind. Here's some data on the subject _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do so many celebrities not wear underwear to important events?",
        "response": "Women don't want the line of their underwear to be visible when they wear a dress that is going to be photographed six hundred times. They want to look perfect, have the media talking about how they \"owned\" the red carpet. Any imperfection means they get less attention. If they are going to be a disaster, they at least want it too be a BIG disaster.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people of antiquity or medieval times explain static electricity?",
        "response": "Not to discourage other answers, but you might be interested in this part of the FAQ: [Ancients' views of static electricity](_URL_0_) Hope that helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do archaeological things like houses, pots etc end up underground?",
        "response": "> Like if I put a load of plates on the grass in my back garden, how would they end up underground in thousands of years? Weeds grow up around them, snaking tendrils of roots and such over them. You would likely see this in a single summer. Weeds die, are replaced by new weeds, until the plates are under a thick cover of decaying plant matter. A nearby river overflows one year and coats the area in several inches of silt. More plants grow and die, rotting into more mulch over the silt. Wind gradually blows in dirt from elsewhere, and is caught in small drifts against the plants. Gradual rains bring material from higher elevations down over the area. Over thousands of years this ends up with the plates well below the current ground level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is current and voltage from a physics perspective? What is actually being measured?",
        "response": "Current is literally the number of electrons (or \"holes\" depending on your sign convention) flowing through a surface per unit time. Its units are [charge]/[time]. The voltage difference between two points is literally the amount of work done per unit of charge to move that charge between the two points. Its units are [energy]/[charge].",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it legal for cops to speak freely about details of your case to the media to influence the public's opinion of you, but when a cop is under suspicion it's almost always \"We Don't Discuss Ongiong Investigations\"?",
        "response": "I've never seen the cops influencing portrayal of the suspect, if anything, the media do it a hundred times worse. Most of the police press conferences I have seen are stuff like. \"We have a suspect in the case of the murder of Jim Joe, we are currently talking with him and his council, though we have no further information at this time\" and they release the name. It's the media that run with it. MSNBC has doctored recording to make people sound racist, FOX will make anyone that's not a white christian seem crazy, and CNN will do the opposite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cities in China still have such high pollution when they have so many bike users?",
        "response": "Most Chinese pollution is particulate based. Mainly from the burning of coal (although dust produced from lots of construction work adds to the effect). Chinese emission regulations are actually stricter than in the US from a design perspective however they seem to be much, much more lenient / not enforced when in operation. In the West however pollution is more chemical based such as NOx and SOx from vehicles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does wireless charging work?",
        "response": "Induction. There's basically a coil with a magnet in it in the charger, and magnet in the device being charged, and electricity can pass across them (I'm not sure how that bit works, I'm not a physicist...) EDIT: It works because the electricity in the charger generates a magnetic field, and the magnetic field generates electricity in the device.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does a movie or a game look better on a 4k display even if the hardware (ps4) does not support 4k? Why or why not? What are noticeable differences in 4k versus standard HD?",
        "response": "4K means that your image is made of more pixels. More pixels = more details. [Check this](_URL_0_). There is no benefict in having a 4k TV if your hardware does not support it: The TV will send the image in HD resolution or below.  I have a 4kTV and the only times that I watch something in 4k is when I open Youtube xD. The TV-Box only supports 1080p. I must say that 1080p is more than enought for Sports, News and some Series. But 4kTV with 3D is something else",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Assuming we had a spaceship that was built in a space station (meaning there is no need for it to ever enter or exit a planet's atmosphere), would there be any need for it to be aerodynamic?",
        "response": "No, for example google a picture of the international space station, it was assembled in space and is not at all aerodynamic",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are most people scared of spiders significantly more than most other insects?",
        "response": "I'm guessing that the number of deadly spiders has something to do with it, along with their creepy movement and large number of legs. Also, spiders aren't insects... > _ > Spiders are arachnids.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a speedometer work?",
        "response": "Speedometers work by linking a flexible cable to the car's transmission. As the engine powers the drive shaft, it spins the cable about it's central axis (can I use axis)? The cable then spins a magnet near the speedometer. The speedometer has a metal needle and a spring that pushes the needle towards 0 mph. As the magnet spins faster, the needle is pulled along with it. The spring prevents the needle from just flying wildly around. The physics behind how the magnet pulls the needle is fairly cool. It involves eddy currents, but it might be too much for ELI5.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Mesoamerican cities have city walls? If not, how were they defended?",
        "response": "To name a few, Dos Pilas, Mayapan, Xochicalco, Monte Alban, La Quemada, Becan, Cehache I would check out the following publications for more information 1951 Mesoamerican Fortifications by Pedro Armillas. Antiquity (25):77-86 1973 Tepexi el Viejo: A Postclassic Fortified Site in the Mixteca-Puebla Region of Mexico by Shirley Gorenstein. Transactions of the American Philosophical Society New Series, Vol. 63, No. 1, pp. 1-75",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "According to the US DoD figures, during WW1 the USA lost 53k KIA and 60k to non-combat deaths - how was this non-combat death rate so high!?",
        "response": "The Spanish Flu began in later 1918 and is responsible for about 1/3rd of all military casualties (or deaths? It's been a while, paging /u/NMW) and killed about 5% of the world population as a whole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How hard was it to learn a new language in pre-modern times?",
        "response": "A Roman who wanted his children to learn Greek, bought a native greek pedagogue on the slave market. Another useful institution was letting one of your children be fostered by an associate or friend in a neighbouring country. Also, many truces included exchange of hostages, normally sons or relatives of the king.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "St. Thomas Aquinas's Argument from Motion",
        "response": "It's the \"first mover\" argument that is still alive today. If things are \"in motion\" and we observe that things that are not in motion must be put in motion by an agent or actor, then if we regress back there must be a something that put the first motion in place. That must be god.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would really happen if you ate one of them little 'do not eat packs' From beef jerky bags?",
        "response": "Generally very little, they usually contain sand in a gel form (it's likely you would feel some dry mouth and potentially a scratchy throat). The printing is there to remind you they're not made of beef jerky.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there evidence of neurons synaptically connecting back to themselves, forming a signal loop?",
        "response": "Neurons don't connect to themselves because of a protein called Dscam that acts during neuronal development. Dscam is a membrane protein that can form a high number of isoforms through alternative splicing and thereby provides an identity to the developing neuron to prevent forming connections to itself. However a neuron can influence firing of itself via connecting to another neuron that connects back to the first neuron. An example would be reciprocal inhibition where both neurons inhibit each other. This mechanism is responsible for generating neuronal oscillations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that the most reactive elements in the periodic table can be stored in oil?",
        "response": "Alkane chains, which is what mineral oil is, are typically very very stable compounds. It is actually hard to get them to react under normal conditions. While sodium is very reactive, it is actually kinda weak compared to the kinds of compounds that can exist. One such compound is actually ionized alkanes.  Those compounds are extremely high on the reactivity list.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are PC games being released with graphics issues to the point that they're not playable, what's happening during development?",
        "response": "- Developer's machines tend to be really high end. They have to be able to run the game **and** a bunch of expensive tools at the same time. - QA's machines are often more reasonable specs, but they also tend to be running in an ideal environment, with all the latest updates and all the drivers up to date. - There's way too many PC setups to check. Many people don't have all the Windows updates, driver updates, different GPU chips, different programs running in the background, different RAM contention. - Added to that: some new updates can break old code in unexpected ways. - Added to that: often problems are known, but the publishers will force the developers to release anyway so that the game can start making money. They figure issues can be fixed with a patch, or something. - It's truly shocking how many game publishers don't actually understand how the game industry works. They are learning, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people light cigarettes and other flammables before matches came out?",
        "response": "Flint and steel \"strikers\" were common from the beginning of the eighteenth century. They resemble a blunted pair scissors, with a treated piece of flint in one end. By pushing the two together quickly, the user created a spark which would light flammable material like tow (linen fiber) in a tinder box. Before the pieces were connected, strikers resembled smoothed brass knuckles and were manually struck against raw flint. Indoors, it would be most common to light a reed from a lamp or lit fire and use it to light a pipe, candle, etc. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the ants take my toenail clippings and what are they doing with them?",
        "response": "Without more information regarding the type of ants that are removing your clippings, it's difficult to say. However, all ants require a diet of sugars and proteins.  Nail clippings will contain (especially depending on your level of cleanliness) skin sheddings, oils, etc.  To my knowledge, no ants eat keratin (the protein that nails are made of). However, it is likely that they are interested in the other biological material that is attached to your clippings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I'm a budding, albeit distinctly amateur, history buff with a thirst for whatever knowledge I can get - my knowledge of the Punic wars and other Roman conflicts are pretty much Wikipedia based. Can anyone recommend me some reputable and widely regarded books on Roman warfare and campaigns?",
        "response": "Specifically on Roman warfare and campaigns? It depends on which campaigns and what period of warfare! :D However, I'll suggest Adrian Goldsworthy's (In general, really. He's a FANTASTIC writer) [*Roman Warfare*](_URL_2_), [*The Complete Roman Army*](_URL_0_), and [*The Roman Army at War*](_URL_1_) for some really great books :) If you're looking for more specific wars or campaigns, feel free to specify!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Fox News considered not credible?",
        "response": "[They knowingly and intentionally lie and mislead incredibly often.](_URL_4_) They are, functionally, the propaganda extension of the Republican party. ^Automoderator-enforced ^length ^requirements ^are ^a ^a ^horrible ^thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If our sun was a blue giant, would our daylight have a bluish tint?",
        "response": "I don't think so, because blue light is easily scattered by molecules inside Earth's atmosphere. This leaves the other 'colours' of light to travel towards an observer on Earth. This is why the sky is blue, but the Sun appears yellow or red during sunset/sunrise.  So I believe that were the Sun a blue giant, the sky might just look a more intense blue rather than the current cerulean shade. But then it depends whether there are enough molecules in the atmosphere to scatter away all the blue light radiated towards Earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does Thomas Malthus believe in regards to population control and what did he think the most effective policy?",
        "response": "I don't remember much from reading him a long time ago. In general, it seemed like he tried to take the human aspect away from population so we can control them size wise (by killing or controlling like one-child-policy) without feeling abs about actually killing people.  I totally agree with Malthus in that we need to control the population. But yeah, that whole killing people thing is such a drag.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"Metallic\" taste?",
        "response": "When you touch iron or copper (and to a lesser extent zinc and some other metals) and then smell or taste metal on your hands, you're sensing a chemical called [1-octen-3-one](_URL_2_). The role of 1-octen-3-one in the taste of metal was only determined recently (2006). Full paper: _URL_1_ This chemical is formed by \"skin lipid peroxide reduction and decomposition by low valence metal ions\". So you're not tasting metal but a chemical formed from human skin oils/sweat in the presence of metal. It's theorised that this smell is related to our ability to smell blood which forms the same chemical in contact with skin. However... Tasting metal is a common symptom which may be caused by colds, dental problems, nutrient deficiencies, problems with medication or a large range of conditions that cause distortions in your sense of taste: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are the b52s physically flying with how airline aircraft can only have so many Cabin pressurizations due to micro-fracturing of the metal before they're retired?",
        "response": "Military aircraft get far less cycles (takeoff-presurisation-landing) than civil airliners that spend most of the time airborne.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does frying food create bubbles?",
        "response": "The oil used in frying is hotter than the boiling point of water. So when food touches it, the water contained in the food quickly boils, creating bubbles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do shows like Wheel of Fortune and Who Wants to be a Millionaire afford to pay people all of that money every day/week?",
        "response": "A lot of the money comes from advertising. Also, they know that most people won't actually win the million dollars, so they don't actually give out $1,000,000 every show obviously. Also, prizes such as cars are also product placements, which earn them money. So it's largely due to the advertisement. On top of that, there aren't all that many expenses other than the prize. Only one host, one set, etc. so there isn't much to change like a normal show which requires actors and sets and stuff like that :) Edit: Added some info",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does my PC know where my monitors are relative to each other?",
        "response": "you did that, and it remembered it while you didn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since Gravity has an observable effect on light, is the light from a star affected by the star's own gravity?",
        "response": "Yes, this is largely manifested through the gravitational redshift of stellar light. For example, the wavelengths spectral lines of certain elements observed in the sun are sliiiightly higher than those observed in the lab on Earth. See for example [here](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Had China and Japan never fought a battle before the Sino-Japanese war of 1894?",
        "response": "There were many wars between Japan and China before the first sino-Japanese war.  /u/Klaus_Von_Ha refers to the invasion of Korea by Toyotomi Hideyoshi, that involved the Ming armies and after the conquest of Korea (in less than two month) most of the regular battles involved Japanese soldiers facing Ming soldiers. Besides, the admited goal of Toyotomi Hideyoshi was to conquer China.  We can also think about the \"Mongol invasions of Japan\", that opposed the Yuan Dynasty led by the mongols, but considered a Chinese dynasty, facing the Kamakura shogunate, in 1274 and 1281.  But even before that, during the Korean Three kingdoms, Japanese armies faced Chinese armies when they both intervened on the Korean peninsula (Japan was allied to Goguryo and Baekce, China was allied with Silla).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If hard liquor like gin, vodka and whiskey are said to have no sugar or carbs, how does it impact your insulin levels and weight? Is the former just incorrect?",
        "response": "Between fermentation & distilation, there should be virtually zero carbs in hard alcohol. The body, however, breaks down alcohol for energy and *that* is what causes problems for diabetics & weight gain. A shot of vodka is roughly 100 calories. If you eat \"normally\" (ie - all you \"need\") and then have a few drinks every night, those calories add up over time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Marihuana banned in the first place?",
        "response": "It was originally banned because one guy was worried that hemp was gonna start to I danger his paper company. So he lobbied a ton of money and got it banned to not risk his bottom line. Later Nixon became president and was super paranoid of his opposition . The vast majority of which where the leftist \"hippies\", blacks, and Mexicans. So he increased the penalty for marijuana as a way to hurt his opposition.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I am interested in Christian Apocrypha. Are there any stark/shocking contradictions between these texts and the Bible that call into question the 'Prince of Peace' perspective on Christ exemplified by the Sermon on the Mount?",
        "response": "The best place for this question is going to be /r/academicbiblical.  [Here is a link](_URL_1_) to their wiki page on the history of the bible, including a section on apocrypha. I would start there and then repose your question in their sub if you didn't find an answer in the FAQ.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Africa so under-developed when compared to the rest of the world?",
        "response": "Africa is a big place, and many countries are significantly developed (eg South Africa in the south, Morocco in the north, and others). The less developed countries are so due to political unrest, agricultural challenges, difficulty establishing infrastructure and a variety of other hurdles. Is there a specific country or region you were thinking of?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the passage of time instant when we are asleep?",
        "response": "It's not. You just usually don't remember the time when you're asleep, because your brain knows that whatever happened was ultimately unimportant and doesn't retain that information. Also, there have been studies about dreams where they wake up people in the middle of dreams and ask them how long they think they've been asleep, and the person almost always gives a time that is pretty close to the time elapsed. Related note: those studies are how we know the \"dreams move faster than reality\" claim is completely false.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do manned rockets re-enter the atmosphere so fast? Why can't we just really slowly come down so as to avoid the heat friction?",
        "response": "Slowing down requires fuel. Fuel is very heavy and taking it up with you is difficult. The more fuel you have, the more fuel you need just to haul the weight of that fuel along with you. It's much easier to slow down by just slamming into the atmosphere and letting the air act as a brake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to skydive on the moon? If so, at what height?",
        "response": "The moon has 1/6th the gravity but no atmosphere. You would just keep accelerating with or without a parachute and then kersplat when you hit the surface.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could liquids other than water form something similar to snow?",
        "response": "Yes. For example Acetone frozen with liquid nitrogen makes a substance physically similar to snow: _URL_0_ A lot of substances can freeze to form substances like snow, you just need to make sure they freeze in tiny droplets so that you get something like snow instead of ice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you have to be over 18 to buy WD-40?",
        "response": "Apparently some genius decided it would be a great idea to inhale the WD40 fumes and get high that way. A bunch of people picked up on it, and so stores set up a policy that only allows adults to purchase these aerosol items. Which is kind of dumb, tbh. As soon as you turn 18 you suddenly stop being stupid? Not bloody likely...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "can anyone give an insight on what is happening inside a computer, from the layer of logic gates up to the OS? Thanks",
        "response": "If you literaly want someone to walk you down from the operation system down to the electronics you need a lot of time. Anyway, i will try to give a very vague explenation: all software today, including OS, are written in so called higher programming languages such as C, C++, Java, Python, whatever. This code is then analyzed by a compiler which translates this high language code into assembler code. Assembler code is something that is understood by the CPU in your computer, however, this assembler code is then translated to binary in order to be handled by transistors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given fixed humidy, temperature, and pressure, is sweat more volatile than just water in air?",
        "response": "Sweat is actually slightly less volatile than pure water. In addition to water, sweat contains trace amounts of salts, sugars and other chemicals. The addition of other compounds to a pure substance raises the boiling point and lowers the volatility.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are human babies so incapable and defenseless?",
        "response": "The birth canal can really only be so wide (jokes notwithstanding). The baby is born while the head can still pass through the birth canal. This leaves us birthing at a less developed stage than most mammals, which means our babies are more helpless. I'd a trade of that allows for a big head relative to the rest of our bodies; the head can continue to grow after birth for a few years.  Even with this extra growth later, babies are born with skull bones still unfused, so the head can continue to grow to hold the brain at its final adult size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't tangential velocity at the tip of an airplane propeller exceed the speed of sound?",
        "response": "There are aircraft that use supersonic propellers. The Russian turboprop bomber, the [Tupolev Tu-95 'bear'](_URL_0_) is one. It is often called the world's noisiest aircraft, and their are stories of the U.S. military tracking them with their undersea sonar buoys.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the psychological mechanism that causes things like songs or food to \"get old\"?",
        "response": "While you wait for the scientists to show up, here is the Wikipedia entry on [The Coolidge Effect](_URL_0_):  > In biology and psychology, the Coolidge effect is a phenomenon—seen in nearly every mammalian species in which it has been tested—whereby males (and to a lesser extent females) exhibit renewed sexual interest if introduced to new receptive sexual partners, even after refusing sex from prior but still available sexual partners.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do paleontologists know where to look for fossils?",
        "response": "They have to know about the rocks they're digging in. First, you want places that are made of sedimentary rock. This is rock that formed from dirt and sand getting stuck together to make rock. If a critter dies in a lake and gets covered by lake mud, it's possible that critter may be preserved as a fossil and found some time later. Besides the type of rock, they also need to know the age of the rock. Geologists have ways of measuring how old rocks are. We know that dinosaurs lived between 230-65 million years ago. If you want to find dinosaur fossils, make sure you're not digging someplace where the rocks are too old, or too young. Another factor is figuring out what the environment was like when the rock was formed. Different types of sedimentary rocks form in different places, like on the bottoms of rivers, lakes or oceans. If you want to find land critters, don't go digging in rocks formed in deep ocean. If you want ocean critters, don't go digging in rocks formed in rivers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do our teeth tend to chatter when we get cold?",
        "response": "When we get cold out muscle “shiver” ( a rapid contraction and relaxation) to help warm us up. When our faces shiver this causes our teeth to chatter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "While reading Genghis Khan: His Life and Legacy (Paul Ratchnevsky) I noticed the author making two casual references to Chinese farmers growing, \"Maize\" in the 13th century. How is that possible?",
        "response": "Your book is [a translation](_URL_0_), yes? To help someone to reference [the German original](_URL_1_), could you provide a chapter/page reference? Just a guess, but \"maize\" makes me wonder if this is a translation error: perhaps a truer translation would have been \"corn\" (UK usage) or \"grain\" (North American usage).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do insects survive the winter?",
        "response": "Winter survival strategy varies wildly between insect species. Some (Monarch butterflies) move south for the winter, even if it takes several generations of insects to actually complete the trip. Some (cicadas) lay eggs and the species survives as an egg or larvae in a protected location. Some (ants) simply withdraw to a secure location and wait it out, re-emerging when the weather starts to turn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why has Russia historically maintained roughly the same borders and not disintegrated into various states?",
        "response": "Russia of 100 years ago was very different territorial than the Russia today. It has lost the Baltics, eastern Poland, White Russia, all of Central Asia and the Caucuses, Ukraine, parts of Mongolia, and so on.  In these cases exactly what you describe happened. The cultural and ethnic sectarianism caused them to fracture. The Russia of today is more ethnically stable (though diverse) save the ever-troublesome Caucuses. A lot of this stability was achieved via mass genocide/population transfers under Stalin, which effectively weakened minorities to the point of being unable to resist Russia in the future or maintain their identity. The Crimean Tatars, Don Cossacks, Ingush, and Koreans are good examples of this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does a computer pick a random number?",
        "response": "A computer itself cannot generate a true random number. How it does generate seemingly random numbers is follow an algorithm that is usually complicated. A random number generator that follows the same algorithm with exact same input will generate the same numbers as before, so usually a number is put in (that number is the seed) that will make a different output. Sometimes the seed is time because that changes constantly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is meant when by electrons being negatively charged, protons positively charged, and neutrons having no charge?",
        "response": "Ben Franklin coined the terms \"positive\" and \"negative,\" with respect to electricity. He realized that there were two types of charges, which behaved opposite of the other one (negative will repel from a negative, but positive will attract). So he chose to name one positive and the other negative.  Incidentally, he didn't know whether charge moved from positive to negative or the other way around. He realized he had a 50% chance of getting the correct answer, guessed, and got the answer wrong. So, while current \"flows\" from positive to negative, the electrons are actually flowing the opposite direction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they film continuous shots of actors being thrown from buildings?",
        "response": "Do you mean [this scene](_URL_0_) where they throw what is obviously a dummy off a bridge? It cuts from the medium shot of them hoisting the actor onto the railing, to the alternate angle of them throwing the 'man' off the bridge, to the reverse shot of them watching him fall, to the long shot of the dummy falling. It was just good editing that made it seem like (in your mind) it was one continuous shot when in fact it was lots of quick cuts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is water healthy for you if there are no nutrients in it?",
        "response": "Because water itself is a nutrient. You need water to live, about 3 liters daily. There's no other substance that you need more by volume than water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a negative connotation towards the use of phage therapy amongst scientists?",
        "response": "Not sure that I buy this premise. There are a lot of scientists that are quite bullish on phages. What you might be seeing is a cautiousness and reticence to launch into phage therapy immediately, without a lot of testing to make sure it works and doesn't have negative consequences.  There is risk aversion at play, both from the nature of the biotechnology (because a treatment with the ability to evolve needs extra scrutiny), and also from the pharmaceutical companies because it's hard to secure intellectual property rights over biological entities.  The [Phagoburn](_URL_0_) clinical trial is something we're watching closely, with great interest and hope.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if you put batteries the wrong way?",
        "response": "Depends how well the device is built. It might not do anything at all or you may release the magic blue smoke. Also the batteries could leak or explode.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did humans find out that sex caused pregnancy?",
        "response": "Most humans used to live in farming settings, with animals. You can see farm animals having sex; they're not subtle. It's a simple matter of observation that the female animals start being pregnant after sex, and that those kept away from males never get pregnant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why sometimes if I haven't had enough sleep and I go to do something or talk to a family member, do I get the feeling like nothing is real?",
        "response": "It sounds a lot like [depersonalisation](_URL_0_).  It's a sensation that can happen when you are tired, anxious or under the influence of drugs. You can feel time dilation (feeling like something has taken a really long time or occurred much faster than you thought) or you can feel like you're in a bit of a dream like state or as if your mind is floating outside of your body and you are acting on auto-pilot.  Sometimes when you \"think\" about feeling weird/ dream-like, you return to reality and when you're not focusing on it you drift away back into your dream like state. It can feel strange. If you don't like it, try focusing on your breathing",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was Machiavelli's \"the Art of War\" considered a failure? What was it about his ideas, strategies, and tactics that didn't work?",
        "response": "I am not sure where you are getting the information that it was considered a failure. While not perfect it was relatively well received at the time and still holds interesting nuggets of information. I would agree that it is not nearly as well known or considered as the more famous document of the same title; however, it is not considered a failure so far as I know.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do dog food makers know if their food tastes good or not?",
        "response": "Actually, there are people that do taste dog food. I've seen an episode of dirty jobs. [Here's a women that does it for a living](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens in our brains when we are very tired, \"exhausted\" or \"burned out\"?",
        "response": "So a need for sleep isn't exactly know. But what is known is that the energy levels in the brain (a molecule called ATP - adenosine tri-phosphate) increases during sleep.  [citation](_URL_0_) So some people think that it has to do with this. ATP also binds to receptors in the brain and its absence may cause sleepiness effects. A brief answer and I can try to expand on any further questions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How comes Companies like Intel and AMD / Nvidia are akways neck and neck? when they have diffrent R & D departments?",
        "response": "The things they research are similar. Basically, there's one obvious path to improve existing technologies so everyone focuses the same thing. Then, when that's done, they figure out the next obvious thing to improve on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all landmass was leveled, how high would the water above it be?",
        "response": "[Wikipedia](_URL_0_) actually has the calculation, taken by dividing the estimated volume of water on Earth (1.332×10^9 km^3) and dividing it by the known surface area of the Earth (5.1×10^8 km^2). This calculation gives an average height of 2.7km for the uniform shell of water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would it be possible for the ISS astronauts to repair the disable Russian Mars probe on a spacewalk?",
        "response": "No, you have to be in exactly the same orbit to do that. Because of the enormous speeds involved, this usually means launching another spacecraft to match the orbit of the one with which you want to rendezvous, and that spacecraft has to have plenty of thrusters for adjusting its orbit. ISS has some orbital adjustment ability, but not that much.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I am pushing against a very massive object, I am converting the energy of my muscles into something else. But in what kind of energy is that?",
        "response": "Yes, just heat. Kind of hard to measure the energy directly though. The expended energy comes from various chemical reactions culminating in ATP powering a myosin protein to pull on an actin fiber. To maintain a certain amount of force, even isometrically, these myosin molecules have to alternate between pulling and relaxing, so ATP continues to be expended. Thermodynamically, you could say all these reactions are net exothermic, but physically what it boils down to is that chemical potential energy changes to [kinetic energy of molecules bouncing and flailing around](_URL_1_), which is what that form of heat is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it, that when I get really tired, everything is so much funnier?",
        "response": "The phenomenon of being more easily amused falls under Emotional Lability which means emotional changeability or instability. You're probably more likely to cry too. In extreme cases, this is a medical condition, see _URL_0_ but in regular life, it's just that the parts of your brain which keep you on an even keel aren't working quite so well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I unfocus my eyes, I can see small particles moving around. ELI5: what are they?",
        "response": "\"Oh, squiggly line in my eye fluid. I see you lurking there on the periphery of my vision. But when I try to look at you, you scurry away. Are you shy, squiggly line? Why only when I ignore you, do you return to the center of my eye? Oh, squiggly line, it's alright, you are forgiven.\" — Stewie Griffin, 2007, \"The Tan Aquatic\", Family Guy. _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens physiologically during exercise that can help us not only prevent osteoporosis, but even cause an increase bone mineral density?",
        "response": "The remodeling of the bones is very responsive to mechanical stress. When you exercise, you place stress on the bones, and they respond by laying down more bone matrix, thus increasing bone density. Astronauts in space are not experiencing the same gravitational pull from the earth that they normally would. Therefore, when they are out in the zero-gravity environment of space, their bones are experiencing much less mechanical stress than they are on earth, and their bones respond by decreasing the amount of new bone matrix they lay down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a Flexible Spending Account, and how can I take advantage of it?",
        "response": "I'm going to assume you're talking about a medical flex spending account (though they often offer childcare ones too) offered to you by the company you're working at. If that's not the case, feel free to ignore me. These are accounts that you can send a certain portion of your money each paycheck into tax free. The trick is that this money can only be spent on certain things (Medical expenses or child care). The basic idea is that you don't pay taxes on money you spend on medical expenses. Flex spending accounts help you do this quickly and easily.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do notes an octave apart sound the same?",
        "response": "I am definitely not an expert in music theory/sound/biology, but I will try to explain it as I understand it. Someone clarify or correct me if I didn't put this correctly. Using C notes as an example, the frequency of each C note doubles each time you go up an octave. This means that wave of C in octave 2 hits the same highs and lows as C in octave 1 (as well as an extra high and low in between). The cochlea in your ear is designed so that as sound waves move through it, each frequency will vibrate the hairs only in particular sections. While C in octave 1 will vibrate the hairs in one section, C in octave 2 will vibrate those same hairs (because it hits the same highs as C in octave 1) as well as hairs in the section that corresponds to the higher frequency of C in octave 2.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Fluorinated vs. Fluoridated?",
        "response": "Fluorination is the addition of a neutral fluorine atom to a molecule.  Fluoridation is the addition of a negatively charged fluoride ion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does tickling make people laugh when they want it to stop?",
        "response": "When we are tickled, it sends a signal to the hypothalamus which tells us to expect a painful sensation. In response, our body makes us laugh to show our submission to someone who may be attacking us. This is just a hypothesis by evolutionary biologist. You can read more here: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does psychological medications (antianxiety, antidepressants, etc) cure patients illnesses?",
        "response": "It's also worth noting that these drugs aren't really \"cures\" in the sense that they don't make your illness stop happening permanently. It's not like a bandaid, where you take it off and the cut is gone. If you stop taking these medications, your serotonin will go right back to its previous low levels, and you'll fall right back into a state of depression.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the seas and oceans salty?",
        "response": "The salt comes from dissolved rock salt, that's why it's there. So perhaps the question is, why aren't lakes and rivers generally salty? The answer is the water cycle. Everything drains into the oceans, where water evaporates and then falls as rain. Salt, however, does not evaporate with water. So the salt collects in the oceans, and other low-lying lakes that don't have external drainage (for example, the dead sea, or the great salt lake).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes Neon colors so distinctive compared to other colors?",
        "response": "They are fluorescent, which means that they emit light using energy absorbed from other light. \"Regular\" colors only reflect light.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it important that refrigerants in HVAC systems go through phase changes?",
        "response": "Because the latent heat of vaporization is typically much larger than the sensible heat capacity of the refrigerant.  For example, for propane (a common industrial refrigerant) the heat Capacity, Cp, of gaseous propane is 0.064 kJ/molK @ -37 c, whereas the latent heat of vaporization for propane is 16.5kJ/mol. So the latent heat is more than 250 times greater than the sensible heat capacity.  If you don’t condense the vapor and then boil it, you would need to circulate over 250 times more refrigerant than if you take advantage of the latent heat. That would result in a much bigger compressor and corresponding condenser.  Gases make crappy refrigerants. A chilling unit that cools a liquid refrigerant but never boils it in the evaporator (ie now a chiller) is a more efficient single phase system than a gas version as liquids have higher heat capacities than gases and pumping liquids is more efficient than compressing gases. Still not as efficient as a true, 2-phase, refrigerator.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What physiological adaptations would best suit fictional humanoids living in an arctic climate?",
        "response": "Two things I'd suggest, an increase in volume relative to surface area, a more carnivorous diet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does smelling something like wasabi or horseradish immediately clear your sinuses?",
        "response": "The things that do that are irritants. Basically, when your body comes in contact with them, it reacts- in the case of eyes and nose, your body tries to flush irritants by producing tears/mucous. Your sinuses are blocked because mucous in them is thickened and staying in place instead of flowing- the natural flushing from the irritants mixes fresh moisture in to the existing blocking mucous, which allows it to flow properly and clear out of your sinuses.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Earth's axis not perpendicular to it's solar orbit? (eg. 22-24 degrees off)",
        "response": "All spinning objects will exhibit [precession](_URL_1_). The Earths axis is tilted, but it's not fixed, it's moving slowly in a circle.  It's worth noting that a planets axis is pretty unstable. The mass is never distributed equally, and it's possible for a planets axis to wobble unchecked and actually flip the whole planet on its side, with the axis nearly parallel with its orbital plane. There's even evidence of planets flipping completely upside down!  [Relevant ISS video](_URL_0_)  Earth has the benefit of having a very large moon, whose gravitational/tidal influence helps to stabilize the Earths spin, keeping it from wobbling wildly out of control.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How exactly does untreated cancer kill you?",
        "response": "A) The tumor grows so large and consumes so much that it physically or chemically chokes out the nearby organs and destroys important tissues. Or B) The cells eventually start breaking off from the main tumor and \"metastasize\" to other locations by traveling through the blood or lymphatic systems. Then they anchor there and start forming more tumors. This can be practically anywhere, including critical locations in the heart, lungs, or brain. Those new tumors then start doing A.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Gravity is described as bending space, but how does that bent space pull stuff into it?",
        "response": "I found [this](_URL_0_) video to really help explain how gravity changes the paths of objects, I think it's particularly effective because he demonstrates it as a bending of space and time, not just space, and is able to do so by reducing it down to only 1 spatial dimension.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes Guns and Roses NOT Glam metal/Hair Metal?",
        "response": "They are. Sort of. Glam metal (every metal sub-genre, really) revolves around a central lyrical theme: in the case of glam, it was partying, girls, drugs, sex, alcohol, motorcycles, riches, coke, love, mischievousness, etc. Guns 'n Roses played to this theme, but inverted it by displaying the grittier underbelly of it all: the \"unglamorous\" side of living for booze, drugs, and women: addiction, violence, insolvency, prostitution, homelessness, murder, love lost, and so on. They took \"glam\" and flipped it on its head. They took a genre known for being flamboyant, polished, colorful, and \"fake\", and showed something dirty, raw, and \"real\". I consider them \"glam\", at least derived from it, but in a way they were \"grunge\" before grunge became a thing. (FWIW, Skid Row did basically the same thing, around the same time. An underrated band, IMO).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could the universe be full of intelligent life but the closest civilization to us is just too far away to see?",
        "response": "Just to clarify, [Occam's Razor](_URL_2_) is the principle that, all things being equal, the simplest explanation is probably the right one. What you might be referring to is the [Fermi Paradox](_URL_2_), which states that although alien life should be statistically abundant in the Universe (given Drake's Equation) the lack of evidence for such life suggests that we will never encounter it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is the temperature of stars and planets determined (Example: Surface temperature of the Sun is 5,778 K)",
        "response": "When matter heats up (starting from 0 K), it steadily emits some of that heat in the form of electromagnetic radiation. We call this “black body radiation”. This is why, for example, iron turns orange when heated by a blacksmith. As things get hotter, the frequency of these EM waves gets higher. So iron that is “white hot” is emitting higher frequency light than iron which is only “red hot” because the white hot iron is much, much hotter. Most of the things around us are cold enough that their black body radiation is lower frequency than visible light. Our bodies are right around 35 C, for example, and our black body radiation is in the infrared. However, the sun is much, much hotter. By measuring the frequency and intensity of the light emitted by the sun, we can solve for how hot the surface must be in order to produce that color. Our sun is mostly yellow, which works out to roughly 5.7 kK. A blue star is vastly, incredibly a lot hotter, while a red star is much, much colder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens if nobody chooses to run for president in the US?",
        "response": "If nobody ran, everyone would just write in a name. The votes would be tallied and passed on to the electoral college, and they would cast their votes for President. Theoretically, whoever had their name written in the most would win.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people intercept data when you're using public wifi?",
        "response": "I would say it's more like they eavesdrop on it than intercept it. Your data is still reaching the router like they weren't there.  The WiFi router and your device just broadcast the data out there in all directions. It's freely out there. Now that said, it is encoded so you need to know how it is encoded. That's why with secure networks you cant access the data.  But when you are on the same WiFi network, all the devices know how to encode it. They all receive all the data from each other, they are all within range. The router and devices just know what data is meant for them by IP addresses. All they have to do is tell their computer to stop ignoring the data with IP addresses indicating it's to/from you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between the titles Great Britain, England and the United Kingdom and is it proper to refer to someone as English or British?",
        "response": "England is, well, England; Great Britain includes England, Scotland and Wales; the United Kingdom includes England, Scotland, Wales and Northern Ireland.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does anybody knows the difference between Bachelor of Art and Bachelor of Science?",
        "response": "There's no generally-agreed-upon difference. Some universities that offer both have slightly different requirements, but many schools offer only one or the other for historical reasons, and as a practical matter, graduate schools and most employers treat them identically. I have a Bachelor of Arts in physics; an acquaintaince of mine has a Bachelor of Science in creative writing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were \"Looney Tunes\" and \"Merrie Melodies\" marketed when they were originally seen in theaters?",
        "response": "Generalised follow-up: most history of animation that I'm aware of is focussed on animator biographies and the medium's technological development. When it *is* discussed as an art form, I feel like it's treated as if it exists in its own bubble. Any good sources discussing its relation to other art media? Big picture discussions on animation, if you will?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a theory that says the universe has a limited 'processing power'?",
        "response": "There is a maximum processing power theoretically possible, yes. It's called Bremermann's limit, and it's about 10^50 bits per second per kilogram of matter. But your second question doesn't really make sense. The concepts of \"at once\", \"simultaneously\", and processing power all assume the existence of time, so time can't exist *because* of them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it hard to read books, but easy to surf the web for hours?",
        "response": "A constant term that pops around about why the internet is so entertaining is “instant feedback” or “instant gratification”, something among those lines. Essentially, browsing the internet and going on Facebook or Twitter gives immediate feedback and reward to small actions like simply clicking on an article or loading up the me_irl subreddit. The internet contains so many things that are rewarded almost instantly from a few movements of the hands. With reading, it takes time to get invested into what makes it engaging. The setting, characters, and story all take time to dive into. Be it a few pages or a few chapters to introduce these things, our brain naturally craves instant feedback and reward, rather than having to wait patiently through long lines of text to have information fed. It’s merely my take on it as someone with ADHD, though I think I tackled it well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the water on Earth come from? How was it originally formed?",
        "response": "I don't believe that the exact answer has been 100% accepted by scientists on where water came from and why it's only on Earth and none of the other planets in the solar system (although we believe Europa to have ice and that Mars and our moon once had water.) However, there are multiple theories. I'll give some examples although there are more and there's a lot more to it than this- Comets colliding with Earth might have brought water to the oceans. Another is biochemically through mineralization and photosynthesis, and gradual leakage of water stored in hydrous minerals of the Earth's rocks. So, I guess...neither of you win? Edit: comets, not meteorites",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If my parents are not contributing at all to my college education, why does their income still get calculated into my Financial Aid package?",
        "response": "Because the financial aid system is based on the premise that your parents are *supposed to* pay at least a part of your college expenses if they can afford it. Whether or not they do is their choice, and shouldn't have a bearing on how much money the government is going to cover.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Reddit obsessed with Bernie Sanders?",
        "response": "Because the demographic that he most directly appeals to (white, middle class males) is also the demographic that Reddit most directly appeals to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are full electron subshells more stable in atoms than those that are only partially full?",
        "response": "The answer to this question depends on what you mean by stability, which typically would be either (a) binding energy per electron or (b) first ionization energy. Or perhaps you have something else in mind.  Chemists tend to focus on (b), but (a) is in some respects more interesting. In particular, the closing of shells in real atoms does not lead to any noticeable discontinuities in the binding energy (experimental data are available for atoms with Z up to 20, but the same idea is supported by theory at higher Z). Also, when comparing the \"stabilities\" of electrons in two atoms, say fluorine and neon, you should not forget that they do not have the same nuclear charge. This alone makes a huge difference to electron binding energies. So when discussing stabilities, it may also be relevant to compare isoelectronic species such as F- and Ne.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all the ice in Antarctica melted, how much would the earth underneath rise, how much of Antarctica would be above sea level, and what effect would that rise have on tectonic plates in the context of the global tectonic system?",
        "response": "As far as I know, nobody agrees on how much isostatic rebound would occur if you melted all the ice in Antarctica. It seems ([according to this book](_URL_1_)) to range from 100's of m to 1 km though the amount of isostatic depression varies with the amount of ice above so places thick ice cover will eventually rise more than those with thin ice cover (all other things being equal).  Of course, if you went and melted all the ice today, you would probably get an initial rise at first but then it would slow down it would still take 10's or even 100's of thousands of years for it to fully rebound. [North America and Europe are still rebounding from the last ice age at the rate of about 1cm/yr and that is projected to last another 10,000 years.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a sociopath?",
        "response": "You know how you see a table and you just see a thing? A thing that you can use, break, change, do anything you want because it's not a real person like you? You don't feel bad for a table, it's just an object! Well sociopaths see other people like you see a table. They do not see other people as being just like them... a feeling we call empathy. They just see other people as objects that move and talk. Because they are like this, sociopaths don't care about anyone other than themselves and they tend to do or say anything they want to get what they want and they never feel bad about it. That's it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did certain animals originally evolve to have morals?",
        "response": "You are thinking in individuals, if a species evolve morals, all units in that species will have them - the reason it keeps getting more defined as that species goes along is that even if a few units take advantage of it is that as a whole it is more beneficial.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to Ebola?",
        "response": "The epidemic died down. Ebola is not a particularly infectious disease, requiring direct contact with the bodily fluids of a victim to transmit. Thus, once proper containment could be done, the amount of infections dropped. The diseases is still slowly continuing in Liberia, but a vaccine has been developped, and so far, appears to be very effective, though trials are ongoing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is buying into a time share considered a huge scam?",
        "response": "It isn't necessarily a huge scam. It does, however, cost a fair bit of money, and it has limited use. If you are able to actually utilize it the way it is advertised, they tend to be pretty awesome. Most people aren't, though, and this is why it is often considered a scam. My girlfriend's parents have a timeshare, and it saves them about $750 a year. They also spend like a month each year on vacation somewhere. Most people don't fall into this category.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Swiss bank accounts so special and commonly used by the rich?",
        "response": "There are a few reasons why banks in Switzerland are so great, but the most important fact is that Swiss law includes a section that is very similar to doctor/patient confidentiality when it comes to banks and their customers. Thus, unless you are being charged with drug trafficking, divorce, tax evasion, or theft, the Swiss bank account does not need to be disclosed to anyone for any reason.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the boats used by American’s on D-Day have a front hatch? Why didn’t they use side/ back hatches and use the front as cover, instead of running head first into machine gun fire?",
        "response": "Doors on the front let you unload into shallower water, ideally straight onto the beach. Remember these guys were carrying a lot of weight, if they got into water over their head they were going to drown, there was no way to swim and many soldiers did drown after going over the sides or leaving boats that couldn't get close enough Unloading from the rear is no good, you don't want people getting into the propeller as that might damage the boat and block a section of the beach If you're landing thousands of soldiers on a beach you're going to have heavy casualties. The best way to reduce them is to end the battle quickly, the best way to do that is getting as many men on the beach as fast as possible. That means quick egress and the safety of the boats are paramount even if it results in higher starting casualties",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Studies show that sleep makes you learn better overall, but how does this relate to time lost sleeping instead of studying?",
        "response": "you have used two different terms here, studying and learning. sleep has been linked to better retention and uptake of understanding (usually when compared to people a little sleep deprived)  however studying in a cram session style is not typical learning. if you study using mnemonics and associated memory chains and key term triggers and whatnot, atypical of a classroom environment... then perhaps sleep may be less of a factor, or even more of a factor as you are using your brain to not only remember facts but also pasterns and stories associated with them. my point being you would need to to a bit of reading and look at the studies to see their controls and decide if they are in a classroom learning environment or an exam study environment.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How good of a carpenter was Jesus?",
        "response": "If Jesus is never explicitly stated as a carpenter, how did this myth come about?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the body have the sudden urge to pee when submerged in water? (Ex: Shower, pool, bath, ocean, etc.)",
        "response": "It's the change in temperature that triggers the reaction. Blood vessels in your extremities constrict, in an effort to protect your vital organs.  The constriction causes a slight increase in blood pressure which the kidneys try to regulate by filtering excess fluid from the blood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why extinction of species is bad",
        "response": "* 1) Philosophical reasons. The eastern puma is beautiful, it deserves to live, it's bad for us to kill things without a good reason. * 2) Practical reasons. We study otherwise useless butterflies to learn something about how they fly. We gather obscure animal and plant chemicals to make medicines. Every time another species goes extinct, we lose out on any possible future uses we might have made of that species. * 3) Environmental reasons. The environment is crazy complicated. Sometimes the loss of one species can cause a \"trophic cascade\" of other effects that add up to a big impact on both the environment and us. It's hard to predict those effects in advance, so it really makes a lot of sense to avoid causing them, whenever possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any species that subsist primarily through cannibalism?",
        "response": "Its hard to provide sources to prove a negative, but I've never come across such a species. From an energy point of view, it would make little sense. Consider this [ecological pyramid](_URL_0_). Each species in the ecosystem needs a larger biomass of whatever it eats/gets it energy from, in order to sustain itself. Only about 10% or what is eaten goes towards new biomass while 90% is expended. If an animal species is only, or primarily eating itself, its not sustainable as the animals expend energy, but there is no or little energy entering the system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does macro nutrition information not sum up to e.g. 100 g?",
        "response": "Water mainly. Basically all drinks are mainly water. Given water is 1g/mL you can count most of the mass as being just water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does ink dry on a paper but not on a pen's tip?",
        "response": "It 'does' dry on the tip. However the tip in a ball point pin, is a ball. Only the exposed area of the very tip will dry, while the rest is technically sealed off until it rolls against the paper. Google ball point pen under microscope and you'll see what I mean.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I turned in a paper online, and it said that the file size is 115.61999999999999 KB. How can there be less than a byte of information? Doesn't one letter take up at least one byte of memory?",
        "response": "the filesize was calculated with a floating point operation.  floating point operations are always approximations.  you will almost always see rounding errors with flops. unless you specifically code it to round at a specific decimal point.  which that programmer failed to do.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any areas of the world that don't recognize daylights savings, if so why?",
        "response": "Not sure why this would be an ask science question, as it's more about politics than science. Also, answers to all your questions and more, including a nice map of which countries do and do not have daylight savings, can be found on Wikipedia. [_URL_0_](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does milk have a relatively short shelf life, when half and half can be good for months?",
        "response": "Ultra pasteurization (higher temperatures and longer time than regular pasteurization) makes milk last longer but effects the flavor. Since half and half is used in small amounts and doesn't sell as fast as regular milk, ultra pasteurization is seen as an acceptable tradeoff.  Meanwhile, milk sells fast, is used quickly, and is consumed directly in large quantities, so it's just pasteurized to maintain flavor at the expense of shelf life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How feasible would it be to modify fruit, say, apples, to produce Splenda or some similar sweetener instead of fructose?",
        "response": "It wouldn't be very feasible because, after all, the plant's main goal is to survive by producing sugars that it can burn for energy. If you replace its fructose with no-calorie sweetener, it has no source of energy anymore.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we try to stop invasive species?",
        "response": "Current invasive species are usually only there because of human activity. Humans transport species that would never be able to get where they ended up on their own. We have zebra mussels in man-made lakes in Texas because some boat owner from the Great Lakes transported his boat overland. The mussels have no predators, they clog up the water mains that bring water to our cities, and they degrade the underwater environment for the sport fish the lakes are stocked with. All of that is just human issues. We wouldn't even have lakes in Texas if we didn't dam up the rivers, and we would need all that water if there weren't so many people here. But sometimes invasive species destroy the natural environment too, like [kudzu in the American South](_URL_0_), or [beavers in Tierra del Fuego](_URL_1_). Ultimately it does always come down to human interests. Invasive species really only become a problem when they destroy human property, either directly or indirectly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were the various Latin dialects ever acknowledged by writers in the very later roman Empire (350-450 AD)?",
        "response": "Absolutely, if writing in them counts as acknowledgement. While the vast majority of written works were in standard (Classical) Latin, there were some things written in the non-standard dialects. Gaius Petronius' *Satyricon* has sections showing the Latin of the general public of Rome, which differed from the standard acrolect used for most writing. See [this section](_URL_0_) of the Wikipedia article for more info. Another good example is *[Peregrinatio Aetheriae](_URL_1_ which was an account of the authors trip to the Holy Land, also written in a non-standard Latin dialect. This was written around 385CE so it's right in your timeframe. There are more sources, but this should give you an idea. As a general rule, in most cases where there's a large empire and a standard language, it's inevitable that someone somewhere is going to use non standard dialects, even if only for effect in an otherwise standard piece (such as the dialect of a character meant to provide comic relief).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Do I Have Weird Thoughts Right Before I Fall Asleep?",
        "response": "You're starting to dream while still conscious. This is considered Stage 3/4 or Slow-Wave or Non-REM sleep. Shortly after this, healthy individuals will enter REM sleep, where \"real\" narrative-like dreams begins. You cycle through varying \"stages\" throughout the night. The cycles are characterized by patterns of electrical activity that can be measured on your scalp. It takes around 90 minutes to get to REM, and you cycle in and out of it through the night. Here's a nice picture: _URL_0_ Dreaming in Slow-wave Sleep is mostly thought-based, fleeting images, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some things get slippery when wet while others get sticky/grippier?",
        "response": "Generally speaking water is a bad lubricant and when you coat something with a (relatively speaking) rough surface, it won’t get slippery afterwards as well. However if you have something less structured and you put water on it (imagine a smooth surface ball or something) it will get slippery. I think the hand also accounts to things being “grippier” when the hand is wet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't your hands get sunburnt?",
        "response": "The tops of my hands have been sunburned before. The palms were not because I don't walk around with my palms up all the time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the tick boxes that confirm you are not a robot work?",
        "response": "Tracks your behaivour before clicking it. Open tabs, history, IP, computer stats and running programs. It is a lot more complex and demanding method than the original distorted text photo captcha but is much more convenient for human users.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- What's the deal with HSBC?",
        "response": "About 10 years ago, the bank helped drug cartels launder money. There was a criminal investigation, and the bank just settled it with the Department of Justice by agreeing to pay a penalty of $1.9 billion dollars and admit it's wrongdoing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I've always heard that not eating breakfast is bad for you, but what are the actual consequences if you skip breakfast?",
        "response": "The idea that \"breakfast is the most important meal\" is a myth. Here is an article with links you can follow regarding the history of the Quaker/Kellog invention of breakfast as we know it, and the weird religious nonsense behind the creation of this myth: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you physically break or shatter a flash storage chip, to what degree is the data still readable from the fragments?",
        "response": "It'd be *really* hard to reconnect the flash chip fragments back into a working chip, but it is possible to read flash cells with an electron microscope. Unless you manage to physically short out a cell (and you surely will for some of the cells near the break), the charge will be retained for a very long time in some of the cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cellphone manufacturers/communication companies recommend that you let a new phone die before recharging it?",
        "response": "It should be noted that with Lithium-ion batteries, which is in most smartphones and laptops today, fully discharging them lowers the average lifespan. Small discharges and recharging more often between uses is encouraged in order to increase average lifespan. Fully discharging a lithium-ion battery could be if the electronic device was able to estimate how much time you had left (in time, not percentage) as a fully discharge would allow the device to recalibrate its estimates, but this should be done occasionally (e.g. on a monthly basis).  **Sources:** [_URL_0_](_URL_0_) [_URL_1_](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What’s the difference between a statue and a sculpture?",
        "response": "A statue would be a specific form of sculpture. Generally they depict the full form of a person or other animal in a free-standing form. A sculpture in general would be some form of three dimensional art.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are partners of millionaires entitled to half their worth and sometimes even future earnings?",
        "response": "> rich guy's wife wants half of his Half of **their**. When you are married, everything earned while married is considered mutual property. There is no **his** money or **her** money, it is their money.  > Why would she be \"entitled\" to anything he earned **They** earned. While it may not be true for any particular case, the idea is that one spouse will often forgo their career in support of the other. They keep house and raise children which allows the other spouse to focus on their job and excel. They made sacrifices that impacted their ability to earn a living so the other could succeed, and thus are entitled to compensation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some radio stations ' FM signals hard to pick up in the city they broadcast to, yet others from far away can be heard easily?",
        "response": "Couple of things: - of course, the closer to the transmitter you are, the stronger the signal. - the transmitter may not actually be in the city it is “broadcasting to” - stations run different power levels. One station may be a 50,000 watt blowtorch and the other a 100 watt low power station - station transmitters don’t alway broadcast equally in every direction. You can have transmitter antennas with different patterns that have weaker signals in one direction. This is often the case if there a station on an adjacent channel in a nearby city to help minimize co-channel or adjacent channel interference. - and sometimes, depending on the output power and height of the transmitting antenna, if you get too close to the transmitter, the transmitted waves go “over you” and you’re in a dead zone. This really only happens with low power stations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do those penny auction websites work?",
        "response": "The price of the items is dirt cheap. But what they fail to mention is that you have to pay for bids and the auctions end times extend after every bid. So while you may have purchased that new laptop for $10, you spent $500 in bids, just like all the losers of the auction also spend hundreds in bids.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is the Susan G. Komen foundation reliable?",
        "response": "It's consistent, and reliable. Just not in a positive way. 15% of their revenue goes to breast cancer research and a lot of their time and money goes into suing other organizations which they feel impede on their intellectual property.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does humidity make joints hurt?",
        "response": "There is no proven scientific study that humidity absolutely causes joint pain. See the following reference: _URL_0_ However, they the study does admit that certain individuals can be more affected by weather than others, so its influence can not be rejected completely. Other people say that changes to humidity is often accompanied by changes in air pressure, which influences fluid levels in the joint and causes pain....but this is untrue as well: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the word Asia come to mean all the lands and societies east of Europe?",
        "response": "\"Asia\" is from a Greek word, refering to the land to the east:  > speculated to be from Akkadian asu \"to go out, to rise,\" in reference to the sun, thus \"the land of the sunrise.\" [source](_URL_1_) Here are some previous posts discussing the naming of continents [When and from who did each of the 7 continents get the name they have today? Have there ever been disagreements about the borders of the continents?](_URL_0_) [When were the continents first given names, what were those names and who gave them those names?](_URL_3_) [For how long have we had the concept of \"Continents\"? When did Europeans started calling themselves \"European\"? How were the borders of what we know as \"Asia\" and \"Europe\" set up?](_URL_2_) [Why are Europe and Asia considered separate continents, and was there ever a time when they weren't?](_URL_4_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The current MLB hacking case/scandal..",
        "response": "I don't have deep/intimate knowledge of the situation, but on the face of it, it looks really kind of silly. Basically a person that used to work for the Cardinals created an advanced scouting database. It was of course private and intended for the team's scouts and managers to assess and handle player transactions.  He *used* to work for the Cardinals, in that he now works in that same/similar position for the Astros. When he got into that job...he basically created them the exact same type of thing. I mean why would he not? Where it is silly is that both systems...had the same password. Like, I suppose, many of us, the guy who wrote the program had only a handful of passwords he tended to use, and the Cardinals used this to gain access to another team's system, just by taking an educated guess as what the PW would be. So...it's sort of technically hacking. The best kind of hacking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was the most dangerous job in WWII? That is, in what role (tanker, pilot, artillery, infantry...) would you be most likely to become a casualty?",
        "response": "The German Uboat force, by the end of the war, had 32,000 dead out of a force of roughly 40,000 men. I believe it was the deadliest branch of the German Armed Forces.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are the time zones of Madrid and Paris both 1 hour ahead of London, even though London is geographically between the two cities?",
        "response": "Time zones don't necessarily have to correspond with what makes sense (just look at Russia or China). Essentially all of Western Europe (except Portugal) is all in the same time zone, which (probably because of German influence) is an hour ahead of London. e: It's preferable for countries to be on the same time zone to facilitate trade. Don't want to call your supplier 30 miles away in Germany and have to remember he's an hour ahead of you. [e: yep, looks like I was right, CET was pretty much adopted in Europe during the German occupation (in either WWI or WWII depending on when you were first occupied by Germany)](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any companies currently in existence that can trace their lineage back to the East India Company?",
        "response": "Could someone answer this question about the Dutch East India Company and not the British one? The Dutch one was in the TIL that I think this question might be referencing!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Spain and France have the same time zone, why is Great Britain in a different one?",
        "response": "France used to be in the same time zone as Britain. But when the Nazis invaded in World War 2 they changed the time zone to match Germany's. When the Nazis were defeated, the French decided not to change their time zone back. Not sure why Spain is also in that time zone. Probably because they mostly trade with the rest of western Europe as /u/buried_treasure said.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would the market/inflation not slowly correct for basic income for all citizens? If retailers and service providers knew everyone had more money would they not just raise prices to meet the new influx of income?",
        "response": "Most plans for a basic income involve taxes and transfer payments, not printing new money. So while inflation will occur on some items or in some areas, no \"new\" money is being added to the system. As such, the overall inflation rate shouldn't be much effected. Or, to put it more concretely: if you just add a zero to every dollar a poor person spends then, pretty soon a shifty apartment would go from costing 100 bucks to a 1000. But, if you transfer that money instead, people will eventually build more housing for low income people, moving capital to where the money has gone. So rent might still go up, but not as much.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are clothes hangers not shaped like human shoulders?",
        "response": "They are designed to be in the shape of human shoulders. From the Wikipedia page on clothes hangers;  > A clothes hanger, coat hanger, or coathanger, is a device in the shape of:  > * **Human shoulders** designed to facilitate the hanging of a coat, jacket, sweater, shirt, blouse or dress in a manner that prevents wrinkles, with a lower bar for the hanging of trousers or skirts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the English language use \"A\" instead of \"One\" when referencing singular things?",
        "response": "A=non-specific indicator. A cat. One=emphasis on the amount of the item. One cat.  They've evolved to have different emphases.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is it that when you hold an object close to your eyes and focus on something in the distance, there appear to be two of the object?",
        "response": "Because you have two eyes. When they're looking at the same thing, your brain can merge the image. When you're focusing on something different, you're actually seeing two different images.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why we can't divide by zero?",
        "response": "Cut an apple into 2 pieces. That's 1 divided by 2.  Cut 3 apples into 9 pieces. That's 3 divided by 9. Now cut an apple into zero pieces. How're you going to do that, huh? *Huh?*",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Many East Asian cultures use characters in language, despite being considerably separate, is this a coincidence?",
        "response": "China was considered the model of a civilized culture in East Asia, in the same way Rome/Greece was seen in Europe and Persia was viewed in the Middle-East. As a result, the surrounding peoples adopted Chinese culture because of the prestige it offered. Japan undertook the Taika Reforms in the 7th century AD in imitation of the Chinese Tang Dynasty.  Source: _URL_2_ In regards to Korea, The Han Dynasty previously occupied parts of Korea, and the region adopted Buddhism during the Three Kingdoms periods, and so a knowledge of the Chinese writing system was needed to read many Buddhist texts. Alongside that was a great deal of trade and cultural transmission. Source: _URL_1_ Vietnam has also been under heavy Chinese influence. A major reason for this was that areas of Vietnam had actually been occupied by various Chinese dynasties until the 10th century AD. As a result of this, Vietnam shared a great of Chinese culture such as Confucian ethics and systems of governance. Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Best books about the American Civil War?",
        "response": "Literally tens of thousands of books have been written about the war, its precursors and its aftermath. I second ahtollef that *Battle Cry of Freedom* the best general overview of the war, but are you interested in anything more specific about it? (Military, political, international, women, African Americans, economic, cultural, pre-war, Reconstruction and aftermath, Border States, Lincoln, the home front, and so on) P.S. There probably isn't a \"true\" story about the war, or most anything else in history.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we feel emotions in our heart rather than our brain? How does that work?",
        "response": "Evolution had already created the nervous system for feeling pain and pleasure. So why create a second system to carry emotions with? Evolution kinda screwed us that way. But wait...there's more... You also feel emotions in your throat (like that lump thing that happens when you're sad) and in your gut (like butterflies in the stomach). Those are also because of the nervous system. It's a whole body system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are bugs so attracted to light like its the end all be all of existence?",
        "response": "Insects use the sun to navigate. Since it's really far away, it's in the same direction for the duration of the bug's flight. But a porch light is so close, the bug has to circle to keep the light in the same position in its field of view. And it's just going to circle tighter and tighter. It can't get away, because it cannot imagine the light is lying to it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Jesus earn a living?",
        "response": "There was a documentary by *National Geographic,*. I believe it was called \"The Life of Jesus\" or \"Jesus: The Missing .yeses.\" They usually air it on NatGeo around Easter. It features both Biblical scholars and historians who focus on that part of the world and time frame. One of them indicated that the original word used in the original Biblical language was most commonly translated as \"carpenter,\" but in reality is closer to \"laborer;\" they could do carpentry, but they could do other physical labors for others, like threshing wheat or helping plow fields. It was the same job as his earthly father, Joseph; young men born into poor families very frequently followed in their fathers' footsteps. This all was before he started his ministry, however. After that, I don't know for sure, but I would guess on the charity of others (I am no Biblical expert, so I may be wrong on that last part).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is JASTA and why did the White House veto after almost unanimous passage?",
        "response": "It lets 9/11 victims sue saudi arabia.  It's popular among a lot of people because Saudi Arabia probably did have a ton to do with 9/11 in a way that hasn't really been dealt with well.  It got vetoed because the whole concept of random people suing foreign governments is a real huge mess and is unenforceable and politically super sour and the US is the last country on earth that wants people to be able to sue it for things like war crimes, real or imagined.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does red bull/monster/coffee (caffeine) help us stay awake?",
        "response": "When we do things in our body, (like move, breathe, etc), our nervous system does this by sending neurotransmitters. After this happens, there are neurotransmitter-leftovers. The main one to talk about in this case is called Adenosine. It goes back to your brain and makes you tired, and after you sleep, it's recycled back into your body in its component parts.  & #x200B; In the brain adenosine fits into adenosine receptors. Your brain has receptors for many things, and what separates them is their shape. Proteins (like amino acids) have different shapes. So our adenosine receptors have a certain shape.  & #x200B; Caffeine can fit into adenosine receptors. When that happens, adenosine in your system can't get into those receptors to make you feel tired. That's why you crash after caffeine. All the adenosine that is building up when that caffeine finally metabolizes gets into the adenosine receptors and boom. Tired.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does distilled water expire?",
        "response": "Distilled water might not have a shelf-life, but the container around it certainly does. In the case of plastic bottles, these slowly leach compounds into the water (plasticisers and additives, rather than polymer). Over a long time, the build up of these compounds could become enough to make the water exceed contamination levels. Even then, it probably wouldn't be toxic, but to ensure that it stays within the legal limits manufacturers will place an expiration date that occurs well beforehand. This is also the reason why it's usually suggested to not reuse cheap soft-drink bottles as water bottles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Facebook plan to monetize Whatsapp? They paid $19 billion for it 2 years ago, but the app is still free and has no ads.",
        "response": "[In corporate America, the product is YOU!](_URL_0_) They bought whatsapp for the database of users and logs and connections. They can mine that and sell targeted adds to the people, even without putting ads on whatsapp, if they can connect you with a facebook profile or some other means of online tracking.  And arguably it was just to gather more of the marketshare abroad, particularly in China. They were buying popularity. They were buying, in part, your account because that's what they sell to advertisers. You are the product. Same reason why google gives out so many services for free. Personally I think that was a really stupid purchase and is likely some sort of money funnelling exercise to extract the billions out of facebook and somehow come back to Zukerburg's personal accounts sans taxes or shareholder oversight. Let's hope for another panama papers leak.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any plausible genetic modifications or physiology that could produce a Fire Breathing Dragon?",
        "response": "Well, there is the Bombardier Beetle, which relies on mixing two organic chemicals that form a kind of steam explosion. Only time will tell if it will evolve into fire breathing, but it seems to be going in your desired direction: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there anywhere hot enough that you could fry an egg (or any food for that matter) on a rock?",
        "response": "In order for the egg to fry, it needs to hit 158 deg F. Please google before posting, since there are a ton of informative articles on this very topic.. Such as [this](_URL_0_) quick edit: Well holy hell, that link is even library of congress..",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- Why is rocking ourselves on a rocking chair so relaxing ?",
        "response": "As I understand it, it has to do with vestibular stimulation. Your vestibular sense has to do with where your body is in space, and how your weight is balanced. Your inner ear governs this sense, and communicates the sensations through the nervous system.  It takes some effort to maintain vestibular equilibrium (standing, moving, but not falling down). It's relaxing to have your vestibular sense stimulated WITHOUT having to put effort into it. In other words, the body likes to be moving gently and safely (without feeling like you're about to fall) without having to consciously initiate or maintain the motion. It's also why people find floating in water or swinging in a hammock to be relaxing. It goes without saying that's why babies like to be rocked or bounced.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does coffee get sour overtime?",
        "response": "Do you mean coffee that's been sitting out in the cup or coffee that's been left on the hot plate in the pan? Because what often happens is that the coffee tastes bitter to begin with, one just doesn't perceive it because the liquid is hot. Once it cools down, you start to notice it tastes bad. Same thing with \"ice-cold\" beer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is a new moon different from a lunar eclipse?",
        "response": "They're actually the opposite, pretty much. A lunar eclipse is only possible when the earth is between the moon and the sun -- that is, during the full moon phase. A new moon is the other way around, with the moon between the earth and the sun. A new and full moon happen *whenever* the moon is on the same side of Earth as the sun or the opposite side, respectively. A lunar and solar *eclipse,* by contrast, can only occur when the earth, moon, and sun are directly in line, or very nearly so.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people \"boo\" during the NFL Draft?",
        "response": "Boos are louder than cheers and there are always those people in the crowd that hate a pick regardless of how good it may actually be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were serial killers hard to understand for detectives back in the 70's, and what changes have been made to further understand them?",
        "response": "Mindhunter on Netflix is a dramatization of how detectives learned more about serial killers back then, that may be entertaining for you. I don't know details so I won't waste your time other than this suggestion.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a \"Tor exit node\" or \"Tor node\"",
        "response": "Tor is an encryption system that bounces your data between dozens of computers around the world, each computer unravelling one layer of encryption that tells it who to send it to next, to make it tough to trace. Each one of those computers is a node, and the one at the end of the chain - where your data hits the rest of the internet - is an exit node.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are lions nicknamed 'King of the Jungle', when they are commonly known to live on the plains of Africa?",
        "response": "back when we first started exploring africa, africa was seen as a jungle in it's entirety. the lion was one of the most feared animals by man. so put the lion in africa = jungle, then he's at the apparent top of the foodchain = king. and then unlike many other predators, they live in packs with hierarchies, reinforcing the 'king' bit for the pack leader.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "There is a growing number of people who paint Winston Churchill as a historical figure deserving criticism, not praise. To what extent is this true, and what aspects of his life are worth critiquing?",
        "response": "The topic of Churchills culpability in the Bengal Famine has been discussed extensively before: [Here](_URL_2_) is a good summary by /u/vonadler [Here](_URL_4_) is a more in depth explanation by /u/gnikivar2 [Here](_URL_3_) is a very very in depth run-down by /u/Naugrith that is a personal favourite of mine As for gallipoli i recommend [This post](_URL_0_) by /u/thefourthmaninaboat who explains Gallipoli better than I could ever hope to. There is also [this post](_URL_1_) by /u/wingchild, /u/abrytan and others which discusses Churchill's actions in general.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why putting water on an oil fire makes it even worse.",
        "response": "Oil is lighter than water, and also boils at a much higher temperature than water. So when you dump water on an oil fire, the water sinks below the oil, is superheated by the above-water's-boiling-point oil, flashes almost instantly into steam, and creates a huge eruption of steam that hurls the oil above it outward in a cloud of flaming oil droplets that spews out of the pan in all directions, resulting in a massive fireball that will probably burn down your house. [Here's what it looks like](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does blood donation use hard needles unlike IV lines?",
        "response": "A couple reasons: it must be rigid so that the biconcave shape of the RBCs do not break or clump during the draw, but when getting an IV, it’s typically something like saline or a mix which does not run the risk of damaging components contained in something like a viscous blood draw. There should be more reasons, such as pressure difference withdrawing vs injecting but that’s all for now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does skipping stones work?",
        "response": "Rocks are able to skip on water because of surface tension. Larger, flatter rocks work better because they increase the contact area between the rock and the water. For two rocks with the same momentum, but one has a larger contact area with the water, the force exerted on the water by the rock with the larger area is distributed over a larger area. This decreases the stress exerted on the water by the rock, making it less likely to overcome the surface tension of the water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Theoretically if I constantly drank water, could I survive in a dry sauna?",
        "response": "You sweat. You urinate. You pee/sweat all the salt in your body and replace it with plain water. The increase in water concentration flows into your tissues, and specifically, the brain. Your brain swells in your skull which is too hard to expand with it. You become nauseous. You feel sick. You get a headache. Then, you gradually become more and more lethargic. You start to have seizures and finally, stop breathing. You die. It's similar to how marathon runners tend to die from water intoxication rather than dehydration.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how engineers plan complex production lines in factories",
        "response": "It's pretty easy. Before the product is manufactured, they design the product keeping in mind what technologies the factory already has (they only purchase extra machinery or hire contractors in case the cost of it is lower than the expected gain). The engineers plan the product to fit what they already have, and not the opposite. As for knowing which process/material to use, we check the list and see what kind of material we are using and which processes can be applied to those materials and to the shape we want to do. There are higher cost processes and some that are lower cost, and some that are just for a few pieces or some for thousands of pieces... It's not trial and error, it's all planned before being put in action. Well at least that's how I my teachers showed me to do it. I'm a design student with engineering classes so I can do both the design and the planning of the product's manufacturing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the sky so much brighter at night when it's snowing than it is on an average cloudy night?",
        "response": "Snow reflects light, so what every available light there is at night, it will be reflecting from the snowfall.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Deja Vu. Why does it happen and How?",
        "response": "This is a paraphrased answer from one of my past neuropsychology professors: \"it's like your brain accidentally misfiled a short term memory in the long term memory folder.\" Not sure how scientifically accurate that statement is, but it made sense at the time and that's how I've thought of it ever since.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I've never seen these Heer collar patches before can anyone tell me what division they represent?",
        "response": "They're not Heer, but Luftwaffe collar patches for enlisted ranks, here for a *Gefreiter*, a private.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do deer and other animals that are commonly hit by traffic try to run in front of the vehicle instead of turn around or stay put?",
        "response": "Prey animals, like deer, squirrels, and birds have eyes on the sides of their heads. When they see a car coming they only see it with one eye - even turning their heads they can't get the stereoscopic vision predators (like humans) have.  Therefore they can't judge distances well by standing still. The easiest way to judge a distance is to run forward and look at the thing from a different angle (this is called parallax, _URL_0_). The best way to get a good distance on an object is to run directly across it's path. This provides the best angles and most accurate range. It's actually quite neat that squirrels and other animals do trigonometry in their heads without ever thinking about it. Anyway, the car moves so much faster than squirrels can understand that while they're running across the path of the car the car hits them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the number of protons in an atom determines which element you have, does that mean that if we could manipulate the protons perfectly we could change one element into another?",
        "response": "We already do manipulate the protons and neutrons to change elements into other elements, but we do it to release power in nuclear power plants. Researchers also do bombardment of different elements to create new ones, that is how elements heavier than uranium are made, and everything heavier than uranium is man-made. Generally speaking, these processes are too expensive to general use, it's almost always easier to mine and refine an element, even expensive ones. (There are exceptions, like Technetium and Americium, which are used in medicine and in smoke detectors, but in very small amounts.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did people in early America feel about the removal of Native Americans from tribal lands?",
        "response": "I recomend reading about [\"Manifest Destiny\"](_URL_0_) because it explains this topic. Basically Manifest destiny was the belief that Americans were destined to expand westward and occupy all of America. It was a widely held belief that was used to justify American Imperialism in Mexico and the Philippines. It was also used to justify the removal of Native Americans. Most of the white population supported it, thinking they were savages preventing the United States from achieving great things. But there was also many humanitarian groups that did not support it. They thought removing the Natives from their land was wrong, but it would be better if they stayed away from the whites. Some thought they would fade away eventually and not to think about it much. [Cool painting depicting Manifest Destiny](_URL_1_) Sources: Race and Manifest Destiny: Origins of American Racial Anglo-Saxonism",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Cairo Illinois, at the confluence of the Mississippi and Ohio Rivers, become a major city like St Louis?",
        "response": "Merely being at a confluence of rivers that can handle the same kind of boats is not a great advantage over other river ports. Any cargo just sails past. As a port, having easily accessible bluffs out of danger in spring floods would give places like St. Louis the advantage. Places where cargo must be shifted from ship to barge or railroad (like Chicago) are classic entrepôts, and have natural advantages as places to set up factories. In addition, Cairo is extremely flood-prone, completely surrounded by levees. Its situation certainly did not attract early settlers: it wasn't even founded until 1837, decades after other areas of Southern Illinois and the Ohio Valley, and grew very slowly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do eyes seem to follow you in a photograph or painting?",
        "response": "Basically you can tell if someone is looking at you if you see equal amounts of white on both sides around their pupil and iris. That basically means their eyes are centralized toward you. With paintings, if you paint someone to look straight ahead, no matter the angle, you still see equal amounts of white in their eyes because that's what in the picture, which brain interprets as the eyes being fixated on you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was there ever a death attributed to old age or 'suspicious circumstances', but was later suspected to be of an as-yet undiscovered disease?",
        "response": "Really, if you want to look at it technically, nobody has ever died of \"old age\". It's heart failure, kidney failure, stroke, etc.  Before modern medicine though, doctors were not aware of these causes of death, and as such \"old age\" was listed as the cause of death.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Ok, so im still confused about stocks. Explain Li5",
        "response": "You buy a stock at $5 and then a year later when the company is doing better, the price of the stock increases to $8 and then you sell it! so you make $3!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how did Black Friday become a holiday?",
        "response": "It's not a holiday by most definitions. It's not a bank holiday or a federal holiday. Many businesses close for 12 days a year - this is a tradition, not a requirement. For businesses that aren't closely tied to retail, banking, or government, it's become standard to close the day after Thanksgiving and the day before Christmas, in order to make it easier for employees to spend time with their families, especially when that involves travel. This tends to be contagious - when many businesses are closed and many people are on vacation, that just encourages others to close those same days because it's harder to get anything accomplished when other businesses you work with are closed anyway. Many businesses offer 12 days but choose to stay open during some federal holidays during the middle of the year, but offer more holidays near Thanksgiving and Christmas.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the Portuguese colony of Brazil remain united after independence while the Spanish colonies in South America break up into many different countries?",
        "response": "Unlike the Spanish colonies Brazil was administered as a single colony with one single government for almost its entire existence, it began as separate private colonies then was unified as single royal colony, split for a few years between north and south and then again reunited for more than 2 centuries. Besides this, before and after independence there were separatist movements but they were quickly defeated with the exception of Revolta Farroupilha, a separatist movement from the southern most province that still has supporters today much like in Texas. This war lasted for 10 years and for a time it looked like they could win. If this revolt and other were successful Brazil could be at least 6-7 countries. And there was one successful independence. The Cisplastina province (Uruguay), though settled by the Spanish was part of Brazil and only gained its independence after Brazil's own independence from Portugal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do scientists deduce the likelihood of scientific theories based on limited sets of observations?",
        "response": "Let's do a simple experiment. You want to see if a coin is unfair. Since most coins are fair, the *null hypothesis* is there is nothing fishy going on, and the coin will land on heads 50% of the time. Your hypothesis is that it is going to land on heads more than 50% of the time. So now we experiment. You flip the coin twice and get heads. What does this prove? This is what we would expect to see if your hypothesis is correct. However, if the null hypothesis is correct, we'd see this 25% of the time, so the support of your hypothesis is pretty weak. So we flip twice more. 2 more heads. Better for you, but still we'd expect to see this 6.25% of the time. This is about where science starts. If an observed phenomenon is less than 5% probable, it is typically interesting enough to take a closer look. Note, that is not [proof](_URL_0_), just an indication more study might be warranted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there a 10 digit ISBN and a 13 digit ISBN?",
        "response": "*\"For more than thirty years, ISBNs were 10 digits long. On January 1, 2007 the ISBN system switched to a 13-digit format. Now all ISBNs are 13-digits long\"*  Source: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was there such a huge discrepancy between ticket prices on the Titanic?",
        "response": "The suite has two bedrooms, a sitting room, and a private bath. The berth is potentially shared with a stranger on the way over, is a single room, and you have to share a bathroom with everyone else. I suppose once you are at a certain level of rich, you might as well spend more money to be comfortable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some apps not include the full functionality of the full website?",
        "response": "Because adding functionality is expensive because you need someone to develop it. Also people use platforms differently on mobile compared to their computer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the moon to appear to be two different colors?",
        "response": "When you look at the Moon, you will see dark and light areas. [The dark areas](_URL_5_) are young [plains](_URL_3_) called maria and are composed of [basalt](_URL_4_). The basalt flowed in and flooded the area created by a huge impact with an [asteroid](_URL_2_) or comet. The light areas are the highlands, which are mountains that were uplifted as a result of impacts.  & #x200B; [_URL_0_](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a fixie different from any other bike?",
        "response": "So on a fixie, the back gear is always engaged. On a regular gear, when you stop pedaling the gear disengages to let the wheel spin freely. This is why when you pedal backwards on a fixie,you will go backwards.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the mirrors on the newer telescopes shaped like hexagons?",
        "response": "Disclaimer: amateur astronomer. I have a clue, but no guarantee that I'm right! In the past, large telescopes like the 200\" at Mt. Palomar would be just one large circular mirror. When you try to scale up much beyond that, you get problems like the mirror sagging under its own weight, ruining the image. The modern multi-segmented mirrors are a workaround to this problem. I believe that the hexagonal shape of the mirrors is simply for most efficient packing, getting the most surface area within a given overall diameter. The first big multi-mirror scope, the MMT in Arizona, used 6 circular mirrors, and if you look at pictures of it, the wasted space really jumps out at you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many cheap beers have the name Ice in the name?",
        "response": "They are \"ice filtered.\" In this process, the beer is chilled to just around the freezing point. Because of physics, ice crystals want to use some kind of particle as a nucleation point, and they do form around stray yeast cells and other tiny particles. This of course makes the particles effectively larger (since they have some frozen water stuck to them), which makes them easier to filter out. Easier filtering means cheaper filter media and faster flow, so it costs less to filter the beer in preparation for packaging.  ICE = cheaper filtering (in the US - there are ice beers in other parts of the world that are a different thing altogether).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were gun laws in Australia and the UK *before* 1990's mass shootings?",
        "response": "It was still a lot harder to get a gun in Australia compared to the states, even before Port Arthur and the buyback scheme. For one thing, to get a firearm license in Australia you've always needed to have a demonstrated purpose for it, the most common being: - Agricultural need (you own a property and need a gun to control pests or put down livestock humanely). - Competitive shooter (member of a shooting club that participates in competitions). - Job-related (cops and a handful of security guards who need guns, like the guys that drive the cash trucks around and refill ATMs). In answer to the question, Australia has never had \"comparable\" gun laws to the US because we don't have a guaranteed right to have them (as the second amendment gives). Is that a good thing or a bad thing? From one point of view, less rights is bad (I guess). On the other hand, we've had a hell of a lot less mass shootings, firearm homicides, suicides and accidents compared to the States.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is a virus \"born\"? I am under the assumption that viruses are not alive, so do they reproduce? How does one come into our world?",
        "response": "The replication point has been made here already, but that does not explain how viruses \"come to be\".  For that I give you this _URL_0_ TL;DR Ancestral viruses evolved in a pre-cellular environment as selfish genetic elements and adapted to prokaryotic and eukaryotic life as they emerged EDIT: Replication, not reproduction",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did Saint Paul believe in other gods?",
        "response": "Hey there! Just as a small tip, you might also want to try asking this over at /r/AcademicBiblical for some additional input.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't everyone buy the Google Computers? They must have some kind of catch?",
        "response": "They're not really laptops at all, they're more like giant Android phones. No desktop, no PC Games, photo or video editing--no software of any kind aside from Google's apps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Policy compiled by a political party copyrightable? How hard is it to take a whole party's policy verbatim, tweak one part of it, and form a new party?",
        "response": "What copyright law? There are many across the world. Generally you'd probably be safe as long as you make an original work describing your platform; a verbatim copy of someone else's writing is generally going to fall under copyright violation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do some retail stores have ~20-30 checkout lanes, when less than 10 are ever open at one time?",
        "response": "Because the stores are so big that it's cost effective to build enough lanes for the few times a year they expect to use them (black friday and such).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that some surfaces colder than others at room temperature?",
        "response": "Basically they feel colder if there is faster heat transfer from your hand to the surface. Metals generally have faster heat transfer than non-metals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does food usually taste better when cooked in an oven as opposed to throwing it in the microwave?",
        "response": "The heating from a microwave will be much closer to \"steaming\" than roasting in an oven. The browning you get from roasting/searing in a hot oven will not take place in microwave, at least not in typical cooking. The chemical reactions that brown sugars and proteins (Malliard reaction) create a mix of complex flavor molecules. Texture is also a big part of how we perceive food, you are going to get much more interesting and satisfying textures from roasting in an oven.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does \"Auto focus\" works on cameras?",
        "response": "It depends of the camera in question, but the gist is that there's a sensor that measures the distance to the target, which in turn makes the lens(es) adjust accordingly. This distance sensor could be a laser or an infra-red light. Some other systems might not have that kind of distance sensor at all. What they do is they take the image seen through the optics, adjust the focus a bit, and take a new image. These two images are then compared (i.e. checking the contrast difference between neighboring pixels), and if the newer image was better, the camera now knows it should keep focusing that way until a worse image is found. If, on the other hand, the very first image was better, then the camera tunes the focus the other way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it sometimes easier to concentrate when you close your eyes?",
        "response": "Closing one's eyes eliminates visual distractions.  During search and rescue operations while in a search line, the team leader will conduct a 'SOUNDEX' where everyone, to include the leader, closes their eyes. A designated person will call out, \"We are a search and recue team. We are here to help you. Please call out so we can locate you!\" All of us then listen for 30-60 seconds. If anyone of us hears something, we point to the direction of the sound while still keeping our eyes closed. This then helps the team leader determine the direction of the sound.  If all of our eyes were open during this method, it would be detrimental. First, our attention could be diverted by movements--other people, wind in the trees, birds flying. Also, when pointing at the source of a noise, if you can see others pointing at the same time, it can influence you to falsely alter your bearing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the color of your eye effect how bright light appears?",
        "response": "The colored portion of your eye is the Iris, which simply serves to adjust the Pupil's size. The Pupil is the region of your eye were the light you see actually enters the eye on its way to your retina. This region is very close to black in almost all people so one wouldn't expect there to be an obvious connection between the light you detect and the color of your eye.  That being said there is some research indicating that people with darker colored eyes *may* be slightly better at very fast tasks (like hitting a baseball) and people with lighter colored eyes may be better at \"self paced tasks\" like hitting a golf ball. Others studies have shown no significant correlation between performance and eye color though so the jury is still out.  Source: [NY Times Article](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't goods and services cost less to increase the quality of average people's lives?",
        "response": "Because average people make those average goods, and want an average wage. Decreasing the cost of the average services, for the average person would also decrease the wage of the average service provider.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do puppies (and some grown dogs)often tilt their heads to the side when spoken to by humans?",
        "response": "Dogs are particularly sensitive to the tiny difference in time between hearing something in each ear, and tilting their head allows them to better identify where a sound is coming from or how far away it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between being declared clinically dead, and being actually dead?",
        "response": "There's a big difference between mostly dead and all dead. Mostly dead is slightly alive. With all dead, well, with all dead there's usually only one thing you can do. Go through his clothes and look for loose change.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Saw a factoid that said Venus was the only planet that rotated clockwise. Doesn't this hold true only if we all agree which direction is up?",
        "response": "Yes, it's a convention. We could reverse our convention and then Venus would be the only counter-clockwise planet. I don't know how this convention started, but it's the same one that makes North \"up.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can i spend the entire night tossing and turning, unable to sleep, and as soon as day breaks and I need to get up, I'm exhausted?",
        "response": "The main reason for the sudden change is the daybreak itself. Your internal clock regularly resets/checks itself against the current level of light. In the dead of night it can't really tell between 1am and 3am for example, so when day starts to break the clock resets and realises it's actually morning and you instantly feel tired. Have you ever been to a party/rave where you don't see the outside world all night, you get to the endm, still feel fine and as soon as you go outside or open the curtains or anything like that, you feel shattered? Same thing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a hummingbird is in a car traveling 100 mph, and the car stops quickly, will the hummingbird hit the front windshield?",
        "response": "You're thinking of that helium balloon effect where the air moves forward in the cab of the car and pushes the balloon back. But it only happens that way because helium is less dense than air. A hummingbird is more dense than air, which you know because they have to flap their wings to fly. It would hit the windshield as surely as it would hit the ground if it stopped flapping its wings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How strongly did you have to speak out against the Chinese government to be a political prisoner or get executed?",
        "response": "Interesting Smithsonian article on the [Hundred Flowers](_URL_0_) campaign. In short, after having slaughtered ~700,000 counterrevolutionaries, Mao encouraged \"constructive criticism,\" and the massive amount of criticism directed at the Communist Party, the outcry from intellectuals and those critical of the new government, scared him into quashing his own movement and shipping many thousands of people off to labor camps or mass executions. You could technically have obeyed his policies exactly and been killed for it, in this case. TL;DR Mao invites opposition, people post fliers to a wall, he backtracks, thousands are killed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do train tracks have small rocks under them rather then cement or a stronger material?",
        "response": "Small rocks allow for shifting in the rail line due to time/heat. If they were fixed down to a solid then the minor expansions and contractions in the rail would quickly destroy whatever it was anchored to. To combat this, early engineers instead anchored the rail to large pieces of wood to keep it down then used the rocks to provide a stable surface that could absorb vibrations and shift with the changes in rail size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you're 'fighting a disease' what does that battle look like? do your white blood cells just absorb bacteria/illness and kill them? What happens?",
        "response": "When you're fighting a common cold, almost all the symptoms you get are a part of the immune system mounting defenses, not something caused directly by the virus. * Fever: Kill or disable pathogens by denaturing important proteins * Runny nose: Increase mucus production to flush out foreign particles * Cough, sneezing: Eject possibly contaminated mucus from the body * Sore throat: Inflammation acts as a distress signal and aids in immune response * Fatigue: Prioritize energy use to fight the infection",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is all energy consumed by a computer turned to heat, or is some amount wrapped up in \"information\"?",
        "response": "Electrical engineering *student* here: Depending on the type of memory, the data may be stored in a capacitor (DRAM) or a flip flop (SRAM). Both of these store the energy in the forms of voltage, which is a potential difference in energy between two points. The actual calculations are electrical energy which will be dissipated into heat energy by resistance within the circuits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Many paintings from the Renaissance are pretty erotic. Do we have any documentation of patrons or collectors using them as high-class pornography? Did patrons ever request certain erotic scenes?",
        "response": "hi! there's *lots* of room for more input on this, but you may be interested in this similar earlier question * [During the Renaissance era, were any paintings commissioned for masturbatory reasons? For example, did some rich prince get Leonardo Da Vinci to paint him naked women he could pleasure himself to?](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some people well written but not well spoken? (myself included)",
        "response": "Speaking is hard. You have to think of what to say, translate that into words that make sense and in the right order, then translate those into sounds and speak them correctly all while doing it fast enough and right on the first try so the other person doesn't think you're an awkward mess.  Writting, you have all the time in the world to find the right words and put them in the right order and can even change your mind half way if you need to correct something. All before the other person can even see what thoughts you have to offer.  So all things being equal, you could have an amazing vocabulary, but if you're not quick witted or practiced, it's often hard to vocalize what you want to say on the spot. But given time to write it, you can make best use of your mental talents.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "LI5 - How the UK government works.",
        "response": "The main difference is that the UK has a parliamentary system, and the US has a presidential system.  In the US, we elect the president, who's in charge of running the country and enforcing the law, separately from electing Congress, which makes the laws. In the UK, people elect representatives to parliament (the British equivalent of Congress). The leader of the biggest party in parliament then becomes the Prime Minister, and that prime minister runs the country and enforces the laws (and I'm skipping some details here).  So in the US it happens all the time that the president is opposed by one or both houses of Congress--that's why Barack Obama couldn't get his ideas for the budget through in the latest crisis. That doesn't really happen in the UK: the person running the country is CHOSEN by the majority of people in parliament. In the UK today, the monarchy's is pretty much only for ceremony, to serve as a symbolic unifying force.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are the ages of the craters of the moon determined?",
        "response": "The craters on the moon were dated by examining the rocks in the impact ejecta. Basically an impact will melt rocks and fling it out. Those rocks were collected, brought to Earth, and dated using Ar-Ar dating. The three craters that were dated are called Imbrium, Nectaris, and Serenitatis. These three craters all seem to cluster around 3.9 billion years ago (giving rise to the idea of a Late Heavy Bombardment). These ages are not without controversy due to the close proximity of Imbrium and Serenitatis (as a paper I will link to at the bottom recently pointed out).  That being said I'm getting off topic. They were dated because rocks that would have formed during the collision were dated on Earth after being collected in apollo missions 15,16, and 17. The craters that were not dated have been given ages by crater counting (however this technique is entirely model dependent). Links:  _URL_1_ _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the geometrical shape of the heart come from, and when was it correlated to the organ?",
        "response": "_URL_0_ Answered here:  In summary - the heart shape became associated with male-female sexual relationships in antiquity because it is the shape of the seed of the now extinct silphium plant which was a widely used contraceptive.  It was thereby transferred to the bodily organ because of ancient beliefs that the heart was the seat of emotions and reason, including romantic love.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why smoking marijuana makes people feel good, makes music sound better, makes things more funny, etc.",
        "response": "In your brain there are lots and lots of chemicals. Some of them make you feel happy and some of them make you feel sad. When your brain, which is like a giant computer, wants to tell you that you should feel happy it releases those chemicals and you feel happy! Soemtimes, the things we do can trick our brain into making us think we're happy, like marijuana. When you smoke marijuana your body gets very confused and releases all sorts of chemicals that affect the way you see and experience the world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes that loud pulsing sound when only one or two windows are down in a car and you are driving fast?",
        "response": "It's pretty much the same thing as blowing on top of a jug to make that whistling sound. Bigger the jug, lower the sound. Cars are rather big. Sound is rather horrible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Somalia is Coastal, Equatorial, Flat... and a Desert?",
        "response": "From the exact same XKCD article that you linked:  > (Climates can be hard to predict—for example, in our world, Somalia and French Guiana both sit on the equator, at the eastern coast of a continent, and seem like they should both receive a tropical sea breeze. But coastal French Guiana is dense rain forest while coastal Somalia is an arid desert. The explanation involves the monsoon cycle.) So, I suspect the answer involves the monsoon cycle...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why aren't eye glasses made out of gorilla glass, or other scratch resistant glass that electronics have",
        "response": "Honestly, most glasses aren't even made with glass anymore - just different types of plastics. Glass is heavier and less shatter-resistant than other materials which are more commonly used. And as mentioned already, there are anti-scratch coatings that you can get. Source: I'm in optometry school.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are car batteries able to be charged up with a jump start, if Car Batteries use chemicals for energy?",
        "response": "The jump start doesn't charge the battery, it just starts the car. When the car is running, it charges the battery.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much did Sweden as a neutral, iron ore rich country profit from world war 2?",
        "response": "Any gains Sweden may have made during the War from trading with Germany were offset by the massive damage done to it's economy from having it's overseas trade essentially capped by the Royal Navy. In fact you could argue that the UK drove Sweden into a corner by it's over zealous policing of the blockade on Germany. As for what having NAZI Germany as your main trading was like, I don't know the specifics of how they treated Sweden, but a Finnish man I know once told me that the Germans routinely resorted to what was essentially extortion when trading with Finland, and Finland was a German Ally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have string theorists narrowed in at an estimate of 10^500 possible universes?",
        "response": "It is difficult to answer this question without going into string theory but as my knowledge doesn't contain the inner-workings of that theory i will do without. Basically The concept is that every universe is created by something. String theorists think that this something is a theoretical string the size of the smallest number we can come up with in math (Planck's length) and it is these which somehow effect the determine the universes laws. This make it mathematical where we can say with ~~little~~ some certainty how many possibilities could arise from this. Math is good in this case because it is not controlled by the laws that govern the universe but instead governs itself with laws we have set it place. This however is purely theoretical and to put it in perspective the number 10^500 is more than the number of atoms in our whole universe.  TL;DR) basically we try and find the most fundamental properties of what makes a universe and mathematically find all the possibilities.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The deaths of Tupac and Notorious B.I.G.",
        "response": "> Is there a generally accepted theory regarding the deaths of Tupac Shakur and Biggie Smalls (aka Notorious BIG)?  Gang related  > Who and Why? Crips killed 2pac, Bloods killed Notorious, because gang related for 2pac, Notorious because retaliation for 2pac  > Furthermore, did being a gangster rapper in the 90s carry inherent risk, or were there specific circumstances that were the catalyst for these particular deaths? A very high number of rappers were killed in the 90s, so yes, there was an inherent risk for the profession.  > Was it a predominantly East/West issue, or did rappers from other cities (Houston, Cleveland, etc) face similar issues? Country wide  > Did some of these rappers serve as proxies for particular gangs? A very high number claimed and/or associated, be it by proxy, hiring known gang members as security, or they were their friends.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the Venezuela protests?",
        "response": "Came here to post the same thing. I don't know a whole lot about Venezuela, but it seems strange to go from student protest to full on bloody riots.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there animal psychopaths?",
        "response": "You can't really apply the term psychopath to animals. If you look at psychopathic behaviors on the [wiki](_URL_0_) page your cat displays all the characteristics.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When formatting a hard drive, why is overwriting it 7 times considered to be more secure than just filling it with zeroes?",
        "response": "The recommended 7 formats is very old, and in the 80's was recommended by DoD. 7 Formats is not recommended by \"the literature,\" or even by the DoD anymore.  See U.S. Navy Staff Office Publication NAVSO P-5239-26, U.S. Air Force System Security Instruction 5020, and NIST SP-800-88.   Here's a link with some narrative [historical data](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does renting a movie digitally cost so much more (usually 4-5 dollars) than renting a physical disc from a service like RedBox (usually 1-2 dollars)?",
        "response": "Simply a convenience fee. Also, movie companies charge a lot more for digital rights, as more people will stream/download them than buy the physical copy, that's why Netflix's physical library is much larger than their digital library.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Olde English font become synonymous with urban American gang culture?",
        "response": "It's more properly called a Blackletter typeface, rather than Olde English. Common forms are Textualis and Fraktur. Hopefully these will give you something more useful to Google. I only found a reference on Wikipedia that this type of lettering is popular in hip-hop, but it didn't say why or provide a source, but hinted that it has something to do with LA chicano culture. Happy hunting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was CGI possible before the mid-80s when Computers were text based?",
        "response": "Before CGI, special effects were just ... special effects. That is they were done without using computers, either by humans drawing animations, or stop-go animation of models, or a variety of other ingenious methods.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to achieve orgasm whilst in a coma?",
        "response": "Rather than full fledged orgasm, how about emission? Nocturnal emissions are possible without stimulation so it is plausible unless the coma hinders the actual process of emission.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were the nuke tests from the fifties filmed?",
        "response": "Lead glass. You can make glass with a very high proportion of lead oxide in it. The same stuff the radiographer looks through when doing an X-ray. Edit. Oh, and mirrors.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Russia have a small plot of land by the Baltic Sea?",
        "response": "The area you are referring to is the Kaliningrad Oblast. This territory was part of the area historically known as East Prussia, which was part of the German Empire and later Nazi Germany. Near the end of the Second World War, East Prussia was occupied by the Soviet Union. After the war East Prussia was stripped from Germany and was officially divided between the Soviet Union and Poland. The Kaliningrad Oblast was the Soviet - now Russian - portion of that territory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is it that when I get hit in the balls, it hurts in my stomach?",
        "response": "I'm pretty sure it's because the nerve endings of the testicles go that far back.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between being stubborn and persistent",
        "response": "Hi sweetie! How's my little five year old boy doing?  Remember when I asked you to take a bath yesterday and you kept saying no? And I asked and I asked and I asked, but you kept saying no. But I kept on asking. After about an hour, you finally took a bath! See, I was being persistent by asking over and over despite knowing your answer. But you just wouldn't change your mind, so I guess that's what makes you stubborn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does my GPS consistently disagree with my car’s speedometer?",
        "response": "Speedometers work by measuring how fast your car's tires are rotating, but they can't know how big your tires are. The bigger your tire diameter, the more your car will travel per rotation, meaning the faster your real speed will be compared to your reported speed. Speedometers are designed to high-ball because if you, say, were ticketed for doing 105kph when the speedometer said you were doing 100kph, the car manufacturer could be liable. GPS-reported speed should be fairly accurate as long as you have a consistent fix.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the purpose of creating artificial elements that don't last for more than a few seconds, if that?",
        "response": "Because the universe doesn't conform to timescales we happened to evolve to find comfortable. Plenty of important things happen on picosecond levels or shorter. The sorts of actions we have to go through to make these elements happen in many regions of space (quasars, gamma-ray-bursts, star cores, the big bang). But by doing this we may also find the theorized _island of stability_ whereby some super heavy elements could last for hours, or even up to millions of years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if someone who is obese starves back to normal weight?",
        "response": "Nothing good. Fat cells act as storage for excess glucose, which can be accessed for cellular respiration.  However, the body needs a range of amino acids and vitamins to function, which are *not* stored in fat. Before you starve off the weight, your body will be reduced to cannibalizing muscle tissue for proteins, and even bone tissue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that internet infrastructure is so bad compared to \"utility\" infrastructure such as water and electricity?",
        "response": "What your ISP is providing is a hell of a lot more complicated that water, sewer, and electric. Also they have had a hell of a lot more time to get water, sewer, and electric working right. With internet, you have routers, and packets and switches. On top of that you have protocols and firmware and all this other crap. Don't forget that your router and such relies on the electricity. While a slight flicker wont cause much damage to a light bulb, it can cause problems in your router. Also internet is traveling a lot further to get and receive data. Basically it is a much more complicated system.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much water does it take to offset sodium intake?",
        "response": "A \"normal\" blood panel sodium level is ~140 mmol/L, sea water has a salt concentration of ~600 mol/L, so it has about 4.3 times as sodium as blood. As I understand it, as your salt intake increases, the concentrations in your urine will rise without you needing to increase your water intake, until it hits the maximum concetration level you kindeys are capable of filtering at. However, different sources had different levels: one said [~280 mmol/L](_URL_1_), another said [~500 mmol/L](_URL_0_) while noting that one human subject managed to hit 610 mmol/L in his urine. While it's expected that there be generic variants that result in more or less efficient kidneys, this seems like an overly wide variation to me",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't pennies be smaller?",
        "response": "Because the problem isn't just that they cost more than their face value to make. If it was, we would just make them from steel. It's that handling such a small unit of value is a waste of time and effort.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Besides being forced to write a certain way, what determines which hand a child will write with?",
        "response": "Heredity... Modeling  I don't force my son, im a lefty, dad's a righty. Kid switches still.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why and how does music get stuck in our head, especially when sometimes we don't even like the song?",
        "response": "The overall conclusion is that the song has to be quite simple in order to be recalled spontaneously, but also have something a bit unique that makes the brain want to rehearse it over and over.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Kant: If you measure the length of a book not by how many pages it has but by how difficult it is to read then many a book wouldnt have been so long if it hadnt been so short.",
        "response": "My understanding of the quote is that he is saying that some books are made too short, and therefore are difficult to read/confusing.  To rephrase the quote, he's saying something like, If you measure how difficult a book is to read, and call that \"length,\" then you'd find that many books that have a small number of pages are actually greater in \"length\" than books with more pages that allow the points in them to be made more thoroughly. Or, put another way, he's saying that the book he wrote is long because if it was short it would be even harder to understand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the fez hat become a symbol of relaxation?",
        "response": "\"Initially a symbol of Ottoman modernity, the fez over time came to be seen as part of an \"Oriental\" cultural identity. Seen as exotic and romantic in the west, it enjoyed a vogue as part of men's luxury smoking outfit in the United States and the United Kingdom in the decades surrounding the turn of the 20th century.\" - Wikipedia",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what exactly is octane and why is 6 extra octane (premium vs regular) such a big deal?",
        "response": "Octane is a measure of the resistance of a fuel to preignition. The higher the octane number, the harder fuel/air mix can be squeezed before it ignites. Preignition is bad because it can cause damage to the car's engine. You want the fuel/air mix to ignite when the spark plug fires, and not before. Cars that have high compression ratios, or are turbocharged, or are otherwise optimized for high performance will want premium gas to help them run at their best. Some cars that want premium can also run on regular, although they will do so at reduced performance and fuel economy. But if an engine is not designed to use it, burning premium gas doesn't give any benefit. If you have an ordinary engine, you won't get more power or better economy by using higher-octane gas. Unless your friend has a car that wants it, he's only wasting his money by buying premium. The best thing to do is to read the owner's manual for the car, and to burn the least expensive grade of fuel that it recommends.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is time defined as the fourth dimension?",
        "response": "\"dimension\" in math doesn't need to be geometric. A dimension is just a relevant variable in an equation, basically.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the deal with curved televisions?",
        "response": "Our vision is naturally curved. If you take the amount of curve on the tv and form a circle, the epicenter will actually be the preferred viewing distance.   [MKBHD did a video on it.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the photon of specific phase that causes stimulated emission in a laser device arise?",
        "response": "The first photon doesn't have to have a specific phase. Whatever it has determines the phase of the laser. In terms of direction and polarization: If it is not aligned with the laser cavity (or has the wrong polarization, if that is relevant), this chain of photons dies down quickly and another \"first photon\" will start the laser. Note that actual lasers do not emit *perfect* laser light. You can still get all sorts of weird effects in between.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Tesla's quote \"if you want to understand the universe, think of energy, frequency and vibration\"",
        "response": "If we assume that everything at the core is made of energy in one state or another, the basic energy ('stuff') oscillates (vibrates) in one way or another, frequency basically is the different ways 'stuff' vibrates in, what makes it well.. different. Therefor: to understand everything you have to understand the different ways (frequency) 'stuff' vibrates in, cause that's what makes it what it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What the F* & % happened at the end of 2001: A Space Odyssey",
        "response": "The film has an arc: the monolith graduated chimps to humans, and then at the end of the movie the humans are graduated further. In graduating to humans, the chimps develop tools, and later on the tools (HAL) turn against them. In the graduation from human to X, X is left purposefully vague and difficult, the baby at the end basically a metaphor for the evolution and transcendence of human's current state, to something that would understandably be difficult for any of us to comprehend anyway.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know insects don't feel pain?",
        "response": "Well, it's not really right to say we KNOW insects don't feel pain. Because they almost assuredly DO feel pain. The question isn't really \"Do other animals feel pain\", because pain is just a physical and neurological response to stimuli, to get the animal to remove itself from a harmful situation. In that respect they almost certainly do feel pain.  The question really is \"Do animals suffer mental and emotional anguish due to pain like humans do?\" For larger and more complex animals, we are pretty sure that they do. Elephants, dolphins, and apes, for instance. But for animals like insects, fish, lobsters, etc... it's much harder to say. It's a very hard to define concept, and it's tied in closely with consciousness. We just don't know what it's like to be an insect, and what pain is like to an insect. They may simply not have the capacity to understand what is happening, and therefore they are closer to a robot responding to a command than a more complex animal who really grasps and fears what is happening.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the Bible, Jesus tells his followers to sell their cloak to buy a sword if they didn't have one. Could a Jewish peasant just buy a sword like that?",
        "response": "OP, you may also be interested in /r/academicbiblical.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Mongolia succeed in seceding from China while Tibet and Xinjiang, despite foreign support and several attempts, fail?",
        "response": "Was the state of Mongolia allowed to exist to serve as a buffer state between PRC and the USSR?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a person become fluent in a second numerical base system (e.g. Binary or Octal)?",
        "response": "> Could someone learn to perform mathematical functions in a second numerical base, beyond simply converting and processing in his/her native base (probably base 10)? Yeah. It's actually easier to just stay in whatever base you're in, since it's sort of a pain in the ass to do base conversion. If you asked me to do 10010101 + 101001100101, I wouldn't even bother trying to figure out what numbers those are, I'd just do the sum. The processes you do to perform arithmetic don't change when you change bases. If you're doing addition, for example, the process is still just to write the numbers so they're on top of each other, add column by column from right to left, and carry over to the next place if there's an overflow. What base you're in is completely irrelevant to the fundamentals of that process. Not a neurologist or anything, I'm just speaking from my personal experience in doing non-decimal arithmetic (binary and hex).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we determine the pronunciation of dead languages?",
        "response": "Well, for starters, Classical Latin waned, but never completely died out. Vulgar Latin (which was the \"language of the people\") evolved into the modern Romance languages. As far as other languages go, sometimes we have clues based on words that were adapted into other languages or evolved in a predictable way. Other times we have written forms which indicate how they were pronounced. That's, for example, how we know what Shakespeare originally sounded like. He wrote in fairly standard meters (think the \"rhythm\" part of poetry) and rhymed certain words with others which gives clues to how it was pronounced.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do excess food go in a buffet?",
        "response": "It gets reused for the next day. Vegetables become soup for example. Or it just gets thrown away.",
        "source": "sentence-transformers/eli5"
    }
]