[
    {
        "query": "What is 4chan and why is it being banned in so many places? Isn't 4chan just like reddit?",
        "response": "4chan is where smart people go to pretend to be stupid, and Reddit is where stupid people go to pretend to be smart.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know what compounds form the planets and moons we've never visited?",
        "response": "Well, for a start, we *have* visited Titan, [or at least one of our probes has](_URL_0_).  But in essence, we know what far away stuff is made of by doing spectroscopy on it. Different material emit and absorb light at a particular frequencies. The different emission/absorption peaks that can be measured are general characteristic to a particular material (though not always).  Combine this with our thermodynamic knowledge of what it's like on places like Titan, and you can start to understand what physical state the materials are in. So, for example, we know there's liquid methane on Titan because it's so cold there that gaseous methane would condense out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we get paid (weekly, bi-weekly, etc)?",
        "response": "It costs time and money to process paychecks, so it's not economical to do so daily. I worked for a smallish business (90 employees at peak) during the financial meltdown, and going from weekly to bi-weekly pay periods saved the company thousands a year. The owner, who'd grown up poor/blue collar prided himself on looking out for the hourly employees like the guys in the warehouse and wanted them to have money in their pocket each Friday, but a tough economy caused him to change the company policy. On the other extreme, my dad worked for a company that only paid their corporate/exec employees monthly!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did the invention of handheld firearms (muskets, rifles, pistols, etc) coincide with people wearing less armor? Wouldn't an iron suit be even more helpful against a bullet or musket round than against a sword? Why did it take people so long to begin wearing things like body armor again?",
        "response": "To add to the overview provided by u/tiredstars , this [previous answer](_URL_2_?) by me covers the parallel developments of armour and gunpowder weapons in the 16th century, particularly attempts to strengthen armour in the face of stronger weapons.  It is worth noting that the period from the initial deployment of personal firearms in large numbers in the Hussite Wars of the early 15th century to the mid 16th century (when firearms become both more common stronger) plate armour became more common than ever even as it became more metallurgically advanced (and, people like me would say, more artistically refined). It was not the initial introduction of firearms but their further refinement and their mass deployment in the late 16th and 17th century (as well as changes in army composition and tactics that caused the gradual reduction and eventual abandonment of armour.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Donald Trumps campaign front page news? Is it just the pure spectacle?",
        "response": "Because Donald Trump is only in it for the publicity and he's now the ***12th*** person in the clown car of the Republican parties presidential candidates. Everyone knows he's got as much chance to be elected as a fly does flying straight in a tornado. He's in it for the free money, the publicity and the secret service detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it perfectly normal to walk on moving escalators but when they are not it feels super weird?",
        "response": "In one regard, an escalator's steps are taller, and spaced differently than we are used to on a staircase, so this alone presents some unusual sensation as we advance.  Additionally, it is theorized that we adapt to moving surfaces like airport moving sidewalks and escalators, with the expectation of their movement. When our brain perceives we are then moving onto one, the lack of expected movement, we have associated with it through experience, throws us off. So part of our brain is still trying to accommodate the motion which is not present.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were the maps made accurately before the technological advancement?",
        "response": "They literally walk everywhere and charted what they saw. It took a massive amount of time, but it got the job done as accurately as they could have during that period.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people remember there dreams so well and others can't remember anything?",
        "response": "The ability to recall dreams has 2 factors:  When you wake up - you have a sleep cycle that progresses through a number of stages ending in REM sleep (rapid eye movement), REM sleep is when you dream. If you wake up while in REM sleep or soon after you are more easily able to recall dreams.  Norepinephrine levels - norepinephrine is a neuro chemical that aids in memory, while asleep you typically produce less of it. Perhaps your friends produce more of it in their sleeping state than you do.  Why do we have a tendency to forget dreams? Nobody know for sure but a leading theory suggests that remembering dreams might be a disadvantage causing false memories in your day to day life. Say you dream about doing something important but are unable to distinguish between reality and your dream, you might end up not doing something that you should have done because you think you've done it already.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If touch screens use the conductivity of your fingers, and glass is an insulator, how does a tempered glass screen protector allow it to function?",
        "response": "It doesn't use conductivity, it uses capacitance. Two conductors, insulated from each other can hold a charge. Your finger is one of them. Basically a charge on the inside of the screen is distorted by the presence of your finger on the outside. Sensing mechanisms determine the position of the touch.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are courtroom sketch artists still a thing? While I understand not wanting live broadcasts, why are courts still in the dark ages insofar as refusing to allow still photos for historical purposes?",
        "response": "I'm assuming here that you're talking about countries outside the USA, where courtroom photos are legal.  In the UK, courtroom photography and filming are not permitted because live shots of suspects and trials could result in fallacious information being released to the \"outside world\", potentially resulting in courts being defamed and in the worst case resulting in a mistrial. *edit* it is also due to the likelihood that suspects will be less willing to admit guilt or submit verbal evidence if cameras are in the courtroom.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is this \"stripped book\" warning always in books, and how does it actually work?",
        "response": "Booksellers take the covers from books that didn't sell and return them to the publisher for a partial refund.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If cancer kills by depleting the bodies nutrients, why can't we come up with a treatment that directly feeds nutrients into the patient's body?",
        "response": "It also produces toxins, impedes normal function, causes stroke and organ failure. In addition it spreads to other systems so even if it is somewhere where it won't cause any of these problems it will quickly spread somewhere that it will.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does harsh racism/extremism play a role in helping dictators come to power?",
        "response": "Dictators, over time, have taken full advantage of the \"divide and rule\" concept. If a dictator can convince the majority that they are under threat from a minority group, then the majority are much more likely to be passive towards a leader which promises to provide a solution to such a threat.  The documentary [Five Steps To Tyranny](_URL_0_) deals with this in greater detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Does the Sound of Thunder Last Longer Sometimes?",
        "response": "Lightning is a singular event and unless you are staring directly at the strike and the strike is bright/close enough to get a reverse image on your retina, it is basically instantaneous. Thunder is sound and sounds echo. So the extended rumbles you hear are fainter than the original boom and have to do with structures \"near\" you that can reflect the sound waves back and forth. Hence the rolling rumble of thunder.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come there is so much money in golf? Tiger Woods is arguably the best paid athlete, yet no one I know watches golf, and neither has golf big stadiums like football.",
        "response": "It's about who the audience is. Advertisers and sponsors are OK with decreasing the number of consumers if they can reach a richer audience. Golf is more of a sport for the richer set whereas football is more of a sport for working class people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we crave cold water more than water at room temperature?",
        "response": "It's actually cultural. Some drink room temperature water, some even prefer warm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do clocks start in the middle of the night?",
        "response": "The Hebrew calendar, the Islamic and Baha'i calendars end and start a day at sunset, instead of midnight. The standard use of midnight as the start of the day is a consequence of the Roman system of time which divided the daylight time into 12 equal parts, in which the mid-point (roughly Noon) was used as the reference point for the whole day. Times during the day were expressed relative to Noon eg \"2 a.m. meant 2 hours before Noon (nominally our current 10am). They divided night time into 4 \"watches\" of roughly 3 hours each. Under this system, the time at which you cease to be closest to one day's Noon and begin to be closer to the next day's Noon is half way through the night.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how DVRs exist it it's illegal to make a copy of copyrighted material.",
        "response": "Basically, around the time the VCR came to prominence, ~~Congress~~ the courts determined that it was perfectly legal to use the VCR to record programing and watch it later, so long as it was for personal usage. DVR is just the new version of the VCR and it has fallen into the same exception. Edit: Thanks /u/Curmudgy for the clarification!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to flies (and other insects) in the winter? How do they come back after?",
        "response": "Some go into diapause (something like hibernation), some die but first lay eggs which hatch in the spring, some migrate, and some (like bees or ants) hide out and live off resources they've gathered in the summer. A few, like snow fleas (not really insects, but still Arthropods), don't give a fuck and just keep on rocking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the proper way to begin a sentence: One space after the period or two?",
        "response": "They used to teach using two spaces, but one space is the correct way now. Two spaces were leftover from typewriter days.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why tags are located inside the clothing and usually in the most uncomfortable areas?",
        "response": "Tags are located inside clothing so they don't spoil the look of the garment, and they are usually placed on a seam as the printed strip of fabric needs to be sewn in. Places like the back of the neck are going to reliably always have a seam and area easily accessible so they are standard locations for tags.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Americans sent a small force to aid the Whites during the Russian revolution. Was this in-line with the behavior of other nations at the time and other nations' reaction to the revolution?",
        "response": "You might like to look at two posts I have made on this subject, although I'd be happy to answer any further questions.  [This one looks specifically at America's role and motivations in the civil war.](_URL_0_) [This puts it into perspective alongside the other Allied powers.](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that anytime I'm interested/thinking about a certain thing, I find references to them in real life?",
        "response": "Basically you weren't looking for it before, but now that its in your subconscious, you notice and process it, giving the illusion of frequency. This is called the [Baader-Meinhof Phenomenon](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What determines a match for Organ Donor Transplant Surgery",
        "response": "Peoples cells have a special protein that lets their immune system recognize them. It’s like wearing a security badge. When the white blood cells come in contact with the cells, they will “read” the protein to determine if this is should be there or not. If your white blood cells don’t match with the protein it will trigger an immune response and your body will violently destroy the new organ.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people give Al Gore credit for inventing the internet?",
        "response": "They really don't. Some people say it as a joke, but that's it. [The snopes article has more information.](_URL_0_) You only need to read the first three paragraphs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would you explain what the operating system is?",
        "response": "> because he insists he knows more than the guy who not just is a millennial but studies this stuff. He clearly doesn't want it to be explained to him. You've done your due diligence and made a best effort, now is the time to say \"Since you feel you know more than me then you really don't need my help\" and hang up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why Operating Systems are architecture specific (ex. X86 , ARM) but applications are not.",
        "response": "Applications are architecture specific. It's just that you mostly use AMD64 (or x86_64) CPUs with fitting OS and then run x86 applications. Like the name suggests, x86_64 is just an extension of x86 and x86_64 is backwards compatible.  You just can't mix both in one application. That's why your Windows has a System32 directory and SysWOW64 directory. The 32bit stuff is in the latter, the 64bit stuff in the former. (thanks /u/AdarTan) An ARM application simply wouldn't run on the x86 architecture. At least not a native applications which is why Java or .Net applications run on everything that has Java or .Net. The Application itself is not compiled (translation from source code that humans can read and write to 1s and 0s) for Windows or AMD64 but for the Java Virtual Machine (and whatever Microsoft calls their .Net stuff) which is a virtual machine that then runs your application with code for your platform (CPU architecture and OS).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How would CO2 and Helium react inside a balloon?",
        "response": "As an approximation, helium is 14% as dense as air and CO2 is 57% denser. A 50/50 mix would be 85% as dense as air and float up, while a 3:2 mixture of CO2 to He would be neutrally buoyant.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The British \"Sir\" title, as in Sir Ian McKellen and Sir Patrick Stuart",
        "response": "There are a variety of different honours that can be given to UK citizens. One of those is being knighted, which allows a man to put \"Sir\" before his name, or a woman to put \"Dame\". Completely separate to that are the Orders of the British Empire, which are ranked from lower to higher as: * MBE (Member of the Order of the British Empire) * OBE (Officer of the Order of the British Empire) * CBE (Commander of the Order of the British Empire) (there are two ranks above this ([see Wikipeda](_URL_0_)) but very few people have them). Both Ian McKellen and Patrick Stewart have been award knighthoods; Ian McKellen has also been awarded the CBE whereas Patrick Stewart has an OBE. ----- Edit: just to clarify, you can be knighted without having any of the *BE honours, and you can be awarded one of the honours without being knighted. They are completely separate from each other in that respect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My dad met a man from Ethiopia recently who told him that in the 80's and 90's the Russians came and took thousands of Ethiopian children back to Russia.",
        "response": "The Soviet Union invited many hundreds of thousands of young people from African or other Third World countries to study in the Soviet Union. Most often this would culminate in college-level education at Patrice Lumumba University in Moscow. The intent of this program was to improve the reputation of the Soviet Union among these African and other non-aligned states, demonstrating the generosity of the USSR. Additionally, it was expected that these students would return to their home countries and positively represent the Soviet Union and communism in their home countries. Young Ethiopians did participate in this program and attended Patrice Lumumba University through scholarships. I believe this is what the man your father spoke to was speaking of. I have never heard of the forced abduction of Ethiopian children to the Soviet Union. [this book](_URL_2_) [this one](_URL_0_) [and this book](_URL_1_) have brief discussions of Patrice Lumumba University.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do a lot of laptops/computers get slow after only a couple of years, but my 8 year old Xbox 360 is still running smoothly?",
        "response": "new software is built for new computers, and thus tends to get progressively resource-hungry more resources become available.  A ten year old computer running ten year old software will run like it did when it was new, give or take depending on how dirty the cooling system is.  Software made for the Xbox is made for a single hardware platform that never changes, so new software is required to run well on it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any theories on what quarks are made of?",
        "response": "According to our current picture of particle physics we have, quarks are elementary particles. Everything is made out of elementary particles, such as quarks, electrons, neutrinos, gluons, photons, and some more obscure particles. These particles don't have any substructure that we know of. If string theory is true, then all of these particles are actually tiny strings, that vibrate in different ways. The exact form of these vibrations is what gives those particles their properties, such as charge, mass, spin, and so on. In this case, the only elementary object would be the string.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does everyone on Reddit seem to hate Norton?",
        "response": "Because it's overly bloated an gets into everything on the computer, slowing down processor times and HDD read times. It's also a HUGE pain in the ass to remove. There are plenty of completely free antivirus programs out there, that do the same thing as Norton, and use a fraction of the system resources.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people tap their glass on the bar before taking a shot?",
        "response": "American bar employee here: Ive always thought of it to represent respect to the bar you are in. After a cheers with everyone else, everyone taps on the bar as a sign that they hold the bar in some high regard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Human/Animal transplant possible?",
        "response": "We've done this many times. [One story here](_URL_2_) A lot of tissue today still comes from animals. Heart valves from cows/pigs are still in use for example. Even [PBS](_URL_4_) did a special not that long about this exact topic as well. (Albeit with some terrible biases and less of a focus on the science)  A limb however, is a much much greater challenge, and presents many more risks than the things that we have so far accomplished. [Xenotransplantation](_URL_3_) has many risks and other concerns associated with it. As a related aside, check out this story: [Dr. Robert White transplants monkey heads](_URL_0_) or [Dr. Demikhov makes a two headed dog.](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that uploading is always so much slower than downloading?",
        "response": "Upload speeds aren't necessarily slower than download speeds, they're just intentionally slower for your average home internet connection because you don't need huge upload speeds. If you're watching a movie on Netflix, you just have to send a few dozen kilobytes telling them what movie you want to watch and then you'll receive several gigabytes of data, so you're receiving thousands or millions times more data than you're sending.  So say the average home user's connection can handle 20Mbps in total, having a symmetrical connection with 10/10 up/down means that most of the upload speed is going to waste most of the time, because they barely upload anything, but it means their download speeds are slower so it takes longer to download the latest movie/game/whatever. With speeds something like 2/18 up/down, the average user notices next to no difference other than their downloads taking half the time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big would a sphere (or planet) of water have to be for ice to form at the core?",
        "response": "You must specify what temperature this sphere should have to be able to answer the question. If it was just put in empty space it would cool to close to the absolute zero temperature and freeze no matter what the size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do accents develop?",
        "response": "Naturally, as we are raised, our mouths begin to form so that we communicate comfortably with the vowels and sounds we’re used to. But when we’re confronted with a different environment with a different language and set of linguistics, our mouths struggle to perfectly imitate the sounds, thus, the accent is created",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is the calorie content of food determined?",
        "response": "A calorie is a unit of energy, specifically how much energy is needed to heat one gram of water 1 degree celsius. I should note that if you're American, when talking about food, what's measured is actually a different unit, kCals, which measures the energy required to heat one kilogram of water by 1C (so one calorie in the US = one kCal). You can calculate the amount of calories in food by literally burning the food completely and measuring the resulting change in water temperature.  How many calories are in food stays constant, but how well the body is able to process them varies dramatically. If you have a diet high in refined sugars, you will be better able to process sugary foods and take in more of the potential energy than someone with a different diet. ^[1](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were Crusader Castles built quickly enough and strong enough to remain effective?",
        "response": "They weren't always made from scratch. Krak de Chevaliers, perhaps the most famous 'Crusader Castle', was built by Kurds before the crusaders arrived on the scene. Raymond IV of Toulouse went to it, found it was deserted, and decided to take control of it, but then abandoned it later and Tancred, Prince of Galilee, got it. Although this is information you can find on Wikipedia, I thought it was worth sharing because it's an approach you might not have thought of using.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a trans-woman who is attracted to women, come to the conclusion that she should have a female body? (sorry if I am causing offence)",
        "response": "Her attraction to women has nothing to do with her desire to want a female body. She is trans. The body she as born in is not the one that she identifies with. That causes her distress in the form of dysphoria. That is why she wants to change her body to reflect her gender.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Top Gear presenters travel to many different countries to film their antics. ELI5 how they obtain permissions to work in all the different countries they travel.",
        "response": "They just get work visas. A Visa is essentially a little piece of paperwork that gives you the ability to work in an area for a specific amount of time. And are relatively easy to get if you have any sort of sway (which Top Gear does) It's no different than the survival shows, cooking shows or travel shows that go around the world. They decide on a destination, contact that country's immigration office and make the arrangements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Alka-Seltzer tablets expand when heated?",
        "response": "Alka-Seltzer tablets contain citric acid and sodium bicarbonate. When dissolved the two chemicals mix and begin a chemical reaction that produces carbonic acid, this rapidly converts into water (liquid) and carbon dioxide (gas). In the solid form these chemicals do not mix enough for this chemical reaction to proceed. What likely happened is the sodium bicarbonate (NaHCO3) decomposed into sodium carbonate (Na2CO3) which occurs at about 122 degrees Fahrenheit (50 degrees Celsius).  This reaction proceeds as follows: 2 NaHCO3 (solid) -- > Na2CO3 (solid) + CO2 (gas) + H2O (liquid) The tablet wouldn't require much of the sodium bicarbonate to decompose to fill the volume of your packet. That's is why the tablets still look new and are probably still good to use if needed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do professional painters typically wear white, rather than a color that stains less easily?",
        "response": "So if you spill a bit on you, you can see it and don't go traipsing paint around the clients house.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the oldest known religion?",
        "response": "Here are two similar questions with extensive answers: [What is the earliest religion that we know about and what did they believe?](_URL_13_) [What is the world's earliest known form of religion and what did the group believe?](_URL_12_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What was Nassau like on a day-to-day basis in 1717-1718?",
        "response": "Have you consulted the *Journal of the Bahamas Historical Society*? IIRC, they publish annually. You might simply call the society and ask for their recommendations.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did ancient people know why were planets and what weren't?",
        "response": "The word \"planet\" is derived from the Greek word \"Planeta\" which means \"wanderer\".  If you look up at the sky *a lot* you'll notice *most* stars stay in their own constellations.  But a *few* of them (five, to be exact) \"wander\" around in their *own* patterns.  Now naturally they had no idea what that meant or why they did it, or that they were different in any way than any other star.  And the gods were not named after the planets, it's the other way around. And the names we have for them now are a mix of Greek and Roman gods.  By the way, an easy way to tell if it's a planet or a star you're looking at is stars twinkle, planets do not.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you sometimes react with smiling/laughing to shoking things?",
        "response": "I'm not a biologist so I can't 100% comfirm this, but I've heard that it's a coping/defense mechanism after-the-fact. The unvoluntairy laugh is basically an *I survived* reaction, you usually only start to laugh *after* already being frightened by a jump scare for instance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Other than the 1953 coup d'etat in Iran, what were some of the catalysts that spawned a wave of anti-American sentiment in the Middle East during the 20th century?",
        "response": "Sayyid Qutb's brief residency in the United States led him to criticize the culture of the West and deeply associate it with America. As a scholar, Qutb was influential in the development of Islamist groups in the 1950s and '60s (including ideological fellow travelers in Wahhabism in Saudi Arabia). Qutb's persecution under Nasser (Qutb was Egyptian) for his unwillingness to cooperate with the latter's secular coup led to his martyrdom in 1966, but the most enduring of the former's writing was his anti-American tracts.  See: Laurence Wright, The Looming Tower: Al-Qaeda and the Road to 9-11.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Rule against perpetuity",
        "response": "Short version: Your interest in a property ends with your death. You cannot make rules for what happens long after you die. So you couldn't, for example, pass down a property in your will with the condition that it never be sold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When film runs through a projector at high speed, why do we see a clear picture rather than a continuous blur?",
        "response": "There is a shutter that closes while the frame is advancing. It is timed to open/close so that light does not go through when the image is advancing to the next image.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Do Conservatives “Conserve”?",
        "response": "It is derived from a conservative desire to keep the status quo. They conserve the traditions of the past.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why has Twitter had the shittiest possible video playback system ever for so long?",
        "response": "Because it wasn't designed to do streaming they added streaming as a secondary service not primal service. Is like asking why this sandwich can hold the soup very well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does using cotton swabs to clean the inside of your ears feel so good? Is there an anatomical reason why the inside of the ear is so sensitive?",
        "response": "I know this doesn't answer your question, but I figured I should mention the fact that cleaning inside your ears is no longer an acceptable practice. Here's why... First of all, wax is intended to protect the ear by sticking to foreign bodies and preventing them from going deeper into the canal. Wax also acts as an antibacterial and helps prevent infections! But if you don't clean them, won't there be TOO MUCH wax?... Rarely. Our ears are designed in such a way that wax is constantly being pushed out on its own. By sticking Q-tips in your ear in an attempt to clean them, you are really just pushing the wax deeper. This could cause the formation of a plug, which can lead to conditions such as decreased hearing, tinnitus, and vertigo. Not to mention every time you stick something into the canal you run the risk of permanently damaging your ear drum. Although it feels good (so, SO good)...do yourself a favor and reserve those fluffy swabs for external ear cleaning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are domesticated animals like cats & dogs conscious about gaining weight? Do these animals \"feel the need\" to lose weight like humans do if they ever become too slow?",
        "response": "The answer is probably not entirely scientific, but why would they? Animals don't understand that if you eat too much, you gain weight. They don't make plans that take months to work out. They don't conceptualize looking fit for a partner. Animals do not become fat in the wild, so there is also no instinctive response to becoming fat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we afraid of death?",
        "response": "Because it has an evolutionary benefit. Creatures that fear death are more likely to avoid it, and thereby survive to pass on their death-fearing genes to the next generation. Those genes become more common in the population and in time, every member of that population will have a fear of death.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Vacuum fluctuations: When a pair particle and antiparticle is \"created\" and \"annihilated\" how does that maintain an energy balance at all except for an electrical charge balance?",
        "response": "~~Energy is definitely not conserved in general upon the creation/annihilation of a particle/antiparticle pair. Vacuum fluctuations lead to the creation and annihilation of virtual particles, which you can think of as arising due to the time-energy uncertainty principle. Because these events do not conserve energy, virtual particles are very short-lived.~~  Edit: Particle physics not being my specialty, I'll defer to ignatius's opinion on this, please see below.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do rivers meander?",
        "response": "I'm not an expert but... Water takes the path of least resistance. So if the ground is lower in one spot vs another, that is the direction the river will take. Or if the ground is softer or more prone to erosion, that will help to guide the path of the river.  Once the river is bent, the erosion will be strongest on the outside of the curve, which will cause the curves to become more and more pronounced over time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do satellites handle so many simultaneous connections?",
        "response": "Most satellites simply broadcast one signal for all to receive. All the different gps-receivers or tv-receivers are simply picking up the same signal. It doesn't matter to the satellite how many are receiving it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In video games, why does the car you are driving appear more often around you?",
        "response": "Games have limited memory and when you are driving a car that model is in the local memory. It is much easier for a game to generate more of something that is in the memory then pull new things up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we recognize people when they are too far away to see distinct details?",
        "response": "We use a whole host of cues. One surprisingly effective cue is (biological) motion - how we walk ([Troje et al, 2005](_URL_0_)). For example, have a go playing with the [biomotionlab app](_URL_1_) to see what information you can extract from basic modes of articulation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does long term silence or lack of speech (as some monks vow, for example) damage or atrophy the vocal chords or other means of speech?",
        "response": "Speech therapist here! It would be virtually impossible not to use to muscles that produce speech by adducting and abducting your vocal folds in your daily life. Your vocal folds protect your airway, so anytime you cough or clear your throat, you are pushing them together, just like you do for speech. You also build up subglottic pressure by adducting (pushing together) your vocal folds to aid in activities such as lifting weights or pooping. So yes, anytime you poop, you are using your speech musculature.  Consider trach patients who have not been able to use their voices for long periods of time. Yet when a speaking valve is placed over the trach, they can usually produce voicing despite months or even years of not talking.  Keep in mind that muscles tend to atrophy as we age, so it is reasonable for mature adults to present with vocal fold atrophy/edema even with regular use: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which is more efficient, keeping my house at a constant temperature even when I'm gone, or repeatedly cooling and heating it?",
        "response": "Letting it cool and heat back up is always more efficient. Same goes for pools.  Reason is the rate of heat loss is proportional to the difference between the inside and outside temperature (assuming cooling is just by conductance). So imagine a plot of your inside temperature over the course of the day (x-axis being time, y-axis being difference of inside and outside temp). The plot of \"rate of heat loss\" looks the same, just scaled by a constant.  The area under this plot is the total heat energy lost from the house over the day. Letting the inside temp dip when you're not there and then warming back up can only decrease this area.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the etymological/biological purposes of having different names for every group of animal (e.g. a “murder” of crows or a “pod” of whales)?",
        "response": "There is no biological purpose for how humans name a group of animals. Really, it is only grammatical. By having different terms for the groups (litter, pack, murder, pod, pride, etc) we are able to reference the group without necessarily or repeatedly mentioning the type of animal. Usually, one would mention \"murder of crows\" the first time, but if you have to say it a second time, you can just mention \"the murder\". But it holds no purpose or significance outside of the literary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people so hateful on social media outlets and online video games?",
        "response": "Kind of answered your own question there. If someone expresses their opinion IRL then they are far more likely to be embarrassed if someone disagrees with them. It's akin to 13 year old kids on Xbox live calling the one black dude in the game the n word. In real life they would NEVER do that because said dude could just beat them up but they can't over XBL. The same thing applies to online comments and social media.  In real life you can't just delete what you have said but online, to a certain extent, you can.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come fat people aren't extremely strong? They carry extra weight all the time.",
        "response": "I think there are misconceptions about fat people. As someone who has dissected a large number of human cadavers, take my word. Fat people have more muscle than their skinny counterparts. However, there are two general types of muscle. Slow, long acting muscle and fast explosive type muscle. Fat people have their fat all day, thus they develop hypertrophied slow muscles, while not necessarily developing their fast muscles. Therefore they may not have the fast musculature necessary to perform classic feats of strength such as arm-wrestling or carrying very heavy things. Of course fat people who work out a lot (e.g. football players) are working out with a heavier burden and as a result, they will develop their fast type muscles quicker than scrawny people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does our body know what tastes good/ bad and what smells good/bad. Are we born with this instinct or is it something we learn",
        "response": "There are several systems that work to 'teach' flavor to humans. Starting with the [amniotic fluid]( _URL_1_), babies begin to taste some of the flavors in the mother's diet.  Next, human milk contains casein a protein which (in other mammals/ not yet observed in humans) breaks down into [Casomorphin](_URL_0_). This endogenous morphine causes newborn mammals become addicted to milk. The milk (of humans and other mammals) has the flavor of the mother's diet, so when the offspring is old enough to interact with solid food, they have been trained to accept the flavor.  In humans there is additional training and socialization, for children to accept the avaliable food souces.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why the USA doesn't use the metric system.",
        "response": "We wanted to once, but then realized it would cost money to change everything over and, strangely enough, that deterred us.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can humans generate random numbers?",
        "response": "I'm going to try really hard to find it, but there was an experiment exactly aligned with this idea: Participants were asked to imitate a 50/50 probability. They were able to consistently approach 50%, but when smaller patterns were analyzed (H, H, T or H, T, H) they were off.  Basically, all of these smaller patterns should have a certain distribution, and at this level humans cannot generate these probabilities. In the experiment, they favored certain patterns. EDIT This is known as frequency stability. I hope this helps!  EDIT [this video](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is actually happening to sperm when it touches your skin? do billions of them just go into your pores?",
        "response": "skin is designed to keep foreign material out and it does a rather good job... if the sperm could get in through your pores, imagine how susceptible we would be to many protozoa, bacteria, and viruses. i dont imagine there is a gamete invasion going on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we estimate that the golden record on Voyager will last a billion years?",
        "response": "Well currently both Voyagers are in interstellar space, and in the start of the 2020s, Voyager 1 is going to lose signal, and power. The golden record is an interesting topic, and I read a cool [article](_URL_0_) about it recently. As far as it last a billion years, we would never really know. There is of course not that much to hit it, except of course some dust. In fact, the record actually contains a piece uranium that can be used to date it. For all we know, some other life form could find it before a billion years has actually passed. Could probably always get hit some rock anyways, although that chance is extremely small. Edit: I'm amazing at spelling, and grammar.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come salt crystals don't form on beaches?",
        "response": "Because most beaches are an open system with relation to the ocean, so evaporation cannot proceed to the extent where seawater becomes supersaturated with respect to salt. What you need is an environment where the concentration of salt exceeds the solubilty limit.  You get those conditions in coastal salt flats and sebkhas. There, circulation is restricted and evaporation can bring salinity into the range where salts can precipitate.  You need a pretty high evap coefficient to precipitate salt by the way. Most evaporite orthochemical precipitates are sulphates such as gypsum. With more intense evaporation, the precipitattion passes from gypsum and anhydrite, to salt, to sylvite.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Best Biography of Andrew Jackson?",
        "response": "Robert V. Remini wrote a monumental 3-volume biography on Andrew Jackson: *Vol. 1 The Course of American Empire (1767–1821)* (1977); *Vol. 2 The Course of American Freedom (1822–1832)* (1981); *Vol. 3 The Course of American Democracy (1833–1845)* (1984) *The Life of Andrew Jackson* (2011) is an abridged one-volume edition of Robert V. Remini's 3-volume biography.  *Andrew Jackson: His Life and Times* (2005) by H. W. Brands is a comprehensive one-volume biography. If taking on 3-volumes written by Remini is too tall a task then go with this biography. *The Age of Jackson* (1945) by Arthur Schlesinger Jr. is a historically important interpretation of the Jacksonian Era.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why don't we have a picture of our face on credit card?",
        "response": "I used to have a debit card back in the late 90s that had my picture on it. I don't know why they stopped doing it but they did do it at one time. It could be people didn't want their picture on the card or maybe the banks didn't want the extra expense.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do mushrooms need such an excessive amount of water to thrive?",
        "response": "Because it is not excessive. They evolved to grow in extremely damp places and so utilize that volume of moisture. To not be capable of doing that would have meant that they were less efficient than those that could and so they would be out-competed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't the fast wood workers who protested today simply lose their jobs?",
        "response": "Strength in numbers. If one or two people walked off, that's certainly what would happen. But the whole object of the protest is to get so many people that the company can't fire them all without shutting itself down, at least temporarily until they can hire and train new workers. Fast food isn't exactly complex, but it takes time to hire and train someone who doesn't know your system. Even if you worked at, say, Burger King you can't just walk into a McDonald's and hit the ground running, you need to learn how they do it there.  This is basically the same theory behind strikes; if enough people stop working together, it is cheaper for the employer to negotiate than to fire them all and start over with new people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the laws surrounding entering sewer systems in cities? Since there are no 'no trespassing' signs, are we free to open manholes and enter sewer systems?",
        "response": "Like any other laws, they are subject to local differences. Just like you can't walk into someone else's home uninvited just because there's not a \"no trespassing\" sign, or can't hop a fence at a military installation if there wasn't a \"Do not enter\" sign on that particular fence, doesn't mean it's legal to trespass. If you have to open a manhole cover or bypass a fence in order to access something - that's common sense that you probably shouldn't be there.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it easy to close a jar, but sometimes incredibly hard to open?",
        "response": "There's all sorts of things that make jars hard to open. * You can spill stuff on the rim & it dries up, glueing things in place. * Temperature changes can cause the metal lid to contract faster than the glass does, making it physically tighter * Temperature changes can make the air inside contract causing the lid to get sucked down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that whrn looking for potential alien life on other planets, scientists always look for water and oxygen?",
        "response": "They only look for water. It's conceivable that life can exist without oxygen (indeed, there are plenty of organisms that don't need oxygen to live), but not water. It has many properties (adhesion, cohesion, polarity, high specific heat, etc.) that make it ideal for supporting life, and it's difficult to imagine another \"working fluid\" that could support life as well as water does.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the best the best way to transmit data Voyager deep into space with today's technology?",
        "response": "We currently have probes around Mars (Mars Express, MAVEN, etc. etc.), Venus (Venus Express until 2014, currently Akatsuki), Jupiter (Juno). Cassini was orbiting around saturn for a decade and ended just earlier this year in september. The Dawn spaceprobe is currently in orbit around the Dwarf planet Ceres in the asteroid belt (after already having explored Vesta). The New Horizons mission famously explored Pluto and is now on course to fly by the kuiper belt object (486958) 2014 MU69. BepiColombo will be launched in the next year to explore Mercury and the Juice mission will launch in 2020 to explore the moons of Juptier. There is also missions on the way to other asteroids. A comprehensive list can be found here: [List of Solar System Probes](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/how did Rage Comics die out so fast?",
        "response": "They were really well done at first, then the Facebook/9gag crowd caught on and quickly ruined them for everyone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do different programing languages exist? What makes one more suited for one task than another?",
        "response": "The same reason different cars exist - some of them are vastly different and have different usages, while some are similar but have minor differences that make one preferable over another for some people.  For example, Java and C have the same basic syntax, but are very different. Java is object oriented and memory managed, while C isn't. This makes it easier to write complex and dynamic software in Java, but makes C much more low level, allowing the programmer to better interact with the hardware or write more efficient programs (theoretically).  Another example is Java and C#, which are very similar, but developed by different companies, Sun (now Oracle) and Microsoft. Each one has some features that are useful, for example Java is very cross platform (the same program can be run on different platforms such as Windows, Linux and Mac) while C# is less so, but C# has very good GUI capabilities and other features that Java doesn't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I break a weed's leaves off without getting the roots, am I making the roots work harder for nutrients and therefore jeopardising my nice plants?",
        "response": "The weeds won't work harder for nutrients but they will grow new leaves while at the same time the roots will grow bigger and deeper, making it that much harder to get the roots next time. In addition, every time you pull a weed up, you turn the soil over in that area exposing 100's of more weed seeds laying dormant in the soil. Best to approach weed control from a bigger picture perspective by using landscape fabric or layering with cardboard (lasagna gardening - _URL_0_) and mulch when you create the bed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does putting bread in the container keep cookies soft?",
        "response": "Cookies go stale/hard because they lose moisture. The cookies absorb the moisture from the bread, which keeps them soft. When the starches in the cookies lose water, they crystalize. Crystals are hard. Water makes them soft again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, in movies, do nurses flick needles?",
        "response": "They are removing bubbles of air from the needle (which can stick to the walls due to capillary action). After flicking it they will also often squirt out a small amount of liquid to ensure that the air has been removed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- If camera lenses are circular, why are pictures rectangles?",
        "response": "The lens is not what actually captures the image. The lens focuses the light and allows it in to whatever type of sensor you are using, such as a CCD for a digital camera, or chemically treated film for an old camera. It's the shape of the sensor that determines the shape of the photograph.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did \"Southern Gentlemen\" of the 19th and 18th centuries procure and keep ice for their Iced Tea?",
        "response": "Cut a big block of ice out of a lake in the north of the country, and have it carried to you in the south before it melts. If you get enough big blocks and stick them in a cellar there will be some ice all year.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does one discern which foods are healthy and which are to be avoided/limited in a society with constantly changing/conflicting information?",
        "response": "it's hard. however, there is a whole bunch of stuff that is totally consistent, never changing. For example, eat a bunch of vegetables. Eat less meat, especially red meat. Eat a moderate amount of carbs and favor whole grains. Beans are awesome. So on and so forth. If you pay attention to very specific considerations like the status of bacon (I pay a lot of attention to this) it can get complicated. But...if you in 1975 \"i want to eat the best diet possible\" the differences to now wouldn't be that much. If you said \"i want to each a ton of things that I really, really like - which of those are on the OK list from my top 10, then...you might see differences. Our perspectives on fats have changed, but we don't need all that much fat. Our perspective on red meat has changed, but we don't need that much meat at all.... so on and so forth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for two colliding neutron stars to be sufficiently low-mass that a black hole does not form?",
        "response": "Probably. The maximal mass of neutron stars is poorly known. The minimal mass is somewhere around 1.1 solar masses, although white dwarfs can exist up to 1.4 solar masses. The upper limit is somewhere around 2-3 solar masses. [Wikipedia discusses this in detail with many references](_URL_0_). 1.1 + 1.1 minus a bit of gravitational waves would generate an object with just a bit over 2 solar masses, probably low enough for a neutron star. 1.4 + 1.4 minus gravitational waves is more difficult already, as it is further away from the most massive observed neutron star and much closer to the theoretical limit.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the deal with parabens?",
        "response": "They're xenoestrogens so they act as an agonist at the estrogen receptor, creating an effective increase in estrogen levels.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Which naturally occuring substance has the least disparity between its freezing and boiling point?",
        "response": "Freezing and boiling points are pressure dependent, so this discussion only makes sense if you're specifying a pressure. Furthermore, it's completely possible for a substance to go directly from a solid to a gas, in a process called sublimation. [Water can do this](_URL_0_) if you decrease the pressure to below 600 Pa. Even at surface pressure, there are plenty of substances that can undergo sublimation, such as CO2.  So the answer to your question is \"lots of them\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Personal hygiene in Victorian England",
        "response": "Are you sure that you're thinking about the Victorian period? This, after all, was a period in which indoor and outdoor plumbing became increasingly common and sophisticated. Soaps were cheap and advertised relentlessly in the press. Cleanliness, moreover, was celebrated as a key aspect of respectable Englishness and central to the so-called 'civilising process' in imperial territories. I'm sure there were plenty of people who bathed fairly infrequently in the nineteenth century, but its certainly not a period I'd associate with markedly poor personal hygiene.  Are you thinking of the Elizabethan period?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were the colors red, yellow and green chosen for street lights?",
        "response": "I believe railways were using red signals for \"stop\" and green for \"go\" long before street lights were invented, but that just pushes your question back in time without really answering it. I'm not sure of all the details, but red seems to be an almost universal symbol for alarm or danger among humans and even some other species, so it seems like a natural choice for \"STOP OR YOU'LL DIE!\" Green is red's complementary colour, and often represents life and calmness to humans, so it makes sense for \"GO AHEAD. EVERTHING'S GOOD.\" Yellow? Your guess is as good as mine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does the water go when we accidentally choke on it?",
        "response": "It is going down the wrong tube, towards your lungs. However, your body has very strong defenses against this, which is what the choking sensation is. Ideally as a result of your sudden violent reaction, it is forced back up so that it can be swallowed normally.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there an upper limit to the size of a black hole?",
        "response": "Basically what they're saying is that processes in the accretion disk limit the rate at which mass can enter the black hole--basically throwing more mass at it will not cause it to enter the black hole any faster--and if you assumed that a black hole had been gaining mass at that maximum rate since the start of the universe, that's the size it would have reached by now. If a black hole continues accreting mass, then obviously the maximum size of black holes will increase, and it's broadly estimated that 1-10% of a given galaxy's mass will eventually enter its central black hole over the next 10^30 years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the odds of seeing 10 winning baseball games in a row?",
        "response": "I'll assume that in each game, there was a 50-50 chance that the Jays would win (not an unreasonable approximation). If there is a 50-50 chance as to which team will win, the odds of the Jays winning all 10 is 1 in 1024. This comes from (1/2)^(10). Note, however, as you went into this year already knowing that the Jays won the first 9 games, if you ask what are the odds that the streak would extend from 9 to 10, that is just the odds of single win, which is 1 in 2 (in the approximation I'm using).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any history basis for the traps in tombs you see in Indiana Jones, Tomb Raider, etc.?",
        "response": "Like Indiana Jones deals with? No. Tomb builders weren't stupid: even if they had the capability to build such elaborate traps they would have known that any given mechanism can't last terribly long. It is sometimes reported that the tomb of Qin Shi Huang came equipt with crossbows cocked and ready, but he is such an easily mythologizable figure that I wouldn't trust much that you read about the tomb. This isn't to say that they didn't take precautions. A fairly common example would be false bottoms, where a platform looks like the bottom of a tomb so any robbers would stop there--Shen Kuo's tomb has a fairly typical example. And in some cases it is possible to interpret human sacrifices as posthumous guards, but this interpretation is not without problems.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would one arrow shot from a bow hit with the same force as three arrows shot from the same bow with one pull?",
        "response": "Not really. A bow is an energy storage device akin to a spring. As you pull the string back, you store potential energy by bending the bow. When you let go, that potential energy is converted to kinetic energy in the arrow.  In general, using three arrows instead of one means that you would be using the same total amount of stored potential energy to accelerate three arrows, meaning the kinetic energy would be divided among them (minus some small amount lost to accelerate the bowstring, dissipated as the bowstring vibrates after the shot). They would not be moving with the same velocity, so they would not hit with the same force.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Changing \"baseline happiness\"",
        "response": "Dropping this off here. [Journal of happiness studies](_URL_0_) I haven't looked at it, but seems like a good place to start looking. It appears to be sort of open access as well.  **Discussion below** I was brought to this while googling for a project I heard about long time ago. I recall some professor(MIT, Carnegie Mellon?) who was a using machine learning and self-reported survey data to try to change his own happiness level. As in, he would do stuff, fill out surveys, put it into the machine learning algorithm, and it was supposed to spit out what he could do to be happy. Can't find it unfortunately. Also, I imagine some Drugs will change a person's Baseline Happiness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does wool make you itch?",
        "response": "I think it has something to do with the microstructure (is that a word?) of the fibres. Here is a picture i found of different fibres: _URL_0_ (a is wool, b is mohair, c is cotton, d is silk and e is linen). I think the answer will be a little be clearer if you compare the wool fibre to the cotton and silk fibres. The wool looks almost scaly, which would probably catch and irritate the skin more, whereas cotton and particularly silk are much smoother fibres that are less likely to catch and irritate the skin.     tl;dr wool fibres are scaly and ridged, cotton is smooth",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Copyright law and how Disney is/has affected it so much",
        "response": "Copyright law used to be that your heirs would own the intellectual property rights to anything you created for a certain number of years following your death (last I heard was 70 which seems adequate to cover children and probably grandchildren).  Disney has been lobbying to extend this repeatedly to prevent anyone else from putting three black circles on a t-shirt in a Mickey Mouse configuration, to make sure they maintain a monopoly on such t-shirts and can sell them at ridiculous prices.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Vietnam a generally Pro-US nation even though the victorious Communist Party has been in power since the end of the Vietnam War?",
        "response": "Excuse my ignorance but I don't really think of Vietnam as a \"pro US\" country. Do you have any evidence of this?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it theoretically possible to make an atom so big that its nucleus is visible with the naked eye?",
        "response": "No, not possible. There are limits to how stable a nucleus can be. The residual strong force helps keep it together, but adding more and more protons and neutrons causes some issues. This is because the strong force is unlike the electromagnetic force. The strong force does not act at infinite distances, so packing more protons together will lead to an inevitable repulsion. The limit for nucleus size is predicted to be somewhere around a proton number of 170-200.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were potatoes such an important part of the Colombian Exchange but things like yams were already available in west Africa?",
        "response": "potatoes could be grown in Europe, and therefore caused something a food revolution. Up until this point the staple food of Europeans was grain (and products such as bread), this was only harvested in late summer/Autumn Potatoes could be harvested much earlier meaning there would be less of a gap in food production. they also did not require as much preparation, like when we compare making bread, to cooking a potato. if you want to learn more there is a book called the history and social influence of the potato",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do lakes and landlocked seas get populated with aquatic life?",
        "response": "An important thing to remember is that bodies of water that are cut off from other water often were connected in the past.  Sea levels were higher in the past, connecting currently isolated bodies of water. Large scale flooding does the same.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did alternative names originate and why do we use them? I.e. William=Bill, Robert=Bob, Richard=Dick etc.",
        "response": "If you go back to the Middle Ages and earlier, in many cultures there was a fairly limited slate of first names in use, and often people wouldn't have a last name (last names didn't start to be \"a thing\" for non-nobles until the middle ages). A town or even a family might have multiple people with the same name -- multiple Williams or Richards or Margarets. And so diminutives developed -- one person would be known as William, another as Bill, another as Billy, another as Liam, another as Will, and so on. Not all that different from modern teachers who might take two students and call one William H and the other William C, but less formal.  So it's generally these older names that have the variants, just to tell people apart hundreds of years ago.  William, Will, Will, Bill, Billy, Liam Margaret, Marge, Meg, Megan, Meggy, Peggy, Peg Robert, Rob, Robin, Bob, Bert, Bobby Richard, Rich, Rick, Dick, Ricky, Dicky, Richy Elizabeth, Eliza, Liz, Liza, Beth, Betty, Bet",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are people double-jointed?",
        "response": "Being \"double-jointed\" is a misnomer, the correct term is hypermobility. There are various causes that can cause this and can vary in severity which is why some even among those with hypermobility there is a large degree of difference. Some people just have \"stretchy\" tendons others have joints with altered bone structure etc. _URL_0_ E: added source",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the sun bleach everything in space?",
        "response": "It depends on how the material gets its color. The reason the flag is now bleached is that the dye used to make the colors were susceptible to absorbing UV and reacting. This reaction breaks the [color congujation](_URL_0_) of the molecule and it no longer reflects the same colors. Not all materials are at risk from this kind of UV chemical reaction and may get their color from other sources. Gold for instance gets its gold color directly from it's atomic and lattice structure, all things being equal, UV won't affect gold in this way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how can someone have an allergy to eggs but not to chicken?",
        "response": "Allergies are almost always to specific proteins. The proteins in eggs causing the allergic reaction are different from the proteins in the meat itself",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly happened (legally) that caused 18 states to recently legalize gay marriage, and why does this not apply to other states where gay marriage is not legal?",
        "response": "What the Supreme Court actually did was decline to hear appeals of decisions supporting same-sex marriage. This means that the lower-court decisions stand. So in areas where those lower courts have jurisdiction, same-sex marriage is now legal by default. Other states are in other jurisdictions, and aren't affected by the same cases and appeals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that my brain can spend hours focusing on learning the ins and outs of a video game (ie- League of Legends), but when it comes to calculus, I want to stop after only a few minutes?",
        "response": "Video games are designed specifically to provide constant and immediate positive feedback to the player. All the flashing lights, cool abilities, fun sounds, are all very well received stimuli for your brain. And on the other side you have calculus.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What runs the internet? Is it just a collection of servers? Is there any single place, that if destroyed, would destroy the internet?",
        "response": "The Internet itself was designed to be completely distributed. It's mostly just a collection of servers, with routers that all figure out the routes to the different servers on their own. The only largely centralized piece of this is the Domain Name System- the thing that turns URLs into IP addresses. If you took out all 13 clusters that make up the root of that system, you'd pretty well cripple people's ability to use the Internet, although there's enough redundancy in the system that we'd probably be able to recreate it pretty quickly.  The biggest risk is probably someone cutting all of the trans-oceanic cables which would splinter the Internet into an American Internet and a European-Asian-African Internet.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Autism is a spectrum. Is there a spectrum for people with sociopathy and psychopathy?",
        "response": "The only correct answer to this question is we don't know. Mental processes and diseases just aren't well understood. The standard for defining mental illness is a book called the DSM. They are on the fifth edition of the book, you can see it here _URL_0_ The biggest complaint with that is that it classifies mental illness in terms of its symptoms. It would be like if we said that a heart attack is similar to heartburn, they just lie on different ends of a spectrum. An alternative to classifying mental diseases is being developed by research scientists, called the Research Domain Criteria. This effort is trying to classify mental diseases using genetics, imaging, biomarkers and other quantitative tools. Here's a good article about it _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to use RADAR or other waves to find gold?",
        "response": "Geologist here. Geologists currently have no remote sensing method that with pick out \"gold be here.\" Indeed, seismic surveys do not directly find oil, but instead are used to used to find oil \"traps.\" These are geologic features such as folds in the rock where oil might congregate. The oil company describes such places as \"plays,\" because they don't know if there is actually any oil (or enough oil to make it worth drilling a million dollar well) there until they drill it. There are several ways that companies track down gold. The one I am most familiar with is sampling groundwater or surface water for gold or minerals often found with gold then looking for the source. All in all, the process is usually quite difficult, and there's a lot of work that goes into siting a mine or a well. Actually finding somewhere that has enough oil/gold to actually make your money back is really hard. TL;DR: We don't yet have a way of directly sensing oil or gold.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it true that some people can sleep with their eyes open ? If yes, how do they do it ?",
        "response": "I used to scare my mom all the time when I was little because I would sleep with my eyes wide open and she would walk in and think I was dead.  She would shut them but later on in the night they would re-open. I still do it sometimes as an adult- I'm 28 now. I think the reason I do it is because as I'm falling asleep, my eyes and face relax to the point where keeping my eyes shut actually feels like it takes more energy than keeping them open. I think because they are open the majority of the day it feels more natural to have them open as I'm sleeping. Not a scientific explanation but just what I've experienced. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is watching TV without an extra light source bad for your eyes?",
        "response": "I don't know if the light difference is bad for your eyes. What I do know is that watching television for too long can cause eye strain ([Asthenopia](_URL_0_)), but that is caused by focusing your eyes on one thing for too long. Also, watching television (or looking at any electrical light source) at night can cause melatonin suppression. Melatonin is a hormone that regulates the sleep-wake cycle, it makes you feel sleepy when secreted. There are receptors in your eyes giving signals through the non-visual pathway in the brain, including the pineal gland where the melatonin is secreted. You can read more about it [right here](_URL_1_). Feel free to add more info. I'm not an expert, but I'm very interested in the effects of light on the human being. I had a course about cognitive neuropsychology that had a part covering this subject.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the tingly feeling you get in your arms and legs after almost slipping but making a quick recovery? It's almost like the tingly feeling from having your arms or legs fall asleep, but it's more intense and only lasts a second or two.",
        "response": "That's the adrenalin. It gets released to mobilize strength reserves in your muscles that you might need to avoid a fall and possible injury.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can the predators on \"To Catch a Predator\" be arrested? If they haven't molested or communicated with a child, what are they charged with?",
        "response": "In most states, online solicitation with the belief that the other person is below the age of consent is a crime.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do all humans look different, but other animals look almost identical",
        "response": "They don't, you are just adapted to distinguishing between people because those are who you are familiar with. This is why people who are not of your familiar ethnic group can tend to \"all look alike\"; they are distinct if you know what to look for, but you just don't know what those features are. Similarly animals can tell each other apart just fine but may struggle to distinguish between humans.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people think the moon landing was faked?",
        "response": "There is no concrete \"answer\" to this question. But the best explanation I've heard for this denial of established facts is that it's an expression of *boredom*. That is to say, there are a lot of people who believe that the moon landing was a giant conspiracy, or that vaccines secretly cause autism, because it's a more exciting idea than the simple truth; and believing it makes them feel special, gets them attention, and takes very little effort.  They're \"in the know,\" as it were. They know something other people do not, and that gets them attention. Attention they very much want, and they can very easily get it by believing something radical. It also takes far, far less effort to believe in a fake moon landing than to actually learn the science behind how we got to space and the effort it took to get it right. So, in short, they are bored, lazy, and they want attention, and believing in something obviously fake fulfills a bunch of those issues.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Monday Mysteries: What was it used for?",
        "response": "Someone who is more familiar with Paleolithic Europe, do we know what those worked pieces of bone in the Young Prince burial of Arene Candide may mean?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does climate change mean that climates will become more extreme, rather than just changing?",
        "response": "Some areas may become less extreme. But in any place the environment and our use of it is built around a certain climate. In places that are regularly flooded, agriculture on the floodplains relies on the regular flooding to provide water and silt for nutrients. Loss of regular flooding would have a very severe effect. In areas that do not regularly flood, people build houses on the river banks, and regularly flooding there would be devastating. Climate change is going to increase the amount of heat in the atmosphere, and this will increase the amount of water evaporated, and the amount of energy available to create storms. This is the reasoning behind the predictions of more extreme weather.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do car seats have expiration dates?",
        "response": "Material fatigue. Plastics have shelf lives, and manufacturers can't guarantee efficacy once the materials get brittle or otherwise unreliable. EPS foam helmets (like for bicycling) have the same problem. Keep a helmet for 5 years or less.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long would it take to fall to the center of the galaxy if an object came to a dead stop?",
        "response": "If you have come to a halt relative to center of our galaxy and started your way through to the center ignoring other stars that may come in a way (including our Sun)... Distance from our Sun to the galaxy core is 27,200 LY (or 2.7x10^17 ) km, Milky Way mass is 6x10^42 kg and thus gravitational acceleration is 1.738x10^-9 m/s^2  We know path and acceleration so it would take t = sqrt (2s/a): sqrt(2x2.7x10^17 km/1.738x10^-9 m/s^2 ) = 5.574x10^14 seconds = 1.766x10^7 years 17 millions years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Taiwan considered an independent country and not Hong Kong?",
        "response": "Hong Kong was never an independent country. We (britain) took it from China in the 1800s as war reparations. We gave it back in 1997. They may seem like a separate country but that's only because they have different laws/press freedom/financial freedom. That won't last, they are due to be fully integrated. Taiwan is arguably the legitimate government of China. It was a Chinese colony but became a separate country after the Chinese revolution when the Chinese government fled there. It's official name is the Republic of China.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Some news sources are reporting Irma is strong enough to measure on seismometers: is this atypical?",
        "response": "I saw a documentary where the scientists that used the laser retro reflectors on the moon to do precision ranging said they can \"see\" the ground level changes just due to normal atmospheric pressure changes. So that from a hurricane would give a booming signal. _URL_0_ Look at around page 15.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the president or congress have more influence over balancing the US federal budget? Which party has a better track record of balancing it?",
        "response": "Congress. Congress makes the budget and passes it. The President approves it and can make recommendations, but ultimately it's Congress that controls the budget.  The last time the budget was balanced we had a Democrat as President and the Republicans controlled Congress.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I'm driving through a tunnel (specifically underwater) I lose radio reception but I still have cell reception (i.e. Streaming music)?",
        "response": "This can happen when cellular access points have been added to the tunnel. The tunnel still shields out external signals, but it has interior signals all of its own.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does it really mean to be sister/twin cities? Is it just symbolic or do cities get something else out of it?",
        "response": "The Town of [Boring, Oregon](_URL_1_), is part of *a \"League of Extraordinary Communities\" grouping [Dull](_URL_0_), Boring and [Bland](_URL_2_) as a means of encouraging travel, promoting all three communities.* Tourism, awareness, and merchandising. Also community building internationally; Boring is in the US, Bland is in Australia, and Dull is in Wales.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that my headphones go through the washer and dryer yet still work?",
        "response": "Electronic items are damaged by water because the water allows current to flow in ways that it was not meant to. Washing can also cause damage by banging the headphones around. However, since there was no current flowing through the headphones while they were wet and they were dry when you used them again, they worked just fine. Note that this is not true for anything with a battery in it, or anything that happens to be turned on when it enters the washer. Also, the washer can still destroy headphones, so be careful next time you wash your clothes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't I put metal in my microwave, even though my microwave is made of metal?",
        "response": "You can put metal in the microwave, what you can't do is put metal with edges in it in the microwave because it will arc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly happens during the placebo effect?",
        "response": "[This article](_URL_0_) has loads of information on the study and mechanism of the placebo effect. There are lots of different kinds of placebo effects that each have different mechanisms of action. At a high level the study of the placebo effect is the study of how the psychosocial environment and context of treatment can affect perception and expression of symptoms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why, when held against your skin, does the light from a flashlight turn red?",
        "response": "> It can't be your blood, because our veins our blue until oxygenated. Veins appear blue _under the skin_ because of the scattering properties of the skin, but both venous and arterial blood are very much red - inside and outside of the body. The \"blue venous blood\" belief is a very common misconception. Only red light passes through tissue because that is the [optical window](_URL_0_), which exists in the near IR region, sandwiched between absorption wavelengths of water and blood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how did \"blue raspberry\" come to be a widely used and legitimate flavor?",
        "response": "Blue raspberry was created when ice pop manufacturers of the 1970s had too many flavors that all needed the color red: cherry, strawberry, watermelon, raspberry. They decided to make them all different shades of red, but the color they’d settled on for raspberry—a deep red dye called amaranth—had a not-so-small problem: It was proved to cause cancer. The manufacturers scrapped amaranth for a dye called brilliant blue. Even though the color was closer to an electric blue, they decided to combine it with the flavor of whitebark raspberry, and boom: Blue raspberry was born, forever staining kids' tongues a bright, unnatural, I-just-made-out-with-a-Smurf blue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens by a wasp sting?",
        "response": "Those damn little bastards have little tiny poker stingy things that are coated in venom. They poke you with said tiny little poker thingy and, voila, PAIN. If you want to know more, then read this super duper article on [wasps](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened in Morgan Freemans AMA, why he started getting downvoted.",
        "response": "People suspect that it is not Morgan Freeman answering, but an agent of some sort.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about Entropy and Evolution (I don't know much about entropy)",
        "response": "Entropy of the universe is always increasing but that doesn't mean that the entropy of a specific area of the universe can't decrease. A simple example if you take an ice cube tray and fill it with water and put it in your freezer as it turns to ice it will lose entropy and gain order, but the outside of the freezer gains entropy in the form of heat released. The net will be an increase in entropy but for a localized area it decreases. The same is true for the Earth as it is not a closed system (see the Sun). But even if it was closed as long as the net entropy increases a local area can lose entropy thus evolution is permissible both in the small frame of the earth and the larger frame of the whole universe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will the moon eventually leave the earths orbit and if so what would happen to the earth?",
        "response": "The Moon is drifting outwards by 4cm per year, but this is only as it drains angular momentum from Earth's rotation, making our days longer. It will no longer drift away when all the remaining angular momentum has been drawn. Okay, *almost* all of it. The Earth will still rotate slowly and the length of the day will match the orbital period of the Moon, so that they always show the same face to each other. This is mutual tidal locking, like the Pluto-Charon system. The Moon will still be close enough to be in orbit around Earth by then. The timescale for this to happen is tens of billions of years. But the Sun only has 7 billion years to live and it may engulf the Earth during its red giant phase. So the Moon won't have time to make Earth tidally locked, let aside leave us. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a solid is dissolved in a liquid, is it still a solid, what about individual atoms or molecules in a vacuum?",
        "response": "States of matter only apply to collections of atoms. Single atoms are not solids, liquids or gases. An isolated atom does not have a temperature or pressure, these quantities are only meaningful in the context of multiple atoms. When you dissolve a solid into a liquid, assuming it completely dissolves and doesn't leave solid particles behind, it's a liquid solution. When the solid dissolved all of its atoms/molecules were separated and mixed into the solvent. All of the solid properties were lost, and the result is just a liquid made of more than one species of atom/molecule. If a large solid breaks into smaller pieces that are still solid but disperse themselves throughout the liquid, it's called a suspension or a colloid, depending on the size of the dispersoid. The bottom line is that \"state of matter\" is not a fundamental, immutable property that atoms carry with them. States of matter are emergent behaviors that depend on the interactions between atoms.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do professional swimmers wear 2 caps when competing?",
        "response": "So I was actually wondering this out loud the other day while I was watching the Olympics with my wife, and not 10 seconds later the commentator on the TV actually explained it. He said occasionally you will see some swimmers wear their goggles with the strap on the outside of their swimming cap, but most wear them with the strap on the inside. Some swimmers wear their goggles with the strap in contact with their hair, and then a single swim cap over top, but other swimmers may feel that their hair is too slippery for the goggles' strap to stay in place, so they wear a swim cap, then the goggles with the strap over top of the first swim cap, and then a second swim cap to make sure their goggles can't slip off. He seemed to know what he was talking about, so I trust his explanation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a \"downwards\" in space? As in, if I were in a space ship and went south of the south pole, would I find other planets and celestial bodies? Is there a bottom of the universe?",
        "response": "Down is towards the enemy gate. /Sarcasm You can define down convention as long as you have a convention. On earth, we define down towards the largest local gravity well, being Earth. If you and everyone else in Sol decided towards the Sun is down, then that would be consistent. Once you're outside of Sol, you could establish convention towards center of the Milky Way. But once you're out of the Milky Way, that system breaks down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Concerning sound/acoustics, how are the size of a noise barrier and wavelength/frequency related?",
        "response": "Sound waves, like all forms of energy, can do one of three things when confronted with an object (a wall): Either reflect off the surface, be absorbed by the object, or pass right through it. In terms of material, a wall with a solid surface would reflect sound waves pretty well. A wall with some sort of insulation in it would be better at absorbing sound waves, and a thin wall would have sound waves pass through it. With bass frequencies, they are literally longer than higher frequencies. In technical terms, the period of a low frequency is longer than that of a higher frequency. Really low frequencies have a period that's longer than a bus! This means they are not easily reflected or absorbed by a wall. They would need a wall that's as long as one period in order to reflect or absorb them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What harm does having a large debt do?",
        "response": "We have to pay interest on our debt. So having a huge debt means we have to pay a lot of interest, which means we either have less money to spend on things we want/need or have to borrow even more money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The meaning of intuition.",
        "response": "Intuition is a feeling you get when you've come to an answer for something, without any clear justification for it. It probably comes from our brain's ability to perform pattern recognition to draw conclusions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any interesting cosmic phenomenon in worldwide records from 775 CE?",
        "response": "From the article:  > \"It would be fascinating,\" Baker adds, \"if there were some record in China or in the Middle East that reported powerful aurora or some other such event\" around the same time as the observed 14C increase. So we're looking at that area?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why will the USPS leave $600 worth of car seats on my porch but I need to be present and sign for a $30 World of Warcraft toy?",
        "response": "It has nothing to do with what you ordered, it's all about how the shipper sent it. They may have paid for a signature, they may request it not be safe dropped at the receivers door without them being home, they also may say they want it left at the door even if nobody's home.  It all depends on the seller requested. Source: am a mailman",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is my theory on antimatter wrong?",
        "response": "This is a small complaint, but you don't have a theory about antimatter. You have a conjecture. I don't know enough about the topic to say if it has any possible credence or not, but a theory requires a lot more work than \"hmmm, maybe it's this!\" This is not supposed to discourage you wondering or asking, just helping fight the common phrase \"well, that's just a theory!\" that you hear non-scientists say.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are advertisers still using click bait?",
        "response": "It still works. There is an old saying that there is a sucker born every minute, and with the growing population that rate has increased.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did medeival people drink staright river/lake water or did they boil it first?",
        "response": "Not a direct answer, because I don’t remember the source to this, but I remember an article about how there was a mass of communities that were getting sick and they figured out that the communities near breweries weren’t apt to get as sick. Having to boil water while making beer killed the bacteria that was making the other communities sick. I can’t remember the time frame though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the modern mindset to extend a human life as long as medically possible without any consideration of the economic, societal, and human cost?",
        "response": "In theory that would be wise and productive, And Different societies have tried that in the past, with less than satisfactory results. The problem is that the decisions about what it's worth to keep you alive as an individual end up made via laws passed by to politicians or those with monetary interest in your potential for return on investment spent in the form of medical care. If that doesn't bother you, just think about the current state of politics right now. so you really want those guys making medical decisions for you or your loved ones?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do hotel room keys work?",
        "response": "Depends what kind of keys. Tap-key cards have RFID-chips. The door reader emits very weak electric fields which powers up the chip, which spits out a unique ID. If the ID matches the reader in the door, it opens. This type is usually unprotected and easy to copy with a portable RFID-reader, which is a major security flaw. There are even some android apps which let you do this.  If it’s insert-into-slot cards, it might be a magnetic strip (similar to credit cards). If the magnetic strip has the right code for the door, it opens. This type is more secure since reading magnetic strips is harder. There are also other types of cards such as mechanical key cards with multiple holes, but these are more rare.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how come on craigslist there are so many \"female only\" roommate ads, but never any \"male only\"",
        "response": "Because of assumptions. If your a guy placing the ad it is assumed you will probably only get guys responding due to the fact that women are not comfortable moving in with a guy they don't know. If you (as a guy) get a girl calling about the room then you will deal with it no problem. By that I mean, if you don't want a female to live with then you will say no (and nbd). A girl however has to say female only so it gives her a place to reject males and keep the flow of guys down. To many guys would love to have a female roommate so they could entertain the idea of getting laid. As soon as guys see an ad with a female looking for a roommate they call, unless there is a disclaimer looking only for girls. This helps keeps the guys away and since girls don't call when its a guys apt then its a moot point to put in the ad. Personally after having lived with female roommate I prefer guys. They are cleaner, quieter and tend to be more respectful of the common area (that is just my experience though).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can anyone think of a real-world example of factorial growth?",
        "response": "The number of possible ways to order a deck of N cards grows like N!. The growth of N! is used to explicitly compute the entropy of simple systems in statistical mechanics. If the Taylor Series of a function is to converge at the value x, then f^([N])(x)x^(N) cannot grow faster than N!. Factorial growth is a factor to consider in anything where combinations or permutations are important, notably in Physics (especially Thermodynamics), Statistics and Probability, Programming and Computer Science, Math (all of it). An important result in math is [Stirling's Approximation](_URL_0_), which says that N! grows like sqrt(2pi N)(N/e)^(N), and is often used to simplify computations involving N! or approximate values involving N!.  Is there some new YouTube video about factorials out there? There seems to be a more-than-usual interest in factorials, permutations etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and why did caskets get their hexagonal shape?",
        "response": "**Coffins** got their hexagonal shape because tapering at the shoulders and feet reduced the cost of the coffin (less wood to produce). **Caskets** are rectangular. [Source and brief history](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes certain people on the autism spectrum excell in math or have great memory? Also, if we're able to find the cause of that in our brain could we implement/activate it in others?",
        "response": "I have Asperger's autism, which is classified as high functioning or 'almost normal'. I am generally smarter than average in things that interest me but very socially awkward, I can't gauge tone of voice and have a very hard time with things like sarcasm.  The brain is an extremely complex organ. So far we don't know what causes autism specificly. One leading explanation is that our brains are so complex that they almost always don't develop the same, which leads to why our personalities are so different. In other words everyone's brains are slightly defective, in slightly different ways and it's those defects that make some abnormally smart, some overly nice and some below average. I don't have a paper to back this up but from my own research you would either have to modify these things before birth or in very early age. It's not as simple as just turning something on or off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are those \"knobbly bits\" on my dog's lips called? What are they for?",
        "response": "They are papillae, sort of like taste buds. Someone may explain better, but it's to my understanding that they help with taste/scent, which may be why there are more/larger ones in dogs used for hunting and tracking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If UBER reached a settlement of $148 million because of its data breach of 57 million users, how come they each don't receive a significant portion of that?",
        "response": "Well $148 Million split between 57 million users is $2.59 and change..... and that's not even taking in to account the legal fees and lawyers costs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are pills so difficult to swallow, while swallowing food of the same size or larger presents no problem?",
        "response": "Food either is soft or becomes soft as your mouth mashes it up and mixes it with saliva. You have been swallowing soft food mush since before you could form memories. It's a sensation your mouth and throat are very used to. Hard pills on the other hand are very different and your subconscious doesn't really trust them so it makes you hyper aware of them as you are swallowing them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How youtube personalities make money off their videos",
        "response": "In short? When you're a popular Youtube user getting tens of thousands of views for every video of original content you put up, you apply to be a Youtube partner and from there forward, you can earn money on the ads on your page so long as you promise to keep making videos on a regular or semi-regular schedule.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How hot can you drink?",
        "response": "Two answers for two questions. Question A: What’s the hottest liquid temperature that a human could consume without hurting themselves? Answer A: About 104-122 degrees Fahrenheit (AKA 40-50 degrees Celsius). At around 47 degrees Celsius, you’ll feel it, though. Question B: What would happen if a human drank a liquid hotter than 122 degrees Fahrenheit/50 degrees Celsius? Answer B: You’ll damage the interior tissue of wherever the drink came in contact (so the mouth, throat, food passage, and stomach).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Radio Shows know how many people are listening to them?",
        "response": "It can be difficult to determine the ratings of over-the-air radio broadcasts, and has always been a thorn in the side of determining adverting rates, which is the most important part of running a radio station. But, in general, there are a couple of ways. One is to simply ask people through a proper scientifically sound survey done through mailers or phone calls. Ask enough people what stations they listen to, and you can extrapolate it with pretty good confidence. Another way is by using those call-in contests that you hear radio stations having all the time. There's a well established percentage of people who are likely to call in to the station for contests, and so by keeping track of how many people participate, you can roughly judge how many people are listening at that particular time. Obviously, for things like radio apps",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it take humans atleast a year to walk ? Newborn horses and other mammals can run in 15 minutes after birth . Why can't we?",
        "response": "Because of our large heads/brains we have to be birthed \"under developed\".  We evolved in tribal 'packs' that can support useless infants until they are old enough to contribute. It was beneficial to have weak infants because it allows the brain to grow large for an animal our size.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I were to drop an insect from the Empire State Building would it survive? And how do beetles fall off a height and survive that people can't?",
        "response": "Yes. Ants for example reach their terminal velocity (maximum speed from gravity) after 4 inches. Drop an ant from the Empire State Building it'll accelerate for 4 inches then hold its speed. Insects weigh less, so the fall slower. They also have an exoskeleton so the landing doesn't damage their squishy bits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why are some Internet services, like Netflix, unavailable in certain countries?",
        "response": "Various different reasons ( too many to list)is licencing. Where I live there used to be one major cable company where everyone got their TV, they had the monopoly. Then Netflix went to try and launch but legally couldn't due to the cable company actually having rights to premium TV in said country. The cable company finally bowed to pressure, but not before VPNs were mainstream and a majority of customers where lost.  TL;DR: Legal reasons",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any animals that don't sleep?",
        "response": "This is a tricky question, and the answer will depend on whom you ask. [Some scientists](_URL_0_) might argue that there are no well-studied species for which sleep is not necessary in some form. Cases like cetacean sleep would be taken as evidence of adaptations reflecting some unitary, necessary, and conserved function for sleep. [Other scientists](_URL_1_) might argue that sleep is extremely heterogeneous, and this variation likely reflects a multitude of sleep functions and sleep phenotypes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for a virus to not have any antigens, and therefore be ignored by the immune system?",
        "response": "The human body has a population of native viruses that are part of the microbiome and your genetic mobilome. Technically all cells have antigens, but you have plenty (billions) of viruses that don't produce non-self antigens and activate an immune response.  In fact, my virology professor once described pathogenic viruses as \"badly evolved\" since they almost always get killed off by the immune system or anti-viral drugs. \"Fit\" viruses slip under the immune system's radar, or evolve a symbiotic relationship with its host.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the United States Merchant Marines?",
        "response": "In peacetime, the Merchant Marine transports cargo and passengers no differently than any other shipping company. In wartime, the Merchant Marine transports soldiers and material for the military. The Department of Defense can also commission Merchant Marine officers as military officers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where did the stereotype for Vikings come from?",
        "response": "From the people whose monasteries they burned down and stole from. *Norsemen* were relatively peaceful. All vikings, by definition, were warlike because viking was a job description for pirates, not a society.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a species is a group of lifeforms within which two members can produce fertile offspring, how long might it take for this to not be the case between the global community and one of those isolated aboriginal communities that are forbidden from being contacted?",
        "response": "For one thing, that's just one part of how you define a 'species' - consider (for example) *H. neanderthalensis and H. sapiens*, which produced fertile offspring but are still considered (by most authorities) to be distinct species. To answer the actual question, might as well continue with the Neanderthals.  Neanderthals likely emerged some 400,000 years ago, with humans perhaps some 200,000 years later. So. Neanderthals were distinct for a span that equals the entirety of human existence, but were still able to produce fertile offspring with modern humans. That little tribe in the Amazon should integrate just fine, if they ever want to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does drinking more water help people lose weight faster and increase metabolism?",
        "response": "Drinking more water can help reduce your food intake. A main reason why people gain weight/maintain a high body weight is because they snack a lot without thinking about it. Drinking water will help curb your appetite and reduce your urge to snack. If you can condition yourself to drink a glass of water instead eating a cookie, you save yourself 100-200 calories. If this happens three times a day, that's a total of around 500 calories. 500 calories is equal to doing a 5km run in 30mins. Eating 500 fewer calories per day will lead to one pound of weight loss per week.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "American schooling vs. British schooling",
        "response": "What level of schooling? What aspects? This is very broad. There are so many schools and school systems in the US that it would be very difficult to compare. If you live in the North, Dangerous Minds. If you live in Texas, Varsity Blues. If you live in the Midwest, Breakfast Club. If you live in Northeast, Rocky V. If you live in California, Encino Man or Clueless. If you live in the Pacific Northwest, Twilight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the sudden jolt of electricity, when plugging in your cell phone, not instantly, fully charge its battery?",
        "response": "The movement of electrons through a system is what we call electricity. A batteries job is to store these electrons for later use. Electrons can have a wide range of speeds. A slow case: we know that electrons move when there is a current flow in a wire, but the speed at which the electrons themselves move in the wire -- the so-called electron drift velocity -- surprises most people. For example, for a copper wire of radius 1 mm carrying a steady current of 10 amps, the drift velocity is only about 0.024 cm/sec. So, basically the speed at which your cell phone battery is limited to the speed at which the electrons can travel through the wire on your charger. The larger the wire's diameter, the more current (amps) that it can withstand. You may think to yourself \"ok, why don't we just make the wire bigger?\" The more current you have going into a battery, the hotter it gets. This could then lead to battery damage, fire, or even an explosion. Hope this helps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between vitiligo and albinism ?",
        "response": "They're not very similar. Vitiligo is when pigment cells in your skin die; often the cause is not known. It can start later in life. Albinism is genetic; you're born with it. It happens because an enzyme essential to making melanin is not present.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know for sure that cancer and other deceases aren't caused by being constantly exposed to small radiations from electronic devices and 3G, 4G, WiFi, LTE, Bluetooth-signals?",
        "response": "Simple, cell phones/wifi/etc all emit either radio- or microwave radiation. These two types of radiation fall under the umbrella of non-ionizing radiation. Other types of radiation in this category are infrared and visible light. Ionizing radiation includes UV, x-rays and gamma rays as well as radiation from nuclear reactions.  Now, what separates non-ionzing from ionizing? Well the former can't knock electrons from atoms and thus can't make ions. Now to cancer, cancer is a genetic mutation where the DNA that controls cell reproduction is damaged and runs uncontrollably. In order to have this happen, you have to mess up the bonds in the DNA, which means you need enough energy to strip away electrons. So its physically impossible for non-ionizing radiation to cause cancer. The worst thing that going to happen from cell phones use, etc.. is your face is going to get a little warm.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the fastest possible Earth orbit achievable?",
        "response": "8 km/s is how fast something would orbit at Earth's surface, if there was no atmosphere or obstructions. The edge of space is generally considered to be about 100 km up (at that height one would have to achieve orbital velocity to get aerodynamic lift), and the velocity is 7.8 km/s.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do athletes have shorter lives because their hearts beat faster for more time periods than the average human?",
        "response": "Heart disease is a much larger limiting effect on average human lifespan than how many cycles your heart has gone through. The link between physical activity and reduced risk of heart disease means that athletes are generally less likely to die of heart failure before a given age than people who get no exercise. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are we the only ape descendants to grow hair indefinitely long (at least on our heads) instead of to a certain point then stopping? When did this trait start showing in early hominids?",
        "response": "A quick note, human head hairs have a maximum lifespan before they fall out and thus a maximum length. It's just far longer than for body hair, eyebrows, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The culture of tipping in the USA.",
        "response": "You have to first understand what tipping is. Tipping is a bribe. In the early days of the USA and into the 20's it was seen as undemocratic to tip, as you were essentially using your money to get better service than the other patrons. When Prohibition began, restaurant owners couldn't afford to pay servers as much. So the servers began accepting the gratuities from the patrons. This got worse with the Great Depression. Since then it has become so ingrained in the culture of \"eating out\" that laws have been passed allowing servers to be paid less than minimum wage because they are expected to make up the difference in tips. Meaning that the patrons are then forced to tip and prove that the system works and the vicious cycle continues. Tips also work in other places. It's not unusual to buy a drink for a musician or comedian when they play at a bar. All in all its a vicious cycle of patrons being too polite to stop tipping and forcing management to pay their employees a decent wage.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were movies edited before computers?",
        "response": "Believe it or not, by physically cutting and splicing segments of actual film. It was absurdly time consuming and complicated.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When the military lifts bans on a group from joining, why does it seem to throw them all together in one regiment instead of having a few integrated into other regiments normally?",
        "response": "Prior to WW1 the military was organized by where you were from. You were in a platoon with people from your village. You were in a company with people from the surrounding villages. You were in a battalion with people from your county. You were in a regiment with people from your State. The purpose of this was if you were a coward on the battlefield, everyone back home would find out about it. Given how segregated the US was/is, this would naturally increase the likelihood of being in a segregated unit. On top of that, the US had a racial segregation policy in the military until the Korean War.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are cars in professional racing almost identical?",
        "response": "Some classes have very strict rules about just about every aspect of the car. Some in fact run cars that are as close to identical as they can be made. The idea is to take the cars out of it and make it a competition of driver skill.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how congress can stop net neutrality enforcement with the budget.",
        "response": "The FCC is an independent agency (not part of the President's cabinet) and although constitutionally part of the executive branch, they are accountable only to Congress. Because Congress alone has the \"power of the purse\" as outlined in the Constitution, Congress can explicitly say what each agency can and cannot spend, and where that money is spent. It will cost the FCC money to enforce net neutrality, and if they simply do not have the funds then Congress could effectively shut net neutrality down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a vehicle fails a smog check, why can driving it around an re-testing cause it to pass?",
        "response": "Cars have things called catalytic converters that turn really toxic gasses into not as toxic gasses. Catalytic converters work best when they are really hot. Sometimes when you go get a smog check your car sits for a while, causing the catalytic converters to cool down and not work as well. Driving the car around for a bit heated up the converters back to their operating temperature which allowed your dad's car to pass the smog test.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if people use less than 10% of the total water in California, then why are we enacting measures against them?",
        "response": "Yeah, a majority of the state's water goes to agriculture, but that water is also used more economically than keeping a lawn or golf course watered. California is an agricultural powerhouse and produces a ton of high value goods. If you were in government, would you regulate the wasteful, if smaller use of water, or the more economically efficient, if larger use?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why won't OPEC reduce their output and solve this whole crisis?",
        "response": "The two theories that I believe have some truth to them are as follows: Theory 1: Saudis want to keep the oil price low to destroy the US fracing industry. The problem with this theory is the technology and know-how do not go away because a company folds. Theory 2: Saudis believe that oil has about 20 years left before technology all but advances it out of most uses. So they are going to pump as much out of the ground and get as much money from it as they can, because they cannot transition like Dubai into a tourist economy due to hard liners within the country.  I am just an operator at a Maritime Oil Company, but I deal and talk with traders on a daily basis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens to a light ray after contacting with the surface of a solar panel?",
        "response": "Photovoltaic elements have two (relevant) energy regions for electrons. Light can transfer its energy to an electron, lifting it from the lower region to the upper region. With a proper cell design this leads to a current flow: an electron with a higher energy leaves on one side, an electron with a lower energy enters the cell on the other side.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it easier to get a radio signal when it's cold outside?",
        "response": "One reason might be that cooler air can hold less water vapour, so it's usually also drier. This is why they build some telescopes in the South Pole. Dry air is significantly more transparent to at least infrared and microwave radiation, and although the [effect becomes smaller as you increase wavelength](_URL_0_), I imagine you might still be able to see a difference.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did \"indoor plants\" come about, given they weren't always kept inside millions of years ago?",
        "response": "Think more under thick canopies of the rainforests, where direct sunlight is very difficult to get through, or on a side of a mountain where it is in shade all day.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is pain and pleasure (or all sensation for the matter)? I understand the physical aspect (chemicals released in the brain), but I cannot understand how this 'translates' into what we consciously 'feel'. Help me!",
        "response": "Taking this seriously, check. You are not the first to have this problem. If we could understand the process as to how chemistry becomes consciousness, then many long standing philosophical problems would go away. Give it a few more years and neuroscience might be able to shed some light on it.  If you want some hypotheses to chew on, [try these](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do other countries not have large militaries like the US?",
        "response": "Because they don't need large militaries when they have America for an ally. America will more than likely be there to back them up if they ever get into a conflict.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do electronic thermometers work?",
        "response": "Usually electric thermometers a resistance based. As temperature goes up the resistance decrease (or increases for some materials.). From there you either use an analog gauge to read current or voltage or you push the analog signal through an ADC to get a digital signal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the optimum moisture for tire traction? Does tire traction peak at 0 moisture or is there some level of humidity/light rain which increases traction?",
        "response": "I don’t know the exact scientific response but in regards to rain and tires used on Consumer grade vehicles the worst and most dangerous time for traction is right when it starts to rain. The initial moisture mixes with the dirt/oil/other contaminates on the road surface until it rinses most of it away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do many cultures all around the world have Dragons even if they never heard about them from each other?",
        "response": "Because dinosaur bones are found pretty much everywhere so it's easy to imagine them being found and myths created to explain them. Voilà, dragons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it takes a year or more for a movie to be released after filming, but a TV show can be released within two months after filming?",
        "response": "My guess would be that editing a film takes a lot more time then editing a TV show.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any trees that have leaves that behave like the trees seeds?",
        "response": "Succulents do this! I personally don't know of any trees, but you could maybe apply the succulent thing to a larger scale? So succulents have these thick, fleshy leaves partially because they store water in case of drought; however, they also contain enough resources for the cells inside the leaf to continue photosynthesizing. This continuous photosynthesis gives the leaf enough energy to produce roots, and then smal leaves. So your fictional tree might have fewer, thicker leaves if they were to mimic succulents. You can look up succulent propagation if you're interested. Good luck with your RPG!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Tai Lopez so successful?",
        "response": "I've read it's a scam. One of the homes he says is his, isn't for example. He must have some money though as his ads are all over YouTube.  The guy is so annoying!!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[Chemistry] If we can separate alpha particles from atoms through induced decay, is it possible to create any smaller element we wish to from a larger radioactive one?",
        "response": "There are easier ways to make arbitrary nuclei than trying to \"induce decays\". Using nuclear reactions, we can make essentially whatever nucleus we want (some are much easier than others).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you look at a star, is the flickering you see from your eyes, or just the star? Both?",
        "response": "From the atmosphere. It's moving masses of air at different temperatures. Light is diffracted at the interfaces between these masses and this changes the position and intensity of the image of the star.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't we use superconductors in power lines?",
        "response": "The main problem is that there is no known superconductor that remains superconducting at room temperature. They only work far below room temperature as well, something like -100 degrees Celsius. This of course would be hugely expensive to have widespread in the power grid, so it just isn't cost effective. Integrating superconducting wire into the power grid has been tried before, but only on a small scale. [This article](_URL_0_) talks about a project that put a small length of superconducting wire into the power grid in New York.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The recent Wikileaks leaks.",
        "response": "Edit 2: /r/the_donald just created a mega thread with a quick summary of all the most corrupt information discovered. [Read it here](_URL_0_?) --------- Going to assume you mean the Clinton Email leak: People have been suspecting Clinton and the DNC being corrupt for ages, the leaks show the DNC doing everything possible to harm Sander's campaign, colluding with the media to stop any anti-clinton coverage, possible money laundering, and worst of them all: paying millions of dollars to spread clinton propaganda on Reddit (no joke). According to Assange, this is only the tip of the iceberg. Edit: This post blew up fast! For anyone wanting examples of the corruption: /r/DNCLeaks, /r/SandersForPresident, and /r/The_Donald have spent the past day or so analysing the leaks. If you guys want specifics those are the best places to look.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do women tennis players scream as if they were having an orgasm when they play? is that suppose to give them more power or is it just a way to fuck with the opponent?",
        "response": "It's mostly derived from a tenet of many Asian martial arts. A vocal exclamation adds force to a physical action. It happens a lot in Karate and other martial arts competitions. A vocal \"Hayyaahh!\" is used to reinforce the physical action being performed. It's a psychological idea that actually works quite well.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't USB cables included with printers?",
        "response": "- To save money. - Almost all printers these days have wireless capability making the cable optional.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are some interesting or highly innovative weapons from World War II that most people don't know about?",
        "response": "One of the more unusual (and unusually ineffective) weapons devised by the British during WWII was the [Unrotated Projectile](_URL_0_). Essentially it involved rockets with wires and parachutes attached that could be launched from ships to create an 'aerial minefield'. In theory, the rockets would be fired and then drift slowly back down. Any aircraft flying through their deployment area would be at risk of snagging a cable which would pull the rocket towards the aircraft and then detonate on impact. The fatal flaw in the design? A slight change of wind and the rockets would drift back on to the ship that launched them. Genius. EDIT: Typos",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so bad for humans to consume blood?",
        "response": "It's not, really. Blood can be quite safe, but the issue is that blood is, by definition, the lifeblood of the body. It carries along any illnesses that said creature might have been carrying, even those its immune system had under control.  Drinking animal blood is much on the level of eating raw meat in danger, really, and just like cooking meat makes it safer, if you boiled blood it'd probably also be safer to consume. Just perhaps even less appetizing than it already is.  Human blood, on the other hand, is something to avoid more, because any diseases human blood may carry are diseases that a human is likely susceptible to, and hence you could contract yourself. There might be a long dormant disease that the person whose blood it was had been a carrier of, but wasn't suffering from, too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what exactly is the Placebo effect?",
        "response": "I don't know the biology of it, but the basic psychology is that if your brain believes that thing A is true, it acts as if thing A is true even if thing A isn't true. and then the way your brain acts makes thing A become true.  non-medical example: in GTA, you can give your vehicles \"off-road\" tires. when you do, your off-road driving improves significantly. but when people looked through the game's code, traction had nothing to do with what type of tires you had. it was only because your brain thought \"wow off-road driving should be easy with these tires\" that your driving got better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a disease be exclusive to a certain ethnicity?",
        "response": "There are at least three possibilities: 1) Genetic disorders, in which a defective allele is carried by a population. 2) Diseases caused by a parasite (virus, bacteria, etc.), for which a population has developed resistance and others have not. 3) Culture-bound syndromes, a combination of symptoms that are only recognized as a disease within a specific ethnic group.  I think Hechtie has done a good job explaining the first two. Wikipedia has some very interesting information about [Culture-bound syndromes](_URL_0_). Edit: Doesn't need to be a recessive allele.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I read today in the Guardian newspaper that the Romans used tunnel bombs. How true is this?",
        "response": "Well, they didn't have gunpowder, but they did their best with what they had: they digged tunnels under enemy fortifications and then they set the supporting pillars on fire, causing the tunnel to collapse. They used \"tunnel bombs\", only without the bombs",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How on earth are radiotrophic fungi able to convert radiation to food?",
        "response": "While we don't know the full metabolic pathway, it actually seems to be very similar to photosynthesis. In photosynthesis, plants use a pigment, chlorophyll, to capture the energy from light in the visible and UV range. That is then used to fuel chemical reactions to ultimately produce ATP, which is used for energy and growth. In this case, instead of chlorophyll, the pigment used is melanin. And the light is just at a much higher frequency. Remember, gamma radiation is just very high energy light. So the fungus uses pigment to capture the energy from the gamma rays and turns that into usable chemical energy for the organism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do doctors tell us to not eat after we brush our teeth and vice versa?",
        "response": "Basically because we attack the coating on our teeth with acids. If you 'rub' those in the damage done could be much worse. This is After you eat , not before , that doesn't matter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there so many English news presenters in the US?",
        "response": "The British accent is considered to be trustworthy and therefore perfect for news programs.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will a solar panel generate more electricity when moving towards the sun?",
        "response": "I can't give you a full answer, but there are two main effects that have to be taken into account. As the panels move towards the source, the energy of the photons gets blue-shifted, so the panels would be receiving a greater energy flux overall. However, solar panels are optimized to collect a specific frequency of light. If the light gets shifted above the optimal range, the overall energy collected could decrease.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the feeling someone gets in the gut when nervous or excited we call \"butterflies\"?",
        "response": "from what ive learned in biology this semester, its your body switching to sympathetic. parasympathetic is rest and digest, chill mode and sympathetic is adrenaline sort of thing. and by switching to sympathetic it basically turns off your digestive track putting it to a hault thats my best answer, not sure if true im just guessing here",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are psilocybin mushrooms illegal and listed under Schedule I when they have lowest harm rate Vs. alcohol, cannabis, cocaine, ecstasy, heroin, and tobacco and also have profound proven medical benefits?",
        "response": "The same could be said for Marijuana or even ecstasy and LSD. In truth American drug laws haven't receive a serious restructuring on a national level in a very long time. That is why a lot of drugs with medical benefits or low risk of abuse are still classed as Schedule I.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Given enough time, will our deserts eventually turn from sand to powder do to weathering?",
        "response": "The biggest deserts do have very fine sand. But if it gets fine enough, it tends to get picked up by the wind, carried far away, dropped into the ocean, where it sinks down to the bottom, building up into sedimentary rock..... and the cycle repeats. So there's some sort of lower limit on sand grain size, related to the intensity of the wind in any given location. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How fresh water fish populations spread from one river network to another without going through (presumably deadly) seawater?",
        "response": "I wondered that about fresh water mussels. So I asked. They have a free living form which basically hitches a ride in the gills of fish. This means the same species can be in one river system even though they are mussels. Similar events can occur for other species. Egrets and other fish eating birds will fly from one river system to another. Over geological time species can be transferred. All watersheds border each other so it is not travel over hundreds of miles but perhaps ten miles. Larva can remain in a bird's mouth during such a flight.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If all possible shades of a single colour were mixed together in equal parts, what would the colour be?",
        "response": "> If all possible shades of a single colour A \"single colour\" is not a scientific term. Technically, a \"single color\" would have only one frequency component and have only one shade. If you mix two (or more) differently colored paints together, you get something in between the original colors in the [CMY color space](_URL_1_). If you mix two (or more) differently colored light sources, you get light in between the original colors on the [RGB model](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between normal sensation and pleasurable sensation",
        "response": "we are evolved to enjoy the sensations experienced by sexual organs so that we (the human race, as well as other animals) will want to do things with them that feel good and lead to babies. arms dont make babies",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How you start a Crypto-Currency like Bitcoin or Dogecoin?",
        "response": "You create a mining program, a wallet program, and a website to promote it. That's about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does crossing over \"cleanse\" chromosomes of mutations?",
        "response": "[The mechanisms involved in carrying out crossover are related to the mechanisms involved in DNA repair, and there is some evidence indicating that crossovers occur more often in circumstances when DNA might be more prone to damage.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If i died in outer space, would my body rot or would my beautiful corpse be preserved?",
        "response": "Decomposition in the human body starts within - first your body's own digestive enzymes break itself down, then bacteria in your gut will begin decomposition as well. So you will begin to decompose until you're completely dessicated from exposure. Depending on proximity to a heat source, you may or may not freeze.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does fever (or any other symptom) provide any benefits?",
        "response": "Yes, a fever helps in two main ways: First, most things that make us sick, like viruses or bacteria, have adapted to our very specific body temp - ~37C or ~98F. When our body finds something inside us that isn't us, it raised the temperature a bit to make it harder for those germs. Second, a bunch of parts of the immune system work better at slightly higher temperatures. The cells that eat bacteria and viruses, for example, are better at it when the temperature is a just a little higher than our regular body temp.  So when we have an infection, our body raises its temperature a little bit to make life harder for the bugs, and easier for the things that kill them.  & nbsp; It's similar for other symptoms. Mucus in your nose helps catch things so they can't get any further inside. Coughing and sneezing expels bad things. A lot of the unpleasantness of being sick is our own body fighting the germs, rather than caused by the germs themselves, but these things help us get better faster.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What dose the R [Random] in RAM [Randomly Accessible Memory] mean?",
        "response": "It means you can read any memory location at any time without passing through other memory locations on the way there.  A record, for example, would be completely non-random access memory. To access the last track on a record (using the designated needle landing zone) you need to play all the previous tracks. A hard drive is also non-random - the read armatures needs to physically move to the location to be read, and depending on its prior position this may occur quickly or slowly. The random is simply that if you were to access locations based on a random number generator the access time would not suffer - you need no prior knowledge of the information to be accessed to get optimal seek times.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the Greeks thought their gods were real, why did writers make up fictional stories about them and consider them to be true stories?",
        "response": "Greek writers like Homer took existing legends and dramatized them, in much the same way that Shakespeare took real life figures like Caesar and Richard III and make them into plays. They served as a backdrop for those author's creativity.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do deep burps sometimes sting the nostrils?",
        "response": "Because you've been drinking something carbonated.  The CO2 gas from the carbonation continues to be released in your stomach, and actually speeds up its release since there are a lot of nucleation sites, which the glass/plastic didn't have. (Side note, nucleation sites is fancy talk for an irregular shape that gives the gas a helping had at becoming un-dissolved in the liquid.) When the pressure from the CO2 gas gets up there, your stomach releases the pressure, usually as a belch.  But CO2 is fairly dissolvable in water, so as it passes over your wet tissues, some of it will convert back into carbonic acid.  If that happens on extremely sensitive tissue like the inside of your nose, you can feel the acidic sting. If you get the same concentration of CO2 gas around your eyes you can feel the same kind of effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does adding fiber to your diet help the digestive system?",
        "response": "Your feces is made up of small amounts of water and mucus, dead cells from your gut, bacteria from your gut, and any undigested food you have left over. When you're healthy, everything on that list stays about the same except for the last one, food remnants, which depends on what you eat. Fiber is a part of food you can't digest. Since you can't digest it, fiber automatically gets added to your poop and helps to determine the consistency. It also helps absorb water and waste products (toxins) as it passes through your intestines.  When you don't eat enough fiber, you don't have enough undigested food left over to add to your poop, so your poop can't absorb enough water and it ends up being really hard. That's why you get constipated. Your body also has a harder time clearing out certain waste products, which can lead to a stomach ache, among other things.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is every pixel on a monitor controlled individually?",
        "response": "ACTUAL ANSWER: most screens are subdivided into squares or columns of pixels. The actual pixels are made up of 3 subpixels. Yes, each subpixel has two wires going to it, usually one wire above going up and down and another line under the going sideways, like a grid with subpixels located at the intersections. Inside the screen there are \"column driver\" chips that take binary address along with color and intensity and convert it to a signal to drive the subpixels. If your monitor is say 1920x1080, you can have twenty 192x540 blocks each driven by their own driver. All these chips are then connected to the master chip that takes input from your videocard, does address conversion from x,y,intensity to column,x,y,intensity. This master chip has very few data lines coming from the videocard.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what age do human babies become more intelligent than fully grown intelligent animals of other species?",
        "response": "You often see \"X is as intelligent as an _n_ year old child\" where n is usually in the 3-5 years range, in my experience (and X is usually something fairly bright like a chimp or a parrot). But these cases are usually talking about ability to pass some sort of test of intelligence (certain types of reasoning, solving simple puzzles, vocabulary, etc). In a broader sense it's hard to compare, because intelligence is not some quantity like height or weight. Instead it's sort of the sum total of the ability to accomplish various mental tasks---it's more like physical fitness, or dexterity. As a result, it's hard to pin down exactly, because maybe a 5 year old is good at some tasks, and a chimp is better at others, and how do you say which is more intelligent when the abilities don't exactly match up. Which isn't to say that intelligence doesn't exist at all. There's got to be some \"thing\" which humans have more of than herrings, but it's not easy to pin down.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't US employers and unions work together for mutual benefit like they do in Germany? How can we fix that?",
        "response": "Because this issue is far to politicized in the United States and treated as a zero sum game. Corporate shareholders want to hear profits, not about how the company is working with the labor unions to ensure everything is hunky dory",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Priceline’s tickets often cheaper than the airline’s tickets for the same flight? Is Priceline just reselling tickets they already bought?",
        "response": "They enter into agreements with airlines to purchase unsold tickets at a discount. This way airlines are able to make at least some money on the seats while Priceline absorbs the risk of potentially never selling the seat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Babylon in Reggae culture.",
        "response": "It's related to the fact that a lot of reggae lyrics have their roots in Rastafarian culture. In Rasta beliefs, 'Babylon' represents the greedy, corrupt, materialist white/western society, while 'Zion' is their promised land, tied to Africa and particularly Ethiopia. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does human (in general) seem to recall/retrieve dirty vocabulary much faster than “normal” ones?",
        "response": "_URL_0_ This is sort of tangentially related, but it speaks to why what you're describing happens; swearing isn't just encoded in the sense of vocabulary in our brains, it's also encoded emotionally. This is why it's much quicker so say \"Fuck!\" when you stub your toe than \"I just stubbed my toe!\". Swearing appears to be much more quickly accessible as an emotional response, similar to grunting or yelling in pain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does sleeping help us get over a sickness?",
        "response": "You conserve energy, which your immune system can use to combat the infection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do fish survive in such harsh conditions?",
        "response": "This is an excellent topic, as it draws our attention to the environment in which living beings live. I offer as an example: how do flowers, which are very delicate, able to survive in the hot sun day after day? Have you ever thought about what would happen to you if you spent just one total day in the same conditions as a plant? Colder than you like in the morning, hot in the day, sun on your skin all day long...  Yes, this is off the subject, but my point is to emphasize how little we consider when we think of the living conditions of other beings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was it just chance that Old World diseases wiped out 90% of the New World population instead of vice versa?",
        "response": "Hi all, I know *Guns, Germs, and Steel* was a fun read, but it is not peer-reviewed primary research, it is not necessarily consistent with the current state of anthropology, and at any rate reading it doesn't make you an expert. So please, let's reserve top-level answers for people who are working in relevant scientific fields. Also, OP, since this thread is old and hasn't gotten any clear expert responses yet, you might also consider /r/AskHistorians.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are cough suppressants added to medications with Guaifenesin such as Mucinex?",
        "response": "So guaifensesin, as you said thins your mucus, allowing it to more easily be removed. It is often given with dextromethorphan, a cough suppressant. It does seem counter intuitive to mix expectorants and cough suppressants. But cough suppressants don't stop you from cough per say, so much as they decrease the irritation in the throat that leads to chronic coughing during illness. If phlegm or mucus gets dislodged due to the expectorant, and enters your throat, you will still cough it up when on the cough suppressant. The cough suppressant just makes that 'tickle' in your throat stop making you cough so much.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do the planets revolve around the sun on the same horizontal plane? Why don't some of them orbit in a more latitudinal way?",
        "response": "When the solar system was first created it was just a big ball of gas and dust. This cloud would naturally be rotating because when all of the bits that make it up pulled together they didn't pull together straight into the center, they pulled together at odd angles and eventually all averaged out to a steady spin. If you take a cloud of gas in space and spin it, it will form into a disc. This disc started clumping together around particularly dense bits of gas or large bits of dust. These clumps are what formed the sun, the planets and everything else in the solar system. Since they all were formed from the same spinning disc they all rotate in the same direction on the same plane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does urine smell the way it does?",
        "response": "The exact cause of urine odor has not been extensively researched and remains an area of active investigation. [These investigators](_URL_0_) have published a couple of papers looking into the volatile compounds given off by urine and have created odor profiles based on the concentration of different molecules. However, they found that the odor profiles vary by individual and in between sexes. Interestingly, the subjective odor of urine can be different in varying disease states. For example, urine with bacterial overgrowth can have a more ammonia smell where as disorders of amino acid metabolism can produce odors ranging from rotting fish (in trimethylaminuria) or sweaty feet (in isovaleric acidemia) to maple syrup (in maple syrup urine disease).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there thermal neutrinos?",
        "response": "The [relic neutrinos](_URL_1_), originating from big bang, are in thermal equilibrium, with a temperature of about 1.95 Kelvin. They are very low-energy, but PTOLEMY experiment [may have a chance](_URL_0_) to detect them by neutrino induced beta decay.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I don't want a tan. I want to be paler. Is this possible?",
        "response": "Avoid exposure to the thermonuclear sky furnace. Don't resort to chemicals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could a mosquito actually pierce the skin of a dinosaur?",
        "response": "Some of them did have thick bumpy skin, others (as far as we can tell) had smooth leathery skin. There's some evidence that later dinosaurs had feathers. Even the heavily armored ones had places a mosquito could get to, and the mosquitos then were a whole lot bigger.  Could they get dinosaur DNA from a mosquito? Sure, in theory but it would have to be an extremely well preserved one for the DNA to be even partially salvageable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Immune System Question",
        "response": "Also keep in mind lets say you have a say bacteria that expresses a patter of \"3453223349927\" Your body might have a B cell that recognizes the patter of \"2233\" as foreign, my body might have a B cell that sees \"3349\" as bad. The job still gets done it recognizes it as foreign and mounts a response. That B cell might also recognize another type of bacteria if it has that same pattern in it also.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did Hitler and the Nazi party want for Europe and Germany politically.",
        "response": "Hitler really wasn't the economic genius that a lot of people somehow think he was. The German economy was already recovering by the 1933 when he came to power (the previous decade was referred to as the \"Golden Twenties\" because of the country's economic success). Instead of improving the economy, the Nazis created an economic system that was doomed to fail if a war did not start - any development was a result of massive amounts of borrowing from other countries so Germany was saddled with huge debts. Conditions did not improve for workers either, despite what their propaganda said - hours increased, average wages actually decreased, and unions were banned. Basically, the economic plan was \"do what it takes to prepare the country for war. When that's been won wel¡ll be rich in resources and won't have to worry about paying anything back.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that different human populations (or races) have evolved different physical attributes but that cognitive abilities remain more or less equal?",
        "response": "The difference in physical attributes, while noticeable to other humans, is almost trivially small compared to interspecies differences. Add to that the fact that we have yet to agree on a consistent, culturally agnostic way of thoroughly testing cognitive abilities.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why do we sense five basic tastes (sweet/sour/bitter/salty/umami or savoury)?",
        "response": "Sweet - Your basic energy unit is glucose, this taste makes you want to eat things high in sugar Salty - Sodium is a vital electrolyte is maintaining physiological balance (water, chemical, energy production, ect) so you need foods with it too. Umami - Tripped by the amino acid glutimate, and not present in all people. Belived to help attract you to protein based meals too, making for a balanced diet. Bitter - Trips when you eat things with alkaloids and nicotines. These chemicals are present in a wide variety of poisonous plants. Good detection of these can help you stay alive. Sour - Trips in acidic foods. Can both be a warning from poisonous food and needed food like lemons for vitamins",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why a blasting cap makes C4 explode but burning it does not.",
        "response": "1. An explosion is a rapid increase in volume and release of energy in an extreme manner 2. Burning is the sequence of exothermic chemical reactions between a fuel and an oxidant accompanied by the production of heat and conversion of chemical species. It's all about rate of change Edit: Fire is slow, explosion is fast",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a theoretical ceiling to the human ability to learn?",
        "response": "Certainly. One of the major anthropological findings we see in human evolution is that, over time, the size of the cranial cavity increased vastly. It is therefore likely that future humans will be able to grasp even more complicated concepts than we could ever hope to. Who's to say that any alien races we encounter wouldn't be vastly more evolved on a physiological/anatomical level than us, giving them greater mental abilities?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Many modern children are fascinated by dinosaurs. What were children similarly fascinated by before the discovery of dinosaurs?",
        "response": "Not a historian, just someone who likes to lurk and learn new things, but I can maybe point you to a few similar questions I’ve seen about kids and their obsessions while you wait to hear from an expert. [This post](_URL_2_) has an ancient Roman source from u/rkiga that mentions a toddler obsessed with birds. Further down in the comments, u/Kyncaith briefly discusses Onfim, a young boy whose doodles on birch bark were preserved, and that these drawings show he daydreamed of becoming a warrior and drew himself as a wild (but friendly) beast. Link to the source [here](_URL_1_). u/kingconani recently [discussed](_URL_0_) how literature in the 19th century for young girls let them pretend to be princesses, still a common obsession as evidenced by Frozen mania. Those are the only two I remember seeing off the top of my head, but hopefully it will tide you over until you get a more detailed answer from an expert.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is \"IMBD\" considered more official (or truthful) than \"Wikipedia\", even though both can be edited by anyone?",
        "response": "do you mean IMDB? and IMDB isnt considered more official or truthful than wikipedia, theyre handling totally different things. Theyre bot databases, but one is strictly working with movies, while the other works with everything else.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I understand the obvious, crappy ramifications of ISP's offering fast lanes, what's the difference between charging for fast lanes and like, say, a supermarket charging for premium product location (eye-level, end caps, special displays)?",
        "response": "It actually isn't very different at all from charging for product placement in a supermarket. Except for one thing - supermarkets are not government enforced monopolies. ISPs in much of the U.S. are monopolies. That means in most places the consumer has no choice to switch to a different ISP.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How and why Britney Spears went insane (Pics in comment).",
        "response": "I pegged the head shaving meltdown as a severe adderall or meth addiction. Courtney Love tells people in interviews that Britney told her that her father molested her and now he's her legal guardian. Whether that's true or not, I think she was pimped out by her parents at a very young age, worked half to death, was manipulated by the media into being a sex object, wasn't that smart to begin with and then was torn apart when she actually dared to have babies, get pregnant, and be a wittle bit chubby. Its actually incredibly sad",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the contraction of \"will not\" \"won't\" and not \"willn't\"?",
        "response": "Willn't is valid if somewhat archaic - Charles Dickens used it. Won't is a contraction of wonnot, which was itself derived from an alternative for will used a long time ago, namely woll.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why my phone battery doesn't drain at a constant rate",
        "response": "When it gets low, it turns off some things. I suspect it started doing GPS checks a lot less often, dimmed the screen, and slowed down the CPU.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do humans really affect the environment all that much?",
        "response": "[Intergovernmental panel on climate change](_URL_1_) [national academies of sciences](_URL_1_) [nasa](_URL_0_) the above are reports on global warming. i can also provide many more on that topic, as well other anthropogenic disasters such as the Holocene Mass Extinctions. we're currently living in the holocene fyi.  its indisputable that humans are seriously messing up the earth.  edit: people, please top downvoting op. s/he's genuinely curious and he's asking for proof. s/he's NOT being close-minded and rejecting evidence, s/he's asking for it and being very civilized. i for one am proud of him/her. there's no need to be condescending, patronizing, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have the people in the middle ages or before found dinosaur bones, and if yes, what did they think about them?",
        "response": "I know they're not dinosaur bones, but fossilized ammonites were thought to be the petrified remains of coiled snakes in medieval Europe. Sometimes snake heads were carved or painted onto them. And in Nepal and India, they were known as [saligrams](_URL_3_), and were considered manifestations of the god Vishnu. edit: there are older threads that address this question: [Did scholars of the ancient world ever find and examine fossils? If so, what was their understanding of them?](_URL_4_) [Did people know about dinosaurs before fossils were found thousands of years later?](_URL_0_) [Any examples of Ancient Paleontology?](_URL_2_) [Did ancient people ever dig up dinosaur fossils during construction projects?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do trees have a lifespan?",
        "response": "Most organisms (including most trees) will start to die more often (mortality rate) as they get older (once matured). This gives you an average age they will live to. Some organisms though have an unchanging or even decreasing mortality rate as they get older. They basically don't age and are called biologically immortal. However the longer a life form is alive (even if they aren't aging) the more likely they are to die from some other cause so they will still have an average age they will live to. Here is the wikipedia article title [list of long-living organisms](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Jews forbidden from entering the Temple Mount?",
        "response": "Some Jews will avoid walking on the Temple Mount at all to avoid entering where the Holy of Holies used to be, which is where the Ark of the Covenant was kept. According to tradition/religious law only the High Priest on Yom Kippur was allowed to enter. The Judeo-Christian god has a track record of being unforgiving about such rules, an example being someone who violated the rule not to touch the Ark because they were trying to catch it from falling into a ditch was struck dead for his troubles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the intensity of the radio spectrum of electromagnetic waves emitted by the sun that reach the earth's surface?",
        "response": "By integrating Planck's Law over the wavelengths you're interested in and given the sun's black body temperature, you should be able to calculate the energy put out by the sun. Then figure out what fraction of that hits a square meter on the earth.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would the process be to repeal marriage equaltiy?",
        "response": "Supreme Court reversals are exceedingly rare, and it would take an immense amount of public pressure to even get the cases pushed through. I don't see it happening. It's the same way that even when we've had conservative courts, they haven't tried to overturn Roe v. Wade.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the burn degrees scale work, and what are the differences for treatment?",
        "response": "1st degree (superficial) is a sunburn. Only epidermis. 2nd degree (partial thickness) has blisters. Partly through the dermis. 3rd degree (full thickness) white, waxy, painless. All layers of the dermis. 4th degree is charting of muscle and bone. The immediate treatment for all burns is to stop the burning process (don’t use Ice!) remove watches and jewelry, cover with dry sterile dressings, maintain body heat, and manage pain. If inhalation burns, keep a close eye on airway swelling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was salt used as a preservative before refrigerators?",
        "response": "Bacteria is what spoils food. Bacteria dies if it gets covered in salt or if food doesn't have any water/enough water in it. Salt directly kills bacteria on contact (by sucking the water out of them), and also draws liquid out of meat, inhibiting bacteria growth in/on the meat. Did the meat taste bad? Yes. Did it kill you when you ate it? No. What do you think beef jerky is?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the martian surface have pebbles?",
        "response": "Weathering still takes place on Mars, it just does so much more slowly than it does on Earth. That said, water is believed to have been active fairly recently (in geological terms) in Gale Crater (Curiosity's site), and those pebbles may very well be water-deposited (some are believed to have been, though I don't know if these particular pebbles were).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How some species like the Mantis Shrimp can see more colors than a human?",
        "response": "They have more types of color receptors (cones), most* people have 3 types and different animals have more (and the location/orientation matters as well).  *some people with mutations actually can see more colors than most: _URL_0_ edit: and a pretty good explanation, focused on deer but you'll get the concept: _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "For guys, when one of our balls disappears inside us for a little and we have to wiggle it back out to feel it again... what's happening?",
        "response": "It is a medical condition as someone has already partially stated. I believe it is called an ascending testicle. My doctor assured me that it is not all that uncommon (I have the exact same problem.) however if it causes you any discomfort then you should talk to your GP about is ASAP",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there an advantage to different shaped pupils?",
        "response": "YES! [(LINK)](_URL_1_). But mostly it depends on the insides of the eye it seems. Monofocal vs Multifocal eye systems have different requirements for their retinas to function efficiently. Cats for instance have different shaped eyes depending on the size of the cat, Larger cats have round eyes and small cats have slit eyes. The [Eurasian Lynx](_URL_0_) was an example of an eye that is in between round and slitted given in the article. tl;dr - it depends on what's underneath and what is most beneficial to the organism, but yeah, there is a difference in how the pupils focus light into the eye.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Sheep (Especially lambs) become the most common animal to be found or themed at nurseries, baby products, and commonly associated with early childhood?",
        "response": "Sheep are famously docile and helpless, requiring help (from humans or dogs etc.) to keep them safe. Lambs, even more so. This remind us of helpless babies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How \"Hell\" is pictured in the different religions of the world.",
        "response": "Jehovah's witnesses believe bad people will locked away in an abyss with Satan when Jesus cleanses the Earth. They will not be in there being tortured by Satan. Instead, they will be nothing, just out of existence",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When does a theory become fact?",
        "response": "> When does it become non-disputable? Nothing is ever non-disputable in science. But: The confusion here is a very common one. It boils down to the fact that words can have multiple meanings, and in this case, \"theory\" can mean two different things: (1) In common non-scientific parlance, \"theory\" means something like \"guess\", or perhaps \"educated guess\". (2) In science, it means something much closer to \"fact\". Not literally \"fact\", but when a scientist says something is a \"theory\", they are pretty much coming as close to saying \"non-disputable\" as they ever will. Unfortunately, in some politically charged cases, like \"the theory of evolution\" and global warming, people who have a vested interest in disagreeing with what scientists are saying use this confusion about the English language (i.e. \"theory\" may mean different things in different cases) to sow confusion about the actual issue at hand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are drinks (water, milk, etc.) made up of cells or inorganic molecules?",
        "response": "Anatomy student here. I'll do my best to answer your questions.  > I understand that milk would be made up of organic molecules and so are most drinks...but water is inorganic, right? Water is inorganic. Something is organic if it has carbon. Water has only hydrogen and oxygen. No carbon.  > How does the body differentiate/does the body differentiate between these different compositions? Water is absorbed and processed as is, and most water lost is through sweat, breath, or urine. Most other substances are broken down or digested, but certain artificial substances such as Splenda are inorganic as well as indigestible, because the body cannot break them down to generate energy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes you to dream about random people you havent seen in years?",
        "response": "I've read somewhere (at work, on mobile so I can't look up sources) that the popular theory with seeing people in dreams is that they're all people you've seen before. So if you're walking down a crowded city street in your dream, every passerby's face is one you've seen before.  As for 'why,' I have no idea.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't events that sell out in minutes just raise the price of the ticket to make more money?",
        "response": "Some people are actually decent human beings and don't want to make it so only the wealthiest of people can go to the events... even if means selling out in seconds.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Were the Mongols in Genghis Khan's army big in size?",
        "response": "For what it's worth, Giovanni da Pian del Carpine (a Papal emissary to the Mongols) describes them as \"almost all are of middling height.\" (Source: Historia Mongalorum) So maybe they were sort of Italian-sized. I don't know how that compares to, say, contemporary Chinese. Genghis Khan's army was a kind of national militia comprising a huge swathe of Mongol men. This was something of a break from Mongol precedent -- Jamukha, for instance, had stuck to the traditional Mongol ideal of having his army made up of the Mongols' noble warrior class, whereas Temujin (Genghis Khan) was willing to recruit lowly shepherds and such into his army. Anyway, given that the Mongol army was not particularly selective, and comprised a huge fraction of Mongol society, I find it unlikely that Mongols in the army were markedly different physically from Mongol civilians (except in that they're essentially all young-ish adult males -- i.e., the usual ways soldiers differ from civilians).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if a politician running for office (or after office) writes a book and someone, a person or a company, buys a gazillion of book to give away to employees/friends; isn't that a way to get around campaign donation / bribing Laws?",
        "response": "You know what's another fun way? I'm going to give you 10 grand a month forever because I like you and you're a cool guy. Maybe I'll buy lemonade from your kid's lemonade stand for 50 grand. By the way, would you mind taking a look at this new bill?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the brain tell the body when to die?",
        "response": "It doesn't. People aren't programmed to drop dead at a certain time. People die because of organ failure, disease, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are companies like Virgin or Straight Talk able to give you \"unlimited\" data for cheap while larger companies like AT & T and Verizon charging 150+ for a couple of GB?",
        "response": "Because Virgin and Straight talk utilize bandwidth throttling and also use unused carrier bands from the major providers. Verizon and other Major carriers provide the hardcore backbone for primary subscribers, and then use the secondary carriers to give a cheaper option, but at reduced functionality. They may not cap the data but after you pass a certain point you are limited to 3G data or throttled down to 3G speeds after a certain point until your ne month.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does smoking marijuana make you hungry?",
        "response": "Your appetite is regulated by a region of the brain called the hypothalamus. When your appetite is supressed, this is due to the hypothalamus ordering the release of a hormone called leptin.  When you smoke marijuana, it's main active ingredient, tetrahydrocannabinol, binds to certain specific sites called receptors. The main receptor in question is CB1.  When CB1 is activated, leptin production is reduced, thus increasing your appetite. The main mechanism in which this happens is not yet fully understood.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are condoms only 98% effective with perfect use?",
        "response": "Just to add, percentages on birth control don't mean what you'd think they mean. 99% means out of 100 couples having sex all year, 1 of them will get pregnant using only that product, so it's going to be better than 99/100 times. Along with what you listed, they can also go bad due to age and where they are stored when not being used. If they dry out in the package, they'll tear.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do men prefer standing to pee?",
        "response": "In general, it's probably because it's faster and more convenient to pee standing up. Lifting a seat and unzipping your fly is a second of time while undoing your pants and sitting down is somewhat more inconvenient in comparison.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Marriages for \"green card\" or visas",
        "response": "Can't say how this works in UK. However in US, a fiancee visa is granted, then the couple must intend marry in courthouse within 90 days. Once legally married, the resident spouse files petition for the alien spouse to obtain a green card.  This process takes 6months to a year. final step in process is a face to face interview with a immigration officer.  Once petition is approved, a provisional 2year green card is issued.  After 2 years, the resident spouse petitions for the permanent green card.  If couple separates before 2 years, the alien ex-spouse is expected to leave the country within 30 days of separation.  After the 2 year petition for permanent green card is approved, the couple can divorce without any repercussions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do you calculate the distance of stars etc from Earth?",
        "response": "This depends on how far away the star is. For relatively close stars, the parallax method is used. By calculating the angle it moves in the sky over the course of 6 months and using basic trigonometry you can find the distance. [These diagrams show how](_URL_1_). For further away stars, a mixture of techniques are used. First, using [type IA supernovae](_URL_2_) help determine distance. Because of the mechanism, the explosion is always roughly the same intensity. We can use this to determine how far it is as we known how the intensity falls with distance. [Cepheid variables](_URL_0_) are also used. These are stars that pulse over time, with the period of pulsing very strongly correlated to its absolute luminosity. Given this and a few other parameters, the distance can be found again by using the luminosity. There are several other methods, but these three were the main ones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are eye floaties?",
        "response": "First things first: many, I'd say most, eye \"floaters\" are harmless. The vitreous humor is the liquid that fills most of your eye. As we age, small amounts of the liquid can basically form aggregates: insoluble particles that float within the vitreous humor. This is the most common cause of floaters. They will eventually settle out of the line of sight, which is why they don't steadily accumulate throughout our lifetimes (although they do become more common as we age).  That said, the sudden appearance of LOTS of floaters, or the presence of other symptoms with floaters (perceived flashes of light when there aren't any, loss of peripheral vision), can be a sign of severe eye conditions, like partial retinal detachment. Some good reading [here] (_URL_0_) if you'd like to know more. Hope this helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are memories from LSD and 'shroom trips so vivid +20 years later?",
        "response": "In the same way an exotic vacation would be memorable, reality-shifting can be memorable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did we develop the tongue for advanced speech or did we developed advanced speech out of the tongue?",
        "response": "What allows for speech isn't the tongue. Apes and chimps have tongues. From what I remember in evolutionary biology it is our arched hard palates and the shape of our jaw that give us more space in our mouths that gives the tongue greater freedom of movement that makes advanced speech possible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do banana slugs have territories? Or do they just roam about?",
        "response": "There is a sad deficit of banana slug literature! However, other snails are known to prefer dusk/dawn haunting of areas where there are humans ( [Table 3 and following paragraph](_URL_1_) ) and get upset/scatter when it gets too densely populated, and the fact that they have receptors that make [chemical-based memory](_URL_0_) and amnesia possible makes it seem likely that snails/slugs remember and form positive/negative associations with locations. Also, I'm pretty sure slugs have been popping up in the same geographical regions since the Pleistocene era.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could I have a bag of neutrons? And if so, what would it look like, would they be reactive?",
        "response": "There are places where you can gather lots of slow neutrons and confine them into a region of space, for example the ultra cold neutron lab [here](_URL_0_). Neutrons undergo beta decay with a half-life on the order of 10 minutes, so you can’t hold onto them for very long.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does a blackhole affect photons of different frequencies differently?",
        "response": "[Gravitational redshift](_URL_0_) is a percent change in wavelength. Therefore the light that is just outside the event horizon would appear redder, with the reddest light (longer wavelengths) getting shifted the most. Inside the event horizon, it will all be trapped, regardless of color, as the speed of light is constant for all frequencies. Edit: Wiki link",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were the last N digits of Graham's Number calculated if the number is so big that it does not fit in the observable universe if each digit was written in a Planck volume?",
        "response": "Basically because we know how to calculate it. There isn't enough computing power to determine the whole number, but we can still get many of the terminating digits. Think of it like you're multiplying two eight digit numbers by hand-- it's easy to get the last few digits. By definition, Graham's Number is the 64th iteration of an arrow-notated sequence of nested powers of 3, so we know the \"formula.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the NFL, why doesn't the RB throw a forward pass past the line of scrimmage when he knows he's going to get tackled for a loss?",
        "response": "Too dangerous. RBs can't be counted on to make smart decisions. Also, there may be linemen blocking down field and you'd just end up getting a penalty for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do shoelaces untie themselves while headphones get themselves into knots?",
        "response": "Headphones are often covered in rubber, which is a sticky material, whereas shoe laces are often made of fabric, which is a soft and somewhat slippery material. If we had shoelaces made of rubber, they would stay longer together and vise versa with headphones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't i move a toe without moving all of them?",
        "response": "Your fingers actually have very similar limitations (though not quite as pronounced) due to redundancies in the anatomy of our hands. Make a fist and place it on a flat surface like a table, so your knuckles face up and the middle third of each finger is laid against the table. Now extend and retract each finger 1 at a time without moving the others or taking your fist off the table. Notice anything about the ring finger? Yup, you can't do it without extending the middle finger a bit too. It's because your middle and ring finger are operated by the same tendon, so you can't move one without the other. Same kind of thing is going on with your toes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is snow white but ice is colorless?",
        "response": "An individual snowflake is transparent, too. Solid ice has a uniform crystal lattice, so all the atoms are neatly arranged, and light can pass through without being bounced around and distorted too much. A pile of snowflakes are arranged randomly, so the light gets scattered around and cannot pass through cleanly. So even though each individual flake has a crystalline lattice and is clear, the whole pile of snow is randomly arranged and light is reflected off the uneven surface.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does there exist a chemical that is non-toxic and has a freezing point above the temperature of the human body, but low enough to be put in one's mouth comfortably?",
        "response": "Dark or white chocolate, some varieties will melt around 105-120F. Just make sure it's not tempered.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't someone just start another currency called BotCoin?",
        "response": "They have, most notably \"LiteCoin\" and \"PPCoin\". One imagines, though, that the success of private digital currencies will diminish as more are created, especially if they're being created as get-rich schemes for their creators.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were so many prominent serial killings done in the 1970s?",
        "response": "It's a media cycle thing.   It was in the popular imagination at the time so the media latched onto it and reported heavily on it.   There are currently a number of active serial killers known that no one ever reports on. One in NYC has been dumping bodies in the same place for decades.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do speakers emulate real-world sounds?",
        "response": "Fundamentally, you can represent any sound as a combination of sine waves of different frequencies (you can actually do it as a combinations of square or sawtooth or triangular waves too, but sine waves are the most convenient). The upshot of this is, any sound can be represented as a single continuous waveform. This is useful, because it means that all you need to do is match the movement of the speaker cone to the shape of that waveform, and you can re-create it. Going the other direction, when you record sound you record the continous waveform (a microphone functions exactly like a speaker, just driven in reverse), and you can actually, through a process called the [fourier transformation](_URL_0_) break a complex sound (like say, Pavarotti's voice) down into its constituent sine waves for analysis/modification.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does every coordinate on earth receive identical hours of aggregate sunlight per year?",
        "response": "The answer is no, but only barely. Northern hemisphere gets a little bit more daylight because the earth's perihelion is during the Winter in the northern hemisphere, making it slightly shorter. Also, the poles get a little bit more daytime than the equator because they spend more time in sunrise/sunset. Given the above, I would suppose the north pole would get the most daylight hours, but I'm not sure whether bonus time from early sunrise/late sunset on a tall mountain would be enough to overcome the difference. For reference, the average average is more than 12 hours, because of atmospheric effects and the size of the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the New Deal by FDR help the US?",
        "response": "The idea goes under Keynesian economics. Basically, in classical economics, the economy is self-regulating. If, for example, demand drops, people lose jobs and their spending money goes down, then prices will go down as well, which balances it out. Keyes said that prices are sticky--and that that drop in demand will cause a downward spiral, a crash in the economy. The only thing that can prop it up is government spending. So, in a recession or depression, have the government inject cash by either spending a lot of money on public works or lowering taxes. That's what the New Deal was. In the end, it was the massive spending during WW2 that really put the economy back on track, but the New Deal helped and gave people hope.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Burlesque vs Stripping",
        "response": "Burlesque originally developed as a racy satire show in response to economical disparities, moral squeemishness and social hang ups of Victorian England. The striptease (which differs greatly from what we would now call a striptease) was a part of the show but by no means the entirety of the show. Stripping is the removal of clothes for money with the purpose of sexual titillation. Nothing more. Burlesque evolved quite a bit since its inception 150+ years ago but the true neo-burleslque shows still use bawdy humor to mock the more conservative sectors of society while pushing the edges of what is or is not art. In burlesque, stripping is not the point of the show; it is merely an element of a larger performance. Edit: Just remembering a few things. Comedy is a huge part of burlesque. The original burlesque shows featured various comedians and comedy acts. Comedians such as Bob Hope, Jackie Gleason and W.C. Fields all got their start in burlesque.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does my body decide whether to expel excess gas as farts or burps?",
        "response": "If the gas is produced in your stomach, it becomes a burp. If the gas is produced in your colon, it becomes a fart.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do teenagers have acne but adults don't (generally)?",
        "response": "\"Acne occurs most commonly during adolescence, affecting an estimated 70-90% of teenagers.[4] In adolescence, acne is usually caused by an increase in testosterone, which occurs during puberty, regardless of sex.[5] For most people, acne diminishes over time and tends to disappear — or at the very least decreases — by age 25.\" _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does Bing still exist?",
        "response": "People go to get points for searches. I have 800 points right now and can get a variety of awards like gift cards to amazon, gamestop, best buy, I can donate money, enter raffles and other things. I use it to get free Xbox live. This really motivates people. I also enjoy their \"hot searches\" at the bottom of the page with breaking news. Lastly I enjoy their changing wallpapers.  If I legitly need to search things up for school, I use google, because yes, Google is better in searches.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do astronauts in space have to push harder, in order to have a bowel movement?",
        "response": "Explained very simply, think of it as a toothpaste tube. If you squeeze it, it will come out from the other end regardless of gravity. It might not drop as easily and might get stuck on the end of the tube, but it will come out nonetheless. Explained with a bit more Science, your gut actually has waves of small contractions pushing the contents further down the intestine. This happens regardless of whether you 'push' or not. Contracting the muscles in your abdominal area helps, but usually there is not that much need if you got a healthy diet. Gravity actually doesn't play that much of a part in bowel movements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have average people always kept pets?",
        "response": "not discouraging anyone from contributing more info on this topic - especially with regard to *how common* pets were - but FYI there have been lots of questions about pets, so check out these posts for previous responses. [When and why did people start keeping pets?](_URL_2_) [When did it become common for people to own pets? And has it always been animals like cats and dogs? Are there any examples of civilizations that had what we would think of as exotic animals as common pets?](_URL_0_) [What is the history of cats as pets? When did people start commonly keeping them? Any other details welcome.](_URL_3_) - contains links to more posts about cats [Did Native North American cultures keep pets?](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are some liquids, like oil, very slick? What molecular properties make a good lubricant?",
        "response": "Substances like oils have many carbon atoms that are saturated, or completely covered by hydrogen atoms. If many of these molecules are near each other, they will not (generally) form hydrogen bonds because the carbon atoms do not attract hydrogen as much as oxygen atoms for example.  On the stickier side of things, sugars such as glucose have many oxygen atoms on the outside of the molecule. Oxygen is much better at attracting hydrogen than carbon, so other glucose molecules nearby (or for that matter any other substances with hydrogen atoms) will be very attracted to to sugars. This hydrogen bonding is what makes sugar sticky.  In short, oils generally have hydrogen-to-carbon bonds, which are not as strong as hydrogen-to-oxygen bonds in other substances. This is the same phenomenon which causes surface tension which is also a factor in the \"slipperyness\" of oils.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the sinking of the Belgrano during the Falklands War still controversial?",
        "response": "It seems to be because the British had set up an exclusion zone around the Falklands and stated that any Argentinian military unit found inside that zone would be free to be attacked. However, they ended up changing their mind and deciding that military units outside of the Exclusion Zone could also be attacked and this was passed onto Argentina. The Belgrano when attacked was outside of the former Exclusion Zone. For some reason there is a belief that is a war crime because it was not in a war zone. However, I've never read anything that supports that argument. One argument is that the ship was returning to port and thus wasn't a legit target, but once again how is that a war crime? How does sailing back to port render one no longer a military target? There is also the argument that neither side declared war on each other and so it was not legal to attack any ship, target, etc, but then why only the anger over that one ship?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the draft includes men and women who takes care of the children when both their parents are drafted?",
        "response": "From 1940 until 1970, there was a draft status called 3-A. It went through a few changes during the various wars that the U.S. fought during that time, but essentially it was a draft status under which you could get a deferment if you had dependent children under age 18 living at home. The status no longer exists. However, these statuses are fluid and would likely change in the event that a war required drafted soldiers. In other words, if World War III breaks out and everybody gets drafted into active duty, there will likely be a draft status put in place to protect families in exactly the scenario you describe. Mom gets drafted and goes off to war. Dad gets drafted, and he goes to the Draft Board and tells them his wife's already in combat and he has kids at home. He gets a 3-A deferment, or whatever the new designation might be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When boiling water how do air bubbles form at the bottom of the pot?",
        "response": "The bubbles contain water vapour and steam. A speck of water heated to that state expands 1700 times, easily making a bubble from 'nothing'. Edit 1700 not 3200, thanks /u/rawwwse",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has climate change made weather forecasting more difficult?",
        "response": "There are much greater factors contributing to weather prediction errors than any uncertainty due to climate change. These include the turbulence closure problem, numerical resolution, limited observational data, and parameterization schemes for condensation. Climate change uncertainty is a much bigger factor for long range predictions than for predicting what tomorrow's weather is going to be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the universe have 'bugs'?",
        "response": "As far as we can tell, the basic operating rules of the universe are *much* simpler than any computer program. The complexity we see comes from having so many different particles following those rules.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do older generations use ellipsis (…) in place of other punctuation so often?",
        "response": "Ellipsis indicates removed text. So, it's appropriate when you want to use a quote while removing text from the middle.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes celestial objects rotate?",
        "response": "Much like why they orbit, as the objects condense there's some net motion in the material they formed from, and the conservation of angular momentum means that can't just 'go away.' So a rotating cloud of stuff forms a rotating object.  They keep rotating because no other force has come along to stop them from rotating.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "From what I've heard artists on Spotify don't get allot of money from plays. Then why do almost all artists put thier songs on it?",
        "response": "Musicians don't make much from Spotify, Pandora or Youtube. They never made much from terrestrial radio or MTV. But nobody is going to elect to pay for your recordings or to see you in concert if they've never heard any of your songs or have any idea who you are.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we have an urge to pick our scabs if it only prolongs the healing process and opens us up to infection?",
        "response": "Part of the reason is during the [wound healing](_URL_0_) process, new collagen is laid down during the repair of the skin. As the collagen is remodeled, and new skin is replaced, it can be sensitive, which causes it to be itchy. Also, during the second phase of wound healing, histamines are released locally can make it itchy (similar to what happens when you sneeze).  There is also one psychological issue that causes picking of scabs. Some people with [borderline personality disorders](_URL_1_) have tendencies to pick at scabs. This is part of self-injury behaviors. So there you go.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Questions about acne...",
        "response": "> Does oily skin or the presence of oily/greasy hair over skin cause acne? Or is this simply a common correlation? Or not even that? Yes, oils can contribute to acne. One of the bacteria that causes acne is called [S. aureus](_URL_0_) and has an enzyme called lipase. Lipase degrades biological lipids, like the ones on your skin. So the oil on your skin can act as a food source for the bacteria, boosting infections. The second part of your question I don't feel as if I could answer properly, so I hope more commenters come to play",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are defendants who are found guilty (and didn't plea guilty) not also charged with perjury?",
        "response": "It's because they are not asked if they are guilty or not, they are asked what their plea is. It's the difference between, 'Did you do this thing?' 'No.' And, 'You are accused of this thing, do you admit to it?' 'No.'",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why would people want to buy bonds with short maturity dates when the return is lower than the average inflation rate?",
        "response": "Some accounts even have negative interest rates.  If you have a $1,000,000, what are you going to do with it? Ordinary bank accounts are only insured up to $250,000. If you buy real estate it's no longer easy to get if you need it fast, and can go down in value, and your paying property taxes. Put it in your mattress? What if your house burns. Sometimes you essentially pay to keep money stored and safe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does homosexuality get passed on through genetics if homosexuals do not create offspring? (This is not a loaded question. Please do not delete.)",
        "response": "Interestingly enough, homosexuality may not be a defect, at least in men. According to studies, it has been found that the female siblings of homosexual males are on average more fertile than other women. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why was the Holy Roman Empire not reinstated after the end of the Napoleonic wars?",
        "response": "This answer by u/Sid_Burn may answer your question. The OP in that thread asks your question in reverse, asking why the Holy Roman Empire was dismantled, but u/Sid_Burn definitely covered the reasons for why the Holy Roman Empire had at that time become politically obsolete. [Why was the Holy Roman Empire dismantled? Were there any people who wanted it maintained/reinstated?](_URL_0_)  This answer is, however, noticeably lacking in reference or sources and so I'm sure some others who are knowledgable in this period may be able to elaborate or provide a better answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What us the difference between 3G and 4G LTE? Additionally, what does LTE mean?",
        "response": "Yer not alone in askin', and kind strangers have explained: 1. [ELI5: What is the difference between 3G, 4G, and 4G LTE? ](_URL_3_) ^(_23 comments_) 1. [ELI5: What is the difference between 3G, 4G, and LTE? ](_URL_2_) ^(_6 comments_) 1. [ELI5: 1x, 3G, 4G, 4G LTE; what do these designations mean and what do they do? ](_URL_6_) ^(_17 comments_) 1. [Whats the difference between 4G and 3G? And is there a 2G or just a G? ](_URL_1_) ^(_18 comments_) 1. [What is the difference between 3G, 4G, LTE, etc.? ](_URL_4_) ^(_3 comments_) 1. [ELI5: What is the difference between 3G, 4G, and LTE? ](_URL_5_) ^(_5 comments_) 1. [ELI5: The difference between GSM, CDMA, 3G, 4G, LTE, etc. ](_URL_0_) ^(_44 comments_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do the NFL Playoffs work?",
        "response": "Divisional Champions: (Four per conference) Team in each division with the best overall record.  Wild Card teams: (two per conference) Two teams with the best record of non-division champs in each conference. First Round Bye: In each conference, the two division champs with the best overall record get a bye in the first round. The remaining two division champs get a home game vs. one of the wild card teams (determined by record. Best record division champ vs worst record wild card team).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't Lincoln just accept succession and tried to come to an arrangement with the succeding states?",
        "response": "There was a pretty good answer to this ( the question does keep coming up) by u/Georgy_K_Zhukov a while back [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Biologically, what makes a song catchy?",
        "response": "Repetition & variation. Repetition establishes a pattern and then variation creates unexpected surprise in that pattern. The brain tries to adapt to the pattern but needs to re-listen to the variation to grasp the nature of the unexpected surprise. The repetition can occur in one or more of the elements of music: rhythm, melody, structure, background vs. foreground, or multiple elements against each other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Jimmy Carter seen as one of the worst presidents in history? Is this a legitimate argument or are their facts to refute it?",
        "response": "Personally I think of it as just bad press. As an outsider to your country I see Mr Carter as perhaps the best president ever. He was faced with a Republican run senate and still managed leaps forward in peace in the middle east and took major steps toward carbon capture and energy self sufficiency. Even after his presidency he has used his position to make more contributions to society than any other president in recent history.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When something is depleted of battery, why does shutting it off and turning it back on again make it work for a short period of time?",
        "response": "Take a wet sponge twist it until the water runs out.  Let take it's shape. Now do it again. There are still drops left.  When the battery is dead, the part near the poles are drained and can't supply current while the middle of the battery still has some energy left. Just like the sponge, the water trapped in the middle gets absorbed by the dryer part that is the exterior of the sponge. After you put your flashlight on again, it will drain again the parts near the poles while the energy at the center travels to balance itself again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If there is no matter in space, how do comets have tails?",
        "response": "I'm not sure I understand your question, so I'm just going to explain why comets have tails. As a comet approaches the Sun, it heats up. This causes part of the comet to sublimate, turning into gas and floating way. The Solar wind, which is a constant stream of particles coming from the sun, pushes onto these particles creating the tail. This is why the tail is not neccesairilly behind the comet. Instead, it always points away from the sun.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Obtaining newsreel footage in WW2",
        "response": "UFA, the state film studio, produced two newsreels during the war. *Die Deutsche Wochenschau* (*German Weekly Review*) was produced for the domestic market and annexed countries. The *Auslandstonwoche* (*Foreign Weekly Newsreel*) was distributed to occupied and neutral countries. Neutral countries also got copies of Allied propaganda reels, and it wasn't hard for British and American newsreel producers to get hold of the German reels and vice versa, shipping them back home for further use. Military intelligence also poured over the cans particularly at their unit at Pinewood Studios for analysis.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "So there was a time when the United States and Iran were friends? How did the two nations ever become friends, and what led to the Islamic Revolution that led to the U.S. and Iran to 'break up?'",
        "response": "Set the wayback machine for 1953. Iran is a representative democracy and its parliament voted to nationalize the British-owned Anglo-Iranian Oil Company-- essentially, voting to stop letting the British take their nation's oil. The Western powers responded by arranging the overthrow of the Iranian's government in a [CIA-run coup](_URL_0_). They then installed the Shah as a autocratic monarch.   Kings and dictators tend to be unpopular when they're imposed from abroad as a replacement for democracy.  The Shah's job was to keep the Iranians in line and make sure the oil kept flowing.   In 1979, the Iranians overthrew the Shah, who was seen as a western puppet, rather than a true representative of the Iranian people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long did it take explorers to the Americas to realize that they weren't actually in India?",
        "response": "This is one of the more asked around questions here. I myself tackled it [here](_URL_3_), and here is another [post](_URL_1_) by /u/itsalrightwithme, another [good one](_URL_4_) by /u/Zhumanchu, also [one](_URL_2_) by /u/drobb In short, Amerigo Vespucci has claimed that South America is a new, previously unknown continent. Still, it remained possible that Caribbean islands and North America were in or near Asia. After Magellan's expedition, as well as with Portuguese presence in Asia, it became clear they are not close. Diego Ribeira's [1529 map](_URL_0_) is one of the first to definitely show them seperate continents divided by massive sea",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you take the contraceptive pill does it help you stay fertile for longer, seeing as you're not releasing eggs from your ovaries?",
        "response": "No. You don't go through menopause \"when your eggs run out.\" Contrary to what our awesome educational system may have told you, at menopause, you still have thousands of primordial follicles that were never ovulated. The cessation of ovulation that occurs at menopause is a result of complex hormonal changes that occur independently of follicle number.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "marginal tax brackets",
        "response": "Suppose there are tax brackets of $100, $200, with rates of 10, 20 percent. The first $100 of your income is taxed at 10%. If you make a dollar, the tax is 10 cents; if you make the full $100, the tax is $10. Now, what happens when you bump your income up to $101. If we did it your way, the tax would be 101 * 20%, or about $20 dollars. That's no good; it's not fair that bumping your income up by one dollar makes you pay ten more in taxes. So we say that instead, that 20% tax rate only applies to income *past the first $100*. That is, the first $100 you make gets the 10% tax, and only that last dollar gets a 20% tax rate. So your total tax bill works out to $10.20.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't Reddit allow people to block other Reddit users they don't want to hear or read? If I can block or unsubscribe to a subreddit, why not an individual Reddit user I do not like or find annoying?",
        "response": "Download RES. It allows you to. The link is at the bottom under tools.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know that pi never ends?",
        "response": "Well, suppose π did end. There was some last digit. Then π could be written as a fraction. Here are some fractions that approximate π: 3/1, 31/10, 314/100, 3141/1000, 31415/10000, 314159/100000, 3141592/1000000, ... If π ever stops, then you'd be able to write it as a fraction, some really long string of digits in the numerator and some really high power of 10 in the denominator. Here's the deal: people have [proven](_URL_0_) that π can't be written as a fraction at all (the word for this is \"irrational\"). Those proofs are too complicated for me to explain (or understand), but if π can't be a fraction, then its decimal representation (or its representation in any other integer base, for that matter) can't end *or* repeat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why is abstract art considered good? What is it about random splashes of paint and lines that makes it more appealing than a more realistic painting to some? How does the randomness actually represent anything?",
        "response": "They aren't \"random splashes\". Jackson Pollock's paintings evolved over time to have an underlying [fractal nature](_URL_1_).  Even people who don't like them can spot a [real Mondrian](_URL_0_) from a fake.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is happening when I get the wind knocked out of me?",
        "response": "There's this muscle in your body called the diaphragm that controls your breathing. If you get punched or hit hard near it, it can cause it to spasm and not work right for a bit, which is what we call getting the wind knocked out of you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do the gas giants have a solid core?",
        "response": "Nobody really knows for sure. However, satellites have measured gravity of some of the gas giants (non-spherical objects have non-spherical gravitational influence), and these measurements have suggested that solid cores exist in all the gas giants. However, the inference of these cores is both very difficult and uncertain. For example, Jupiter is thought to have a \"rocky\" core comprising somewhere between 5-15% of its total mass. However, the term \"rocky\" is used loosely, because we know very little about the actual composition (in part because we simply don't know all of the properties of the materials at the temperature and pressure of Jupiter's core). The story is pretty much the same with the other gas giants.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the city of Samarkand so important? How did it grow and expand and eventually decline?",
        "response": "Im no expert but its main importance is that it was basically the center of silk road trade. Pretty much every piece of cargo moving overland on the trade routes would eventually pass through the city, this meant that they were able to make a lot of money but also become an academic and cultural hotbed.   As far as I can work out despite being sacked and conquered multiple times, being sacked in and of itself seems to have not lead to a long term decline What I can gather and extrapolate as the main causes for its decline was diminished importance of overland trade, eventual loss of political power to Bukhara, then Moscow, and then being passed by the trans-siberian railroad.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why aren't lateral passes more common in the NFL?",
        "response": "They're risky. It is hard to gauge where another player is in the heat of the moment and if they are an inch ahead of you that is an illegal forward lateral. The ball is also loose. Unlike a normal pass if the ball hits the ground the ball is still in play. You can think if it like any fumble.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was the sonic boom discovered? What was the general population's reaction?",
        "response": "Lashes of whips can create sonic booms. So... very long ago? At that time there was no good explanation for it of course. Edit: Wrong word.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is Python essentially a C program?",
        "response": "In general, yes, Python itself is just a C program. But, you could write Python in any language...as long as it meets the needs of the Python language. For example, there is \"JPython\" which is written in Java. The core of Python is C, but there are also a lot of extra helpful libraries that come with Python...and they are written in Python!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where does the energy come from to cause blue shift/why is there not any extra energy?",
        "response": "Basically, energy is not conserved when considering the same thing from different reference frames. Imagine a bullet instead of a photon: in the reference frame of the gun, a bullet emitted from it will have enough energy to go through a person. In another reference frame moving very fast away from the gun, the bullet will not have enough energy to that. Both reference frames are valid, but in only one can the bullet pierce someone.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is Grand Theft Auto allowed to use cars that are almost exactly like real cars?",
        "response": "because they aren't selling cars. There is nothing proprietary about an image of a car. Just the car itself and the name.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do cigarettes have so many chemicals in them?",
        "response": "Tobacco already contains some chemicals naturally, the plant also absorbs chemicals. When the cigarette is burned chemicals will be created through combustion. Nicotine is the main addictive chemical, which is naturally found in tobacco.  Getting around to the chemicals added by the manufacturer; preservatives are added (ex. To protect the cigarettes from moisture), taste enhancers, sometimes even sugar, chemicals to aid in combustion, etc. Most of the dangerous chemicals are actually created in the burning process and are not added by the manufacturer. Tar is not added by the manufacturer, tobacco residue is a byproduct of burning the cigarette. It adds nothing of value.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does rubbing a contact injury relieve pain?",
        "response": "This is due to the 'gating' of pain: in its most simplistic form, there are inhibitory pathways which oppose nociceptive (pain-sensing) pathways when they are activated. These pathways are activated by fine touch, so the signals are \"switched off\" when the same skin receives fine touch signals.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "(Why) Are human bite-wounds extremely susceptible to infection?",
        "response": "I don't think this is true. [This article](_URL_0_) gives figures of 20% infection rate of dog bites (36% when the hand is involved), a whopping 80% infection rate from cat bites - apparently because of the deep puncture wounds- and just 18% from human bites. Apparently human bites in childhood are less prone to infection than in adults. A human mouth can contain more than 40 species of bacteria and an average of 5 different organisms is found in infected human bite wounds. I have now learned a lot about human bite wounds.  I suspect that licking a wound is less of a problem because the chance of infection derives from driving the bacteria into the tissue.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do potato chips' such as: Ketchup, All Dressed, and Dill Pickle sales tests perform so poorly in the US, but are among the top flavours in other countries?",
        "response": "The flavours you mention all have one thing in common: sourness. Ketchup, all dressed and dill pickle are all vinegary flavours and sour/vinegar is not a flavour element that's very popular in American cuisine with a few notable exceptions (certain bbq sauces for example). Salt & vinegar or malt vinegar is extreeeeeeeeeeemely popular in the UK/Ireland, as are all things pickled. The American taste tends to run more towards sweet and salty.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that we sometimes don’t immediately process information we totally understand? Sometimes someone says something to us and we ask them to repeat it, only to realize you heard and understood what they said a half second later. What causes that little delay?",
        "response": "Learned about this in cognitive psychology. Your ears have a four second \"memory\" so you can take up to four seconds to really process it. After that four seconds you either lose it or send it to your short term memory. Echoic memory.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In string theory, is there one string in each particle even when it's so much smaller than the particle itself?",
        "response": "The particles in the Standard Model that are fundamental -- electrons, muons, quarks, photons, gluons, etc. -- have no known size. At the level of the Standard Model, they are point particles. String theory would tell us that these fundamental particles are not points, but tiny loops. And, if the basic picture we have of string theory were to work out (big speculation, to be sure), then each of these fundamental particles would turn out to be a loop about 10^(-35) meters across. So yes, each fundamental particle would simply be a string excitation, but this isn't smaller than the particle in the Standard Model, since it would be 10^(-35) meters across rather than a point. It is true that the strings would be much smaller than protons or neutrons, but those are not fundamental particles, but rather bound states.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the effects on copper pipes when they are connected to a house's electrical ground?",
        "response": "Isn't the ground only for safety reasons? No current is going through ground wire except in a malfunction. Then it is supposed to make the current go into the ground, as the short circuit will blow the fuse within a millisecond and make the metal parts of the malfunctioned machine safe. Otherwise a wire that comes off and touches the metal casing of a washing machine, will make it a death trap, because next time you touch it, you will be the ground. That's why the ground is connected to metal parts of every appliance.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Radon more abundant than Polonium when Radon has a much shorter half-life?",
        "response": "It should all be in [secular equilibrium](_URL_0_). There are 4 [decay chains](_URL_1_) that produce radon and radium. Radon is 1 part in 4e-19. Polonium is 1 part in 1e-15. There is more polonium.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is it that the concept of an Electromagnetic Field avoids the problems caused by the concept of a \"Luminiferous aether\" with regards to relativity?",
        "response": "The Electromagnetic Field is a \"thing\" that fills all of space that light can propagate in. In this sense it is basically the same as a \"luminiferous aether.\" The key difference is that it is a *relativistic* aether, which means that unlike ordinary material stuff like air or water that for example sound can propagate in, it doesn't have a rest frame. The word \"aether\" is usually just reserved for \"material stuff like air or water that has a rest frame\", from before people realized there were such things as relativistic fields that could not have a rest frame, like the electromagnetic field.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is a metabolic rate and how do I find out mine?",
        "response": "The Basal Metabolic Rate is an estimate of the amount of calories you burn in a day when doing 0 activity. It's an estimate based on a number of factors. _URL_0_ This calculator helps you get a baseline. There are more accurate calculations that can be done with more data, but this suffices for most purposes. To get an idea of the actual amount of calories you burn in a given real day (with all the days walking, activities, etc), you need to multiple your BMR by a factor based on your average activity level. _URL_0_harris-benedict-equation/ For example, for a sedentary person, multiply your BMR by 1.2. The resulting number is the number of calories you need to eat in a day to maintain your **current** weight. Eat less than that every day and you'll gradually lose weight. Eat more, you'll gain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"Many a military disaster has been prevented by reluctant obedience.\" True?",
        "response": "_URL_0_ Perhaps the most world altering example I can think of, during the Cuban missle crisis the US began dropping depth charges on a Russian submarine in an attempt to make it surface. The Americans were unaware that this was a nuclear sub with some authority to fire. For all they knew, war had begun. The world dipped very close to war several times during the crisis, they were in international waters so clearly something was out of the ordinary, and they were in a metal can moving slowly at the bottom of the ocean. The general consensus is that the war is on, time to go through with the mission. Fortunately for the world the second in command, Vasili Arkhipov was able to to convince them to wait for orders from Moscow. Had that nuke fired, every other nuke would have fired. Vasili saved the world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why isn't education fun?",
        "response": "The word fun is arbitrary. Each and every person on the planet has a slightly different version of what is considered fun. Some people enjoy education simply because they enjoy learning. Others enjoy it in a certain format (such as hands on) but are bored to death with other formats (lectures). Because of this variance, this is going to be an extremely hard for anyone to answer definitively. Although I'm interested to see peoples arguments.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do headphones create a sense of something being behind/in front of you, when they only play sound to the left and right of your head?",
        "response": "I want to elaborate on the other answers to explain how it actually works. Your ears aren't just two holes in your ear- they have flesh that is shaped differently in each direction. As sounds come to your ear through different directions, the shape of your outer ear alters the sound (making certain frequencies change in volume by the time they hit your inner ear). Your can (sort of) reproduce this in the studio by accentuating different frequencies and affects like reverb. But placing audio in front and behind is actually a lot harder to replicate than left and right. \"Far vs near\" and \"left vs right\" can be done easily - \"forward vs backwards\" and \"up vs down\" are a lot more ambiguous.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when a motorcycle is dyno tuned?",
        "response": "When you dyno a bike, the rear wheel is on 2 rollers, allowing the rear tire to spin but the bike doesn't move. The rider will accelerate and go thru the gears as if they were drag racing. The dyno then measures where the bike's peak power is, where it lacks power, and other things like the air/fuel ratio. It gives out reports that look like a series of graphs. Based on the graph, you can (for example) see that you are losing power when shifting from 2nd to 3rd gear, and another graph shows that the air/fuel ratio is too rich (too much gas, not enough air) at that sane moment. So you adjust whatever you can on the bike to allow more air, or restrict fuel, or both. Then you run it on the dyno again and compare the results to your first run. Do this over and over again (testing and adjusting) until your bike is making optimal power.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the NSA is recording every single email and/or phone call in the world, how can they analyze so much data?",
        "response": "First, they aren't doing that. What they do is record phone *records*. As in who called who and when. This is useful because if they have a bombing and then capture a suspect, they might look at the records and see that they called two numbers the evening of the bombing but got one incoming call. They then look at the incoming call's number and see that it has almost all outgoing calls, at regular intervals to a set of five numbers. This indicates that the caller was giving orders or instructions. So they go to a judge with a security clearance and say \"We think there is good reason to tap these lines because we think it is a terrorist cell, and future attacks will soon be ordered through this number.\" And usually that judge will issue that warrant, because usually they have good reasons to ask for it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In Quantum Theory, why does observing an event change it's outcome?",
        "response": "Warning: NSFW explanation ahead. It's like your mom walking in on you when you masturbate vs a pervert watching you as you masturbate. The pervert observes at a distance sufficiently large so as not to disturb you from the eventual outcome of your activity, but the tradeoff is that he has a limited view of you, isn't able to see very well, and knows only vaguely what you're doing. Your mother walking in, conversely, observes very closely, can see what is going on very clearly, and knows EXACTLY what you're doing. On the other hand, the nature of the observer and her close proximity have a profound effect on the outcome.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it companies that make devices with USB type C like Google and Apple have to warn people not to use bad cables. Wouldn't companies that make those cables benefit from making good cables?",
        "response": "Turns out, making specs compliant cables for usb-c is slightly different than making all of the other USB variants.  Manufacturers made millions of them on the super cheap and didn't worry. USB micro-b that all the older devices used was pretty safe.  12 watts max, only so much damage is likely, even with bad cables. (usb-c is anywhere from 12w to 100w) Then Benson called them out on their bad cables, and a few people started reporting melted devices, and now cheap crappy importers have millions of bad cables to try and get rid of, and not much capacity to verify whether the cables are safe. It is very easy to buy 25000 of them and only later realize you've been shafted",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how do you meditate?",
        "response": "get comfy. breath slowly and deeply. in through your nose, out through your mouth. concentrate only on your breathing, visualize it, pick apart certain sensations (the air across your throat, your stomach expanding, etc..).  you may only be able to concentrate for 5 or 10 minutes, but that is okay. the brain is like a muscle you have to build. in meditating you basically trick your brain into feeling kind of like the relaxed way one feels just before falling asleep. its relaxing, refreshing and gets easier the more you do it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do social networks going IPO, like Twitter, effect us?",
        "response": "On the surface, it doesn't. People in the company get rich and investors hope to get rich. However, maybe it does affect us. If a company goes public they now have shareholders. The Shareholders are all owners. The company will now have other people, outside their employees that they need to worry about. The shareholders worry about the bottom line. Will the product you love be changed to appease the investors in a way that you love or hate? That does indeed affect you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "WW2 - Did Japan have to go to war with the U.S.? Couldn't they have gone to war solely with the Dutch/British in order to acquire the resources they needed? After all Hitler did that and the U.S. did not go to war.",
        "response": "I've written about this a few times before, but the short answer is that if Japan wanted access to the oil and other resources of the colonial powers in Southeast Asia, it would have to go through the Philippines to get them; and the Philippines in the 1940s were an American colony. You can read more about Japanese intentions and war plans here:  _URL_1_ _URL_2_ _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did eukaryotes evolve?",
        "response": "The [endosymbiont theory](_URL_0_) is the one that gets the most traction, and is probably correct.  Basically, some early prokaryote took on a parasitic lifestyle; living inside and off of another, larger prokaryote. Over time, this developed in to a symbiotic relationship, the former parasite not just living off the host but also benefiting the host in some way. Over time, this became an obligate lifestyle; the host gradually became dependent on the symbiont and vice-versa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does chemotherapy treat tumors without destroying other cells in the body?",
        "response": "Classical chemotherapy such as cisplatin targets rapidly dividing cells. Cancer is a disease characterised by excessively dividing cells, so cancer is hit by chemotherapy. The body remains largely unharmed because most cells in the body actually divide very rarely, if at all. However, those cells that do, are hit just as hard as the cancer. This includes the lining of the intestine, cells in hair follicles and some immune cells, which explains many of the side effects of chemotherapy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I close one eye for 30 minutes a day while in sunlight, will the exposed one become darker over time?",
        "response": "I can offer a personal and very rare perspective on this question. I have two different colored eyes - one is very dark brown and the other is a light green. It's called heterochromia, and very few people have it. I see different shades out of each. The only time I notice this is when I close one, and then open it and close the other, and do that repeatedly. But the brown eye gives me reddish shades of everything, and the light green eye is much more white/light blue shades of things. Its especially pronounced with white walls that I do this with. I guess this doesnt answer whether your eyes will change colors, but tells you about this experience of having different colored eyes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the Trans-Pacific Partnership? What does it do? Why are people against it?",
        "response": "It will allow corporations to sue governments for impeding on future profits, no matter if the reason the government is doing so is for the health of the people.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does it seem like NASCAR is for red necks but Formula1 is a high class sport?",
        "response": "F1 grew out of the tradition of top auto manufacturers racing their cars against each other to prove that their automobiles were the best. It was about building the fastest, most reliable, and most technically powerful car. NASCAR grew out of a history of selling illegal moonshine liquor. To evade the police, bootleggers would strip their cars down as much as possible to make them light and fast. They thought it was fun, so they started racing against one another on the side.  Basically, F1 has always been about million dollar companies facing other million dollar companies. NASCAR didn't become like that until much later.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are scientists excited about the discovery of methane on Mars?",
        "response": "Because they don't know why there is so much, or why the amount of methane in the atmosphere seems to change depending on when and where they measure it. So now they get to try to figure out where it's coming from.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do Soda and water bottles have the words no refill on them, where would you even get a refill.",
        "response": "They mean that the bottles are not meant to be refilled, even with water or another drink. The plastic they use for cheaper bottles can leak into warmer drinks and can be unhealthy for you. Its usually trace amounts but its enough of thing to put the label.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do people make money by uploading ripped current TV shows/live streaming sports events?",
        "response": "AFAIK, there's no money being made by the uploader. They do it for notoriety and as a service to the world.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why a file name cant be \\ / : * ? \" <  > |",
        "response": "Because those are all special characters used by othe purposes by the operating system.  /\\ are directory separators  : is used for the drive letter/device name in Windows * and ? are wildcards  < and > are used for redirection symbols “ is used to allow spaces in filenames.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Best of April Winners",
        "response": "Maybe we say this every month, but I thought April saw some exceptionally fantastic posting across the board. Congratulations to /u/shlin28 and /u/agentdcf, two thoroughly deserving victors in a tournament of champions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the relationship between information and thermodynamic entropy?",
        "response": "Entropy says how much information you need to have to describe the system. Imagine a perfect crystal at 0K. You don't need information about the system to describe it, since the structure is the same everywhere. This system also has 0 entropy, and now it makes a lot more sense why. The more entropy a system has, the more information you need to describe it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do computers have difficulty showing quotations?",
        "response": "[This page](_URL_0_) has a very detailed (but still written ELI5-style) explanation for the whole phenomenon. I highly recommend it! I'd copy-paste it, but it's kinda long.  Nutshell version: there are several different ways to encode text. Characters are encoded as numbers, and some character sets use different numbering schemes than others. Some schemes use more than one byte per letter, too. If something is encoded as one set but mistakenly interpreted as another, some characters can get interpreted as another character, or even more than one character. This typically doesn't happen to to the most common characters (which are roman letters, numbers and basic punctuations) which share the same numbers in all encoding schemes, but once you get up into the range that apostrophes/quotes inhabit, you've reached numbers that can be interpreted different ways depending on the encoding used.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If birds' nests are external phenotypes - do humans have any?",
        "response": "Here's the canonical list of \"human universals\" - things that supposedly every human culture does. You might find something there that could be considered an \"external phenotype\" in humans.  \\- _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are for-profit Universities different than non-profit Universities that generate profit?",
        "response": "You identify the major differences in your OP. For-profit are more predatory and scummier, since they have a bottom line to meet. What other differences were you looking for?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"rape culture?\"",
        "response": "At its core, used to describe the victim-blaming attitude towards rape. If a woman is raped, she was \"asking for it\", and if a man was raped, he was \"weak\" or a \"sissy\" or \"enjoyed it\". Promoting the ideal of \"don't get raped\" over \"don't rape people\". When you hear in response to a rape, \"She shouldn't have been drunk/wearing that/etc.\", that is what \"rape culture\" is referring to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How was ice produced in the days before freezers in warmer climates? Was there any way to conserve foods/meats?",
        "response": "Ice was \"harvested\" from cold lakes, wrapped in insulated crates, and shipped to distant locations to keep food fresh in an \"icebox\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The decline of Labor Unions in America",
        "response": "Labor unions are meant to give workers support in negotiating fair wages, decent working conditions, etc, when dealing with large, powerful employers (i.e., collective bargaining). Many people dislike labor unions because there are issues with union workers sometimes being \"untouchable\" and it often keeps unqualified workers in positions where they don't belong. A prominent example is not being able to fire bad school teachers.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "For a black hole where Hawking Radiation is occurring, why do more anti-particles fall into the black hole than normal particles?",
        "response": "Equal amounts of matter and antimatter escape from the black hole. What falls in are virtual particles with negative energy. Antimatter falling into the black hole would still increase its mass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that most people don't like hearing their own voice when recorded?",
        "response": "Bone conduction plays a big role. We hear our own voice both through vibrations in air getting to the ear drum, and by vibration in the jaw getting to the tiny bones of the inner ear. As a result, the version of our voice we hear is a bit deeper and stronger than that heard by those around us, and recordings tend to sound weaker, higher, and only partly familiar. The other piece is imperfect recording and playback. Microphones and speakers may not evenly cover all the frequencies involved in human speech, and can further distort what a voice sounds like.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is \"blue light\" and why does filtering it on my phone help protect my eyes?",
        "response": "The most important thing about filtering blue light from your electronic devices is that blue light keeps you awake at night. Light signals your body to stop the production of melatonin and destroy the melatonin in your body, and blue light is the most effective at causing this. Melatonin signals the rest of your body to sleep and gives you that sleepy feeling. Filtering out the blue from your phone screen and computer monitor helps prevent sleep disorders because it helps prevent those devices from falsely signaling your body to stop producing melatonin.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference between an atomic bomb and a nuclear bomb.",
        "response": "There is no difference between Atom Bomb or Nuclear Bomb, these terms refer to the same thing. There is a difference between a Fission bomb and a Fusion bomb (aka Hydrogen Bomb). The Hydrogen bomb is far more powerful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do different instruments playing the same note sound different?",
        "response": "This is a frequently asked question. The Middle C in your example is just the \"fundamental\" tone, but notes from different instruments have more \"overtones\" or \"harmonics\" in different ratios, which define the tone. They can vary over time e.g. as a guitar string fades out, some overtones last longer than others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we get permanent scars if our skin gets replaced every month?",
        "response": "Your skin is made up of three layers: the epidermis, the dermis and the hypodermis. Only the epidermis replaces itself regularly; damage to the epidermis will not result in scaring. Deeper damage - to the dermis or hypodermis - results in scarring as these layers do not get replaced as often.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why reddit has so many 503 (busy server) errors so often?",
        "response": "There are times when we're coming online in droves...6,292 are on (ELI5) now. For me, that says time to go...somebody else needs a turn. I'm not sure of peak use times, but it's Saturday morning here ...we're just getting up and before we go out, gotta check Reddit. Same thing on workdays...early check-ins, checking in from my desk, after school, after work. Checking in before bed. This is a heavy traffic time.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If natural selection is based on survival of the fittest, why do most people instinctively and passionately protect the weak? Why is it almost universally considered unethical to kill (or let die) less \"fit\" people?",
        "response": "Fit also means being able to operate in groups. Humans who have group instincts will alway beat humans whose instinct is to be alone, no matter how fit they are individually. Part of the group instinct is fairness and to protect fellow members. So we don't always protect the weak (or else there wouldn't be a homeless problem), but we have urges to protect everyone that is part of our group.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Light has no mass, how can it get sucked by a black hole?",
        "response": "You're thinking of Newton's law of gravity, where gravity is the attraction of masses to each other. But we've learned a little bit more about gravity since 1666; Newton's law turns out to be only approximate. Gravity is more accurately described as a warping is spacetime by energy and momentum. All freely falling bodies follow this warp, regardless of their mass.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do we know when we will run out of fossil fuels?",
        "response": "We probably won't ever \"run out\". We'll gradually use up the cheapest, easiest to access deposits, which will cause the price of fossil fuels to rise, which will provide the incentive to develop alternative fuels, which will cause our consumption of fossil fuels to drop until we no longer use them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Cuba's literacy rate is 97%. The U.S.? 86. Why does a country that is so poor (average wage is .05 per hour) have such a high literary rate compared to the United States?",
        "response": "Literacy rates are hard to compare because there are many different definitions of literacy used. That said, Cuba has a relatively strong public educational system, almost no immigration, and a government that routinely makes shit up when it comes to reporting numbers. All that contributes to a very high reported literacy rate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some slow pages load only immediately after you hit the refresh button?",
        "response": "Some websites will wait until you have all of the data prior to displaying anything so they can ensure your layout doesn't move around as it loads more content. The page isn't \"loading\" the moment you hit refresh, rather it is just displaying everything you've already downloaded. A better tactic would be to hit stop/escape if a page has gotten stuck while loading. Essentially there is most likely some content (ads/images) that failed to download which prevents display of the entire website until that process times out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the Mercator Projection make navigation easier?",
        "response": "This is as you can draw a straight line to where you want to go and travel in that direction on a compass and you will get there due to the projection being elongated and all rectangles representing the exact same area on earth.  Though it won't be the quickest route, it's the one which will make the most sense in our minds as we are more used to (as a society) the Mercator projection.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference between types of beers.",
        "response": "All beer is made up of four things: * Water * Grain * Hops * Yeast Yeast eats sugar from the grain, converting it to alcohol and carbon dioxide (bubbles). Hops add bitter flavor & aroma to the beer and help preserve it. The choice of Grain, hops & yeast determine the variety of beer. If you use a lightly toasted barley malt (augmented with rice & corn), few hops & a lager yeast, you have Budweiser. If you use dark toasted malt & an ale yeast, you have Guinness. If you you a malt somewhere in between & use lots of hops with an ale yeast, you have an IPA. You can mostly characterize the different types of beer by how light/dark they are, whether it uses a \"clean\" tasting lager yeast or a \"fruity\" ale yeast and by how strong the hop flavor is. There's really too many specific types of beer to list them all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the shared ownership scheme work when buying a home in the UK?",
        "response": "Basically you own a proportion of the house, often one half, and a housing association or developer owns the rest. Since you are buying only one half of the house you buy it for one half of the value and pay rent on the other half (again one half of the rent you would pay otherwise). Usually you have the option to buy the remainder of the house if your finances improve.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are you more likely to get tan or sunburnt when you go swimming?",
        "response": "What actually gives you sunburn is the UV rays from sunlight. Most glass absorbs most UV rays, so you're much less likely to get sunburned behind glass for example. When you go swimming you're more likely to get sunburned because water reflects UV rays. As a result, you basically get a double dose of UV radiation when you're on the water - the normal amount you would get from being outside and the amount that's being reflected at you from the water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do radio stations play talk radio in the mornings instead of music?",
        "response": "Radio stations, just like TV, have time slots. Certain times lots have certain audiences. In the late night/ early morning most listeners are traveling/truckers... People traveling/trucking tend to tune in to Talk Radio more often because it makes time go by quicker and keeps you awake. Basically, more people driving late night/early morning want to listen to talk radio. So radio stations program talk radio to get more listeners.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some people feel LESS drunk after eating a bit of food?",
        "response": "When you digest the food and break it down into it's smaller components, these are then absorbed into the blood, because there is now more sugar in the blood, the proportion of alcohol is lower, and you feel less drunk.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The difference in terms \"Latino\" and \"Hispanic\"",
        "response": "\"Latino,\" as a term generally refers to people of Latin America, which includes the central path between north & south America as well as a number of islands such as Cuba and Puerto Rico. \"Hispanic,\" refers to anything relating to the cultures of Spain and Portugal. So, a person from Spain will be Hispanic, but not Latino. A person from Mexico is definitely Latino, and could consider themselves Hispanic, though, they might also consider themselves closer to Native American than Hispanic (which is European) depending on their own background.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is HTTPS \"safer\" than HTTP?",
        "response": "The \"s\" is not just a suffix to the http. It signifies that the website has the correct certificates to protect users from attack as well as protect your information on the site its self",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do computers get slower and unresponsive the longer they are left on/over general time?",
        "response": "Programs and drivers can \"leak\". This means a program asks for a little memory to use and doesn't give it all back when it's done. If there's a section in the program that's called over and over, it will slowly use up all your available memory. When your computer runs low on memory (because it's all allocated to this wacko program) it starts using disk as memory which is really really slow, making things worse.  Rebooting causes the computer to clear the memory and start fresh where the whole thing can happen again over time. It's incredibly difficult to track down leaks as the OS will not report what's using the memory accurately. Newer versions of windows are better about dealing with this than versions from a few years ago and horrible design choices aside, this is the kind of stability they're working toward.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the electromagnetic spectrum abruptly stop at gamma rays.. or are there higher energy/shorter wavelengths out there?",
        "response": "Some in the lattice gauge theory community have seriously(-ish) considered [_URL_0_] the possibility that spacetime is discretized; if this is the case then the fundamental lattice spacing would impose a limit on the minimum wavelength. Any physical quantity dependent on momentum would be periodic in 2pi/a, where a is the lattice spacing.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "To what degree should the slave economy of the antebellum South be considered capitalism?",
        "response": "Hi there -- while there's always more that can be said on this topic, this [older answer](_URL_0_) from u/sowser touches on the subject and may be of interest to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between community college, college and university in the US?",
        "response": "College is a term we use broadly to apply to any post-secondary education; that is, it's the education that someone would go to after they've completed their mandatory 12 or 13 years of education. A typical age for someone starting any kind of college is 18. A community college is a state-supported, affordable college that generally offers a 2-year associates degree in a variety of subjects, but nothing else. A university generally refers to either a state-supported or private college that offers post-baccalaureate degrees, such as a masters. Sometimes those lines get blurred -- an institution that delivers graduate programs might call itself a college, and (less common) a school that offered only four year degrees might call itself a university. The definition of community college doesn't vary much. An American would never refer to any school designed to teach people under the age of 18 as a college or a university.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Monday Mysteries | Lost Lands and Peoples",
        "response": "What happened to Teotihuacan? I visited a while back and the pyramids and adjacent buildings are very impressive, but it seems that the story of its people is not entirely clear. Did they run out of resources for their crops? Did they decide to migrate for another reason?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what Wolfram Alpha is suppose to do?",
        "response": "I think the goal of it is to be able to answer any knowledge or data question really quickly, but it's still in a very early state of development... it seems to only respond to keywords and not very complex questions, at least in my experience. I just wish it was more like the worldwide supercomputer 'Multivac' in Isaac Asimov's sci-fi short stories, which could answer any question you could throw at it (except one... I highly recommend anybody to read \"The Last Question\" it's only a ~15 minute and [completely mind-blowing read written in 1956](_URL_0_)), but I'm pretty sure that Wolfram Alpha, Google, and Reddit (yes just these 3) will all culminate into this within the century anyways (and I would think that Wolfram Alpha was inspired by the Multivac idea, though there were probably other similar predictions of such an entity before)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When fossil fuels are forming, what makes the dead stuff become oil vs coal vs other fossil fuels?",
        "response": "There are 4 types of Kerogen which form from various types of sources. These sources are plant life or \"woody\" environments, planktonic which comes from marine environments, lacustrine which sources from lake type of environments, and the 4th type is mostly decomposed organics and doesn't really turn into hydrocarbons. Basically, the difference in the type of kerogen creates the different types of fuels. The pressure and depth also plays into this. The deeper the reservoir, the higher temperature and pressure which cooks the kerogen and turns it into usable hydrocarbons.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "After a night of drinking, why do my muscles feel like I ran a 5k, even if there was no physical activity being had.",
        "response": "3 reasons: a) The numbness you fell when drunk persist throughout sleep and your body may stay in an uncomfortable position for too long because it doesn't realize it until it's too late. I had neck pains for a long time before I realized how I need to sleep drunk to avoid them b) Lack of water, water is important and the lack of water in your body ( which includes muscles ) can lead to that tired/hungover felling c) Your liver is working intensely during the night and you sweat as a result ( which is one of the reasons for the lack of water ) which will result in you felling cold and once gain lead to discomfort. So basically when you wake up you have : Sweated in your sleep, kept some muscles in uncomfortable positions and lack water which are very similar to the things that cause discomfort after running 5k marathon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Solar power + Hydrogen generator.",
        "response": "Your system is needlessly complicated. You are taking electricity and then using it to perform electrolysis, then using several steps before you are getting useful energy out. There are many other ways to store the electrical energy - capacitors and batteries being two obvious examples. Burning hydrogen will lose a lot of the energy to heat. To get 1000kwh of energy per month you would want 33kwh of energy per day, and if we assume 10 hours useful sunlight you would want to be getting 3.5kw of power. There are a number of [solar panels available with this power rating](_URL_0_). You could simply sell any excess electricity to your electricity company via the grid and buy it back from them in the night time (when it is cheaper) without any need for energy storage on your part.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do console video games improve the quality of graphics during the same generation?",
        "response": "Basically, they get more experience at writing code for that hardware and learn how to optimize it. It's like getting more practice with a set of paints. You don't get more colors to work with, but you learn how better to use the ones you do have.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How many regular alkaline AA batteries would it take to power a 747 flight from London to New York?",
        "response": "As kind of an interesting side note, AA batteries have actually [powered a manned aircraft](_URL_7_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible for two embryos with different fathers to fuse and create a human chimera?",
        "response": "[Human chimeras](_URL_1_) are [definently possible](_URL_0_). They are usually discovered when people start testing for paternity or crimes, but you can have more obvious phenotypes (like eye color). Remember that each sperm only cares half of the genetic information of the father, so even if it is the same father the fused embryos can have a very different genetic makeups in different subsets of its cells. Two fathers is a little tricker, you would need rapid fertilization from two separate males. Even if that did happen, chimeras are rare enough where I would guess this would be extraordinarily rare.  Anecdotally, as single cell sequencing technologies progress rapidly I suspect we will discover that this phenomenon is more common than previously thought. Single cell sequencing allows us to examine the DNA or RNA of each cell individually, so if an organism is a chimera we see odd data come out the other side (it looks like someone screwed up and put multiple samples in the same tube for sequencing).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could you 3D print a microchip?",
        "response": "Not on the level of current microchips. The structures are way too small. You can make a bigger circuit for sure. I don't think that this will ever be an industrial application of 3d printing. Maybe in the research department where you just print a single chip to test some properties.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is coffee a common after dinner beverage in fine dining restaurants with desserts when it's not the best idea to drink coffee at night?",
        "response": "Dinner before nightlife. After dinner you're sluggish and sleepy trying to digest it. So you drink a little caffeine and you're off with energy again to continue on with the night.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do bright lights become lines when i squint my eyes?",
        "response": "[That's why](_URL_0_) Basically, when light passes through a small enough aperture, it gets distorted. The effect is that it becomes perpendicular to the sides of the aperture.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there an explanation behind the \"chills\" we get when we listen to a certain song?",
        "response": "This has a lot to do with the body's physiological response to emotion. When you experience something [invoking strong-emotions](_URL_0_) there is more epinephrine and, more importantly, norepinephrine released into your bloodstream. This causes the \"chills\" in the same way we get \"goose bumps\", it's a mechanism of fight-or-flight. This also means the amygdalae are activated also. I would also like to point out that the fight or flight is more appropriately fight, flight, fawn or freeze (4F). So, when I say \"fight or flight\" I'm just talking about the physiological response, not that you actually feel threatened - just perceiving an increase in the same hormones.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a gradient at which bicycles become less efficient than walking?",
        "response": "That's going to depend on your gear ratio, among other factors. It's not as simple as just walking vs. biking.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can certain bacteria, or even some invertebrates, be resistant to high levels of radioactivity?",
        "response": "All organisms in the world experience DNA damage due to radioactivity, UV exposure, free radicals, etc. Sometimes this damage causes a single stranded break in your DNA (Pretty bad), and sometimes it causes the DNA strand to completely break (Double stranded break, very bad!). Radiation causes double stranded breaks, which is why it is so dangerous. (Almost) every organism also has some way of dealing with this damage. How some organisms are \"resistant\" to this is by having these same systems that also happen to be more efficient. The most common form of repair in bacteria is the [RecBCD](_URL_1_) system, but every organisms RecBCD has varying degrees of how well it works. Those that have very high resistances to radioactivity have overactive DNA repair mechanisms, which [sometimes also act in different ways than the less effective ones](_URL_0_). It's a very cool line of research!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are so many Ground Zero workers getting cancer?",
        "response": "Buildings are generally not carcinogenic because the components that can cause cancer are solid parts and are behind drywall or ceiling panels. But burn a whole bunch of that building to transform substances into toxic smoke, and then bring the whole thing down in a massive dust-producing implosion, and the massive impact atomizes a lot of these components, freeing them to travel and ride concrete dust into peoples' throats and lungs, often for years afterward when rubble is moved and dust is disturbed again.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you lose weight, where does it go?",
        "response": "Most of it is breathed out (you breathe in O2, it gets processed by your body, and breathed out as **C**O2. The C is a carbon molecule). You also pee, poop, and sweat out some weight.",
        "source": "sentence-transformers/eli5"
    }
]