[
    {
        "query": "Why has \"fapping\" become a synonym of \"masturbation\"?",
        "response": "The word fap is an onomatopoeia that tries to mimic the sound of skin hitting skin rapidly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if the US left middle eastern countries in solitarily?",
        "response": "Keep in mind that those borders were hastily drawn in the 20th century after the chaotic collapse of the Ottoman empire and subsequent upheaval during WWII. The nations that exist in the middle east are drawn along arbitrary lines, not historic ethnic and religious lines. This has led to a lot of violence in the region as different groups fight for power or independence. The US (and the now-defunct USSR) have at times supported certain groups they felt best represented their interests in the region, but *they did not create those groups*. So if the world left it alone it wouldn't suddenly become a modern utopia of peace and understanding, the borders will eventually be redrawn (likely violently) and that will eventually stabilize the region to some degree.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Tesla coils work?",
        "response": "Put crudely, a Tesla Coil is like an organ pipe for radio waves. The waves are silent, since they're not sound waves. But even if we could hear them, they'd be way too high pitched. Even dogs couldn't hear them. But that might be too complicated, because in your video the \"waves\" are so incredibly intense that they have provoked an outbreak of sparks.  Unlike radio waves and voltage-fields, sparks do make noises. Also:  [Debunking Nikola Tesla Misconceptions](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a fall in violent crime in a lot of developed countries in the last 30 or so years?",
        "response": "There isn't going to be an easy eli5 answer to this because society is complex. One of the more interesting hypotheses for the US crime rate dropping in the 90's was that it was right about the 20 year mark since abortion was legalized. Unwanted kids who would have been in their early 20's aren't there (due to abortion). This comes from [Freakanomics](_URL_0_). It's interesting, but, again, there's no good way to know its impact on crime. Sociological issues are incredibly complex.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we capitalize \"Happy New Year\"?",
        "response": "My guess is that happy is capitalized because it's the beginning of a sentence, and New Year is a proper noun (shorthand for New Year's Day).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why sea waves can never be from land to sea?",
        "response": "The wind has to rub against the water for some distance to make waves. So when the wind is heading from land to sea, it *might* create waves heading that way, but they won't appear until far offshore, where the wind has had some room to do its work. Meanwhile, waves created far away and headed toward you (on shore) will continue to arrive. Interestingly, sets of waves going in opposite or different directions can actually cross without canceling each other out. Both sets keep going.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the actual cost of health insurance in American for a family of 5?",
        "response": "Probably about $1-2k per month. Depends on types of benefits chosen and how much, if, your employer contributes towards it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "N2O4 as oxidant in a combustion engine (?)",
        "response": "yes, in fact dinitrogen tetroxide is frequently used as an oxidizer on rocket engines (often with dimethylhydrazine as the fuel) and has been used on many well-known spacecraft systems including the russian proton rockets, the chinese long march boosters, the Apollo Lunar Module and many others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could you protect yourself against the US's laser weapon by using a mirror?",
        "response": "No, and for several reasons. First, what you normally consider a mirror is only a mirror in certain wavelengths- aka, the visible spectrum (and extended a little on either side). The laser weapon is so far outside of the visible spectrum that it would just pass through.  Secondly, even if you had a \"mirror\" in the wavelength the laser weapon worked in, the mirror would still have to absorb a lot of energy. Mirrors don't exactly reflect light, but instead absorb the light, and then re-emit it. A power laser would have too much energy for a mirror to absorb.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do dolphins, whales, and other aquatic mammals die when they are out of the water?",
        "response": "There are three main causes of death for beached mammals like whales and dolphins. 1. Collapsing under their own weight. This applies to very large species such as sperm whales, whose skeletons are not made to support their own weight. When floating in the water this is fine, but on land their bodies are so heavy that they crush themselves. 2. Dehydration. This is common for dolphins. A dolphin is not made for being out of the water and loses a lot of water very quickly when exposed to air. If left on a beach for too long, they will dry out and eventually die. 3. Drowning. This might sound strange, but it can happen when high tide comes in. If the whale is on a slope, it's possible the water is high enough to cover the blowhole, but not high enough to submerge the entire whale (allowing it to swim/float). The whale cannot breathe and will eventually suffocate.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't any animals have to wipe their ass, but humans do?",
        "response": "Animals don't need to *wipe* their ass, because they lick it or rub it to the ground. Some animals don't feel the need to clean anus at all, because their shit is dry enough to not make a mess.  If humananimal wants to clean their ass, and they don't want to rub it to ground, hand need to be used, because tongue can't reach the hole.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How poor, homeless people survive, especially in 3rd World Countries",
        "response": "Im a homeless person have been for 3 years.  Having a job helps. My big issue was finding one stable enough to justify making a commitment to things like rent.  But ultimately being homeless isnt near as bad as people assume it is, particularly if youre actively trying to get out of it.  Very little bulls means most of you income is expendable. And once you learn how and where to sleep (and get used to it of course) its relatively easy living.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are the death tolls in events like WWII so wildly different, ranging from 15 million to 85 million.",
        "response": "Given that you're asking about the Wikipedia article, it seems relevant to point out that Wiki has a [dedicated explanation](_URL_0_) of its own reporting of WW2 mortality. Both in the text of the article and if you look at the page history, it all comes down to the same thing: whether or not civilian deaths from famine and disease are counted, and more specifically, *which* civilian populations are included. I hope someone who knows the politics and historiography of particular counting methods will come along. But in the meantime, hopefully the explanation of what *Wikipedia* is doing helps clear things up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does banking work?",
        "response": "When you store money in your account, it doesn't just sit there. You are giving your money to the bank. They basically have an IOU of the amount you have deposited. The bank will use your money to do other things, like give loans, and pay for credit card purchases. They give you such a small percentage of the amount you have in your account that they don't really lose anything. The reason they give you money is basically they are paying you because you are allowing them to use your money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is everyone on Mad Men a republican?",
        "response": "Who—other than Henry Francis—is ever identified as Republican or Democrat? From what do you get the impression that they all have \"similar political leanings?\"  I guess we can make an assumption about Paul Kinsey, based on his travel as a Freedom Rider. But the politics of New Yorkers in the 1960s were not one-sided or even particularly predictable based on things like wealth or social liberalism, so that I hesitate to guess how even Pete Campbell voted in 1964.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does it mean when i hear people saying that time only exists this universe?",
        "response": "time is a measure of change in the universe.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I drive behind a truck on the highway will I spend less on fuel due to less air resistance?",
        "response": "This might help answer your question: _URL_0_   He isn't pedaling at all yet is being pulled along by the truck. Obviously your car wouldn't be able to be as close to a truck, but there would still be some benefit...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can light conserve momentum?",
        "response": "> I thought light had no mass... So how can it have momentum?  Because mass is not required for there to be momentum. The momentum of a photon is related to its frequency.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can the human eye detect a Gamma Ray Burst from a near distance? Or are Gamma Rays frequency too high?",
        "response": "The human eye can't see gamma rays, although at some point, the gamma rays may damage the eye enough so that you'd be able to know that something is happening. That said, while much of the energy from gamma ray bursts is released as gamma rays, not all of it is. They are usually bright in the visual spectrum as well, so you'd be able to see *that*.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people in america walk around in their scrubs in public making them not sanitary?",
        "response": "Scrubs are never meant to be sterile, and for any procedure which requires sterility they will use purpose-made disposable scrubs. Nurses wear scrubs because they are cheap to replace when someone bleeds/vomits on you, protect your other clothes, and are comfortable for long shifts.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't the universe collapse into a black hole immediately after the big bang?",
        "response": "One important condition for the formation of a black hole is that the spacetime away from your distribution of mass you'd like to be a black hole is asymptotically Minkowski, meaning it gets quickly flatter and flatter as you move out. This is not the case for the early Universe since it was homogeneous (all points were identical).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do Flexible Spending Accounts work?",
        "response": "You designate how much money to take out of your pay *before* taxes, up to $2,600 per year. When you need to make a copay, or pay for a prescription, or any other medical expenses that aren't already payed for by insurance, you use your FSA account to pay for them (some programs give you a debit card for this, others have you submit your receipts and they send you a check or direct deposit to reimburse you from your account). Practically, you are getting a discount on those expenses equal to your tax rate, so typically 20-30%.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people often wander around when they're talking with someone over the phone?",
        "response": "This is type of hypnosis. When we are in a phone call much of our attention is diverted to the person we are talking to. When this happening, our body involuntarily wanders.  A good example is something I see from an AskReddit post a few weeks ago. Basically, get in a full fledged conversation with someone, and while they are talking just hand them anything. Their attention is focused on you and there is a great chance they'll just hold whatever you hand them.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Some number of years ago, scientists were certain atoms were the smallest particles in existence. Some number of years later they thought electrons were. Now, we're aware of subatomic particles, but how can we be so sure that they're -actually- the smallest?",
        "response": "Science allows one to be as certain as evidence allows, which means this changes in light of new evidence. If there is new evidence that suggests there is something more fundamental than quarks, then a new model will be needed to explain it. I'll also add that in the standard model, electrons are still fundamental particles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are there two ply tissues/toilet paper instead of a thick single layer tissue/toilet paper?",
        "response": "2ply has better absorptive properties, it allows interstitial suspension. _URL_1_  This guy shows you how to use a paper towel more efficiently: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do hand warmers with a bit of metal in them work?",
        "response": "In each hand warmer, there’s a ton of a salt called Sodium Acetate dissolved. Water can only dissolve so much of the salt before it’s full, and can’t take any more. But, hot water can dissolve a lot more than room temperature water can.  So, they make the solutions in the hand warmers while the water is hot, and then slowly cool them down so that the water is tricked into having more salt dissolved in itself than it normally would be able to at room temperature.  When you snap the metal, it creates a disturbance which makes the water “realize” it was “tricked”, and all the extra salt that the water wouldn’t normally dissolve at room temperature is kicked out of the water into solid form.  This kicking out of the salt results in a much more stable structure for the salt, its solid form, so all the energy that was being used to keep the unstable dissolved form together at an unusually low temperature is released as the heat that warms your hands.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If washing chicken in dangerous, then how can I wash anything with chicken bacteria?",
        "response": "The point against washing chicken is that it is an unnecessary spread of bacteria as there is no benefit to washing it. Obviously a cutting board needs to be washed so washing it is a reasonable action.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there a tendency to view the conquest of the Americas through a modern lens of morals but we ignore the immoral (by our standards) implications of the Roman, or any other empire that did a similar degree of conquest and enslavement of a multitude of people?",
        "response": "Besides Rome doesn't really exist anymore; its influence is ongoing, but it is an ancient civilization and it is common human practice to refrain from passing moral judgment on ancient civilizations because morality is subject to change. The conquest of the Americas is much more recent and many people on either side of the story still live with the direct consequences. At the end, time is probably why.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are all programs eventually translated into machine code?",
        "response": "Yes. Machine code is the series of instructions that guide the underlying hardware to perform the actions you want it to take. It's the \"language that the CPU speaks\", so to speak. Machine code is the only thing that the CPU can run, so everything has to ultimately be converted to machine code.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it that according to _URL_0_ my download speed is 50mbps, but my download via the Windows store is averaging 2mbps?",
        "response": "Downloads are measured in *bytes* per second. Each byte is 8 bits, so 2 MBps equals 16 Mbps (capital vs lowercase B). As for 16 compared to 50? Maybe the server is slow.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do astronauts who live on the space station experience the time implications of general relativity?",
        "response": "Actually, the astronauts age *slower* than we do here on Earth! This is because we have to remember the other time dilation as well: the time dilation from special relativity. Because the astronauts are orbiting the Earth very quickly, time runs a bit slower for them. To get the effects to cancel out, the astronauts would need to orbit at a distance of about 9,500 km. Above that, the effects of gravitational time dilation win out and the astronauts will age *faster* than us. So by how much do the astronauts age slower than us? Well, [according to this article](_URL_0_) it's about 0.0000000014 percent slower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the Christians convince the Vikings and other pagans that their religion was better?",
        "response": "By murdering those that wouldn't convert, pillaging their towns and cities, and enslaving women and children.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is orange juice yellow?",
        "response": "Because it is the juice of an orange which is orange on the outside. The color of the exterior of the fruit isn't directly related to the color of the juice.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do you not feel hungry after not eating for a long time?",
        "response": "In short, adrenaline and cortisol. If you haven't eaten in a long time, your body doesn't relax, it instead increases stress hormones which induce the metabolism of energy stores (ie, fat tissue, glycogen) and help mobilize you so that you can find food or fight for it.  Once you eat, stress hormones decrease, blood flow to the intestines and visceral organs is restored, and you feel hungry again (this is why appetizers induce appetite).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Carbon black but pure diamonds turn out clear?",
        "response": "Each carbon in diamond is chemically bonded to four other carbon atoms. This produces a repeating crystal structure and changes the way the individual bonds interact (or here, fail to interact) with light. Other carbon-rich materials are either not 100% carbon like coal or tar, are disorderly like carbon black, and/or use a different bonding structure like graphite. Those materials interact strongly with light and absorb most of it. Also keep in mind that only super pure diamonds are clear. Slightly impure ones are colored (often yellow) and poor quality diamonds are practically black too. Those diamonds get used in cutting/grinding tools and drills instead of jewelry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a crane is used to construct a skyscraper around it, how do they get the crane out at the end?",
        "response": "Yes. They dismantle the crane. Often they will use another crane that's lower to assist in the dismantling. Here's a time-lapsed youtube video: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "\"A Universe From Nothing\"",
        "response": "Is this explain like i'm five or explain like i'm a theoretical physicist?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Marriages and Civil Unions",
        "response": "* In the U.S., there's a big legal difference between a marriage and a civil union, because the federal government doesn't recognize civil unions, so you don't get a lot of the big advantages of marriage, like being able to file a joint tax return, or Social Security survivors benefits if one of you dies. Also, just because you have a civil union in one state doesn't mean any other state has to recognize it, so it doesn't have much usefulness if you travel or move. * A civil union isn't really a marriage in any real sense, or vice versa. It's a similar idea of course, but the details are a lot different, and they're defined differently by the law. * Not all states have civil unions. Right now, 15 states and Washington, D.C. have some form of civil unions, but they differ on what exactly their right and responsibilities are. Some are as close to a marriage as they can get without federal recognition, and others are much more limited in what benefits they provide.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come when your eating a spicy food and you stop eating it, it becomes more spicy?",
        "response": "Because you're eating other things along with the capsaicin-including ones and those are calming your taste receptors. Once there isn't a large volume of fats, carbohydrates and fluids washing through your mouth you're left with capsaicin free to irritate your nerves until saliva finally (and quite slowly) washes it away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do 911 operators distinguish between a situation where the caller is not able to respond and a pocket/accidental dial?",
        "response": "They don't, for the most part. They assume the worst so they will treat it like an emergency and dispatch an officer to check if they can get a location.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is it that makes deep deep sea creatures able to withstand such immense pressure?",
        "response": "For some its the ability to push all the gasses in their bodies out, so the pressure doesn't rupture their flesh. For others they are made of mostly fluids that are then at the same atmospheric pressure as the surrounding water. And for alot of the really strange ones, they need the pressure to hold together. When brought to the surface for study they fall apart and die. So.... science doesnt know all of it",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the pancreas is the organ that produces insulin, why aren't pancreas transplants used as method to cure diabetes?",
        "response": "[They are](_URL_1_). Pancreas transplantation has been done since 1966, and to date, over 28,000 pancreas transplants have been performed in the US alone. - Another option is to transplant only the [pancreatic islets](_URL_0_), which contain the insulin-producing beta-cells.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a smell more pungent than another?",
        "response": "The largest part of it has to do with different numbers of molecules reaching your nose, yes. But there's more smaller effects if you go beyond that. Some of the chemical receptors are just more sensitive than others, for instance you can detect hydrogen sulfide in the air if there's only one molecule in 2 billion air molecules. Other compounds don't fit their respective receptor that well and are harder to smell as a result. Also, smell almost never consists of a single component. The smell of uncooked chicken is made up of a number of different compounds, making it more difficult for your brain to recognize than something like gasoline which is just a small range of similar molecules.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "even if the a country like France \"closes its borders\", what's to stop immigrants from just crossing at a deserted field?",
        "response": "Sometimes there is literally nothing stopping a person from doing that. Other times there are things like fences, border patrols, or video surveillance. The levels of border control depend on the country, length of the border, specific location, and the security concerns of the moment. Often a border may be monitored or tightly controlled in specific, easy to access locations, and ignored in remote, hard to access areas.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did plants and animals evolve from the same basic life \"recipe\"?",
        "response": "Look up LUCA (last universally common ancestor). Since plants and animals are both eukaryotes, they both came from an ancestral eukaryotic cell, which then came from another ancestor that gave rise to eukaryotes, prokaryotes, and archaea",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens behind the scenes when you delete a post on the Internet?",
        "response": "Not sure of what you're trying to ask. Usually the post has it's data contained in a database, so when you delete it the database entry is wiped.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did both temperature and angles end up being measured in degrees?",
        "response": "A degree just means a 'graduation of' - some way of dividing it. Hence we have first & second degree murder, and say 'in the highest degree'.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes a painting worth so much?",
        "response": "because people agree its worth that much... though they dont really have to back that up with cold hard cash very often. art is about providence and history. it feeds on itself, just need one small thing to get the ball rolling and the hivemind will hype it up until its hype is its own justification.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If a solid sheet of a metal were only an atom thick, would we be able to see through it?",
        "response": "Yes. You can coat a piece of glass with a layer of gold 100 atoms thick and still see through it. [This](_URL_0_) is what a piece of glass with a single layer of carbon looks like; it just gets slightly darker.  Edit: we killed the original image host.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When was it first discovered that the brain is responsible for cognition? What did people think was responsible beforehand?",
        "response": "I've written answers to two similar, related questions recently: [How did the idea that the heart is the source of emotion develop?](_URL_1_) and [When and how did it become common knowledge that the head/brain is the seat of thought?](_URL_0_), which between them should help answer your question!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you live an incredibly healthy lifestyle but smoke cigarettes, are they as bad for you as they would be for an un-healthy person smoking?",
        "response": "Many studies have controlled for other lifestyle choices. Smoking is very bad for your health, and most of the really bad stuff happens between age 60 and age 70. Obesity is not a risk factor for lung cancer, for example. But for coronary heart disease, both smoking and obesity are risk factors, and perhaps smoking more so than obesity!   _URL_0_  (See upper left graph in figure 2)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does warm air outside have a distinct scent to it as opposed to cool or cold air?",
        "response": "Warmer temperatures would increase the vapor pressure of nearby substances, so you would be able to smell more of the volatiles that are always present in your surroundings and simply not potent enough to detect when cold. Just like a plate of cold food from your fridge would smell much better and stronger once you heat it up. It would depend on your local environment what's directly responsible for the smells of a hot day. There's also a substance called petrichor that can be released by dry soil when it gets rained on that's responsible for that \"rain\" smell. There could easily be another similar process involved to produce a distinctly \"warm\" smell.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have scientists improved the efficiency of solar cells in the past, and how are scientists trying to improve the efficiency of solar cells today?",
        "response": "Broader absorption spectra (utilizing deeper absorption into UV and less selective about wavelengths in the visible spectrum) has increased the amount of raw energy collected.  Otherwise, I'm sure advances electrical engineering has improved the efficiency of power distribution.  If you want to work on solar technologies, I would recommend solid state physics and material science.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there any actual link between Monsanto, Monsanto GM products, or Monsanto's Round Up pesticides and Colony Collapse Disorder?",
        "response": "They make a link between colony collapse disorder and Monsanto pesticides.....then Monsanto bought the research company that published the findings. _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't the strong force make atomic fusion easier?",
        "response": "The forces between quarks increase with distance (really the potential is approximately linear with distance, so the \"force\" stays constant). But the forces between **nucleons** do not increase with distance. This is called the \"residual strong force\", or simply \"nuclear force\". The nuclear force is generally attractive at low energies, and very short-ranged (a few femtometers). It's also spin- and isospin-dependent, but that's unimportant for our purposes. The nuclear force is exactly why fusion happens in the first place. But since the nuclear force has such a short range, any two nuclei which you're trying to fuse will have to overcome a repulsive barrier (Coulomb and centrifugal) in order to do so. (The only time there is no barrier to overcome is for a neutron with zero orbital angular momentum.)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Since reusable rockets can reduce the costs, Why NASA never had the interest or investment like SpaceX ?",
        "response": "NASA was hugely interested in it. The Space Shuttle was a completely reusable rocket powered spacecraft. It brought back and reused the engines, the most expensive part of the launch system. The Solid rocket boosters on the sides were also reusable. Only the big fuel tank was destroyed each flight, and that was one of the cheapest parts of the system. A lot of investment and engineering went into that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What's the difference between appropriation and appreciation?",
        "response": "As far as I can tell, only a very small number of people would take offence to that, for reasons I cannot understand. If you wish not to risk their wrath, don't wear a sari. Otherwise, go ahead and wear one. Perhaps it'll make someone happy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does flint and steel spark?",
        "response": "Actually the stuff in that cool .gif isn't a \"flint\", so /u/SKPA's explanation doesn't apply.  The original term \"flint\" referred to a form of rock, and when it shaves off some steel or iron or pyrite (a form of iron ore), the iron in those shavings burns.  What you have there is a \"ferro rod\" or \"fire starter\" made of [ferrocerium](_URL_0_). The principle is the same - scrape it with a hard piece of steel and the shavings burn - but what happens here is that the shavings come from the stick you're scraping, not the metal that you're scraping it with. Friction ignites them and they burn VERY hot, making them great for starting the tinder in a fire. Smaller versions of it are called \"flints\" and are used in butane lighters, where a ridged wheel does the scraping when turned quickly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Microsoft is handing out win 10 for free, won't they be missing out on billions of dollars?",
        "response": "1. It's only a free upgrade for the first year after launch. After that you'll have to pay up if you haven't upgraded yet. 2. Most of MS income from Windows comes from OEM licenses or system builder licenses (new systems). These are not eligible for the free offer. If you want to build a new computer and install windows 10 you either have to install Windows 7/8 and then apply the update or buy Windows 10. 3. They hope by getting people to Windows 10 they won't have to spend as much time/money supporting Windows 7/8. 4. Some of the Win10's features, such a Cortana, should improve the more people use it. If MS gets a lot people over to Win10, and over to using Cortana then Cortana will get better on all platforms. 5. The \"universal apps\" will assuredly be sold through the Windows Store where MS takes a small cut on every sale. Windows10 will probably feature the Windows Store even more than Windows8 did.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Help our new bot get 200 link and 200 comment karma so I can enhance your ELI5 experience! It will allow me to moderate without getting blocked by captcha. (Upvote my comment in this thread too!)",
        "response": "Please upvote this (we need at least 200 comment karma as well as link karma)! edit: we're almost there! We'll delete the post when we get there. **THANKS EVERYONE!!!**",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did game devs create games in the 70s/80s?",
        "response": "Assembly language up until the SNES days, I think. You might find [this guy's videos](_URL_0_) interesting... in this first one he actually shows how you'd manually design a sprite, literally bit by bit on paper. Also he addresses how you'd display color images with tiny amounts of memory and other early problems like that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How long can a straw be before you aren't able to suck anything out of it?",
        "response": "The suction effect is caused by a difference in pressure. The surface of the water is presumably at atmospheric pressure, which is thus the largest possible pressure difference. In other words, the atmosphere pushes down on the water, which is then pushed up through the straw because of the pressure difference between the top of the straw and the surface of the water. The longest possible straw then is simply the height of water that can be supported by one atmosphere of pressure. Hydrostatic (gauge) pressure is *p* = ϱgh, where ϱ = density of water, g = acceleration due to gravity, and h = depth of water. Substituting values of ϱ, *g*, and *p* = 1 atm gives [h = 10.33 meters, or 33.9 feet](_URL_1_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How far does electricity travel in water?",
        "response": "Pure water is actually a pretty effective **insulator**, at 70+MV/m, vs air's 3MV/m (and vaccuum at 10MV/m). In fact, not a lot of naturally occurring substances are much *better* insulators than water. So the technical answer is \"one meter per 70MV\".  But that's not really your question. I suspect you're actually asking how far you need to be, while in (non-distilled) water, from a lightning strike before it no longer travels through *you* as the best path to ground. The short answer is \"a few hundred feet from where it strikes\"; the longer answer is that your head sticking out above the water *makes* you the most likely place in the area lighting will strike. And the even longer answer is, as usual, provided by Randal Munroe: [Roll an imaginary 60-meter sphere across the landscape and look at where it touches](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "At what point and why did soccer become so unpopular in America?",
        "response": "Your question implies that, at some point, soccer *was* popular in America.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people who benefit the most from tax breaks (married couples, people with kids, the elderly, etc) get taxed much less while single people in the \"middle class\" are stuck paying \"more\"?",
        "response": "The simplest answer is that taxation is not a menu, but a buffet. Everyone pays in according to what the people controlling it says that they should, and you get to take whatever benefits you can/want. The alternative is where people only pay taxes for the benefits they receive and therefore those most in need of benefits (married people, the elderly, those with children, etc) wouldn't be able to afford them.  > why do I pay for yours to go to school?  Because in turn when you are 80 years old and unable to work, their tax money will help support you. And you paying taxes right now for them to go to school helps insure that there is a new generation of people to make radical advancements in various fields so that you and yours can live comfortably later in life.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "; Years ago (like in the nineties) all computers were beige. Was there a reason for it?",
        "response": "At the time the color (technically called \"putty\") was intended to blend in with any office decor. Most filing cabinets were also putty, and it was a standard color for other accoutrements. It was meant to be unobtrusive (which is also why the \"loud\" IBM Selectric Typewriter colors like electric blue and red didn't sell very well).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do jeans have rivots?",
        "response": "They are sturdier than stitching alone. Plus they are usually in places where several layers overlap so it helps hold it all together I assume. Edit: spelling",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we feel thirst in our mouth but hunger in our stomach?",
        "response": "Speculating while on mobile and coincidentally in the hospital for dehydration. The stomach hunger thing makes sense to me. The stretch receptors in the stomach are hugely important in working with the hypothalamus (which among other things is the key brain area for hunger and thirst) to relay information about fullness. The thirst in the mouth though is tricky because there are for me at least, 2 sensations. The first is the dryness that comes about from decreased saliva production. The other is that yearning, the desire to have water to swallow that I feel in my soft palate and the back of the tongue and throat. Now that I'm typing this out, the thirst and pre-emptive priming of the swallow reflex do seem to naturally fit. I'll look into it further if no one can provide a source.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what is the difference between a dependency and a prerequisite?",
        "response": "A pre requisite is a sort of dependency but in a particular order. It must be done before the next task/thing. A dependency can be anything that relies on something else but not necessarily in a specific order.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the right conditions occurred, could Earth have rings like Saturn or Uranus?",
        "response": "Yes if the object in question was within [Roche Limit](_URL_1_) [Roche Limit for Earth](_URL_0_) As per The Theia Hypothesis, Earth once did have rings.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Explain what the point of having health insurance is when you still have outrageous deductibles?",
        "response": "let's say you have a hypothetical policy of $500k in coverage with a $5k deductible. you find out you desperately need a lifesaving surgery. all hospital bills amount to $250k, in which you're responsible for $5k. after your deductible is paid, you've now received a $250k procedure for $5k out of your pocket. 99.9% of people don't have $250k readily available to save their life, but could come up with $5k",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we say \"Jesus came back after three days.\", when clearly, the bible says he died on a Friday and was resurrected on a Sunday?",
        "response": "People are simply mis-quoting the bible. What they mean to say is, \"Jesus rose **on** the third day,\" not, \"Jesus rose **after** three days.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are computer servers really?",
        "response": "A server is just a computer. The thing which makes it a server, is simply that it has some kind of resource on it (perhaps a web page, or a printer, or just some disk space) which people on other computers can connect to and use. Because many people can all connect to a server at the same time, and use the resources on it at the same time, many servers are more powerful than the average computer that you might use - but they don't have to be. A server could well be, physically, exactly the same as the computer you used to make this post.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is seafood much more fragrant/smelly than land based animals?",
        "response": "Trimethylamine oxide. It's odorless, but after you kill the fish bacteria break it down into ammonia.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes the “burn” in muscles when working out?",
        "response": "When you perform strenuous exercise, the movement of your muscles require more energy than can be provided by aerobic methods which use oxygen from your blood. Your body is then forced to produce energy by anaerobic methods (without oxygen). These processes end up producing a substance called lactic acid which causes your muscles to burn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are most sponges only soft when wet?",
        "response": "Many sponges are made from cellulose. Cellulose contains hydroxyl groups (OH) on the end that form hydrogen bonds to other hydroxyl groups on other cellulose molecules that stiffen the materiel. Water (H20) also forms hydrogen bonds. The water gets in the way and replaces some of the bonds the cellulose is forming with itself. This weakens the structure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do headphones work?",
        "response": "A varying electrical signal causes a small electromagnet in the headphones to vibrate a thin, flexible membrane. That vibrating membrane produces sound. [This article](_URL_0_) might help you understand, but feel free to ask more questions here, too.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I found out that there was this planet covered with burning ice. How would this work?",
        "response": "In astronomy, ice refers to volatile compounds with moderately low freezing points, such as water, methane, or ammonia. Burning ice would likely be methane.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do solutions meant for cleaning such as: toothpaste, mouthwash, shampoo, body wash, dish soap, laundry detergent, etc. have dyes (which can stain things) added to them?",
        "response": "Minorly relevant - I worked for a dermatologist for many years. We had a cerave rep who would often come in. They have had a face wash on the market forever, but since it is very gentle with no added chemicals it doesn't foam up. This is a bit of a mind fuck for most people initially as it is unlike every soap or wash we usually use. They ended up making a foaming face wash which is the exact same formula with the addition of the chemical that makes foamy washes foamy. Totally unnecessary, but people want what people want. Pretty colors, lovely scents... they typically just make the product less efficient, lotions that don't moisturize as well as they could, adding to the chance of chemical or allergic reactions... Fortunately we live in a time where it is generally affordable to buy products with no added dyes/chemicals/perfumes if we so choose!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Doctors and Immunologists, what makes the disease inside a vaccine safe to inject into the human body?",
        "response": "The pathogen is either attenuated (weakened) or inactivated (killed) by bio-chemical means prior to including it in the vaccine formulation. In either case, the cell surface features that cause the body to mount an immune system response are still present, but the pathogen is not capable of causing a \"full blown case of the disease\" (though milder forms might be possible in the case of attenuated pathogens).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why raise interest rates instead of taxes?",
        "response": "You asked this yesterday. You already know the answer, it's in one of your bullet points down the bottom.  Go post this on some political subreddit because this isn't appropriate for ELI5.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If an astronaut on the ISS was unwinding an unlimited coil of the strongest ribbon/wire available towards the earth would it reach the ground and if so how much force would be required to pull it back up?",
        "response": "There are two major problems with that. 1. There is no wire that could have a (uniform thickness and) a length a few hundred kilometers without breaking under its own weight. 2. The ISS is going at over 7 km/s. Any wire entering the atmosphere would be subject to the same thermic stresses as a re-entry vehicle and would burn up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is plant diversity a non renewable resource?",
        "response": "Extinct species can't be recovered, and it often takes thousands of years for new plant species to come about--the rate of human-driven extinction is much faster than that of the natural increase in genetic diversity. It's sort of renewable, in the same way that oil is renewable if you wait until the next geological era...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't you treat dry skin by soaking it in water?",
        "response": "Skin is designed to be basically water tight. Water won't cross a skin boundary except for sweat or cuts through the skin. When we say \"dry skin\" we mean skin that lacks enough of the oils our bodies produce to keep skin healthy. This is why moisturizers are commonly petroleum based, and if not they are using some other natural oil. Basically \"dry skin\" lacks oils rather than \"dry skin\" lacks water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The arguments for 9/11 being an 'inside job'",
        "response": "I don't think this is a very good topic for ELI5, but here's my quick attempt: A lot of things happened on 9/11 that have never happened in the history of America. Because of this, many people don't understand some of the more specific moments of that day. Everyone knows what the big picture is, but the argument is in the details. Think of it like a puzzle with some pieces missing. We can put most of the puzzle back together and it's starting to look like a barn. But there are people who believe that those missing puzzle pieces are important enough that if we found them, we'd realize that the barn is really a drug dealer's house.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the honorific \"Sir\" for Knights originate?",
        "response": "Sigh, I should have seen this coming after that Female knighthood question.... u/MoiMagnus has explained the etymology, and the Latin *senior* was a common deferential title used for knights and lords into the 12th and 13th centuries. The first time the English derived words show up (according to the OED at least) are in the last quarter of the 13th century - a reference to \"sire Arthur\" in a c. 1275 *Brut* (Arthurian prose) and a \"sir Hubert de boru\" in Robert of Gloucester's Chronicle for the year 1297. Interestingly, for the George Martin fans from the other thread, it appears that 'ser' and 'sere' were actually quite familiar spellings/pronunciations in Middle English, although not as common 'sir'; the first known reference if from the c.1300 religious poem *Cursor Mundi* refering to a 'sere biscop' (sir bishop/my lord bishop).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't the Boston bombing suspect been tried yet?",
        "response": "I'm a Bostonian. The main reason the trial has taken this long to establish is because of the voir dire (the process of selecting a jury). Since the incident and suspect is so well known, and the jury has to be composed of all indifferent and unbiased citizens who are unfamiliar with the case previous, it takes a lot to find a jury. I believe they requested right around 10,000 people for jury duty on this case.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so difficult to develop a reliable missile defense system to defend against nuclear weapons?",
        "response": "Speed.  Ballistic missiles are fast. And therefore you have a small amount of time to launch a counter. Have limited time for your counter missile to get up to a high enough speed to intercept. Takes a ballistic missile something like 30 minutes to hit a target.  Vs the asteroid where we have a lot of time to wait for it to get to the spot we want to intercept it. And can then launch far enough in advance",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do chicks breathe inside an egg?",
        "response": "The shell is porous and there is an airsack inside the egg. Critters who hatch from eggs breath through the egg shell.  _URL_0_ _URL_1_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the difference between Sunni and Shia Muslims?",
        "response": "Looks like another thread opened up elsewhere on reddit:  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were early pc screens green?",
        "response": "From Wikipedia:  > Monochrome monitors are commonly available in three colors: if the P1 phosphor is used, the screen is green monochrome. If the P3 phosphor is used, the screen is amber monochrome. If the P4 phosphor is used, the screen is white monochrome (known as \"page white\"); this is the same phosphor as used in early television sets. An amber screen was claimed to give improved ergonomics, specifically by reducing eye strain; this claim appears to have little scientific basis.[1]",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the origins of the Wild Hunt myth?",
        "response": "Hi, hopefully there will be more discussions on origins specifically, but meanwhile, there was a thread on this that you may find interesting  * [The significance of the myth of The Wild Hunt.](_URL_2_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Jewish Population in the Antebellum South",
        "response": "I happened to learn about one such case just the other day. In Raleigh, NC a fellow named Moses Mordecai owned one of the largest plantations in the state, 5000 acres at its largest with 300 slaves (by this time his son was running it), and the family was known for their brutality towards their slaves. I believe he converted to Christianity but the family kept the name Mordecai and were publicly known to be of Jewish descent.  I'd imagine in a plantation economy most people who were rich enough were slave owners, just because of their profitability and social acceptability to the point of being highly coveted status symbols. I'm also sure that once a Jewish family hit that level of wealth they'd convert and assimilate to fit in with their new social circle, like Mordecai did. Here's a link on [Mordecai](_URL_0_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can I upvote with the A button?",
        "response": "Install [Reddit Enhancement Suite](_URL_0_)! Worth it for more than just the A-upvoting.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "My vision is clearer underwater with goggles than above water with/without goggles?",
        "response": "The answer is yes. You are nearsighted, which means that the lens in your eyes don't converge the light enough. When light passes from water to air (for example, on the surface of your goggles), they decrease their angle due to Snell's Law. This means that effectively, your goggles act to make things a little bit closer as far as your eyes individually are concerned.  Here is a diagram I made to explain it: _URL_0_ As you can see, in air (the upper image), the light does not focus correctly onto the back of your eye. However, in water, the additional refraction from the water into the goggles helps you see more clearly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Was the name \"Pussy Galore\" less dirty in 1964 when Goldfinger came out?",
        "response": "Follow up question(/implicit within OP’s): how did the James Bond films deal with the Hayes Code at the time? Did being British productions allow them to get away with more than other films?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What did ancient Mediterranean civilizations like the Greeks or Romans actually think laid west beyond the Atlantic Ocean?",
        "response": "They were just talking about it in another thread. u/taciteanus talks about that subject shortly. Lets see if this link works : _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How scientists can use my DNA to determine where my ancestors originated from.",
        "response": "Essentially, your DNA holds genetic markers. These markers are signs of specific mutations that popped in different areas at different times. By looking at these markers they could say \"Well, you had an ancestor that has Marker M82, that means that you have an ancestor that was an Iroquois in the Great Lakes region at about 500 BC.\" Of course they can't go and track every ancestor you ever had. But they can track those genes that you have to where they are most common.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When a scheduled amputa is undertaken of a major limb such as an arm or a leg - what happens to the limb after the operation ?",
        "response": "It is taken away and incinerated as an amputated limb is considered hospital property and hence medical waste.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do out of focus lights on film have a hexagonal shape?",
        "response": "Because the aperture of the camera has [six blades](_URL_0_). This will cause lens flares to look hexagonal. If there are more blades, it will have a different geometric pattern.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to directly transfer thermal energy into electric energy?",
        "response": "Yes. Such a device is on the Curiosity rover. [Radioisotope thermoelectric generator](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happened to the Indians that Columbus brought back with him?",
        "response": "After the parades were done, the natives were baptized in view of the Monarchy. After that, people generally stop talking about them and they were most likely given as slaves, like the rest of the shipments to Spain. For early sources, we have two 'reliable' and generally primary sources: [The True History of the Conquest of New Spain](_URL_0_) and [The Florentine Codex](_URL_2_). There's also the account by Gomara and the letters from Cortes to Spain, both of which are rather more biased. [Letters with a really long title, '24](_URL_4_), [Unnamed letter, '22](_URL_1_), and [Gomara's works](_URL_3_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would be the real world consequences if Earths magnetic field 'flipped'",
        "response": "Less hollywood, but compasses would indeed stop working as the currently do. A reversal is - in all likelyhood - not a rapid swap from north to south. Our best understanding of it is that the dipole field which presently exists starts becoming a multipole field, with several different north and south poles developing (as, in fact, appears to already be happening). Those multipoles migrate, then re-coalesce to a dipole oriented at or near the opposite polarity of the previous stable orientation. This will likely take decades to centuries. Certainly magnetic navigation will be vastly more complicated during the multipole state.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What does Defragmentation of my Hard Drive /actually/ do?",
        "response": "Defragging makes sure that all the individual parts that make up each file are saved together, so that your computer can find the whole file as quickly as possible.  Imagine files are made up of a bunch of Lego pieces, and each file is designated by a different colour. You have these Lego pieces spread out all over your house, just dumped wherever you had free space when you finished with them. But now you need to find all the blue pieces for this one specific project. You can do it, eventually, but it'll take a while because they're randomly scattered everywhere. It'd be waaaay faster if they were already sorted and stored by colour. That's what defragging does.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Historical perceptions of time that differ from the Western linear 24-hr day",
        "response": "Not sure if this is exactly what you want, but [a tribe in the Andes perceives the future behind them and the past in front of them.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Considering that a mirror changes the direction of photons, is it actually \"deformed\" or even \"used up\" in the process?",
        "response": "In addition to the point about momentum, real mirrors aren't perfect and absorb some of the light that hits its surface. That absorbed radiation could potentially affect the surface (e.g. oxidizing a silver coating). If you pointed a powerful laser at a mirror it might absorb enough to heat up and thermally degrade or melt. Both of those scenarios don't happen commonly, though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the 1982 film Blade Runner considered a legendary and coveted masterpiece?",
        "response": "Well for one, scifi-noir was a rather inventive hybrid, & it is so well done on both fronts. I love PKD & find it to be possibly an improvement of his original story, which I would never say of Total Recall or Minority Report.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how much is the surface gravity of a black hole?",
        "response": "The surface gravity of a black hole isn't really defined as black holes do not have physical surfaces at least in classical general relativity. There is however an analogous parameter you can *\"pretend\"* represents the surface gravity at the event horizon by taking a certain kind of derivative of a vector field called the Killing Field.  For the Schwarzschild black hole, the surface gravity is proportional to,  * k = 1/4M  Where M is the mass. This is surprisingly related to the temperature of the black hole as well.  * T = k/2pi = 1/8piM It is interesting to see that bigger more massive black holes have both a weaker surface gravity and lower temperature. Make no mistake though, the \"weak\" surface gravity at the event horizon of a big black hole still dooms you to never return in the same way a smaller black hole with stronger surface gravity would. In this way, I think calling this quantity surface gravity should be taken with a grain of salt, it's useful in a limited context.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do loud noises (e.g gun shots) trigger car alarms?",
        "response": "Loud noises make the air vibrate. The louder the sound, the greater the magnitude of the vibration. The sensor in the car also vibrates because of this and it goes off.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is going on in Nevada's DNC race, and how does it affect the final result?",
        "response": "It's a caucus, there's 3 stages. Hillary won the first stage. Not enough of her people showed up for round 2 so sanders people filled in the missing spots gaining him the victory so far. Round 3 yet to come",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What exactly is turbo?",
        "response": "A turbocharger is a device which uses exhaust gases in an engine to power a fan (turbine) which pressurizes air and pumps it into the intake of a car. A turbo does not feed exhaust gases back into the car, but rather takes advantage of the otherwise wasted energy of high pressure exhaust gases. At low pressures, a turbo can help an engine 'breathe' and use that otherwise wasted energy to make power more efficiently. But at higher pressures, it increases performance at a cost of efficiency. This is because a precise amount of air and fuel must be delivered into a combustion chamber, or gasoline won't explode properly. More air into the engine means more fuel is needed to maintain that ratio, which amounts to a lot more power but also a lot more fuel. Turbos are prone to breaking, add complexity and cost to an engine design and can potentially wear an engine out faster. If a non-turbo engine (naturally aspirated) can make the target power and efficiency without it, manufacturers often opt for not adding one.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the function of noncoding or \"junk\" DNA? [GENETICS]",
        "response": "I don't think any precise percentages have been calculated to be honest, but junk DNA is a term biologists are trying to phase out as we are beginning to realise that this DNA may actually have some purpose. The main theory at the minute is that the 'junk DNA' is actually more heavily involved in regulating gene expression - so controlling RNA and other such regulatory elements. The [ENCODE](_URL_0_) project is working to decipher the parts of the genome we don't already understand.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a calculator compute the square root of a number?",
        "response": "You start with a guess as to what the square root actually is, and then you check. Then you improve your guess over time. So let's say the number is 55, and I guess 10. 55 / 10 is 5.5, which isn't equal to 10. The answer has to be between 5.5 and 10. My next guess will be the average between them: (5.5 + 10) / 2 = 7.75. Let's plug that in. 55 / 7.75 is 7.096 and change, so again, the true answer is somewhere in between. Our next guess is 7.423. Repeat that same thing again, and we get 7.416. 55 / 7.416 is...well, it's about .00039 off from 7.416, but we're only looking at the first three digits after the decimal place, so that's good enough. If we needed more accuracy, we could repeat this process as much as we want. Each time around, we get about twice as many correct digits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "On the newly discovered cat species, and naming conventions: how are scientific names decided?",
        "response": "To answer this question you need to read the [actual research article](_URL_0_), and not the press release. On the bottom of page 4 is this sentence: > These results strongly indicate the absence of current > or recent gene flow between these units, supporting the > recognition of > L. tigrinus > populations from NE and SSE Brazil > as distinct biological species: > L. tigrinus > (Schreber, 1775) for > NE Brazil and > L. guttulus > (Hensel, 1872) for SSE Brazil (based > on available names; see the ‘‘Taxonomic Considerations’’ > section in the > Supplemental Information > ). For some reason my log-in isn't working, so I can't read the supplemental information, but from reading the research article it is clear that previous scientists have suggested that there might be more than one species, and already given names to those populations. So these older designations are again being put forth for use.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Dumas' heroes called musketeers when they use a rapier, not a musket?",
        "response": "Answered your question in another thread but anyway: Because Dumas modelled his main characters after, somewhat unsurprisingly, four musketeers. [Charles de Batz-Castelmore d'Artagnan](_URL_0_)(Yeah, take a wild guess at why that was shortend, quite a mouthful), [Armand d'Athos](_URL_2_), [Henri d'Aramitz](_URL_1_) and [Isaac de Porthau](_URL_4_). Notable members of the French [Musketeers of the Guard](_URL_3_) EDIT: I suspect, but I can't yet prove this, that the rapier was a purely fictional addition because rapier duels are more interesting to read about than four guys walking around shooting people with muskets. The musket, revolutionary as it may have been, lacks a certain literary flair and it most certainly lacks the romantic element otherwise present in Dumas work.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it so much easier to aimlessly browse reddit for hours than to pick up and read a good book on a topic I'm really interested in?",
        "response": "Short term instant gratification. It's in small doses so you don't feel like you're wasting time, it's so easy to just click one more link...",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the higgs boson create the higgs field if it quickly decays into other particles?",
        "response": "The Higgs field really comes before the Higgs boson. Think of the Higgs field as a kind of sea which pervades all of space, and the Higgs bosons as the ripples which pop up when you shake the sea up a bit. Other particles get their masses by interactions with this field. You might think of it as the field slowing these particles down and imparting mass onto them the same way a person is slowed as they walk through a pool of water.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Car Brakes in movies",
        "response": "Brake lines hold brake fluid. This fluid is compressed to activate your brakes. While it's possible to cut and completely drain your brake fluid, in which case you won't be able to brake right from the start, a lot of cuts are small and will only drip out some of the dense fluid. But then, as you brake, the high pressure forces more and more fluid out until you can no longer brake. For example, if I squeeze a closed soda bottle with soda in it, it will resist and feel hard, and I won't be able to crumple the bottle. That's the liquid compressing, like how your brakes work. If I then make a thin slit nest the top of a closed soda bottle, some soda might drip out, but the rest would stay. But if I squeezed that bottle, more and more fluid would spray out each time until I could fully crumple the bottle with no resistance (meaning no braking happening)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do felines know when they are fighting or just playing around?",
        "response": "By response of said stimuli. When it goes too far a, say, kitten will signal it with body language and sound. And their partner will respond by licking the damaged area and going on a little less violently.  If you have a kitten at home you can easily try this. If your kitten scratches or bites too hard, let out a sound that signals anguish and the kitten will instantly lick the place it scratched/bit and calm down a bit. It's how they learn where the line is drawn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why we still label circuits based upon \"conventional\" current when we know that current actually flows in the opposite direction?",
        "response": "Pretty much, everything was defined before the discovery of, say the electron. Scientists, being positively minded and optimistic, decided it would probably be the positive charge moving around. Note also how stuff like Capacitance is measured in Farads, which is a huge unit and you usually use micro or nano farads because the SI standards are way off. Same with Coulombs. It was defined before that notion of electron charge. So, like Farads, it is also really small. (x10^-16)  So yeah, it was just guess work that got well known to the point where it can't be changed, so everybody gets to deal with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What products do E. Coli excrete?",
        "response": "A lot of stuff. It is hard to sum up. and it depends on what environment the E. Coli cells are in. Bacteria are very good a making a rapid response to their environment in order to survive if stressed or proliferate if a lot of nutrients are available.  They can excrete some proteins and polysaccharides which forms a matrix of molecules called 'biofilm'. This biofilm helps the e. coli and other bacteria with sticking to surfaces and protecting from threats. I guess they can also excrete some enzymes to break down nutrients so they can pass through their membrane.  Not a very concrete answer sorry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were unidentified dead bodies handled in olden times, before refrigerated morgues?",
        "response": "There's a famous unidentified body from 19th century Paris--a beautiful young woman known only as \"L'inconnue de la Seine\" (the unknown of the Seine River). Her body was recovered and the mortician made a face mask of her so that she could be identified more easily--looking at a mask is a lot more appealing than looking at a rotting dead body. Because of her beauty, she drew a lot of attention, but in some other cases, they also did molds of the face. Once photography was available, photos might be taken of the unidentified after they were buried. In this case, though, she was never identified, but her face became a popular work of art, and the Resuscitation doll used in Red Cross classes on CPR and mouth-to-mouth resuscitation, now has her face.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how can things that aren't real (like the number \"i\" in mathematics, the sq. root of -1) be used to model things that ARE real (it's application in different fields of engineering, etc.)?",
        "response": "Numbers themselves are not real. The term \"imaginary number\" is kind of a misnomer since all numbers are imaginary. The reason we call the square root of -1 imaginary is because it defies the internal logic of mathematics being that you can't square any real number (numbers we use to represent things) and come out to -1 or any negative number. That's why when we take the square root of a negative we factor out the -1 and square the absolute value. But sometimes we need to take the square root of a negative number that represents reality. To keep the logic consistent, we use an imaginary number even though it is very \"real\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do calorie meters in the gym equipments work? How accurate are they?",
        "response": "They are not very accurate.  They are based on a set of calculations derived from one of the [Basal Metabolic Rate](_URL_0_) equations - Harris Benedict, Mifflin St Jeor, Katch McCardle, or Cunningham.  When you enter your weight and age into the machine, the computer uses this information with one of the above formulas to generate an average (read: \"guess\") caloric expenditure for someone roughly your height and weight going at whatever speed the machine is going.  The machines can't take into account differences in your genetic metabolic rate, your resting heart rate, your bodyfat:lean tissue ratio, insulin/glucose ratios and a number of other things that can affect your energy expenditure rate, so that's why they can only provide a rough guess... because everyone is different. A much more accurate (though still not perfect) way to measure your calorie expenditure is to use a good quality heart rate monitor.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If some chimps are smart enough to be taught basic sign language, why can't they be taught basic words as well?",
        "response": "They don't have the complex voice boxs that humans do to produce speech",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does western music impose 8 note notation on a 12 note scale?",
        "response": "This is because the scales in traditional western music have only 8 notes. If we didn't use different scales, then we would only need those 8 notes, but since we like to change between the scales, we need to be able to represent the other scales with the notes of the normal scale (Do major. I don't know how you write this with your A-G system). This ends up with the modern system of music notation",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I recently read that some upper-class married women in 18th and 19th century Europe became mistresses to royalty. Did the husbands know? If they did, why didn't they care?",
        "response": "I know this is a very short reply (apologising to the mods) but the answer can be given in a TL;DR manner.  Yes, the husbands generally knew. In fact, the entire court most probably knew.  Why did they not care ?  That has multiple reasons :  1) she was mistress to the KING, if you liked it or not, that didn't matter.  2) the husbands often got some rewards, like lands or titles to keep them happy.  3) the conception that we have today of marriage, is not at all the 18th century conception of marriage. Most of these men were married to somebody they didn't love, and most probably had mistresses themselves. So they didn't really care.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did US soldiers during WWII commit war crimes? The Russians and Japanese (and Germans obviously) stories of atrocities is well documented. But what about the US?",
        "response": "The first paragraph from /u/restricteddata touches on the issues with answering this _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Have we been able to bond any noble gas element with any metal, and if so, what is the longest we've been able to maintain this bond?",
        "response": "I've found you not only a compound with a noble gas metal bond (was expecting this), but I actually found your utterly insane suggestion of a direct nobel gas and gold bond. The [Tetraxenonogold(II)](_URL_0_) cation present in AuXe*_4_*^(+2)(Sb*_2_*F^− *_11_*) Florine makes for weird chemistry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do pain killers detect which part of the body to heal?",
        "response": "As others have said. They don't. They work on one place, the brain. So drugs that are sold 'targeting' areas such as sore backs or whatever are false advertising. By cutting off the pain receptors in the brain you cut off pain from everywhere.  Example: i have osteoarthritis in my foot and am prescribed various painkillers (tramadol, dihydracodeine, naproxen and cocodamol) if i say fall over and hurt my arm the same drugs sort that pain out. They're not going round my bloodstream looking for pain, they're just stopping any pain signals crossing the neuron paths so my brain doesn't know that somewhere hurts. Obviously there are also megatives to that. We experience pain as its our body telling us something is wrong.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is white the combination of all colors?",
        "response": "It's the combination of all colors of light. Sunlight is \"white\" light, and when it is split into different wavelengths via a prism, or objects that only reflect a portion of the spectrum, different colors show up.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many corporations choose to form in Delaware?",
        "response": "Lower taxes. Arbitration rules that favor the companies.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does England still have a queen?",
        "response": "The answer is simply that the people of England (and the rest of the UK) are happy with a queen, and that anti-monarchist movements have never gained much ground. The monarch is just a figurehead nowadays, with almost no political power. If they ever tried to make a fuss with what little power they do have, they'd likely not have it for very long. But their existence appeals to peoples patriotism or whatever with the end result that the monarchy continues. Overall, the monarchy probably brings in money, looks nice and makes people happy. So, people like having it and it isn't going anywhere. The current queen is particularly popular and has had a very long reign, so most people remember her fondly. She's also perceived to have been a very good monarch, extremely dedicated, and is generally well respected even by those few who don't want the monarchy.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are people suddenly focused on automation replacing jobs?",
        "response": "If you’re aware of the spinning Jenny you must surely be aware of Luddites.  The fear of automation replacing workers never went away.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there examples of animals farming, or domesticating other animals? Why, or why not?",
        "response": "[Ants maintain herds of aphids. They collect honeydew secreted by the aphids, move them to new pastures, and fight off predators.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What countries or ethnic groups would have been happy with an Axis victory in WWII, not including Germany, Italy, or Japan?",
        "response": "I am surprised nobody mentioned Spain that came out of a Civil War backed by Germany and Italy and would have probably be allowed to expand its influence in North Africa at the expense of France and recover back places like Gibraltar from British hands.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What happens when a state passes a law that contradicts with the Constitution in the United States?",
        "response": "Good question :) This is actually one of the main functions of the US Supreme Court. It is their job to interpret the Constitution to decide if a given law is unconstitutional. Once they make a decision state governments are obligated to adhere to their ruling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a company like \"Open Office\" make money if they just give their product away",
        "response": "Most not for profits have a part of their company which focusses on support for those products, providing the knowledge which comes with having created a product to large companies who want it setting up, maintaining or custom functionality.  Some companies also have a basic and a professional version, they give away the software, but the more powerful and extensible parts are charged for (such as Unity3D, for example)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does relativity work when moving near the speed of light?",
        "response": "> If we send a craft that can instantly accelerate to 99.9% of c with no damage to the craft itself or the people inside then it will get there in about 1000 years. Roughly same amount of time has passed on Earth and on the destination planet but how much time has passed on the ship? And how? At 0.999c, the [Lorentz factor](_URL_1_) is about 22.37. This means the distance between Earth and the destination is [length contracted](_URL_0_) by a factor of 22.37 - so when the spacecraft is moving at speed, they'll see the distance between the two as 44.71 light years, rather than 1000 light years. Therefore, the trip would only take 44.71 / 0.999 = 44.75 years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the truth between the rivalry between Nikola Tesla and Thomas Edison?",
        "response": "hi! not discouraging other responses, but you may get something out of these earlier posts * [What Really Happened Between Edison and Tesla?](_URL_3_) * [What is the historical consensus on the Tesla-Edison debate?](_URL_0_) * [Was Thomas Edison really the \"total dick\" that people on the internet make him out to be?](_URL_1_) * [Why is there this new cult appreciation of Tesla? Was he really as amazing as people make him out to be?](_URL_2_) oh, also, this could be a good question for /r/AskScience - maybe run a search there for \"tesla edison\" to see if it has come up before",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can people who don't excercise eat unhealthy food without gaining extra abundance of fat?",
        "response": "Weight gain = calories absorbed - calories expended. And you expend a certain amount of calories just staying alive, minute to minute. You can eat very unhealthy-seeming food without gaining weight, if you simply don't eat too much (exercising *portion control*).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If traveling close enough to the speed of light, would a human live to make it to the edge of the observable universe?",
        "response": "If you can achieve speeds relative to Earth arbitrarily close to the speed of light, then you can travel an arbitrarily large distance (as measured on Earth) in an arbitrarily small amount of time (as measured by you). For example, if you could travel at 0.9999999999999999999999999999999999997 c you could reach a point that people on Earth believe to be 46 billion light-years away in 1 second of subjective time. Of course, those people on Earth would see you taking 46 billion years to complete the journey.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How is the age of a wild animal determined?",
        "response": "There are many ways to tell the age of an animal, usually it is done via dentition. However, in the case of Orcas and other marine mammals the only real way is through large photo databanks. Photos of the orcas, especially their dorsal fins can tell you exactly who is who based on the size, shape, colouration, and scars. \"Granny\" the 103 year old Orca was probably placed into a databank long ago, and her features noted. Every once and a while very old orcas are spotted. Now that we have much more comprehensive [photo] databanks we will be able to learn more about the longevity of marine mammals over the coming decades.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can a stream of air from a vacuum stabilise a ping-pong ball midair?",
        "response": "Because when an object is introduced to airflow, the air travels on practically all sides of said object. A shape like a sphere is easier to do this with because there are no edges to stop, slow, or block the air from hitting all the surface area. So when you hold an airflow below an object, the center of airflow is the strongest, and gravity is pushing down on the top. Because a ping pong ball is effected by gravity less than something like a bowling ball, a less powerful airflow is needed. Hence why it floats, rather than infinitely rise or fall. It's both going up and down at the same time, keeping it relatively stable. The gravity pulls it down, but the airflow pushes it up and locks it in place due to the airflow moving around the surface area of said object.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why wasn't John Breckenridge elected to the Confederate presidency?",
        "response": "Well first it is important to understand that Breckenridge's strength in the 1860 election in the South is often misunderstood. The Lower South was very much a three way race with Douglas, Bell, and Breckenridge all capturing large portions of the vote. Breckenridge in fact won only slightly more than fifty percent of the vote in the seven states that would become the CSA, and he would have lost several states if Douglas's and Bell's votes are counted together (as both stood as Unionist candidates). In the Upper South Breckenridge's position is worse, with Lincoln surprisingly winning a large number of votes in a few border states, and overall Unionist candidates performing better. More to your original question, Breckenridge like most in the Upper South advocated for compromise after the initial seven states left the Union and didn't join the CSA until well after Jefferson Davis was elected president.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When did humans first suppose they had a common ancestor with monkeys?",
        "response": "No, Darwin was the first, because before Darwin, no one thought that any different species could have a common ancestor, because it was believed each species was a discrete, unchanging unit. That is, even though there was Lamarck, who proposed that species could change in appearance somewhat, he did not say that one species could change so much it became a different species, nor that one species might have several populations branch off and become other species.  However, the similarities between humans and apes and monkeys were noticed earlier. This is best indicated by Carl Linnaeus, creator of the binomial nomenclature system which we use (with a few adjustments) today to refer to different species. He placed humans and apes together in the same category. Bonus fact: Charles Darwin's grandfather, Erasmus Darwin, translated Linnaeus's works into English.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to skip Monday by traveling through time zones?",
        "response": "Bro I've been time traveling past Monday for decades.. just get blackout drunk on Sunday and wake up on Tuesday. I haven't had a Monday since '98",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If string theory isn't testable, how is it a theory? And if it isn't a theory, isn't the terminology just muddling up the concept more?",
        "response": "You are right that testability, and more importantly falsifiability, are absolute requirements of science. String theories *are* theoretically testable (some variations more so than others), it's just that the means to do so are outside the reach of our current technology. Most of string theorists' energy these days goes into finding ways of bringing that testability within reach, without needing, say, an accelerator the size of the orbit of Saturn.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can the British Top Gear get away with some words, yet not others?",
        "response": "Since you are referring to the British Top Gear, may I assume you are not British? Pejoratives vary by culture, even when using the same language, so what may be too offensive to broadcast in one country may be inoffensive in another.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Would it be possible to turn a pool into an aquarium one could swim in?",
        "response": "They're called Natural Pools _URL_0_ _URL_1_ _URL_2_ Making one with fish and such in it would take a bit of tweaking, but I've seen a few done that way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How acupuncture needles \"cure illnesses\" and why it is mostly found practiced by Eastern doctors",
        "response": "I have no source for this, but I remember reading that acupuncture stimulates your nerve cells, making them feel pain I guess, which causes them to send the signal \"help, we've been hurt\" to your body which responds by sending your immune and repair system to action stations in that part of your body, which apparently can help.  I'll try to find a source for this as I too am curious as to what science thinks of acupuncture. [edit] according to wiki what I just wrote is wrong. Potential placebo effect or perhaps a \"feeling\" being better due to endorphins is listed as ~possible~.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When and why did people start using sarcasm?",
        "response": "It has been around for a long time. The word itself goes back to ancient Greeks and we have material from people like Demosthenes who live two dozen centuries ago that showed that orators back then used sarcasm. It seems pretty useful when arguing or expressing opinions about things and makes use of aspects of human thinking that probably go back beyond recorded history.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are Photons everywhere?",
        "response": "Technically yes. However, obviously an object can intersect between the viewer and the light source cutting off that particular source of photons for some time. So, for example, if you are observing light from 1 million light years away, and an object intersects at 500,000 light years, you won't see the light disappear for 500,000 years.  That doesn't mean that photons are still not there, from other light sources - but simply not from the one that was blocked. Another possibility to think of is the object emitting the light is no longer there. In that case you will still receive photons up to the point where the object stopped creating them (delayed, of course, by the distance to the object). So... if a star 1 million light years away burns out today, you will still see photons for 1 million years - even though the star no longer exists.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "if I put a 24 hour clock on the snow at the North pole, is the clock staying still and the hour hand moving or is the hour hand staying still and the earth moving?",
        "response": "It depends on your frame of reference. If the sun is your frame of reference, then the Earth is spinning, and thus, the clock housing is spinning, and the hour hand is essentially not moving (except for moving with the Earth as it makes it's orbit around the sun). If your frame of reference is Earth, then Earth is not moving, the housing is not moving, and the hour hand is rotating. You could also choose some other frame of reference and get an entirely different answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does soap remove bacteria/virus’ from hands",
        "response": "Soap is a detergent, a surfactant. That is something which breaks down the surface tension of water so it will \"penetrate\" better. This is why you need soap to clean greasy dishes. Water + friction + detergent let's you get everything off your hands that you can.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "During the 1930s, right before Italy invaded Abyssinia, which other African countries were truly independent?",
        "response": "Abyssinia was one of the last independent african nations just before World War 1, along with Liberia. Transvaal and Orange Free State were independent until 1910, that's pretty close. You also had the states of Darfur in western Sudan and Dervish in western Somalia, although not traditional nations, involved in the great war. There were various small states in Sudan, Somalia, Ethiopia, Chad, Libya, Niger, northern Nigeria, and present day C.A.R. also floating around resisting a bit. Morocco was independent until 1912. Zambia/Northern Rhodesia/Barotzeland was unexplored until very late and even then ruled by company rather than the crown at first. Also I believe there was a small kingdom in Senegal lingering around for a while though the name escapes me.  Source: Martin Meredith's **The Fortunes of Africa",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do modern day outlets and appliances not have the reset and trip (red and yellow buttons) today, and most appliances and outlets in '90s had them?",
        "response": "What you're talking about there is a device called a Residual Current Device (RCD) or Ground Fault Circuit Interrupter (GFCI), depending on which side of the Atlantic you're from. What it does is cut off the electricity at the first sign of something going wrong. In the 90s, these were fairly new tech, and it the recommendation came out that we fitted them to sockets or appliances used in risk areas - particularly in wet areas, outdoors or for power tools. In time, as new houses got built or old ones were rewired, we went away from protecting individual appliances or sockets, and protected the entire house. If I go to my consumer unit (fuse box), there are two of these devices which, between them, cover my entire house instead of having to do it at a more local level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do children with plenty of friends still have imaginary friends?",
        "response": "Children often have imaginary kids to play out their sense of insecurity in the world - many children with good social supports can still have a sense of insecurity or sense of anxiety. Often kids who have conflict in their lives will find solace in an imaginary friend who offers the kid control over what happens. i.e kids are able to control the imaginary friend while they cannot control what happens in their other/real world. I have not really seen kids with imaginary friends who were lonely per se' - I have worked with a few kids with imaginary friends or pets when they were dealing with difficult feelings and sometimes in situations they could not handle. I read a study that suggested that 25% of kids have imaginary friends - it is not all that uncommon! Ray",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why hasn't a disorder like PCOS been bred out of the human species?",
        "response": "It is an autosomal dominant disorder that is not automatical expressed. First off males can carry the gene and pass it on to their children. Also just because a women has the gene does not automatically mean she will show signs or symptoms. There are other factors in play that are unknown that cause the person to start expressing the disorder. Therefor if someone gets pregnant and before expressing it they would also pass the gene along",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If printer ink costs so much, more than gold apparently, then how come full colour magazines can cost so little?",
        "response": "Inkjet printer ink is expensive because it has a high markup. Printer manufacturers sell their printers for a loss — asking less than it costs to make the printer — expecting to recuperate the profits in ink sales. Magazines are printed on large commercial printing presses, not consumer-grade inkjet printers. The price per page to print full color is much lower.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do things like downloads commonly get stuck at 99/100% done, or with 0:00 time left?",
        "response": "Also, sometimes the file is being moved from a temporary location to its final location. I see this particularly when I use a download manager.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are TV series produced and aired in seasons, instead of a more continuous way?",
        "response": "The people involved in the production like to have some time off. Soaps do more or less what you describe, and it's generally considered pretty stressful.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could we produce a micro kugelblitz with the proper application of current laser tech?",
        "response": "To create an about Planck mass (that's your 22 μg figure) BH from a kugelblitz you need to focus 22 μg × c^2 ~ 10^9 Joules worth of light into a space about a Planck length wide. This is absolutely beyond impossible with any foreseeable technology.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the detail of the Australian deal to resettle refugees in the USA?",
        "response": "The Australian government has a policy that states that no refugees ariving by boat will be settled in Australia. The adoption of this policy has stopped new boat arrivals but there are about 1,250 prospective refugees sitting in offshore detention centres that are currently faced with the choice of \"go back to where you were fleeing from\" or \"remain indefinitely in a prison camp\".  To rectify this Australia made two seperate deals with the US. One of these involved the US taking these prospective refugees, vetting them and settling them in the US. The other involved Australia agreeing to take in Central American refugees from camps in Costa Rica and settle them in Australia. Both governments claimed that these deals are not linked but due to their timing they almost certainly are. The government also made it very clear that this was a one-off deal and so it likely won't inspire too many others to try to reach Australia by boat. **TL:DR - Abdul for Juan refugee swap.** Edit: Changed my joke.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did humans begin to drink milk/utilize cows for dairy?",
        "response": "You can of course realise that \"sucking on the underside of a cow\" is probably the dumbest possible way it happened. After all, what do we drink when we're infants if not milk? And, of course, human curiosity will find out our milk is actually tasty. So you start trying the milk of other animals, preferably docile, and find out hey, this milk is pretty cool, and there's just loads of it. As for where to find it, you only need to look at what seems brimming with liquid, and being sucked on by baby cows.  As to how we got to cows, I do imagine we would breed them or just live closeby to them for their copious amounts of meat and docile nature, leading to a very easy to procure food source. As for a more scientific answer, have a look: _URL_0_. I guess since it happened such a long time ago, we don't really know what our interaction to these animals was like.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can we possibly know that red dwarf stars will burn for trillions of years if the oldest known evidence of anything is only ~14 billion years old?",
        "response": "You can calculate their energy output and compare it to their mass You can assume that with the mass of red dwarfs, the fusion of hydrogen occurs so slowly, based on their energy output, that their supply of hydrogen will last hundreds of billions to trillions of years.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are many people so ignorant of commonly accepted facts?",
        "response": "These obviously false beliefs are based on *conspiracy theories* that claim a group of powerful people are trying to fool us. You're not alone in asking, and kind strangers have explained: 1. [ELI5:Why are some people so susceptible to believing in conspiracy theories? ](_URL_6_) 1. [ELI5: Why do so many people believe conspiracy theories ? ](_URL_0_) 1. [ELI5: conspiracy theories. How do people believe them so vehemently? Where do all the big theories come from? ](_URL_2_) 1. [ELI5: Why do so many people believe in ridiculously complicated 9/11 conspiracy theories (controlled demolitions, holographic planes, mini-nukes, etc) instead of simple ones (hijackers were government agents, other people had advanced knowledge, etc)? ](_URL_7_) 1. [ELI5 the Illuminati and why so many people believe in them. ](_URL_4_) 1. [ELI5: Why do people deny the moon landing? ](_URL_5_) 1. [Why People Believe Conspiracy Theories ](_URL_3_) 1. [Why Do Some People Believe in Conspiracy Theories? - Scientific American ](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does drinking alcohol make me fat when the average alcoholic seems skinny/lanky?",
        "response": "Because many alcoholics spend their money on alcohol rather than food. Also depends on their drink of choice, a beer drinker will take in more calories and therefore be larger on average than one who drink primarily spirits.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come Old World sicknesses didn't affect the Americans during Viking exploration?",
        "response": "The Norse colonies in North America were established around 1000 CE and abandoned not long after that. [Smallpox first arrived in Iceland in 1241 CE](_URL_1_). Similar the Pacific Islands don't appear to have had endemic sources of such diseases. For example, measles was another big killer in the New World, but it didn't arrive in Fiji until 1875. There were several devastating outbreaks of smallpox throughout the Pacific during the time of European colonialism in the 18th and 19th centuries, but relatively small populations and the isolated nature of individual islands prevented the disease from becoming a chronic problem as it was in North America. You may be interested in [my answer to a similar question](_URL_0_) previously, which includes links to several related conversations as well as [the relevant section of our Popular Questions](_URL_2_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did so many people default on their home lones in 2008/9?",
        "response": "Banks were much looser with who they loaned to and in turn had options for \"Sub Prime Buyers\" or buyers that didn't have the income for traditional loans. Many of the loans had adjustable rates, where you would have a steady payment for say 5 years but after that the rate would adjust to the current percentage making many of those home payments unaffordable. Therefore the buyers couldn't keep up with the payments and defaulted.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you delete something where does it go?",
        "response": "Data on hard drives is represented by 1's and 0's. All grouped data (files), are accompanied by a delete flag. For data in use, this is set to 0, so that it won't be overwritten. When you delete something, in almost all cases, the only thing that happens is changing this flag to 1, which is simply indicating that the data that this flag accompanies can be overwritten. This is why data-recovery often works. When you delete something, it is not really deleted until it is overwritten by other data. So as long as it is still there, it can be recovered.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If I was on a train that was going 20 mph, and I began walking toward the front of the train at 5 mph, am I now going 25 mph?",
        "response": "> If I was on a train that was going 20 mph, and I began walking toward the front of the train at 5 mph, am I now going 25 mph? Yes, you are now going 25mph with respect to the ground.  > his high school science teacher said that you cannot move faster than the vehicle you are in. I do not know the context of the teacher's statement, but the meaning that is implied here is incorrect. If you're in a moving vehicle and you start to move around, you can absolutely move faster with respect to the ground than the vehicle itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question regarding coordinates in war diaries Second World War",
        "response": "The third digit is a way of specifying specific points within a particular grid square. It could equivalently be represented as 69.7,77.4 - i.e., the point specified is seven tenths of the way between 69 and 70, and four tenths of the distance between 77 and 78. Divide each side of the grid square in question into tenths, and you should be able to read things off as needed. These lines are not overlaid on the map because to do so would obliterate much of the geographic detail.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do larger elements (e.g Moscovium) have such short lifespans - Can they not remain stable? Why do they last incredibly short periods of time?",
        "response": "A contributing factor is that we probably haven't synthesised the most stable isotopes of many superheavy elements. The higher the atomic number, the greater the neutron/proton ratio required for stability, and since superheavy elements are synthesised by fusing two lighter ones together it's hard to get enough neutrons. For example the first isotope of Copernicium (element 112) synthesised, in 1996, was Cn-277 with a half-life of under a millisecond. A few years later Cn-285 was synthesised and that has a half-life of about 30 seconds. Still very short in human terms, but many thousands of times more stable than the first isotope discovered. It's likely the same will apply for the newest elements discovered, and indeed unconfirmed results indicate this. Even in the predicted \"island of stability\" half-lifes are still likely to be minutes at best though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When I read that the Earth-Sun distance is 8,3 light.mins, is that from surface to surface or center to center?",
        "response": "Considering or not considering the sun's radius would make about 0,4% difference. Since the 8,3 light minutes only have two significant places, it really is negligible. PS: Wolfram Alpha is an awesome tool to check such things: _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do they safely train drug sniffing dogs to find things like cocaine, heroin, and meth without the dogs getting high/sick in the training process?",
        "response": "Drug addiction in drug sniffing dogs is a serious issue. They keep the packages secure in training so the dog can smell the drugs without inhaling a large quantity of them, but in the field things aren't quite to simple.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Huawei allegedly spy when https is a thing?",
        "response": "The allegations say that the company manipulates (Android) phones, i.e. end-user devices, by installing software that gathers information about their users that is sensitive. The engineering part of this allegation is completely mundane: any OEM is able to install their software on phones by design. On the subject of what sensitive data such software may access on a device, there is vast amounts of research and PoCs (encryption keys, metadata, etc) so if you can limit your interest down to something I can point out some bibliography.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why didn't we start looking at the closest solar system for habitable planets to begin with?",
        "response": "We did. Our ability to detect exoplanets is limited and gradually improving, and distance is only one variable that affects whether or not we're able to detect a particular planet. We had looked there before but weren't able to see anything out of the ordinary until now.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "We know about Soviets like Petrov and Arkhipov whose decisions help avert nuclear war. Are there any such individuals from the American side? Would we know about them if there were?",
        "response": "_URL_0_ Kinda a different story but there was a u-2 spy plane pilot who was shot down during the cuban missle crisis that put the whole cold War into perspective for Kennedy and khrushchev. Rudolf Anderson was the only direct casualty of the cuban missle crisis, but his death represented the closest to war the us and ussr came. it is considered that Kennedy and khrushchev realized the gravity of the situation when Anderson was shot down, and then begin to try and back off any acts of aggression",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does ball lightning form?",
        "response": "> but has been recreated in lab settings Displays in labs have been made which produce a similar appearance but there is no explanation for how it might have occurred naturally. There is also a lack of evidence that ball lightning occurs at all so unfortunately there really isn't any answer to your question at this point.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "why does uh and um come so naturally when speaking?",
        "response": "1st question: I think it's just a thing that is learned when we're babies, really. If someone can't think of a word, or they need a moment to think of what they want to say, then they'll say \"uh\" and \"um\" and a baby will pick that up the same way they would any other word of a language. 2nd question: It is common! I know for sure that in French they use something like \"uh\" and \"eu\" and in Japanese they'd say えっと (etto) and あの (ano) to convey the same meaning of a pause to think.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If the common cold virus cannot be vaccinated because it changes so much, why are the symptoms almost the same for everybody?",
        "response": "In the case of the cold virus, natural selection is 'looking for' two things: ability to replicate in a host, and ability to spread from that host to infect a new host. The exact protein sequences that allow it to infect cells are VERY specific, so very minor changes in sequence can lead to pretty substantial changes in the shape of the protein, which is what actually 'matters' to the cell and the infecting virus. These things deal with spread of the virus. The symptoms are mostly related to reproducing the virus, and once it's changed up its tactics for getting inside you there's no need for it to change up its tactics for replicating.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we can change animals' bodies pretty much entirely (i.e. grey wolf -- > chihuahua) by breeding, why can't we also improve their intellectual capabilities this drastically?",
        "response": "It is feasible to drastically increase intelligence, but it is much more difficult than selecting for outward physical traits. Any shmuck out there can tell if a dog has the desired shape of ears, but designing and carrying out intelligence tests to figure out which dogs are actually smartest would neither cheap nor simple.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Twitter censorship work? And how are governments involved?",
        "response": "Judging by Wikipedia, Twitter has the ability to limit messages based on geographic region. And apparently has a mechanism by which Twitter can be asked to hide messages. Basically, if Twitter gets a legal order telling Twitter to hide things, they can comply. How the government is involved depends also on whether you consider the judiciary part of government.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the moon control ocean tides?",
        "response": "Gravity Gravity pulls the water up a little bit. More than it can pull the land (which is attached to other land and on average all further away) Note that the land does get pulled too - which is why you get a tide opposite the moon - thats the land being pulled away from the water!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did languages develop a genetive case to where all objects have a gender?",
        "response": "I'm not sure if this belongs in this sub, but it crossed my mind and figured this sub would get better answers than the main ask sub. I speak German and Russian. Both languages assign a gender to what an English speaker would just call an \"it\".  I was pondering the creation of languages, how it usually starts as nouns for identifying objects and being able to describe them. Verbs come along to explain what they do. Tense explains when things happened. And so on. I don't understand how objects that have no gender came to have a specific gender within the language.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people react negatively (or even violently) when presented with evidence that challenge their world view?",
        "response": "Psychology major here. We've focused (in my social psychology classes, in particular) on the idea of cognitive dissonance. What this means is: You perceive the world in one way. Reality comes along and shows that you might be wrong. You have two options, according to conventional information processing: accommodation or assimilation, which basically mean that you can either change your world view to incorporate the new idea... Or you can change the idea to fit into your world view. Assimilation and accommodation are how we deal with our world view being challenged. It's much easier for most people to assimilate (change the idea) than it is to accommodate (change the world view). This is why people react violently to reality challenging them. If you'd like me to explain anything further, please let me know. :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did California get so unlucky when it comes to water shortage? Why isn't it affecting Oregon and Washington?",
        "response": "It is affecting Oregon and Washington. There is almost no snow pack on any of the mountains which means drought. The problem is the population of California is so much more than Oregon and Washington. Also, the western parts of OR snd WA are temperate rainforests. They generally get more rain than California anyway.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does the sun move through time at a slower rate than earth due to gravitational time dilation? How much slower would time be on the surface of the sun compared to earth?",
        "response": "using the schwarzchild metric with dr=dphi=dtheta=0, dt/dtau = sqrt( 1 - 2GM/rc^2 ) ~ 1 + GM/rc^2. Plugging in the mass and radius of the sun I get that time is dilated by about 2 parts per million (2e-6). Plugging in the mass and radius of earth, I get a time dilation of around 1 part in 100 billion (1e-11)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Difference between Special and General Relativity",
        "response": "Special relativity describes flat space; general relativity describes curved space. Note that general relativity is a superset of special. It's not an evolutionary step - GR doesn't replace SR like GR replaced Newton. On a scale where the curvature of space is approximately zero, things behave just like SR says.  Note that all other forces and particles inhabit space, so SR is really a statement about the geometry that applies to all forces and particles. Although it was first discovered in the context of electromagnetism, it's not unique to electromagnetism.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Aloe Vera in refrigerator for sunburns.",
        "response": "Putting something soothing on a burn always feels good. Putting something that is soothing and a bit cool feels even better.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are some examples of forces driving current human evolution?",
        "response": "> Are we evolving faster or slower than we have been for say the last million years? There's a book by two anthropologists, called the 10.000 year explosion, which argues that our higher population density since the Neolithic revolution has led to accelerated evolution in our species, with a rate of change anywhere up to 100-fold faster than during the paleolithic era.  > What things are still pushing us to evolve? There are still factors that drive us to evolve. [One study looked at a village in Canada, it found that the age at first childbirth appeared to be decreasing, which was argued to be indicative of genetic change.](_URL_0_) There is other evidence that parts of our genome are still changing. [Studies find that convicted criminals have a much higher fertility rate than comparisons.](_URL_1_) The authors conclude that criminality is an adaptive trait in industrialized society, which means that we are gradually evolving to become more criminal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could the romans read their numerals as fast as we can with our arabic ones?",
        "response": "Follow up question: How did romans do math using their numerals? Dividing 3356 by 5 is relatively easy using just a pencil and paper. How do you divide MMMCCLVI by V?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do mostly women seem to peddle crappy MLM products?",
        "response": "Theres a couple reasons, they typically target women, specifically housewives because they are home a lot and they lure them in with the idea that they can earn a living easily. People like that are often desperate to feel like they can achieve things. Also the products are ussually things women are more likely to be involved with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What were the benefits and detriments of Ronald Reagan's Presidency?",
        "response": "hi! there have been several questions about the Reagan presidency; I rounded them up in the FAQ* not long ago, so check it out to catch up on previous discussions: [Assessment of Ronald Reagan's presidency](_URL_0_) *see the \"popular questions\" link on the sidebar, or the \"wiki\" tab above",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does chemotherapy work?",
        "response": "In very very basic terms, chemotherapy is usually a cocktail of drugs that are really toxic to dividing cells. If cells divide a lot and quickly, like with cancerous cells, then it has a worse impact than on cells that divide very slowly or not at all, like brain cells. The idea is that even though you are poisoning your own cells, which you are and which causes the various nasty side effects of chemo, the poison is effecting the cancer worse than it is effecting you, and so the cancer will die while only making you very sick.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are redditors talking about when they say they \"have [another user] down as [nickname]\"?",
        "response": "Reddit enhancement suite allows users to tag people",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does hibernation work? Do they stay in the same position the entirety of winter? If so how do they recover so quickly and how is it different from sleep?",
        "response": "The main way hibernation works is by eating (and drinking) lots of stuff before winter (when most animals hibernate).  They then go into a deep sleep, sort of, and are usually very hard to wake up (some exceptions apply, bears for example can be woken up pretty easily). During the hibernation their bodies use as little resources as possible, even lowering body temperature and preserving nutrition they would otherwise just waste.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the link in hebrew between the alphabet and numericals values and what does it mean for us?",
        "response": "The Hebrew language uses letters to represent numbers, as well as using letters to form words. The meaning is contextual, but as a consequence any word could be interpreted as a number as well. This structure combined with the religious writings in Hebrew means that mentally ill people with an obsession with religion and a mathematic streak can become fixated on looking for numeric patterns in religious texts written in Hebrew. With so much material to work with practically any number can be obtained to justify the convoluted justifications formed through their mental illness. What does it mean for us? Nothing, crazy people are still crazy even if they do math with prose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is it more challenging to store renewable energy than other forms of energy? (Ie. Why has storing renewable energy been a challenge, and hence, seemingly become the new measurement of milestones with regards to renewable energy?)",
        "response": "Electricity storage is the challenge.  Batteries, in the capacity needed to store enough to power houses much less cities, can get very expensive.  Many sources of renewable energy are far from consistent and not controllable like burning fuels, so storage is a huge aspect of electricity production if renewable sources are to compose a significant portion of production",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If we received a photograph from a random place in the universe, could we tell where it was from by looking at the stars?",
        "response": "No, because the vast, vast majority of such images would have no discernible stars in them at all.  There are stars in our sky but that is because we are embedded in the disk of a galaxy. A random place in the *universe* is overwhelmingly likely to not be in a galaxy at all.  And even if it were, we do not map anything but the stars in our own galaxy and the brightest stars in nearby galaxies. If you did end up landing in a random galaxy and did have stars in the image, we would have nothing to compare them to, unless by astounding luck you found yourself in the Milky Way.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the ISS never run out of fresh air to breathe ?",
        "response": "Electrolysis of water. Water is split into oxygen and hydrogen. The breathable oxygen is vented into the cabin, while the explosive hydrogen is is vented externally.  Edit: I do not know where the water comes from. Some other comments say urine and air conditioning condensation contribute.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are people trained to withstand torture?",
        "response": "There are certain traps and techniques interrogators use. Once a technique is discovered, it loses much of its potency.  Training gives recruits a chance to practice detecting and avoiding those techniques.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is there a homogeneous material whose surface is a conductor but otherwise it's an insulator?",
        "response": "There is a class of materials, only recently studied, called topological insulators, where current can only pass around the edges but not through the center. Physical realizations of these systems include two-dimensional electron gasses (2DEGs), which are generally a very thin layer of a semiconductor wedged between two insulators. These are being investigated as tools for quantum computing. I'm not aware of any 3D topological insulators, but I may be out of date. According to Wikipedia, it has been observed in bismuth antimony.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Your voices have been heard. Comment score hiding update",
        "response": "I don't think there's any evidence that vote hiding does anything whatsoever, especially if comments are still sorted. An argument could be made if hidden posts had equal visibility, but they don't.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some video games aimed at adults have a significant following from younger players (e.g. Call of Duty and other FPS's) and vice versa (like Pokemon)?",
        "response": "Although aimed towards adults. Call of duty is pretty basic and doesnt require any real understanding of the series such as Pokemon (evolutions, training, strategies, pretty intense stuff). Its easier to pick a controller and shoot then it is to dedicate time to a adventure game (kids have short attentions spans).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to have a mutation where you have a 4th cone in your eye?",
        "response": "Yes, and these people [exist](_URL_0_). We have at least one confirmed by science while there are probably others (either past or current).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If two bowling balls were placed a mile apart in outer space (with no other gravitational effects from other objects) would they eventually be pulled together?",
        "response": "Assuming they are still relative to each other and there are no other forces, gravity or otherwise, then yes, they would eventually collide. It would take about 70 years. You can calculate that from the equation for [orbital period](_URL_0_). The semi-major axis is half of the initial separation and then divide the orbital period by two to get the time it takes for them to collide.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why haven't we evolved to breathe underwater or fly?",
        "response": "Because those have never been evolutionary advantages for humans. Evolution rewards traits that improve survival. Humans have done just fine without needing to fly or breathe underwater. At this point in time, we're so far down the \"breathing oxygen\" and \"not needing to fly\" route that there's very little chance that humans would just evolve that. If nature snapped its fingers and conditions required we be able to breathe underwater to survive, we would all die out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "You know how back in the WW2 U.S. pilots would sometimes paint racy (for the time) images on the side of their craft, such as half naked women and the like. Were there many/any conservatives in the military that complained about that and/or tried to put a stop to it?",
        "response": "Follow up: Is there any connection to figureheads on ships, sometimes also depicting semi nude females?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we need to blink under water?",
        "response": "I should state, to avoid confusion, that we would not be wearing goggles.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What time is it at the Earth's poles?",
        "response": "You can see a map of current times in Antactica [here](_URL_0_). At first it appears very haphazard, but the timezones usually match up with wherever the supplies come from.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are humans capable of forgetting things?",
        "response": "Remembering everything is not practical from am evolutionary stand point. There are after all, physical and biological limitations. Which include space, time, neuron and synapse length among others. Sifting through countless useless memories requires neurons to communicate with one another in ways they wouldn't have to otherwise. This uses up time, space (more synapses), ATP and all manner of neurotransmitters, which is not cost effective. So the brain picks the useful things and stores them, all the useless crap is not retained. The more a memory is used, the more important it is, so the stronger it gets. The mechanism by which the brain does this is not fully understood yet, but it is easily observable. You have to remember that every system has limitations, and everything is a careful balance between variables. In this case, it's a simple relationship (in principle) between the cost-benefit of remembering everything vs remembering only the most important events.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Where do ISPs buy internet speed from?",
        "response": "> My question is, why can't they give everyone a 100 Mbps connection while charging 10 Elis because my understanding is that if the hardware they use is good enough, they will be able able to give everyone a high-speed without anyone 'making a sacrifice' of using a lower speed. Easy answer: money. The money ISPs ask for their internet at a certain speed is far above the cost they have to maintain that connection.  Let's say an ISP has 100Mbps available (very low, but it's about the concept).  They could ask 10Elis for 10Mbps, earning 100Elis per month maximum.  Alternatively, they could give 20Mbps for those 10Elis and earn only 50Elis per month maximum.  That's assuming no overselling (other posts explained this already) but the conclusion is the same even if you include overselling: As a customer, you love the idea of getting twice the speed for the same price. As a company, your ISP (or at least their financial team) hates that idea because it would literally cut their maximum earnings in half.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What causes dark spots/bags under a person's eyes?",
        "response": "From what I understand, they are related to increased blood-flow, which is highly visible in that area because the skin under the eyes is the thinnest on the outside of the body. This increase of blood-flow is also related to the redness of eyes during fatigue. Basically, the muscles that control the eye recruit more blood-flow to continue working when they have become very fatigued. This appears as redness in blood-vessels close to the surface (the cornea), and as blackness or blueness in blood-vessels under fat, or stacked on top of eachother (under the eye). The only sources I could find at the moment were webmd and a mayoclinic health article, but I know I've read more about this before. Sorry.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How have pandas been able to survive this long?",
        "response": "They weren't mass hunted or having their habitats destroyed in the past. [](/aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. aaa aaa aaa aaa aaa. )",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How were years originally created and how did they know which year it was?",
        "response": "A year is the time it takes for the Earth to go around the sun. Long before this was known, observations had been made about the angle of the sun in the sky. In the winter solstice, the midday shadow is longest, in the summer solstice it is the shortest. The time between one summer solstice and the next is a year. Calendar years is another issue entirely. An arbitrary start date is declared by a ruler, or retrospectively declared in the case of the Christian calendar. That date then marks the start of the year. Different cultures STILL have different start and end dates of the year (Chinese new year being an example).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can a moon have more mass than his planet?",
        "response": "The short answer is \"no.\" The longer answer is that 1 object never truly orbit another object- really both objects orbit around their combined center of mass, called a [Barycenter](_URL_0_) when talking about planets and orbits.  Often times we think of one object simply orbiting another because the object being orbited is so much larger than the object orbiting. But even the Moon orbiting the Earth, the Moon pulls on the Earth some, making it wobble, as the Earth and Moon really orbit the Barycenter between them. However, the center of mass of the Earth/Moon system is actually still \"inside of\" the Earth- it's about 4000 km from the center of the Earth, which has a radius of about 6000 km.  As the objects get closer in size to each other, the approximation that one object simply orbits the other gets worse and worse. There is no hard cut-off, but after a while we call it not a planet and a moon, but a binary planet system, where it becomes much more obvious that neither is orbiting the other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How likely was it that Jesus was influenced by the ideas of the Buddhism and Jainism?",
        "response": "It's incredibly unlikely. 1. We have some, though very little, evidence of Buddhist ideas appearing in the Hellenistic world. However to influence Jesus you would need even more than this, you would need some evidence of engagement or impact on 1st century Judaism. 2. Your core contention, \"the cosmology were similar\" [sic] is just *prima facie* incorrect. Cosmologically: a monotheistic religion compared to a non-theistic worldview; the centrality of grace in Christianity, compared to the concept of karma; the total absence of the idea of reincarnation in Christianity. There simply are minimal significant parallels at a theological level, let alone evidence of influence at a surface level.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Watergate Scandal destroyed the Nixon Presidency, and subsequently destroyed faith/trust in the government for many Americans. What were the reactions from the international community?",
        "response": "Hi there! I actually did a write-up that I think you'd find interesting in [this thread](_URL_0_). It goes over the major newspapers of Germany, the Soviet Union, Britain, and France, and describes the way they covered the issue. It was drawn from an article I cite there :). As far as the reactions, they were typically very negative. Only the Soviet Union's paper restrained itself from going negative until the scandal had progressed to its much later stages.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What do you think about the theory that Marco Polo didn't go to china?",
        "response": "He was there. I have to dig it up, but polo is mentioned at least once in the Chinese sources. He has been conflated with a central Asian with a similar name, which is why some historians erroneously thought he was an imperial advisor. But he is mentioned nonetheless.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are we sexually attracted to the bodies of the opposite gender (or same gender if it is gays)?",
        "response": "When you hit puberty your body is designed with the need to reproduce. It is designed with a basic understanding of what is ideal to reproduce with. Sexy hips/curves = better chance to carry a baby, symmetrical faces = better DNA quality, bigger boobies = more healthier to feed children. Athleticism/youth = Healthy.  Now you are not attracted to a female gorilla (I hope), because you cannot mate with it, your body is designed with one ultimate purpose in mind, create copies. Attraction/sex/etc is the drive that keeps life going. All humans are designed with this purpose.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the current status on research around the millennium prize problems? Which problem is most likely to be solved next?",
        "response": "Dr. Terrence Tao, a renowned mathematician, is working on the Navier-Stokes existence and smoothness problem. In 2014, he had a big result for a certain form of the equation. I was still in college at the time and my PDE professor said that most of the mathematics community expects him to be the one to win the prize for it. This particular professor was so confident that he predicted that Dr. Tao would do it by 2016. I had never heard of him at the time but it turns out Dr. Tao was a child prodigy in maths and was a full professor at 24.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I am in space. I have a 'syringe' with a sealed plunger pushed down. I cap the end of the syringe. Would I be able to pull the plunger and 'create a vacuum' within the syringe without much effort?",
        "response": "Yes, the only thing keeping you from pulling the plunger on a syringe with a sealed end is the surrounding air pressure. In a vacuum this pressure would not exist, so assuming all the moving parts still slid by each other correctly, you would be able to do so easily.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the red LED that goes on your fingertip and measures blood oxygen level work?",
        "response": "Short version: it shines two colors of light through your finger — one that is absorbed by oxygen-carrying hemoglobin (oxyhomeglobin), and one that is absorbed by oxygenless hemoglobin (deoxyhemoglobin). It compares how much of each is absorbed, and because it's comparing absorption of the two types of light that are both going through your finger, thickness of your finger is automatically accounted for. [Long version](_URL_0_) Sidebar: if you add a third type of light, you can also measure carboxyhemoglobin, which is hemoglobin carrying carbon monoxide, and that is how fingertip carbon monoxide poisoning sensors work.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "When you leave water boiling for a \"long\" time, the bubbles that are created at the bottom, no longer make it to the surface. Why?",
        "response": "Actually, they do. You just can't see it. When water starts boiling it will generate bubbles at the hottest spots - the parts where the water touches the metal. Those bubbles release and float to the top and pop into the air.  Once the water has been boiled long enough, all of the water will be the same temperature. Bubbles will form at the metal and in the middle of the bulk water. The bubbles at the metal will float toward the top but most of the time they'll merge with a bubble forming in the bulk water. Then the big bubble will reach the top and pop into the air.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are the possible ways that we could terraform another planet?",
        "response": "For Mars it could be melting the icecaps (how you'd do that I don't know......... reflected sunlight from mirrors in orbit maybe?) to release the water vapour and CO2 to thicken the atmosphere. From there dumping large amounts of bacteria into the atmosphere to convert the CO2 to oxygen. As the atmosphere thickened and heated up that would then have a run on effect and melt the frost in the soil that seems to be over the planet.  The problem would be how thick an atmosphere that would result in. Since Mars is also geologically dead you wouldn't get volcanoes releasing more gases into the atmosphere and since Mars has low gravity you'd have a bleed off of atmosphere into space, which would be a slow process though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is there not only H2O in a bottle of water while the chemical formula for water is H2O ?",
        "response": "Purified water (just H2O) is not very healthy, it removes electrolytes from the body. All the extra minerals in bottled water prevent this from happening while also providing trace minerals required for health. People say \"pure water\" but they just mean it's clean and relatively pure.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The rule of thumb is to add acid to water to prevent splashing. What happens when you sip some water and it mixes with your stomach acid? Does the body have biological mechanisms to prevent the splashing?",
        "response": "Water doesn't just free fall down your esophagus, it's sorta encompassed in a muscle Mexican wave. Your stomach isn't an empty chamber with a puddle of stomach acid at the bottom like some people believe either, it's more a hydrochloric acid sack. Even if the water could splash up most of your digestive tract has protective mucus all over the place so you don't dissolve from the inside out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much pain would a victim of beheading feel?",
        "response": "People seem to be forgetting when the body takes a traumatic injury, it will go into some form of shock. Source: Grandpa had his fingers chopped off in a work accident. Said he didn't notice his fingers were gone until he saw them rolling around in the machine.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What creates the 'swoosh' sound of cars passing by?",
        "response": "You're half right: also add the car \"cutting\" through air and Doppler effect (decreasing pitch of an object passing by)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If you transplant organs in a young baby, will the organs grow along with the body?",
        "response": "Depends on the organ. Livers can regenerate from a small nubin, so we would implant a small baby sized liver and it would grow. I think kidneys are implanted whole, hopefully in bigger children. These also can hypertrophy (get bigger) as needed. Hearts would be very unusual. Not sure it could work without a similar sized donor. As far as I know (not a paediatric transplant surgeon!) the goal is to delay transplant as long as possible so sizes work better. So in the heart they do a while bunch of weird operations like cutting out bad pieces and sticking vessels in weird spots, as a temporary measure. Past that, I think the odds of getting a super-specialist in here are low, but there will be tons of case reports in the literature. Just google \"paediatric transplant\" with the organ of interest",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "...if the ingredients for all different kinds of cheese are pretty much the same, how do they make different flavor cheeses?",
        "response": "The ingredients are not really pretty much the same.  The species of animal giving the milk, the kind of feed that animal gets, if you skim the cream off the milk, the kind of rennet you use to start the process, the kinds of bacteria you use to culture the cheese if it is cultured, the kind of fungi you use, the kind of herbs and spices you use, the amount of time you age it, the condition you age it in, the amount of moisture you press out of it, etc all change the flavors of the cheese.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The following piece of dialogue from \"The 40 year old Vigin\"",
        "response": "Customer refers to Luca Perry, presumably a tough thug. (I'll call Luca Perry to come get you!) Jay replies that's he's with the Rolling Twenties gang since he was sixteen. He's frosty (cold blooded or alert). Spoon is silliness, maybe, showing that he's faking street slang. An alternate explanation is that Frosty and Spoon are names of other thugs in his gang. The customer is short so he calls him a dwarf \"we fuck dwarves in the ass\" Customer replies that even though he's a dwarf he can still shoot Jay in the face.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are instant-on OSes like Splashtop dead?",
        "response": "Chrome OS tried to fill a similair fit. It really didn't catch on among any more than the most niche, usually techie crowd. Pretty much there is simply no demand for any system that isn't running windows or Mac because everything is made for those, people are familiar with those, and people want those. Netbooks (of which this seems to have been at least aimed at primarily) died with the rise of mobile and tablets, like the iPad, which filled the niche need far better than a netbook ever did. Then with the rise of \"ultrabooks\" (full power laptops in a small, light form factor) were simply the higher end replacement for shitty low-power netbooks, that filled the need on the high-end side OS's like this had no market for devices to be on, and no demand for either the software or the devices this would work on.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do even atomic-numbered elements (hydrogen neglected) seem more abundant?",
        "response": "There is a force in nuclei which acts to pair nucleons together (protons with protons and neutrons with neutrons). It's called the *nuclear pairing force*, and it prefers for all nucleons to be paired off. So clearly this force is \"happiest\" when there is an even number of protons and an even number of neutrons. In fact out of the 254 known stable nuclides, 148 have even Z and even N, but only 5 have odd Z and odd N. See [here](_URL_0_). If a nucleus is going to be even-even, it must have even Z. So even Z elements, \"averaging over isotopes\", are a more favorable nuclear configuration than odd Z elements.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are older videos from the early 1900's sped up?",
        "response": "Early film projectors were hand-cranked and the frame rate was typically less than the 24fps we're used to. So, if you play back one of those old films at 24fps, it's faster than normal.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does Gallium alloy with Aluminum when Aluminum is in a solid state?",
        "response": "One of the misconceptions about something being solid is that solid means impermeable. Even if something is solid, the atoms are still moving around on an angstrom level (this is basically heat). This means that even if something is solid, atoms can still diffuse inside the structure. When you have something that is highly reactive, like aluminum, room temperature is usually enough to allow a new compound to form. As for using this to destroy aluminum structures, yes you surely can, assuming the aluminum is pure and whatever coating they use is easy enough to break through. You are unlikely, for example, to break through anodized aluminum by scratching.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does someone suddenly develop an allergy to a substance that was accepted by the body previously?",
        "response": "I just saw an allergist for my son a couple weeks ago and asked her how allergies work. Her answer was basically, we have almost no idea how or why any of it is the way it is.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do coroners identify a body during an autopsy?",
        "response": "If police series are relatively accurate, there are a few ways this can happen. 1) The body has some sort of identification on them (drivers license, passport,...) 2) Using specific body traits, like dental records, fingerprints, DNA, traceable implants,... But these require them being in a database. 3) Someone recognised the victim (if I'm not mistaken a positive identification from a family member is often required) 4) Comparing a picture of the victims face with a database (missing persons, people with criminal records,...)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come you can't use a credit/debit card at a tollgate?",
        "response": "1. fees. do you really want to subsidize amex or visa with dollars intended for roads and bridges? 2. transaction processing / approval times are too slow - causes traffic.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do wind turbines have to be so big?",
        "response": "They are turning, and VERY fast, it just appears to be slow because of their size. If they're stopped, it's because they're turned off. A brake can lock the rotor when energy isn't needed. They need to be big because the wind is only so strong. By making them bigger, the wind has more surface area to act on, which means more total force can be made. This force is run into a generator, where more force=more power. Bigger ones actually need less wind to turn. They also get more efficient as you scale up. To put it in perspective, the big ones you see are about 300 ft tall with 100ft blades, and put out about 1.5 million watts. The biggest have a rotor diameter of about 540 feet and put out 8 million watts. A REALLY BIG home turbine will put out 2000 watts with a 10-foot blade diameter. If you do the math, it's 2916 times smaller (area, not diameter, assuming the same fill rate of blades), putting out 4,000 times less power.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does pi contain itself?",
        "response": "My guess is: No, it doesn't, because then it would be a repeating decimal. Imagine Pi would contain itself, starting at the third position after the decimal point. So it would be 3.14314314314314314314..., because the repetition would be part of Pi and so be also part of the first repeating sequence. Since it is proven that Pi is irrational, we know that Pi is not a repeating decimal. Furthermore, I could imagine that the statement, that Pi contains all number combinations at some point can be disproven, since it is possible to have an infinite, non-repeating series of digits with less than ten numbers. So it could be possible that some occurrence of the number 9 is the last in Pi and thus any finite series of numbers repeating Pi up to the last occurrence of 9 and *then* adding an additional 9 would be a series of digits that is not contained in Pi. My math is not good enough to write down a full-blown mathematical proof of this, I'll leave that for others as an additional homework. ;)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Has the UN ever forced the USA to do something it opposed?",
        "response": "No, the UN really is not or ever been capable of forcing the USA to do anything. There are two main parts to the UN: the General Assembly, and the Security Council. The General Assembly is not capable of creating binding resolutions, meaning the General Assembly could never force the USA or any other country to do something that it didn't want to do. At most, the General Assembly could recommend that the USA do something, which the USA would be free to ignore. The Security Council is capable of making binding decisions, but it's structured in such a way that the USA is not capable of being forced to do anything. The USA has a permanent seat on the Security Council, meaning it has veto power over all potentially binding resolutions.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do some cars (I.e. french) have yellow coloured fog lights?",
        "response": "Like you're five... The yellow light does not reflect off the water as readily as the blue in white light does. It more effectively cuts through the bad weather and shows you the road.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do commercials, TV shows, and movies use fake Phone/Computer programs instead of real ones?",
        "response": "It does occasionally happen. You vastly underestimate how hard it is to get real software to *look* like it's doing the exact thing you want it to do *and* be realistic looking, both visually and with how characters interact with a computer. Not to mention editing. Plus then you watch the show a year later and it looks ridiculous anyway.  Most of the time you're watching a fake video that actors are reacting to. Sometimes, when it needs to actually look like they're interacting, the video can be semi-interactive and just respond to any keypresses.  And on top of all that, licensing issues.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How big does a body of water need to be before it's acted upon by tidal forces?",
        "response": "Tidal forces act on everything. Small objects and bodies of water simply don't show a noticeable effect. The Great Lakes of North American have tides of about 1 inch, insignificant compared to the effect of the weather.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do people who don't remember anything about their dreams actually dreamt at all?",
        "response": "Yes. When people dream in the middle of the deepest part of sleep, parts of their brain light up on scans that show emotional and physical activity (normally the brain disconnects itself a bit from your muscular system to avoid movement during dreams).  Higher cognitive functions don't light up very much, if at all. This is why you don't think anything of the talking hamster or the reverse mermaid smoking a cigar.  Memory is involved in higher cognitive function. It's similar to why you can't remember being a baby.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I yawn when im tired?",
        "response": "As you become tired, your brain needs more blood flow to deliver energy and oxygen to it so that it can stay \"awake\". Because you are probably not moving around much when you're tired, you probably aren't getting enough blood to your brain to keep yourself awake, and thus your body instinctively causes you to yawn to stimulate more blood flow to your head and thus your brain as well. You also yawn more often when you are cold, again to get more blood flow to your head/brain.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will eating the fish that inadvertently eat plastic from the Great Pacific garbage patch have a significant health effect on humans",
        "response": "Probably not because of the plastic, since plastic isn't really digested (would stay in the GI tract, which people don't usually eat). But mercury and other toxins do get into the muscle of the fish which we eat and eating too much fish can lead to mercury toxicity. Now that being said, fish has some real health benefits (good lean source of protein high in omega-3s). The EPA and FDA put together a little chart of their recommendations for how many servings per week and what kinds of fish are safe to eat, found [here](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any places in the world where the rates of people born with asthma are 0% or very close to it?",
        "response": "Asthma isn't something people are usually born with, and even when they might be, it's essentially impossible to arrive at a definitive asthma diagnosis until 2-5 years of age. [See this info from NIH](_URL_0_). But also see this [asthma prevalence map](_URL_1_).",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I crave cigarettes so much more when I drink?",
        "response": "Might be conditioning/habit formation. Basically, if you smoke every time you drink, you create a strong cognitive association between drinking alcohol and smoking, so that when you drink, your brain automatically turns on the craving. This wouldn't happen in reverse (craving alcohol every time you smoke) because you are presumably smoking in other settings than when you drink, so while smoking doesn't always lead to drinking, drinking always leads to smoking (and your brain remembers that now).  A lot of people have conditioned habits like that, cued in to time/place/activity, like a person who chain smokes at work but doesn't feel constant cravings when he's out taking a walk, for instance. One of my friends recently started a new job and has decided to never smoke while he's working so that he creates a mental connection of \"this place = don't smoke\" instead :) Look up Pavlov's Dogs, or Classical Conditioning for more info :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did WW2 affect the lives of Pacific Islanders?",
        "response": "I'll just link a couple of previous responses I've written (I think these are both on the FAQ, though there may be other responses I've forgotten). [What did Islanders do?] (_URL_1_) and [What did Islanders think?](_URL_0_) TL/DR : it depends on the island, if you are just curious in general or thinking more about the islands that experienced heavy fighting or bombing during the war. YMMV between islanders in places like Hawaii or Tahiti who fought in the European and Pacific fronts from the US and France respectively; to those on Chuuk who were conscripted by the Japanese and bombed by Americas; or Papua pathfinders and scouts, or occupied islands like Guam. Different islands had different levels of integration with the colonial powers of the Pacific, often based off the racial bias of the colonial power, and that often played a major role in just how aware and participatory any given islander might be.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much earth is required to be a suitable ground?",
        "response": "It's not the dirt that matters, it's that it forms a good conductive path to everything else that might come in contact with your device. So a bag of dirt is useless unless the humans you're trying to protect are also standing on the bag of dirt. And if they are, it really matters how wet (and therefore conductive) the dirt is. And whether they're barefoot or wearing thick shoes. And it doesn't have to be dirt, a thin mesh screen would work great so long as people are standing on it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't rifle scopes need to be focused when looking at shorter or longer distances like binoculars?",
        "response": "tl;dr - Scopes/cameras have what's called 'depth of focus'. There are different types of scopes. I believe what you are referring to is a 'fixed focus' scope. In this case, your scope has 3 defining characteristics: 1) magnification, 2) focus depth, and 3) depth of field/focus. 1 is self-explanatory. I realize that 2 & 3 look similar, but they are very different. The focus depth is how far away from the lens on your scope is the focal point. The depth of field/focus is how far in front and behind the focal point images will stay in focus.  As an example, lets say you have a 50x scope with a focus depth of 50 yards and a depth of field/focus of 20 yards. In this case, objects that are in the range of 30-70 yards away from you will be in focus, without needing to adjust your scope.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Life cycle of an Email.",
        "response": "If something is in your deleted box, from a computer perspective it has not been deleted at all, it’s just been moved. In fact, from a computer perspective, there’s no such thing as deleting. What has been written cannot be unwritten, only overwritten. So when you delete an email fully or empty your recycling bin fully, you’re really just making it so you can’t see it. Eventually when new data comes along it’ll be overwritten.  However, even if it’s fully deleted, people who specialize in recovery may be able to get it back even if it has been overwritten a little. It will have distortions though. You can look up recoveries people have done of pictures and they’re funky looking",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does wifi tracking work?",
        "response": "There are several devices (and software) that can see what you are doing on the network. All you have to do is look at what site is being requested by what IP. So your device gets an IP, lets say 172.16.0.50 and you go to _URL_0_. What we can see on the backside is 172.16.0.50:80 -- > www._URL_0_ To expand further, your device has a unique address called a MAC address. MAC addresses show up on the AP (access point) which is what delivers your wireless connection. So I can match up your IP to MAC address, find out what sites you request to view and find your location in the building based on MAC address. Can they see what you are doing on these site? Possibly, but that is more unlikely as it will require a more complicated setup. They are probably just looking to see if you are going to unapproved sites or something like that.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is the Common Cold so hard to cure?",
        "response": "Because \"the Common Cold\" is a name for a bunch of different diseases, that are related mostly because they happen to cause the same symptoms. We can't come up with one thing that cures them all.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If laser light can blind you, how come no one ever has their eyes injured in dance clubs?",
        "response": "It's an issue of duration. If you stare at the sun it can blind you, but a brief glance won't cause damage. In a dance club, the lasers are always moving, so you never look at them long enough to hurt your eyes.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why looking at something bright helps you sneeze",
        "response": "This is called the \"Photic Sneeze Reflex\", or just a photic sneeze. See [wikipedia](_URL_0_) for a more in-depth explanation. This is an interesting idea, because there is much speculation as to why it occurs. Some say that it is simply an odd evolutionary remnant, or simple cross-wiring of our senses that was left over, over time. It's also interesting because it only really affects about 25% of people (myself included, as it were). Basically, some say that this nerve in your eye becomes stimulated as light enters it, and that this is connected to another nerve in your head that causes sneezing to occur.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What are some historians' opinions on Jan Gross' book Golden Harvest which is about Polish collaboration with Nazi atrocities against Jews?",
        "response": "I'm not a historian, nor have I read the book, but.. Fear makes otherwise decent people do terrible, terrible things, like collaborating with Nazis. You could point fingers at basically any country that was controlled by the Reich for a period of time and find collaborators, even among the Jews themselves. That's not excusing their actions, of course, but a book like this could be written about any group of people during that time period.  Just my two cents.  Edit: And it seems my view of concentrating blame on one group is shared by at least one reviewer.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do your fingers get al raisin-y when wet? And why does the rest of your body remain normal?",
        "response": "This is an evolutionary tactic to help us grip and hold things in water. Since your fingers are doing most of the holding they're what is most liable to pruning. Your toes also do the same for the same reasons",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is a doctor doing when the palpate your stomach?",
        "response": "For your specific case, knowing a bit more would be necesary, at the very least where and how they palpated. However, the abdomen is divided into 6 areas, and each primarily is where different organs can be felt. Upper right (your right for your abdomen) the liver can be felt just below the rib cage, Upper middle the pancrease, upper left the bottom of the stomach, rght middle, a very distended liver, and thelarge and small intestine, middle has small instestine, enlarge uterus (baby or fibroids/tumor) you can also easily feel the large artery and vein going to and from the heart here, and to the right and left of this, the higher of the ilio psoaz muscles, if you push very deeply. Middle left, intestine, large and small, enlarged spleen (normally you wrap around and find the spleen behind the last few ribs on the left side), Lower right, enlarged appendix, start of large intestine, small intestine, lower mid, sigmoid colon, bladder, uterus, lower left, sigmoid colon hope that helps",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "- What is the difference between Champagne, Prosecco and sparkling wine?",
        "response": "Both of those are *types* of sparkling wine. The first is from the Champagne region in France. The second is from parts of Italy. Some people informally use \"champagne\" to refer to any kind of sparkling white wine, but this is frowned upon by wine lovers, as it's misleading.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did Fleur-De-Lis end up on Bosnian coat of arms (1992-1998)",
        "response": "First of all sorry for my English, As I know Fleur-de-lis (stylized lily) was used in middle ages like sign of cross, and it was used by French monarchy and by some others (_URL_1_). Bosnian Kingdom in middle ages (time before Ottoman Empire) was connected with Christianity and some heretical religion(by Vatican) called Bosnian Church. Bosnian King Tvrtko Kotromanic (1338-1391) and his dynasty Kotromanic's used that flag, and that was first flag of Bosnian Kingdom. In 1992, when Bosnia went from Yugoslavia, people in Bosnia and Herzegovina (Bosniaks, Croats and Serbs) agreed to use that flag. The war started, and only Bosniaks continued to use _URL_0_ has been changed in 1998.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to determine the pattern of a person's fingerprint by looking at their DNA?",
        "response": "Fingerprints are formed by differential pressure experienced by the growing dermis of the finger of the fetus, and this is as much the results of genetics - the growth of the blood vessel and nerve bundle - as it is the fetal environment. As a result, as iorglsfhefvfe stated, even identical twins have different fingerprints.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are car antennas so small now, when 10 years ago they were 2-3 feet tall?",
        "response": "The length of the old antennas approximately matched the wave length of the band and were placed on the fender to get a good ground plane. Newer digital circuitry in the radio actively matches the impedance so the length or placement of the antenna is less crucial. The antenna can be incorporated into stripes printed on the windows. [A more technical explanation here.](_URL_0_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What role does torque play in vehicles?",
        "response": "I'm a Mechanical Engineering undergrad with a focus on automotive engineering. I explained this to r/cars a while back. I tried to keep it basic, as if I was talking to someone who had very limited experiences with physics. [Here's a link to the post.](_URL_0_) I'd like to think it's a happy medium between a rigid dynamics approach to explaining it and the \"layman's terms\" explanations which are very frequently way off base.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why/How do nipples get hard",
        "response": "Depends on what they're hardening in response to. If it's cold your nips are likely in gem-cutting mode as part of the same response that gives you goosebumps. Your nipples (not to be confused with the areola) aren't very big or particularly fleshy so when the tiny muscles responsible for raising the your hairs contract (that's a pilomotor reflex for you 10 year olds out there) your nips tend to harden as well. In response to stimulation and/or sexual arousal, no one really knows, but it's theorized that it's a form of secondary sex signaling.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can all curves be expressed mathematically?",
        "response": "No, you can't express curves that encode information about [noncomputable numbers](_URL_1_), for instance an infinite [random walk](_URL_0_). You can only express its boundaries or incidental features, but not explicit values.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The Grand Unified Theory/ Theory of Everything",
        "response": "Classical (Newtonian) Mechanics does not (ideally) hold for tiny particles like electrons. Quantum Mechanics is too complex/inappropriate to be applied to big bodies.  The Grand Unified Theory is supposed to bridge this gap and give us a set of rules that would be applicable to everything in our Universe. Scientists believe that achieving such a theory would fill in the gaps in our current knowledge and revolutionize science completely.  This (essentially) is why it's called the Theory of Everything.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can you smoke cigarettes in rehab and apparently they are responsible for more deaths?",
        "response": "Generally speaking, nicotine is way less destructive to your body. Smoking 10 cigarettes in an hour won't do much to you, other than hitting your lungs lightly. Try drinking a liter of heavy alcoholic beverage or a high dose of cocaine, and you know you're destroying your body and impacting other people around you (e.g. when driving). The addicts who are in rehab need something to do while not having to use their regular drug. Resorting to smoking is a way more valid and safe choice. It is also easier to get rid of a heavy smoking addiction than of a heavy cocaine addiction.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any kinds of cosmic phenomena that could obliterate the earth completely, but that we couldn't see coming in advance?",
        "response": "Gamma ray burst. It travels at the speed of light and would usually give almost no warning.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Theory Thursday | Academic/Professional History Free-for-All",
        "response": "> Historiographical disputes, debates and rivalries This may fall less into the realm of historiography and more into philology, but I recall a encountering a debate across several journal articles about the meaning of the word \"sinistrorsum\" in Horace Epode IX, and the implications it has for Cleopatra's intentions at Actium. Something about the argumentative tone of the exchange really bugged me, and I recall it being one of the things that contributed to my frustration with the study of the classics, and eventual decision to drop out of my undergraduate program. That said, this was over ten years ago; in that time, I've forgotten the substance of the debate, the journals involved, and most of my Latin. I _believe_ W.W. Tarn was one of the authors involved, if that helps any. Is there anyone here who has any idea what I'm talking about? I've actually tried to find it since then, but it's not easy without access to JSTOR and the like.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Halloween so important to Americans (dressing up, eating candy etc)?",
        "response": "Halloween contains a lot of elements of other holidays that are more commonly celebrated elsewhere. It's an opportunity to break the rules and be extravagant, similar to Carnival in many countries--Carnival is not commonly celebrated in most of the U.S. Young children get to actively participate, so people's appreciation starts young. And the morbidity of Halloween is another departure from the norm, perhaps relatable in sentiment to Mexico's Day of the Dead.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Do you burn more calories by walking or running the same distance?",
        "response": "This is hotly debated but recent studies have shown that you do indeed burn more calories by running. Your body, when running exerts more energy and thus your body needs to get more oxygen to your organs and thus consumes more. The increase in respiration leads to more calories burned. The best however for burning fat is called interval training which is short alternative bursts of high intensity and low intensity movement. You'll find a ton of junk articles online that say that there is no difference but read any recent study on the subject and it will tell you what I just summarized.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What would happen if the US exported LNG to Europe?",
        "response": "The Russian economy would tank, the US would have closer economic ties with Europe, and the Americans will start making even more money. European states would have much more leverage when dealing with Russia, and Russia would have to either search even harder for new customers, or accept that their place in the world is not secure. Of course, that's just a pipe dream at the moment. As it stands, the US doesn't really have any way to export much gas to Europe. None of the infrastructure is there yet. And even if it did, it's almost certainly going to be more expensive than the Russian alternative meaning that no one is going to want to buy the American gas anyway. At best, we're looking at years down the road before it's plausible.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does water drain in a \"spiral\" shape?",
        "response": "The spiral moving in opposite directions is a myth. The Coriolis effect - which causes storms to spin in different directions - is far too small to affect something like a draining bathtub.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is it possible to make a plant magnetic?",
        "response": "There's actually been a few experiments done around this very topic (see [here](_URL_0_)). Regardless, given a strong enough magnet, you wouldn't really need to alter a plant's chemistry in any way to make it respond to a magnetic field due to water's polarity. Basically, oxygen has a far greater electronegativity than hydrogen (that is, oxygen attracts electrons more strongly than hydrogen). For this reason, electrons in water tend to congregate to the oxygen rather than the two hydrogen, and one side becomes more negative while the other side becomes more positive.  tl;dr - recent studies indicate it's possible, but water is already slightly magnetic so you wouldn't need to do it to get an effect.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What makes certain notes or melodies in music sound \"evil\" or \"ominous\"?",
        "response": "As someone who's been playing music on and off his whole life, the answer is both simple and complex. I'll try to make it an ELI5. In music, we have culturally defined certain sounds to be \"pleasant\" and \"happy\" and some to be \"dark\" and \"sad\". In general, happy songs utilize a major key and uses major chords, while sad songs use a minor key and more minor chords. Again this is a generalization but to our ears this is the most natural.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much did Band Aid/USA for Africa/Live Aid really help starving people in Africa in the long run?",
        "response": "There have been a couple of threads with answers on the impact of Live Aid, Band Aid, and USA for Africa, so I'll link them: u/wilbarp provides a thorough account with plenty of further discussion in [Did celebrity efforts like Band Aid's \"Do they know it's Christmas?\" and USA for Africa's \"We Are The World\" actually help alleviate famine in the 1980s?](_URL_0_) u/ReaperReader answers in [What was the real impact of the Live Aid concert of 1985?](_URL_1_) Hope this helps!",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Wasn't the Basque country the one with the independence movement (ETA) - why is Catalunya the one getting independence now?",
        "response": "Spain is made up of 17 Autonomous communities, I don't know where you are from but this is similar to Wales, Scotland and Northern Ireland in the UK and USA states.   The Government of Catalan (one of the Autonomous communities) has approved a referendum on independence, this isn't legal and goes against the Spanish Constitution and even if 100% of the people vote Yes Spain has no legal or moral (strictly speaking) requirement to grant it.    Again this is a decison made by Barcelona not Madrid, Vitoria-Gasteiz or Pamplona or Logroño holding their own referenda though it won't be biding.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Could windmills affect the atmosphere?",
        "response": "There have been many studies on the subject, and the consensus is that, yes, wind farms do affect the local climate. Wind farms likely increase the local surface temperature by a degree or two, since they decrease the surface-level wind speeds, which decreases turbulent heat flux (turbulence which carries heat away from the ground). Note that this does *not* increase the overall temperature of the atmosphere, since this is a heat transport effect and not a direct heating effect. This likely has further implications for local precipitation and evaporation, but I can't find any relevant studies on the exact effects so I won't speculate. Also note, the effect would likely be the opposite (local surface cooling) for ocean-based wind turbines. Sources: [1](_URL_0_) [2](_URL_1_)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If Light is a wave, why does it travel on a straight line?",
        "response": "Most waves (and particles) travel in a straight line, unless an outside force acts on them. What wave characteristic leads you to conclude that waves don't travel in straight lines?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How come some countries have a lot of oil, like relatively smaller countries in the Middle East. Were dinosaurs not hanging out all over the Earth? Did they concentrate in those areas?",
        "response": "Dinosaurs have nothing to do with it. Oil comes from the remains of sea creatures, mostly micro-organisms.  Ocean floors all over the planet get covered with the sorts of organic debris that could become oil, if covered with sediments and heated. But as oil is created, it is really spread out. It needs to be concentrated, and for that, you need specific geology - a solid, impermeable layer above it to stop it leaking to the surface, and that layer pushed up into a dome, so the oil can float on top of groundwater and be concentrated in one place.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is circumcision popular even though not many religions require it?",
        "response": "It's really only popular in the US, and it's because of the anti-sex campaigns of the 1920s *cough* kellogg*cough*. Outside of the US, if you're not jewish or muslim, you don't get circumcised.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what horsepower actually refers to and why it is called that?",
        "response": "Its a measurement unit of power, 1 HP = 746 Watts, and was named after James Watt (both Watts and HP), to give an easy analogy of the potential power of his steam engine in comparison to something more easily understood at the time: work horses. So, if you were trying to sell your new steam engine to a farmer, you could say it has \"10 Horsepower,\" or the energy produced by 10 work horses. Another way to look at it is in foot-pounds/min. He came up with a figure that a pony could move 220 lbs a distance of 100 ft in 1 min, he calculated that horses were 50% more powerful then that, came up with a formula that gave the power of a horse as 33,000 ft-lbs/min, or 550 ft-lbs/sec.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "This isn't a question, but a test.",
        "response": "Go here: _URL_0_ and look at the top comment of each.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does white noise work?",
        "response": "White noise is just a bunch of random frequencies transmitting at equal intensity. You can absolutely hear it, so I'm not sure what you mean by that part of your question. If you're referring to its usage in sound masking (i.e. nighttime sleep aides), it simply covers up other noises; the steadiness of the white noise (or whatever sound it is) is easier to fall asleep to than random, recognizable noises in the night.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is actually happening when one takes a \"full\" breath compared to an \"incomplete\" or \"normal\" breath?",
        "response": "You get two types of inward breath, known as inspiration. \"Normal\" (that is unconscious breathing) inspiration uses only the diaphram and the intercostal muscles. When you deliberately breath in deeply the accessory muscles are used, these include pectoralis minor, scalene and sternocliedomastoid (I probably spelt that wrong). These aid the body to breath both deeper and faster. Also when breathing normally the lungs arent using their full potential volume, so when that person takes a deep breath they reach the limit of theinspiritory reserve volume ( fill the lungs completely). I know I havent answered your question very well but I only have an understanding of the breathing mechanism itself and not of the psychological reasons of relief. Even so i hope understanding the process helps you a bit. Also sorry for the formating im on mobile.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Book recommendation on the conflicts between Ireland and and the mainland?",
        "response": "I'm sorry but what exactly are you looking for? You say \"the mainland\" but that doesn't actually make much sense. Are you looking for an overview of any Irish connections to France/Germany/Spain?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Are there any animals that do not require sleep? (A question from my 12 year old.)",
        "response": "The answer to your question is basically no, all animals sleep. Although it is hard to truely define sleep regarding much simpler animals, but it is generally accepted all animals sleep in one way or another. Interestingly, animals which hibernate have to actually \"wake\" from hibernation in order to go back to sleep. This can even result in them using too much energy and dying, but they have to sleep. The problem is we still don't really have much idea why anything needs to sleep at all. The founder of Stanford Uviversity's Sleep Research Cetre concluded after 50 years that, \"as I know, the only reason we need to sleep that is really, really solid is because we get sleepy.\"",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the benefit of the new chips in the credit cards?",
        "response": "It's harder to clone the cards. With a magnetic stripe, the data you read from the stripe is all you need to charge the card. If I swipe your card through my own reader (or hide mine around the reader at a gas station or something), I can create a perfect copy of your credit card and make charges to your account. With a chip, the card is actually a computer. The reader asks it a question and it gives a answer. The reader can verify that the answer is correct, but it can't come up with the answer on its own without access to a secret stored on the chip that's never revealed. So even if someone were to read the card data (or hack Target's payment system again), they wouldn't be able to use the cards because the next time you try to use it, the reader would ask a different question and your fake chip wouldn't know the real answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Will sunscreen block any radiation from a radioactive source?",
        "response": "No, it's specifically designed to block UV radiation.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does a city, e.g. Aspen, have 100% renewable energy?",
        "response": "Most of Aspen's power comes from hydro, which doesn't fluctuate very much. And it's not like the wind ever dies down completely.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Question about gravity (with crappy MS Paint illustration!)",
        "response": "> So, if that's true, how come we can we stand on the side of the earth instead of falling down  Because it's a bad analogy. See [this comment](_URL_0_) where I outline several of the problems with it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Short Selling the in stock market?",
        "response": "Short selling something is when you borrow a stock for a fee, sell it, and buy it back, then return it to the owner. If the stock goes down in value after you've sold it, you buy it back for less, and keep the difference for your self. You're betting the stock will do badly. For example, I pay Peter $1 to borrow his $100 stock for a day. At the beginning of the day, I sell it for $100, the stock then falls in value, and at the end of the day, I buy it back for $90. After paying Peter his $1, I have $9 profit. If the the stock doesn't go down in value, I loose money.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what reasons did people have for joining the reformation",
        "response": "By the same redditor at the same time:  > [What were some of the differences between the sects of Protestantism what types of ideas did these differences lead to?](_URL_0_) Are these homework/study questions?",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the shape of a proton?",
        "response": "This turns out to be an extremely important question. The charge distribution is EXTREMELY spherical. No-one has yet measured any asymmetry in it, and it's known to be symmetrical to at least one part in 10^11 (100 billion). This is amazingly symmetric. For comparison, for the earth to be spherical to within one part in 10^11, the tallest mountain would have to be shorter than 1 millimeter. But physicists are continuing to conduct experiments on protons (as well as neutrons and electrons) to be more and more sensitive. See, ferinstance, _URL_0_ for ongoing work on the proton. The reason why physicists are so interested in this quantity is that different fundamental theories of physics (the standard model, supersymmetry, string theory, etc.) predict different values for the non-sphericality of fundamental particles. Measuring this asymmetry can help us choose between these competing theories.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Theoretically, if I were motionless and there was no force of gravity on me, would time stand still?",
        "response": "Time would still move. Also you need to remember motion is relative, so you can be motionless to some objects, but not to others.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why did Sweden become the dominant Nordic power?",
        "response": "Politics and disease took Norway out. The black plague hit Bergen, Norway in 1349. It killed an estimated 20% of the European population, but in Norway it killed 50%. Large swats of the country were left uninhabited. And regional politics played into it, leaving Norway without a king. Sweden and Denmark(also ruling Norway) for long periodes were close to equals, but Denmark had persistent border problems with German states, that Sweden was spared. The final blow came as Denmark supported the losing side during the Napoleonic wars, and had to hand Norway to Sweden as part of the peace settlement in Kiel 1814.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is time squared? (s^2)",
        "response": "Squaring time allows you to see the change in something over time. This is the kind of thing that comes up in calculus, and is key to understanding integrals and derivatives. For example: Distance is measured in meters. (m) Velocity, the change in distance over time, is measured in meters per second. (m/s) Acceleration, the change in velocity over time, is measured in meters per second per second. (m/s/s or m/s^2) If we were to graph each of these assuming a constant acceleration, we would see something interesting. For these graphs, time is the x axis, and the y axis is the measurement. If we start with acceleration, we would see a horizontal line, because acceleration is not changing with time. Velocity, however, is increasing at a constant rate. We would see a straight, diagonal line that increases with time.  Distance is now increasing the rate it increases per second, so we would see an upward curve, like the right half of a U.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "the difference (and advantages) between Front Wheel Drive, Real Wheel Drive and 4WD.",
        "response": "To add to what Ionizzatore said there is also a AWD. This is similar but not exactly 4wd. And ALL WHEEL DRIVE has the potential to propel any of the 4 tires and adjusts which tire/tires it uses when/if you loose traction. A 4WD will spin all 4 tires if the hubs are locked.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do we wake up if we are falling in our dream?",
        "response": "The jolt of adrenaline that rushes through our body wakes us up. Falling or dying feels very real, and our brains and emotions work overtime. *It's that feeling of falling you get that jolts you awake. It snaps you out of a dream.* The \"Kick\". Most times, it feels like Inception. That feeling of falling or near death experiences always seems to occur when someone's trying to wake me up by calling my name or tugging my arm :)",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "If friction does not depend on surface area, why is it hard for me to walk across cement while wearing cleats?",
        "response": "You're correct in (what it seems like) saying that increasing the surface area seems to be increasing the friction, contrary to what you've learned on your own or in physics class. However, to make that statement you're having to discount lots of other forces at work when you run using your cleats- in particular, deforming the ground. When you're stopping in cleats, they've penetrated into the ground, and then are being forced against the bulk of it, requiring deforming and lifting the dirt. This expends a lot of energy, and helps you to stop.  So while the friction may be similar as compared to stopping/starting on cement, there's other forces at play here.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why don't the top Oil producers start investing heavily into Nuclear Energy??",
        "response": "Companies have things they are good at - called core competencies.  There are almost none of the core competencies in drilling for oil or refining oil or selling gasoline that translate into nuclear energy production - that is building plants, managing complex regulatory environments, generating and distributing electricity.  So the only way to get into nuclear practically would be to buy nuclear companies - companies that are already fairly priced in the market.  So there's no way for an oil company to buy a nuclear company and make more money than the nuclear company could by itself.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do I get so pissed when a team I have no control of loses?",
        "response": "Because you are emotionally invested in that team.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "[META] Why is there no list of essential journal articles? I am an undergraduate with access to JSTOR who is bored. What are the best articles available on that site (or other sites that are often/occasionally available to students/general public) from your field?",
        "response": "Journal articles will tend to be quite specific. Did you have a particular issue or question in mind?  To elaborate, the FAQ is designed to offer broad answers to broad questions (Why did WW1 erupt?). Journal articles are naturally more specific and thus a list of must-have articles would be... More difficult to provide. There are some often cited articles in the hard sciences that are considered seminal and foundational works... I imagine the articles for this subreddit would depend on the subject matter more than *insert crucial chemical engineering foundation article*.  When I get home I could dig up some of more cited articles on Byzantine history and a few other topics.  It might even be worth a shot to simply search for the most cited articles on a specific issue and use them as your must-reads. Naturally, this may not be an ideal approach.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does a video on YouTube have fewer views than upvotes on reddit?",
        "response": "> Do you have to watch every single second of the video for YouTube to count it? This is a bit of a trade secret, because YouTube doesn't want to release any information that would help people cheat the system. But after 301 views, YouTube starts checking every single new view that comes in (which is why counters often appear to \"freeze\" at 301), and this takes a little time, so the view counter always has a delay. To count as a view, you do have to watch a certain amount of the video (how much YouTube isn't saying); also, you have to actually start the video yourself. For example, if you click to a non-YouTube webpage and a YouTube video embedded in it automatically starts playing, that doesn't count. But if you have to start the video by clicking the \"Play\" button, or if you click to the video on its actual YouTube page, then that does count. Ratings, however, aren't subject to the same scrutiny, so they always update almost instantly.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why were relations between the early United States and Morocco so good?",
        "response": "I'm going to break this answer down into two parts, what was in it for the Moroccans and what was in it for the US.  The Moroccans were in it mostly for the trade. The US offered goods that the Moroccans wanted. Recognition would bring more American ships to Moroccan ports. The Americans were glad to partner with the Moroccans mostly for trade reasons as well but for a different reason. Morocco's strategic location at the entrance to the Mediterranean was an asset to American ships trying to trade there. Also at the time, the United States was concerned about the threat of piracy by the North African or Barbary states. Having Morocco as a friend rather than an enemy reduced the chance that American sailors would be captured and sold into slavery in North Africa.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How isn't state legalization of Marijuana unconstitutional?",
        "response": "It probably is, but if the AG doesn't persue it, then the states can continue. However, at any point the feds could swoop in and arrest everyone involved, if they were so inclined.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Can in-ear headphones harm your eardrum when you pull them out?",
        "response": "Is it possible, yes. You can rupture eardurms from a large pressure difference, similar to what can happen to your ears if you surface too fast from scuba diving. It is likely to create a vacuum that can cause this just by earbuds? No, probably not. Ears are different; itll be a stretch to find an earbud that can create a perfect seal around your ears.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did voyager spacecraft sent images of Uranus and Neptune?",
        "response": "Voyager broke down each image into a series of numbers representing the dots that make up the picture, and sent streams of numbers back to Earth by radio, where they were reassembled into pictures. Pretty much the same way pictures are sent through the Internet today.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "what exactly is “rendering” a video and why does it take so many computers so long to do them?",
        "response": "Images and videos are just many lines of computer code, video rendering is the process of converting this code into images that you can see on your screen. This takes so long to do because as the quality of the image increases, so does the amount of code that image is made of. This of course increases the time it takes to render the image Becuase more code needs to be converted and since a video is just lots of pictures played one after the other, you can see how much time this will build up to.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "how does a dryer sheet work?",
        "response": "If you run your hands over a piece of clothing, the fabric feels pretty smooth, right? Well, if you looked at it really closely, under a microscope, you'd see that it isn't, really. It's kind of rough and uneven. What fabric softener does is to cover up that roughness with a slippery substance that makes your skin glide more easily over that tiny roughness. That makes it feel softer to you.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do migratory birds know when the temperature in their original climate has warmed up?",
        "response": "Migratory animals don't know that the weather has changed in their summer grounds. The exact cues to start migrating may be different in different species, but the most likely cause is changing day length. [This article](_URL_0_) found that caged birds became restless when the researchers changed the length of the day to resemble natural migration season. It's been suggested by [this article (PDF)](_URL_1_), among others, that climate change will cause significant problems for migrating birds because the timing they have evolved to follow will no longer line up correctly with the change in seasons. Edit: autocorrect typo.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "I know some diseases take more than one shot, but many don't. Why can't we clump all the vaccines we have a vaccine for into a single supershot?",
        "response": "We can't give all vaccines at once because the immune response is somewhat cumulative in nature, meaning the more vaccines you give at one time the greater the spike in immune system response. This could cause your immune system to essentially make you sick by greatly overreacting. Given one or two at a time vaccines seldom cause the immune system to react to the point of being dangerous to the patient e.g. a prolonged high fever.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How can the universe have a shape? This is mind-boggling to me...",
        "response": "Actually, the terminology is somewhat confusing, but they are not talking about the shape of space but its global curvature. The universe could have a global curvature that is like that of a flat sheet of paper, i.e. zero, but it doesn't have to be a flat sheet of paper. Also, the universe could actually have a shape on top of having a curvature. Take a toy universe you are probably familiar with if you have played computer games. If you wander around on the map of an old final fantasy game or an asteroids game, if you keep going in one direction, you'll just pop up on the opposite side of the map at some point. All those maps are flat, but have a toroidal \"shape\".",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are Canada Geese called such instead of Canadian Geese?",
        "response": "Because it's their name, not their nationality. If I live in New York, and my name is Bob France, you wouldn't call me French.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does inbred sex cause birth defects in the offspring?",
        "response": "The reason that sexual reproduction exists is to smooth out genetic defects. You have an error in your DNA, you mate with someone who doesnt have the error - the healthy DNA makes up for the defect. With two genetically close parents - there is a high chance they both have the same defect",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How much do clouds weigh?",
        "response": "Clouds weight can vary, but a good sized one can weight 1.1 million pounds. There are 2 primary reasons clouds can be thay heavy and still float. First in terms of composition, clouds will be compromised of millions or billions of tiny ice crystals that by themselves dont have much weight for gravity to bring down. Combine with updrafts (either light or heavy) pushing the particles up, which helps negate the downward motion of the particles, and this allows clouds to \"float\". _URL_0_  Here is a scientific american article explaining this concept a bit more.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do people like Mosh Pits?",
        "response": "It started in the 70s and 80s at punk shows, where people's dancing got wilder and wilder, and eventually got to where people were slamming into each other. It kind of went from there. It was originally called mashing, but it turned into moshing because that's the way the singer from Bad Brains, who had a Jamaican accent, pronounced. I like to mosh at metal concerts. For me, it's kind of like a game, I compare it to playing football without a football. For a lot of people, they like it as a way to work out their aggression in a somewhat controlled way. As violent as mosh pits may look, people generally aren't trying to actually hurt each other.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What Earth life could survive on Mars?",
        "response": "The Martian soil is well suited for a few types of vegetables like asparagus and turnips. However, the temperature and lack of water and CO2 would prohibit just planting them on the open surface. [Link](_URL_0_)  As for just tossing some life from earth out on to the surface of Mars and expecting it to survive, I do not know of anything, perhaps some chemeosynthetic extremophile that lives in the rock or ice here of earth might be able to survive for a while. Probably nothing would thrive though.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Every now and then when you inhale deeply there is that extra room to breathe in really deep that feels great. What is the biological mechanism behind this?",
        "response": "A deep breath increases oxygen to the brain and stimulates the parasympathetic nervous system which promotes calmness.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is the black residue that a safety flame leaves?",
        "response": "It's carbon. Amorphous carbon. Soot. The structure of which is actually pretty complex, but it's basically a bunch of carbon atoms joined in a random structure. Why does it only happen when the port is closed? Well, you've probably learnt that in a blue flame the reaction is something like this C3H8 + 5 O2 - > 3 CO2 + 4 H2O Note, that requires 5 oxygen molecules for every propane molecule. i.e. it requires a lot of air. So what happens if you don't have enough oxygen? Well it kinda depends, but the simple reaction goes C3H8 + 2 O2 - > 3 C + 4 H2O So in this reaction we require less than half the oxygen, but instead of producing CO2 gas, we produce 3 atoms of carbon. (which is also why this flame is yellow, that is the hot carbon emitting photons). Then as the carbon cools, it forms into amorphous carbon.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does your breath stink when you wake up when your brush them before bed?",
        "response": "Bacteria reproducing, eating and doing its stuff during the night, don't worry, it is pretty common, unless you're over 35/40, in that case we call it (next phrase will be translated literally from my original lenguage) dad-breath, and it can be due to the age going on and the teeth getting less and less healthy",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What, if any, was the Papal response to the Norman invasion of England?",
        "response": "The Pope (Alexander II) [blessed the invasion](_URL_0_), and granted William the Standard of St. Peter. The position of the church was quite clear to everyone involved. [edit] As for actual documentation, I do not read Latin (sigh). I will ask my ex, who is a real expert in this area, and perhaps she can point you in the right direction.  Sorry for having misread your question.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "The String theory and Multiverse theory",
        "response": "The mutiverse is like this, I believe: We are on a planet, that planet is in the Solar System. The Solar System is one of billions in our galaxy, the Milky Way. But our galaxy is just one of billions in the Universe. Now the multiverse theory is that our entire Universe is just a 'bubble' in a Multiverse filled with Universes which are filled with Galaxies, which are filled with Stars around which circle planets! Please correct me if I'm wrong, I realise this is a gross simplification.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Sensible and Latent heat.",
        "response": "Latent heat means you change phase. It takes a lot of energy to change phase so you can think latent as \"late\" and takes longer to gather or lose enough energy.  Sensible heat is related to changes in temperature but not phase. So you can think of it as \"sense\" energy meaning you can feel it.  _URL_0_",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Did ancient civilizations keep records of birth dates, and did they celebrate them in any way?",
        "response": "One of the Vindolanda tablets, written by a Roman woman living near Hadrian's wall around 100AD is an [invitation](_URL_0_) to a birthday party.  Claudia Severa to her Lepidina greetings. On 11 September, sister, for the day of the celebration of my birthday, I give you a warm invitation to make sure that you come to us, to make the day more enjoyable for me by your arrival, if you are present (?). Give my greetings to your Cerialis. My Aelius and my little son send him (?) their greetings. (2nd hand) I shall expect you, sister. Farewell, sister, my dearest soul, as I hope to prosper, and hail. (Back, 1st hand) To Sulpicia Lepidina, wife of Cerialis, from Severa.\" - it may coincidentally also be the oldest surviving Latin document known to have been written by a woman, which is neat.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does the frequency of treatment affect recovery time and rate?",
        "response": "Basically the frequency of administration that's required is related to the dose you give, and the rate the body clears the drug. This [graph](_URL_1_) gives a broad idea of the relationship - how far the upswing goes depends on the dose, how far it falls depends on the rate the body clears the drug (via various mechanisms).  If you give another dose early on in the downswing, the doses add up to give a higher peak. If you give the doses too far apart, the body has cleared too much drug and you get lower peak.  The doctor or pharmacist can change the frequency by changing the dose. To reduce the frequency, you can boost the dose, and vice versa. Sometimes, if an individual isn't clearing a drug quickly (kidneys or liver not doing their job correctly), the dose and/or the frequency have to be decreased to avoid poisoning the patient. The wikipedia entry on [Pharmacokinetics](_URL_0_) has more information, but it may not be very readable.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Don\"charmed aroma\" candles really contain jewelry worth up to $5000? If so, are they really making enough profit that this makes sense?",
        "response": "Something \"worth\" $10 or $5000 doesn't mean the company paid that much for it. They put cheap rings in almost all the candles so that the average cost is still lower than their sale price.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "In the past when two different cultures of two different languages, how did they communicate and learn the other language when there was no one yet who knew the translations and grammar?",
        "response": "Consider this: what language did you speak when you were born? Unless you were a very special baby, you eventually learned to understand and speak a language that was totally foreign to you, without the aid of translations or grammar laws. Humans don't need translations to learn a language. It makes things faster, but it's not necessary.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How are hybrid species possible?",
        "response": "Your definition should include \"produces viable offspring\". Mules, for instance, are sterile. This means that a horse and donkey are different species.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Compared to the mythical founding of Rome in 753 BC, how do modern archeologists and historians think the city was first founded?",
        "response": "You may find [this older post](_URL_0_) with answers from /u/Tiako and /u/GeorgiusFlorentius interesting if you don't get an answer.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't we figure out the sex of a fetus at conception?",
        "response": "Pregnancy tests are designed to tell if your urine or blood contains the hormone called human chorionic gonadotropin (hCG) which is released right after the fertilized egg attaches to the uterine wall. The only way to check the gender of the fetus before an ultrasound can detect it is to extract the DNA from one of the fetus's cells and check it for two x chromosomes or one x and one y. Taking out even one cell from a fetus will definitely slow down production of an organ down the road so removing one cell for the purposes of DNA screening is detrimental.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does the square root of -1 equal an imaginary number?",
        "response": "Imaginary is just a poorly-chosen name. We notice that any \"real\" number times itself, i.e. squared, is positive (or zero), but we run into problems when we have equations that say a number times itself is negative.  So, the \"imaginary\" numbers are invented with the unit imaginary number, i, defined so that when you multiply i by itself, you get -1. This gives us lots of great results--for instance, every polynomial equation with terms below x^n has *exactly* n solutions (except for some funny stuff, but that's another topic). If we only allow \"real\" solutions, then we run into a problem where a lot--in fact, almost all--of the equations have fewer than n solutions.  Basically, there were gaps in algebra where we just couldn't get by with \"real\" numbers alone, and inventing the \"imaginary\" numbers to complement the \"real\" numbers and form the \"complex\" numbers filled in lots of those gaps.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does antimatter have an equal form of electricity, or would it operate differently?",
        "response": "Maxwell's equations obey [C-symmetry](_URL_0_), meaning if you switched all of your positive charges for negative charges, the mechanics would remain exactly the same. Antimatter has exactly the same electromagnetic mechanics as matter.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are thousands of people worldwide joining ISIS? Especially women?",
        "response": "The simple answer is that for Muslims who feel like they are culturally isolated and downtrodden, ISIS is attractive because they actually seem to be winning. ISIS propaganda is very good at making them look like the only Muslims who are able to stand up to the United States When you have been on the losing side your entire life it feels good to suddenly be part of something where you seem to be accomplishing something. Young recruits also ignore all the horrible stuff ISIS does because they are brainwashed into believing that all those reports are lies spread by Western media.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why are all the wealthiest people in the world, businessmen?",
        "response": "Occupations have a limit to how much you make. A person with a job can't just have their pay keep increasing as long as they work, they are just paid what the position is worth. The amount is determined by hours. Employees are also the biggest expense in a business so it'd hurt the business more to keep increasing pay. Business owners have no cap since their income is directly tied to the success or failure of the business. If a business succeeds it makes sense that the owner gets paid the most since it is theirs. A job is too but employees are just the bottom of the pyramid and are expendable. The owner is the most important spot because without it, there wouldn't be a business to begin with.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Does early stage Prostate Cancer have any effect on one's sex drive?",
        "response": "Not in early stages - it's asymptomatic. Obviously when it spreads it can have effects up to death. However, treatment often has large effects including impotence due to damage to the nerves attached to the exterior of the gland, and incontinence due to excision of a sphincter along with the gland. After my prostatectomy at age 58 I had pretty good function, but it feels different because you don't get that glandular ache at ejac-time when the seminal fluid is produced. Now that I'm almost 74 I have difficulty maintaining an erection, but the drive (mental) is still active.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why can't many contagious diseases be spread from animals to humans?",
        "response": "Viruses are bank robbers. Your cells are the banks. The virus uses several means to get through all the cells defenses to get to your cells vault, where it reproduces. (My analogy just fell apart). One of the ways it gets into your cell is by tricking the cell into thinking it's a friend, it uses a fake employee ID. The problem is that different bank chains (species) use different IDs so an ID at one bank chain won't work anywhere else. Diseases make the hop when they come across an ID that will work in your bank.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Brine mining Lithium",
        "response": "Basically they pump in salty water which is called brine and the material (lithium in your case) would disolve in it and then get pumped out. They then extract if from the fluid by evaporating it or adding chemicals that would cause it to precipitate (become solid) Now they have the lithium or whatever in a solid form above ground and they can purify it in any way they'd want",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is Japan's population decrease bad? Won't there be a higher quality of life with less population?",
        "response": "One of the tougher aspects of population decline is that it results in an imbalance of the elderly (whom need care/resources) relative to the the younger (the producers). You get certain economies of scale with a large population (producing goods, etc). Japan's population decrease AFAIK, is a little bit more related to an economy that's been stagnant for a decade and a half than it is to a natural/stable population.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why doesn't water moisturize my skin in the way lotion does? What's the difference?",
        "response": "Dry skin usually happens not so much because of a lack of water, but a lack of oil, from memory. Without oil, the skin can't create a protective barrier to keep the water in, and it will evaporate. Moisturisers usually include a variety of oils in order to help with this.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Is head rush(from when you stand up from a laying position rapibly) directly from a weak cardiovascular system or just to much force exerted on ones muscles?",
        "response": "If you are young 10-30 you should only get it when you very quickly get up. If your passing out or really light headed from getting up you may have an issue. It common when you get older for this reflex mechanism to slow down. Its why we have old people get up slowly and try and not do that much. You can move around before getting up to help raise your heart rate that helps some. Basically your lying down your heart doesn't need to pump as much, when you get up you have a drop in blood pressure, and the compensation mechanism takes a few seconds. You can even feel your heart rate speed up (along with blood vessels constricting), and if you look blood pressure lying down then standing up you would notice a difference. Medical student 3rd year  Orthostatic hypotension if you are passing out or want to read more about it.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why do so many Americans believe their own government is about to \"take them over\"? What does that even mean?",
        "response": "The US is one of the only countries that was designed with the intent of our government not being powerful in many arenas. \"Lassiez Faire\" means \"Hands Off\" and it's one of the principles our government is supposed to run on in regards to most things that aren't the military. With that freedom, comes the ability for that freedom to be taken away. Our government has already shown itself to be quite corrupt and power hungry.  There is a precedent for it, our Civil War.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Based on the giant squid question: If I take a big box (or glass box) deep under water, open it to let the water fill in and then close it 100% tight again and bring it to the surface, would the water pressure inside the box be the same as under the water?",
        "response": "In short, yes. Longer answer; You wouldn't want to use a glass box, since it would more than likely shatter from the extreme differences in pressure. That said, this effect has been observed many times, either from purposeful experimentation, or from bathysphere tests where the vessel had a flaw and was not perfectly water-tight. **However**, most liquids have a very low degree of compressibility. Water in particular is only compressed by 1.8% at the deepest parts of the ocean. So while your retrieved water will still be compressed by that extreme pressure, it's not as though hundreds of gallons would explode out of a ten gallon tank.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why when the US invaded Japan it became a functioning and successful country yet our efforts elsewhere may have failed or proven more difficult?",
        "response": "Japan was an empire who laid down their arms -- full and clear surrender. In Afghanistan and Iraq, the leadership never surrendered. There really was no one who could, being a major problem. This remaining leadership gives you a lot of stability, which is particularly important in a post-war rebuilding. The Japanese government could at least be expected to maintain the peace after the war was over -- the Iraqi government was practically non-existent and what replaced it was seen as a farce.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "What is historiography and why do my history teachers say its important ?",
        "response": "Essentially this exact question has been asked recently: _URL_0_ This should help you out.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How does JSTOR work, and why is it so expensive for people to access?",
        "response": "I wouldn't put the blame on JSTOR or any other aggregators - or at least not mostly there. The blame lies with the journals themselves. Academic journals cost a fortune; I'm sure the aggregators don't pay the same amount that you'd pay buying directly, but I'm sure it is still a lot. Want to hear my biggest pet peeve on this issue?  Our chemistry program is accredited by the American Chemical Society. In order to be accredited, we have to purchase journals and a database *from the American Chemical Society!* And these aren't cheap. Journals and Scifinder Scholar just for this one program cost about $45k a year. To top it all off, Scifinder Scholar - the database required - is pretty much only used by the chemistry faculty, not by the students. I check the usage stats periodically, and they are **low**. I would imagine that the chemistry journal usage is equally low.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How quickly does our digestive system process fats?",
        "response": "The amount of time it takes for nutrients to become available apparently varies widely with the nutrient content and ratios of the food itself, but the bulk movement of material through the system seems more consistent. In searching for similar information recently, I mostly found many links back to this: [_URL_0_](_URL_0_) Based on that, it's not the new food directly making its way through over such a short time.  It's likely [the gastrocolic reflex](_URL_1_) that you're experiencing. The same thing is widely attributed to the effects of coffee, which can have a very similar outcome for many people, despite having no significant solid constituents.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why is that if I pack a banana in my lunch with crackers, the crackers taste like the banana? Even when they are both in seperate air locked bags?",
        "response": "The esters that are responsible for the smell and taste of bananas are small and non-polar, so they're volatile and can pass through plastic.  Wrapping the banana in foil might be the trick.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "Why does uncooked pasta take a long time to expire?",
        "response": "It is dried, nothing to go stale and nothing for any microorganisms to live in.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How do music streaming apps work from a legal/licensing standpoint?",
        "response": "You make a deal with the record company. Many form conglomerates to license their songs, others you have to go right to the record company. Basically you work out a deal on cents-per-play, and then have reporting requirements to show them what was played, how often, etc.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "On average, how many generations does it take before a settled people forget their tribal/nomadic roots?",
        "response": "The categories that you've based this question on are so vague that the question is unanswerable. What exactly are \"tribal roots\"? What exactly does it mean to \"forget\" said \"tribal roots\"? And why do we assume that there is some kind of formula for how long this process takes to occur? I think a more productive question would be to ask what we know about changes in any of these groups (since, the Huns, Franks, and Mongols were quite different from one another) as their settlement patterns or economy (economy in the broadest sense, of providing material sustenance for themselves) changed.",
        "source": "sentence-transformers/eli5"
    },
    {
        "query": "How did the cameras that were used during the moon landing work? How were they able to broadcast relatively clear picture and sound from space, using 1960s technology?",
        "response": "Basically, the important thing in space communications is not the size or power of the transmitter, but the sensitivity of the receiver. Once you have compensated for local issues like atmosphere, other radio sources, the rotation and revolution of the Earth, etc, then the only thing that affects the transmission is distance, and we have lots of distributed, really sensitive receivers to pick up weak signals.",
        "source": "sentence-transformers/eli5"
    }
]