[
    {
        "query": "How does the company determine the grant-date fair value of RSUs and stock options?",
        "response": "The grant-date fair and fair stock-based compensation expenses are typically valued at the fair value of the company's common stock on the grant date for RSUs, whereas the Black-Scholes option pricing model is used for stock options, which requires inputs like expected term, volatility, risk-free interest rates, and expected dividend yield.",
        "source": "finqa"
    },
    {
        "query": "Which product category had the greatest percentage decrease in net sales in 2023 compared to 2022?",
        "response": "Mac",
        "source": "finqa"
    },
    {
        "query": "How much did the general and administrative expenses increase in fiscal year 2023 compared to 2022?",
        "response": "General and administrative expenses increased by $1.7 billion.",
        "source": "finqa"
    },
    {
        "query": "How is 'licensed brands' defined and what is its impact on the company's volumes?",
        "response": "'Licensed brands' are brands not owned by the company, but for which the company holds certain rights, including distribution rights. The company derives economic benefits from sales of these products, and volumes related to a licensed brand are considered incremental to prior year volume when a license agreement is entered.",
        "source": "finqa"
    },
    {
        "query": "What percentage of AMC's U.S. market attendance was represented by Stubs members in 2023?",
        "response": "AMC Stubs members represented approximately 46% of AMC's U.S. market attendance in 2023.",
        "source": "finqa"
    },
    {
        "query": "What primary activities affected cash flow from operating activities in fiscal 2022?",
        "response": "The primary activities affecting cash flow from operating activities in fiscal 2022 included a reduction in merchandise inventory levels and the collection of tax refunds, partially offset by the impact of a net loss.",
        "source": "finqa"
    },
    {
        "query": "How does Nike utilize trademarks in its business operations?",
        "response": "Nike uses trademarks on nearly all of its products and packaging, as well as in marketing materials, to create a distinctive identity that is easily recognizable by consumers, thereby helping to distinguish its products from those of competitors.",
        "source": "finqa"
    },
    {
        "query": "What was Garmin Ltd.'s net income for the fiscal year ended December 30, 2023?",
        "response": "$1,289,636",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in GBV in 2023 compared to 2022?",
        "response": "The increase in GBV in 2023 was primarily due to an increase in Nights and Experiences Booked and a modest increase in Average Daily Rate (ADR).",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in gross profit dollars for the fiscal year 2023?",
        "response": "7%",
        "source": "finqa"
    },
    {
        "query": "What technological solutions is the company developing to improve ad delivery?",
        "response": "The company is developing privacy enhancing technologies, tools to enable marketers to share data, ad products generating valuable signals, AI-driven targeting and measurement, and business messaging ad features to drive onsite conversions.",
        "source": "finqa"
    },
    {
        "query": "How much will the annual rent payment be per square meter for the casinos and gaming areas transferred to VML for the first three years starting January 1, 2023?",
        "response": "750 patacas",
        "source": "finqa"
    },
    {
        "query": "What is the rate for the Singapore Swap Offer Rate as of December 31, 2023?",
        "response": "3.62%",
        "source": "finqa"
    },
    {
        "query": "As of December 31, 2023, what was the total amount of assets held in foreign operations?",
        "response": "$1.9 billion",
        "source": "finqa"
    },
    {
        "query": "What additional requirements does the FCPA impose on U.S. publicly traded companies?",
        "response": "The FCPA imposes specific recordkeeping and internal controls requirements on U.S. publicly traded companies.",
        "source": "finqa"
    },
    {
        "query": "What accounting treatment is applied to leases with an initial term of 12 months or less in terms of balance sheet recording and expense recognition?",
        "response": "Leases with an initial term of 12 months or less are not recorded on the balance sheet, and the lease expense for these leases is recognized on a straight-line basis over the lease term.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of translation on other comprehensive loss for the Canadian subsidiaries in the reporting period?",
        "response": "The translation of the Canadian subsidiaries caused an increase in the other comprehensive loss of $9.0 million, including net investment hedge gains.",
        "source": "finqa"
    },
    {
        "query": "What was the balance in Accumulated Other Comprehensive Loss as of August 26, 2023?",
        "response": "$190,836",
        "source": "finqa"
    },
    {
        "query": "What net-zero greenhouse gas emissions goal has Delta Air Lines set for 2050?",
        "response": "Delta Air Lines aims to achieve net-zero greenhouse gas emissions from their airline operations by 2050.",
        "source": "finqa"
    },
    {
        "query": "What area did NVIDIA initially focus on before expanding to other computationally intensive fields?",
        "response": "NVIDIA initially focused on PC graphics.",
        "source": "finqa"
    },
    {
        "query": "What could be the potential impacts of the Basel III Endgame on ICE Mortgage Technology's mortgage lending and servicing volumes?",
        "response": "The Basel III Endgame could potentially discourage participation in mortgage lending and servicing, leading to a reduction of mortgage volumes at ICE Mortgage Technology.",
        "source": "finqa"
    },
    {
        "query": "What was the outcome of the insurance coverage litigation's final judgment in Wisconsin in July 2007?",
        "response": "The judgment declared that each insurer whose policy is triggered is liable for 100% of Aqua-Chem's losses up to the policy limits.",
        "source": "finqa"
    },
    {
        "query": "How is the functional currency determined for foreign entities in a multinational company?",
        "response": "The functional currency of a foreign entity is determined by the primary economic environment in which that entity operates.",
        "source": "finqa"
    },
    {
        "query": "What is the impact of the new $1.25 price point on Dollar Tree’s sales units and profitability?",
        "response": "The increase to a $1.25 price point at Dollar Tree stores has more than offset the decline in the number of units sold, suggesting a positive impact on profitability.",
        "source": "finqa"
    },
    {
        "query": "How does the company engage with its employees to foster engagement and satisfaction?",
        "response": "The company engages with its employees by holding frequent company all-hands meetings and through 'The Daily,' a daily communication vehicle that keeps employees connected with the business in real time.",
        "source": "finqa"
    },
    {
        "query": "How much is the company's obligations for non-cancellable operating leases for minimum rent payments throughout the future fiscal years as of January 28, 2024?",
        "response": "The company's obligations for non-cancellable operating leases amount to a total of $1,645,318 in thousands for future minimum rent payments, distributed across various years from 2024 through \"Thereafter\" periods.",
        "source": "finqa"
    },
    {
        "query": "What grid services program does Enphase participate in with Northeast region utilities?",
        "response": "The ConnectedSolutions program",
        "source": "finqa"
    },
    {
        "query": "What factors does the company consider in the valuation allowance assessment for deferred tax assets?",
        "response": "In the valuation allowance assessment for deferred tax assets, the company considers its history of income or loss, volatility in actual earnings, excess tax benefits related to stock-based compensation, impacts of timing of reversal of existing temporary differences, projected future results, uncertainty in future operating results, volatility in the market price of common stock, macroeconomic conditions, and changes in business affecting future taxable income.",
        "source": "finqa"
    },
    {
        "query": "What is the maturity date of the 7% Notes due 2029?",
        "response": "February 15, 2029",
        "source": "finqa"
    },
    {
        "query": "What is the HPE GreenLake edge-to-cloud platform and what does it offer?",
        "response": "The HPE GreenLake edge-to-cloud platform is a centerpiece of HPE's strategy that offers a unified cloud services experience, enabling customers to access, analyze, and extract value from their data across public clouds, data centers, colocation facilities, and at the edge.",
        "source": "finqa"
    },
    {
        "query": "How is revenue on a constant currency basis calculated for the year 2023?",
        "response": "Revenue on a constant currency basis for 2023 is calculated by translating the full year's revenue using the 2022 monthly exchange rates for settlement or billing currencies other than the U.S. dollar.",
        "source": "finqa"
    },
    {
        "query": "What accounting method does the company use to account for investments in subsidiaries and partnerships where it does not control but has significant influence?",
        "response": "Equity method",
        "source": "finqa"
    },
    {
        "query": "What were the fiscal 2021 impacts on the effective tax rate primarily driven by?",
        "response": "The fiscal 2021 impacts on the effective tax rate were primarily driven by litigation and acquisition related items.",
        "source": "finqa"
    },
    {
        "query": "What is the threshold amount for disclosure of environmental proceedings under SEC regulations for the Company?",
        "response": "The threshold amount for the Company to disclose environmental proceedings under SEC regulations is $1 million.",
        "source": "finqa"
    },
    {
        "query": "What was the impairment loss recorded for the right-of-use asset in the fourth quarter of 2023?",
        "response": "$2.7 million",
        "source": "finqa"
    },
    {
        "query": "What were the key business metrics tracked by the company in 2023?",
        "response": "The key business metrics tracked were Nights and Experiences Booked and Gross Booking Value.",
        "source": "finqa"
    },
    {
        "query": "What consequences does GS Bank USA face if it fails to maintain at least a 'satisfactory' rating under the Community Reinvestment Act (CRA)?",
        "response": "GS Bank USA would be subject to restrictions on certain new activities and acquisitions.",
        "source": "finqa"
    },
    {
        "query": "How much did the company engage in share repurchases during the fiscal year ended January 31, 2023?",
        "response": "Approximately 28 million shares for approximately $4.0 billion",
        "source": "finqa"
    },
    {
        "query": "What was the company's net cash used in financing activities in fiscal 2023?",
        "response": "$2.1 billion",
        "source": "finqa"
    },
    {
        "query": "What were the net earnings per diluted common share for The Kroger Co. in 2020, 2021, and 2022 excluding adjusted items?",
        "response": "$3.47 in 2020, $3.68 in 2021, and $4.23 in 2022",
        "source": "finqa"
    },
    {
        "query": "What strategic goals does American Express pursue for global growth and competitiveness?",
        "response": "American Express aims to expand its leadership in the premium consumer space, strengthen its position in commercial payments, enhance global merchant acceptance and network integration, and leverage its unique business model globally, supported by focusing on environmental, social, and governance strategies.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of equity securities held at the end of 2023 and 2022?",
        "response": "The total value of equity securities held at the end of 2023 was $2,006 million and at the end of 2022 was $2,070 million.",
        "source": "finqa"
    },
    {
        "query": "As of December 31, 2023, did The Hershey Company's internal control over financial reporting include the internal controls of Weaver Popcorn Manufacturing, Inc.?",
        "response": "No, the internal controls of the acquisition of certain assets from Weaver Popcorn Manufacturing, Inc., were not included in The Hershey Company's 2023 assessment of its internal control over financial reporting.",
        "source": "finqa"
    },
    {
        "query": "What are the potential financial impacts on the company if multiple products covered by certain arrangements reach their milestones in the same reporting period?",
        "response": "The aggregate expense or aggregate milestone payments could be material to the company's results of operations or cash flows in that reporting period.",
        "source": "finqa"
    },
    {
        "query": "What is the title of Item 6 in the text?",
        "response": "Reserved",
        "source": "finqa"
    },
    {
        "query": "Which country produced the highest percentage of lululemon's fabrics in 2023?",
        "response": "In 2023, the highest percentage of lululemon's fabrics, 40%, originated from Taiwan.",
        "source": "finqa"
    },
    {
        "query": "How does the audit report describe the responsibility of UnitedHealth Group's management regarding their financial statements?",
        "response": "The responsibility of UnitedHealth Group's management regarding their financial statements is to prepare them. The audit report describes this responsibility as involving the preparation of financial statements that present fairly the financial position and results of operations in conformity with accounting principles generally accepted in the United States of America.",
        "source": "finqa"
    },
    {
        "query": "What specialized services does HP offer for managing the lifecycle of PCs and mobility installations for its enterprise customers?",
        "response": "HP offers a range of services and solutions to enterprise, public sector, and SMB customers to manage the lifecycle of their PCs and mobility installations, including endpoint computing devices and hybrid systems.",
        "source": "finqa"
    },
    {
        "query": "What constitutes High Quality Liquid Assets (HQLA) as defined by the Federal Reserve?",
        "response": "HQLA includes assets that are actively traded and can be quickly converted to cash during financial stress situations.",
        "source": "finqa"
    },
    {
        "query": "What percentage of DaVita's U.S. directors are women as of the end of 2023?",
        "response": "62%",
        "source": "finqa"
    },
    {
        "query": "How is the company's attrition rate calculated?",
        "response": "The attrition rate is calculated on a trailing twelve-month basis as of the end of each month.",
        "source": "finqa"
    },
    {
        "query": "What segment-specific regulations apply to CVS Health Corporation's Pharmacy & Consumer Wellness segment?",
        "response": "CVS Health Corporation's Pharmacy & Consumer Wellness segment is subject to regulations that limit the sale of alcohol, mandate a minimum wage, and govern practices in optometry, audiology, provision of dietician services, and the sale of durable medical equipment, contact lenses, eyeglasses, and hearing aids.",
        "source": "finqa"
    },
    {
        "query": "What do anti-kickback laws prohibit?",
        "response": "Anti-kickback laws make it illegal for a prescription drug manufacturer to solicit, offer, receive, or pay remuneration to induce the referral of business reimbursed by a federal healthcare program.",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue for the year ended December 31, 2023?",
        "response": "$2.7 billion",
        "source": "finqa"
    },
    {
        "query": "What strategies are being adopted to enhance revenue through acquisition according to the business plans described?",
        "response": "The business plans include pursuing value-enhancing initiatives such as making attractive and opportunistic acquisitions inside and outside the theatrical exhibition industry. These acquisitions aim to leverage the company's footprint and capabilities as well as the core competencies and experiences of the management team.",
        "source": "finqa"
    },
    {
        "query": "Where can detailed information about legal proceedings be found as mentioned in ITEM 3 of Form 10-K?",
        "response": "Detailed information about legal proceedings can be found in Note 17 – Contingencies of the Notes to Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What was the net increase or decrease in cash and cash equivalents from the beginning to the end of the year, according to the given figures?",
        "response": "The net increase in cash and cash equivalents from the beginning to the end of the year was $12,682 million.",
        "source": "finqa"
    },
    {
        "query": "What could potentially influence the medical cost per member per month (PMPM) trend factors?",
        "response": "Pharmacy utilization trends, inpatient hospital authorization data, and seasonal and other incidence data from the National Centers for Disease Control.",
        "source": "finqa"
    },
    {
        "query": "What was the basic earnings per share for Chipotle Mexican Grill in 2023?",
        "response": "$44.59",
        "source": "finqa"
    },
    {
        "query": "What are the effective dates for the main provisions and additional data collection and reporting requirements of the final rule impacting AENB's compliance obligations?",
        "response": "The main provisions of the final rule impacting AENB's compliance obligations become effective on January 1, 2026, and the additional data collection and reporting requirements become effective on January 1, 2027.",
        "source": "finqa"
    },
    {
        "query": "How is goodwill reviewed for impairment in a company, and what methods are used to determine the fair value of reporting units?",
        "response": "Goodwill is reviewed at least annually for impairment. The company performs a qualitative assessment to determine if it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If the qualitative assessment is inconclusive, the company tests goodwill for impairment by comparing the fair fair value of the reporting unit to its carrying value. Fair value determinations may include using an income or market approach, considering market participant considerations and management’s assumptions about revenue growth rates, operating margins, discount rates, and expected capital expenditures.",
        "source": "finqa"
    },
    {
        "query": "What is the method used to include the information about Legal Proceedings in the document?",
        "response": "The information is incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "What impact do changes in certain assumptions have on pension expense and benefit obligations?",
        "response": "Changes in certain assumptions like the long-term rate of return on plan assets and discount rates can significantly affect pension expense and benefit obligations.",
        "source": "finqa"
    },
    {
        "query": "How much were the LIFO charges in 2022 and 2021?",
        "response": "The LIFO charges were $626 million in 2022 and $197 million in 2021.",
        "source": "finqa"
    },
    {
        "query": "How much did Botox Cosmetic net revenues increase internationally in 2023?",
        "response": "10%",
        "source": "finqa"
    },
    {
        "query": "What rules did the FCC adopt on November 15, 2023, concerning broadband access?",
        "response": "The FCC adopted rules to facilitate equal access to broadband and prevent digital discrimination in broadband access, which prohibits covered entities from implementing unjustified policies that differentially impact consumers' access.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of inventories in 2023 for Machinery, Energy & Transportation?",
        "response": "$16,565 million",
        "source": "finqa"
    },
    {
        "query": "What powers does the Special Resolution Regime in the U.K. confer on the Bank of England regarding financial institutions?",
        "response": "The U.K. Special Resolution Regime confers substantially the same powers on the Bank of England, as the U.K. resolution authority, as the powers given to E.U. resolution authorities, including the ability to impose a temporary stay and to recapitalize a failing entity by writing down or converting its unsecured debt into equity.",
        "source": "finqa"
    },
    {
        "query": "What specific procedures did the auditors perform related to the Critical Audit Matter of medical care services Incurred but not Reported (IBNR)?",
        "response": "The auditors' procedures for the Critical Audit Matter of IBNR included testing controls over management's estimate, testing underlying claims and membership data, evaluating the actuarial methods and assumptions with the help of actuarial specialists, and developing an independent estimate for comparison.",
        "source": "finqa"
    },
    {
        "query": "What are some factors that affect the percentage of service fees charged to customers?",
        "response": "The percentage of service fees charged to customers can vary based on factors like the value, duration, and geography of the booking, as well as the type of Host.",
        "source": "finqa"
    },
    {
        "query": "What does the debt balance mentioned in financial documents represent?",
        "response": "The debt balances represent principal maturities, excluding interest, discounts, and debt issuance costs.",
        "source": "finqa"
    },
    {
        "query": "Where in the Form 10-K can one find Note 15 which discusses legal proceedings?",
        "response": "Note 15, which discusses legal proceedings, can be found in Part II, Item 8 of the Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What are Garmin's core strategies for reducing its environmental impact?",
        "response": "Garmin's strategies for reducing environmental impact include increasing environmental sustainability efforts, reducing greenhouse gas emissions, utilizing renewable electricity, and enhancing waste reduction and recycling.",
        "source": "finqa"
    },
    {
        "query": "What strategies does Garmin use to protect its intellectual property?",
        "response": "Garmin protects its intellectual property through a combination of patent, copyright, trademark, and trade secret laws, supplemented by confidentiality agreements.",
        "source": "finqa"
    },
    {
        "query": "What interest rates are applicable to the notes issued in April 2022?",
        "response": "The notes issued in April 2022 have interest rates ranging from 2.73% to 4.10%.",
        "source": "finqa"
    },
    {
        "query": "What types of financial solutions does Hewlett Packard Enterprise offer through its Financial Services segment?",
        "response": "Hewlett Packard Enterprise, through its Financial Services segment, offers financial solutions including leasing, financing, IT consumption, and utility programs aimed at aiding the acquisition and deployment of IT technology.",
        "source": "finqa"
    },
    {
        "query": "What are the different inputs that management used to value level 3 financial instruments?",
        "response": "Market multiples, discount rates, and capitalization rates for equity securities; credit spreads for credit derivatives; and correlation for hybrid financial instruments.",
        "source": "finqa"
    },
    {
        "query": "What changes led to a significant increase in Other (income) Expense, Net in 2023 compared to 2022?",
        "response": "Primary factors included a substantial increase in litigation related expenses, partially offset by lower costs associated with COVID-19 vaccine manufacturing exit and changes in the fair value of securities.",
        "source": "finqa"
    },
    {
        "query": "What was the operating income for the year ended December 31, 2023 compared to the operating loss in 2022?",
        "response": "In 2023, the operating income was $2.31 billion, compared to an operating loss of $792 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What contributed to the net cash provided by financing activities for the fiscal year ended June 30, 2023?",
        "response": "The net cash provided by financing activities was mainly due to $79.8 million from stock option exercises and $6.9 million in net proceeds from the Employee Stock Purchase Plan, partially offset by $7.5 million in principal repayments of the Term Loan.",
        "source": "finqa"
    },
    {
        "query": "What interest options are available for the notes issued under the commercial paper program?",
        "response": "The notes are issued either at a discount to par or sold at par with varying interest rates based on a fixed or floating rate basis.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the decrease in adjusted operating income in 2023?",
        "response": "The decrease in adjusted operating income was primarily driven by increased utilization in Medicare Advantage and incremental investments in the business.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in net cash flow from operating activities from 2022 to 2023?",
        "response": "$185,872",
        "source": "finqa"
    },
    {
        "query": "What role did Ms. O'Brien serve in before becoming the Deputy Chief Risk Officer?",
        "response": "Division President, North America Personal Risk Services",
        "source": "finqa"
    },
    {
        "query": "How much did UnitedHealthcare's revenue amount to in 2023?",
        "response": "$281,360 million",
        "source": "finqa"
    },
    {
        "query": "What types of interests and assets are typically involved in off-balance sheet arrangements?",
        "response": "Off-balance sheet arrangements typically involve interests in special purpose entities, senior and subordinated debt, interests in partnerships, preferred and common stock in nonconsolidated vehicles, and derivatives such as interest rate, foreign currency, and credit derivatives.",
        "source": "finqa"
    },
    {
        "query": "What were the financial outcomes of the marketable equity securities valuation for a company from 2021 to 2023?",
        "response": "The marketable equity securities valuation gains (losses) for the company were $11,526 million in 2021, $(13,870) million in 2022, and $984 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the duration of data protection for biosimilar products under the BPCIA before the FDA can approve an application?",
        "response": "12 years",
        "source": "finqa"
    },
    {
        "query": "What is the total forecasted capital expenditure for fiscal 2024?",
        "response": "The total forecasted capital expenditure for fiscal 2024 is approximately $3.0 billion.",
        "source": "finqa"
    },
    {
        "query": "How did the NYSE equity options volume change from 2022 to 2023?",
        "response": "increased by 4%",
        "source": "finqa"
    },
    {
        "query": "What was the financial benefit received by AMC due to the modification of the 2022 PSU awards?",
        "response": "$20.2 million in additional stock compensation expense",
        "source": "finqa"
    },
    {
        "query": "What is the primary business of the retailer and distributor mentioned in the discussion?",
        "response": "The retailer and distributor primarily deals in automotive replacement parts and accessories.",
        "source": "finqa"
    },
    {
        "query": "What sections are included in the MD&A of Hershey's Annual Report?",
        "response": "The MD&A of Hershey's Annual Report includes sections such as Business Model and Growth Strategy, Overview, Trends Affecting Our Business, Consolidated Results of Operations, Segment Results, Liquidity and Capital Resources, and Critical Accounting Policies and Estimates.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash dividend paid by Electronic Arts in the fiscal year ended March 31, 2023?",
        "response": "$210 million",
        "source": "finqa"
    },
    {
        "query": "Is the information about legal proceedings in Item 3 directly provided or referenced from another section?",
        "response": "It is referenced from the \"Contingencies\" section in Note 15 of the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "When was the auditors' report on the financial statements dated?",
        "response": "The auditors' report on the financial statements is dated February 16, 2024.",
        "source": "finqa"
    },
    {
        "query": "What is Equifax's general strategy for handling various legal actions?",
        "response": "Equifax may explore potential settlements before a trial due to the uncertainty and risks inherent in the litigation process.",
        "source": "finqa"
    },
    {
        "query": "How are additional discussions about legal proceedings risks introduced in the Annual Report?",
        "response": "Through the 'Risk Factors' section.",
        "source": "finqa"
    },
    {
        "query": "What is Costco's policy on inventories?",
        "response": "Costco often sells inventory before it is required to pay for it, and takes advantage of early payment discounts.",
        "source": "finqa"
    },
    {
        "query": "What is the role of derivative instruments in managing financial risks?",
        "response": "Derivative instruments like foreign exchange forward contracts and treasury rate lock contracts are used to manage exposure to foreign exchange risk and interest rate risk.",
        "source": "finqa"
    },
    {
        "query": "How many aircraft did Delta Air Lines lease as of December 31, 2023, and how are these leases classified?",
        "response": "As of December 31, 2023, Delta Air Lines leased a total of 225 aircraft, classified into 111 finance leases and 114 operating leases.",
        "source": "finqa"
    },
    {
        "query": "What was GEICO's pre-tax underwriting earnings in 2023?",
        "response": "GEICO's pre-tax underwriting earnings in 2023 were $3,635 million.",
        "source": "finqa"
    },
    {
        "query": "What are the new SBTi goals the company plans to adopt by the end of fiscal 2023?",
        "response": "reduce Scope 1, 2, and 3 emissions in line with Paris Agreement goals",
        "source": "finqa"
    },
    {
        "query": "What was the total sales and trading revenue of Global Markets in 2023?",
        "response": "$17,376 million",
        "source": "finqa"
    },
    {
        "query": "How many employees did the company have at the end of fiscal year 2023, and in how many countries were they located?",
        "response": "At the end of fiscal year 2023, the company had 26,196 employees located in 35 countries.",
        "source": "finqa"
    },
    {
        "query": "Where are the details about 'Legal Matters' and 'Government Investigations, Audits and Reviews' located in the financial statements?",
        "response": "The details about 'Legal Matters' and 'Government Investigations, Audits and Reviews' are located in Note 12 of the Notes to the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What are the primary regulatory authorities that supervise and regulate JPMorgan Chase in the U.S.?",
        "response": "The primary regulatory authorities in the U.S. that supervise and regulate JPMorgan Chase include the Board of Governors of the Federal Reserve System, the Office of the Comptroller of the Currency, the Federal Deposit Insurance Corporation, the Securities and Exchange Commission, and the Financial Industry Regulatory Authority.",
        "source": "finqa"
    },
    {
        "query": "In what markets is AMD a leader in adaptive and embedded computing products?",
        "response": "AMD is a leader in adaptive and embedded computing products for markets including health care, automotive, industrial, storage, and networking.",
        "source": "finqa"
    },
    {
        "query": "How are the company's litigation expenses expected to change given current judicial proceedings?",
        "response": "The company's litigation expenses are expected to remain high due to the range of litigation and investigations currently underway.",
        "source": "finqa"
    },
    {
        "query": "What type of data does Item 8 cover in the context of a financial document?",
        "response": "Item 8 covers Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "How many members does the Hilton Honors guest loyalty program have as of December 31, 2023?",
        "response": "180 million members",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Rate Reform (Topic 848) in relation to the transition from LIBOR?",
        "response": "The purpose of the Rate Reform (Topic 848) is to provide temporary optional expedients and exceptions to the GAAP guidance on contract modifications and hedge accounting, easing financial reporting burdens during the market's transition from the London Interbank Offered Rate (LIBOR) and other interbank offered rates to alternative reference rates.",
        "source": "finqa"
    },
    {
        "query": "Where are the commitments and contingencies regarding legal proceedings documented in an annual report?",
        "response": "Commitments and contingencies regarding legal proceedings are documented in Note 8 of the consolidated financial statements in an annual report.",
        "source": "finqa"
    },
    {
        "query": "What are the Canadian class actions against Equifax seeking in relation to the 2017 cybersecurity incident?",
        "response": "The Canadian class actions are seeking monetary damages and other related relief for the alleged impact of the cybersecurity incident on personal information of Canadian consumers.",
        "source": "finqa"
    },
    {
        "query": "What criteria does the company use to determine whether an impairment loss should be recognized on acquisition-related intangible assets?",
        "response": "The company evaluates acquisition-related intangibles for impairment by comparing the asset's carrying amount to undiscounted future net cash flows expected from the asset. An impairment loss is recognized if the carrying amount exceeds the asset's recoverable amount.",
        "source": "finqa"
    },
    {
        "query": "What is the mechanism of action for Veklury?",
        "response": "Veklury functions as a nucleotide analog RNA polymerase inhibitor.",
        "source": "finqa"
    },
    {
        "query": "What types of legal challenges is the company currently facing as a multinational entity?",
        "response": "The company is facing claims, litigation, regulatory and tax issues, government inquiries and investigations, and other legal proceedings in various jurisdictions worldwide.",
        "source": "finqa"
    },
    {
        "query": "What is the primary method by which the company manages its cash, cash equivalents, and marketable securities?",
        "response": "The company concentrates its cash deposits with large financial institutions and maintains its investment holdings in diversified highly rated securities, as part of its cash management strategy.",
        "source": "finqa"
    },
    {
        "query": "How much did the CenterWell segment's income from operations increase from 2022 to 2023?",
        "response": "Increased by $113 million, or 8.8%",
        "source": "finqa"
    },
    {
        "query": "What factors are considered when making estimates for financial statements?",
        "response": "Estimates are based on historical experience and various other assumptions believed to be reasonable under the circumstances.",
        "source": "finqa"
    },
    {
        "query": "What were the net catastrophe losses in U.S. dollars in 2023?",
        "response": "$710 million",
        "source": "finqa"
    },
    {
        "query": "What led to a decrease in professional services expenses in 2023?",
        "response": "Professional services expenses decreased in 2023 primarily due to lower consulting expenses related to bringing certain mortgage technology-related costs in-house, partially offset by higher legal expenses primarily related to the Black Knight acquisition.",
        "source": "finqa"
    },
    {
        "query": "How long is a typical fiscal year for the company described, and what variation can occur?",
        "response": "A typical fiscal year for the company ends on the Sunday closest to January 31 of the following year, usually resulting in a 52-week year. Occasionally, an additional week may be added, resulting in a 53-week year.",
        "source": "finqa"
    },
    {
        "query": "What was Intuit's Net Income in fiscal year 2023?",
        "response": "$2,384 million",
        "source": "finqa"
    },
    {
        "query": "What measures is The Hershey Company taking to ensure sufficient liquidity during economic downturns?",
        "response": "The Hershey Company evaluates and takes necessary actions to preserve adequate liquidity and ensure effective operation, including monitoring discretionary spending and focusing on strategic initiatives.",
        "source": "finqa"
    },
    {
        "query": "What programs does Chevron have to support employee well-being and address workplace issues?",
        "response": "Chevron offers the Ombuds, a company hotline, and an Employee Assistance Program; all designed to help employees address and resolve a range of workplace, personal, and family issues.",
        "source": "finqa"
    },
    {
        "query": "What was the total payment on debt with original maturities greater than three months for a company?",
        "response": "$(6,318)",
        "source": "finqa"
    },
    {
        "query": "What is the projected timeline for recognizing revenue from deferred revenues related to Hilton Honors as of December 31, 2023?",
        "response": "approximately the next two years",
        "source": "finqa"
    },
    {
        "query": "Are the ESG goals guaranteed to be met?",
        "response": "No, the ESG goals are aspirational and may change, and there is no guarantee or promise that they will be met.",
        "source": "finqa"
    },
    {
        "query": "What does the NVIDIA GPU Cloud registry offer?",
        "response": "The NVIDIA GPU Cloud registry offers a comprehensive catalog of easy-to-use, optimized software stacks across various domains including scientific computing, deep learning, and machine learning, enabling AI developers, researchers, and data scientists to get started with the development of AI and HPC applications and deploy them on various systems.",
        "source": "finqa"
    },
    {
        "query": "What is the significance of the gasoline business to the company's warehouse traffic and profitability?",
        "response": "The gasoline business enhances traffic in the company's warehouses but generally has a lower gross margin percentage and lower SG&A expense, relative to non-gasoline businesses. A higher penetration of gasoline sales generally lowers the gross margin percentage.",
        "source": "finqa"
    },
    {
        "query": "How do state and federal regulations impact the Company's ability to set premium rates for its Commercial Health Care Benefits business?",
        "response": "State and federal regulations impact the Company's ability to set premium rates by imposing review processes for rate reasonableness, requiring public disclosure for certain rate increases, and applying strict criteria for premium rate modifications. These regulations can delay, deny, or reduce the Company's proposed rate increases, potentially affecting its operating results, particularly during periods of high medical service utilization or cost trends.",
        "source": "finqa"
    },
    {
        "query": "What total amount did the company recognize as impairment charges for property and equipment in 2023?",
        "response": "The company recognized immaterial impairment charges for property and equipment in 2023.",
        "source": "finqa"
    },
    {
        "query": "How do the company's compensation programs respond to economic conditions?",
        "response": "The company's compensation programs provide programs in line with economic conditions and the company’s financial health, ensuring fiscal responsibility.",
        "source": "finqa"
    },
    {
        "query": "What are the key areas of revenue generation for Microsoft as described in their financial overview?",
        "response": "Microsoft generates revenue by offering cloud-based solutions, licensing and supporting software products, delivering online advertising, and designing and selling devices.",
        "source": "finqa"
    },
    {
        "query": "What are the primary risks retained under self-insurance by the company?",
        "response": "The primary risks retained under self-insurance include workers’ compensation, general liability, product liability, property, and vehicle liability.",
        "source": "finqa"
    },
    {
        "query": "How many legal proceedings is the company currently involved in?",
        "response": "The text does not specify the exact number of legal proceedings the company is involved in.",
        "source": "finqa"
    },
    {
        "query": "What are the expected total costs of FedEx's business optimization activities through 2025?",
        "response": "approximately $2.0 billion",
        "source": "finqa"
    },
    {
        "query": "Is 'Litigation and Contingencies' a separate section in financial statements or part of another section?",
        "response": "'Litigation and Contingencies' is part of another section, specifically Note 14 in the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "By what proportion did net cash used in financing activities increase from 2022 to 2023?",
        "response": "15.6%",
        "source": "finqa"
    },
    {
        "query": "What was the % change in earnings (loss) before interest and taxes from fiscal 2021 to fiscal 2022?",
        "response": "2% increase",
        "source": "finqa"
    },
    {
        "query": "Where can one find a discussion on the risks associated with legal proceedings in the Annual Report?",
        "response": "In the 'Risk Factors' section above Item 3.",
        "source": "finqa"
    },
    {
        "query": "What keywords would you associate with Advanced Micro Devices, Inc.?",
        "response": "AMD",
        "source": "finqa"
    },
    {
        "query": "Is the outcome of the investigation into Tesla's waste segregation practices currently determinable?",
        "response": "No, the outcome of the investigation into Tesla's waste segregation practices cannot be determined at this time.",
        "source": "finqa"
    },
    {
        "query": "How much did the MedTech segment's revenue increase by in 2023 compared to 2022?",
        "response": "$629 million",
        "source": "finqa"
    },
    {
        "query": "What are the therapeutic areas Gilead Sciences targets with its innovative medicines?",
        "response": "Gilead Sciences focuses on the development of innovative medicines for the prevention and treatment of life-threatening diseases such as HIV, viral hepatitis, COVID-19, and cancer.",
        "source": "finqa"
    },
    {
        "query": "What impact will the change in accounting estimate regarding depreciation have on the fiscal year 2024 operating income?",
        "response": "The change in the accounting estimate is estimated to increase the fiscal year 2024 operating income by $133 million.",
        "source": "finqa"
    },
    {
        "query": "What is the title of the section where the financial statements and supplementary data are discussed?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "How could the FCC's spectrum proceedings impact businesses that use spectrum?",
        "response": "Businesses may need to transition their operations to different frequencies if the FCC reallocates other spectrum bands they currently use, which could disrupt services and impose additional costs.",
        "source": "finqa"
    },
    {
        "query": "How does the federal diagnosis-related group (DRG) payment system affect the financial incentives of health care facilities in the U.S.?",
        "response": "The federal DRAG payment system provides fixed reimbursements to health care facilities based on diagnoses and/or procedures, incentivizing them to control or limit expenditures.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in Berkshire Hathaway Reinsurance Group's underwriting expenses from 2022 to 2023?",
        "response": "Underwriting expenses increased by $2.5 billion in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the title for the section that covers financial statements and supplementary data in a document?",
        "response": "Item 8: Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How does Garmin support its sales and marketing efforts?",
        "response": "Garmin supports its sales and marketing efforts through a diverse network of sales channels, direct selling via its online webshop, and subscriptions for connected services. They also provide marketing support from their global offices.",
        "source": "finqa"
    },
    {
        "query": "What services does AutoZone's Loan-A-Tool program offer?",
        "response": "AutoZone's Loan-A-Tool program allows customers to borrow specialty tools needed for specific automotive jobs, such as a steering wheel puller, which might otherwise be unusable for the customer beyond a single use.",
        "source": "finqa"
    },
    {
        "query": "What discount rate does Delta Air Lines use for lease payments when the rate implicit in the lease is not readily determinable?",
        "response": "Delta Air Lines uses their incremental borrowing rate, which is based on the estimated interest rate for collateralized borrowing over a similar term of the lease at commencement date.",
        "source": "finqa"
    },
    {
        "query": "What section of the Form 10-K includes financial statements and supplementary data?",
        "response": "ITEM 8",
        "source": "finqa"
    },
    {
        "query": "What comprehensive platform does Microsoft offer for workplace collaboration, according to the document?",
        "response": "Microsoft offers Microsoft Teams, a comprehensive platform for work that includes meetings, calls, chat, collaboration, and business process automation.",
        "source": "finqa"
    },
    {
        "query": "How does Ford Motor Company handle its structural costs in relation to production volume changes?",
        "response": "Structural costs do not have a direct proportional relationship to production volume and include costs like manufacturing, engineering, and administrative expenses, which can be adjusted over time in response to external factors.",
        "source": "finqa"
    },
    {
        "query": "How does the company aim to protect the health and well-being of the communities it operates in?",
        "response": "The company aims to protect the health and well-being of the communities by providing technology to employees, end-customers, and business partners to help them perform their best work remotely.",
        "source": "finqa"
    },
    {
        "query": "What is the total number of company-operated stores as of January 28, 2024?",
        "response": "As of January 28, 2024, there are a total of 711 company-operated stores.",
        "source": "finqa"
    },
    {
        "query": "How are diluted earnings per share calculated?",
        "response": "Diluted earnings per share is computed based on the weighted-average number of shares outstanding plus potentially dilutive shares outstanding during the period, which include shares from stock options, RSUs, common stock to be issued under the ESPP, and warrants.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock remained available for issuance under the Amended 2012 Plan as of October 29, 2023?",
        "response": "36 million shares",
        "source": "finqa"
    },
    {
        "query": "What percentage of the global workforce was female at the end of fiscal year 2023?",
        "response": "19%",
        "source": "finqa"
    },
    {
        "query": "How is the impairment loss allocated among various assets in an asset group when indicators of impairment are found?",
        "response": "The impairment loss related to an asset group is allocated among the various assets within the asset group pro rata based on the relative carrying values of the respective assets.",
        "source": "finqa"
    },
    {
        "query": "What was the impact on Berkshire Hathaway's underwriting expense ratio in 2023 compared to 2022?",
        "response": "The underwriting expense ratio increased by 6.0 percentage points in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the Coca-Cola system's commitments to product safety and quality?",
        "response": "The Coca-Cola system commits to producing high-quality, safe, and refreshing beverages with rigorous product and ingredient safety and quality standards, and drives innovation to offer new beverage options catering to evolving consumer needs.",
        "source": "finqa"
    },
    {
        "query": "What condition does OPSUMIT (macitentan) treat in pediatric patients?",
        "response": "OPSUMIT is used for the treatment of pediatric pulmonary arterial hypertension.",
        "source": "finqa"
    },
    {
        "query": "What types of legal issues are generally categorized under Commitments and Contingencies in a Form 10-K?",
        "response": "Legal issues in Commitments and Contingendantsuch as lawsuits, regulatory matters, and other legal risks.",
        "source": "finqa"
    },
    {
        "query": "How would a 5% change in the contingent consideration liabilities impact income before taxes as of December 31, 2023?",
        "response": "It would result in a change in income before income taxes of $5.2 million.",
        "source": "finqa"
    },
    {
        "query": "What does the company's Associate Experience Survey (AES) cover and how is it used?",
        "response": "The AES is an in-depth survey covering eighteen dimensions that align to the company’s strategy and employee engagement, used to create action plans and foster engagement.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the Form 10-K?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What are the core components of American Express's spend-centric business model?",
        "response": "American Express's spend-centric business model primarily focuses on generating revenues through card spending, supplemented by finance charges and fees. Card Members' spending on American Express cards is typically higher per card compared to its network competitors, which benefits merchants with loyal customers and larger transactions.",
        "source": "finqa"
    },
    {
        "query": "What was the total net earnings for Johnson & Johnson in 2023?",
        "response": "$35,153 million",
        "source": "finqa"
    },
    {
        "query": "What were the total shares repurchased under the pre-approved share repurchase programs by The Hershey Company in 2023?",
        "response": "1.0 million shares",
        "source": "finqa"
    },
    {
        "query": "What are the inherent limitations of internal control over financial reporting as described?",
        "response": "Internal control over financial reporting may not prevent or detect misstatements due to its inherent limitations. Additionally, the effectiveness of these controls may diminish over time due to changes in conditions or a decrease in compliance with established policies and procedures.",
        "source": "finqa"
    },
    {
        "query": "What is the principal amount of debt maturing in fiscal year 2023?",
        "response": "$1,000 million",
        "source": "finqa"
    },
    {
        "query": "What section of a document does Item 8 refer to?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What are the types of Business Roundtables at Chubb aimed at fostering an inclusive work environment?",
        "response": "Some of the Business Roundtables at Chubb include Mosaic, Impact, Thrive, Pride, and Salute.",
        "source": "finqa"
    },
    {
        "query": "What reporting units are used for the goodwill impairment evaluation?",
        "response": "The reporting units used for goodwill impairment evaluation are Family Dollar, Dollar Tree, and Dollar Tree Canada.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the estimation of the income tax benefit a company expects to realize?",
        "response": "Factors include interpreting complex tax laws across multiple jurisdictions, evaluating the technical merits of each tax position, and assessing amounts likely to be accepted in negotiated settlements with tax authorities.",
        "source": "finqa"
    },
    {
        "query": "What were the primary drivers of the income tax benefit in 2023?",
        "response": "The primary drivers were a $55.9 million tax benefit related to Elo7 and a benefit related to research and development tax credits, partially offset by tax expense on income before income taxes and tax deficiencies from stock-based compensation.",
        "source": "finqa"
    },
    {
        "query": "What was the effective price per share of class A common stock for fiscal 2023 under the U.S. retrospective responsibility plan?",
        "response": "$221.33",
        "source": "finqa"
    },
    {
        "query": "What is discussed in Item 8 of the financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What can make changing the company's operations in accordance with new or changed restrictions on international trade expensive, time-consuming, and disruptive to operations?",
        "response": "Changing the Company's operations in accordance with new or changed restrictions on international trade can be costly, time-consuming, and disruptive because such restrictions can be announced with little or no advance notice, and the Company may not be able to effectively mitigate all adverse impacts from such measures.",
        "source": "finqa"
    },
    {
        "query": "How did Ernst & Young LLP address the valuation of Delta Air Lines' loyalty program in the 2023 audit?",
        "response": "Ernst & Young LLP addressed the valuation by evaluating the design of controls over the accounting of the loyalty program, testing the operating effectiveness of these controls, and particularly focusing on management's estimation of mileage breakage, which involved statistical modeling to predict future redemption patterns.",
        "source": "finqa"
    },
    {
        "query": "What were the gains related to the fair value adjustments of investments in BVS during 2022?",
        "response": "A $13.3 million gain.",
        "source": "finqa"
    },
    {
        "query": "Who is responsible for the strategic operations and resource allocation at Johnson & Johnson?",
        "response": "The Executive Committee of Johnson & Johnson",
        "source": "finqa"
    },
    {
        "query": "What is the significance of pre-exposure prophylaxis (PrEP) in Descovy?",
        "response": "Pre-exposure prophylaxis (PrEP) in Descovy is used to reduce the risk of sexually acquired HIV-1 infection in certain at-risk patients.",
        "source": "finqa"
    },
    {
        "query": "What specific actions is the FDIC empowered to take if appointed as the conservator or receiver of AENB?",
        "response": "If appointed as the conservator or receiver, the FDIC can transfer AENB’s assets and liabilities without creditor approval, enforce or repudiate AENB's contracts according to their terms to promote orderly administration, and prioritize claims of U.S. deposit liabilities and certain administrative expenses over other unsecured claims.",
        "source": "finqa"
    },
    {
        "query": "Which specific note in the consolidated financial statements provides insights into litigation as discussed in Item 3?",
        "response": "Note 17",
        "source": "finqa"
    },
    {
        "query": "How does the acquisition method affect the financial statements after a business acquisition?",
        "response": "Under the acquisition method, the results of operations of the acquired business are included in the consolidated financial statements from the date of acquisition. The assets and liabilities assumed are recorded at their estimated fair values, with any excess of purchase price over these values recognized as goodwill.",
        "source": "finqa"
    },
    {
        "query": "Where does Eli Lilly and Company manufacture and distribute its products?",
        "response": "Eli Lilly and Company manufactures and distributes its products through facilities in the United States, including Puerto Rico, and in Europe and Asia.",
        "source": "finqa"
    },
    {
        "query": "How many stores did AutoZone operate in the United States as of August 26, 2023?",
        "response": "6,300",
        "source": "finqa"
    },
    {
        "query": "What legislative development impacts Medicare eligibility age?",
        "response": "Legislative developments can change the eligibility age for Medicare beneficiaries.",
        "source": "finqa"
    },
    {
        "query": "How do our connectivity solutions support global positioning systems in mobile devices?",
        "response": "Our connectivity solutions include GPS and GNSS receivers that enhance the accuracy of location and navigation capabilities in mobile devices.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the quarterly cash dividend increase on January 26, 2023?",
        "response": "14%",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Breakthrough Therapy designation in the development of medicines?",
        "response": "The Breakthrough Therapy designation aims to expedite the development and review of potential medicines that are intended to treat a serious condition and show preliminary clinical evidence of substantial improvement over existing therapies on a clinically significant endpoint.",
        "source": "finqa"
    },
    {
        "query": "What information is included in the 'Glossary of Terms and Acronyms' of a financial document?",
        "response": "The 'Glossary of Terms and Acronyms' in a financial document includes definitions and explanations of terms and acronyms used within the document.",
        "source": "finqa"
    },
    {
        "query": "How much does HP expect to contribute to non-U.S. pension plans in fiscal year 2024?",
        "response": "$45 million",
        "source": "finqa"
    },
    {
        "query": "Who is the Chief People Officer of this company and what are their responsibilities?",
        "response": "Alan May is the Chief People Officer, responsible for leading a global HR function that drives business growth and transformation through various initiatives like employee engagement, diversity and inclusion, and culture development.",
        "source": "finqa"
    },
    {
        "query": "Where can the consolidated financial statements and accompanying notes be found in the Annual Report on Form 10-K?",
        "response": "They are included immediately following Part IV and incorporated by reference therein.",
        "source": "finqa"
    },
    {
        "query": "What are IBM's primary competencies in competing against other tech companies?",
        "response": "IBM's primary competencies include its diverse range of tech and consulting services, its capability for innovation, and its establishment in mission-critical infrastructure supported by advanced research capabilities.",
        "source": "finqa"
    },
    {
        "query": "What were the total number of IMAX and Dolby Cinema screens operated by AMC as of December 31, 2023?",
        "response": "As of December 31, 2023, AMC operated 217 IMAX screens and 169 Dolby Cinema screens.",
        "source": "finqa"
    },
    {
        "query": "What amount was allocated to goodwill in the Mailchimp purchase price allocation during the second quarter of fiscal 2023?",
        "response": "$8,102 million",
        "source": "finqa"
    },
    {
        "query": "Can indemnification from third parties also contribute to covering litigation costs?",
        "response": "Yes, in limited cases, indemnification from third parties can contribute to covering litigation costs.",
        "source": "finqa"
    },
    {
        "query": "How much cash was used in continuing financing activities in 2023, and what were the main expenditures?",
        "response": "$2,450 million was used in continuing financing activities in 2023, mainly for common stock repurchases, debt repayments, and paying dividends.",
        "source": "finqa"
    },
    {
        "query": "What is the interest payment frequency and maturity date for the 2.70% senior notes issued in March 2022?",
        "response": "The interest on the 2.70% senior notes issued in March 2022 is paid semi-annually, and these notes mature on April 15, 2025.",
        "source": "finqa"
    },
    {
        "query": "What were Preston B. Frazer's roles at AutoZone from 2019 to 2023?",
        "response": "Senior Vice President – Store Operations from 2019 to 2021, and Executive Vice President – Store Operations, Commercial and Loss Prevention from 2021 to 2023",
        "source": "finqa"
    },
    {
        "query": "What is Schwab’s expected timeframe for funding their remaining commitments as mentioned?",
        "response": "between 2024 and 2027",
        "source": "finqa"
    },
    {
        "query": "What was the total equity of Visa Inc. as of September 30, 2023?",
        "response": "$38,733 million",
        "source": "finqa"
    },
    {
        "query": "Why is it important for AT&T's employees to feel valued and have a sense of belonging?",
        "response": "It is important for AT&T's employees to feel valued and have a sense of belonging to ensure they are fully engaged in the company's success.",
        "source": "finqa"
    },
    {
        "query": "What actions can federal banking regulators take if they consider a dividend payment by AENB to be unsafe or unsound?",
        "response": "Federal banking regulators can prohibit or limit the payment of a dividend if they believe the payment would be an unsafe or unsound practice in light of AENB's financial condition.",
        "source": "finqa"
    },
    {
        "query": "How does the company estimate the future stock price volatility for its stock options?",
        "response": "The company estimates future stock price volatility by considering both its observed option-implied volatilities and its historical volatility calculations.",
        "source": "finqa"
    },
    {
        "query": "What are the components of The Hershey Company's compensation, benefits, and wellness programs?",
        "response": "The Hershy Company's programs include competitive salaries, comprehensive health benefits, meaningful retirement benefits, and innovative programs for physical and emotional well-being.",
        "source": "finqa"
    },
    {
        "query": "How much did the Company repurchase of its common stock during 2023?",
        "response": "The Company repurchased $76.6 billion of its common stock during 2023.",
        "source": "finqa"
    },
    {
        "query": "What led to the significant increase in the number of paused Connected Fitness Subscriptions as of June 30, 2023?",
        "response": "The significant increase in the number of paused Connected Fitness Subscriptions as of June 30, 2023, was largely attributed to our seat post recall announced on May 11, 2023, as some members chose to pause their subscriptions while awaiting the delivery of their replacement seat post.",
        "source": "finqa"
    },
    {
        "query": "What are the services provided by Walmart Fulfillment Services?",
        "response": "Walmart Fulfillment Services offers supply chain and fulfillment capabilities to online marketplace sellers.",
        "source": "finqa"
    },
    {
        "query": "How does Bank of America distribute company information and comply with its disclosure obligations?",
        "response": "Bank of America uses its website to distribute company information, as a means of disclosing material, non-public information and for complying with disclosure obligations under Regulation FD. The corporation routinely posts and makes accessible financial and other information, including ESG information, on its website.",
        "source": "finqa"
    },
    {
        "query": "What significant milestone of transactions did Visa reach during fiscal year 2023?",
        "response": "276 billion payments and cash transactions",
        "source": "finqa"
    },
    {
        "query": "What were the peak periods for COVID-19 vaccine administration in 2023 and 2022?",
        "response": "In 2023, the highest quarterly volume of COVID-19 vaccinations was during the fourth quarter, whereas in 2022, high volumes were administered during the first quarter and there was an increase in the fourth quarter related to the bivalent COVID-19 booster.",
        "source": "finqa"
    },
    {
        "query": "How is goodwill impairment analyzed?",
        "response": "By initially assessing qualitative factors to determine potential overvaluation, followed by quantitative analysis if necessary, which involves measuring fair values of reporting units against their carrying values.",
        "source": "finqa"
    },
    {
        "query": "How many nephrologists currently refer patients to outpatient dialysis centers?",
        "response": "Over 5,200 nephrologists currently refer patients to outpatient dialysis centers.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was used in financing activities in 2023, and what were the major uses of this cash?",
        "response": "$656.5 million, mainly used for stock repurchases of $577.0 million and payment of tax obligations on vested equity awards of $83.4 million.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Services net sales from 2022 to 2023?",
        "response": "9%",
        "source": "finqa"
    },
    {
        "query": "What contributed to the change in total operating expenses in 2023 compared to 2022?",
        "response": "Total operating expense in 2023 increased by $5.6 billion, or 12%, primarily due to higher employee-related costs from increased wages and profit sharing, pilot agreement and related expenses, and higher volume-related expenses associated with the 17% increase in capacity.",
        "source": "finqa"
    },
    {
        "query": "How does Walmart's Omni-channel experience integrate its retail stores with eCommerce?",
        "response": "Walmart integrates its retail stores with eCommerce by offering pickup and delivery services, including in-home and same-day delivery options, enhancing the customer-centric experience.",
        "source": "finqa"
    },
    {
        "query": "How is depreciation calculated for buildings, equipment, and furniture in the Company?",
        "response": "Depreciation is calculated on a straight-line basis over the estimated useful lives of those assets.",
        "source": "finqa"
    },
    {
        "query": "What activities does AutoZone use derivative instruments for?",
        "response": "AutoZone uses various derivative instruments to reduce market risks associated with changes in interest rates, foreign exchange rates, and fuel prices.",
        "source": "finqa"
    },
    {
        "query": "Where can one find the company's periodic reports and other filed information?",
        "response": "The company's periodic reports and other information can be found on the SEC's website at www.sec.gov and on the company's investor relations website at ir.tesla.com.",
        "source": "finqa"
    },
    {
        "query": "What were the proceeds from the exercise of equity awards and the employee stock purchase plan for Airbnb, Inc. in 2023?",
        "response": "In 2023, the proceeds from the exercise of equity awards and the employee stock purchase plan for Airbnb, Inc. were $110 million.",
        "source": "finqa"
    },
    {
        "query": "What is the volume of natural gas Chevron is contractually committed to deliver in the United States from 2024 through 2026?",
        "response": "746 billion cubic feet",
        "source": "finqa"
    },
    {
        "query": "What environmental-related commitments does the company uphold?",
        "response": "The company is committed to compliance with all environmental laws applicable to their operations, products and services, and aims to reduce their environmental impact.",
        "source": "finqa"
    },
    {
        "query": "How do changes in the assumed long-term rate of return affect AbbVie's net periodic benefit cost for pension plans?",
        "response": "A one percentage point change in the assumed long-term rate of return would result in a $106 million increase or decrease in the net periodic benefit cost for AbbVie's pension plans in 2024.",
        "source": "finqa"
    },
    {
        "query": "What kind of information does Note 16 in the Consolidated Financial Statements cover in a Form 10-K?",
        "response": "Note 16 covers commitments and contingencies related to legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What was the operating income margin for fiscal year 2022 compared to fiscal year 2021?",
        "response": "The operating income margin increased from 6.9% in fiscal 2021 to 7.9% in fiscal 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of current assets reported by The Hershey Company for the year 2023?",
        "response": "$2,912,103",
        "source": "finqa"
    },
    {
        "query": "What were the total net transfers between the Company and SCL for the year ended December 31, 2023?",
        "response": "The total net transfers between the Company and SCL for the year ended December 31, 2023, were $100 million.",
        "source": "finqa"
    },
    {
        "query": "What resources contribute to HP's liquidity according to the 2023 fiscal year financial data?",
        "response": "HP's liquidity is maintained using cash generated from operations, cash on hand, cash flow from operating activities, new borrowings, commercially available paper authorizations, and credit facilities.",
        "source": "finqa"
    },
    {
        "query": "What does ITEM 3. LEGAL PROCEEDINGS in the context imply about the nature of litigations the company faces?",
        "response": "It implies that the company faces litigations that are ordinary in the course of its business and not out of the ordinary or exceptional.",
        "source": "finqa"
    },
    {
        "query": "What type of information does Item 8 of Part II in the Annual Report on Form 10-K contain regarding legal proceedings?",
        "response": "Item 8 contains information about legal proceedings in the section titled Commitments and Contingencies - Legal Proceedings within the Notes to Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What were the total current assets of the consolidated group as of December 31, 2023?",
        "response": "$46,949 million",
        "source": "finqa"
    },
    {
        "query": "What page hosts the Financial Statement Schedule in IBM's Form 10-K?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What does Item 7 in IBM's 2023 Annual Report address?",
        "response": "Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the effective tax rate increase in 2023 compared to 2022?",
        "response": "141.7%",
        "source": "finqa"
    },
    {
        "query": "What types of vehicles are included in the U.S. sales and wholesale figures presented for Ford?",
        "response": "The types of vehicles included in the U.S. sales and wholesale figures are electric vehicles, hybrid vehicles, and internal combustion vehicles.",
        "source": "finqa"
    },
    {
        "query": "What is the expected range for Ford's adjusted EBIT in the full year of 2024?",
        "response": "$10 billion to $12 billion",
        "source": "finqa"
    },
    {
        "query": "What were the total future minimum lease payments under all non-cancelable operating leases for the company as of December 31, 2023?",
        "response": "$5,975 million",
        "source": "finqa"
    },
    {
        "query": "What unique features do Garmin smartwatches provide?",
        "response": "Wrist-based heart rate monitoring, AMOLED displays, ECG app, Garmin Pay, music storage capabilities",
        "source": "finqa"
    },
    {
        "query": "What specific charges are excluded from Hewlett Packard Enterprise's non-GAAP operating profit margin and why?",
        "response": "Hewlett Packard Enterprise's non-GAAP operating profit margin excludes charges related to the amortization of intangible assets, goodwill impairment, transformation costs, and acquisition, disposition and other related charges. These charges are excluded primarily because they are either non-cash expenses, significantly impacted by the timing and magnitude of acquisitions, or inconsistent in amount and frequency.",
        "source": "finqa"
    },
    {
        "query": "What business segments does Intuit operate in and what services do they provide?",
        "response": "Intuit operates in segments like Small Business & Self-Employed, Consumer, Credit Karma, and ProTax, offering services ranging from personal finance to professional accounting support.",
        "source": "finqa"
    },
    {
        "query": "What was the net liquidity available for use at Ford Credit by the end of 2023 and how much did it change from year-end 2022?",
        "response": "$25.7 billion, an increase of $4.6 billion from year-end 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the proposed legislative changes in the EU regarding data service providers?",
        "response": "The proposed changes include new or expanded requirements such as conflict of interest and transparency rules, regulation of prices and fees, and imposition of market access rules for third-country providers.",
        "source": "finqa"
    },
    {
        "query": "What steps will be taken to monitor the Asia Pacific reporting unit's performance against possible impairment?",
        "response": "The performance of the Asia Pacific reporting unit will be continually monitored to ensure no interim indications of possible impairment have occurred before the next annual goodwill impairment assessment in December 2024.",
        "source": "finqa"
    },
    {
        "query": "What is Hepcludex approved for in the European Union?",
        "response": "Hepcludex is approved for the treatment of adults with HDV and compensated liver disease.",
        "source": "finqa"
    },
    {
        "query": "What actions have some states taken in response to the FCC repealing net neutrality rules?",
        "response": "Some states have adopted legislation or issued executive orders to reimpose net neutrality rules.",
        "source": "finqa"
    },
    {
        "query": "How much did the company's inventory decrease in percentage terms compared to the previous year?",
        "response": "The company's inventory balance decreased by 9% compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "How much would total revenue and advertising revenue have been lower in 2023 using constant foreign exchange rates compared to actual figures?",
        "response": "Using constant foreign exchange rates, total revenue and advertising revenue would have been $374 million and $379 million lower, respectively, than the actual figures in 2023.",
        "source": "finqa"
    },
    {
        "query": "What year did the company introduce multiplex theatres?",
        "response": "The 1960s",
        "source": "finqa"
    },
    {
        "query": "What page number does Item 8 start on in the document?",
        "response": "39",
        "source": "finqa"
    },
    {
        "query": "What was the net notional amount of foreign exchange contracts accounted for as cash flow hedges at the end of 2023?",
        "response": "$80,068",
        "source": "finqa"
    },
    {
        "query": "What is the maximum duration for patent term restoration for pharmaceutical products in the U.S.?",
        "response": "The maximum duration for patent term restoration for pharmaceutical products in the U.S. is five years, and no patent expiration date may be extended beyond 14 years from FDA approval.",
        "source": "finqa"
    },
    {
        "query": "What was the value of cash and cash equivalents reported by Bank of America on December 31, 2023?",
        "response": "$333,073 million",
        "source": "finqa"
    },
    {
        "query": "What is the predominant payment term provided to customers for subscription services?",
        "response": "Customers are typically required to pay within 30 days of receiving the invoice.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the EH&S policies at The Home Depot?",
        "response": "The purpose of the EH&S policies at The Home Depot is to maintain a safe shopping and working environment for both customers and associates.",
        "source": "finqa"
    },
    {
        "query": "What page number does Item 8 start on in the financial document?",
        "response": "Page 39",
        "source": "finqa"
    },
    {
        "query": "How are intercompany balances and transactions treated in the consolidated financial statements of Palantir Technologies Inc.?",
        "response": "All significant intercompany balances and transactions are eliminated in the consolidation of Palantir Technologies Inc.'s financial statements.",
        "source": "finqa"
    },
    {
        "query": "How much does the company plan to contribute to its pension trusts in 2024, and to what type of plans will the contributions be allocated?",
        "response": "The company plans to contribute approximately $47 million to its pension trusts in 2024, specifically allocating these funds to international plans.",
        "source": "finqa"
    },
    {
        "query": "What were the main components contributing to the net cash provided by operating activities in 2023?",
        "response": "Operating income, depreciation and amortization, and various adjustments in operating assets and liabilities were the main contributors.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of the Company's cash, cash equivalents, short-term investments, and marketable securities as of December 31, 2023?",
        "response": "$13.7 billion",
        "source": "finqa"
    },
    {
        "query": "What focus areas does the Consumer Personal Systems unit at HP concentrate on?",
        "response": "The Consumer Personal Systems unit focuses on gaming, learning and working remotely, multimedia entertainment, personal life management, staying connected, sharing information, productivity, content creation, and security.",
        "source": "finqa"
    },
    {
        "query": "What is the expected trend for Comcast’s Business Services Connectivity segment?",
        "response": "The Business Services Connectivity segment is expected to continue growing by offering competitive services to medium-sized and enterprise customers.",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in a financial document typically include?",
        "response": "Item 8 includes Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What was the operating profit in 2022 and how did it compare to 2021?",
        "response": "The operating profit in 2022 was $4.1 billion, which represents a 19% increase compared to 2021.",
        "source": "finqa"
    },
    {
        "query": "As of June 30, 2023, what percentage of Connected Fitness Subscription bases were paying month to month?",
        "response": "As of June 30, 2023, 99% of Connected Fitness Subscription bases were paying month to month.",
        "source": "finqa"
    },
    {
        "query": "What were Caterpillar's total obligations for the purchase of goods and services as of December 31, 2023?",
        "response": "$7.91 billion",
        "source": "finqa"
    },
    {
        "query": "By what amount would net income for fiscal 2023 be affected if the discount rate used for calculating the present value of reserves changed by 25 basis points?",
        "response": "If the discount rate used to calculate the present value of these reserves changed by 25 basis points, net income would have been affected by approximately $1.1 million for fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What metric does Hewlett Packard Enterprise use to measure the performance of the HPE GreenLake edge-to-cloud platform?",
        "response": "Hewlett Packard Enterprise uses the Annualized Revenue Run-rate (ARR) as a performance metric for the HPE GreenLake edge-to-cloud platform.",
        "source": "finqa"
    },
    {
        "query": "What does the Federal Reserve require from major U.S. BHCs annually concerning capital planning?",
        "response": "The Federal Reserve requires major U.S. BHCs to submit a capital plan annually as part of the Comprehensive Capital Analysis and Review (CCAR).",
        "source": "finqa"
    },
    {
        "query": "What do commitments in tax credit equity investments involve according to the financial statements?",
        "response": "Commitments to tax credit equity investments involve making additional capital contributions upon achievement of project milestones.",
        "source": "finqa"
    },
    {
        "query": "What is the total number of stores operated by The Home Depot at the end of fiscal 2022?",
        "response": "2,322 stores",
        "source": "finqa"
    },
    {
        "query": "What is included in the 'Dealer Inventories' in financial reports?",
        "response": "Dealer Inventories in financial reports include dealer machine and engine inventories but exclude aftermarket parts.",
        "source": "finqa"
    },
    {
        "query": "How much did the operating revenue increase from 2022 to 2023?",
        "response": "$143.0 million",
        "source": "finqa"
    },
    {
        "query": "How is Florida's total insurance medical membership detailed in the data for December 31, 2023?",
        "response": "Florida's total insurance medical membership includes 851.3 thousand for Individual Medicare Advantage, 9.1 thousand for Group Medicare Advantage, 131.9 thousand for Medicare stand-alone PDP, 17.5 thousand for Medicare Supplement, 656.6 thousand for State-based contracts and Other, 73.8 thousand for Fully-insured commercial Group and 24.5 thousand for ASO, totaling 1,764.7 thousand members.",
        "source": "finqa"
    },
    {
        "query": "What does the Personal Systems segment at HP include?",
        "response": "The Personal Systems segment includes commercial and consumer desktops and notebooks, workstations, thin clients, commercial mobility devices, retail point-of-sale systems, displays, hybrid systems, and related software and services.",
        "source": "finqa"
    },
    {
        "query": "Under which item are the Exhibits and Financial Statement Schedules listed in the report?",
        "response": "The Exhibits and Financial Statement Schedules are listed under Item 15 in the report.",
        "source": "finqa"
    },
    {
        "query": "What strategies does the company employ in its direct sales model for automotive products?",
        "response": "The company employs a direct sales model through its website and international network of company-owned stores, occasionally supplemented by galleries that educate about its products rather than transact sales. This strategy helps control inventory costs, manage warranty service, educate consumers, maintain brand integrity, and receive rapid customer feedback.",
        "source": "finqa"
    },
    {
        "query": "How did Sam's Club's operating income change in fiscal 2023 compared to fiscal 2022?",
        "response": "Sam's Club's operating income decreased by $0.3 billion in fiscal 2023 compared to an increase of $0.4 billion in fiscal 2022.",
        "source": "finqa"
    },
    {
        "query": "What conclusion was made from the quantitative assessments of goodwill and indefinite-lived intangible assets in 2023?",
        "response": "The assessments concluded that there was no indication of impairment since the fair value of each asset exceeded its carrying value by at least 20%.",
        "source": "finqa"
    },
    {
        "query": "What was the effect of the Employer Group Commercial Fully-Insured business on the Insurance segment's operating cost ratio in 2023 and 2022?",
        "response": "In 2023, the Employer Group Commercial Fully-Insured business increased the Insurance segment's operating cost ratio by 30 basis points and by 40 basis points in 2022.",
        "source": "finqa"
    },
    {
        "query": "What were the total revenues for Chipotle Mexican Grill in 2023?",
        "response": "$9,871,649",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the impairment of the Film and TV reporting unit of the Company in 2023?",
        "response": "The main reasons for the impairment of the Film and TV reporting unit of the Company in 2023 were a downward revision of the Company's financial forecast for its Film and TV business and the determination that the carrying value of the Film and TV reporting unit exceeded its fair value.",
        "source": "finqa"
    },
    {
        "query": "What federal agency has taken steps to facilitate energy storage participation in wholesale energy markets?",
        "response": "The Federal Energy Regulatory Commission (FERC)",
        "source": "finqa"
    },
    {
        "query": "How can one access Salesforce's financial reports such as the 10-K and 10-Q?",
        "response": "Salesforce's financial reports such as the Annual Report on Form 10-K and Quarterly Reports on Form 10-Q can be obtained free of charge from Salesforce's investor website or by contacting the Investor Relations department following the filing of these reports with the SEC.",
        "source": "finqa"
    },
    {
        "query": "What are the restrictions imposed on JPMorgan Chase Bank, N.A. regarding transactions with its affiliates?",
        "response": "JPMorgan Chase Bank, N.A. and its subsidiaries cannot extend credit to, invest in stock or securities of, or engage in certain other transactions with JPMorgan Chase & Co. and certain other affiliates unless the loans are secured and comply with specified requirements.",
        "source": "finqa"
    },
    {
        "query": "What was the restructuring expense incurred in fiscal year 2023?",
        "response": "$111 million",
        "source": "finqa"
    },
    {
        "query": "What total amounts were committed under operating leases as of December 31, 2023, and how are these obligations distributed over different time periods?",
        "response": "As of December 31, 2023, the total amounts committed under operating leases were $174,399 thousand, distributed as $50,827 thousand due in less than 1 year, $69,016 thousand due in 1-3 years, $23,201 thousand due in 3-5 years, and $31,355 thousand due in more than 5 years.",
        "source": "finqa"
    },
    {
        "query": "What was Visa's total equity as of September 30, 2023?",
        "response": "$38,733 million",
        "source": "finqa"
    },
    {
        "query": "How did the cash position change for investments in 2023 compared to 2022?",
        "response": "Net cash provided by (used in) investing activities increased by $2,618 million from the year ended December 31, 2022, to $542 million for the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How did Walmart International's net sales change during fiscal 2023 compared to the previous year?",
        "response": "Walmart International's net sales remained flat during fiscal 2023 compared to fiscal 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the core technological benefits provided by Intuit's platform?",
        "response": "Putting more money in customers' pockets, saving time, and providing confidence in financial decisions.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily drove the decrease in Veklury's sales in 2023?",
        "response": "lower demand due to decreased rates of COVID-19 related hospitalizations",
        "source": "finqa"
    },
    {
        "query": "Which section of the Form 10-K provides information about the legal proceedings involving the company?",
        "response": "Note 15 – Contingencies of the Notes to Financial Statements, which is found in Part II, Item 8 of the Form 10-K, provides information about the legal proceedings involving the company.",
        "source": "finqa"
    },
    {
        "query": "What did the FCA require regarding the continued publication of certain LIBOR settings after 2021?",
        "response": "The FCA required the IBA to continue publishing certain LIBOR settings under a 'synthetic' methodology for a temporary period beyond the standard cessation date of December 31, 2021.",
        "source": "finqa"
    },
    {
        "query": "What changes have been made to the operations of a company in Russia since March 2022?",
        "response": "The company in Russia has reduced its product portfolio, discontinued new capital investments, and suspended media, advertising and promotional activity.",
        "source": "finqa"
    },
    {
        "query": "What is the approval status of Tirzepatide (Mounjaro, Zepbound®) for the treatment of obesity as of 2023?",
        "response": "Approved",
        "source": "finqa"
    },
    {
        "query": "What drove the decline in global market share of the fabric care category?",
        "response": "The decline in global market share of the fabric care category was driven by declines in unit volume in Europe, North America, and Greater China.",
        "source": "finqa"
    },
    {
        "query": "What information can be found under Item  into a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How much did Hasbro's net earnings attributable to Hasbro, Inc. decline in 2022 compared to 2021?",
        "response": "From $428.7 million to $203.5 million",
        "source": "finqa"
    },
    {
        "query": "What functionality does Enphase's bidirectional EV charger provide?",
        "response": "Vehicle-to-home and vehicle-to-grid functionality",
        "source": "finqa"
    },
    {
        "query": "What is Kroger's employment size and its view on human capital as of early 2023?",
        "response": "As of January 28, 2023, Kroger employed nearly 430,000 full- and part-time employees, focusing on creating supportive work environments and enhancing its diverse workforce.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of deferred net loss on derivatives included in accumulated other comprehensive income as of December 31, 2023?",
        "response": "$377 million",
        "source": "finqa"
    },
    {
        "query": "How is revenue recognized from impression-based and action-based ads?",
        "response": "Revenue from impression-based ads is recognized in the contracted period when the ads are delivered, and from action-based ads when the user takes the action contracted by the marketer.",
        "source": "finqa"
    },
    {
        "query": "What types of services does Schwab provide to the TD Depository Institutions under the 2023 IDA agreement?",
        "response": "Recordkeeping and support services",
        "source": "finqa"
    },
    {
        "query": "What new governmental requirements were announced by the U.S. government during the third quarter of fiscal year 2023 that affected NVIDIA?",
        "response": "During the third quarter of fiscal year 2023, the U.S. government announced new license requirements that impact certain exports to China (including Hong Kong and Macau) and Russia of some NVIDIA data center products.",
        "source": "finqa"
    },
    {
        "query": "How do the studios compete in the entertainment industry?",
        "response": "Studios compete for audiences with other major film and television studios, content creators, and various forms of entertainment, depending on the number of productions, their distribution success, marketing, and consumer response.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in the generic dispensing rate of the Health Services segment from 2022 to 2023?",
        "response": "0.2%",
        "source": "finqa"
    },
    {
        "query": "Why are some device sales revenue at AT&T not immediately recognized upon the device sale?",
        "response": "Some device sales revenue at AT&T is not immediately recognized upon the sale because these sales often include promotional discounts that are earned by customers over the contract term, which necessitates deferring and amortizing the revenue over the contract duration. Another reason is when sales involve installment payment options, where the complete revenue is recognized upfront at the sale point, but the cash receipt is deferred until the installment payments are made, necessitating the recording of a contract asset that is then amortized.",
        "source": "finqa"
    },
    {
        "query": "How does the company's relationship with its suppliers benefit its pricing strategy?",
        "response": "The company's relationships with suppliers allow them to obtain pricing that reflects the volume, certainty, and cost-effectiveness of their arrangements, enabling them to offer low prices to their customers.",
        "source": "finqa"
    },
    {
        "query": "How are changes to a company's uncertain tax positions evaluated?",
        "response": "Changes to a company's uncertain tax positions are evaluated periodically, considering changes in facts and circumstances such as new regulations or recent judicial opinions, as well as the status of audit activities by taxing authorities.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of stock-based compensation expense for cost of revenues in fiscal year 2023?",
        "response": "$499 million",
        "source": "finqa"
    },
    {
        "query": "How does YouTube contribute to users' experience according to the company's statement?",
        "response": "YouTube provides entertainment, information, and opportunities for people to learn something new.",
        "source": "finqa"
    },
    {
        "query": "By how much did the composite package yield increase for FedEx in 2023?",
        "response": "6 percent",
        "source": "finqa"
    },
    {
        "query": "What goals is GameStop focusing on after its initial transformation phase?",
        "response": "After its initial transformation phase, GameStop is focused on establishing omnichannel retail excellence, achieving profitability, and leveraging brand equity to support growth.",
        "source": "finqa"
    },
    {
        "query": "What are the roles and responsibilities of executive officers at the company?",
        "response": "Executive officers are responsible for the strategic leadership and operational management of the company, with their terms of office expiring on the date of the annual board meeting or when their successors are chosen and qualified.",
        "source": "finqa"
    },
    {
        "query": "How did SG&A expenses as a percentage of net sales change in 2023 compared to 2022?",
        "response": "SG&A expenses as a percentage of net sales increased by 20 basis points in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "How is the information for Item 3 on Legal Proceedings incorporated into the report?",
        "response": "The information for Item 3 on Legal Proceedings is incorporated by reference to Note 19 of the Notes to Consolidated Financial Statements, which is included in Item 8 of the report.",
        "source": "finqa"
    },
    {
        "query": "What are The Home Depot's goals for its future business operations as stated in the text?",
        "response": "provide the best customer experience in home improvement, extend their position as the low-cost provider, and be the most efficient investor of capital in home improvement",
        "source": "finqa"
    },
    {
        "query": "How are liabilities for loss contingencies from various sources such as claims and litigation recognized by a company?",
        "response": "Liabilities for loss contingencies like claims and litigation are recorded by a company when it is probable that a liability has been incurred and the amount can be reasonably estimated. If a loss is reasonably possible and the loss or range of loss can be reasonably estimated, the company discloses the possible loss. If a loss is probable and the loss or range of loss cannot be reasonably estimated, the company states that an estimate cannot be made.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Management's Discussion and Analysis in corporate financial reporting?",
        "response": "The purpose of Management's Discussion and Analysis (MD&A) in corporate financial reporting is to provide an overview that helps shareholders understand a company's business, strategies, current trends, and future prospects through discussions on financial statements, operations, liquidity, and capital resources.",
        "source": "finqa"
    },
    {
        "query": "What conditions must be met for a liability from a contingency to be accrued in the financial statements?",
        "response": "A liability from a contingency must be accrued in the financial statements when it is probable that a loss has been incurred and the amount of the loss can be reasonably estimated.",
        "source": "finqa"
    },
    {
        "query": "What are GM's strategies for environmental and emission regulations compliance?",
        "response": "GM complies with stringent emission standards by obtaining necessary certifications, adapting to new regulations like the Tier 4 Multipollant Rule, and exploring zero emission vehicles to meet increasing requirements.",
        "source": "finqa"
    },
    {
        "query": "What are the contents found on pages 163 to 309 in the document?",
        "response": "The contents on pages 163 to 309 include the Consolidated Financial Statements, Notes to the statements, and the report from PricewaterhouseCoopers LLP dated February 16, 2024.",
        "source": "finqa"
    },
    {
        "query": "What was the result of the Phase 3 OAKTREE trial of obeldesivir conducted by Gilead?",
        "response": "The Phase 3 OAKTREE trial of obeldesivir in non-hospitalized participants without risk factors for developing severe COVID-19 did not meet its primary endpoint of improvement in time to symptom alleviation, although the drug was well-tolerated in the study population.",
        "source": "finqa"
    },
    {
        "query": "How did Gilead Sciences perform financially in 2023 compared to 2022?",
        "response": "In 2023, Gilead Sciences' total revenues decreased by 1% to $27.1 billion compared to $27.28 billion in 2023, primarily due to lower Veklury sales, which were largely offset by higher HIV and Oncology sales.",
        "source": "finqa"
    },
    {
        "query": "What was the gross profit margin as a percent of net sales in fiscal 2022?",
        "response": "33.5%",
        "source": "finqa"
    },
    {
        "query": "What are the benefits included in the AMC Stubs A-List membership?",
        "response": "The AMC Stubs A-List membership includes admission to movies up to three times per week, premium offerings like IMAX, Dolby Cinema at AMC, and other PLF brands, and the ability to book tickets online in advance with reserved seating at no additional cost.",
        "source": "finqa"
    },
    {
        "query": "What was the total net sales in fiscal 2022?",
        "response": "$157.4 billion",
        "source": "finqa"
    },
    {
        "query": "What role did Debora Shoquist hold at JDS Uniphase Corp. from 2004 to 2007?",
        "response": "Debora Shoquist served as the Executive Vice President of Operations at JDS Uniphase Corp. from 2004 to 2007.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was used in investing activities by Enphase Energy, Inc. in 2023?",
        "response": "$366,355",
        "source": "finqa"
    },
    {
        "query": "What were the total net revenues for Starbucks Corporation in the fiscal year ending October 1, 2023?",
        "response": "The total net revenues for Starbucks Corporation in the fiscal year ending October 1, 2023, were $35,975.6 million.",
        "source": "finqa"
    },
    {
        "query": "What are the primary objectives of the Company's investment policy?",
        "response": "The primary objectives of the Company's investment policy are to preserve capital, maintain an acceptable degree of liquidity, and maximize yield within the constraint of low credit risk.",
        "source": "finqa"
    },
    {
        "query": "What role do medical directors play at outpatient dialysis centers, and what are their general qualifications?",
        "response": "Medical directors at outpatient dialysis centers maintain general supervision of the facilities and are usually board certified nephrologists. Their contracts specify duties and set compensation, often reflecting their professional qualifications, responsibilities, and the effort required.",
        "source": "finqa"
    },
    {
        "query": "What was Ford Motor Company's net income attributable for the year ending December 31, 2023?",
        "response": "$4,347 million",
        "source": "finqa"
    },
    {
        "query": "How does The Home Depot ensure associate engagement?",
        "response": "The Home Depot ensures associate engagement by continuously listening and acting on associate feedback, conducting several pulse check surveys throughout the year, and maintaining a digital associate engagement platform to fuel connections with co-workers and leaders.",
        "source": "finqa"
    },
    {
        "query": "What do AMD's mobile APUs combine for notebook PCs?",
        "response": "High levels of performance and efficiency",
        "source": "finqa"
    },
    {
        "query": "What amount did UnitedHealthcare's regulated subsidiaries pay as dividends to their parent companies in 2023?",
        "response": "$8.0 billion",
        "source": "finqa"
    },
    {
        "query": "What is the estimated loss for Goldman Sachs if there is a one basis point increase in credit spreads on derivatives as of December 2023?",
        "response": "$2 million",
        "source": "finqa"
    },
    {
        "query": "What were AT&T's total revenues, operations and support expenses, EBITDA, depreciation and amortization, and operating income for the year ended December 31, 2023?",
        "response": "In the year ended December 31, 2023, AT&T reported total revenues of $122,428 million, operations and support expenses of $80,190 million, EBITDA of $42,238 million, depreciation and amortization of $18,777 million, and an operating income of $23,461 million.",
        "source": "finqa"
    },
    {
        "query": "What were the key areas of cash use in financing activities for 2023?",
        "response": "In 2023, the main areas where cash was used in financing activities included the repurchase of common stock, payment of employee withholding taxes, and net proceeds from employee stock options and purchases under the employee stock purchase plan.",
        "source": "finqa"
    },
    {
        "query": "What competitive factors influence Chubb International's international operations?",
        "response": "The principal competitive factors affecting Chubb International's international operations include underwriting expertise, pricing, relative operating efficiency, product differentiation, producer relations, and policyholder service quality.",
        "source": "finqa"
    },
    {
        "query": "How are certain costs treated under the performance obligation before satisfaction?",
        "response": "Prior to the satisfaction of a performance obligation, certain costs are deferred as contract costs and are amortized systematically consistent with the pattern of transfer of the related goods and services.",
        "source": "finqa"
    },
    {
        "query": "What was the total commercial credit exposure by industry for Bank of America as of December 31, 2023, and how does it compare to 2022?",
        "response": "Bank of America's total commercial credit exposure by industry increased to $1,214,112 million as of December 31, 2023, from $1,200,213 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "How is diluted earnings per share calculated for Gilead?",
        "response": "Diluted earnings per share for Gilead is calculated by dividing the net income attributable to Gilead by the weighted-average number of shares of common stock and other dilutive securities outstanding during the period.",
        "source": "finqa"
    },
    {
        "query": "Where was the consolidated Multi-District Litigation proceeding held regarding the airline capacity antitrust litigation?",
        "response": "The consolidated Multi-District Litigation proceeding was held in the U.S. District Court for the District of Columbia.",
        "source": "finqa"
    },
    {
        "query": "How much was the pre-tax restructuring expense for the Orthopaedics franchise in fiscal year 2023?",
        "response": "$0.3 billion",
        "source": "finqa"
    },
    {
        "query": "What constitutional rights does Janssen claim the Inflation Reduction Act violates?",
        "response": "First Amendment and the Fifth Amendment",
        "source": "finqa"
    },
    {
        "query": "What are the objectives of the company's cash management policy?",
        "response": "Maintaining the availability of liquidity and minimizing operational costs.",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of short-term and long-term lease obligations as of September 30, 2023?",
        "response": "$12 million and $421 million",
        "source": "finqa"
    },
    {
        "query": "How did the free cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations change from 2022 to 2023?",
        "response": "The free cash flow less equipment finance leases and principal repayments of all other finance leases and financing obligations changed from -$12,786 million in 2022 to $35,549 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "Where does the report detail the Report of Independent Registered Public Accounting Firm and the Financial Statements?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What portion of the document includes the \"Glossary of Terms and Acronyms\"?",
        "response": "The \"Glossary of Terms and Acronyms\" is included on pages 315-321.",
        "source": "finqa"
    },
    {
        "query": "How much did the stock-based compensation cost for Costco in the fiscal year ending on September 3, 2023?",
        "response": "The stock-based compensation for Costco in the fiscal year ending on September 3, 2023, was 778 million dollars.",
        "source": "finqa"
    },
    {
        "query": "What are the company's goals for gender representation?",
        "response": "The company aspires to achieve equal gender representation globally and at key management and leadership levels.",
        "source": "finqa"
    },
    {
        "query": "What were the short-term and long-term credit ratings of the company as of June 30, 2023?",
        "response": "As of June 30, 2023, the company's short-term credit ratings were P-1 (Moody's) and A-1+ (Standard & Poor's), and the long-term credit ratings were Aa3 (Moody's) and AA- (Standard & Poor's).",
        "source": "finqa"
    },
    {
        "query": "What was the net income of Advanced Micro Devices, Inc. for the fiscal year ended December 30, 2023?",
        "response": "$854 million",
        "source": "finqa"
    },
    {
        "query": "What was the revenue change for CenterWell's Home Solutions from 2022 to 2023?",
        "response": "Decreased by $991 million, or 42.5%",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in the cost of products sold as a percent to sales in 2023?",
        "response": "The cost of products sold increased as a percent to sales due to factors such as commodity inflation and unfavorable product mix, among others.",
        "source": "finqa"
    },
    {
        "query": "When does the Company's fiscal year end?",
        "response": "The last Saturday of September.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the Company's ability to establish Standalone Selling Prices (SSP) based on observable prices?",
        "response": "The Company can establish SSP based on observable prices when it has access to prices of products or services sold or priced separately in comparable circumstances to similar customers.",
        "source": "finqa"
    },
    {
        "query": "What are some examples of direct-to-consumer streaming services that Comcast competes with?",
        "response": "Disney+ and Netflix",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in e-commerce sales comparable excluding the impact of changes in foreign-currency and gasoline prices in 2023?",
        "response": "E-commerce sales comparable excluding the impact of changes in foreign-currency and gasoline prices decreased by 5% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What change occurred in the quarterly cash dividend in April 2023?",
        "response": "The quarterly cash dividend increased by 13% in April 2023.",
        "source": "finqa"
    },
    {
        "query": "What sections of IBM's 2023 Annual Report to Stockholders are referenced in Item 8 regarding Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What was the total value of current liabilities for the company as of August 27, 2022?",
        "response": "$8,588,393",
        "source": "finqa"
    },
    {
        "query": "How much does the AMC Stubs A-List membership cost per month depending on the geographic market?",
        "response": "The AMC Stubs A-List membership costs between $19.95 to $24.95 per month, depending on the geographic market.",
        "source": "finqa"
    },
    {
        "query": "What is the principle behind the LIFO ('Last In, First Out') inventory valuation method used by some business segments?",
        "response": "The LIFO inventory valuation method operates on the principle that the last items of inventory purchased are the first to be sold. It commonly applies in scenarios where businesses face increasing prices, as it allows for higher cost of goods sold and lower taxable income during inflationary periods.",
        "source": "finqa"
    },
    {
        "query": "How does the company maintain high standards of product quality and safety?",
        "response": "The company has dedicated quality assurance and engineering resources focused on establishing criteria and overseeing compliance with safety, quality, and performance standards for their private branded products.",
        "source": "finqa"
    },
    {
        "query": "What was the nominal par value per share of Garmin Ltd. in U.S. dollars as of December 30, 2023?",
        "response": "$0.10",
        "source": "finqa"
    },
    {
        "query": "What are Chevron's gross and net acres in Asia as of December 31, 2023?",
        "response": "Gross: 20,825 thousand acres, Net: 10,475 thousand acres",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of GM's collaboration efforts at their Global Technical Center in Warren, Michigan?",
        "response": "To maximize global economies of scale and meet customer requirements by integrating and developing global products and their components.",
        "source": "finqa"
    },
    {
        "query": "What steps has Intuit taken to integrate a hybrid work model post-COVID-19 pandemic?",
        "response": "Post-COVID-19 pandemic, Intuit has adopted a hybrid work model, combining in-person collaboration with the flexibility of virtual work. They empower teams to decide the appropriateness of in-person work and expect some time to be spent working on campus to enhance connection and productivity.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount ordered for the Company and other defendants to pay in the judgment from the opioid dispensing claim trial concluded on August 17, 2022?",
        "response": "$651 million",
        "source": "finqa"
    },
    {
        "query": "What was the financial outcome of the sale of a 60% interest in Gentiva Hospice for Humana in 2022?",
        "response": "Humana recognized a pre-tax gain of $237 million net of transaction costs from the sale of a 60% interest in Gentiva Hospice in 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the essential elements covered in the onboarding training for new hires at JPMorgan Chase?",
        "response": "The onboarding training for new hires at JPMorgan Chase covers compliance with the Firm’s Code of Conduct, Firm policies, and standards, including those related to cybersecurity.",
        "source": "finqa"
    },
    {
        "query": "How does the company record cooperative advertising incentives?",
        "response": "Cooperative advertising incentives payable to dealers and distributors are recorded as reductions of revenue unless the company obtains proof of a distinct advertising service, in which case the incentive is recorded as advertising expense.",
        "source": "finqa"
    },
    {
        "query": "What are Nike's strategies for maintaining competitiveness in the athletic footwear, apparel, and equipment industry?",
        "response": "Nike maintains competitiveness through emphasizing product attributes like quality and innovation, engaging with consumers via marketing, social media, and endorsements, and ensuring effective product sourcing and distribution.",
        "source": "finqa"
    },
    {
        "query": "How does the company ensure diversity, equity, and inclusion in its workplace?",
        "response": "The company has diversity, equity, and inclusion aspirations, conducts annual pay equity analyses, and supports employee-led inclusion networks, among other initiatives.",
        "source": "finqa"
    },
    {
        "query": "What is the status of the California statute related to net neutrality?",
        "response": "The California statute concerning net neutrality is now in effect.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did net revenues in the Wizards of the Coast & Digital Gaming segment increase in 2023 compared to 2022?",
        "response": "10%",
        "source": "finqa"
    },
    {
        "query": "Where in the Annual Report on Form 10-K are the consolidated financial statements and accompanying notes located following their listing?",
        "response": "The consolidated financial statements and accompanying notes are located immediately following Part IV of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "By how much did research and development expenses increase in the fiscal year ending December 30, 2023?",
        "response": "8%",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of U.S. government and agency securities as of June 30, 2022?",
        "response": "The fair value of U.S. government and agency securities as of June 30, 2022 was $61,302 million.",
        "source": "finqa"
    },
    {
        "query": "How many new stores did the company open in fiscal 2023?",
        "response": "197",
        "source": "finqa"
    },
    {
        "query": "What critical accounting estimates most significantly affect the impairment calculation of long-lived assets?",
        "response": "Future cash flow projections are the most significant estimates affecting the impairment calculation of long-lived assets. These projections include assumptions on variables such as inflation, the economy, and market competition.",
        "source": "finqa"
    },
    {
        "query": "What were the major strategic changes Enphase Energy implemented in response to the slowdown in demand for their products in 2023?",
        "response": "In response to decreased demand in 2023, Enphase Energy initiated a restructuring plan which included reducing the global workforce by approximately 10%, ceasing operations at specific manufacturing locations in Romania and Wisconsin, and resizing other sites to align with expected demand.",
        "source": "finqa"
    },
    {
        "query": "What were the total revenues from unaffiliated customers in 2021?",
        "response": "$285,273",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources the company expects to use to meet its working capital needs?",
        "response": "The company expects to primarily use available cash, cash flows from operations, and potentially issuing commercial be paper or borrowing under its revolving credit agreement to meet its working income needs.",
        "source": "finqa"
    },
    {
        "query": "What was the nature of the relationship between Ernst & Young LLP and Palantir Technologies Inc. as stated in their financial audit report?",
        "response": "Ernst & Young LLP served as the independent auditor for Palantir Technologies Inc., and their audits were conducted in accordance with the standards of the Public Company Accounting Oversight Board (United States). They have served as the Company’s auditor since 2008.",
        "source": "finqa"
    },
    {
        "query": "When did Walmart open its first Sam's Club and supercenter?",
        "response": "Walmart opened its first Sam's Club in 1983 and its first supercenter in 198g.",
        "source": "finqa"
    },
    {
        "query": "What are the technological features of the GeForce RTX 40 Series GPUs?",
        "response": "The GeForce RTX 40 Series GPUs feature third generation RTX technology, third generation NVIDIA DLSS, and fourth generation Tensor Cores, providing up to 4X the performance of the previous generation.",
        "source": "finqa"
    },
    {
        "query": "How much did Interest Income increase in 2023 compared to the previous year?",
        "response": "Interest Income increased by $535 million in 2023 compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "How is Hewlett Packard addressing competition in the enterprise IT infrastructure market?",
        "response": "Hewlett Packard addresses competition in the enterprise IT infrastructure market through delivering superior products, high-value technology support services, and differentiated integrated solutions that combine infrastructure, software, and services capabilities.",
        "source": "finqa"
    },
    {
        "query": "What is the primary use of Global Business Services within Procter & Gamble?",
        "response": "Global Business Services provides scaled services in technology, process, and data tools to enable the SBUs, the EMs, and CF to better serve consumers and customers. It is responsible for delivering world-class services and solutions that drive value for P&G.",
        "source": "finqa"
    },
    {
        "query": "What were the company's contributions to its Canadian Retirement Income Plan (CRIP) and the U.S. Retirement Income Plan (USRIP) during the twelve months ended December 31, 2023?",
        "response": "No contributions were made to the USRIP, and the liabilities under the CRIP were settled in the third quarter of 2022.",
        "source": "finqa"
    },
    {
        "query": "Where are the majority of NIKE's footwear and apparel products manufactured?",
        "response": "The majority of NIKE's footwear and apparel products are manufactured outside the United States.",
        "source": "finqa"
    },
    {
        "query": "What is the main purpose of the Hilton Honors program?",
        "response": "The main purpose of the Hilton Honors program is to generate significant repeat business by rewarding guests with points for each stay, which can be redeemed for free or discounted room nights and other goods and services.",
        "source": "finqa"
    },
    {
        "query": "What was the total provision for income taxes recorded by the Company for the year ended December 31, 2023?",
        "response": "The total provision for income taxes recorded by the Company for the year ended December 31, 2023, was $19.7 million.",
        "source": "finqa"
    },
    {
        "query": "What are the net lease obligations for operating and finance leases as of 2024 according to the disclosed financial data?",
        "response": "The net lease obligations are $14,301 million for operating leases and $5,410 million for finance leases.",
        "source": "finqa"
    },
    {
        "query": "What is the primary focus of Kroger's value creation model?",
        "response": "To deliver consistent and attractive total shareholder return",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the increase in interest income?",
        "response": "The increase in interest income was primarily driven by higher interest rates and growth in revolving loan balances.",
        "source": "finqa"
    },
    {
        "query": "How does HP recognize revenue from the sale of equipment under sales-type leases?",
        "response": "HP records revenue from the sale of equipment under sales-type leases as revenue at the commencement of the lease.",
        "source": "finqa"
    },
    {
        "query": "What was the diluted net income per share for Class C in 2023?",
        "response": "$5.80",
        "source": "finqa"
    },
    {
        "query": "What is ERLEADA used for?",
        "response": "Tablet reduction.",
        "source": "finqa"
    },
    {
        "query": "What is the balance at the end of the year for Comcast's Total Equity in 2023?",
        "response": "$81,627",
        "source": "finqa"
    },
    {
        "query": "What criteria based framework was used for evaluating The Kroger Co.'s internal control over financial reporting as of January 28, 2023?",
        "response": "Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).",
        "source": "finqa"
    },
    {
        "query": "What is the expiration date for the federal research and development tax credits as of 2023?",
        "response": "The federal research and development tax credits will begin to expire in 2038 if not utilized.",
        "source": "finqa"
    },
    {
        "query": "What are the conditions for avoiding future impairment of the Asia Pacific reporting unit?",
        "response": "Avoidance of a future impairment for the Asia Pacific reporting unit will depend on continued growth during current economic conditions and effective execution on initiatives to grow revenue and operating margin and manage expenses prudently.",
        "source": "finqa"
    }
]