[
    {
        "query": "What was the total amount of cash used for acquisitions by UnitedHealthcare in 2023?",
        "response": "$10,136 million",
        "source": "finqa"
    },
    {
        "query": "What strategies is the company employing to enhance its competitiveness in a digital environment?",
        "response": "The company is continuously strengthening its capabilities in marketing and innovation, increasing investments in e-commerce, offering more package sizes suitable for online sales, and shifting consumer and trade promotions to digital.",
        "source": "finqa"
    },
    {
        "query": "What was the net interest revenue of The Charles Schwab Corporation in 2023?",
        "response": "$9,427 million",
        "source": "finqa"
    },
    {
        "query": "What is the maximum additional exclusivity period granted by the FDA for approved drugs that undergo pediatric testing?",
        "response": "The maximum additional exclusity period granted by the FDA for approved drugs that undergo pediatric testing is six months, which is added to the term of data protection, orphan drug exclusivity, and, for products other than biologics, to the term of any relevant and non-expired patents.",
        "source": "finqa"
    },
    {
        "query": "What are some of the initiatives managed by Visa for supporting underrepresented communities?",
        "response": "Visa manages initiatives such as She’s Next, Empowered by Visa, and the Africa Fintech Accelerator Program to support underrepresented communities.",
        "source": "finqa"
    },
    {
        "query": "What financial impact would a 1% increase in medical cost PMPM trend factors have on medical costs payable for the most recent two months as of December 31, 2023?",
        "response": "An increase of $1,128 million.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the establishment of valuation allowances for deferred tax assets?",
        "response": "Valuation allowances are established based on the likelihood of realizing deferred tax assets, considering the evidence of historical taxable income, projected future taxable income, reversals of temporary differences, and tax planning strategies.",
        "source": "finqa"
    },
    {
        "query": "What are the terms of the revolving credit facility agreement with JPMorgan as of December 31, 2023?",
        "response": "The revolving credit facility agreement includes an interest rate based on the SOFR plus 1.475%, a commitment fee of 0.175% per year for unused amounts, and several financial covenants including maintaining a total leverage ratio of less than 3.0x and a consolidated fixed charge coverage ratio of greater than 1.5x.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in sales of STELARA in 2023?",
        "response": "patient mix, market growth, and continued strength in Inflammatory Bowel Disease",
        "source": "finqa"
    },
    {
        "query": "What were the expenses related to the fair value of restricted stock units (RSUs) and stock options for the years 2022, 2021, and 2020?",
        "response": "The expenses were $110.4 million, $79.9 million, and $83.9 million for the years 2022, 2021, and 2020, respectively.",
        "source": "finqa"
    },
    {
        "query": "What were the primary factors contributing to the increase in Americas net revenue in 2022?",
        "response": "The increase in Americas net revenue in 2022 was primarily due to an increase in comparable sales, which rose by 28% or 29% on a constant dollar basis, and a $296.9 million increase in non-comparable sales, mainly from company-operated stores that were opened or significantly expanded since 2021.",
        "source": "finqa"
    },
    {
        "query": "What regulations are in place regarding commercial content during children's programming on cable and broadcast networks?",
        "response": "Federal regulations limit the amount of commercial content that may be shown during children’s programs on cable networks, broadcast networks and local broadcast television stations for audiences 12 years and under.",
        "source": "finqa"
    },
    {
        "query": "What factors impact American Express's ability to grow internationally?",
        "response": "American Express's ability to grow internationally can be impacted by regulation and business practices that favor local competitors, the ability to tailor products to local markets, and the success of network partners in acquiring card members and merchants. Political or economic instability, regional conflicts, and local experience and relationships also play significant roles.",
        "source": "finqa"
    },
    {
        "query": "How does Microsoft intend to use AI to support small and large businesses according to the text?",
        "response": "Microsoft is creating platforms and tools powered by artificial intelligence (AI) that deliver better, faster, and more effective solutions to support small and large business competitiveness.",
        "source": "finqa"
    },
    {
        "query": "Where is Caterpillar Insurance Co. Ltd. domiciled, and under what regulatory authority does it operate?",
        "response": "Caterpillar Insurance Co. Ltd. is domiciled in Bermuda and regulated by the Bermuda Monetary Authority.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in worldwide Daily Active People (DAP) from December 2022 to December 2023?",
        "response": "Worldwide Daily Active People increased by 8% from December 2022 to December 2023.",
        "source": "finqa"
    },
    {
        "query": "Which companies accounted for the majority of AbbVie's pharmaceutical product sales in the United States in 2023?",
        "response": "In 2023, McKesson Corporation, Cardinal Health, Inc., and AmerisourceBergen Corporation accounted for substantially all of AbbVie's pharmaceutical product sales in the United States.",
        "source": "finqa"
    },
    {
        "query": "How many patents and trademark registrations does Garmin hold as of January 5, 2024?",
        "response": "As of January 5, 2024, Garmin holds over 1,900 patents and more than 1,160 trademark registrations worldwide.",
        "source": "finqa"
    },
    {
        "query": "How did the voice connections for Consumer VoIP from 2021 to 2023 change?",
        "response": "Consumer VoIP connections decreased from 2,736 in 2021 to 1,953 in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did interest rate futures and options revenue increase in 2023 compared to 2022?",
        "response": "2%",
        "source": "finqa"
    },
    {
        "query": "What award did Delta Air Lines receive in January 2024 for operational excellence?",
        "response": "The Cirium Platinum Award",
        "source": "finqa"
    },
    {
        "query": "What method is used for determining credit loss on securities at the company?",
        "response": "Credit loss on securities is determined by comparing the present value of expected future cash flows of the security to its amortized cost basis, limited to the amount by which the fair value is less than the amortized cost basis.",
        "source": "finqa"
    },
    {
        "query": "What types of laws and regulations govern the international operations of a company?",
        "response": "A company's international operations are governed by diverse regulations including anti-corruption, economic sanctions, privacy, insurance, tax, and trade laws, corporate governance, consumer protection, investment laws, and requirements for local participation in an insurer's ownership.",
        "source": "finqa"
    },
    {
        "query": "How is goodwill assigned to reporting units?",
        "response": "Goodwill is assigned to the reporting units based on prior business combinations related to the brands.",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in other (income) expense, net for NIKE in fiscal 2023 compared to fiscal 2022?",
        "response": "The increase in other (income) expense, net for NIKE in fiscal 2023 compared to fiscal 2022 was primarily due to a net favorable change in foreign currency conversion gains and losses and a one-time charge related to the deconsolidation of NIKE's Russian operations recognized in the prior year.",
        "source": "finqa"
    },
    {
        "query": "What separates the main content of the report from the financial statements and supplementary data?",
        "response": "The signature pages",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in room expenses at Las Vegas Sands Corp. in 2023?",
        "response": "The increase in room expenses at Las Vegas Sands Corp. in 2023 was primarily due to higher costs associated with the renovated and expanded suites and rooms at The Londoner Macao and the new and elevated suites and rooms introduced at Marina Bay Sands during the year.",
        "source": "finqa"
    },
    {
        "query": "What are some of the critical accounting policies that affect financial statements?",
        "response": "Some critical accounting policies that affect financial statements include Revenue Recognition, Business Combinations, Goodwill, Acquired Intangible Assets, and Accounting for Income Taxes, which involve significant judgments and estimates in financial reporting.",
        "source": "finqa"
    },
    {
        "query": "What methodology does FedEx use to allocate net operating costs from the FedEx Services segment to other segments?",
        "response": "FedEx allocates net operating costs from the FedEx Services segment to other segments based on metrics such as relative revenue or estimated services provided.",
        "source": "finqa"
    },
    {
        "query": "What is the location of AT&T Inc.'s principal executive offices?",
        "response": "The principal executive offices of AT&T Inc. are located at 208 S. Akard St., Dallas, Texas, 75202.",
        "source": "finqa"
    },
    {
        "query": "How did the Company's Entertainment segment finance its television and film productions in 2023?",
        "response": "In 2023, the Company's Entertainment segment financed its television and film productions through production financing.",
        "source": "finqa"
    },
    {
        "query": "What is the focus of HPE's Intelligent Edge business segment?",
        "response": "The focus of HPE's Intelligent Edge business segment is to provide secure edge-to-cloud connectivity solutions supporting environments like working from anywhere, mobility, and IoT device connectivity.",
        "source": "finqa"
    },
    {
        "query": "What program offers Chipotle employees access to tuition-free degrees at select universities?",
        "response": "The Debt-Free Degree program.",
        "source": "finqa"
    },
    {
        "query": "What pages contain the financial Statements and Supplementary Data in IBM's 2023 Annual Report?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What were the total assets at fair value on December 31, 2023?",
        "response": "$71,921 million",
        "source": "finqa"
    },
    {
        "query": "What specific matters did the CFPB investigate concerning Equifax?",
        "response": "The CFPB investigated Equifax's consumer disputes process, code issue impacting credit scores, and data accuracy and dispute handling at the Workforce Solutions business unit.",
        "source": "finqa"
    },
    {
        "query": "What is the relationship between Part IV and the consolidated financial statements in the Annual Report on Form 10-K?",
        "response": "In the Annual Report on Form 10-K, Part IV includes the consolidated financial statements as a section immediately following it, indicating a sequential layout where Part IV is directly followed by the financial statements.",
        "source": "finqa"
    },
    {
        "query": "What information is mentioned under Item 8 in a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the actuarial gain during the year ended December 31, 2022?",
        "response": "The primary reason for the actuarial gain during the year ended December 31, 2022, was the increases in the discount rate assumptions.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of current liabilities listed for the company in the financial document?",
        "response": "$81,814 million",
        "source": "finqa"
    },
    {
        "query": "How many global members did AMC's loyalty programs have as of December 31, 2023?",
        "response": "As of December 31, 2023, AMC had approximately 32 million member households enrolled in their loyalty programs.",
        "source": "finqa"
    },
    {
        "query": "Where can details about the company's material pending legal proceedings be found in their reporting?",
        "response": "Details about the company's material pending legal proceedings can be found in Legal Matters in Note 10 of the Notes to Consolidated Financial Statements, located in Part II, Item 8 of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What method is used to calculate gains and losses on short-term investments in the company's financial policies?",
        "response": "Realized gains and losses on short-term investments are calculated based on the specific identification method. Unrealized gains and losses are recorded in accumulated other comprehensive income (loss) in stockholders’ equity, net of tax.",
        "source": "finqa"
    },
    {
        "query": "How did lower gasoline prices affect net sales in 2023?",
        "response": "Lower gasoline prices negatively impacted net sales by $1,592 in 2023.",
        "source": "finqa"
    },
    {
        "query": "How are long-lived and intangible assets evaluated for impairment?",
        "response": "These assets are reviewed for impairment if potential impairment indicators exist, and the assessment involves estimating future undiscounted cash flows attributable to the asset groups.",
        "source": "finqa"
    },
    {
        "query": "How is the provision for income taxes determined for the entity?",
        "response": "The provision for income taxes is determined through significant judgment, the use of estimates, and the interpretation and application of complex tax laws.",
        "source": "finqa"
    },
    {
        "query": "What are the reasons for excluding employer payroll taxes related to stock-based compensation from some financial measures?",
        "response": "Employer payroll taxes related to stock-based compensation are excluded from certain financial measures because they are difficult to predict and outside of the company's control.",
        "source": "finqa"
    },
    {
        "query": "What was the sales returns reserve as a percentage of annual net trade sales for the Company during the fiscal years 2023, 2022, and 2021?",
        "response": "Less than 1.0%",
        "source": "finqa"
    },
    {
        "query": "What was the total amount attributed to Goodwill in the acquisition of Nuance Communications, Inc. as reported by the company?",
        "response": "The total amount attributed to Goodwill in the acquisition of Nuance Communications, Inc. was $16,326 million.",
        "source": "finqa"
    },
    {
        "query": "What recognition did Bill Meaney receive from Comparably in 2023?",
        "response": "Bill Meaney was named among the best CEOs for diversity in a large company.",
        "source": "finqa"
    },
    {
        "query": "What method do we use to value privately held equity and debt securities in the absence of market data?",
        "response": "Valuations of privately held securities are performed using significant unobservable inputs or data in an inactive market, applying valuation methods like the market approach and option pricing models adjusted for the specific rights and preferences of the securities held.",
        "source": "finqa"
    },
    {
        "query": "Which section of the document discusses Financial Statements and Supplementary Data?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What method does General Motors use to promote their products in the automotive market?",
        "response": "General Motors promotes their products using several methods including dealer, retail, and fleet incentives like customer rebates and finance rate support.",
        "source": "finqa"
    },
    {
        "query": "How does NIKE expect the new tax law changes from the Inflation Reduction Act of 2022 to impact its financial statements?",
        "response": "NIKE does not expect the tax law changes from the Inflation Reduction Act of 2022 to have a material impact on its financial statements.",
        "source": "finqa"
    },
    {
        "query": "Under which item can the consolidated financial statements including details about legal matters be found?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What potential impact could changes in government subsidies or economic incentives have on the business?",
        "response": "Changes in government subsidies or economic incentives could have an adverse effect on the business and results of operations.",
        "source": "finqa"
    },
    {
        "query": "What percentage did Google Cloud revenues increase by in 2023?",
        "response": "26%",
        "source": "finqa"
    },
    {
        "query": "What type of products and services are included in the More Personal Computing segment?",
        "response": "The More Personal Computing segment includes products and services like Windows, including Windows OEM licensing and other Windows offerings, devices such as Surface and HoloLens, gaming including Xbox hardware and services, and Search and news advertising.",
        "source": "finqa"
    },
    {
        "query": "In the context of the report, what method is used to provide information about Legal proceedings in Item 3?",
        "response": "The method used to provide information about Legal proceedings in Item 3 is by incorporating the information by reference to another section, namely Note 19 in the Notes to Consolidated Financial Statements in Item 8.",
        "source": "finqa"
    },
    {
        "query": "How is the residual value in the income approach valuation defined?",
        "response": "The residual value represents the present value of projected cash flows beyond the discrete projection period.",
        "source": "finqa"
    },
    {
        "query": "What caused the increase in other expenses during 2023?",
        "response": "The increase in other expenses during 2023 was primarily due to costs associated with higher procurement volume from purchasing operations, including for properties outside of our system that participate in our purchasing programs.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock were issued in both 2022 and 2023?",
        "response": "4,009.2 thousand shares",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in Compute & Networking revenue from fiscal year 2022 to 2023?",
        "response": "The revenue for Compute & Networking increased by 36% from fiscal year 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What were the total capital expenditures reported for fiscal years 2021 and 2022?",
        "response": "$62.0 million for 2021 and $60.0 million for 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the net proceeds from the offerings?",
        "response": "The net proceeds from the offerings are used for general corporate purposes such as capital expenditures, share repurchases, dividend payments, acquisitions, or investments.",
        "source": "finqa"
    },
    {
        "query": "How many employees did the company have at the end of 2023, and how many of these were engaged in research and development activities?",
        "response": "The company employed approximately 43,000 people, of which about 10,000 were engaged in research and development activities.",
        "source": "finqa"
    },
    {
        "query": "What are the key components of Schwab's risk management program?",
        "response": "Schwab's risk management program comprises risk identification and assessment, risk response, risk measurement and monitoring, and risk reporting and escalation.",
        "source": "finqa"
    },
    {
        "query": "What was the pre-tax net favorable prior period development for 2022 and what factors contributed to it?",
        "response": "The pre-tax net favorable prior period development for 2022 was $876 million, which included adverse development of $155 million for molestation claims and $113 million related to legacy asbestos and environmental exposures.",
        "source": "finqa"
    },
    {
        "query": "How much was Peloton Interactive, Inc.'s net loss for the period ending June 30, 2021?",
        "response": "The net loss for Pel the period ending June 30, 2021, was $2,827.7 million.",
        "source": "finqa"
    },
    {
        "query": "What was the consolidated net income attributable to Walmart in the fiscal years 2023, 2022, and 2021?",
        "response": "$11,680 million for 2023, $13,673 million for 2022, and $13,510 million for 2021.",
        "source": "finqa"
    },
    {
        "query": "What services does the company provide to enhance customer convenience across the U.S. and Canada?",
        "response": "The company provides installation services and tool and equipment rentals.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Management Leadership for Tomorrow’s Black Equity at Work Certification Program that Chipotle participates in?",
        "response": "The program establishes a comprehensive measurement system and accelerates progress toward Black equity internally and externally by supporting Black equity within business partners.",
        "source": "finqa"
    },
    {
        "query": "What total amount of assets were measured at fair value as of January 31, 2022, and how is this divided across the fair value hierarchy levels?",
        "response": "As of January 31, 2022, the total assets measured at fair value were $8,146 million, with $1,796 million categorized under Level 1 and $6,350 million categorized under Level 2.",
        "source": "finqa"
    },
    {
        "query": "What are the primary methods American Express uses to manage foreign exchange risk?",
        "response": "American Express manages foreign exchange risk through spot transactions and the use of hedged foreign exchange forward contracts, aimed at offsetting the impacts from currency movements in respective periods.",
        "source": "finqa"
    },
    {
        "query": "By what percentage and amount did the research and development expenses increase in 2023 compared to 2022?",
        "response": "Research and development expenses increased by $44.9 million, or 12%, for the year ended December 31, 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the maximum potential exclusivity period mentioned for pharmaceutical products under regulatory approval?",
        "response": "14 years",
        "source": "finqa"
    },
    {
        "query": "How large is Berkshire Hathaway’s workforce, and what percentage of it is based in the United States?",
        "response": "Berkshire Hathaway and its subsidiaries employed approximately 396,500 people worldwide at the end of 2023, with approximately 80% of them based in the United States.",
        "source": "finqa"
    },
    {
        "query": "What is the remaining authorized amount for share repurchases as of December 31, 2023, and the amount newly authorized in January 2024?",
        "response": "As of December 31, 2023, $30.93 billion was still available for share repurchases, and an additional $50 billion was authorized in January 2024.",
        "source": "finqa"
    },
    {
        "query": "How did HP's long-term debt change from 2022 to 2023?",
        "response": "HP's long-term debt decreased from $10,796 million in 2022 to $9,254 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the value of private equity positions in equity securities as of December 2023?",
        "response": "$12.1 billion",
        "source": "finqa"
    },
    {
        "query": "How did the interest expense in 2023 compare to 2022?",
        "response": "It decreased by $126 from $14,168 in 2022 to $14,042 in 2023.",
        "source": "finqa"
    },
    {
        "query": "What new initiative did Microsoft launch in June 2023?",
        "response": "In June 2023, Microsoft launched a new AI Skills Initiative aimed at teaching people how to utilize the power of AI.",
        "source": "finqa"
    },
    {
        "query": "How does the 'Gaming' group contribute to the company's strategy?",
        "response": "The 'Gaming' group contributes to the company's strategy by developing hardware, content, and services across various platforms to help grow the user base through game experiences and social interaction.",
        "source": "finqa"
    },
    {
        "query": "How much did Kroger invest in associate wages since 2018?",
        "response": "$1.9 billion",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in cost of revenue as a percentage of total net revenue from fiscal year 2022 to 2023?",
        "response": "The cost of revenue as a percentage of total net revenue decreased by 3 percent from fiscal year 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the global presence of Lubrizol?",
        "response": "Lubrizol operates globally through more than 100 offices, laboratories, production facilities, and warehouses across North America, Europe, Asia, and South America.",
        "source": "finqa"
    },
    {
        "query": "To whom does the Chief Compliance Officer report in the described company?",
        "response": "The Chief Compliance Officer reports directly to the Chief Executive Officer (CEO) and the Chair of the Compliance and Quality Committee of our Board.",
        "source": "finqa"
    },
    {
        "query": "What was AMC's cash and cash equivalents at the end of 2023?",
        "response": "At the end of 2023, AMC had cash and cash equivalents of approximately $884.3 million.",
        "source": "finqa"
    },
    {
        "query": "What actions does the company take in response to a reinsurer's insolvency or regulatory supervision regarding reinsurance recoverables?",
        "response": "Upon initial notification of an insolvency, the company typically recognizes an expense for a substantial portion of all balances outstanding through a combination of write-offs of recoverable balances and increases to the valuation allowance for uncollectible reinsurance. When a reinsurer is under regulatory supervision, the company generally recognizes a default factor by estimating an expected recovery on all balances outstanding, net of collateral.",
        "source": "finqa"
    },
    {
        "query": "Why was there a net outflow of cash in financing activities in fiscal 2022?",
        "response": "There was a net outflow of cash in financing activities in fiscal 2022 primarily due to the settlement of stock-based awards.",
        "source": "finqa"
    },
    {
        "query": "Is there specific information provided under Item 8 of the document?",
        "response": "Yes, it provides information on Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "In which item of the report can the details of Legal proceedings be found by referencing?",
        "response": "The details of Legal proceedings can be found by referencing Item 8, specifically in the Notes to Consolidated Financial Statements under Note 19.",
        "source": "finqa"
    },
    {
        "query": "What was the FFO (Nareit) for the year ended December 31, 2023?",
        "response": "$517,200",
        "source": "finqa"
    },
    {
        "query": "What was the increase in estimated ultimate liabilities for retroactive reinsurance contracts in the fourth quarter of 2023?",
        "response": "The estimated ultimate liabilities for prior years' retroactive reinsurance contracts increased by $1.1 billion in the fourth quarter of 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of Schwab's holdings at the end of 2022?",
        "response": "$16.4 billion",
        "source": "finqa"
    },
    {
        "query": "How is revenue recognized for Online-Hosted Service Games by the company?",
        "response": "Revenue from Online-Hosted Service Games is recognized as the service is provided, considering it as one distinct performance obligation related to online hosting.",
        "source": "finqa"
    },
    {
        "query": "What amount of deferred revenues and liability for guest loyalty program was reported as of December 31, 2023?",
        "response": "Deferred revenues of $769 million and a liability for guest loyalty program of $2,732 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net cash provided by operating activities from 2022 to 2023?",
        "response": "15.8%",
        "source": "finqa"
    },
    {
        "query": "How has Krover managed its climate impact as part of its ESG strategy?",
        "response": "Kroger has focused on operational efficiency, renewable energy, and new technologies to manage climate impacts, aligning its goals with the Paris Agreement and resetting GHG emissions targets according to Science Based Targets initiative.",
        "source": "finqa"
    },
    {
        "query": "What was the pre-tax impairment charge for definite-lived intangible assets in the consolidated statement of earnings for the third quarter of 2022?",
        "response": "$770 million",
        "source": "finqa"
    },
    {
        "query": "How many Chipotle restaurants does the company operate internationally as of December 31, 2023?",
        "response": "As of December 31, 2023, Chipotle operates 66 international restaurants.",
        "source": "finqa"
    },
    {
        "query": "How much did the unrecognized tax benefits total as of March 31, 2023, and what impact would they have on the effective tax rate if realized?",
        "response": "$867 million; approximately $395 million of these benefits would affect the effective tax rate if realized.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in revenue for UnitedHealthcare Employer & Individual - Global from 2022 to 2023?",
        "response": "7%",
        "source": "finqa"
    },
    {
        "query": "How is goodwill calculated in the context of asset acquisition?",
        "response": "Goodwill is calculated as the excess of the purchase price over the fair values of identifiable assets and liabilities.",
        "source": "finqa"
    },
    {
        "query": "What services does Credit Karma offer to its members?",
        "response": "Credit Karma provides members with free access to credit scores and reports, credit and identity monitoring, dispute services for credit reports, tools for understanding net worth and financial progress, and personalized recommendations for credit card, loan, and insurance products. Additionally, Credit Karma Money offers online savings and checking accounts through a partnered FDIC member bank, and tools to help improve credit scores.",
        "source": "finqa"
    },
    {
        "query": "How much cash was provided by operating activities for fiscal 2023?",
        "response": "Cash provided by operating activities for fiscal 2023 totaled $1,376.3 million.",
        "source": "finqa"
    },
    {
        "query": "What was the net income for the year ended December 31, 2023?",
        "response": "The net income for the year ended December 31, 2023 was $217,375.",
        "source": "finqa"
    },
    {
        "query": "How much did the fair value of plan assets change from the beginning to the end of the 2023 fiscal year?",
        "response": "Decreased from $1,160 million to $1,105 million",
        "source": "finqa"
    },
    {
        "query": "How are Charles Schwab's depository institution subsidiaries regulated?",
        "response": "Charles Schwab's depository institution subsidiaries, including CSB and CSPB in Texas, and Trust Bank in Nevada, are regulated by the Federal Reserve, state financial institutions divisions, Consumer Financial Protection Bureau (CFPB), and the Federal Deposit Insurance Corporation (FDIC).",
        "source": "finqa"
    },
    {
        "query": "How can the company elect to adjust the maximum leverage ratio in the event of material acquisitions?",
        "response": "The company may increase the maximum leverage ratio by 0.5 to 1.0, subject to a cap of 4.75 to 1.0, in connection with certain material acquisitions if specific requirements are met.",
        "source": "finqa"
    },
    {
        "query": "How is ME&T defined in the context of Caterpillar Inc.'s financial discussions?",
        "response": "ME&T refers to Machinery, Energy & Transportation, which includes Caterpillar Inc. and its subsidiaries, excluding Financial Products, and is involved in the design, manufacturing, and marketing of products.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the calculation of future lease payments for new operating leases according to the company's practices?",
        "response": "Future lease payments for new operating leases are calculated based on an index or rate at the lease commencement date.",
        "source": "finqa"
    },
    {
        "query": "What is the significance of Note 16 in the context of legal proceedings in a Form 10-K?",
        "response": "Note 16 provides detailed information on commitments and contingencies related to legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How much net sales did the United States contribute to the total in 2023?",
        "response": "$9,752,314",
        "source": "finqa"
    },
    {
        "query": "How many deferred shares were granted to non-employee directors in fiscal 2020, 2021, and 2022?",
        "response": "In fiscal 2020, 18,000 deferred shares were granted to non-employee directors, in fiscal 2021, 15,000, and in fiscal 2022, 19,000.",
        "source": "finqa"
    },
    {
        "query": "What impact did the Employer Group Commercial Fully-Insured business have on the Insurance segment benefit ratio in 2022 and 2023?",
        "response": "The Employer Group Commercial Fully-Insured business did not impact the Insurance segment benefit ratio in 2023 but increased the ratio by 10 basis points in 2022.",
        "source": "finqa"
    },
    {
        "query": "How do regulatory differences impact the competitive landscape for U.S.-based financial firms like Goldman Sachs when compared to their non-U.S. counterparts?",
        "response": "Regulatory differences can impact the competitive landscape by providing non-U.S.-based firms with more flexibility in certain activities such as proprietary trading and investing in hedge and private equity funds outside the U.S., which are restricted for U.S.-based firms like Goldman Sachs under the Dodd-Frank Act.",
        "source": "finqa"
    },
    {
        "query": "What percentage of U.S. dialysis patient service revenues in 2023 came from Medicare and Medicare Advantage plans?",
        "response": "56%",
        "source": "finqa"
    },
    {
        "query": "What was the total energy consumed in gigajoules per square meter at Hilton's properties for the year ended December 31, 2023?",
        "response": "0.90",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the increase in services gross margin in 2023 compared to 2022?",
        "response": "Higher Services net sales, partially offset by the weakness in foreign currencies relative to the U.S. dollar and higher Services costs.",
        "source": "finqa"
    },
    {
        "query": "How long has KPMG LLP served as the auditor for Costco Wholesale Corporation by October 10, 2023?",
        "response": "KPMG LLP has served as the auditor for Costco Wholesale Corporation since 2002.",
        "source": "finqa"
    },
    {
        "query": "How much cash did Enphase Energy, Inc. pay upfront for the acquisition of 365 Pronto, Inc. on December 13, 2021?",
        "response": "$69.9 million",
        "source": "finqa"
    },
    {
        "query": "How much did Enphase Energy, Inc.'s total debt change by in 2023?",
        "response": "It increased by $3.4 million.",
        "source": "finqa"
    },
    {
        "query": "What is the company's view on the potential impact of these legal issues on its financial health?",
        "response": "The company believes that the resolution of all pending matters will not have a material adverse effect on its business, results of operations, cash flows, or financial condition.",
        "source": "finqa"
    },
    {
        "query": "What led to a $525 million accrual in Other current liabilities in the second quarter of 2023?",
        "response": "A $525 million accrual in Other current liabilities was recorded due to settlements with plaintiffs in the HIV antitrust litigation.",
        "source": "finqa"
    },
    {
        "query": "What was the available borrowing capacity under the senior secured revolving credit facility as of December 31, 2023?",
        "response": "$1,913 million",
        "source": "finqa"
    },
    {
        "query": "How did the demand for OTC test kits change throughout 2023 in the Pharmacy & Consumer Wellness segment?",
        "response": "The demand for OTC test kits was highest in the first quarter of 2023 and declined to its lowest quarterly volume by the fourth quarter.",
        "source": "finqa"
    },
    {
        "query": "What was the operating cost ratio in 2023?",
        "response": "14.7%",
        "source": "finqa"
    },
    {
        "query": "When was Craig Williams appointed to NIKE, and what are his primary responsibilities?",
        "response": "Craig Williams was appointed to NIKE in 2019, and he leads NIKE's four geographies and marketplace across the NIKE Direct and wholesale business, as well as the Supply Chain and Logistics organization.",
        "source": "finqa"
    },
    {
        "query": "What was the net change in cash and cash equivalents in 2022?",
        "response": "A net increase of $2,300 million",
        "source": "finqa"
    },
    {
        "query": "What is the accounting treatment for the $1.0 billion aggregate principal amount of 0% Convertible Senior Notes due 2026 according to FASB ASC Subtopic 470-20?",
        "response": "The $1.0 billion 0% Convertible Senior Notes due 2026 are accounted for entirely as a liability under FASB ASC Subtopic 470-20. No portion of the proceeds from the issuance is attributed to the conversion feature unless it requires separate accounting as an embedded derivative or involves a premium subject to ASC 470 guidelines.",
        "source": "finqa"
    },
    {
        "query": "What was the net unit growth percentage for Hilton in the year ended December 31, 2023?",
        "response": "4.9 percent",
        "source": "finqa"
    },
    {
        "query": "What is basic earnings per share based on?",
        "response": "Basic earnings per share is computed based on the weighted-average number of shares outstanding.",
        "source": "finqa"
    },
    {
        "query": "What was the total non-operating income in 2023, and how did it compare to the previous year?",
        "response": "Total non-operating income in 2023 was $87 million, compared to a total non-operating expense of $1.7 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "What kind of claims are involved in the securities and derivative litigation against the Company listed in the document?",
        "response": "Breach of fiduciary duties and violations of Sections 10(b) and 20(a) of the Securities Exchange Act related to opioids dispensing and distribution.",
        "source": "finqa"
    },
    {
        "query": "Did we make any purchases from Vebu in the year 2021?",
        "response": "No",
        "source": "finqa"
    },
    {
        "query": "What did the German Federal Cartel Office allege against Meta Platforms, Inc. on February 6, 2019?",
        "response": "The German Federal Cartel Office issued an antitrust injunction order claiming that Meta Platforms' terms and policies on data sharing across its apps, and collection from third-party websites via its business tools, breached European data protection principles and German competition law.",
        "source": "finqa"
    },
    {
        "query": "What types of contracts does the company have for its health insurance plans, and how does premium revenue recognition function under these contracts?",
        "response": "The company establishes commercial membership contracts typically lasting one year, subject to cancellation on 30-day notice and annually renewable Medicare contracts with CMS. Premium revenue is recognized as income when members are entitled to receive services, adjusted for uncollectibles, retroactive membership adjustments, and required rebates under Health Care Reform Law.",
        "source": "finqa"
    },
    {
        "query": "What factors influenced the decrease in total net revenues for both Investor Services and Advisor Services in 2023?",
        "response": "The decrease in total net revenues for both Investor Services and Advisor Services in 2023 was influenced by higher-cost funding sources, lower average interest-earning asset balances, a decrease in bank deposit account fees, lower client trading activity, and a decrease in order flow revenue and commissions. These factors were partially offset by an increase in asset management and administration fees.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did total net revenues increase from 2022 to 2023?",
        "response": "152.4%",
        "source": "finqa"
    },
    {
        "query": "What was the balance of AMD's retained earnings at the end of 2023?",
        "response": "$723 million",
        "source": "finqa"
    },
    {
        "query": "What were the total operating expenses for Chipotle Mexican Grill in 2023?",
        "response": "$8,313,836",
        "source": "finqa"
    },
    {
        "query": "What awards did Iron Mountain receive from Comparably in 2023?",
        "response": "Iron Mountain was named among the Best Companies for Women and Best Companies for Diversity.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of assets and liabilities associated with derivatives designated as hedging instruments in 2023?",
        "response": "Assets totalled $1,527 million and liabilities totalled $5,962 million.",
        "source": "finqa"
    },
    {
        "query": "What was the total long-term debt, including the current portion, for AbbVie as of December 31, 2023?",
        "response": "$59,245 million",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the escalation in operating costs and expenses in 2023?",
        "response": "Increases in film exhibition and food and beverage costs",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in the revenue disaggregation process according to the guidance on segment reporting?",
        "response": "The revenue disaggregation process considers information regularly reviewed by the Chief Executive Officer (CODM) for evaluating financial performance, disclosures used in investor presentations, and the nature of the company's products, subscriptions and services as presented in the consolidated statements of operations.",
        "source": "finqa"
    },
    {
        "query": "How much did the company anticipate needing for pending acquisitions in the health care sector as of December 31, 2023?",
        "response": "Approximately $6 billion",
        "source": "finqa"
    },
    {
        "query": "What were the terms of the Senior Notes issued on July 21, 2023?",
        "response": "$450 million in 5.050% Senior Notes due July 2026 and $300 million in 5.200% Senior Notes due August 2033",
        "source": "finqa"
    },
    {
        "query": "How are expected credit losses estimated for securities according to their accounting treatment?",
        "response": "Expected credit losses for securities are estimated by comparing the amortized cost and the present value of the expected cash flows, which are discounted using the interest rate at the time of purchase. The loss cannot exceed the full difference between the amortized cost basis and the security's fair value.",
        "source": "finqa"
    },
    {
        "query": "How many weeks did the fiscal years 2023 and 2022 include?",
        "response": "Fiscal years 2023 and 2022 each included 52 weeks.",
        "source": "finqa"
    },
    {
        "query": "What are the terms of Delta Air Lines' agreements with its regional carriers through Delta Connection®?",
        "response": "Delta Air Lines' agreements with its regional carriers typically last at least ten years with options for extensions. Delta controls operational aspects like scheduling and pricing.",
        "source": "finqa"
    },
    {
        "query": "What requirements do community-rated FEHB plans need to meet according to OPM regulations?",
        "response": "Community-rated FEHB plans are required by OPM regulations to meet a program-specific minimum medical loss ratio (MLR) according to the plan code and market.",
        "source": "finqa"
    },
    {
        "query": "What was the constant currency revenue for the United States in 2023?",
        "response": "$146,286 million",
        "source": "finqa"
    },
    {
        "query": "What exclusivity period does the FDA grant to pharmaceuticals designated as orphan drugs?",
        "response": "Seven years",
        "source": "finqa"
    },
    {
        "query": "What financial periods does the Management’s Discussion and Analysis section in Form 10-K typically cover?",
        "response": "The Management’s Discussion and Analysis section in Form 10-K typically discusses events and results from the previous two years, comparing year-to-year results between those periods.",
        "source": "finqa"
    },
    {
        "query": "How does Schwab determine the fair value of its financial instruments?",
        "response": "Schwab uses the market approach to determine the fair value of certain financial assets and liabilities.",
        "source": "finqa"
    },
    {
        "query": "How does AMC plan to address its sustainability of cash burn rates and achieve long-term profitability?",
        "response": "AMC believes that in order to achieve sustainable net positive operating cash flows and long-term profitability, operating revenues will need to increase to levels in line with pre-COVID-19 operating revenues.",
        "source": "finqa"
    },
    {
        "query": "What factors influence adjustments to provisions and changes to disclosures related to contingencies in financial statements?",
        "response": "Adjustments to provisions and changes to disclosures related to contingencies in financial statements are influenced by developments such as negotiations, settlements, rulings, advice of legal counsel, and updated information, which could impact the provisions previously recorded and the matters and related reasonably possible losses disclosed.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of The Home Depot Foundation?",
        "response": "improve the homes and lives of U.S. veterans and assist communities affected by natural disasters",
        "source": "finqa"
    },
    {
        "query": "What percentage of their Medicare Advantage members did Onehome serve with their value-based model as of December 31, 2023?",
        "response": "14%",
        "source": "finqa"
    },
    {
        "query": "What is the classification of cash equivalents within the fair value hierarchy as of June 30, 2023?",
        "response": "Cash equivalents were classified as Level 1 within the fair value hierarchy as of June 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "What impact does celebrating each employee’s unique story have at AT&T?",
        "response": "Celebrating each employee’s unique story allows AT&T to connect, create, and innovate in real and meaningful ways.",
        "source": "finqa"
    },
    {
        "query": "What was AbbVie's strategy for achieving its financial performance in 2023?",
        "response": "AbbVie's strategy in 2023 focused on maximizing the benefits of a diversified revenue base, advancing and investing in its pipeline, delivering strong financial results, and returning value to shareholders while ensuring sustainable growth over the long term.",
        "source": "finqa"
    },
    {
        "query": "What financial covenants were revised in the First Amendment of the Second Amended and Restated Credit Agreement on August 24, 2022?",
        "response": "The Company was only required to meet the total liquidity covenant set at $250 million and the total revenues covenant set at $3 billion for the four-quarter trailing period, provided any revolving loans were outstanding.",
        "source": "finqa"
    },
    {
        "query": "What was the status of the fair value over carrying value for the Asia Pacific reporting unit as of September 30, 2023, and December 1, 2023?",
        "response": "The fair value over carrying value for the Asia Pacific reporting unit was greater than 10% on both September 30, 2023, and December 1, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in revenue for the Compute & Networking segment from fiscal year 2022 to 2023?",
        "response": "The revenue for the Compute & Networking segment increased by 36% from fiscal year 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "When did Slack file a petition for a writ of certiorari with the U.S. Supreme around, and what was the outcome?",
        "response": "Slack filed a petition for a writ of certiorari with the U.S. Supreme Court on August 31, 2022, and it was granted on December 13, 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the remaining amount available to be purchased under the share repurchase program by the end of 2023?",
        "response": "The remaining amount available to be purchased under the share repurchase program was $3,563 by the end of 2023.",
        "source": "finqa"
    },
    {
        "query": "How does the timing of new product introductions impact Apple's net sales and operating expenses?",
        "response": "The timing of new product introductions can significantly impact Apple's net sales, cost of sales, and operating expenses.",
        "source": "finqa"
    },
    {
        "query": "How much did the Company's ownership in Massmart increase after buying out the noncontrolling interest shareholders in the fourth quarter of fiscal 2023?",
        "response": "from approximately 53% to 100%",
        "source": "finqa"
    },
    {
        "query": "What percentage of the total revenues for fiscal 2023 does STELARA account for?",
        "response": "12.8%",
        "source": "finqa"
    },
    {
        "query": "How did the net interest income for Bank of America's Consumer Banking segment change from 2022 to 2023 in dollar terms?",
        "response": "$3.644 billion",
        "source": "finqa"
    },
    {
        "query": "What is discussed in Item 8 of a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How is the revenue from sales of Online-Hosted Service Games recognized?",
        "response": "As the service is provided",
        "source": "finqa"
    },
    {
        "query": "What impact did the IRS deadline extension in 2023 have on Intuit's fiscal results?",
        "response": "The IRS tax filing deadline extension in 2021 to May 17 led to a significant portion of fiscal 2021 Consumer and ProTax segment revenues being recognized in the fourth quarter, compared to the third quarter of fiscal 2023 and 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decline in GMS for the year ended December 31, 2023 compared to 2022?",
        "response": "1.2%",
        "source": "finqa"
    },
    {
        "query": "What is the main role of Kroger's Chief Executive Officer in the company?",
        "response": "The Chief Executive Officer acts as the chief operating decision maker, assessing performance internally.",
        "source": "finqa"
    },
    {
        "query": "How is the GCLA managed and what elements are included in the U.S. dollar-denominated GCLA?",
        "response": "The GCLA is managed based on internal liquidity risk models and includes unencumbered U.S. government and agency obligations, eligible as collateral in Federal Reserve open market operations, and certain overnight U.S. dollar cash deposits.",
        "source": "finqa"
    },
    {
        "query": "What types of investments are primarily included in the Goldman Sachs' investments in funds at NAV as of December 2023?",
        "response": "Substantially all of Goldman Sachs' investments in funds at NAV consist of investments in firm-sponsored private equity, credit, real estate, and hedge funds where the firm co-invests with third-party investors. Private equity funds invest globally in various industries, including leveraged buyouts and growth investments, while credit funds focus on high-yield capital for transactions like buyouts and restructurings. Real estate funds invest in global real estate assets, and hedge funds employ a bottom-up investment approach across various asset classes and strategies.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in rental costs for the U.S. markets from 2022 to 2023?",
        "response": "2.3%",
        "source": "finqa"
    },
    {
        "query": "To which parts of the financial documents should one refer for information on legal proceedings as per Item 3?",
        "response": "One should refer to Note 12 of the Notes to the Consolidated Financial Statements, specifically under the captions 'Legal Matters' and 'Government Investigations, Audits and Reviews'.",
        "source": "finqa"
    },
    {
        "query": "What total amount of interest on debt does HP expect to pay, factoring in the swaps that convert fixed interest rates to variable?",
        "response": "$3,059 million",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the 21.7% increase in operating revenues from coal in 2022?",
        "response": "The 21.7% increase in operating revenues from coal in 2022 was attributable to higher average revenue per car/unit.",
        "source": "finqa"
    },
    {
        "query": "What are forward-looking statements in financial reports?",
        "response": "Forward-looking statements in financial reports refer to predictions or forecasts about future events that are based on current expectations. They include statements about anticipated business and financial performance or other future conditions and often contain phrases like 'expect,' 'anticipate,' and 'plan.'",
        "source": "finqa"
    },
    {
        "query": "What was the gross profit of the energy generation and storage segment in the year ended December 31, 2023?",
        "response": "$1,141",
        "source": "finqa"
    },
    {
        "query": "How does GM promote safety and well-being among its employees?",
        "response": "GM empowers employees to 'Speak Up for Safety' and provides the Employee Safety Concern Process, alongside its commitment to return people home safely each day.",
        "source": "finqa"
    },
    {
        "query": "What was the total fair value of awards vested during 2023?",
        "response": "$77,626",
        "source": "finqa"
    },
    {
        "query": "What are some of the international challenges and opportunities Alphabet is facing?",
        "response": "Alphabet continues to face challenges from foreign exchange rate fluctuations but sees opportunities in developing markets like India, where localized products and services could lead to increased revenues despite initially lower monetization rates.",
        "source": "finqa"
    },
    {
        "query": "How much did the equity in earnings from AC JV, LLC contribute to the 2023 annual results?",
        "response": "$4.9 million",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in Ford Pro’s EBIT for the full year 2022?",
        "response": "The increase was primarily due to higher net pricing and wholesales, although it was partially offset by inflationary increases on commodity, material, and freight costs along with higher structural costs and unfavorable mix.",
        "source": "finqa"
    },
    {
        "query": "What services does Humana Inc. provide to the Department of Defense?",
        "response": "Humana Inc. provides administrative services to the Department of Defense, which include access to provider networks and clinical programs, claim processing, customer service, enrollment, and others. The federal government retains all the risk for the cost of health benefits.",
        "source": "finqa"
    },
    {
        "query": "How did the geographic mix and changes in traveler behaviors affect the average nights per booking in 2023?",
        "response": "In 2023, the average nights per booking decreased by 4% primarily due to changes in the geographic mix and traveler behaviors.",
        "source": "finqa"
    },
    {
        "query": "How is revenue from on-premises software licenses recognized according to the company's accounting policy?",
        "response": "Revenue from on-premises software licenses is recognized upfront when the software is made available to the customer.",
        "source": "finqa"
    },
    {
        "query": "What criteria are used to establish investment policies for marketable securities?",
        "response": "Limits on the amount that can be invested in any one issuer and the requirement that investments be restricted mostly to U.S. government and agency securities, state and municipal securities, and corporate debt obligations of investment grade.",
        "source": "finqa"
    },
    {
        "query": "How does General[39 chars] Motors ensure quality in their dealership network?",
        "response": "General Motors ensures quality in their dealership network through rigorous terms in their contracts with dealers, compliance with various country and state franchise laws and regulations, and by maintaining a strong relationship with dealers as they transition to an all-electric future.",
        "source": "finqa"
    },
    {
        "query": "What was the total net uncertain tax positions as of December 31, 2023?",
        "response": "As of December 31, 2023, the company had net uncertain tax positions totaling $6.95 billion.",
        "source": "finqa"
    },
    {
        "query": "How did Comcast's Residential Connectivity & Platforms business perform financially in 2023?",
        "response": "Revenue remained consistent with the previous year, while the Adjusted EBITDA increased primarily due to decreases in other expenses and programming expenses. Additionally, the Adjusted EBITDA margin increased from 36.1% to 37.5%.",
        "source": "finqa"
    },
    {
        "query": "How does the company view the importance of diversity, equity, and inclusion?",
        "response": "The company believes that promoting diversity, equity, and inclusion is a reflection of its values and a key driver of business success and growth.",
        "source": "finqa"
    },
    {
        "query": "How much did Delta Air Lines plan to spend on RINs compliance costs in 2023, and how did it compare to the previous year?",
        "response": "$323 million in 2023, compared to $576 million in 2022",
        "source": "finqa"
    },
    {
        "query": "What was the value of cash payments for common stock repurchases through open market purchases during fiscal 2022?",
        "response": "$6.7 billion",
        "source": "finqa"
    },
    {
        "query": "What financial reporting standard changes are taking effect for AbbVie starting from annual periods in 2025?",
        "response": "The standard requires disaggregation of the effective rate reconciliation into standard categories, enhances disclosure of income taxes paid, and modifies other income tax-related disclosures.",
        "source": "finqa"
    },
    {
        "query": "When did AT&T acquire BellSouth Corporation?",
        "response": "AT&T acquired BellSouth Corporation in 2006.",
        "source": "finqa"
    },
    {
        "query": "What method is primarily used by the company to account for inventories?",
        "response": "The company primarily uses the first-in first-out (FIFO) method to account for inventories.",
        "source": "finqa"
    },
    {
        "query": "How much did the company spend on share repurchases in 2023, 2022, and 2021?",
        "response": "The company spent $1.6 billion in 2023, $2.1 billion in 2022, and $79 million in 2021 on share repurchases.",
        "source": "finqa"
    },
    {
        "query": "What type of customer segments does Amazon serve?",
        "response": "Amazon serves a diverse set of customer segments, including consumers, sellers, developers, enterprises, content creators, advertisers, and employees.",
        "source": "finqa"
    },
    {
        "query": "What impact would a 25 basis point change in certain assumptions have on HP's net periodic benefit cost in fiscal year 2023?",
        "response": "A change in the discount rate would result in a 5 million adjustment, expected increase in compensation levels would result in a 1 million adjustment, and expected long-term return on plan assets would result in a 14 million adjustment.",
        "source": "finqa"
    },
    {
        "query": "What type of business does Chipotle Mexican Grill, Inc. operate?",
        "response": "Chipotle Mexican Grill, Inc. operates a chain of restaurants specializing in Mexican food such as burritos, burrito bowls, quesadillas, tacos, and salads.",
        "source": "finqa"
    },
    {
        "query": "How are the company's strategic investments valued and what level of the fair value hierarchy are they classified under?",
        "response": "The company's strategic investments are recorded at fair value on a non-recurring basis using significant unobservable inputs, hence classified as Level 3 within the fair value measurement framework.",
        "source": "finqa"
    },
    {
        "query": "How does the company classify cash flows related to derivative instruments in its financial statements?",
        "response": "The company classifies cash flows related to derivative instruments as operating activities in the consolidated statement of cash flows.",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in the Annual Report on Form 10-K detail?",
        "response": "Item 8 provides details about the financial statements and supplementary data.",
        "source": "finqa"
    },
    {
        "query": "What was the change in operating cash flow for Electronic Arts in the fiscal year ended March 31, 2023?",
        "response": "decreased by 18 percent",
        "source": "finqa"
    },
    {
        "query": "How does the nature of revolving loan products affect the complexity in attributing future payments?",
        "response": "The nature of revolving loan products, which includes a relationship between future payments and spend behavior, adds complexity to the task of attributing these future payments either partially or entirely to the existing balance at the end of the reporting period.",
        "source": "finqa"
    },
    {
        "query": "How much cash and cash equivalents did the company have at the end of 2023, and how does this compare to the end of 2022?",
        "response": "Cash and cash equivalents were $21.9 billion at the end of 2023, compared to $14.1 billion at the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in gross margin for the company in 2023?",
        "response": "The increase in gross margin in 2023 was driven by favorable price realization and increased supply chain productivity. This was partially offset by unfavorable results from commodity derivative instruments and higher costs like labor and waste.",
        "source": "finqa"
    },
    {
        "query": "How does the Medicare marketing season affect the Insurance segment's operating cost ratio?",
        "response": "The Insurance segment's operating cost ratio is impacted by costs incurred in the second half of the year, which are associated with the Medicare marketing season.",
        "source": "finqa"
    },
    {
        "query": "What are the primary responsibilities of Heidi O'Neill at NIKE, Inc.?",
        "response": "Heidi O'Neill is responsible for leading the integration of global Men's, Women's & Kids' consumer teams, the entire global product engine, global brand marketing, and sports marketing to build deep storytelling, relationships, and engagement with the brand.",
        "source": "finqa"
    },
    {
        "query": "How does American Express manage and mitigate market risk?",
        "response": "American Express manages market risk by setting policies that guide and control market risk management, including the establishment of quantitative limits and escalation triggers. These policies are overseen by the ERMC, Asset Liability Committee, or the Market Risk Management Committee.",
        "source": "finqa"
    },
    {
        "query": "What changes in expenses did Delta Air Lines' ancillary businesses and refinery segment encounter in 2023 compared to 2022?",
        "response": "The expenses decreased by $1,584 million, a reduction of 28%.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of unused committed bank credit facilities available to the company as of December 31, 2023?",
        "response": "$7.42 billion",
        "source": "finqa"
    },
    {
        "query": "Who administers the compliance program at the company described?",
        "response": "The Chief Compliance Officer administers the compliance program.",
        "source": "finqa"
    },
    {
        "query": "What is the title illustration in the sample sentence?",
        "response": "Item 8 Financial Statements and Supplementary Data 39",
        "source": "finqa"
    },
    {
        "query": "Are we currently aware of any material legal proceedings involving our company?",
        "response": "No, we are not currently aware of any material legal proceedings in which we are involved.",
        "source": "finqa"
    },
    {
        "query": "What pages does the Financial Statements and Supplementary Data section cover in IBM’s 2023 Annual Report?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What effects did the strategic exit of certain non-core businesses in the fourth quarter of 2022 have on the Entertainment segment's performance in 2023?",
        "response": "The strategic exit of certain non-core businesses in the fourth quarter of 2022 contributed to the decrease in net revenues for the Entertainment segment in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much were cash dividends paid per common share in 2022 and 2021?",
        "response": "$0.94 in 2022 and $0.78 in 2021",
        "source": "finqa"
    },
    {
        "query": "What was Chevron's total average daily sales of natural gas in the U.S. in 2023?",
        "response": "4.7 billion cubic feet per day",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of equity securities in the retirement plans for 2023?",
        "response": "$7,764 million",
        "source": "finqa"
    },
    {
        "query": "When did Ravi Radhakrishnan join American Express and from which company did he transfer?",
        "response": "Ravi Radhakrishnan joined American Express in January 2022, transferring from Wells Fargo & Company where he served as Chief Information Officer for the Commercial Banking and Corporate & Investment Banking businesses since May 2020.",
        "source": "finqa"
    },
    {
        "query": "How are Commitments and Contingencies related to legal proceedings in a 10-K filing?",
        "response": "Commitments and Contingencies in Note 16 covers detailed information about legal proceedings, as detailed in Item 8 of Part II.",
        "source": "finqa"
    },
    {
        "query": "What note in the Consolidated Financial Statements provides details on legal proceedings?",
        "response": "Note 15 provides details on legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What were the total customer receivables in the 91+ days past due category and which years are these figures compared between?",
        "response": "The total customer receivables in the 91+ days past due category were $162 million for 2023 and $456 million for 2022.",
        "source": "finqa"
    },
    {
        "query": "What benefits does Delta Air Lines gain from participating in the SkyTeam alliance?",
        "response": "Participating in the SkyTeam alliance allows Delta Air Lines to enhance service and connective.FlatStyle with its route network through reciprocal codesharing and loyalty program participation, as well as joint cargo and passenger services with other member airlines.",
        "source": "finqa"
    },
    {
        "query": "How much total unrecognized compensation cost related to nonvested stock-based compensation awards was reported as of December 31, 2023?",
        "response": "$267 million",
        "source": "finqa"
    },
    {
        "query": "What are the remaining life spans of the 2026, 2031, and 2051 Notes as of March 31, 2023?",
        "response": "Approximately 2.9 years, 7.9 years, and 27.9 years, respectively",
        "source": "finqa"
    },
    {
        "query": "By when is JPMorgan Chase required to submit its next \"targeted\" resolution plan under the Dodd-Frank Act?",
        "response": "July 1, 2027",
        "source": "finqa"
    },
    {
        "query": "What was Chipotle Mexican Grill's net income in 2023?",
        "response": "$1,228,737",
        "source": "finqa"
    },
    {
        "query": "What were the principal and interest payments due on long-term debt for fiscal year 2024 according to the financial assessment?",
        "response": "The principal payments due on long-term debt were $5,250 million and the interest payments were $1,379 million for fiscal year 2024.",
        "source": "finqa"
    },
    {
        "query": "How does the Canadian federal government regulate vehicle GHG emissions and what are the expected future standards?",
        "response": "The Canadian federal government regulates vehicle GHG emissions under the Canadian Environmental Protection Act and is expected to align its standards with the new EPA standards for the 2027 model year and beyond.",
        "source": "finqa"
    },
    {
        "query": "What is the numerical identifier associated with the section discussing Financial Statements and Supplementary Data in the document?",
        "response": "39",
        "source": "finqa"
    },
    {
        "query": "How does the company manage the impact of economic pressures on margins?",
        "response": "The company negotiates with vendor partners to manage the margin impact of economic pressures.",
        "source": "finqa"
    },
    {
        "query": "What varies the warranty term for EV Chargers from 1 to 5 years?",
        "response": "the product",
        "source": "finqa"
    },
    {
        "query": "How does Tesla handle vehicle servicing to improve problem-solving?",
        "response": "Tesla services their electric vehicles through company-owned locations and employs mobile service technicians to perform work remotely, enabling faster problem identification and solution implementation compared to traditional automotive manufacturers.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock did the Company repurchase and subsequently retire during the year ended December 31, 2023?",
        "response": "2,029,894 shares",
        "source": "finqa"
    },
    {
        "query": "What were the proceeds from borrowings and the repayments of borrowings according to the latest available data?",
        "response": "The proceeds from borrowings were $2.6 million and the repayments of borrowings were $359.6 million.",
        "source": "finqa"
    },
    {
        "query": "What services does Walmart Connect offer?",
        "response": "Walmart Connect offers house advertising.",
        "source": "finqa"
    },
    {
        "query": "What is the primary content presented in Item 8 of a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's sales categories in fiscal 2023 were failure and maintenance related?",
        "response": "Approximately 85% of the company's sales categories were related to failure and maintenance in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the exchange rate effect on net revenues for the year ended December 31, 2022?",
        "response": "The exchange rate effect on net revenues for the year ended 2022 was $320 million.",
        "source": "finqa"
    },
    {
        "query": "What is the accounting treatment for a decline in fair value of an available-for-sale debt security at a company?",
        "response": "If an available-for-sale debt security’s fair value falls below its amortized cost basis, the company evaluates whether the decline is due to a credit loss, recording an impairment through an allowance for credit losses if so. Unrealized gains and losses not related to credit losses are recorded, net of tax, in accumulated other comprehensive income (loss).",
        "source": "finqa"
    },
    {
        "query": "What does the Company face in the ordinary course of business related to legal matters?",
        "response": "The Company faces various legal proceedings and claims in the ordinary course of business.",
        "source": "finqa"
    },
    {
        "query": "Are the consolidated financial statements and notes included directly in Item 8 of the Annual Report on Form 10-K?",
        "response": "No, they are included elsewhere in the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "By how much did investment income increase from 2022 to 2023?",
        "response": "$0.7 billion",
        "source": "finqa"
    },
    {
        "query": "How many employees does Johnson & Johnson have worldwide as of the latest information?",
        "response": "Approximately 131,900 employees",
        "source": "finqa"
    },
    {
        "query": "How much did net operating revenues increase in 2023 compared to 2022?",
        "response": "$2,750 million",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources of revenue for Google Services?",
        "response": "Google Services generates revenues primarily from advertising; fees received for consumer subscription-based products such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket; the sale of apps and in-app purchases, and devices.",
        "source": "finqa"
    },
    {
        "query": "What role does the 'Technology and Research' group play in the company's innovation efforts?",
        "response": "The 'Technology and Research' group plays a role in the company's innovation efforts by focusing on fundamental research, product and business incubations, and forward-looking AI innovations that span infrastructure, services, and applications.",
        "source": "finqa"
    },
    {
        "query": "What sections of IBM's 2023 Annual Report to Stockholders are included by reference in their Form 10-K?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "How much did the capital expenditures amount to in 2023, and how does this compare to 2022?",
        "response": "In 2023, capital expenditures amounted to $8.90 billion, which was an increase of $1.74 billion compared to $7.16 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the strikes by the Writers Guild of America and SAG-AFTRA on the Entertainment segment's net revenues in 2023?",
        "response": "The strikes by the Writers Guild of America and SAG-AFTRA in 2023 led to lower entertainment productions and deliveries, significantly contributing to a 31% decrease in net revenues in the Entertainment segment compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "What are the key factors that primarily affect the company's financial performance?",
        "response": "The company's financial performance is primarily affected by ASPs, product cost, product mix, customer mix, AMPTC, shipping costs, warranty costs, and sales volume fluctuations resulting from seasonality.",
        "source": "finqa"
    },
    {
        "query": "By what amount did the casino taxes for premium and mass players increase on March 1, 2022?",
        "response": "From 5% to 8% for premium players and from 15% to 18% for mass players.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did net revenue from U.S. sources increase for Hewlett Packard Enterprise in fiscal 2023 compared to fiscal 2022?",
        "response": "10.0%",
        "source": "finqa"
    },
    {
        "query": "How much did the free cash flow for ME&T change from 2022 to 2023?",
        "response": "The free cash flow for ME&T increased from $5,777 million in 2022 to $10,025 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the maturity dates for the Company's three-year and five-year revolving bank credit facilities?",
        "response": "The Company's three-year revolving bank credit facility matures in December 2026, and the five-year revolving bank credit facility matures in December 2028.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did royalty, contract, and other revenues decrease in 2023 compared to 2022?",
        "response": "39%",
        "source": "finqa"
    },
    {
        "query": "How much has been invested towards the goal of advancing equity in well-being as of January 28, 2024?",
        "response": "As of January 28, 2024, a total of $44.8 million has been invested towards the goal of advancing equity in well-being.",
        "source": "finqa"
    },
    {
        "query": "What was the total unamortized loss on securities transferred to the HTM category included in AOCI as of December 31, 2023?",
        "response": "$11.5 billion net of tax effect ($15.0 billion pre-tax)",
        "source": "finqa"
    },
    {
        "query": "In which part of the Form 10-K is information about legal proceedings discussed?",
        "response": "Information about legal proceedings is discussed in Part II of the Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What are the financial metrics that significantly affect the company's net revenues?",
        "response": "Gross Merchandise Volume (GMV) and take rate are significant factors that affect the company's net revenues.",
        "source": "finqa"
    },
    {
        "query": "How long is the base period of data package protection in the U.S., Europe, and Japan?",
        "response": "The base period of data package protection is generally five years in the U.S., effectively 10 years in Europe, and eight years in Japan.",
        "source": "finqa"
    },
    {
        "query": "What section of IBM's 2023 Annual Report to Stockholders contains the Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What were the unrealized losses on U.S. government and agency obligations for more than 12 months as of December 31, 2023?",
        "response": "The unrealized losses on U.S. government and agency obligations for more than 12 months as of December 31, 2023 were $227 million.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for Comcast Corporation in 2023?",
        "response": "$28,501 million",
        "source": "finqa"
    },
    {
        "query": "What step-by-step process is used to determine how revenue should be recognized in contracts involving multiple products and services?",
        "response": "A five-step process is used to determine how revenue should be recognized in contracts that include multiple products and services. This involves identifying performance obligations, determining if they are distinct, establishing the stand-alone selling price for each distinct obligation, deciding the timing of revenue recognition for these obligations, and estimating the amount of variable consideration to be included in the transaction price.",
        "source": "finqa"
    },
    {
        "query": "What was the revenue for COVID-19 antibodies in 2023?",
        "response": "No revenue",
        "source": "finqa"
    },
    {
        "query": "What are the limitations of using non-GAAP financial measures?",
        "response": "Non-GAAP financial measures have analytical limitations, they might not fully capture the economic loss in value of certain assets, can significantly impact equivalent GAAP earnings measures and cash flows, and may be calculated differently across companies, which limits their usefulness for comparative purposes.",
        "source": "finqa"
    },
    {
        "query": "Who provided the report for the Consolidated Financial Statements in Item 8?",
        "response": "PricewaterhouseCoopers LLP provided the report for the Consolidated Financial Statements in Item 8.",
        "source": "finqa"
    },
    {
        "query": "How did share repurchases affect The Hershey Company's EPS-diluted in 2022?",
        "response": "The 2022 EPS-diluted benefited from lower weighted-average shares outstanding as a result of share repurchases pursuant to Board-approved repurchase programs.",
        "source": "finqa"
    },
    {
        "query": "What are Visa's commitments under its corporate responsibility and sustainability initiatives?",
        "response": "Visa is committed to operating responsibly, ethically, inclusively, and sustainably, focusing on empowering people, businesses, and communities to thrive, and addressing corporate responsibility and sustainability topics significant to its role as a payments technology company.",
        "source": "finqa"
    },
    {
        "query": "When did the FTC file a complaint against Meta Platforms, Inc. in the District Court for the District of Columbia, and what were the allegations?",
        "response": "On December 9, 2020, the FTC filed a complaint against Meta Platforms, Inc. alleging that the company engaged in anticompetitive conduct and unfair methods of competition in violation of Section 5 of the Federal Trade Commission Act and Section 2 of the Sherman Act, including by acquiring Instagram in 2012 and WhatsApp in 2014.",
        "source": "finqa"
    },
    {
        "query": "What are the potential future risks of the Russia-Ukraine war as mentioned in the text?",
        "response": "The potential future risks of the Russia-Ukraine war include physical damage and destruction of manufacturing facilities in Ukraine, inability to operate manufacturing sites, source raw materials, or ship finished products, and operational issues in Russia due to sanctions, currency controls, and transportation challenges.",
        "source": "finqa"
    },
    {
        "query": "What were the total acquisition-related expenses recognized in 2021 in connection with the acquisition of MIRROR?",
        "response": "In 2021, the total acquisition-related expenses recognized in connection with the acquisition of MIRROR amounted to $41.394 million.",
        "source": "finqa"
    },
    {
        "query": "How does lululemon gather feedback for their product design?",
        "response": "Lululemon gathers feedback directly from their customers, whom they refer to as guests, to incorporate into their product design process.",
        "source": "finqa"
    },
    {
        "query": "What are some of the specific regulatory requirements that Goldman Sachs' subsidiaries registered as swap dealers must comply with according to the CFTC and NFA?",
        "response": "Goldman Sachs' subsidiaries registered as swap dealers must comply with mandatory clearing and execution of interest rate and credit default swaps, real-time public reporting, adherence to business conduct standards, and registration with the CFTC. They are also subject to capital requirements established by the CFTC and regulatory requirements from the NFA, including cybersecurity and supervision.",
        "source": "finqa"
    },
    {
        "query": "What factors led to the decrease in marketing and sales expenses as a percentage of revenue in fiscal 2023?",
        "response": "The decrease in marketing and sales expenses as a percentage of revenue in fiscal 2023 was primarily due to a hiring pause that began in the second half of fiscal, the January 2023 restructuring plan, and decreased marketing expenses.",
        "source": "finqa"
    },
    {
        "query": "How did Microsoft Cloud revenue change in fiscal year 2023 compared to fiscal year 2022?",
        "response": "Microsoft Cloud revenue increased by 22% to $111.6 billion in fiscal year 2023 compared to fiscal year 2022.",
        "source": "finqa"
    },
    {
        "query": "What criteria must be met for the company to recognize an asset for the costs to fulfill a contract with a customer?",
        "response": "The costs must be specifically identifiable, expected to generate or enhance resources used to satisfy future performance obligations, and be recoverable.",
        "source": "finqa"
    },
    {
        "query": "What was the occupancy rate change at The Parisian Macao from 2022 to 2023?",
        "response": "The occupancy rate at The Parisian Macao increased from 37.9% in 2022 to 93.0% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of money market mutual funds measured at as of January 31, 2023 and how was it categorized in the fair value hierarchy?",
        "response": "The fair value of money market mutual funds was measured at $1,795 million as of January 31, 2023, and it was categorized under Level 1 in the fair value hierarchy.",
        "source": "finqa"
    },
    {
        "query": "What financial metric for HPC & AI increased by 22.6% in fiscal 2023 compared to the previous year?",
        "response": "Net revenue",
        "source": "finqa"
    },
    {
        "query": "What was the total premiums revenue for the Insurance segment in 2023?",
        "response": "$101.3 billion",
        "source": "finqa"
    },
    {
        "query": "What was the effect of changes in dealer inventories on sales volume as mentioned?",
        "response": "Changes in dealer inventories led to lower sales volumes as increases in dealer inventory during 2022, compared with a decrease during 2023, negatively impacted the sales volume.",
        "source": "finqa"
    },
    {
        "query": "By what capacity is the Pasadena Refinery expected to increase its light crude oil throughput by 2024?",
        "response": "125,000 barrels per day",
        "source": "finqa"
    },
    {
        "query": "What benefits does Meta offer through its Life@ Meta program?",
        "response": "Meta offers a wide range of benefits including health, family, finance, community, and time away benefits, as well as family building benefits, family care resources, retirement savings plans, access to legal services, and health and well-being benefits.",
        "source": "finqa"
    },
    {
        "query": "What factors could potentially alter Goldman Sachs' anticipated financial outcomes according to their 2023 forward-looking statements?",
        "response": "According to their 2023 forward-looking statements, factors that could alter Goldman Sachs' anticipated financial outcomes include results, financial condition, liquidity, and capital actions possibly differing from anticipated due to the inherent uncertainty and uncontrollable nature of future events as mentioned under \"Risk Factors\" and \"Forward-Looking Statements\".",
        "source": "finqa"
    },
    {
        "query": "What specific identifier is associated with PricewaterhouseCoopers LLP in their role as an independent registered public accounting firm?",
        "response": "PCAOB ID 238",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of the company's material contractual obligations as of December 31, 2023?",
        "response": "$44,424 million",
        "source": "finqa"
    },
    {
        "query": "What is the fiscal year-end date for the company discussed?",
        "response": "The fiscal year for the company ends on the Sunday closest to September 30.",
        "source": "finqa"
    },
    {
        "query": "What is the main business focus of Eli Lilly and Company?",
        "response": "The main business focus of Eli Lilly and Company is human pharmaceutical products.",
        "source": "finqa"
    },
    {
        "query": "How did GM Financial's revenue composition distribute in the year ended December 31, 2023?",
        "response": "In 2023, GM Financial's revenue was made up of 51% leased vehicle income, 37% retail finance charge income, and 7% commercial finance charge income.",
        "source": "finqa"
    },
    {
        "query": "What are the primary competitive factors for the company in its industry?",
        "response": "The primary competitive factors for the company in its industry include price, merchandise quality and selection, location, convenience, distribution strategy, and customer service.",
        "source": "finqa"
    },
    {
        "query": "How much did DARZALEX sales increase in 2023 compared to the previous year?",
        "response": "22.2%",
        "source": "finqa"
    },
    {
        "query": "What accounting policy does Garmin employ for handling shipping and handling costs?",
        "response": "Shipping and handling costs are included in cost of goods sold.",
        "source": "finqa"
    },
    {
        "query": "How much was the net cash used in investing activities in 2023 compared to 2022?",
        "response": "$3,148 million in 2023 and $6,924 million in 2022",
        "source": "finqa"
    },
    {
        "query": "What was the total net automotive cash provided by investing activities in 2023?",
        "response": "-$8.7 billion",
        "source": "finqa"
    },
    {
        "query": "What are the key factors that contribute to the uncertainty in establishing loss reserves for property and casualty insurance claims?",
        "response": "The key factors contributing to uncertainty in loss reserve estimates for property and casualty insurance include long-tail risk characteristics, the need for informed judgments based on current circumstances, the use of historical loss data and actuarial methods, and external factors like inflation and legal changes. These uncertainties are exacerbated by events such as heightened inflation and potential impacts from climate change.",
        "source": "finqa"
    },
    {
        "query": "What happened to the Parmenter v. Karp case in November 2023?",
        "response": "The plaintiff in the Parmenter v. Karp case filed a Notice of Voluntary Dismissal on November 20, 2023, and the court terminated the action on November 28, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the principal repayments of finance leases for the year 2022?",
        "response": "The principal repayments of finance leases for 2022 were $7,941 million.",
        "source": "finqa"
    },
    {
        "query": "What is Garmin Ltd.'s total balance as of December 30, 2023?",
        "response": "$7,012,060",
        "source": "finqa"
    },
    {
        "query": "By how much did the product and distribution costs as a percentage of Channel Development Total Net Revenues change from fiscal year ending October 2, 2022, to October 1, 2023?",
        "response": "The product and distribution costs as a percentage of Channel Development Total Net Revenues increased by 1.2 percentage points, from 64.8% in fiscal year ending October 2, 2022, to 66.0% in the fiscal year ending on October 1, 2023.",
        "source": "finqa"
    },
    {
        "query": "How much has been indefinitely reinvested from accumulated foreign earnings as of fiscal year 2023?",
        "response": "$1,963 million",
        "source": "finqa"
    },
    {
        "query": "What types of penalties does the FCA impose for the knowing and improper retention of overpayments from government payors?",
        "response": "The FCA imposes severe penalties for the knowing and improper retention of overpayments collected from government payors.",
        "source": "finqa"
    },
    {
        "query": "What is the impact of ongoing judicial proceedings on the company's financial condition?",
        "response": "The ongoing judicial, regulatory, and arbitration proceedings are not expected to have a material adverse effect on the company's financial condition, but may be material to operating results in a given period.",
        "source": "finqa"
    },
    {
        "query": "What was the rent credit received by the company upon delivering a $2.8 million letter of credit in 2020?",
        "response": "$2.8 million",
        "source": "finqa"
    },
    {
        "query": "Are the consolidated financial statements part of the main document or referenced elsewhere in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are incorporated by reference and immediately follow Part IV in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in Americas net sales during 2023 compared to 2022?",
        "response": "Americas net sales decreased 4% during 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the numerical label associated with the section on Financial Statements and Supplementary Data in the document?",
        "response": "39",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in Dollar Tree segment's gross profit margin in 2022?",
        "response": "The increase in the Dollar Tree segment's gross profit margin in 2022 was due to a decrease in merchandise costs, including freight, decreased occupancy costs, and distribution cost efficiencies, offset by increases in shrink costs and markdown costs.",
        "source": "finqa"
    },
    {
        "query": "What date did Berkshire Hathaway Inc. and its subsidiaries have their financial statements audited?",
        "response": "The financial statements of Berkshire Hathaway Inc. and its subsidiaries were audited as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the consequences if the described company fails to comply with applicable laws and regulations?",
        "response": "The company could be subject to penalties or other consequences such as substantial monetary penalties and exclusion from participation in federal healthcare programs, which could materially affect its business, operations, and financial condition.",
        "source": "finqa"
    },
    {
        "query": "What was the total foreign currency gain for the company in fiscal 2023?",
        "response": "$26.4 million",
        "source": "finqa"
    },
    {
        "query": "What were the deferred revenue and customer deposit balances as of December 31, 2023, and how do they compare to the previous year?",
        "response": "As of December 31, 2023, deferred revenue totaled $246.9 million and customer deposits totaled $209.8 million. In comparison, December 31, 2022 totals for deferred revenue and customer deposits were $183.4 million and $142.0 million, respectively.",
        "source": "finqa"
    },
    {
        "query": "How much was allocated to U.S. Equity in the fair value measurements using Level 1 inputs at the reporting date on December 31, 2023?",
        "response": "$40.9 million",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue for all UnitedHealthcare services in 2023?",
        "response": "$281,360 million",
        "source": "finqa"
    },
    {
        "query": "What does a contract need to include to be considered a lease under the described financial standards?",
        "response": "A contract is considered a lease if it conveys the right to control the use of an identified asset for a period in exchange for consideration. Control includes the lessee having the rights to obtain substantially all economic benefits from the use of the asset and to direct the use of the asset.",
        "source": "finqa"
    },
    {
        "query": "In which item is Note 10, discussing Legal Proceedings, included?",
        "response": "Note 10 discussing Legal Proceedings is included in Item 8 of the report.",
        "source": "finqa"
    },
    {
        "query": "What were the basic earnings per share for Visa's Class A common stock in fiscal 2023?",
        "response": "$8.29",
        "source": "finqa"
    },
    {
        "query": "What page number does Item 8 start on in the document?",
        "response": "39",
        "source": "finqa"
    },
    {
        "query": "What are included immediately following Part IV in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included immediately following Part IV in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "Where would one find the 'Index to Financial Statements' and the 'Index to Financial Statement Schedules' mentioned?",
        "response": "They can be found at Part IV Item 15 titled 'Exhibits, Financial Statement Schedules'.",
        "source": "finqa"
    },
    {
        "query": "What position does Brad D. Smith currently hold?",
        "response": "President of Marshall University",
        "source": "finqa"
    },
    {
        "query": "What were the key components of the acquisition deal between ICE and Black Knight completed on September 5, 2023?",
        "response": "The acquisition deal between ICE and Black Knight, completed on September 5, 2023, involved ICE acquiring 100% of Black Knight for a total consideration of approximately $11.8 billion, equivalent to $76 per share. The deal comprised roughly 90% cash, totaling $10.5 billion, and the issuance of 10.9 million shares of ICE common stock, valued based on the market price and the average of the volume weighted averages of the trading prices of ICE common stock on each of the ten consecutive trading days ending three days prior to the merger's closing.",
        "source": "finqa"
    },
    {
        "query": "What percentage is the initial preferred distribution for the April preferreds issued by AT&T in 2023?",
        "response": "6.85% annually",
        "source": "finqa"
    },
    {
        "query": "What are the NEV credit requirements for OEMs in China for the years 2024 to 2028?",
        "response": "In China, OEMs are required to generate NEV credits of at least 28% in 2024 and 38% in 2025 of the annual ICE passenger vehicle production or import volumes, with future percentages proposed as 45%, 50%, and 54% for 2026, 2027, and 2028 respectively.",
        "source": "finqa"
    },
    {
        "query": "What types of insurance licenses does Caterpillar Insurance Co. Ltd. hold in Bermuda?",
        "response": "Caterpillar Insurance Co. Ltd. is registered as a Class 2 (General Business) and Class B (Long-Term) insurer.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in selling, general and administrative expenses from 2022 to 2023?",
        "response": "The selling, general and administrative expenses increased by 23.2 percent from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What are some current enterprise applications of VR and AR technologies?",
        "response": "Current enterprise applications of VR and AR technologies include virtual car showrooms, surgical training, architectural walkthroughs, and bringing historical scenes to life.",
        "source": "finqa"
    },
    {
        "query": "How much did Etsy’s net income amount to in the year ending December 31, 2023?",
        "response": "$307.6 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in cash volume for Visa Inc. from 2021 to 2022?",
        "response": "0%",
        "source": "finqa"
    },
    {
        "query": "What activities has the federal government used the FCA to prosecute?",
        "response": "The federal government has used the FCA to prosecute a variety of alleged false claims and fraud against Medicare, including coding errors, billing for unrendered services, submission of false cost reports, inappropriate billing rates, and non-medically necessary care.",
        "source": "finqa"
    },
    {
        "query": "How is Comcast's video revenue expected to change in 2023?",
        "response": "Video revenue is expected to continue declining due to net losses of domestic customers, which are influenced by shifting video consumption patterns and the competitive environment.",
        "source": "finqa"
    },
    {
        "query": "What was the effect of vesting acceleration and stock option repricing on stock-based compensation expense?",
        "response": "The acceleration of vesting for certain restricted stock units resulted in an additional $35.6 million of stock-based compensation expense, and the repricing of stock options led to an incremental expense of $21.9 million.",
        "source": "finqa"
    },
    {
        "query": "What kind of financial documents are included in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included.",
        "source": "finqa"
    },
    {
        "query": "How many hourly employees completed the supervisor in training programs in 2023?",
        "response": "In 2023, over 7,800 hourly employees completed the 6-week supervisor in training programs.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the reduction in noninterest expenses in 2023?",
        "response": "The reduction in litigation expense and revenue-related compensation helped offset increases in noninterest expenses.",
        "source": "finqa"
    },
    {
        "query": "What critical audit matter was highlighted in the audit of Amazon.com, Inc.'s financial statements?",
        "response": "The critical audit matter highlighted in the audit of Amazon.com, Inc.'s financial statements was the uncertain tax positions. This involved significant auditor judgment regarding the sustainability and measurement of the tax positions.",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in the determination of the fair value of acquired racking structures?",
        "response": "The fair value of acquired racking structures is determined by considering the current estimated replacement cost, discounted to account for factors like age, material, and type.",
        "source": "finqa"
    },
    {
        "query": "What does Note 21 pertain to in this report?",
        "response": "Note 21 pertains to Commitments and Contingencies in the report.",
        "source": "finqa"
    },
    {
        "query": "What is the therapeutic purpose of Letairis?",
        "response": "Letairis is used for the treatment of pulmonary arterial hypertension (PAH) to improve exercise capacity, delay clinical worsening, and in combination with tadalafil to reduce risks of disease progression and hospitalization.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of cash and cash equivalents held by the company as of December 31, 2023?",
        "response": "$914,323 thousand",
        "source": "finqa"
    },
    {
        "query": "How much did NVIDIA record as an acquisition termination cost in fiscal year 2023 related to the Arm Share Purchase Agreement?",
        "response": "NVIDIA recorded an acquisition termination cost of $1.35 billion in fiscal year 2023 related to the Arm Share Purchase Agreement.",
        "source": "finqa"
    },
    {
        "query": "How does the Federal Reserve determine the size of the SCB for each CCAR participating firm?",
        "response": "The Federal Reserve uses pro-forma capital positions and ratios under adverse economic conditions to determine the size of the SCB for each CCAR participating firm during comprehensive capital analysis and review.",
        "source": "finqa"
    },
    {
        "query": "What was the function of the independent estimate developed by the auditors in the context of the IBNR audit?",
        "response": "The independent estimate developed by the auditors was used to compare against the management's estimate of IBNR to validate the reasonableness of management's actuarial methods and assumptions.",
        "source": "finqa"
    },
    {
        "query": "What were the reasons behind the goodwill impairment charge for Vitacost.com in 2022?",
        "response": "The impairment was due to reduced long-term profitability expectations and a decline in the market value of one underlying business channel, following a strategic reprioritization towards utilizing Pickup and Delivery capabilities.",
        "source": "finqa"
    },
    {
        "query": "How are vendor allowances typically treated in the financial statements?",
        "response": "Vendor allowances are typically treated as a reduction of the cost of inventory, and recognized as a reduction to cost of sales as these inventories are sold.",
        "source": "finqa"
    },
    {
        "query": "What does the NVIDIA computing platform focus on accelerating?",
        "response": "The NVIDIA computing platform focuses on accelerating the most compute-intensive workloads, such as AI, data analytics, graphics and scientific computing, across various types of data centers.",
        "source": "finqa"
    },
    {
        "query": "What types of legal actions do Berkshire and its subsidiaries typically face?",
        "response": "Berkshire and its subsidiaries typically face legal actions that arise from the normal course of business, including those seeking to establish liability through insurance or reinsurance contracts.",
        "source": "finqa"
    },
    {
        "query": "How would a 10% change in the number of redeemed miles impact the total operating revenue for 2023?",
        "response": "It would result in an impact of less than 1% of the total operating revenue.",
        "source": "finqa"
    },
    {
        "query": "What future cash payments are expected from the cost savings plans through fiscal year 2025?",
        "response": "$0.5 billion",
        "source": "finqa"
    },
    {
        "query": "What challenges did the company face in its supply chain during fiscal 2021?",
        "response": "During fiscal 2021, the company faced significant disruptions in its supply chain, impacting the timely shipping of products from overseas.",
        "source": "finqa"
    },
    {
        "query": "What was the effective tax rate for the fiscal year ending May 31, 2022, and how does it compare to the effective tax rate for the fiscal year ending May 31, 2023?",
        "response": "The effective tax rate for the fiscal year ending May 31, 2022 was 9.1%, which is lower compared to 18.2% for the fiscal year ending May 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How could a reduction in mortgage lending volume impact revenues?",
        "response": "A reduction in mortgage lending volumes could lead to decreased demand for mortgage data products, thereby reducing overall revenues. Additionally, it could result in a decrease in the number of loans processed using financial technology, which directly impacts transaction-based revenues.",
        "source": "finqa"
    },
    {
        "query": "What was the net change in owned and leased hotels expenses resulting from currency fluctuations?",
        "response": "There was a net increase of $142 million in owned and leased hotels expenses, which included a $143 million increase on a currency neutral basis and a $1 million decrease due to favorable currency exchange rates.",
        "source": "finqa"
    },
    {
        "query": "What was the dividend payment schedule for Series E preferred stock before it was redeemed on December 1, 2022?",
        "response": "Before its redemption on December 1, 2022, Series E preferred stock paid dividends semi-annually until March 1, 202ListDetails then quarterly thereafter until the final dividend on December 1, 2022.",
        "source": "finqa"
    },
    {
        "query": "How does AutoZone utilize its digital platforms to provide customer service?",
        "response": "AutoZone utilizes digital platforms such as its website and a smartphone application to offer customers services like checking product availability, getting store directions and operating hours, and purchasing products with options for in-store pickup or direct shipping.",
        "source": "finqa"
    },
    {
        "query": "What is the role of the Privacy Risk Management Committee at American Express?",
        "response": "The Privacy Risk Management Committee at American Express, a sub-committee of the ORMC and chaired by the Chief Privacy Officer, provides oversight and governance for the company's privacy program.",
        "source": "finqa"
    },
    {
        "query": "What are the four focus areas declared by the company to strengthen their performance going forward?",
        "response": "The four focus areas are leveraging environmental sustainability, increasing digital acumen, developing next-level supply chain capabilities, and delivering employee value equation for all gender identities, races, ethnicities, sexual orientations, ages and abilities for all roles.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in total revenue, net of interest expense, for Bank of America's Consumer Banking segment from 2022 to 2023?",
        "response": "9%",
        "source": "finqa"
    },
    {
        "query": "How long can a patient with commercial insurance have Medicare as a secondary payor before it becomes the primary payor for dialysis services?",
        "response": "33 months",
        "source": "finqa"
    },
    {
        "query": "What type of information is included on page 65 of Salesforce Inc. Annual Report on Form 10-K?",
        "response": "Notes to Consolidated Financial Statements",
        "source": "finqa"
    },
    {
        "query": "What are the total lease obligations as of June 30, 2023, and how are they distributed over time?",
        "response": "As of June 30, 2023, the total lease obligations were $883.1 million, distributed as $115.5 million due in less than 1 year, $199.0 million due in 1-3 years, $170.4 million due in 3-5 years, and $398.2 million due in more than 5 years.",
        "source": "finqa"
    },
    {
        "query": "How does the use of a full yield curve approach in estimating pension costs affect the measurement of liabilities and expenses?",
        "response": "The use of a full yield curve approach in estimating pension costs provides a more precise measurement of service and interest costs and generally results in lower benefit expense in periods when the yield curve is upward sloping, although it does not affect the overall measurement of pension and other post-retirement benefit liabilities.",
        "source": "finqa"
    },
    {
        "query": "What might be contained in Item 8 of a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What is the composition of DaVita's incoming Redwoods leadership class in terms of gender and ethnicity in 2023?",
        "response": "54% women and 37% people of color",
        "source": "finqa"
    },
    {
        "query": "What adjustments may be required when determining the similarity of non-marketable equity securities issued by the same issuer?",
        "response": "Determining the similarity may require adjustments such as assessment of differences in rights like voting and distribution rights, preferences, conversion features, and observable price adjustments for differences in rights, control premium, liquidity, or principal markets.",
        "source": "finqa"
    },
    {
        "query": "Who is the independent registered public accounting firm mentioned in Item 8 of the financial document?",
        "response": "The independent registered public accounting firm mentioned in Item 8 is PricewaterhouseCoopers LLP.",
        "source": "finqa"
    },
    {
        "query": "What roles do authorized dealers play in General Motors' sales and service network?",
        "response": "Authorized dealers of General Motors sell GM vehicles, parts, and accessories, offer after-sale services like maintenance and repairs, and provide customers with access to financing and insurance options.",
        "source": "finqa"
    },
    {
        "query": "What was the remaining budget for the September 2022 Repurchase Program as of January 28, 2023?",
        "response": "$1.0 billion",
        "source": "finqa"
    },
    {
        "query": "What does it mean that something is 'incorporated by reference' in a Form 10-K?",
        "response": "It means that the item, though separately listed, is included within the document to form part of the main content, referencing back to another part of the same document for detailed information.",
        "source": "finqa"
    },
    {
        "query": "What significant change occurred to the credit agreement terms on May 25, 2022?",
        "response": "The Company entered into the Second Amended and Restated Credit Agreement, which amended and restated the Amended and Restated Credit Agreement to provide a $750 million term loan facility and a $500 million revolving credit facility.",
        "source": "finqa"
    },
    {
        "query": "What were the main events contributing to catastrophe losses in 2023?",
        "response": "U.S. flooding, hail, tornadoes, and wind events",
        "source": "finqa"
    },
    {
        "query": "How many shares of preferred stock are authorized at UnitedHealth Group, and how many are issued or outstanding?",
        "response": "10 shares of preferred stock are authorized at UnitedHealth Group, and no shares are issued or outstanding.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of eliminating ME&T's insurance premiums that are prepaid to Financial Products in the financial records?",
        "response": "The elimination of ME&T's prepaid insurance premiums to Financial Products is done to prevent double-counting in the financial records.",
        "source": "finqa"
    },
    {
        "query": "What defines the \"Loss-to-Receivables\" (LTR) Ratio at Ford Credit?",
        "response": "The LTR ratio is defined as the net charge-offs divided by average finance receivables, excluding unearned interest supplements and the allowance for credit losses.",
        "source": "finqa"
    },
    {
        "query": "Who conducted the audit of the financial statements reported on February 16, 2024?",
        "response": "PricewaterhouseCoopers LLP conducted the audit.",
        "source": "finqa"
    },
    {
        "query": "What are the requirements for health insurers and group health plans in providing cost estimates to consumers?",
        "response": "Health insurers and group health plans must provide personalized pricing information in real-time based on accurate cost-sharing information at the time of the request, through an online consumer tool, by phone, or in paper form upon request.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of fixed lease payment obligations as of December 31, 2023?",
        "response": "$638 million",
        "source": "finqa"
    },
    {
        "query": "What was the total percentage of U.S. dialysis patient service revenues coming from government-based programs in 2023?",
        "response": "67%",
        "source": "finqa"
    },
    {
        "query": "What factors could affect the accuracy of forward-looking statements in financial disclosures?",
        "response": "The accuracy of forward-looking statements in financial disclosures can be affected by unforeseen economic conditions, changes in laws or regulations, geopolitical situations, or significant changes in business strategies or operations.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decrease in research and development expenses in the fiscal year ended June 30, 2023?",
        "response": "The decrease in research and development expenses was primarily due to reductions in personnel-related expenses, product development and research costs, costs associated with software and web platform costs, and depreciation and amortization expenses.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of unrecognized tax benefits recorded as of January 28, 2023?",
        "response": "$17.4 million",
        "source": "finqa"
    },
    {
        "query": "What are the key businesses included under Caterpillar Inc.'s Financial Products division?",
        "response": "The Financial Products division consists primarily of Caterpillar Financial Services Corporation and Cat Insurance Holdings Inc., focusing on financing customer and dealer purchases and leases of Caterpillar equipment.",
        "source": "finqa"
    },
    {
        "query": "What is the earliest date on which the 7% Notes due 2029 can be redeemed at par?",
        "response": "August 15, 2025",
        "source": "finqa"
    },
    {
        "query": "How does AMC approach compensation and benefits to attract and retain talent?",
        "response": "AMC offers market competitive salaries and wages targeting market median, with compensation programs designed to engage and support business objectives through pay-for-performance and incentive opportunities.",
        "source": "finqa"
    },
    {
        "query": "By what year must VML complete the development of certain gaming and non-gaming investment projects according to the concession requirements?",
        "response": "By December 2032",
        "source": "finqa"
    },
    {
        "query": "What was the decrease in net cash provided by operating activities from 2022 to 2023 for the reported company?",
        "response": "$4.6 million",
        "source": "finqa"
    },
    {
        "query": "How is revenue recognized for subscription-based television networks under multiyear agreements?",
        "response": "Revenue for subscription-based television networks under multiyear agreements is recognized as programming is provided to subscribers.",
        "source": "finqa"
    },
    {
        "query": "What is the amount of Hewlett Packard Enterprise Company's goodwill as of October 31, 2023, and how is it distributed among the reporting units?",
        "response": "As of October 31, 2023, Hewlett Packard Enterprise Company's goodwill totaled $18 billion, with $7.7 billion attributed to the Compute reporting unit and $2.9 billion to the High Performance Computing and Artificial Intelligence (HPC & AI) reporting unit.",
        "source": "finqa"
    },
    {
        "query": "How much did OI&E, net increase from 2022 to 2023?",
        "response": "Increased by $4.9 billion",
        "source": "finqa"
    },
    {
        "query": "How are capped call transactions used in relation to the issuance of convertible notes?",
        "response": "Capped call transactions are used simultaneously with the issuance of convertible notes to minimize potential dilution upon conversion of the notes.",
        "source": "finqa"
    },
    {
        "query": "How does the company account for customer programs involving rebates and marketing development funds?",
        "response": "The company accounts for customer programs, such as rebates and marketing development funds (MDFs), as a reduction to revenue and accrues for potential rebates and MDFs based on the amount expected to be claimed by customers.",
        "source": "finqa"
    },
    {
        "query": "How many options were granted under the 2019 Equity Incentive Plan during the fiscal year ended March 31, 2023, and what was their weighted average exercise price?",
        "response": "4 options were granted with a weighted average exercise price of $123.23.",
        "source": "finqa"
    },
    {
        "query": "How much did Electronic Arts Inc. spend on capital expenditures in the fiscal year 2023?",
        "response": "$207 million",
        "source": "finqa"
    },
    {
        "query": "What are the different types of reserves that are considered most subjective and complex for estimation according to a certain financial analysis?",
        "response": "The most subjective and complex reserves to estimate include unpaid loss and loss expense reserves, future policy benefits reserves, value of business acquired (VOBA), risk transfer assessment for certain structured insurance and reinsurance contracts, reinsurance recoverable valuation, investment portfolio valuation, deferred income tax valuation, and goodwill impairment assessment.",
        "source": "finqa"
    },
    {
        "query": "How did corporate support expenses change in 2023, and what were the primary drivers?",
        "response": "Corporate support expenses increased by $33 million in 2023, primarily due to accruals for legal matters and increased compensation expenses, including long-term incentive compensation.",
        "source": "finqa"
    },
    {
        "query": "What are China's targets for passenger vehicle industry fuel consumption for 2025 and 2030?",
        "response": "China has set a target of 4.6L/100km for the 2025 passenger vehicle industry fuel consumption fleet average and is projecting a further reduction to a target of 3.5L/100km in 2030.",
        "source": "finqa"
    },
    {
        "query": "What is the strategic focus of the company's sales and marketing efforts?",
        "response": "The strategic focus of the company's sales and marketing efforts is to increase market penetration geographically, enter new markets by expanding the customer base of distributors, large installers, OEMs, and strategic partners, and to increase the geographic reach and explore new sales channels in addressable markets.",
        "source": "finqa"
    },
    {
        "query": "How does the reserving method for Global Reinsurance differ due to its use of reports from ceding companies?",
        "response": "The reserving method for Global Reinsurance is partly based on claims information reported by ceding companies, making it subject to unique risks such as reporting inaccuracies and delays, limited historical data for some reinsurance contracts, and variability in the number of claims.",
        "source": "finqa"
    },
    {
        "query": "What type of financial statements are mentioned in Item 8 of an Annual Report on Form 10-K?",
        "response": "Consolidated financial statements",
        "source": "finqa"
    },
    {
        "query": "What were the carrying values of the senior notes on January 30, 2022 and on January 29, 2023?",
        "response": "The carrying values of the senior notes were $39,908 million on January 30, 2022 and $39,397 million on January 29, 2023.",
        "source": "finqa"
    },
    {
        "query": "During which years did Mr. Goodarzi lead Intuit’s Financial Services and the professional tax division?",
        "response": "2004 to 2010",
        "source": "finqa"
    },
    {
        "query": "What information is included in Item 3 of the 10-K concerning legal proceedings?",
        "response": "Information regarding legal proceedings is referenced from Note 18 ‘Commitments and Contingencies’ which is included in Item 8 of the 10-K.",
        "source": "finqa"
    },
    {
        "query": "What are Walmart's priority areas in their Environmental, Social, and Governance (ESG) strategy?",
        "response": "Walmart's ESG priorities are categorized into four broad themes: opportunity, sustainability, community, and ethics and integrity.",
        "source": "finqa"
    },
    {
        "query": "What issues can tax authorities raise during the review of income tax returns?",
        "response": "Tax authorities can raise issues regarding filing positions, timing and amount of income and deductions, and the allocation of income among different jurisdictions during the review of income tax returns.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in interest income from 2022 to 2023?",
        "response": "$458 million, or 102%",
        "source": "finqa"
    },
    {
        "query": "How many new Combo Stores did the company operate as of January 28, 2023?",
        "response": "As of January 28, 2023, the company operated approximately 810 Combo Stores.",
        "source": "finqa"
    }
]