[
    {
        "query": "What strategic collaborations did Gilead enter to expand its research and development portfolio?",
        "response": "Gilead entered strategic collaborations with companies like Arcellx Inc. and Tentarix Biotherapeutics Inc. to co-develop and co-commercialize late-stage clinical assets and discover and develop novel therapies across oncology and inflammation using proprietary platforms.",
        "source": "finqa"
    },
    {
        "query": "What was the total alternative assets value for Goldman Sachs as of December 2023?",
        "response": "$485 billion",
        "source": "finqa"
    },
    {
        "query": "How much cash and how many shares of Broadcom common stock did VMware stockholders receive upon completion of the VMware Merger in November 2023?",
        "response": "Upon the completion of the VMware Merger, VMware stockholders received approximately $30.8 billion in cash and 54.4 million shares of Broadcom common stock in aggregate.",
        "source": "finqa"
    },
    {
        "query": "What is the total crude capacity of the GS Caltex Yeosu Refinery in South Korea?",
        "response": "800,000 barrels per day",
        "source": "finqa"
    },
    {
        "query": "How does Optum Health enhance its health care delivery?",
        "response": "Optum Health enhances health care delivery by building a comprehensive, connected health care delivery and engagement platform which includes high-quality direct care, chronic and complex health needs management, and proactive consumer health engagement through various platforms like in-person, in-home, virtual, and digital clinical services.",
        "source": "finqa"
    },
    {
        "query": "What were the reasons for declining equity in net income of affiliates and other income in 2023?",
        "response": "The decline in equity in net income of affiliates was mainly due to underperformance by DIRECTV, despite gains from a sale-leaseback transaction. Other income dropped because of actuarial remeasurement losses of pension assets, impairments, and reduced net pension and postretirement benefit credits.",
        "source": "finqa"
    },
    {
        "query": "What types of costs does Ford Motor Company include in its 'cost of sales' category?",
        "response": "Costs included in the 'cost of sales' category are material costs, freight costs, warranty and product recall costs, labor and other costs related to development and production, depreciation and amortization, and other associated costs.",
        "source": "finqa"
    },
    {
        "query": "How is Amazon's business organized operationally?",
        "response": "Amazon's business is organized into three operational segments: North America, International, and Amazon Web Services (AWS).",
        "source": "finqa"
    },
    {
        "query": "What are the typical initial terms of Hilton's management contracts?",
        "response": "20 to 30 years",
        "source": "finqa"
    },
    {
        "query": "What accounting method is used for the joint venture detailed in the summary?",
        "response": "The joint venture is accounted for as an equity method investment.",
        "source": "finqa"
    },
    {
        "query": "What condition does Synthroid treat and what type of drug is it formulated as?",
        "response": "Synthroid is formulated as levothyroxine sodium tablets and is used in the treatment of hypothyroidism.",
        "source": "finqa"
    },
    {
        "query": "What is the Company's procedure when it determines that an unrealized loss on a debt security is due to market conditions or industry-related events?",
        "response": "The Company assesses whether it intends to sell the debt security or if it is likely that it will need to sell the debt security before the anticipated recovery of the amortized cost basis. If so, it recognizes a non-credit related impairment and writes down the cost basis or carrying amount to fair value.",
        "source": "finqa"
    },
    {
        "query": "What is the accounting treatment of deferred revenue?",
        "response": "Deferred revenue is recognized when there is an obligation to transfer goods or services to a customer and consideration has already been received from the customer.",
        "source": "finqa"
    },
    {
        "query": "What was the value of estimated variable consideration in HP Inc.'s consolidated balance sheets as of October 31, 2023?",
        "response": "$3.1 billion",
        "source": "finqa"
    },
    {
        "query": "What is the interest rate for the 4.500% notes due in August 2034?",
        "response": "4.55%",
        "source": "finqa"
    },
    {
        "query": "What led to the decrease in net cash provided by operating activities in fiscal year 2023?",
        "response": "The decrease in net cash provided by operating activities was due to lower earnings before taxes, working capital management activities, and changes in receivables from contract manufacturers.",
        "source": "finqa"
    },
    {
        "query": "What is a paid membership as defined in the provided context?",
        "response": "A paid membership is defined as a membership that has provided a payment method, is not in a free trial or certain promotions, and has the right to receive service from the company.",
        "source": "finqa"
    },
    {
        "query": "What are the specific structures and legal considerations for a management services organization (MSO) in relation to its relationship with physician owners?",
        "response": "Management services organizations (MSOs) must structure their fees to comply with state fee splitting laws and often use stock transfer restriction agreements and/or other relationships to maintain a 'friendly' relationship with physician owners of the professional corporation.",
        "source": "finqa"
    },
    {
        "query": "What was the valuation allowance against deferred tax assets at the end of 2023, and what changes may affect its realization?",
        "response": "The valuation allowance against deferred tax assets was $7.0 billion at the end of 2023. Realization of these assets depends on generating sufficient taxable income within the provided tax periods, and changes in market conditions, governmental actions, or events could materially affect this.",
        "source": "finqa"
    },
    {
        "query": "Who are Visa's principal competitors in the electronic payments industry?",
        "response": "Visa's principal competitors in the electronic payment space include global or multi-regional networks like American Express, Discover, JCB, Mastercard, and UnionPay.",
        "source": "finqa"
    },
    {
        "query": "What documents follow the signature pages in the report?",
        "response": "The Financial Statements, the accompanying Notes to the Financial Statements, and the Financial Statement Schedule",
        "source": "finqa"
    },
    {
        "query": "How is the fair value of cash equivalents generally determined?",
        "response": "The fair value of cash equivalents is based on a market approach using prices generated by market transactions involving identical or comparable assets.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities in fiscal 2023?",
        "response": "The net cash provided by operating activities in fiscal 2023 was $7,111 million.",
        "source": "finqa"
    },
    {
        "query": "What are the primary types of merchandise offered by Walmart U.S.?",
        "response": "Walmart U.S. primarily offers groceries, general merchandise, and health and wellness products.",
        "source": "finqa"
    },
    {
        "query": "What was the net investment income in 2023 according to the provided data?",
        "response": "$4,937 million",
        "source": "finqa"
    },
    {
        "query": "What was the revenue growth for the integrated kidney care (IKC) business in 2023?",
        "response": "35.2%",
        "source": "finqa"
    },
    {
        "query": "By what percentage did admissions revenues increase during the year ended December 31, 2023 compared to the prior year?",
        "response": "22.7%",
        "source": "finqa"
    },
    {
        "query": "By how much did domestic distribution revenue excluding the Olympics change from 2021 to 2023?",
        "response": "Domestic distribution revenue excluding the Olympics increased from $9,558 million in 2021 to $10,663 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What factors had the largest positive impact on the company's net operating revenues for 2023?",
        "response": "Price, product, and geographic mix",
        "source": "finqa"
    },
    {
        "query": "What were the primary drivers behind the increase in product development expenses in 2023?",
        "response": "The increase in product development expenses in 2023 was primarily driven by an increase in employee related costs as the company continued to innovate and modernize the shopping experience across its platforms.",
        "source": "finqa"
    },
    {
        "query": "What is Biktarvy used for?",
        "response": "Biktarvy is used for the treatment of HIV-1 infection in certain patients.",
        "source": "finqa"
    },
    {
        "query": "What is the revenue recognition method for Marketplace Sales at Chipotle?",
        "response": "Chipotle recognizes revenue for Marketplace Sales when control of the food is transferred to the delivery partner, excluding delivery fees collected by the delivery partner.",
        "source": "finqa"
    },
    {
        "query": "What are the two distinct business segments into which Humana realigned its businesses?",
        "response": "Insurance and CenterWell",
        "source": "finqa"
    },
    {
        "query": "How does the company define comparable sales?",
        "response": "Comparable sales is defined by the company as including comparable company-operated store and all e-commerce net revenue, but excluding sales from new stores that have not been open for at least 12 full fiscal months, from stores which have not been in their significantly expanded space for at least 12 full fiscal months, from stores which have been temporarily relocated for renovations or temporarily closed, and sales from company-operated stores that have closed.",
        "source": "finqa"
    },
    {
        "query": "What are the factors that significantly affect the sales and earnings of a vehicle manufacturer?",
        "response": "The factors that significantly affect the sales and earnings of a vehicle manufacturer include the ability to satisfy changing consumer and business preferences regarding the type or size of vehicle, design and performance characteristics, and the services offered by the vehicles.",
        "source": "finqa"
    },
    {
        "query": "How did the assumptions and estimates used for assessing the fair value of reporting units potentially impact the company's financial statements?",
        "response": "If the assumptions and estimates used in the fair value assessment of reporting units change, this could lead to a required write-down of the carrying value of Goodwill, which might significantly affect the results of operations in the period when the charge is recorded.",
        "source": "finqa"
    },
    {
        "query": "Which year's Proxy Statement includes information regarding executive compensation?",
        "response": "The 2023 Proxy Statement includes information regarding executive compensation.",
        "source": "finqa"
    },
    {
        "query": "Under what captions is the executive compensation information detailed in the 2023 Proxy Statement?",
        "response": "In the 2023 Proxy Statement, the executive compensation information is detailed under the captions 'Executive Compensation', 'Compensation Committee Interlocks and Insider Participation', 'Director Compensation', and 'Compensation Committee Report'.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities in 2023?",
        "response": "Net cash provided by operating activities in 2023 amounted to $11,068.",
        "source": "finqa"
    },
    {
        "query": "What new financial program was announced on February 1, 2024, and what are its specifics?",
        "response": "On February 1, 2024, the initiation of the first ever cash dividend program was announced, with a quarterly dividend of $0.50 per share, equivalent to $2.00 per share annually.",
        "source": "finqa"
    },
    {
        "query": "What total proceeds did Kenvue raise through its initial public offering in May 2023?",
        "response": "$4.2 billion",
        "source": "finqa"
    },
    {
        "query": "What does the Infrastructure Investment and Jobs Act direct the FCC to adopt rules on?",
        "response": "The Infrastructure Investment and Jobs Act directs the FCC to adopt rules facilitating equal access to broadband service by preventing digital discrimination based on factors such as income level, race, or ethnicity.",
        "source": "finqa"
    },
    {
        "query": "How does the GDPR penalize non-compliance in terms of fines?",
        "response": "Under the GDPR, regulatory penalties can reach up to the greater of 4% of worldwide turnover or €20 million.",
        "source": "finqa"
    },
    {
        "query": "What role does Chubb's Chief Risk Officer play in the company's executive structure?",
        "response": "Chubb's Chief Risk Officer reports to the Board's Risk & Finance Committee, which helps execute the Board's supervisory responsibilities pertaining to Enterprise Risk Management (ERM).",
        "source": "finqa"
    },
    {
        "query": "What is the depreciation expense of property and equipment for the year ended December 31, 2023?",
        "response": "$1.1 billion",
        "source": "finqa"
    },
    {
        "query": "When did Carla C. Chavarria start serving as Senior Vice President, Chief Human Resources Officer at AMC?",
        "response": "January 2019",
        "source": "finqa"
    },
    {
        "query": "What amount of commercial paper was outstanding as of September 30, 2023?",
        "response": "$6.0 billion",
        "source": "finqa"
    },
    {
        "query": "When did the injunctive relief ordered in the MDL concerning prescription opiates go into effect?",
        "response": "February 20, 2023",
        "source": "finqa"
    },
    {
        "query": "How does AutoZone manage its foreign operations in terms of currency?",
        "response": "AutoZone accounts for its foreign operations using the local market currency and converts its financial statements from these currencies to U.S. dollars.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage of total level 3 financial liabilities relative to total financial liabilities at fair value for the year 2023?",
        "response": "4.5%",
        "source": "finqa"
    },
    {
        "query": "When was AT&T Inc. incorporated and under which state's laws?",
        "response": "AT&T Inc. was incorporated under the laws of the State of Delaware in 1983.",
        "source": "finqa"
    },
    {
        "query": "What was the net income of The Hershey Company for the year ending December 31, 2023?",
        "response": "$1,861,787,000",
        "source": "finqa"
    },
    {
        "query": "What was the fiscal year 2023 percentage for research and development expenses as a percent of revenue?",
        "response": "The research and development expenses represented 27.2% of revenue in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the Company's effective tax rate for the year ended August 26, 2023?",
        "response": "20.2%",
        "source": "finqa"
    },
    {
        "query": "Is there a cost to access reports filed by Intuit Inc. with the SEC?",
        "response": "No, there is no cost to access reports filed by Intuit Inc. with the SEC; they are available free of charge on the Investor Relations section of their corporate website.",
        "source": "finqa"
    },
    {
        "query": "What products are included in AbbVie’s aesthetics portfolio and where do they hold market-leading positions?",
        "response": "AbbVie’s aesthetics portfolio includes facial injectables, plastics and regenerative medicine, body contouring, and skincare products. They hold market-leading positions in the U.S. and in key markets around the world.",
        "source": "finqa"
    },
    {
        "query": "How many times did the Federal Reserve raise the Fed Funds rate in 2022?",
        "response": "seven times",
        "source": "finqa"
    },
    {
        "query": "What growth strategies are pursued by the Small Business & Self-Employed segment?",
        "response": "They focus on growing the core by transforming financial management software, connecting the ecosystem by meeting a range of customer needs with a single integrated platform, and expanding globally.",
        "source": "finqa"
    },
    {
        "query": "Where in IBM’s 2023 Form 10-K can the Financial Statement Schedule be found?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What types of requirements do some jurisdictions have in place regarding beverage containers?",
        "response": "Various jurisdictions require that deposits or certain ecotaxes or fees be charged in connection with the sale, marketing, and use of certain beverage containers.",
        "source": "finqa"
    },
    {
        "query": "What types of intellectual property rights does Nike maintain?",
        "response": "Nike holds a variety of intellectual property rights including trademarks, copyrights, utility and design patents, and trade secrets that protect aspects such as product designs, technologies, manufacturing processes, and marketing.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's U.S. employees had a retention rate of approximately 90% in 2023?",
        "response": "In 2023, approximately 90% of the company's U.S. employees who have been with the company for at least one year had a retention rate of about 90%.",
        "source": "finqa"
    },
    {
        "query": "What new compliance requirement was established by the CFPB's final rule issued on March 30, 2023, regarding small business credit applications?",
        "response": "The CFPB's final rule issued on March 30, 2023, requires covered financial institutions to collect and report data regarding certain small business credit applications.",
        "source": "finqa"
    },
    {
        "query": "What is the operational name of the Indian Regional Navigation Satellite System used by Garmin?",
        "response": "NavIC",
        "source": "finqa"
    },
    {
        "query": "How is Note 8 relevant to legal proceedings in financial statements detailed in an Annual Report on Form 10-K?",
        "response": "Note 8 is relevant to legal proceedings as it details commitments and contingencies related to such matters in the financial statements within an Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the net impact of catastrophe losses and related adjustments in 2021?",
        "response": "The net impact of catastrophe losses and related adjustments in 2021 was (2,401) million U.S. dollars.",
        "source": "finqa"
    },
    {
        "query": "What is ciltacabtagene autoleucel used for?",
        "response": "Ciltacabtagene autoleucel is used for the treatment of relapsed and refractory multiple myeloma with 1-3 prior lines of therapy.",
        "source": "finqa"
    },
    {
        "query": "How did the FedEx Ground segment's revenue change in 2023?",
        "response": "Increased by 1%",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of hedging programs in relation to foreign currency volatility?",
        "response": "Hedging programs are used to actively monitor foreign currency volatility and attempt to mitigate significant risks associated with it.",
        "source": "finqa"
    },
    {
        "query": "What was the net income (loss) attributable to Las Vegas Sands Corp. for the year 2023?",
        "response": "$1.60",
        "source": "finqa"
    },
    {
        "query": "How are the fair values of intangible assets determined in a business combination?",
        "response": "The fair values of intangible assets in a business combination are determined utilizing information available near the acquisition date, based on expectations and assumptions that are considered reasonable by management.",
        "source": "finqa"
    },
    {
        "query": "How does the corporation's future strategic direction on environmental transition impact its financial performance during the period discussed?",
        "response": "The climate-related initiatives did not result in a significant effect on the corporation's results of operations or financial position during the periods presented.",
        "source": "finqa"
    },
    {
        "query": "What was the total adjusted revenue for Delta Air Lines in 2023?",
        "response": "$54,669 million",
        "source": "finqa"
    },
    {
        "query": "What unique brand positions does GameStop leverage?",
        "response": "GameStop leverages its brand position and unique offerings in the gaming industry to attract partnerships, expand product offerings, and acquire new customers.",
        "source": "finqa"
    },
    {
        "query": "How did the penetration rate of GM Financial's retail sales in the U.S. change from 2022 to 2023?",
        "response": "The penetration rate of GM Financial's retail sales in the U.S. decreased slightly from 43% in 2022 to 42% in 2023.",
        "source": "finqa"
    },
    {
        "query": "Are AbbVie's corporate governance materials available to the public, and if so, where?",
        "response": "Yes, AbbVie's corporate governance materials are available to the public on AbbVie's investor relations website.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities in 2022?",
        "response": "$4.5 billion",
        "source": "finqa"
    },
    {
        "query": "How much common stock did eBay repurchase in 2023?",
        "response": "In 2023, eBay repurchased $1.4 billion of common stock.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the postretirement benefit plan actuarial assumptions?",
        "response": "The actuarial assumptions for postretirement benefit plans are influenced by market conditions, company policies, historical data, and demographic assumptions.",
        "source": "finqa"
    },
    {
        "query": "How are the financial statements and notes in the Annual Report on Form 10-K connected to Part IV?",
        "response": "They follow Part IV and are incorporated by reference into it.",
        "source": "finqa"
    },
    {
        "query": "What is the relationship of the consolidated financial statements to Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are included immediately following Part IV and are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did UnitedHealthcare's total revenues increase from 2022 to 2023?",
        "response": "13%",
        "source": "finqa"
    },
    {
        "query": "How did the Bank of America Corporation's capital ratios under Basel 3 compare at December 31, 2023 and 2022?",
        "response": "At December 31, 2023 and 2022, the Common equity tier 1 capital ratio was 11.8% and 11.2% respectively, the Tier 1 capital ratio was 13.5% and 13.0% respectively, and the Total capital ratio was 15.2% and 14.9% respectively.",
        "source": "finqa"
    },
    {
        "query": "What financial impact is expected from the accelerated retirement of 46 MD-11F aircraft and related engines in 2023 at FedEx Express?",
        "response": "The accelerated retirement is expected to result in a net increase of approximately $12 million in depreciation expense in 2024, with the expense impact in 2025 being immaterial.",
        "source": "finqa"
    },
    {
        "query": "What recent technological advancements has the company implemented in set-top box (STB) solutions?",
        "response": "The company has implemented High Efficiency Video Coding (HEVC) in set-top boxes, which enables ultra-high definition services by effectively doubling the capacity of existing networks to deploy new or existing content.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's 2023 product sales in the U.S. were from three large wholesalers?",
        "response": "Approximately 91%",
        "source": "finqa"
    },
    {
        "query": "What is included in the index mentioned in Item 8?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What was the total operating income for the Company’s segments in the year ended December 30, 2023?",
        "response": "$401 million",
        "source": "finqa"
    },
    {
        "query": "How much did the total payments volume growth rate for Visa Inc. change between 2021 and 2022?",
        "response": "9%",
        "source": "finqa"
    },
    {
        "query": "What was the change in the rate per contract for NYSE cash equities from 2022 to 2023?",
        "response": "increased by 6%",
        "source": "finqa"
    },
    {
        "query": "What caused the drop in gross margin in 2022 from 2021 levels?",
        "response": "The gross margin drop in 2022 was primarily caused by negative mark-to-market impacts from commodity derivative instruments and increased supply chain inflation, including higher logistics and labor costs. These were partially offset by favorable price realizations and volume increases.",
        "source": "finqa"
    },
    {
        "query": "How is mall net operating income (NOI) useful in evaluating mall operating performance?",
        "response": "Commercial property can be exempt from property tax for up to twelve years if the building is newly constructed in Cotai and also qualifies for Tourism Utility Status. The initial exemption is for the first six years.",
        "source": "finqa"
    },
    {
        "query": "What were the purchases of property and equipment, net of proceeds from sales and incentives, for the year ended December 31, 2023?",
        "response": "The purchases of property and equipment, net of proceeds from sales and incentives, for the year ended December 31, 2023, were -$48,133 million.",
        "source": "finqa"
    },
    {
        "query": "What is the primary regulatory authority for Chubb in Bermuda and what are its responsibilities?",
        "response": "The primary regulatory authority for Chubb in Bermuda is the Bermuda Monetary Authority (BMA), which has the power to supervise, investigate, and intervene in the affairs of insurance companies.",
        "source": "finqa"
    },
    {
        "query": "What was the deduction for net recoveries related to allowances for credit losses for the fiscal year ended October 31, 2023?",
        "response": "$12 million",
        "source": "finqa"
    },
    {
        "query": "What types of customers does HP sell to?",
        "response": "HP sells to individual consumers, small- and medium-sized businesses, and large enterprises, including customers in the government, health, and education sectors.",
        "source": "finqa"
    },
    {
        "query": "What impact did extending the amortization period for deferred acquisition and fulfillment contract costs have on AT&T's financials in 2022?",
        "response": "It decreased 'Other cost of revenues' by approximately $395 million, or $0.04 per diluted share from continuing operations for the year ended December 31, 2022.",
        "source": "finqa"
    },
    {
        "query": "What are AMD Radeon PRO graphics cards designed to optimize and for what use cases?",
        "response": "Design workloads for use cases such as 3D rendering, design and manufacturing for CAD, and media and entertainment for broadcast and animation pipelines on high resolution displays.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of stress testing at Bank of America?",
        "response": "The purpose of stress testing at Bank of America is to develop a comprehensive understanding of the potential impacts of on- and off-balance sheet risks on the corporation's financial resiliency. This assists in providing confidence to management, regulators, and investors.",
        "source": "finqa"
    },
    {
        "query": "What are the components of Amazon.com, Inc.'s consolidated financial statements for the years ending on December 31, 2023?",
        "response": "The components of Amazon.com, Inc.'s consolidated financial statements for the years ending on December 31, 2023, include consolidated balance sheets, consolidated statements of operations, consolidated statements of comprehensive income (loss), consolidated statements of stockholders' equity, and consolidated statements of cash flows.",
        "source": "finqa"
    },
    {
        "query": "What is the minimum amount of consolidated cash, cash equivalents, and U.S. Treasury Bills Berkshire aims to maintain?",
        "response": "Berkshire aims to maintain at least $30 billion in consolidated cash, cash equivalents, and U.S. Treasury Bills.",
        "source": "finqa"
    },
    {
        "query": "What was the total intrinsic value of options exercised in 2023, and how does it compare to the values in 2022 and 2021?",
        "response": "The total intrinsic value of options exercised in 2023 was $35,474, which shows a decrease when compared to $40,882 in 2022 and $38,645 in 2021.",
        "source": "finqa"
    },
    {
        "query": "What legal action did Janssen Pharmaceuticals, Inc. take regarding the Inflation Reduction Act?",
        "response": "Janssen filed litigation against the U.S. Department of Health and Human Services and the Centers for Medicare and Medicaid Services, challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program.",
        "source": "finqa"
    },
    {
        "query": "What was the guaranty fund contribution to ICE Clear Europe as of December 31, 2022?",
        "response": "$50 million",
        "source": "finqa"
    },
    {
        "query": "What does COPPA restrict and how does it affect the company's operations?",
        "response": "COPPA restricts the collection of information from children under the age of thirteen, placing limitations on the company regarding advertising to children and collecting data from them.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash and temporary cash investments at the end of 2022?",
        "response": "$1.0 billion",
        "source": "finqa"
    },
    {
        "query": "What was the amount of AT&T's currency translation adjustments reported in their investments in equity affiliates for the year 2023?",
        "response": "$61 million",
        "source": "finqa"
    },
    {
        "query": "Which operating systems received updates in the third quarter of 2023?",
        "response": "In the third quarter of 2023, updates were made to iOS 17, macOS Sonoma, iPadOS 17, tvOS 17, and watchOS 10.",
        "source": "finqa"
    },
    {
        "query": "How much did the net investment income change from 2021 to 2023?",
        "response": "Increased by 43.0%",
        "source": "finqa"
    },
    {
        "query": "What does 'Item 15. Exhibits and Financial Statement Schedules' include according to the report?",
        "response": "Exhibits and Financial Statement Schedules",
        "source": "finqa"
    },
    {
        "query": "How much did FedEx Express improve its vehicle fleet efficiency from a 2005 baseline by 2022?",
        "response": "40%",
        "source": "finqa"
    },
    {
        "query": "What were the primary reasons for the increase in selling, general and administrative expenses in 2023 compared to 2022?",
        "response": "The increase in selling, general and administrative expenses in 2023 compared to 2022 was primarily due to a $525 million litigation expense for settlements in the HIV antitrust litigation and increased commercial activities in oncology and HIV, slightly offset by a $406 million non-recurring charge in 2022.",
        "source": "finqa"
    },
    {
        "query": "How did Hasbro aim to transform its business in fiscal year 2023?",
        "response": "In fiscal year 2023, Hasbro aimed to transform its business through a revised strategic plan that focused on creating efficiencies in the supply chain, improving inventory positions, lowering costs, and reinvesting in the business. This included selling non-core parts of the business and strengthening strategic investments in valuable and profitable franchises.",
        "source": "finqa"
    },
    {
        "query": "What is the maturity date of the $7.0 billion revolving credit facility?",
        "response": "May 2028",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Iron Mountain's Living Legacy Initiative?",
        "response": "To help preserve and make accessible cultural and historical information and artifacts.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Starbucks' total net revenues in fiscal 2023 was contributed by company-operated stores?",
        "response": "82%",
        "source": "finqa"
    },
    {
        "query": "What was the carrying amount of property and equipment net of accumulated depreciation for Delta Air Lines in 2023?",
        "response": "$35,486 million",
        "source": "finqa"
    },
    {
        "query": "What will be recognized as income tax benefits if the realization of deferred tax assets becomes more-likely-than-not?",
        "response": "Deferred tax assets will be recognized as income tax benefits if their realization becomes more-likely-than-not.",
        "source": "finqa"
    },
    {
        "query": "What factors does the company's management consider when assessing the realization of deferred tax assets?",
        "response": "The company's management considers the scheduled reversal of deferred tax liabilities, projected future taxable income, available tax planning strategies, and foreign tax credit utilization when assessing the realization of deferred tax assets.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule for IBM's Form 10-K be found?",
        "response": "The Financial Statement Schedule for IBM's Form 10-K can be found on page S-1.",
        "source": "finqa"
    },
    {
        "query": "What adjustments did Dollar Tree report related to foreign currency translation for the fiscal years ending in January 2021 and January 2023?",
        "response": "2021: $4.6 million, 2023: ($6.0) million",
        "source": "finqa"
    },
    {
        "query": "What was the credit exposure from corporate loans and lending commitments for Goldman Sachs as of December 2023, categorized by industry?",
        "response": "As of December 2023, the credit exposure for corporate loans and lending commitments at Goldman Sachs was categorized by industry as follows: Consumer & Retail (12%), Diversified Industrials (20%), Financial Institutions (9%), Funds (3%), Healthcare (10%), Natural Resources & Utilities (16%), Real Estate (7%), and Technology, Media & Telecommunications (25%).",
        "source": "finqa"
    },
    {
        "query": "What global changes affected Enphase Energy’s business operations in 2023?",
        "response": "In 2023, Enphase Energy was impacted by global inflationary pressures, interest rate fluctuations, currency exchange rates, potential economic slowdowns, recessions, geopolitical pressures, and the impacts of trade regulations and armed conflicts in Ukraine, the Gaza Strip, and nearby regions.",
        "source": "finqa"
    },
    {
        "query": "What method is used to calculate the dilutive effect of equity awards and what does it assume?",
        "response": "The dilutive effect of equity awards is calculated using the treasury stock method, which assumes that the amount the employee must pay for exercising stock options and purchasing shares under the ESPP, along with the unrecognized compensation cost for future service, will be used to repurchase shares.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash flow generated from financing activities for the year ended December 31, 2022?",
        "response": "$6.15 billion",
        "source": "finqa"
    },
    {
        "query": "What is mentioned under Item 3 in the context provided?",
        "response": "Legal Proceedings",
        "source": "finqa"
    },
    {
        "query": "How much did the cost of revenues decrease by in the year ended December 31, 2023 compared to 2022?",
        "response": "$123.9 million",
        "source": "finqa"
    },
    {
        "query": "Who shares responsibility for the civil penalties according to the terms of the consent agreement with the EPA?",
        "response": "GM and Ultium Cells LLC",
        "source": "finqa"
    },
    {
        "query": "How can state legislation affect a company's use of limited pharmacy provider networks?",
        "response": "State legislation, such as 'any willing provider' laws, may require companies to include any pharmacy in their network that meets the plan's conditions, potentially compromising the benefits of having a limited network. This could negatively impact the economic benefits and services achievable through restricted networks.",
        "source": "finqa"
    },
    {
        "query": "What factors contribute to the variability of the Total Remaining Deal Value?",
        "response": "The Total Remaining Deal Value may change due to the majority of contracts being subject to termination provisions, the potential non-exercise of contracts options by customers, and ongoing assessments of customer's financial conditions which might affect the value of certain commercial contracts for revenue recognition.",
        "source": "finqa"
    },
    {
        "query": "How does the company plan to conduct its share repurchases?",
        "response": "The company may conduct share repurchases through various methods including open market purchases, plans meeting the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act, privately negotiated transactions, block trades, accelerated share repurchase programs, or a combination of such methods depending on market conditions and deemed appropriate prices.",
        "source": "finqa"
    },
    {
        "query": "Why might developers be less inclined to develop or upgrade software for the Company's products?",
        "response": "The Company's minority market share in the global smartphone, personal computer, and tablet markets might make developers less inclined to develop or upgrade software for the Company's products and more inclined to focus on competitors' products with larger market shares.",
        "source": "finqa"
    },
    {
        "query": "What are the actuarial assumptions for retirement plans discount rate and rate of increase in compensation levels in 2023?",
        "response": "The service cost discount rate for retirement plans in 2023 was 4.85%, and the rate of increase in compensation levels was 3.71%.",
        "source": "finqa"
    },
    {
        "query": "What are the implications of a failure to comply with the FRB's TLAC and related requirements for a company like Group Inc.?",
        "response": "Failure to comply with the FRB’s TLAC and related requirements may result in restrictions imposed by the FRB, which could limit the company's ability to repurchase shares, pay dividends, and make certain discretionary compensation payments.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of the company's cash commitments as of December 31, 2023?",
        "response": "$2,957,766 thousand",
        "source": "finqa"
    },
    {
        "query": "What new products and partnerships did lululemon introduce in 2023?",
        "response": "In 2023, lululemon launched new products including Wundermost, Steady State, and Soft Jersey collections. They also updated Blissfeel and Chargefeel footwear styles and introduced their first footwear styles for men. Additionally, they announced a textile-to-textile recycling partnership and a new partnership with Peloton, making them the exclusive provider of content for lululemon Studio members and their primary apparel provider.",
        "source": "finqa"
    },
    {
        "query": "Why is the Asia Pacific reporting unit considered at risk of future goodwill impairment?",
        "response": "The Asia Pacific reporting unit is considered at risk of future goodwill impairment due to the relatively smaller excess of fair value over carrying value, making it susceptible to changes in economic conditions such as rising interest rates and inflation.",
        "source": "finqa"
    },
    {
        "query": "What was the change in infrastructure software's operating income from fiscal year 2022 to 2023?",
        "response": "$420 million increase",
        "source": "finqa"
    },
    {
        "query": "What was the interest rate for the Revolving Credit Facility on January 28, 2023?",
        "response": "5.79%",
        "source": "finqa"
    },
    {
        "query": "What is the expected amount of pension benefit payments for the year 2024?",
        "response": "$3,185 million",
        "source": "finqa"
    },
    {
        "query": "How do companies in the interactive entertainment industry adapt to rapidly changing technology?",
        "response": "Companies in the interactive entertainment industry adapt to rapidly changing technology by focusing on developing new technologies, such as self-learning artificial intelligence for games, and enhancing existing products and services. This adaptability is crucial to maintaining competitiveness.",
        "source": "finqa"
    },
    {
        "query": "What documents are referenced in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are referenced.",
        "source": "finqa"
    },
    {
        "query": "What critical accounting estimates were identified as having the greatest potential impact on the financial statements?",
        "response": "The estimates associated with loss contingencies, income taxes, and valuation of assets were identified as having the greatest potential impact on the financial statements.",
        "source": "finqa"
    },
    {
        "query": "How much did Google Services' operating income increase from 2022 to 2023?",
        "response": "$13.2 billion",
        "source": "finqa"
    },
    {
        "query": "What were the primary investing activities mentioned for the year ended December 31, 2023?",
        "response": "The primary investing activities included cash paid for the acquisitions of Depop and Elo7, purchases and sales and maturities of short- and long-term investments, and capital expenditures, including investments in capitalized website development and internal-use software.",
        "source": "finqa"
    },
    {
        "query": "What are the trademark protections owned by the company?",
        "response": "The company owns a trademark portfolio with protections in 170 countries for its primary brands AIRBNB and the Bélo logo, as well as worldwide protections for other brands or protectable brand elements including Rausch, their primary corporate color, localizations, translations, and transliterations of their primary brands, and brands associated with businesses they have acquired.",
        "source": "finqa"
    },
    {
        "query": "What is the definition of Adjusted EPS at Iron Mountain and why is it considered valuable?",
        "response": "Adjusted EPS is defined by Iron Mountain as reported earnings per share fully diluted from net income attributable to Iron Mountain Incorporated, excluding certain items such as acquisition and integration costs, restructuring and other transformation costs, and amortization related to the write-off of certain customer relationship intangible assets, among others. It is considered valuable as it allows investors to compare results from past, present, and future periods without the effects of non-core operating expenses.",
        "source": "finqa"
    },
    {
        "query": "What does IBM's hybrid cloud platform aim to achieve for clients?",
        "response": "IBM's hybrid cloud platform supports clients' digital transformations and helps them modernize applications to increase agility, drive innovation, and create operational efficiencies.",
        "source": "finqa"
    },
    {
        "query": "What were the total sales for Oncology products in 2023?",
        "response": "$17.7 billion",
        "source": "finqa"
    },
    {
        "query": "What were the primary factors that led to the decline in gross margin for fiscal year 2023?",
        "response": "The decline in gross margin in fiscal year 2023 was primarily driven by competitive pricing and foreign currency impacts.",
        "source": "finqa"
    },
    {
        "query": "What were the primary reasons for the decrease in other current liabilities from 2022 to 2023?",
        "response": "Decreases in contract liabilities and income taxes payable",
        "source": "finqa"
    },
    {
        "query": "What amount of debt obligations did the company have as of December 30, 2023?",
        "response": "$2.5 billion",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule for IBM's Form 10-K be found?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What was the increase percentage of AbbVie's quarterly cash dividend announced on October 26, 2023?",
        "response": "Approximately 4.7%",
        "source": "finqa"
    },
    {
        "query": "What were aggregate liabilities for unrecognized tax benefits as of January 29, 2023?",
        "response": "$643 million",
        "source": "finqa"
    },
    {
        "query": "How are collateral requirements for captive reinsurance companies managed?",
        "response": "Collateral requirements for captive reinsurance companies are generally managed by obtaining collateral equal to the expected losses that may be ceded to the captive. Exceptions to this requirement are granted only after senior management review.",
        "source": "finqa"
    },
    {
        "query": "What long-term effects do legislative, regulatory, and platform changes have on advertising revenue?",
        "response": "The company expects that legislative, regulatory, and platform changes will continue to adversely impact advertising revenue indefinitely.",
        "source": "finqa"
    },
    {
        "query": "How are net realized capital gains and losses treated in the financial statements according to the Company?",
        "response": "Net realized capital gains and losses, arising primarily from portfolio management, are recorded in the consolidated statements of operations in net investment income within each segment and are excluded from non-GAAP measures as they do not directly relate to the Company's core business operations.",
        "source": "finqa"
    },
    {
        "query": "What are the two business segments of Johnson & Johnson?",
        "response": "Innovative Medicine and MedTech",
        "source": "finqa"
    },
    {
        "query": "How much cash did Hasbro generate from operating activities in the year 2021?",
        "response": "$817.9 million",
        "source": "finqa"
    },
    {
        "query": "What factors led to the 7% decrease in U.S. Information Solutions revenue in 2022 compared to 2021?",
        "response": "The decrease was primarily due to the negative impact of declining mortgage inquiry volumes and a decline in marketing solutions, partially offset by growth in non-mortgage online services and acquisition-related revenue.",
        "source": "finqa"
    },
    {
        "query": "How much was the impairment related to the CAT loan receivable in 2023?",
        "response": "The impairment related to the CAT loan receivable was $16 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did net proceeds from the issuance of the 7% Notes due 2029 amount to in 2023?",
        "response": "$990,000",
        "source": "finqa"
    },
    {
        "query": "What was the total net revenue for the fiscal year 2023?",
        "response": "The total net revenue for fiscal year 2023 was $7,426 million.",
        "source": "finqa"
    },
    {
        "query": "What types of assets are classified under 'Earning Assets' in a financial context?",
        "response": "Earning Assets are classified as assets primarily comprising of total finance receivables net of unearned income, plus equipment on operating leases net of accumulated depreciation.",
        "source": "finqa"
    },
    {
        "query": "What was the effect of prior-period medical claims reserve development on the Insurance segment's benefit ratio in 2023?",
        "response": "Decreased the Insurance segment benefit ratio by approximately 90 basis points",
        "source": "finqa"
    },
    {
        "query": "How are legal proceedings described in the Annual Report?",
        "response": "Legal proceedings are described in Note 14 to the consolidated financial statements, which is part of Item 8 in the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "Where is the financial statement schedule in IBM's 2023 Form 10-K?",
        "response": "On page S-1.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily drove the increase in net cash provided by operating activities for fiscal 2023?",
        "response": "The increase in net cash provided by operating activities for fiscal 2023 was primarily due to moderated levels of inventory purchases, partially offset by a decline in operating income and the timing of certain payments.",
        "source": "finqa"
    },
    {
        "query": "How much cash collateral did AT&T receive on a net basis during 2023?",
        "response": "$220",
        "source": "finqa"
    },
    {
        "query": "How are the translation adjustments of foreign entity operations recorded in financial statements?",
        "response": "Translation adjustments are recorded in accumulated other comprehensive loss on the consolidated balance sheets.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net earnings from 2022 to 2023?",
        "response": "12%",
        "source": "finqa"
    },
    {
        "query": "What steps has the company taken to manage cybersecurity risks?",
        "response": "The company operates an Information Security program designed to prevent, detect, track, and mitigate cyber incidents, which has detected and mitigated such incidents in the past.",
        "source": "finqa"
    },
    {
        "query": "What are the pre-tax and after-tax adjustments for goodwill and fixed asset impairment charges related to Vitacost.com?",
        "response": "$164",
        "source": "finqa"
    },
    {
        "query": "What is the primary role of NVIDIA's partner network in system design?",
        "response": "NVIDIA's partner network is primarily involved in designing, testing, and qualifying system designs that incorporate NVIDIA's platforms.",
        "source": "finqa"
    },
    {
        "query": "How much was the statutory federal income tax expense at 21% for the years ended December 30, 2023, December 31, 2022, and December 25, 2021?",
        "response": "The statutory federal income tax expense at 21% was $107 million for the year ended December 30, 2023, $252 million for the year ended December 31, 2022, and $772 million for the year ended December 25, 2021.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock did CSC repurchase during the year ended December 31, 2023, and what was the total cost?",
        "response": "CSC repurchased 37 million shares of its common stock for $2.8 billion during the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How do competitors of Apple primarily compete in the market?",
        "response": "Competitors primarily compete through aggressive pricing and very low cost structures, by imitating Apple's products and infringing on its intellectual property.",
        "source": "finqa"
    },
    {
        "query": "What were the dividend amounts declared by AT&T for its preferred and common shares in December 2022 and December 2023?",
        "response": "In December 2022 and December 2023, AT&T declared a quarterly preferred dividend of $36 and a quarterly common dividend of $0.2775 per share of common stock.",
        "source": "finqa"
    },
    {
        "query": "How is information about legal proceedings included in financial statements?",
        "response": "Information about legal proceedings is included as part of Note 14 in the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What action did the Circuit Court take on July 17, 2023, regarding Apple's motion?",
        "response": "The Circuit Court granted Apple’s motion to stay enforcement of the injunction pending appeal to the U.S. Supreme Court.",
        "source": "finqa"
    },
    {
        "query": "What is the scope of the report by PricewaterhouseCoopers LLP dated February 16, 2024?",
        "response": "The report covers the Consolidated Financial Statements and the Notes thereto.",
        "source": "finqa"
    },
    {
        "query": "How does Alphabet expect to manage the fluctuating costs associated with Traffic Acquisition Costs (TAC)?",
        "response": "Alphabet anticipates that the TAC paid to partners will increase with revenue growth and will be influenced by factors such as device and geographic mix, partner agreements, and the percentage of paid queries.",
        "source": "finqa"
    },
    {
        "query": "What percentage of total alternative investments by vintage were allocated to the year 2020 or thereafter as of December 2023?",
        "response": "49%",
        "source": "finqa"
    },
    {
        "query": "What technology is featured in the Ryzen 7000 and 5000 Series to improve gaming performance?",
        "response": "AMD 3D V-Cache technology",
        "source": "finqa"
    },
    {
        "query": "What was the impact on the Company's total net revenues from changes in bank deposit account fee revenue due to interest rate changes in 2023?",
        "response": "Simulated changes in bank deposit account fee revenue due to shifts in market interest rates did not have a significant impact on the Company’s total net revenues in 2023.",
        "source": "finqa"
    },
    {
        "query": "What sections of IBM’s 2023 Annual Report to Stockholders are incorporated by reference in Item 8 of the Form 10-K?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What are the primary reasons for the company's valuation allowances?",
        "response": "The company's valuation allowances are primarily related to U.S. capital loss carryforwards, net operating loss carryforwards in various foreign jurisdictions, and other deferred tax assets.",
        "source": "finqa"
    },
    {
        "query": "Where does the Report of Independent Registered Public Accounting Firm begin in this report?",
        "response": "It begins on page 105, immediately following the signature pages.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the recording of the Company's credit-related contingent features in financial statements?",
        "response": "The Company records amounts associated with credit-related contingent features in various ways depending on the nature of the collateral involved. Cash collateral posted is recorded under 'Prepaid expenses and other current assets' and offsets against the company’s derivative liability balance. Conversely, cash collateral received is presented in the 'Cash provided by operations' component of the Consolidated Statements of Cash Flows. Non-cash collateral received, such as securities, is not recognized on the Consolidated Balance Sheets.",
        "source": "finqa"
    },
    {
        "query": "In which item of the Annual Report can the information required by Item 8 be found?",
        "response": "Item 15(a)",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the Jazwares acquisition on the consumer products group's revenues in 2023?",
        "response": "The Jazwares acquisition contributed $1.3 billion to the consumer products group's revenues in 2023.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in operating expenses in the Health Services segment in 2023 compared to 2022?",
        "response": "The increase in operating expenses in 2023 was primarily due to operations associated with Oak Street Health and Signify Health, including the amortization of acquired intangible assets.",
        "source": "finqa"
    },
    {
        "query": "What do AMD Ryzen Threadripper PRO 7000 WX-Series processors provide across multiple workstation workloads?",
        "response": "Full-spectrum performance",
        "source": "finqa"
    },
    {
        "query": "How do Medicare Advantage star ratings impact the financial reimbursements of plans?",
        "response": "Medicare Advantage plans with a star rating of 4 or more out of 5 are eligible for quality bonuses in their basic premium rates, which impacts their financial reimbursements.",
        "source": "finqa"
    },
    {
        "query": "What is the effective date for the fifteen percent minimum tax based on adjusted financial statement income as specified in the Inflation Reduction Act of 2022?",
        "response": "The fifteen percent minimum tax based on adjusted financial statement income is effective for NIKE beginning June 1, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in operating expenses in 2023 compared to 2022?",
        "response": "33.9%",
        "source": "finqa"
    },
    {
        "query": "What are the three types of intangible assets listed and their respective net carrying amounts as of December 31, 2023?",
        "response": "The three types of intangible assets listed are marketed products, acquired IPR&D, and other intangibles. The net carrying amounts as of December 31, 2023 are $5,939.8 million for marketed products, $966.8 million for acquired IPR&D, and $6,906.6 million for other intangibles.",
        "source": "finqa"
    },
    {
        "query": "What is Chevron's approach towards maintaining a diverse and inclusive supply chain?",
        "response": "Chevron aims to support a supply chain that reflects the diversity of the communities where it operates, believing that a diverse supply chain contributes to the company's success and growth.",
        "source": "finqa"
    },
    {
        "query": "What is the planned start-up period for the Future Growth Project (FGP) in Kazakhstan?",
        "response": "first half 2025",
        "source": "finqa"
    },
    {
        "query": "What were the financial impacts on Cruise due to the suspension and subsequent operational pause?",
        "response": "Cruise recorded restructuring charges of $0.5 billion in the three months ending December 31, 2023, and anticipates $1.0 billion in reduced expenses in 2024.",
        "source": "finqa"
    },
    {
        "query": "What does 'incorporated by reference' mean in the context of a Form 10-K?",
        "response": "'Incorporated by reference' indicates that the information is not listed directly under the current section but can be found detailed in another specified part of the same document.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash used in operating activities for the respective periods listed?",
        "response": "In the first period, the net cash used in operating activities was $215.2 million, in the second period it was $628.5 million, and in the third period it was $614.1 million.",
        "source": "finqa"
    },
    {
        "query": "What was the net income for the year 2023 and how did it compare to 2022?",
        "response": "The net income for the year 2023 was $4,792 million, which was a significant increase from $1,893 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the FDA approval history and purpose of Elahere?",
        "response": "Elahere received FDA accelerated approval on November 14, 2022, for the treatment of adult patients with FRα positive, platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal cancer, who have received one to three prior systemic treatment regimens.",
        "source": "finqa"
    },
    {
        "query": "How is the inventory at distribution centers valued, and what method is used for store inventories?",
        "response": "Inventory at distribution centers is valued at the lower of cost or net realizable value using a weighted-average basis, while store inventories are assigned cost using the retail inventory method on a weighted-average basis.",
        "source": "finqa"
    },
    {
        "query": "How are revenues from MERS database recognized?",
        "response": "Revenues from the MERS database are primarily recorded at the point in time of each transaction related to new loan registration and future transfers.",
        "source": "finqa"
    },
    {
        "query": "How much cash and cash equivalents did Gentiva Hospice dispose of on August 11, 2022?",
        "response": "$73 million",
        "source": "finqa"
    },
    {
        "query": "Which pages of IBM’s 2023 Annual Report provide information on Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "Why did NVIDIA and SoftBank terminate their Share Purchase Agreement for acquiring Arm Limited?",
        "response": "NVIDIA and SoftBank terminated their Share Purchase Agreement due to significant regulatory challenges that prevented the completion of the transaction.",
        "source": "finqa"
    },
    {
        "query": "How did the interest expense in 2023 compare to 2022?",
        "response": "Interest expense decreased by $10.4 million to $62.4 million in 2023 from $72.8 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What information is provided under Item 8 of a financial document?",
        "response": "An index to Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What is the maximum leverage ratio allowed before default under the company's credit facility?",
        "response": "3.50 to 1",
        "source": "finqa"
    },
    {
        "query": "What did the auditor’s report dated February 9, 2024, state about the effectiveness of Enphase Energy’s internal control over financial reporting as of December 31, 2023?",
        "response": "The report stated that Enphase Energy maintained, in all material respects, effective internal control over financial reporting as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the format used to incorporate details from another section in a Form 10-K?",
        "response": "The format used is incorporation by reference, where information is not directly included but is detailed in another section as specified.",
        "source": "finqa"
    },
    {
        "query": "What is the basis for the preparation of Palantir Technologies Inc.'s consolidated financial statements?",
        "response": "Palantir Technologies Inc.'s consolidated financial statements are prepared in accordance with U.S. generally accepted accounting principles (GAAP) and the rules and regulations of the Securities and Exchange Commission regarding annual financial reporting.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the Pharmacy & Consumer Wellness segment's revenues did the pharmacy category constitute in 2023?",
        "response": "78.9%",
        "source": "finqa"
    },
    {
        "query": "How much did the net income for automotive activities increase from 2021 to 2023?",
        "response": "$2.3 billion",
        "source": "finqa"
    },
    {
        "query": "What was the change in cash and cash equivalents for Advanced Micro Devices, Inc. from the beginning to the end of the year 2023?",
        "response": "Decrease of $902 million",
        "source": "finqa"
    },
    {
        "query": "What were the ending balances for Medicaid and Medicare Rebates, Managed Care Rebates, and Wholesaler Chargebacks as of December 31, 2023?",
        "response": "The ending balances as of December 31, 2023 were $5,297 million for Medicaid and Medicare Rebates, $7,020 million for Managed Care Rebates, and $1,172 million for Wholesaler Chargebacks.",
        "source": "finqa"
    },
    {
        "query": "What was the weighted-average fair value of Restricted Stock Units (RSUs) granted in 2023, 2022, and 2021?",
        "response": "The weighted-average fair values of RSU awards granted in 2023, 2022, and 2021 were $339.30, $239.88, and $196.30, respectively.",
        "source": "finqa"
    },
    {
        "query": "What are some factors considered when evaluating goodwill for impairment?",
        "response": "Macroeconomic, industry, and market factors, as well as cost factors, changes in overall financial performance, and other relevant events and uncertainties.",
        "source": "finqa"
    },
    {
        "query": "What changes were made to the LVSC Revolving Credit Agreement according to the Fourth Amendment enacted on January 30, 2023?",
        "response": "The Fourth Amendment to the LVSC Revolving Credit Agreement on January 30, 2023, included changes such as determining consolidated adjusted EBITDA on a year-to-date annualized basis, extending the minimum liquidity requirement to December 31, 2023, and extending restrictions on dividends and distributions unless liquidity exceeds $1.0 billion on a pro forma basis after such distributions, to the same date.",
        "source": "finqa"
    },
    {
        "query": "How are revenue recognition and Gross-to-Net deductions related in the context of product sales?",
        "response": "Revenue from product sales is recognized when control of the product is transferred to the customer, generally upon shipment or delivery, and it is net of estimated rebates and chargebacks, patient co-pay assistance, prompt pay discounts, distributor fees, sales return provisions, and other related deductions. These deductions, known as Gross-to-Net deductions, are estimated and recorded in the period in which the related product sales occur.",
        "source": "finqa"
    },
    {
        "query": "How does HPE's Board of Directors contribute to its human capital management strategy?",
        "response": "HPE's Board of Directors contributes to its human capital management strategy by actively overseeing through the HR and Compensation Committee, which handles oversight of human resources and workforce management programs, including diversity and inclusion initiatives.",
        "source": "finqa"
    },
    {
        "query": "What is the primary purpose of using floating-to-fixed interest rate contracts according to the company's hedging strategy?",
        "response": "The primary purpose of using floating-to-fixed interest rate contracts in the company's hedging strategy is to protect against the variability of cash flows due to changes in the benchmark interest rate.",
        "source": "finqa"
    },
    {
        "query": "How much in total exit and related costs does the company expect to incur, and what are these costs primarily related to?",
        "response": "The company expects to incur total exit and related costs of approximately $500 million, primarily related to employee compensation and benefits and facility exit costs.",
        "source": "finqa"
    },
    {
        "query": "How did the introduction of the IRA benefit Enphase Energy in 2023?",
        "response": "The IRA, enacted in August 2022, benefitted Enphase Energy in 2023 by extending the ITC and introducing the AMPTC, which incentivizes clean energy sourcing and boosts microinverter production. It also provided an additional 10% ITC for solar system components with a minimum threshold of domestic content.",
        "source": "finqa"
    },
    {
        "query": "What fundamental shift in behaviors does Airbnb believe to have changed due to the COVID-19 pandemic?",
        "response": "Airbnb believes that the ways people approach work, living, and travel have fundamentally changed due to new behaviors developed during the COVID-19 pandemic.",
        "source": "finqa"
    },
    {
        "query": "What was the aggregate intrinsic value of exercised stock options as of December 30, 2023?",
        "response": "$205 million",
        "source": "finqa"
    },
    {
        "query": "What is the required increase in non-gaming investment for the company if Macao's annual gross gaming revenue exceeds a certain threshold?",
        "response": "The company is required to increase its non-gaming investment projects by up to 20% if Macao's annual market gross gaming revenue achieves or exceeds 180 billion patacas.",
        "source": "finqa"
    },
    {
        "query": "What were the total gains or losses on debt securities recognized in other income (expense), net for the year ended December 31, 2023?",
        "response": "A total loss of $1,215 million",
        "source": "finqa"
    },
    {
        "query": "When was Palantir founded and for what initial purpose?",
        "response": "Palantir was founded in 2003 with the initial purpose of building software for the U.S. intelligence community to assist in counterterrorism investigations and operations.",
        "source": "finqa"
    },
    {
        "query": "What is the main focus of the company's research and development efforts?",
        "response": "The main focus of the company's research and development efforts is on enhancements to existing products, cost efficiencies, and the development of new products that utilize technological innovations to reduce costs, improve functionality, and enhance reliability.",
        "source": "finqa"
    },
    {
        "query": "How much in client assets did The Charles Schwab Corporation have at the end of 2023?",
        "response": "$8.52 trillion",
        "source": "finqa"
    },
    {
        "query": "What are the primary uses of FBAR technology in cellular RF applications?",
        "response": "FBAR technology is primarily used in cellular RF applications to improve mobile handset efficiency by enhancing signal filtration and module integration.",
        "source": "finqa"
    },
    {
        "query": "What type of matters are encompassed within Item 3. Legal Proceedings in a financial report?",
        "response": "Litigation and Regulatory Matters are encompassed within Item 3. Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "What legal obligations does the company have regarding tax filings?",
        "response": "The company is required to file income tax returns in the U.S. and various foreign jurisdictions.",
        "source": "finqa"
    },
    {
        "query": "How did the cash flow from operating activities change in fiscal 2022 compared to fiscal 2021?",
        "response": "It decreased by $2.0 billion",
        "source": "finqa"
    },
    {
        "query": "What does the term 'constant dollar changes' in finance signify as explained in the text?",
        "response": "Constant dollar changes in finance refer to adjustments made in financial calculations to exclude the impact of changes in foreign currency exchange rates, thus reflecting the underlying growth rate of net revenue.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Chevron’s U.S. refinery inputs was imported crude oil in 2023 and 2022?",
        "response": "60 percent",
        "source": "finqa"
    },
    {
        "query": "What were the total non-cash impairment charges recognized by the company in 2022?",
        "response": "The company recognized total non-cash impairment charges of $1.0 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of using non-GAAP financial measures in management's discussion and analysis?",
        "response": "Non-GAAP financial measures are used to provide additional information for determining the optimum capital structure and assist management in evaluating performance and making business decisions to maximize stockholders' value.",
        "source": "finqa"
    },
    {
        "query": "What factors does the company consider in estimating the replacement cost for warranty provisions?",
        "response": "The company considers three factors in estimating the replacement cost for warranty provisions which include the estimated cost of replacement products, the estimated cost to ship replacement products to end users, and the estimated labor reimbursement expected to be paid to third-party installers or the labor cost incurred by field service technicians performing replacement services.",
        "source": "finqa"
    },
    {
        "query": "What statutory requirements must insurance and reinsurance subsidiaries meet in their domiciled jurisdictions?",
        "response": "Insurance and reinsurance subsidiaries are required to maintain minimum levels of statutory capital, surplus, and liquidity, meet solvency standards, and undergo periodic examinations of their financial condition.",
        "source": "finqa"
    },
    {
        "query": "What is AmBisome used for?",
        "response": "AmBisome is used for the treatment of serious invasive fungal infections caused by various fungal species in adults.",
        "source": "finqa"
    },
    {
        "query": "What did Hewlett Packard Enterprise discuss in the Management's Discussion and Analysis (MD&A) section of their Form 10-K for fiscal year 2022?",
        "response": "The MD&A section discussed fiscal 2023 and fiscal 2022 items, year-to-year comparisons between these years, and provided a discussion on trends and uncertainties, executive overview, critical accounting policies and estimates, results of operations, liquidity and capital resources, and GAAP to Non-GAAP reconciliations.",
        "source": "finqa"
    },
    {
        "query": "Does Item 15(a) serve as a reference point for other sections within the annual report regarding financial information?",
        "response": "Yes, it serves as a reference for Item 8.",
        "source": "finqa"
    },
    {
        "query": "How does Comcast support the emotional wellbeing of its employees?",
        "response": "Comcast offers an Employee Assistance Program providing personal counseling, digital emotional wellbeing tools for managing stress, anxiety, depression, and substance use, and other support services.",
        "source": "finqa"
    },
    {
        "query": "What roles are included in the composition of the Global Credit Committee?",
        "response": "The Global Credit Committee includes senior executives such as the Chief Financial Officer, Chief Risk Officer, Chief Investment Officer, and Treasurer.",
        "source": "finqa"
    },
    {
        "query": "What is anticipated regarding the supply of incretin products and the operational status of additional manufacturing capacity?",
        "response": "It is anticipated that tight supplies of incretin products will persist while additional manufacturing capacity is operationalized. Additional internal and contracted manufacturing capacity is expected to become fully operational around the world in the next several years as part of efforts to meet the demand for incretin medicines.",
        "source": "finqa"
    },
    {
        "query": "What criteria are used to determine whether to accrue an estimated loss from a legal contingency?",
        "response": "Accrual is based on the probability of an unfavorable outcome and the ability to reasonably estimate the amount of the loss.",
        "source": "finqa"
    },
    {
        "query": "What can trigger civil and criminal liability under the Civil Monetary Penalties Statute?",
        "response": "Civil and criminal liability can be triggered by various prohibited activities, including presenting false claims, offering improper inducements to beneficiaries, contracting with excluded individuals, and failing to return overpayments to the government.",
        "source": "finqa"
    },
    {
        "query": "What are the 2023 annual average Value at Risk (VaR) values for the total covered positions and less liquid trading positions portfolio?",
        "response": "The 2023 annual average Value at Risk (VaR) for the total covered positions and less liquid trading positions portfolio was 84 million dollars.",
        "source": "finqa"
    },
    {
        "query": "What pages contain the Consolidated Financial Statements along with the report and notes in Item 8?",
        "response": "Pages 163-309 contain the Consolidated Financial Statements along with the report and notes in Item 8.",
        "source": "finqa"
    },
    {
        "query": "What recognition did FedEx receive from FORTUNE magazine in 2023?",
        "response": "In 2023, FedEx ranked 18th on FORTUNE magazine's 'World's Most Admired Companies' list and was the highest-ranked delivery company on this list.",
        "source": "finqa"
    },
    {
        "query": "What additional information is discussed relating to risks associated with legal proceedings in the Annual Report on Form 10-K?",
        "response": "The Risk Factors section discusses additional risks associated with legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What is the primary focus of the Ford Next segment?",
        "response": "The primary focus of the Ford Next segment is on expenses and investments for emerging business initiatives aimed at creating value for Ford in vehicle-adjacent market segments.",
        "source": "finqa"
    },
    {
        "query": "How much did the Individual Medicare Advantage membership increase by in 2023?",
        "response": "843,300 members",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the office loans increase in exposure during 2023?",
        "response": "68%",
        "source": "finqa"
    },
    {
        "query": "What primarily drove the increase in total expenses as detailed in the text?",
        "response": "The increase in total expenses was primarily driven by higher Card Member rewards expense and Card Member services expense.",
        "source": "finqa"
    },
    {
        "query": "How much did the allowance for credit losses increase at Bank of America from December 31, 2022, to December 31, 2023?",
        "response": "$329 million",
        "source": "finqa"
    },
    {
        "query": "Where can you find the consolidated financial statements in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are included immediately following Part IV of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What is the expected total cost HP will incur from its Fiscal 2023 Plan, and how is it primarily divided?",
        "response": "HP estimates it will incur approximately $1.0 billion in pre-tax charges from its Fiscal 2023 Plan, with about $0.7 billion primarily for labor costs related to workforce reductions and the remaining costs for non-labor actions and other charges.",
        "source": "finqa"
    },
    {
        "query": "How did the provision for credit losses change in Consumer Banking in 2023?",
        "response": "The provision for credit losses in Consumer Banking increased by $3.2 billion to $5.2 billion in 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the Garmin adventure watches features depending on the model?",
        "response": "Wrist-based biometrics, sports apps, solar charging, music storage capabilities, preloaded full-color purpose-built adventure mapping, built-in LED flashlights, Garmin Pay",
        "source": "finqa"
    },
    {
        "query": "What page in the Form 10-K contains the Financial Statement Schedule?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What changes did the CFPB proposed rule issued on February 1, 2023, aim to introduce regarding credit card issuers' late fees?",
        "response": "The CFPB proposed rule issued on February 1, 2023, aims to lower the safe harbor amount considered reasonable and proportional to costs incurred by credit card issuers for late payments, eliminate the annual inflation adjustment for the safe harbor amount, and prohibit late fee amounts above 25 percent of the consumer's required minimum payment.",
        "source": "finqa"
    },
    {
        "query": "What is the impact of a tax law change and acquisition closings on the company's intention regarding the reinvestment of undistributed earnings of its foreign TRSs?",
        "response": "The company has concluded that it is no longer its intention to reinvest its undistributed earnings of its foreign TRSs indefinitely outside the United States, due to the enactment of a tax law and the closing of various acquisitions.",
        "source": "finqa"
    },
    {
        "query": "What were the depreciation expenses for the fiscal years 2021, 2022, and 2023?",
        "response": "$539 million in 2021, $529 million in 2022, and $502 million in 2023",
        "source": "finqa"
    },
    {
        "query": "What is the primary purpose of the group 'Cloud and AI' in the company's internal development structure?",
        "response": "The primary purpose of the 'Cloud and AI' group is to enhance the productivity and efficiency of IT professionals, developers, partners, independent software vendors, and their systems by developing the Azure AI platform and cloud infrastructure, server, database, CRM, ERP, software development tools and services including GitHub, AI cognitive services, and other business process applications and services for enterprises.",
        "source": "finqa"
    },
    {
        "query": "How much cash did Broadcom Inc. pay for interest and income taxes in the most recent period?",
        "response": "$1,503 million for interest and $1,782 million for income taxes",
        "source": "finqa"
    },
    {
        "query": "What are the components of AbbVie Inc.'s comprehensive income for the year 2023?",
        "response": "AbbVie Inc.'s comprehensive income for the year 2023 includes net earnings of $4,873 million, foreign currency translation adjustments net of tax expense amounting to $407 million, net investment hedging activities net of tax expense totaling $(399) million, pension and post-employment benefits net of tax expense of $(30) million, and cash flow hedging activities net of tax expense which resulted in $(84) million. The total comprehensive income for 2023 was $4,767 million.",
        "source": "finqa"
    },
    {
        "query": "How many supermarkets does Kroger operate and in how many states?",
        "response": "Kroger operates 2,719 supermarkets across 35 states.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Salesforce employees indicated willingness to give extra effort based on the latest survey?",
        "response": "Based on the most recent Employee Opinion Survey, 93 percent of responding employees indicated they were willing to give extra effort to get the job done.",
        "source": "finqa"
    },
    {
        "query": "What type of software is sold through the website alldata.com?",
        "response": "The website alldata.com sells the ALLDATA brand of automotive diagnostic, repair, collision, and shop management software.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the increase in other income, net during the noted period?",
        "response": "The increase in other income, net was primarily due to an increase in interest income resulting from higher cash balances and higher interest rates.",
        "source": "finqa"
    },
    {
        "query": "What seasonal trends affect the company's sales volumes?",
        "response": "The company experiences its highest volume of sales during the second fiscal quarter, which corresponds with the spring season in the regions where it operates.",
        "source": "finqa"
    },
    {
        "query": "What are the three key aspects encompassed in a company's internal control over financial reporting?",
        "response": "A company's internal control over financial reporting includes policies and procedures that: 1) maintain records accurately reflecting transactions and asset dispositions, 2) ensure transactions are recorded for proper financial statement preparation and monitor expenditures based on management and director authorizations, 3) prevent or detect unauthorized asset use that could materially affect financial statements.",
        "source": "finqa"
    },
    {
        "query": "What effect does the Hilton Honors program have on member spending?",
        "response": "Affiliation with the Hilton Honors program encourages members to allocate more of their travel spend to Hilton hotels, with the percentage of spend captured increasing as members advance through program tiers.",
        "source": "finqa"
    },
    {
        "query": "What factors might cause AMD's actual results to differ from its forward-looking statements?",
        "response": "Factors that could cause AMD's actual results to differ from its forward-looking statements include possible impact of future accounting rules, demand for AMD's products, AMD's strategy and benefits, the competitive landscape, international sales expectations, financing availability, legal liabilities, information security costs, revenue collection prospects, and legal or regulatory changes affecting technology.",
        "source": "finqa"
    },
    {
        "query": "How often does the company issue standby letters of credit, performance or surety bonds, or other guarantees?",
        "response": "From time to time",
        "source": "finqa"
    },
    {
        "query": "What percentage of gross product sales were gross-to-net deductions in 2023?",
        "response": "38%",
        "source": "finqa"
    },
    {
        "query": "How is Meta's workforce comprised in terms of diversity as of December 31, 2022?",
        "response": "As of December 31, 2022, Meta's global employee base consisted of 45.4% underrepresented people, with 47.9% in the U.S., and 43.1% of leaders in the U.S. being people of color.",
        "source": "finqa"
    },
    {
        "query": "What led to the goodwill impairment charge for the Film and TV reporting unit in 2023?",
        "response": "The Film and TV reporting unit faced several months-long strikes by the Writers Guild of America and SAG-AFTRA in 2023, causing delayed productions and additional costs, which led to revised profitability and cash flow forecasts. Consequently, a goodwill impairment charge of $231.2 million was recorded.",
        "source": "finqa"
    },
    {
        "query": "What responsibilities does Timothy A. Massa have at Kroger?",
        "response": "Timothy A. Massa is responsible for Human Resources and Labor Relations at Kroger.",
        "source": "finqa"
    },
    {
        "query": "How did the company determine whether their contracts contain a significant financing component?",
        "response": "The company determined that their contracts do not generally contain a significant financing component, as the period between the delivery of goods or services and payment is expected to be one year or less.",
        "source": "finqa"
    },
    {
        "query": "What was the Free Cash Flow of the company in 2023?",
        "response": "The Free Cash Flow of the company in 2023 was $3,837 million.",
        "source": "finqa"
    },
    {
        "query": "What was the stored value of cards and loyalty program balances at the end of fiscal year 2022?",
        "response": "The stored value of cards and loyalty program balances at October 2, 2022 was approximately $1.503 billion.",
        "source": "finqa"
    },
    {
        "query": "What was the change in clinical labor wage rates for U.S. dialysis in 2022 and 2023?",
        "response": "In 2022, clinical labor wage rates in the U.S. dialysis sector increased by approximately 7.4%, and in 2023, there was a further increase of approximately 1.3%.",
        "source": "finqa"
    },
    {
        "query": "What procedures did the auditors perform to address the critical audit matter regarding the estimation of store shrink at The Home Depot, Inc.?",
        "response": "The auditors evaluated the design and tested the internal controls related to developing the estimate of store shrink. They assessed the company's method and assumptions used to estimate inventory losses, performed trend and sensitivity analyses over the shrink reserve estimate.",
        "source": "finqa"
    },
    {
        "query": "How much were the company's debt obligations as of December 31, 2023?",
        "response": "$2,299,887 thousand",
        "source": "finqa"
    },
    {
        "query": "What are the details regarding the company's approach to product recalls and safety issues mentioned?",
        "response": "The company may stop selling or recall certain products for safety-related or other issues",
        "source": "finqa"
    },
    {
        "query": "How did the average number of common shares used in diluted calculation change from 2020 to 2022 for The Kroger Co.?",
        "response": "It decreased from 781 million in 2020 to 754 million in 2021, and further to 727 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the primary estimates used to record the liability for loyalty points earned by members?",
        "response": "The primary estimates include the estimated redemption rate and the estimated weighted-average retail price per point redeemed.",
        "source": "finqa"
    },
    {
        "query": "What actions can the Australian Securities and Investments Commission take against individuals involved in corporations?",
        "response": "The Australian Securities and Investments Commission has the authority to investigate, prosecute, ban individuals and to seek civil penalties.",
        "source": "finqa"
    },
    {
        "query": "What were the total cash contributions to the company's pension and post-retirement plans in 2023?",
        "response": "$27.6 million",
        "source": "finqa"
    },
    {
        "query": "What was the increase in wholesale units for Ford Pro from 2021 to 2022?",
        "response": "114,000 units",
        "source": "finqa"
    },
    {
        "query": "What was the carrying value of the joint venture with AGC Equity Partners as of December 31, 2023?",
        "response": "$57,874",
        "source": "finqa"
    },
    {
        "query": "How much did GM Financial's primary source of cash from finance charge income increase in 2023 compared to the previous year?",
        "response": "$1.7 billion",
        "source": "finqa"
    },
    {
        "query": "How might macroeconomic conditions impact the Company's results of operations and financial condition?",
        "response": "Macroeconomic conditions, including inflation, changes in interest rates, and currency fluctuations, have directly and indirectly impacted, and could in the future materially impact, the Company’s results of operations and financial condition.",
        "source": "finqa"
    },
    {
        "query": "What was the total cost and expenses reported by Berkshire Hathaway for the year ended December 31, 2023?",
        "response": "321,144 million dollars",
        "source": "finqa"
    },
    {
        "query": "What significant telecom industry transaction did AT&T complete in 2006?",
        "response": "In 2006, AT&T completed the acquisition of ILEC BellSouth Corporation.",
        "source": "finqa"
    },
    {
        "query": "In the fiscal year ended January 31, 2023, what was the unqualified opinion expressed by Ernst & Young LLP regarding Walmart Inc.'s internal control over financial reporting?",
        "response": "Ernst & Young LLP expressed an unqualified opinion that Walmart Inc. maintained, in all material respects, effective internal control over financial reporting as of January 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the primary competitors for Peacock's subscription services?",
        "response": "Peacock competes for subscribers primarily with other DTC streaming and other OTT service providers, as well as with traditional providers of linear television programming.",
        "source": "finqa"
    },
    {
        "query": "How does Peloton incorporate music in their workouts?",
        "response": "Peloton integrates curated playlists into their workout programming, using a proprietary music platform to align the music with Members' tastes.",
        "source": "finqa"
    },
    {
        "query": "What was the major reason for the increase in Sales and Marketing expenses in 2023?",
        "response": "The major reason for the increase in Sales and Marketing expenses in 2023 was a $177 million increase in marketing activities.",
        "source": "finqa"
    },
    {
        "query": "What does the total cash, cash equivalents, restricted cash, and marketable securities amount to as of December 31, 2023?",
        "response": "The total cash, cash equivalents, restricted cash, and marketable securities amount to $86,780 million as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did MedTech's sales increase in 2023 compared to 2022?",
        "response": "MedTech's sales in 2023 were $30.4 billion, marking an increase of 10.8% from $27.427 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "What innovation does Peloton's Tread+ introduce in design?",
        "response": "Peloton's Tread+ introduces a slat belt technology designed to optimize the comfort experience during running.",
        "source": "finqa"
    },
    {
        "query": "In which part of the report are the exhibits related to financial statements provided?",
        "response": "Item 15",
        "source": "finqa"
    },
    {
        "query": "What were the total minimum lease payments and their net amounts after imputed interest for operating and finance leases as of January 31, 2023?",
        "response": "As of January 31, 2023, the total minimum lease payments were $3,885 million for operating leases and $819 million for finance leases. After subtracting imputed interest, the net amounts were $3,487 million for operating leases and $791 million for finance leases.",
        "source": "finqa"
    },
    {
        "query": "What are the two primary reportable segments of the company discussed?",
        "response": "The company has two primary reportable segments: semiconductor solutions and infrastructure software.",
        "source": "finqa"
    },
    {
        "query": "What is the threshold potential civil penalty mentioned in the item for disclosure under Item 103 of Regulation S-K?",
        "response": "The threshold for potential civil penalties mentioned for disclosure under Item 103 of Regulation S-K is $1 million.",
        "source": "finqa"
    },
    {
        "query": "What amount was spent on capital expenditures for data centers in 2023?",
        "response": "$964,198",
        "source": "finqa"
    },
    {
        "query": "What inherent limitations of internal control over financial reporting are noted?",
        "response": "Internal control over financial reporting may not prevent or detect misstatements due to its inherent limitations.",
        "source": "finqa"
    },
    {
        "query": "What principle does the company follow for recording upfront contract acquisition costs such as sales commissions?",
        "response": "The company capitalizes upfront contract acquisition costs such as sales commissions and amortizes them over the estimated life of the asset. For contracts lasting less than a year, the company expends these costs when incurred, in line with Topic 606's practical expedient.",
        "source": "finqa"
    },
    {
        "query": "What was the change in operating margin from 2022 to 2023?",
        "response": "The operating margin increased from 12.9% in 2022 to 13.7% in 2023.",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1) located?",
        "response": "They are included elsewhere in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "How much did the Company receive from the sale of their investment in Saudi Cinema Company?",
        "response": "$30.0 million",
        "source": "finqa"
    },
    {
        "query": "What percentage of Walmart's fiscal 2023 consolidated net sales were made up by the Walmart U.S. segment?",
        "response": "For fiscal 2023, the Walmart U.S. segment accounted for 69% of Walmart's consolidated net sales.",
        "source": "finqa"
    },
    {
        "query": "What impact do digital enhancements have on the company's customer traffic and sales growth?",
        "response": "Digital enhancements like improved website and mobile functionality, product presentation, and fulfillment options have led to higher traffic, better conversion rates, and continued sales growth.",
        "source": "finqa"
    },
    {
        "query": "What company owns the trademark for AMD?",
        "response": "AMD is a trademark of Advanced Micro Devices, Inc.",
        "source": "finqa"
    },
    {
        "query": "What are the four reportable operating segments of American Express as described in the text?",
        "response": "The four reportable operating segments of American Express are U.S. Consumer Services (USCS), Commercial Services (CS), International Card Services (ICS), and Global Merchant and Network Services (GMNS).",
        "source": "finqa"
    },
    {
        "query": "What change in wireless service revenue percentage is observed from 2021 to 2023 in the Communications segment?",
        "response": "From 43% to 52%",
        "source": "finqa"
    },
    {
        "query": "How does the company ensure robust assessments of customer financial conditions in contract evaluations?",
        "response": "The company performs ongoing assessments of customer financial conditions, considering factors like the customers' ability and intention to pay and whether contracts meet revenue recognition criteria, to ensure that the total remaining deal value reflects accurate contractual potential.",
        "source": "finqa"
    },
    {
        "query": "Are the consolidated financial statements and accompanying notes incorporated in the Annual Report on Form 10-K?",
        "response": "Yes, the consolidated financial statements and accompanying notes are incorporated by reference in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What legal measures could manufacturers face if they fail to comply with the Inflation Reduction Act's provisions?",
        "response": "Various penalties, including civil monetary penalties",
        "source": "finqa"
    },
    {
        "query": "What was UnitedHealth Group's total net earnings in 2023?",
        "response": "$23,144 million",
        "source": "finqa"
    },
    {
        "query": "How many new stores did the company open in Mexico during fiscal 2022?",
        "response": "Four",
        "source": "finqa"
    },
    {
        "query": "What methods are used to estimate doubtful accounts in trade accounts receivable?",
        "response": "The allowance for doubtful accounts is estimated based on historical experience and current economic conditions.",
        "source": "finqa"
    },
    {
        "query": "What does Gross Merchandise Volume (GMV) represent in financial terms?",
        "response": "Gross Merchandise Volume (GMV) represents the total value of all paid transactions between users on the company's platforms during the applicable period, inclusive of shipping fees and taxes.",
        "source": "finqa"
    },
    {
        "query": "What were the key reasons for the decrease in apparel revenues in Greater China from fiscal 2022 to fiscal 2023?",
        "response": "The decrease in apparel revenues in Greater China, which fell by 14% on a currency-neutral basis from fiscal 2022 to fiscal 2023, was primarily due to lower revenues in Men's and Women's along with a decrease in unit sales of apparel by 8%.",
        "source": "finqa"
    },
    {
        "query": "What processes are involved in evaluating definite-lived intangible assets",
        "response": "Evaluating definite-lived intangible assets for impairment involves comparing the carrying value of the assets against their estimated undiscounted future cash flows and, if these are less than the carrying value, comparing the carrying value to the estimated fair value to determine impairment.",
        "source": "finqa"
    },
    {
        "query": "What was the return on average allocated capital for Global Banking in 2023?",
        "response": "21 percent",
        "source": "finqa"
    },
    {
        "query": "What are the main contributors to the revenue of Xbox?",
        "response": "Xbox revenue is mainly derived from subscriptions and sales of first- and third-party content, in addition to advertising.",
        "source": "finqa"
    },
    {
        "query": "What does the Glossary of Terms and Acronyms in the financial document contain?",
        "response": "The Glossary of Terms and Acronyms includes definitions and explanations of terms and acronyms used throughout the document.",
        "source": "finqa"
    },
    {
        "query": "How does Part II, Item 8 contribute to understanding LEGAL PROCEEDINGS in a Form 10-K?",
        "response": "Part II, Item 8 provides the specific location, Notes to the Consolidated Financial Statements, where detailed information regarding legal proceedings is available.",
        "source": "finqa"
    },
    {
        "query": "What are the requirements for Bermuda domiciled subsidiaries under the Insurance Act regarding financial reporting?",
        "response": "Bermuda domiciled subsidiaries are required to prepare and file with the Bermuda Monetary Authority audited annual statutory financial statements and audited annual financial statements prepared in accordance with U.S. Generally Accepted Accounting Principles (U.S. GAAP), International Financial Reporting Standards (IFRS), or other generally accepted accounting principles recognized by the BMA. Additionally, the U.S. GAAP audited financial statements must be made public.",
        "source": "finqa"
    },
    {
        "query": "What were the estimated costs of inventory for expected product returns as of May 31, 2023 and 2022, and how were these costs recorded on the Consolidated Balance Sheets?",
        "response": "The estimated costs of inventory for expected product returns were $226 million as of May 31, 2023, and $194 million as of May 31, 2022. These costs were recorded in Prepaid expenses and other current assets on the Consolidated Balance Sheets.",
        "source": "finqa"
    },
    {
        "query": "What was the noncash pre-tax impairment charge recorded due to the disposal of Vrio's operations in 2021, and what are the main components contributing to this amount?",
        "response": "The noncash pre-tax impairment charge for the disposal of Vrio's operations in 2021 was $4,555, mainly consisting of approximately $2,100 related to accumulated foreign currency translation adjustments and $2,500 related to property, plant, and equipment and intangible assets.",
        "source": "finqa"
    },
    {
        "query": "What were the operating results changes year-over-year for the FedEx Express, Ground, and Freight segments in 2023 compared to 2022?",
        "response": "In 2023, the FedEx Express segment experienced a decrease in operating results of $1,858 million, the FedEx Ground segment saw an increase of $498 million, and the FedEx Freight segment increased by $262 million, compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the fiscal year cash flow before share repurchases and changes in debt as of August 26, 2023?",
        "response": "$2.2 billion",
        "source": "finqa"
    },
    {
        "query": "What is the significance of the Management’s Discussion and Analysis section in the Annual Report on Form 10-K?",
        "response": "The Management’s Discussion and Analysis section in the Annual Report on Form 10-K provides an analysis of the company's financial condition and results of operations. It should be read in conjunction with the consolidated financial statements and accompanying notes to gain a full understanding of the company's financial performance.",
        "source": "finqa"
    },
    {
        "query": "What is Apple's approach to licenses for intellectual property owned by third parties used in its products and services?",
        "response": "Apple may need to seek or renew licenses relating to various aspects of its products, processes, and services, though there is no guarantee these licenses can be obtained on reasonable terms in the future.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decrease in trading revenue from 2022 to 2023?",
        "response": "The decrease in trading revenue was primarily due to lower options order flow revenue, narrower quoted spreads in the options market, and lower equity order flow revenue.",
        "source": "finqa"
    },
    {
        "query": "What was the total available under the unsecured revolving credit agreement as of the end of 2023?",
        "response": "$3.0 billion",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 primarily focus on in the context of a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How does the company protect its intellectual property?",
        "response": "The company protects its intellectual property by working actively in the U.S. and internationally to enforce copyright, trademark, trade secret, and other protections that apply to its software and hardware products, services, business plans, and branding. It also pursues patents actively, holding a portfolio of over 70,000 U.S. and international patents issued and over 19,000 pending worldwide.",
        "source": "finqa"
    },
    {
        "query": "What are included in Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1).",
        "source": "finqa"
    },
    {
        "query": "What was the total net of tax amount for the noncash impairment charge related to aircraft idling in the fourth quarter?",
        "response": "$54 million",
        "source": "finqa"
    },
    {
        "query": "What were the year-over-year changes in revenue for the FedEx Express, Ground, and Freight segments in 2023 compared to 2022?",
        "response": "The FedEx Express segment saw a decrease of $3,071 million, the FedEx Ground segment had an increase of $275 million, and the FedEx Freight segment increased by $100 million in revenue year-over-year for 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "When does the new standard ASU 2023-07 come into effect, and what does it aim to improve?",
        "response": "ASU 2023-07 comes into effect for fiscal years beginning after December 15, 2023, and aims to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses.",
        "source": "finqa"
    },
    {
        "query": "Where in the document can the Consolidated Financial Statements be found as mentioned in a 2024 report?",
        "response": "The Consolidated Financial Statements are located on pages 163-309.",
        "source": "finqa"
    },
    {
        "query": "What information is included in the SEC’s website regarding issuers that file electronically?",
        "response": "The SEC’s website includes reports, proxy and information statements, and other information regarding issuers that file electronically.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the liquidity risk limits used by the organization?",
        "response": "The liquidity risk limits are used to manage the size of liquidity exposures, measured relative to acceptable levels of risk given the organization's liquidity risk tolerance.",
        "source": "finqa"
    },
    {
        "query": "What was Broadcom Inc.'s total stockholders' equity at the end of the most recent fiscal year?",
        "response": "$23,988 million",
        "source": "finqa"
    },
    {
        "query": "What must a bank's risk governance framework ensure according to the heightened supervisory standards set by the OCC?",
        "response": "A bank's risk governance framework must ensure that the bank's risk profile is easily distinguished and separate from that of its parent BHC for risk management purposes.",
        "source": "finqa"
    },
    {
        "query": "What are the primary drugs included in Symtuza and which company commercializes it?",
        "response": "Symtuza includes cobicistat, emtricitabine, and tenofovir alafenamide, and it is commercialized by Janssen Sciences Ireland Unlimited Company.",
        "source": "finqa"
    },
    {
        "query": "What types of insurance coverage does the company provide to its employees at no premium cost, as part of their general employee benefits package?",
        "response": "The company provides its employees with several types of insurance at no premium cost, including medical/prescription, dental, vision, short-term disability, life, and accidental death and disability insurance.",
        "source": "finqa"
    },
    {
        "query": "What components are included in the automotive segment of the company's operations?",
        "response": "The automotive segment includes design, development, manufacturing, sales, and leasing of high-performance fully electric vehicles, sales of automotive regulatory credits, services and other sales such as used vehicles, non-warranty after-sales services, body shop and parts, paid Supercharging, vehicle insurance revenue and retail merchandise.",
        "source": "finqa"
    },
    {
        "query": "How does the company plan to achieve its emissions goals in the long term?",
        "response": "The company plans to achieve its emissions goals by purchasing carbon credits from high integrity projects, focusing on nature-based solutions where feasible.",
        "source": "finqa"
    },
    {
        "query": "What was the tangible common shareholders' equity at the end of the period according to the data provided?",
        "response": "$169,251",
        "source": "finqa"
    },
    {
        "query": "What significant milestones did Iron Mountain achieve in its history by the end of 2023?",
        "response": "By the end of 2023, Iron Mountain served more than 225,000 customers across various industries in 60 countries, employed approximately 27,000 people, and was listed on the New York Stock Exchange as a part of the Standard & Poor’s 500 Index and the MSCI REIT index.",
        "source": "finqa"
    },
    {
        "query": "What were Intuit's interest payments on the term loan during the fiscal years ending July 31, 2023 and July 31, 2022, respectively?",
        "response": "$230 million and $42 million",
        "source": "finqa"
    },
    {
        "query": "What was the decrease in net cash provided by Hasbro's operating activities from 2021 to 2022?",
        "response": "$445.0 million",
        "source": "finqa"
    },
    {
        "query": "What was the primary source of the increase in premiums written by Berkshire Hathaway's Property/Casualty reinsurance in 2023?",
        "response": "The primary source of the increase in premiums written in Berkshire Hathaway's Property/Casualty reinsurance in 2023 was a total contribution of $5.3 billion from the TransRe Group.",
        "source": "finqa"
    },
    {
        "query": "How is the discount rate determined for the company's U.S. defined benefit pension and OPRB plans?",
        "response": "The discount rates are based on a yield curve constructed from a portfolio of high-quality bonds for which the timing and amount of cash outflows approximate the estimated payouts of the plan.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the total leasable area is occupied by luxury, women's, men's, and mixed fashion categories at the malls as of December 31, 2023?",
        "response": "As of December 31, 2023, luxury, women's, men's, and mixed fashion categories occupied 34% of the total leasable area at the malls.",
        "source": "finqa"
    },
    {
        "query": "What impact did the eOne acquisition have on the Company's intangible amortization costs in 2023?",
        "response": "The eOne acquisition led to the Company incurring $62.6 million of intangible amortization costs in 2023, which were allocated between the Consumer Products and Entertainment segments.",
        "source": "finqa"
    },
    {
        "query": "Where can the 'Glossary of Terms and Acronyms' be found in the document?",
        "response": "pages 315-321",
        "source": "finqa"
    },
    {
        "query": "What item number discusses legal proceedings in the report?",
        "response": "Item 3 discusses legal proceedings in the report.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the cost of revenue increase from 2022 to 2023?",
        "response": "The cost of revenue increased by 3% from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Hilton's energy was sourced from grid electricity in 2023?",
        "response": "57.0%",
        "source": "finqa"
    },
    {
        "query": "How much did Trodelvy's product sales amount to in 2022 and what was the increase in 2023?",
        "response": "$680 million in 2022 and increased by 56% in 2023",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the increase in IMC's pre-tax earnings in 2023?",
        "response": "The increase in IMC's pre-tax earnings in 2023 was mainly due to higher interest income and, to a lesser extent, increased operating earnings.",
        "source": "finqa"
    },
    {
        "query": "Under which item are Financial Statements and Supplementary Data listed in the financial document?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What kind of coverage does the Class 2 insurance license of Caterpillar Insurance Co. Ltd. include?",
        "response": "The Class 2 insurance license includes general liability, property, auto liability, cargo, and medical and accident coverages.",
        "source": "finqa"
    },
    {
        "query": "What measures does the company rely on to protect its intellectual property (IP)?",
        "response": "The company relies on a combination of patents, trademarks, trade secrets, employee and third-party nondisclosure agreements, and licensing arrangements to protect its IP.",
        "source": "finqa"
    },
    {
        "query": "What were the carbon dioxide emissions per square meter at Hilton's properties as of December 31, 2023?",
        "response": "45",
        "source": "finqa"
    },
    {
        "query": "What are the key components used to define free cash flow in financial evaluations?",
        "response": "Free cash flow is defined as net cash provided by operating activities minus payments for property and equipment made in the period.",
        "source": "finqa"
    },
    {
        "query": "What is the maturity date of the Notes due 2026?",
        "response": "March 1, 2026",
        "source": "finqa"
    },
    {
        "query": "What was Dollar Tree's total revenue in the fiscal year ended January 28, 2023?",
        "response": "$28,331.7 million",
        "source": "finqa"
    },
    {
        "query": "What types of products and services does Peloton offer through its e-commerce platform?",
        "response": "Peloton offers products such as Peloton Bikes, Tread, and Row products, and services like one-on-one sales consultations on its e-commerce platform.",
        "source": "finqa"
    },
    {
        "query": "In which areas does HP's Office Printing Solutions operate?",
        "response": "HP's Office Printing Solutions delivers printers, supplies, services, and solutions to SMBs, public sector and large enterprises.",
        "source": "finqa"
    },
    {
        "query": "What are some non-GAAP financial measures mentioned in the report and how are they derived?",
        "response": "Non-GAAP financial measures mentioned include organic sales growth, core earnings per share, adjusted free cash flow, and adjusted free cash flow productivity. These measures are derived by excluding certain factors like acquisitions, divestitures, foreign exchange, and certain one-time items from their calculations.",
        "source": "finqa"
    },
    {
        "query": "What does the company expect regarding the reclassification of amounts related to forward foreign exchange contracts over the next 12 months?",
        "response": "The company expects that substantially all of the amounts related to forward foreign exchange contracts will be reclassified into earnings over the next 12 months.",
        "source": "finqa"
    },
    {
        "query": "What legislative act requires federal banking regulators to take prompt corrective action with regards to capital adequacy standards?",
        "response": "The Federal Deposit Insurance Corporation Improvement Act of 1991",
        "source": "finqa"
    },
    {
        "query": "How do Garmin's net sales typically vary within a year?",
        "response": "Net sales peak in the fourth quarter due to holiday season demand and in the second quarter due to demands in spring and summer.",
        "source": "finqa"
    },
    {
        "query": "What are the new leverage and interest coverage ratios set by SCL under the amended and restated facility agreement as of January 2024?",
        "response": "As of January 2024, the new leverage ratio should not exceed 4.0x, and the interest coverage ratio should not be less than 2.5x.",
        "source": "finqa"
    },
    {
        "query": "Where can one find the consolidated financial statements and accompanying notes in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are listed in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "Does the index to the Financial Statements and Supplementary Data appear in a specific location within the document?",
        "response": "Yes, the index to the Financial Statements and Supplementary Data is specifically presented in the document.",
        "source": "finqa"
    },
    {
        "query": "What legal claims does Fortis Advisors LLC allege against Ethicon Inc. in the lawsuit related to the acquisition of Auris Health Inc.?",
        "response": "Fortis Advisors LLC alleges breach of contract and fraud against Ethicon Inc. in the lawsuit related to the acquisition of Auris Health Inc.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of loans gross and the total loans after allowances for losses in 2023 according to Goldman Sachs' Asset & Wealth Management data?",
        "response": "In 2023, the total gross loans amounted to $58,341 million, and the total loans after allowances for loan losses were $56,338 million.",
        "source": "finqa"
    },
    {
        "query": "Where can the consolidated financial statements and accompanying notes be found in the Annual Report on Form 10-K?",
        "response": "They are included elsewhere in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of sales return provisions in 2023 as part of gross-to-net deductions?",
        "response": "$2.2 billion",
        "source": "finqa"
    },
    {
        "query": "How does the entity manage the volatility in cash flows due to foreign currency fluctuations?",
        "response": "The entity utilizes derivative instruments to hedge portions of cash flows from anticipated intercompany payments, purchases, and certain other transactions across different currencies.",
        "source": "finqa"
    },
    {
        "query": "What was the adjustment for Cadillac dealer strategy in 2023?",
        "response": "175",
        "source": "finqa"
    },
    {
        "query": "For information on legal proceedings, which section of the Annual Report should be consulted?",
        "response": "For information on legal proceedings, Note 14 in Item 8 of the Annual Report should be consulted.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Kenvue's shares did Johnson & Johnson own after the exchange offer on August 23, 2023?",
        "response": "9.5%",
        "source": "finqa"
    },
    {
        "query": "How much did Enphase Energy's proceeds from common stock issued under its Employee Stock Purchase Plan amount to in 2023?",
        "response": "$12,897",
        "source": "finqa"
    },
    {
        "query": "How are finance lease assets amortized?",
        "response": "Finance lease assets are amortized on a straight-line basis over the shorter of the estimated useful lives of the assets or the lease terms.",
        "source": "finqa"
    },
    {
        "query": "What are the impacts of a 25 basis-point change in the discount rate and a 50 basis-point decrease in the royalty rates on the estimated fair value of the Gillette indefinite-lived intangible asset?",
        "response": "A 25 basis-point increase in the discount rate results in a 6% decrease in the estimated fair value, and a 50 basis-point decrease in the royalty rates results in a 4% decrease in estimated fair value.",
        "source": "finqa"
    },
    {
        "query": "What are some of the competitive advantages of Enphase Energy, Inc.'s microinverter solutions compared to traditional central or string inverter technology?",
        "response": "Enphase Energy, Inc's microinverter solutions offer significant advantages and competitive differentiation relative to traditional central or string inverter technology in terms of flexibility in installation, increased safety due to lower DC voltages, improved energy production tracking, and reduced overall costs.",
        "source": "finqa"
    },
    {
        "query": "What is the margin of error generally estimated for worldwide Monthly Active People (MAP)?",
        "response": "The margin of error for worldwide Monthly Active People is generally estimated to be approximately 3%.",
        "source": "finqa"
    },
    {
        "query": "How is the deferred revenue from gift cards recorded and recognized by the Company?",
        "response": "The Company records deferred revenue liability equal to the amount received from the sales of gift cards and recognizes revenue when the gift cards are redeemed to purchase the Company’s products.",
        "source": "finqa"
    },
    {
        "query": "How does the Inflation Reduction Act of 2022 impact pharmaceutical pricing?",
        "response": "The Inflation Reduction Act of 2022 impacts pharmaceutical pricing by mandating the U.S. Department of Health and Human Services to set government-determined prices for certain drugs under Medicare Part B and Part D, beginning nine years after FDA approval for most drugs.",
        "source": "finqa"
    },
    {
        "query": "How much cash and cash equivalents did Machinery, Energy & Transportation hold in 2023 compared to 2022?",
        "response": "$6,106 million in 2023 and $6,042 million in 2022",
        "source": "finqa"
    },
    {
        "query": "How many active sellers and buyers did Etsy's marketplaces connect as of December 31, 2023?",
        "response": "9.0 million active sellers and 96.5 million active buyers",
        "source": "finqa"
    },
    {
        "query": "Under what circumstances does SEC regulations require the company to disclose certain environmental proceedings?",
        "response": "SEC regulations require the company to disclose certain environmental proceedings when a governmental authority is a party and the proceeding involves potential monetary sanctions that the company believes will exceed $1 million or more.",
        "source": "finqa"
    },
    {
        "query": "What types of laws and regulations does the company need to comply with?",
        "response": "The company needs to comply with various United States and foreign laws and regulations related to intellectual property, data privacy and security, cybersecurity, tax, employment, competition and antitrust, anti-corruption, anti-bribery, and AI.",
        "source": "finqa"
    },
    {
        "query": "What kinds of contributions do ERGs provide?",
        "response": "ERGs provide contributions like mentoring programs that connect diverse employees with senior leaders, partnerships with recruiters and diverse early career and professional organizations to strengthen the talent pipeline, and programs that educate on global cultures.",
        "source": "finqa"
    },
    {
        "query": "What was the change in foreign currency translation adjustments reported by Chipotle Mexican Grill in 2023 compared to 2022?",
        "response": "$3,765",
        "source": "finqa"
    },
    {
        "query": "By what percentage did Skyrizi's revenue in the international market change in 2023 compared to 2022?",
        "response": "48.3%",
        "source": "finqa"
    },
    {
        "query": "When was The Coca-Cola Company incorporated, and under which state's laws?",
        "response": "The Coca-Cola Company was incorporated in September 1919 under the laws of the State of Delaware.",
        "source": "finqa"
    },
    {
        "query": "How much was the total stockholders' equity as of December 31, 2022?",
        "response": "The total stockholders' equity as of December 31, 2022 was $2,565,326 thousand.",
        "source": "finqa"
    }
]