[
    {
        "query": "What percentage of the company's total stores were located in Canada and Mexico at the end of fiscal 2022?",
        "response": "13.6%",
        "source": "finqa"
    },
    {
        "query": "What types of employee groups does AT&T have to reflect its diverse workforce?",
        "response": "AT&T has employee groups organized around women, people of color, faith, LGBTQ+ individuals, people with disabilities, and veterans, as well as professionals interested in cybersecurity, engineering, innovation, and project management.",
        "source": "finqa"
    },
    {
        "query": "What was the net income reported by Chipotle Mexican Grill in 2023?",
        "response": "$1,228,737",
        "source": "finqa"
    },
    {
        "query": "What are the key variables required to estimate the net projected and accumulated benefit obligations for defined benefit pension and OPRB plans?",
        "response": "The key variables required include the discount rate, expected salary increases, employee-related factors such as turnover, retirement age, mortality, expected return on assets, and health care cost trend rates.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily contributed to the 9% growth in apparel revenues on a currency-neutral basis?",
        "response": "The 9% growth in apparel revenues on a currency-neutral basis was primarily due to higher revenues in Men's, an increase in unit sales by 7%, and a higher average selling price (ASP) per unit, which contributed approximately 2 percentage points to the revenue growth.",
        "source": "finqa"
    },
    {
        "query": "What were the Company's purchases from and resales to the ATMP JV during 2023 and 2022?",
        "response": "The Company's purchases from and resales to the ATMP JV during 2023 and 2022 both amounted to $1.7 billion and $14 million for purchases and resales respectively. In 2022, the purchases were also $1.7 billion while resales amounted to $15 million.",
        "source": "finqa"
    },
    {
        "query": "What was the total amortized cost and fair value of debt securities as of December 31, 2023?",
        "response": "The total amortized cost of debt securities was $48,054 million and the fair value was $45,491 million as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the consequences of the company failing to protect its intellectual property?",
        "response": "Failing to protect intellectual property could harm the company's reputation and affect its ability to compete effectively.",
        "source": "finqa"
    },
    {
        "query": "What are the components included in the management discussion and analysis of financial condition and results of operations?",
        "response": "The components include Overview, Financial Highlights and Market Conditions and Trends, Results of Operations, Comparison of 2023 to 2022, Comparison of 2022 to 2021, Comparable Sales and Sales Per Square Foot, Non-GAAP Financial Measures, Liquidity and Capital Resources, Liquidity Outlook, Contractual Obligations and Commitments, and Critical Accounting Policies and Estimates.",
        "source": "finqa"
    },
    {
        "query": "What was the goodwill amount for the Compute reporting unit of Hewlett Packard Enterprise as of October 31, 2023?",
        "response": "$7.7 billion",
        "source": "finqa"
    },
    {
        "query": "What was the primary driver for the reserve build in Bank of America's consumer portfolio in 2023?",
        "response": "Credit card loan growth and asset quality",
        "source": "finqa"
    },
    {
        "query": "How are promises in the company's contracts for On-Premises Software typically accounted for?",
        "response": "Promises to provide software subscription and O&M services in the context of the contracts for On-Premises Software are not considered distinct and are accounted for as a single performance obligation.",
        "source": "finqa"
    },
    {
        "query": "What were the consequences of a failure to comply with the financial covenants under a company's credit facilities?",
        "response": "A failure to comply with the financial covenants under any credit facility could result in an event of default, potentially requiring the company to repay any outstanding borrowings or to cash collateralize Letters of Credit (LOCs) under such facility. Further events of default could also come from failing to repay material financial obligations or due to certain identified events.",
        "source": "finqa"
    },
    {
        "query": "How significant is the fourth quarter to GameStop's annual sales and operating profit?",
        "response": "The fourth quarter is critically important, as GameStop generates the majority of its sales and operating profit during this period, which includes the holiday selling season.",
        "source": "finqa"
    },
    {
        "query": "What type of contributions does the Chipotle 401(k) Plan allow?",
        "response": "cash contributions from payroll deductions",
        "source": "finqa"
    },
    {
        "query": "What allegations were made against Amazon.com, Inc. in the complaint filed by Broadband iTV, Inc. in October 2020?",
        "response": "The complaint filed by Broadband iTV, Inc. against Amazon.com, Inc. in October 2020 alleges that certain Amazon Prime Video features and services infringe U.S. Patent Nos. 9,648,388, 10,546,750, and 10,536,751, each entitled 'Video-On-Demand Content Delivery System for Providing Video-On-Demand Services to TV Services Subscribers'; 10,028,026, entitled 'System for Addressing On-Demand TV Program Content on TV Services Platform of a Digital TV Services Provider'; and 9,973,825, entitled 'Dynamic Adjustment of Electronic Program Guide Displays Based on Viewer Preferences for Minimizing Navigation in VOD Program Selection.'",
        "source": "finqa"
    },
    {
        "query": "What changes occurred in the way Comcast presents its segment operating results in 2023?",
        "response": "In 2023, Comcast changed the presentation of its segment operating results to a new segment structure.",
        "source": "finqa"
    },
    {
        "query": "What is the typical consequence of acquisitions on the company's operating cash flow?",
        "response": "Operating cash flows may be adversely impacted by acquisitions due to transaction costs, financing costs such as interest expense and lower operating cash flows from the acquired entity.",
        "source": "finqa"
    },
    {
        "query": "What actions can result from the Company's employees or agents failing to comply with applicable laws governing its international or other operations?",
        "response": "If the Company's employees or agents fail to comply with applicable laws, the Company may face investigations, prosecutions, and other legal proceedings, which could result in civil penalties, administrative remedies, and criminal sanctions.",
        "source": "finqa"
    },
    {
        "query": "What part of the document should be consulted for a discussion on legal proceedings?",
        "response": "Part II - Item 8 - Note 14 should be consulted for a discussion on legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What structural change did Humana implement to its business segments in December 2022?",
        "response": "In December 2022, Humana realigned its business into two distinct segments: Insurance and CenterWell. This new structure is used to assess performance and allocate resources, aiming to enhance collaboration and integration within the organization.",
        "source": "finqa"
    },
    {
        "query": "How does competition in the payments industry affect American Express?",
        "response": "Competition in the payments industry impacts American Express by potentially lowering the prices charged to merchants who accept American Express cards, affecting the desirability of its premium card products, and competition for new and existing cobrand relationships. It also influences the competition with respect to new products, services, technologies, competition from new and non-trascal competitors, and the success of marketing, promotion, and rewards programs.",
        "source": "finqa"
    },
    {
        "query": "How does the company recruit and support its employees?",
        "response": "The company recruits employees through local job fairs, social media, and community service partners, offering competitive pay, benefits, and various programs for their well-being, professional growth, and diversity, equity, and inclusion initiatives.",
        "source": "finqa"
    },
    {
        "query": "What is included in Item 8 of the report besides the financial statements?",
        "response": "Item 8 includes the Consolidated Financial Statements, the Notes thereto, and the report of PricewaterhouseCoopers LLP dated February 16, 2024.",
        "source": "finqa"
    },
    {
        "query": "What is Chubb's exposure to molestation claims primarily arising from?",
        "response": "Chubb's exposure to molestation claims primarily arises from liabilities acquired during the purchases of CIGNA's P&C business in 1999 and Chubb Corp in 2016.",
        "source": "finqa"
    },
    {
        "query": "What is the basis for establishing accruals for legal matters according to the company's policy?",
        "response": "Accruals for legal matters are established when a loss contingency is considered probable and the amount can be reasonably estimated.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by financing activities for the years ended December 31, 2022, and 2023?",
        "response": "Net cash provided by financing activities was $218.8 million and $86.0 million for the years ended December 31, 2023 and 2022, respectively.",
        "source": "finqa"
    },
    {
        "query": "What was the change in the total balance of revolving credits from December 31, 2022, to December 31, 2023?",
        "response": "The total balance of revolving credits increased from $10,625 million on December 31, 2022, to $13,257 million on December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How did the stock-based compensation expense for research and development change from fiscal year 2021 to 2023?",
        "response": "It increased from $703 million in 2021 to $1,136 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What primarily caused the year-over-year decrease in Europe net sales in 2023?",
        "response": "The weakness in foreign currencies relative to the U.S. dollar",
        "source": "finqa"
    },
    {
        "query": "How much liability for potential interest and penalties was recorded as of January 28, 2023?",
        "response": "$1.5 million",
        "source": "finqa"
    },
    {
        "query": "What are the different segments that AMD reports financially?",
        "response": "AMD has four reportable segments: the Data Center segment, the Client segment, the Gaming segment, and the Embedded segment.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash consideration for Comcast's acquisition of Masergy in October 2021?",
        "response": "$1.2 billion",
        "source": "finqa"
    },
    {
        "query": "What factors can indicate a need to change the period over which a company benefits from its assets?",
        "response": "Changes to ongoing business operations, changes in the planned use and utilization of assets, or technological advancements can indicate a need to change the period over which a company benefits from its assets.",
        "source": "finqa"
    },
    {
        "query": "What is the charging power range of Enphase-branded EV chargers?",
        "response": "Between 32 amperes and 64 amperes",
        "source": "finqa"
    },
    {
        "query": "What was Garmin Ltd.'s net income for the fiscal year ended December 30, 2023?",
        "response": "$1,289,636",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the corridor used by the company in relation to its pension plans?",
        "response": "The corridor is used to limit the recognition of actuarial gains and losses in financial reporting, and its width is equal to 10% of the greater of plan liabilities or market asset values.",
        "source": "finqa"
    },
    {
        "query": "What topic does Note 20 cover in the report?",
        "response": "Legal Matters",
        "source": "finqa"
    },
    {
        "query": "What type of proceedings is the company currently involved in?",
        "response": "The company is currently involved in legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What percentage of HP’s supplier receivables were represented by the three largest outsourced manufacturer receivable balances as of October 31, 2023?",
        "response": "58%",
        "source": "finqa"
    },
    {
        "query": "How does the Company determine the Standalone Selling Price (SSP) for each distinct performance obligation?",
        "response": "The Company determines the Standalone Selling Price (SSP) by considering its overall pricing objectives and market conditions, including discounting practices, transaction size and volume, customer demographics, geographic sales areas, price lists, and historical and current sales and contract prices.",
        "source": "finqa"
    },
    {
        "query": "What unique feature does QuickBooks Payments offer in its integration into QuickBooks?",
        "response": "QuickBooks Payments is integrated into QuickBooks with seamless onboarding and automated transaction reconciliation, and it serves as the default payment solution for QuickBooks invoicing.",
        "source": "finqa"
    },
    {
        "query": "What is the source to find detailed information about legal proceedings in the Annual Report?",
        "response": "Note 14 to the consolidated financial statements in Item 8 of the Annual Report provides detailed information about the legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "By how much did cash and cash equivalents increase from October 30, 2022, to October 29, 2023?",
        "response": "$1,773 million",
        "source": "finqa"
    },
    {
        "query": "What were the total Nike, Inc. revenues for the fiscal year ended May 31, 2023?",
        "response": "The total Nike, Inc. revenues for the fiscal year ended May 31, 2023, were $51,217 million.",
        "source": "finqa"
    },
    {
        "query": "How does location-based entertainment enhance consumer experience for Hasbro brands?",
        "response": "Location-based entertainment allows consumers to experience Hasbro brands in immersive settings like theme parks, hotels, and themed retail locations, enriching storytelling and brand interaction.",
        "source": "finqa"
    },
    {
        "query": "What factors influence American Express's decision to reinvest gains into its business?",
        "response": "American Express's decision to reinvest gains into its business is influenced by factors such as regulatory and other approvals, consultation requirements, the execution of ancillary agreements, the cost and availability of financing for the purchaser, the potential loss of key customers, vendors, and business partners, and management’s decisions regarding future operations, strategies, and business initiatives.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in sales for Uptravi in the U.S. from 2022 to 2023?",
        "response": "20.1%",
        "source": "finqa"
    },
    {
        "query": "What are the useful life ranges for buildings, building improvements, leasehold improvements, fixtures, equipment, and internally developed software?",
        "response": "Buildings, building improvements, and leasehold improvements typically have a useful life ranging from 1 to 40 years, while fixtures, equipment, and internally developed software generally have a useful life ranging from 3 to 10 years.",
        "source": "finqa"
    },
    {
        "query": "What type of content can Members access through the Peloton App Membership?",
        "response": "Members using the Peloton App Membership can access a variety of content including strength, meditation, outdoor walking, yoga, and other class types across different modalities.",
        "source": "finqa"
    },
    {
        "query": "What distinctive features does the Microsoft Experience Centers offer?",
        "response": "Microsoft Experience Centers are designed to facilitate deeper engagement with partners and customers across various industries.",
        "source": "finqa"
    },
    {
        "query": "How much did FedEx's operating expenses decrease by in 2023 compared to 2022?",
        "response": "$2.0 billion",
        "source": "finqa"
    },
    {
        "query": "What significant action did Visa take in response to the economic sanctions imposed on Russia?",
        "response": "Visa suspended its operations in Russia in March 2022, ceasing revenue generation from domestic and cross-border activities related to Russia.",
        "source": "finqa"
    },
    {
        "query": "How much Gross Merchandise Sales did Etsy's marketplaces generate in 2023?",
        "response": "Etsy's marketplaces generated $13.2 billion of Gross Merchandise Sales in 2023.",
        "source": "finqa"
    },
    {
        "query": "How is the amortization for owned content predominantly monetized on an individual basis recorded, and what computation method is used?",
        "response": "Amortization for owned content predominantly monetized on an individual basis is recorded using the individual film forecast computation method, which recognizes the costs in the same ratio as the associated ultimate revenue, based on anticipated release patterns, distribution strategies, public acceptance, and historical results for similar productions.",
        "source": "finqa"
    },
    {
        "query": "How does Google prioritize privacy and security in its operations?",
        "response": "Google prioritizes privacy and security by investing continuously in secure products, upholding responsible data practices, and providing user-friendly settings that enable control over privacy.",
        "source": "finqa"
    },
    {
        "query": "What is the interest rate and maturity range for the SkyMiles Notes?",
        "response": "The SkyMiles Notes have interest rates of 4.50% and 4.75%, with a maturity range from 2024 to 2028.",
        "source": "finqa"
    },
    {
        "query": "When do the IRA provisions that impose rebates for price increases above inflation rates begin to apply for Medicare Part D and Part B drugs?",
        "response": "The provisions begin to apply on October 1, 2022, for Medicare Part D drugs and on January 1, 2023, for Medicare Part B drugs.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of First Mortgages purchased by CSB in 2023?",
        "response": "$2.9 billion",
        "source": "finqa"
    },
    {
        "query": "What are the expected sources of funding for the company's capital needs in the foreseeable future?",
        "response": "The company expects that existing cash and equivalents, short-term investments, cash generated by operations, together with access to external sources of funds will be sufficient to meet its capital needs in the foreseeable future.",
        "source": "finqa"
    },
    {
        "query": "How are Medicare Supplement product rates determined?",
        "response": "Rates for Medicare Supplement products are regulated at the state level and vary by state and plan.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in impairment of goodwill for Hewlett Packard Enterprise between fiscal 2022 and 2023?",
        "response": "Decreased by 100%",
        "source": "finqa"
    },
    {
        "query": "How much did the provision for income taxes increase from fiscal year 2022 to 2023?",
        "response": "$232 million",
        "source": "finqa"
    },
    {
        "query": "How do cyberattacks affect the company's relationship with its customers?",
        "response": "Cyberattacks could make customers unable or reluctant to use the company's electronic platforms or other products and services, potentially resulting in a loss of customers and negatively impacting the company's business.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of client securities available to be pledged at Charles Schwab as of December 31, 2023?",
        "response": "$86,911 million",
        "source": "finqa"
    },
    {
        "query": "When did Kerry J. McLean start her role as Executive Vice President, General Counsel, and Corporate Secretary?",
        "response": "August 2020",
        "source": "finqa"
    },
    {
        "query": "What is the total minimum investment amount VML is required to invest in non-gaming projects as part of the concession, according to the exchange rates in effect on December 31, 2023?",
        "response": "30.24 billion patacas (approximately $3.76 billion)",
        "source": "finqa"
    },
    {
        "query": "What is the company's approach to managing relationships with large enterprise customers?",
        "response": "The company assigns an account manager to manage relationships with large enterprise customers, supported by a team of specialists with product and services expertise. This is part of a bifurcated sales operational model that also includes separate go-to-market routes for different types of sales.",
        "source": "finqa"
    },
    {
        "query": "How much did Comcast's Peacock-related expenses change from 2021 to 2023?",
        "response": "Peacock-related expenses at Comcast increased from $2.5 billion in 2021 to $6.1 billion in 2023.",
        "source": "finqa"
    },
    {
        "query": "What benefits were enhanced by the Company in July 2023?",
        "response": "The Company enhanced its caregiver, bereavement, and volunteer paid leave benefits.",
        "source": "finqa"
    },
    {
        "query": "How much of the Company's manufacturing purchase obligations were payable within 12 months as of September 30, 2023?",
        "response": "$52.9 billion",
        "source": "finqa"
    },
    {
        "query": "Where in the Annual Report on Form 10-K are the contents of Item 8 included?",
        "response": "The contents of Item 8 are included elsewhere in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What is described in Item 8 of a financial reporting document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the rise in net cash used in financing activities from 2022 to 2023?",
        "response": "The rise was primarily due to an increase in stock repurchases from $425.7 million in 2022 to $577.0 million in 2023, and an increase in payment of tax obligations on vested equity awards from $79.2 million in 2022 to $83.4 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the Form 10-K?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What is the primary function of Etsy's online marketplaces?",
        "response": "Etsy's online marketplaces primarily connect millions of passionate and creative buyers and sellers around the world, facilitating the sale of unique and creative goods made by independent sellers.",
        "source": "finqa"
    },
    {
        "query": "What are the key applications of custom silicon solutions in data centers?",
        "response": "Custom silicon solutions in data centers are primarily used for compute offload, supporting advanced technology and IP platforms tailored for data center applications.",
        "source": "finqa"
    },
    {
        "query": "How has Chipotle's digital sales changed in percentage terms from 2022 to 2023?",
        "response": "Digital sales decreased from 39.4% of food and beverage revenue in 2022 to 37.4% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the net amount of Delta Air Lines' total assets in 2023 according to their financial statements?",
        "response": "$73,644 million",
        "source": "finqa"
    },
    {
        "query": "What are the payment terms for commercial customers in the company?",
        "response": "The payment terms for commercial customers range from 1 to 30 days.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value measurement of cash equivalents at the reporting date using Level 1 on October 30, 2022?",
        "response": "$19 million",
        "source": "finqa"
    },
    {
        "query": "What method of goodwil impairment testing did the Company adopt during the fourth quarter of 2023?",
        "response": "During the fourth quarter of 2023, the Company voluntarily changed its goodwill and indefinite-lived intangible asset annual impairment test date from September 30 to December 1 to better align with the Company's strategic business planning and budgeting process.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in NYSE total cash handled volume from 2022 to 2023?",
        "response": "a decrease of 7%",
        "source": "finqa"
    },
    {
        "query": "What was the amount recorded for additional paid-in capital at the end of 2023?",
        "response": "$114,519 million",
        "source": "finqa"
    },
    {
        "query": "What changes were made to Comcast's investment agreement with Atairos in November 2020?",
        "response": "In November 2020, Comcast amended its agreement with Atairos by extending the investment term from 12 years to 16.5 years, allowing capital to be recycled throughout the full investment period, and decreasing the funding commitment from $5 billion to $4.5 billion. The maximum annual capital calls were also reduced to $400 million, plus certain amounts from previous distributions.",
        "source": "finqa"
    },
    {
        "query": "What strategic acquisitions did CVS Health complete in 2023 to enhance its care delivery strategy?",
        "response": "In 2023, CVS Health completed the strategic acquisitions of Signify Health, a leader in health risk assessments and provider enablement services, and Oak Street Health, a leading multi-payor operator of value-based primary care centers serving Medicare patients.",
        "source": "finqa"
    },
    {
        "query": "What caused the decrease in operating cash for the reported company in 2023 compared to an increase in 2022?",
        "response": "The timing of income tax payments contributed to a decrease in operating cash of $32.5 million in 2023, compared to an increase of $5.0 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the expected amount of incremental run-rate cost savings the company aims to achieve in addition to integration synergies?",
        "response": "$500 million",
        "source": "finqa"
    },
    {
        "query": "How did the revenue from automotive regulatory credits change in 2023 compared to 2022?",
        "response": "The revenue from automotive regulatory credits increased by $14 million, or 1%, in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the aggregate principal amount of senior notes outstanding as of January 29, 2023?",
        "response": "$41.2 billion",
        "source": "finqa"
    },
    {
        "query": "How much did the company's net cash from operating activities increase in 2023 compared to the previous year?",
        "response": "The company's net cash provided by operating activities increased by $500 million in 2023, rising from $3.4 billion in the previous year to $3.9 billion.",
        "source": "finqa"
    },
    {
        "query": "What is Delta Air Lines’ role in the Sustainable Flight Demonstrator program?",
        "response": "Delta Air Lines will serve as an adviser on a new aircraft design for the Sustainable Flight Demonstrator program.",
        "source": "finqa"
    },
    {
        "query": "What actions has the company planned for fiscal 2023 regarding their store operations?",
        "response": "For fiscal 2023, the company plans to open new stores, expand and renovate existing stores, and invest in supply chain and information technology.",
        "source": "finqa"
    },
    {
        "query": "By how much did Net sales change in fiscal 2022 compared to the previous fiscal year?",
        "response": "decreased by $83.5 million or 1.4%",
        "source": "finqa"
    },
    {
        "query": "What is the average size of a Costco warehouse?",
        "response": "The average size of a Costco warehouse is approximately 147,000 square feet.",
        "source": "finqa"
    },
    {
        "query": "What was the total proceeds from the issuance of senior notes by the Company on June 2, 2023?",
        "response": "approximately $4.9 billion",
        "source": "finqa"
    },
    {
        "query": "What was AMD's total comprehensive income for the year ended December 30, 2023?",
        "response": "$885 million",
        "source": "finqa"
    },
    {
        "query": "What were the total unsettled obligations for The Hershey Company's trade promotion activities as of December 31, 2023?",
        "response": "$194.0 million",
        "source": "finqa"
    },
    {
        "query": "On what page of the Annual Report is the impact of litigation on the business discussed?",
        "response": "Page 17",
        "source": "finqa"
    },
    {
        "query": "What additional information should be read in conjunction with this item for a better understanding of the company's risks?",
        "response": "The Company's Risk Factors in Part I, Item 1A should be read in conjunction with this item for additional information on the company's risks.",
        "source": "finqa"
    },
    {
        "query": "What efforts are being made in research and development at the company?",
        "response": "The company invests in research and development programs focused on designing and developing innovative products, services, and solutions that align with customer needs and emerging technological trends. Current R&D initiatives include developing next-generation compute solutions and cloud-based management software.",
        "source": "finqa"
    },
    {
        "query": "What regions are expected to primarily concentrate future user growth, according to the report?",
        "response": "Future user growth is expected to be primarily concentrated in regions with relatively lower ARPU, specifically Asia-Pacific and Rest of World.",
        "source": "finqa"
    },
    {
        "query": "What is presented in Item 8 of a financial document?",
        "response": "The index to Financial Statements and Supplementary Data is presented in Item 8.",
        "source": "finqa"
    },
    {
        "query": "What was the total cost and expenses for 2023?",
        "response": "$46,377 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in FedEx's aircraft and related equipment capital expenditures in 2023 compared to 2022?",
        "response": "26%",
        "source": "finqa"
    },
    {
        "query": "What was the total operating lease cost for the company in fiscal 2021?",
        "response": "$111 million",
        "source": "finqa"
    },
    {
        "query": "What is the fundamental obligation mentioned in the company's Code of Ethics regarding employees?",
        "response": "The company's Code of Ethics requires that they \"Take Care of Our Employees,\" which is fundamental to the obligation to \"Take Care of Our Members.\"",
        "source": "finqa"
    },
    {
        "query": "What are included in Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included in Part IV, specifically listed under Item 15(a)(1).",
        "source": "finqa"
    },
    {
        "query": "What legal action is associated with the EPA's 2021 GHG standards rule, and when is the court decision expected?",
        "response": "The 2021 GHG standards rule is the subject of a pending legal challenge, with a court decision expected in 2024.",
        "source": "finqa"
    },
    {
        "query": "What considerations are made in valuing intangible assets in business combinations and impairment assessments?",
        "response": "The valuation of intangible assets requires consideration of factors such as the identification of product candidates, projected future cash flows, probability of technical and regulatory success, development time and resources, appropriate discount rate, product life and risks, and viability of alternative treatments.",
        "source": "finqa"
    },
    {
        "query": "What components are included in the company's employee compensation programs?",
        "response": "The employee compensation programs include base pay, annual incentive awards, recognition programs, and equity awards for employees at certain job levels.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the closing solutions revenues decrease in 2023 compared to 2022?",
        "response": "25%",
        "source": "finqa"
    },
    {
        "query": "What was the purpose of the Company's transaction involving the purchase and subsequent sale of properties in 2021?",
        "response": "The Company acquired 28 properties that were previously leased and then sold them to a third party. The transactions were aimed at asset management, as evidenced by the acquisition, subsequent sale for higher proceeds, and financial obligations recorded. The leases on these properties were structured with a base term and multiple option periods, indicating long-term use and flexibility in terms of property control.",
        "source": "finqa"
    },
    {
        "query": "What are the three objectives of the capital allocation program referenced?",
        "response": "The three objectives of the capital allocation program are to grow the business at an average target ROIC-adjusted rate of 20% or greater, maintain a strong investment-grade balance sheet with a target average automotive cash balance of $18.0 billion, and return available cash to shareholders after the first two objectives are met.",
        "source": "finqa"
    },
    {
        "query": "How did diesel fuel prices affect the company’s freight costs in fiscal 2022?",
        "response": "Higher diesel fuel prices in fiscal 2022 led to increased domestic freight costs for the company.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in Client segment net revenue in 2023 compared to 2022?",
        "response": "25%",
        "source": "finqa"
    },
    {
        "query": "What is the matching contribution structure of the Chipotle 401(k) Plan?",
        "response": "100% on the first 3% of pay and 50% on the next 2% of pay each pay period",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash dividends paid by Johnson & Johnson in 2023?",
        "response": "$11,770 million",
        "source": "finqa"
    },
    {
        "query": "What is the stance of the defending airlines on the claims made against them in the capacity antitrust litigation?",
        "response": "The defending airlines believe the claims are without merit and are vigorously defending the lawsuits.",
        "source": "finqa"
    },
    {
        "query": "What method is used to record property, plant, and equipment on the financial statements?",
        "response": "Property, plant, and equipment is recorded at cost reduced by accumulated depreciation.",
        "source": "finqa"
    },
    {
        "query": "What was the weighted-average remaining contract life of restricted stock units at December 30, 2023?",
        "response": "1.36 years",
        "source": "finqa"
    },
    {
        "query": "What petrochemical products does GSC produce?",
        "response": "GSC manufactures aromatics such as benzene, toluene, and xylene, as well as olefins including ethylene, polyethylene, and polypropylene.",
        "source": "finqa"
    },
    {
        "query": "What position has Daniel C. Janki held at Delta since July 2021?",
        "response": "Executive Vice President - Chief Financial Officer",
        "source": "finqa"
    },
    {
        "query": "How much cash was provided by financing activities in 2023?",
        "response": "In 2023, cash provided by financing activities was $(15.9) billion.",
        "source": "finqa"
    },
    {
        "query": "How much was authorized for the share repurchase program by the company's Board of Directors?",
        "response": "$5.0 billion",
        "source": "finqa"
    },
    {
        "query": "How is the average discount rate for the company's OPRB plan determined, and what is its impact from a 100 basis-point change?",
        "response": "The average discount rate for the OPRB plan is determined by the higher interest rates generally applicable in the U.S. A 100 basis-point change in this rate would impact the annual after-tax OPRB expense by approximately $30 million.",
        "source": "finqa"
    },
    {
        "query": "What are the five kinds of price tiers in which the company's products compete?",
        "response": "The products compete in super-premium, premium, mid-tier, and value-tier price levels.",
        "source": "finqa"
    },
    {
        "query": "What was the primary cause for the increase in research and development expense in fiscal year 2023?",
        "response": "The increase was primarily due to increased compensation, employee growth, engineering development costs, and data center infrastructure.",
        "source": "finqa"
    },
    {
        "query": "How many shares of Class A common stock were repurchased and retired in 2023, and what was the total cost including excise tax accruals?",
        "response": "In 2023, 92 million shares of Class A common stock were repurchased and retired for a total cost of $20.03 billion, which includes excise tax accruals.",
        "source": "finqa"
    },
    {
        "query": "What incentives does GM offer as part of its Total Rewards package to support employee wellness?",
        "response": "GM's Total Rewards package supports physical, emotional, and financial wellness through compensation, a 401(k) program, paid time off, health care plans, and GM Family First savings on vehicles, parts, and services.",
        "source": "finqa"
    },
    {
        "query": "What was the change in Delta Air Lines' adjusted operating income from 2022 to 2023?",
        "response": "From $3,566 million in 2022 to $6,334 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is lululemon's vision?",
        "response": "Lululemon's vision is to create transformative products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all.",
        "source": "finqa"
    },
    {
        "query": "What criteria must be met for an impairment loss to be recognized on an indefinite-lived intangible asset?",
        "response": "The carrying amount of an indefinite-lived intangible asset must exceed its fair value.",
        "source": "finqa"
    },
    {
        "query": "What role does the GM Technical Learning University play in enhancing employee skills?",
        "response": "The GM Technical Learning University serves as a training and upskilling program designed to expand and update the technical prowess of GM's workforce.",
        "source": "finqa"
    },
    {
        "query": "What changes are planned for the company's reporting metrics starting in fiscal year 202es and how does this affect the treatment of paused subscriptions?",
        "response": "Beginning in fiscal year 2024, the company plans to exclude paused Connected Fitness subscriptions from its new 'Ending Paid Connected Fitness Subscriptions' metric and will treat a pause action as a churn event in its 'Average Net Monthly Paid Connected Fitness Subscription Churn' metric.",
        "source": "finqa"
    },
    {
        "query": "What special features does Hasbro PULSE offer to its consumers?",
        "response": "Hasbro PULSE offers product related livestreams, access to behind-the-scenes material, insider details, and participation in HasLab for crowdfunding exclusive collectibles.",
        "source": "finqa"
    },
    {
        "query": "What environmental commitment did Hasbro make for reducing greenhouse gas emissions by 2030?",
        "response": "Hasbro committed to reducing Scope 1 and Scope 2 emissions by 47.5% and to reduce Scope 3 emissions by 42% by 2030, as validated by the Science-Based Targets Initiative.",
        "source": "finqa"
    },
    {
        "query": "How was the net cash used or provided by financing activities represented for the year ending in 2023?",
        "response": "Net cash used in financing activities amounted to $64,345 in 2023.",
        "source": "finqa"
    },
    {
        "query": "Who does the Company sell fountain syrups to, and what do these wholesalers do with the syrups?",
        "response": "The Company sells fountain syrups to authorized fountain wholesalers, who then sell or deliver these syrups to retailers like restaurants on the Company’s behalf.",
        "source": "finqa"
    },
    {
        "query": "What types of financial estimations influence income tax accounting in a company?",
        "response": "The determination of a company's provision for income taxes involves judgment and the use of estimates, including assessing unrecognized tax benefits and valuation allowances, interpreting complex tax laws, and handling outcomes of administrative audits.",
        "source": "finqa"
    },
    {
        "query": "What are the factors that the company must consider when making inventory commitments as a fabless semiconductor company?",
        "response": "As a fabless semiconductor company, it must consider forecasts of future customer demand, third-party manufacturers' lead times and constraints, and other market factors such as competitors' product offerings and pricing actions, new product transitions, and macroeconomic conditions.",
        "source": "finqa"
    },
    {
        "query": "What type of data does Item 8 in a financial document contain?",
        "response": "Item 8 contains the Consolidated Financial Statements and Supplementary Data including notes and independent audit reports.",
        "source": "finqa"
    },
    {
        "query": "What types of insurance coverage does the company maintain for its employees?",
        "response": "The company maintains workers' compensation or equivalent coverage for all employees, and health coverages for some U.S. and Puerto Rico employees, with third-party insurance protection for costs over specified thresholds.",
        "source": "finqa"
    },
    {
        "query": "How much did the company repay in Senior Notes on July 17, 2023?",
        "response": "$500 million",
        "source": "finqa"
    },
    {
        "query": "What was the weighted-average grant date fair value per PSU granted in 2022?",
        "response": "$1,569.39",
        "source": "finqa"
    },
    {
        "query": "What are the total gross leasable area (GLA) and some significant tenants of Shoppes at Four Seasons as of December 31, 2023?",
        "response": "As of December 31, 2023, the Shoppes at Four Seasons had a total GLA of 249,373 square feet, with significant tenants including Cartier, Chanel, Louis Vuitton, Hermès, Gucci, Dior, Versace, Zegna, Loro Piana, Saint Laurent, Balenciaga, Loewe, Roger Vivier, Christian Louboutin, Alexander McQueen, Miu Miu, Tiffany & Co., and Rimowa.",
        "source": "finqa"
    },
    {
        "query": "How is the Common Equity Tier 1 Risk-Based Capital Ratio determined?",
        "response": "The Common Equity Tier 1 Risk-Based Capital Ratio is calculated by dividing CET1 Capital by the total risk-weighted assets at the end of the period.",
        "source": "finqa"
    },
    {
        "query": "How much acreage does Chevron have under development or lease globally as of the end of 2023?",
        "response": "63,730 thousand acres",
        "source": "finqa"
    },
    {
        "query": "How does the Company estimate the variable consideration for OEM and distributor arrangements?",
        "response": "The Company estimates the variable consideration under OEM and distributor arrangements by recording a provision for product returns, allowances for price protection, and rebates based on actual historical experience and any known events.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of tax incurred, collected, and remitted by AT&T in 2023?",
        "response": "$16,877",
        "source": "finqa"
    },
    {
        "query": "How many broadband and internet services does the company provide to customer locations as of the end of 2023?",
        "response": "15 million",
        "source": "finqa"
    },
    {
        "query": "What is GM's strategy to handle raw material sourcing for its EV manufacturing?",
        "response": "GM aims to develop a resilient and sustainable North America-focused EV supply chain by investing in raw materials suppliers and executing strategic multi-year supply agreements.",
        "source": "finqa"
    },
    {
        "query": "How much stock-based compensation expense did Chipotle Mexican Grill, Inc. incur during the year ended December 31, 2023?",
        "response": "$126.7 million",
        "source": "finqa"
    },
    {
        "query": "What was the fair value per performance-based share granted for the fiscal years 2023, 2022, and 2021?",
        "response": "For fiscal years 2023, 2022, and 2021, the fair value per performance-based share granted was $221.32, $186.50, and $229.81 respectively.",
        "source": "finqa"
    },
    {
        "query": "What was the voluntary turnover rate at the Company in 2023?",
        "response": "7%",
        "source": "finqa"
    },
    {
        "query": "How did the carrying amount of goodwill change from March 31, 2022 to March 31, 2023?",
        "response": "The carrying amount of goodwill decreased from $5,387 million to $5,380 million.",
        "source": "finqa"
    },
    {
        "query": "Which sports events does Comcast have the most significant rights commitments for?",
        "response": "NFL, Olympics and English Premier League",
        "source": "finqa"
    },
    {
        "query": "What was the overall impact of foreign currencies on net sales in 2023?",
        "response": "Changes in foreign currencies relative to the U.S. dollar negatively impacted net sales by approximately $3,484 in 2023.",
        "source": "finqa"
    },
    {
        "query": "What percentage of global female employees at Bank of America were compensated compared to their male counterparts in comparable positions?",
        "response": "greater than 99 percent",
        "source": "finqa"
    },
    {
        "query": "How much did the interest expense increase in 2023 compared to 2022?",
        "response": "Increased due to higher interest rates and higher weighted average debt balances.",
        "source": "finqa"
    },
    {
        "query": "How was the fair value of in-process research and development (IPR&D) assessed, and what was its status regarding amortization by the end of 2023?",
        "response": "The fair value of IPR&D was determined using the multi-period excess earnings method. Initially not amortized as an indefinite-lived intangible asset, it began amortization in the fourth quarter of 2023 over 15 years after reaching technological feasibility.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in net sales for Sam’s Club from fiscal year 2021 to 2023, including fuel?",
        "response": "The percentage change in net sales for Sam’s Club from fiscal year 2021 to 2023, including fuel, was 14.7%.",
        "source": "finqa"
    },
    {
        "query": "What are the main sources of liquidity for the company as of December 31, 2023?",
        "response": "The main sources of liquidity for the company as of December 31, 2023, are cash flows generated from operations and the balances of cash, cash equivalents, and marketable securities.",
        "source": "finqa"
    },
    {
        "query": "What is the range of pages that the Financial Statements and Supplementary Data cover in IBM's 2023 Annual Report?",
        "response": "Pages 44 to 121",
        "source": "finqa"
    },
    {
        "query": "What does the company use to make their supply chain more environmentally responsible?",
        "response": "hydrogen fuel cell technology in forklifts",
        "source": "finqa"
    },
    {
        "query": "How did the IRS tax filing deadline extension in fiscal 2021 affect the financial results of the Consumer and ProTax segments?",
        "response": "The IRS tax filing deadline extension in fiscal 2021 to May 17 resulted in a significant recognition of revenues for the Consumer and ProTax segments in the fourth quarter, shifting the typical revenue recognition from the stronger third quarter.",
        "source": "finqa"
    },
    {
        "query": "What is the projected increase in effective tax rate starting from fiscal 2024?",
        "response": "The effective tax rate is expected to be higher starting from fiscal 2024.",
        "source": "finqa"
    },
    {
        "query": "How much was the identified intangible assets from the Pensando acquisition amortized over?",
        "response": "$349 million",
        "source": "finqa"
    },
    {
        "query": "What happens to a Hilton franchise contract at the end of its initial term?",
        "response": "It may be relicensed to the franchisee for an additional term generally ranging from 10 to 15 years.",
        "source": "finqa"
    },
    {
        "query": "What was the net interest revenue for 2023?",
        "response": "$9,427 million",
        "source": "finqa"
    },
    {
        "query": "When did Mr. Aujla start his role as Executive Vice President and Chief Financial Officer at Intuit?",
        "response": "August 2023",
        "source": "finqa"
    },
    {
        "query": "How is Revenue per Available Room (RevPAR) calculated and what does it indicate?",
        "response": "RevPAR is calculated by dividing hotel room revenue by the total number of room nights available to guests for a given period, and it provides a meaningful indicator of performance correlating to occupancy and Average Daily Rate (ADR), key drivers of operations at a hotel or group of hotels.",
        "source": "finqa"
    },
    {
        "query": "How is the take rate calculated and what does it represent?",
        "response": "Take rate is calculated as net revenues divided by GMV and represents net revenue as a percentage of overall volume on the platforms.",
        "source": "finqa"
    },
    {
        "query": "What percentage increase in revenues did Alphabet Inc. report in 2023 compared to the previous year?",
        "response": "9%",
        "source": "finqa"
    },
    {
        "query": "What was the total intrinsic value of stock options exercised in 2023?",
        "response": "$173 million",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the increase in Construction Industries' profit in 2023?",
        "response": "The primary reason for the increase in Construction Industries' profit in 2023 was favorable price realization.",
        "source": "finqa"
    },
    {
        "query": "What is the basis for the Company to determine the Standalone Selling Price (SSP) for each distinct performance obligation in contracts with multiple performance obligations?",
        "response": "The Company determines the Standalone Selling Price (SSP) by considering its overall pricing objectives and market conditions. Specific factors taken into account include the Company's discounting practices, the size and volume of transactions, customer demographics, geographic areas where services are sold, price lists, the company's go-to-market strategy, as well as historical and current sales and contract prices.",
        "source": "finqa"
    },
    {
        "query": "What was the purpose of the new D-SNP requirements implemented by states in 2021?",
        "response": "The purpose of the new D-SNP requirements implemented in 2021 was to strengthen Medicaid-Medicare integration for D-SNPs.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the General and Administrative expenses increase in 2023?",
        "response": "General and Administrative expenses increased by 113% in 2023.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did Pulmonary Hypertension products sales increase in 2023 compared to the previous year?",
        "response": "11.6%",
        "source": "finqa"
    },
    {
        "query": "What is FedEx's goal for its global operations in terms of carbon neutrality and by when does it aim to achieve it?",
        "response": "FedEx aims to achieve carbon neutrality across its global operations by calendar 2040.",
        "source": "finqa"
    },
    {
        "query": "What is the measurement basis for recognizing tax benefits in financial statements according to the described method?",
        "response": "The tax benefits recognized in financial statements are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement.",
        "source": "finqa"
    },
    {
        "query": "Why do Garmin's aviation and auto OEM products experience less seasonal variation?",
        "response": "Garmin's aviation and auto OEM products experience less seasonal variation because they are more influenced by the timing of aircraft certifications, regulatory mandates, and auto program manufacturing.",
        "source": "finqa"
    },
    {
        "query": "What is the percentage change in principal transactions revenue between 2022 and 2023?",
        "response": "52%",
        "source": "finqa"
    },
    {
        "query": "What was the weighted-average fair value per share of stock options granted in 2021?",
        "response": "$56.30",
        "source": "finqa"
    },
    {
        "query": "At what discount can employees purchase stock under Chipotle's ESPP?",
        "response": "92.5% of the lower of the fair market value on the first and last trading days of each offering period",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources of breakage revenue for the company mentioned in the text?",
        "response": "The primary sources of breakage revenue for the company are company-operated stores and licensed stores.",
        "source": "finqa"
    },
    {
        "query": "What does Note 30 contain information about in this context?",
        "response": "The Firm’s material legal proceedings",
        "source": "finqa"
    },
    {
        "query": "What drove the 7.4% increase in AutoZone's net sales for fiscal 2023 compared to fiscal 2022?",
        "response": "The 7.4% increase in AutoZone's net sales for fiscal 2023 compared to fiscal 2022 was primarily driven by a domestic same store sales increase of 3.4% and net sales of $327.8 million from new domestic and international stores.",
        "source": "finqa"
    },
    {
        "query": "What factors could potentially lead to a decline in the company's fees?",
        "response": "A decline in the company's fees could be caused by competitive pressure or regulatory changes.",
        "source": "finqa"
    },
    {
        "query": "How much did the general corporate expense increase in 2023 compared to 2022?",
        "response": "General corporate expense increased by $69.4 million in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What must Apple ensure to compete successfully given the rapid technological advances in its industry?",
        "response": "Apple must ensure a continual and timely flow of competitive products, services, and technologies to the marketplace.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the change in IMC’s pre-tax earnings in 2022 compared to 2021?",
        "response": "IMC’s pre-tax earnings decreased in 2022 compared to 2021 due to lower average gross sales margins from changes in product sales mix and higher raw material costs, along with unfavorable foreign currency translation effects and the Russian-Ukraine conflict.",
        "source": "finqa"
    },
    {
        "query": "What regulatory obligations are imposed on U.S. regulated investment advisers under the Investment Advisers Act of 1940?",
        "response": "Regulatory obligations under the Investment Advisers Act of 1940 include management and distribution of products and services, record-keeping, compliance oversight, operational and marketing requirements, disclosure obligations, and prohibitions on fraudulent activities.",
        "source": "finqa"
    },
    {
        "query": "What does the index to Financial Statements and Supplementary Data include?",
        "response": "The index to Financial Statements and Supplementary Data includes a listing or reference to relevant financial data.",
        "source": "finqa"
    },
    {
        "query": "What was the total interest expense for the year ended December 31, 2023?",
        "response": "$348.8 million",
        "source": "finqa"
    },
    {
        "query": "Did the impairment tests conducted in 2023 and 2022 result in any material impairment losses for indefinite-lived intangible assets?",
        "response": "No",
        "source": "finqa"
    },
    {
        "query": "How has HPE adapted its business model in response to emerging technological megatrends?",
        "response": "HPE has adapted its business model by deploying an edge-to-cloud strategy that capitalizes on emergent megatrends, delivering a data-first modernization approach, evolving to a platform-based model, and focusing on a portfolio richer in software and services.",
        "source": "finqa"
    },
    {
        "query": "What method did the Company adopt for the new long-duration insurance accounting standard on January 1, 2023?",
        "response": "The Company adopted the new long-duration insurance accounting standard using a modified retrospective transition method as of January 1, 2021.",
        "source": "finqa"
    },
    {
        "query": "What is the title of Item 8 in the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How did Hilton Worldwide Holdings Inc.'s accumulated deficit change from December 31, 2022, to December 31, 2023?",
        "response": "The accumulated deficit increased from $(6,040) million to $(8,393) million.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage of proprietary brand product sales as part of the front store revenues in 2023?",
        "response": "21%",
        "source": "finqa"
    },
    {
        "query": "What was the total dividends paid by Kroger in 2022?",
        "response": "$682 million",
        "source": "finqa"
    },
    {
        "query": "How did the net revenue for fiscal year 2023 compare to fiscal year 2022?",
        "response": "The net revenue for fiscal year 2023 increased by $435 million compared to fiscal year 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of unrestricted cash available for repatriation from Mainland China to the U.S. as of the end of 2023?",
        "response": "Approximately $1.80 billion of the unrestricted cash is available to be repatriated from Mainland China to the U.S. as of the end of 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the main categories of revenue listed in the Consolidated Statements of Operations for the years ended December 31, 2021, 2022, and 2023?",
        "response": "The main categories of revenue listed are Products, Premiums, and Services.",
        "source": "finqa"
    },
    {
        "query": "What judicial decision occurred in August 2023 regarding the antitrust lawsuits against the airlines?",
        "response": "In August 2023, the Court denied the defendants' motions for summary judgment that had been pending for over two years.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in total net revenues for AbbVie in 2023 compared to the previous year?",
        "response": "6.4%",
        "source": "finqa"
    },
    {
        "query": "What was the percentage of net sales accounted for by the interest and other, net, in fiscal 2022?",
        "response": "1.0%",
        "source": "finqa"
    },
    {
        "query": "How long is the warranty term for subsequent generations of microinverters?",
        "response": "up to 25 years",
        "source": "finqa"
    },
    {
        "query": "How are false claims and consumer protection laws monitored at the state level in the U.S.?",
        "response": "States in the U.S. have their own consumer protection and false claims laws in addition to federal regulations.",
        "source": "finqa"
    },
    {
        "query": "What legal challenges could significantly affect Comcast's broadband services?",
        "response": "Changes in Open Internet/net neutrality regulations, adoption of new broadband-related regulations, and varying state and local regulations could significantly impact Comcast's broadband services.",
        "source": "finqa"
    },
    {
        "query": "How does working capital affect liquidity in financial statements?",
        "response": "Working capital affects liquidity in financial statements through components like deferred revenue, taxes, and semi-annual interest payments on outstanding debt, with receivables from members generally settling quickly.",
        "source": "finqa"
    },
    {
        "query": "What accounting treatment does the Company apply to refunds issued to customers?",
        "response": "The Company accounts for refunds as variable consideration, which results in a reduction to revenue. They reduce the transaction price by the estimated amount of the payments using the most likely outcome method based on known facts and circumstances and historical experience.",
        "source": "finqa"
    },
    {
        "query": "What was the financial cost associated with the termination of the acquisition of Arm?",
        "response": "The financial cost associated with the termination of the acquisition of Arm was $1.35 billion.",
        "source": "finqa"
    },
    {
        "query": "How many Dollar Tree Plus stores were there as of January 28, 2023?",
        "response": "As of January 28, 2023, there were approximately 2,500 Dollar Tree Plus stores.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the reported 2% increase in EBIT for fiscal 2023?",
        "response": "The reported 2% increase in EBIT for fiscal 2023 was primarily due to higher revenues, which were partially offset by a gross margin contraction and higher selling and administrative expenses.",
        "source": "finqa"
    },
    {
        "query": "What are Chevron New Energies’ current focus areas in terms of commercialization opportunities?",
        "response": "Chevron New Energies is focused on developing new lower carbon businesses in hydrogen, carbon capture and storage, carbon offsets, and emerging technologies such as geothermal.",
        "source": "finqa"
    },
    {
        "query": "How is Alphabet investing in its future growth and infrastructure?",
        "response": NaN,
        "source": "finqa"
    },
    {
        "query": "What specific note in a Form 10-K provides details on legal proceedings?",
        "response": "Note 17 – Contingencies provides details on legal proceedings in a Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What were the total Selling, general and administrative expenses for the year ended December 31, 2023?",
        "response": "$1,236,287,000",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the IBM Form 10-K for 2023?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "How many shares of Common Stock were issued by the Company on August 28, 2023, as part of a litigation settlement?",
        "response": "The Company issued 6,897,018 shares of Common Stock on August 28, 2023, as part of a litigation settlement.",
        "source": "finqa"
    },
    {
        "query": "What are the benefits included in the Software Assurance (SA)?",
        "response": "Software Assurance (SA) includes rights to new software and upgrades for perpetual licenses released over the contract period, along with support, tools, training, and other licensing benefits to help customers deploy and use software efficiently.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Iron Mountain's U.S. electricity use was green power as of October 2023?",
        "response": "94%",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in operating and adjusted operating income for U.S. dialysis in 2023?",
        "response": "The increase was mainly due to a rise in average patient service revenue per treatment, reductions in pharmaceutical unit costs, contract wages and advocacy costs.",
        "source": "finqa"
    },
    {
        "query": "What is the expected first oil date for the project located in Area B of Block 0?",
        "response": "Fourth quarter 2025",
        "source": "finqa"
    },
    {
        "query": "What were the stock-based compensation expenses for the fiscal years 2023, 2022, and 2021 respectively?",
        "response": "$596 million, $794 million, and $816 million respectively",
        "source": "finqa"
    },
    {
        "query": "What type of details does Note 15 of the Consolidated Financial Statements provide?",
        "response": "Details on legal proceedings and contingencies.",
        "source": "finqa"
    },
    {
        "query": "How was the stock-based compensation expense of $254 million accounted for in the company's financial statements?",
        "response": "The stock-based compensation expense of $254 million was recorded in the line item selling, general, and administrative expenses in the company's consolidated statement of income.",
        "source": "finqa"
    },
    {
        "query": "What is the expected impact of higher manufacturing costs on Energy & Transportation's price realization in 2023?",
        "response": "The favorable price realization is anticipated to be offset by higher manufacturing costs.",
        "source": "finqa"
    },
    {
        "query": "How does GM Financial support GM's vehicle sales?",
        "response": "GM Financial supports vehicle sales through retail loan and lease lending across the credit spectrum, and commercial lending products to dealers.",
        "source": "finqa"
    },
    {
        "query": "What major regulatory body licenses and sets policies for wireless communications in the United States?",
        "response": "The FCC",
        "source": "finqa"
    },
    {
        "query": "What are the consequences for a company violating anti-bribery laws in the U.S.?",
        "response": "Violations of anti-bribery laws in the U.S. may result in criminal and/or civil sanctions, including fines, civil monetary penalties, and possible exclusion from federal health care programs.",
        "source": "finqa"
    },
    {
        "query": "What was the primary cause for the decrease in Commercial and other receivables in 2022?",
        "response": "The primary cause for the decrease in commercial and other receivables in 2022 was due to the Gentiva Hospice disposition.",
        "source": "finqa"
    },
    {
        "query": "How can the public access the company's financial and legal reports?",
        "response": "through the Investor Relations section of their website",
        "source": "finqa"
    },
    {
        "query": "What was the amount gained from the disposal of assets in 2022?",
        "response": "In 2022, the gain from the disposal of assets amounted to $10.2 million.",
        "source": "finqa"
    },
    {
        "query": "What type of agreement do most U.S. bottlers operate under and what is it typically referred to as?",
        "response": "Most U.S. bottlers operate under a contract typically referred to as a “Comprehensive Beverage Agreement” or “CBA.”",
        "source": "finqa"
    },
    {
        "query": "When and where was Meta Platforms, Inc. incorporated?",
        "response": "Meta Platforms, Inc. was incorporated in Delaware in July 2004.",
        "source": "finqa"
    },
    {
        "query": "What are the default factors applied based on financial ratings for reinsurance recoverable balances?",
        "response": "The default factors applied for financial ratings of AAA, AA, A, BBB, BB, B, and CCC are 0.8 percent, 1.2 percent, 1.7 percent, 4.9 percent, 19.6 percent, 34.0 percent, and 62.2 percent, respectively.",
        "source": "finqa"
    },
    {
        "query": "What indicates where to find information about legal proceedings in the consolidated financial statements of an Annual Report on Form 10-K?",
        "response": "The indication to find information about legal proceedings in the consolidated financial statements of an Annual Report on Form 10-K is noted under the caption \"Legal Proceedings\" in Part II, Item 8.",
        "source": "finqa"
    },
    {
        "query": "How many individuals were served by UnitedHealthcare's Medicare Advantage in 2023?",
        "response": "7,695 thousand",
        "source": "finqa"
    },
    {
        "query": "How much cash did the parent company have at the end of 2023 compared to the end of 2022?",
        "response": "The parent company had $0.5 billion in cash, cash equivalents, and short-term investments at the end of 2023, down from $0.9 billion at the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "What does Peloton use its AI-powered Peloton Guide for?",
        "response": "Peloton uses its AI-powered Peloton Guide as a personal trainer for personalized strength training routines, tracking repetitions, time, and progress.",
        "source": "finqa"
    },
    {
        "query": "What financial instruments are included in risk diversifying assets described in the overview of benefit plan assets?",
        "response": "Risk diversifying assets include hedge funds implementing long-short, market neutral and relative value strategies that invest in publicly-traded equity, fixed income, foreign currency, and commodity securities.",
        "source": "finqa"
    },
    {
        "query": "What factors are typically considered when determining the stand-alone selling price (SSP) range if it isn't directly observable?",
        "response": "The SSP range is determined using information that may include pricing practices or other observable inputs.",
        "source": "finqa"
    },
    {
        "query": "What is the relationship between Delta Air Lines and American Express in terms of the loyalty program?",
        "response": "Delta Air Lines has a contract with American Express concerning their co-brand credit card, which involves joint marketing and allows cardholders to earn miles. This agreement also allows American Express to market its services using Delta's customer database.",
        "source": "finqa"
    },
    {
        "query": "What is the indication for OPSYNVI (mecitentan/tadalafil STCT)?",
        "response": "OPSYNVI is indicated for the treatment of pulmonary arterial hypertension.",
        "source": "finqa"
    },
    {
        "query": "What types of CPUs does AMD currently offer for server platforms?",
        "response": "AMD currently offers the AMD EPYC Series processors, including the AMD EPYC 9004 Series, AMD EPYC 8004 Series, AMD EPYC 7003 Series, and AMD EPYC 7002 Series for server platforms.",
        "source": "finqa"
    },
    {
        "query": "What does the IRA specify about the pricing of selected drugs for the Medicare population?",
        "response": "The IRA specifies a ceiling price for the selected drugs for the Medicare population but does not specify a minimum price.",
        "source": "finqa"
    },
    {
        "query": "What is the function of capital conservation buffer requirements in the FRB's Capital Framework for banks like Group Inc. in 2023?",
        "response": "The capital conservation buffer requirements function to maintain an additional layer of capital at a level of 2.5%, which is calculated under the FRB's Capital Framework for Advanced approaches banking organizations like Group Inc.",
        "source": "finqa"
    },
    {
        "query": "How did the company manage increased wage rates in 2023 compared to 2022?",
        "response": "The company experienced higher wage rates in 2023 compared to 2022, which led to an increase in employee costs.",
        "source": "finqa"
    },
    {
        "query": "Where can detailed information about the company's legal proceedings be found in its financial statements?",
        "response": "Note 4 to the consolidated financial statements",
        "source": "finqa"
    },
    {
        "query": "How did the company's Free Cash Flow and Net cash used in operating activities change from the fiscal year ended June 30, 2022 to June 30, 2023?",
        "response": "The company reduced its negative Free Cash Flow from $(2.4) billion in the fiscal year ended June 30, 2022 to $(470.0) million in the fiscal year ended June 30, 2023, and reduced its negative Net cash used in operating activities from $(2.0) billion in the fiscal year ended June 30, 2022 to $(387.6) million in the fiscal year ended June 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did the medical costs amount to in 2023?",
        "response": "$241,894 million",
        "source": "finqa"
    },
    {
        "query": "What was the geographical distribution of Etsy's 2023 Gross Merchandise Sales?",
        "response": "45% of Etsy's consolidated 2023 Gross Merchandise Sales was generated when either the seller or buyer, or both, were located outside of the United States.",
        "source": "finqa"
    },
    {
        "query": "What legal action did the company initially take in response to the IRS's designation for litigation?",
        "response": "The company initiated litigation by filing a petition in the Tax Court in December 2015, challenging the tax adjustments specified in the Notice.",
        "source": "finqa"
    },
    {
        "query": "In which section of the Annual Report can the financial statements and supplementary data be found?",
        "response": "Item 15(a)",
        "source": "finqa"
    },
    {
        "query": "What are goodwill and indefinite-lived intangible assets initially recorded at?",
        "response": "Goodwill and indefinite-lived intangible assets are initially recorded at their fair values.",
        "source": "finqa"
    },
    {
        "query": "Why did the financial marketing services revenue increase by 3% in 2023?",
        "response": "Revenue increased due to growth in both credit marketing services and risk and data services.",
        "source": "finqa"
    },
    {
        "query": "How does the AMD Instinct family of GPU accelerators cater to data center workloads?",
        "response": "The AMD Instinct family of GPU accelerators, including the MI200 and MI300 Series, is designed for compute-accelerated data center workloads such as AI training and inferencing, and a range of supercomputing applications.",
        "source": "finqa"
    },
    {
        "query": "In which section of a Form 10-K can legal proceedings information be referenced?",
        "response": "The information can be referenced in Item 3 but is detailed in Part II, Item 8, under Note 16 of the Notes to the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "How did the interest income change in fiscal year 2023 compared to the previous year?",
        "response": "The interest income increased by 821% in fiscal year 2023 compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "What are the key pillars of The Coca-Cola Company's growth vision?",
        "response": "The Coca-Cola Company's growth vision includes three key pillars: Loved Brands, Done Sustainably, and For a Better Shared Future.",
        "source": "finqa"
    },
    {
        "query": "How much of the $15.0 billion share repurchase authorization remained available as of a recent fiscal year?",
        "response": "Approximately $12.5 billion",
        "source": "finqa"
    },
    {
        "query": "How did total revenues in the Health Services segment change from 2022 to 2023, and what were the main drivers of this change?",
        "response": "Total revenues increased by $17.3 billion, or 10.2%, primarily driven by pharmacy drug mix, growth in specialty pharmacy, brand inflation, and the acquisitions of Oak Street Health and Signify Health.",
        "source": "finqa"
    },
    {
        "query": "What was the net sales growth for the Beauty segment at Procter & Gamble in 2023?",
        "response": "The net sales for the Beauty segment at Procter & Gamble increased by 2% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the fair value estimates of the Company's goodwill and noncontrolling interests?",
        "response": "The fair value estimates of the Company's goodwill and noncontrolling interests are influenced by changes in circumstances like the legal environment, market conditions, business strategies, future prospects, and interest rates.",
        "source": "finqa"
    },
    {
        "query": "What caused the increase in asset management and administration fees at The Charles Schwab Corporation in 2023?",
        "response": "The increase in asset management and administration fees at The Charles Schwab Corporation in 2023 was primarily due to higher balances in Schwab money market funds and the elimination of fee waivers on those funds, as well as stronger equity markets leading to higher average client asset balances.",
        "source": "finqa"
    },
    {
        "query": "What is Garmin’s strategy to be the provider of infotainment solutions in the automobile industry?",
        "response": "Garmin is a tier-one supplier of infotainment solutions, offering a range of integrated multi-display platforms for premium audio and multimedia, navigation, cameras, and other automotive connectivity features, intended for premium vehicle manufacturers.",
        "source": "finqa"
    },
    {
        "query": "How does Google describe its mission?",
        "response": "Google describes its mission as organizing the world’s information and making it universally accessible and useful.",
        "source": "finqa"
    },
    {
        "query": "How does FedEx intend to manage and evaluate the performance of its sectors post-consolidation in 2025?",
        "response": "Post-consolidation, FedEx plans to use a resegmented structure that aligns with an updated management reporting structure to evaluate performance and make resource allocation decisions.",
        "source": "finqa"
    },
    {
        "query": "What were the main drivers of the increase in net revenue for fiscal year 2023?",
        "response": "The increase in net revenue for fiscal year 2023 was primarily driven by year-over-year growth in the FIFA franchise, sales of extra content for Apex Legends, and the addition of Golf Clash.",
        "source": "finqa"
    },
    {
        "query": "How does The Home Depot manage the replenishment of store products?",
        "response": "The Home Depot uses sophisticated inventory management systems to centrally forecast and replenish the majority of store products, utilizing a network of distribution centers to serve both store and customer needs.",
        "source": "finqa"
    },
    {
        "query": "What is Kroger's target range for total shareholder return over time?",
        "response": "8% to 11%",
        "source": "finqa"
    },
    {
        "query": "What are The Home Depot's strategies for increasing diversity, equity, and inclusion?",
        "response": "The Home Depot's strategies for increasing diversity, equity, and inclusion include increasing diverse representation throughout the organization, creating an inclusive environment, promoting equal opportunity in recruitment and advancement, increasing engagement with diverse suppliers, and partnering with organizations on community programs.",
        "source": "finqa"
    },
    {
        "query": "What changes occurred to the stock option activity under the 2019 Equity Incentive Plan from June 30, 2022, to June 30, 2023?",
        "response": "From June 30, 2022, to June 30, 2023, under the 2019 Equity Incentive Plan, the number of outstanding stock options decreased from 61,815,926 to 42,999,273, primarily due to options being exercised, forfeited, or expired. Additionally, new options were granted during this period.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in operating costs from 2022 to 2023?",
        "response": "15%",
        "source": "finqa"
    },
    {
        "query": "What did the Company do with the repurchased shares of common stock?",
        "response": "Repurchased shares of common stock are retired in accordance with the Washington Business Corporation Act.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in domestic wireless revenue in 2023?",
        "response": "The increase in domestic wireless revenue in 2023 was primarily due to an increase in the number of customer lines.",
        "source": "finqa"
    },
    {
        "query": "What are the key risks associated with forecasting sales to large government customers?",
        "response": "Forecasting sales to large government customers involves uncertainties related to budgets, spending priorities, and regulatory changes, making it difficult to predict sales timings or the scope of contract awards.",
        "source": "finqa"
    },
    {
        "query": "What AI initiatives is the company investing in?",
        "response": "The company is investing in AI initiatives that include generative AI to recommend relevant content across products through an AI-powered discovery engine, enhance advertising tools, and improve ad delivery, targeting, and measurement capabilities.",
        "source": "finqa"
    },
    {
        "query": "What types of legal actions is the company involved in?",
        "response": "The company is involved in a range of legal actions including employment matters, claims of medical malpractice, bad faith, nonacceptance or termination of providers, anticompetitive practices, improper rate setting, provider contract rate disputes, qui tam litigation, failure to disclose network discounts, and other provider arrangements, general contractual matters, intellectual property matters, and challenges to subrogation practices.",
        "source": "finqa"
    },
    {
        "query": "What was the outcome of the FCA investigation into Equifax Limited in connection with the 2017 cybersecurity incident?",
        "response": "Equifax Limited paid a penalty of $13.5 million to resolve the matter after receiving the FCA's findings on October 13, 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did our purchases from the supplier Tractor increase from 2021 to 2023?",
        "response": "$14,155",
        "source": "finqa"
    },
    {
        "query": "What factors are considered by a company to determine if a transaction should be accounted for as a business combination or an asset acquisition?",
        "response": "To determine if a transaction should be accounted for as a business combination or an asset acquisition, a company considers whether the transaction includes an input and a substantive process that together significantly contribute to the ability to create outputs. Additionally, if substantially all of the fair value of gross assets included in a transaction is concentrated in a single asset or a group of similar assets, it will not be considered a business.",
        "source": "finqa"
    },
    {
        "query": "How did the Insurance segment's benefit expense ratio change from 2022 to 2023?",
        "response": "Decreased by 20 basis points, from 10.4% in 2022 to 10.2% in 2023",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of internal control over financial reporting according to the document?",
        "response": "The purpose of internal control over financial reporting is to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with generally accepted accounting principles. It includes maintaining records that accurately reflect transactions, ensuring transactions are recorded as necessary, and preventing or detecting unauthorized acquisition or use of the company’s assets.",
        "source": "finqa"
    },
    {
        "query": "What wearable products and related operating system does the Company offer?",
        "response": "The Company offers Apple Watch Ultra 2, Apple Watch Series 9, and Apple Watch SE based on its watchOS operating system.",
        "source": "finqa"
    },
    {
        "query": "What was the tax liability for uncertain tax positions as of August 26, 2023?",
        "response": "The tax liability for uncertain tax positions, including interest and penalties, was $51.0 million as of August 26, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was Richard C. Smith's role in AutoZone before being named Senior Vice President – Human Resources?",
        "response": "Divisional Vice President – Store Operations since 1997",
        "source": "finqa"
    },
    {
        "query": "By how much would a 25 basis point increase in the expected rate of return on assets (ROA) affect the 2024 Pension Expense for U.S. plans?",
        "response": "A 25 basis point increase in the expected rate of return on assets would reduce the 2024 Pension Expense for U.S. plans by $25.",
        "source": "finqa"
    },
    {
        "query": "What does the term 'following Part IV hereof' imply about the location of the consolidated financial statements in the document?",
        "response": "The phrase 'following Part IV hereof' implies that the consolidated financial statements are positioned immediately after Part IV in the document.",
        "source": "finqa"
    },
    {
        "query": "How are foreign currency exchange differences recorded in the financial statements of the company?",
        "response": "Foreign currency exchange differences are recorded as other comprehensive income (loss), net of tax in accumulated other comprehensive income (loss) within stockholders' equity.",
        "source": "finqa"
    },
    {
        "query": "What methods does Chevron use in its selection processes to promote inclusivity?",
        "response": "Chevron uses specially trained company leaders as inclusion counselors to challenge group think and unconscious biases during hiring processes.",
        "source": "finqa"
    },
    {
        "query": "What is the future expiration year for the state net operating loss carryforwards mentioned in the fiscal reporting?",
        "response": "2028",
        "source": "finqa"
    },
    {
        "query": "Is there a difference in referencing the detailed content of financial statements directly in the document versus incorporating them by reference?",
        "response": "Yes, there is a difference. Direct inclusion means the full financial statements are contained within the document itself, whereas incorporating by reference means they are legally a part of the document but physically elsewhere, merely referenced within.",
        "source": "finqa"
    },
    {
        "query": "What are Etsy's main operating marketplaces as of 2023?",
        "response": "As of 2023, Etsy's main operating marketplaces are Etsy.com, Reverb, and Depop.",
        "source": "finqa"
    },
    {
        "query": "How many contract manufacturers did Nike have for apparel production in fiscal 2023, and what was the percentage of production from the largest factory?",
        "response": "In fiscal 2023, Nike had 55 contract manufacturers for apparel production, and the largest single finished goods apparel factory accounted for approximately 8% of total Nike Brand apparel production.",
        "source": "finqa"
    },
    {
        "query": "What are some specific societal harms the company is alleged to have contributed to?",
        "response": "The company is alleged to have contributed to societal harms including impacts on mental and physical health, child and adult sexual exploitation, illegal drug activities, fraud, and unlawful discrimination.",
        "source": "finqa"
    },
    {
        "query": "What is the estimated redemption rate for Chipotle gift cards?",
        "response": "While the majority of Chipotle gift cards are redeemed within one year, a portion of them are not expected to be redeemed and are recognized as breakage over time.",
        "source": "finqa"
    },
    {
        "query": "What was the total earnings from operations at Optum Rx in 2023 due to increased script volumes?",
        "response": "Increased",
        "source": "finqa"
    },
    {
        "query": "How many total connected devices were there for AT&T Inc. at the end of 2023?",
        "response": "127,724 (in thousands)",
        "source": "finqa"
    },
    {
        "query": "What was the company's worldwide effective income tax rate in 2023?",
        "response": "The worldwide effective income tax rate from continuing operations was 11.5% in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much cash and cash equivalents did Palantir Technologies Inc. have as of December 31, 2023?",
        "response": "As of December 31, 2023, Palantir Technologies Inc. had cash and cash equivalents amounting to $831,047,000.",
        "source": "finqa"
    },
    {
        "query": "What was the dollar change in general and administrative expenses from March 31, 2022, to March 31, 2023?",
        "response": "$54 million",
        "source": "finqa"
    },
    {
        "query": "What was the gross margin for products in 2023?",
        "response": "$108,803 million",
        "source": "finqa"
    },
    {
        "query": "How are most of the physicians within PPO networks reimbursed?",
        "response": "Most of the physicians within PPO networks are reimbursed based on a fixed fee schedule, which typically involves payment as a percentage of the standard Medicare allowable fee schedule.",
        "source": "finqa"
    },
    {
        "query": "Where is the index to the Financial Statements and Supplementary Data located?",
        "response": "It is presented in Item 8.",
        "source": "finqa"
    },
    {
        "query": "What is the fair value of HP's short- and long-term debt as of October 31, 2023?",
        "response": "$8.5 billion",
        "source": "finqa"
    },
    {
        "query": "What challenges does a company face in maintaining its market share and pricing?",
        "response": "The introduction of new branded or generic products in major markets affects a company’s ability to maintain market share and pricing.",
        "source": "finqa"
    },
    {
        "query": "How much did the returns reserve related to the impacts of the recalls amount to as of June 30, 2023?",
        "response": "$24.4 million",
        "source": "finqa"
    },
    {
        "query": "What are the financial and operational impacts of the two-pillar solution and Directive 2022/2523 on the company's tax obligations?",
        "response": "The adoption of the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting and the EU's Directive 2022/2523 are expected to increase future years’ tax expense, although no material impact is anticipated for the 2024 consolidated results of operations. Changes to legislative guidance and further enactments could impact assessments beyond 2024.",
        "source": "finqa"
    },
    {
        "query": "What threshold of assets makes JPMorgan Chase Bank, N.A. subject to the FDIC's IDI Resolution Rule for resolution plan preparation?",
        "response": "$100 billion or more in total assets",
        "source": "finqa"
    },
    {
        "query": "What was the percentage of total retail pharmacy prescriptions dispensed by the Pharmacy & Consumer Wellness segment in the U.S. during 2023?",
        "response": "26.7%",
        "source": "finqa"
    },
    {
        "query": "What was the effect of foreign exchange on cash, cash equivalents, and restricted cash for the year ended December 31, 2023?",
        "response": "The effect of foreign exchange on cash, cash equivalents, and restricted cash was a positive $2,930 for the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What title does Item 8 of Part II carry in the financial documents as it relates to legal proceedings?",
        "response": "Item 8 of Part II is titled 'Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings' and it deals with legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How are equity investments without readily determinable fair values adjusted for changes in their market value?",
        "response": "Equity investments without readily determinable fair values are adjusted based on changes in their values from observable price changes in orderly transactions for identical or similar investments of the same issuer. Any downward adjustments due to impairment are determined based on the financial condition and prospects of the issuer, market conditions, and industry-specific factors.",
        "source": "finqa"
    },
    {
        "query": "Which item in the Annual Report on Form 10-K discusses product safety issues and their impact on the company?",
        "response": "Item 1A. Risk Factors",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the Federal Reserve’s policy changes on Schwab money market funds in 2022?",
        "response": "The Federal Reserve’s increases to the federal funds target overnight rate led to the elimination of money market fund fee waivers during the second quarter of 2022 at The Charles Schwab Corporation.",
        "source": "finqa"
    },
    {
        "query": "What were the primary reasons for the growth in net sales for the Walmart U.S. segment during fiscal 2023?",
        "response": "The primary reasons for the 6.9% growth in net sales for the Walmart U.S. segment in fiscal 2023 were increases in comparable sales, driven by growth in average ticket, strong food sales, higher inflation impacts on certain merchandise categories, and growth in transactions.",
        "source": "finqa"
    },
    {
        "query": "How is the information on legal proceedings conveyed in the Annual Report on Form 10-K?",
        "response": "The information on legal proceedings is conveyed by incorporating it by reference from another section within the report.",
        "source": "finqa"
    },
    {
        "query": "What was the total effective interest rate for the Company's 0% convertible senior notes as of December 31, 2023?",
        "response": "The total effective interest rate for the Company's 0% convertible senior notes as of December 31, 2023 was 0.2%.",
        "source": "finqa"
    },
    {
        "query": "What is the difference in revenue for this company in 2023 compared to 2022?",
        "response": "In 2023, the company's revenue increased by 18% compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "How much did Family Dollar's consumable merchandise category generate in net sales for the year ending January 28, 2023?",
        "response": "$10,036.2 million",
        "source": "finqa"
    },
    {
        "query": "What does the U.S. Foreign Corrupt Practices Act of 1977 prohibit?",
        "response": "The U.S. Foreign Corrupt Practices Act of 1977 prohibits certain individuals and entities, including U.S. publicly traded companies, from promising, offering, or giving anything of value to foreign officials with the intent of influencing them corruptly to help the company obtain or retain business or gain any improper advantage.",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in Embedded segment net revenue in 2023?",
        "response": "The increase in Embedded segment net revenue in 2023 was primarily driven by the inclusion of embedded product revenue from Xilinx, Inc. for the full twelve months period.",
        "source": "finqa"
    },
    {
        "query": "What new product did the Richmond refinery commence making in July 2023?",
        "response": "API Group III base oils",
        "source": "finqa"
    },
    {
        "query": "What was the primary driver for the increase in general and administrative expenses in 2023?",
        "response": "recent acquisitions",
        "source": "finqa"
    },
    {
        "query": "How many FedEx-branded packaging produced in 2022 was third-party certified?",
        "response": "64%",
        "source": "finqa"
    },
    {
        "query": "What is the goal of Nike's Engagement Survey program?",
        "response": "The goal of Nike's Engagement Survey program is to gather confidential feedback from employees globally on key factors like managerial satisfaction and workplace environment, helping to assess and enhance employee engagement and company culture.",
        "source": "finqa"
    },
    {
        "query": "How are changes in operating expenses primarily driven at Ford Credit?",
        "response": "Changes in operating expenses at Ford Credit are primarily driven by salaried personnel costs, facilities costs, and costs associated with the origination and servicing of customer contracts.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of adding research and development expenses and general and administrative expenses to the loss from operations when calculating the contribution margin?",
        "response": "Research and development expenses and general and administrative expenses are added to the loss from operations when calculating the contribution margin to provide a more comprehensive measure of the total contributions to a company's profitability.",
        "source": "finqa"
    },
    {
        "query": "What are the characteristics of Garmin’s Force Trolling Motors?",
        "response": "The Force Trolling Motor series from Garmin features powerful, efficient motors with built-in CHIRP, Ultra High-Definition ClearVü, and SideVü sonar. They include models like the Force Kraken, have up to a 90” shaft, smaller mounting footprint and connect wirelessly to Garmin chartplotters/MFDs for navigation, autopilot, and anchor lock features.",
        "source": "finqa"
    },
    {
        "query": "What are the primary components of programming expenses for a company providing video services?",
        "response": "Programming expenses primarily include fees related to the distribution of television network programming and fees charged for retransmission of signals from local broadcast television stations, as well as costs of content on entertainment television networks, including amortization of licensed content.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount available to be drawn under the Singapore Delayed Draw Term Facility as of December 31, 2023?",
        "response": "$2.79 billion",
        "source": "finqa"
    },
    {
        "query": "What is the title of Item 8 in a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What are the primary factors discussed in the Management’s Discussion and Analysis that affect the financial statements year-to-year changes?",
        "response": "The primary factors discussed include changes in key items of the financial statements from year to year and how certain accounting principles, policies, and estimates impact the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "How did changes in dealer inventories impact Construction Industries' sales in 2023?",
        "response": "Dealer inventory increased more during 2023 than during 2022. Sales increased due to favorable price realization and higher sales volume which were impacted by changes in dealer inventories.",
        "source": "finqa"
    },
    {
        "query": "What criteria does the Company use to manage its investment portfolio?",
        "response": "The Company manages its investment portfolio to limit exposure to any one issuer or market sector, and largely limits its investments to investment grade quality.",
        "source": "finqa"
    },
    {
        "query": "In which document are the consolidated financial statements and accompanying notes included, as referred to in Item 8?",
        "response": "The Annual Report on Form 10-K",
        "source": "finqa"
    },
    {
        "query": "What position did Colette M. Kress hold before joining NVIDIA in 2013?",
        "response": "Senior Vice President and Chief Financial Officer of the Business Technology and Operations Finance organization at Cisco Systems, Inc.",
        "source": "finqa"
    },
    {
        "query": "How does the funded status of Delta Air Lines' pension plans compare between the end of 2023 and 2022?",
        "response": "The funded status was $(145) million at the end of 2023 and $(90) million at the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "How do government regulations impact the issuance and acquisition of Visa cards in certain jurisdictions?",
        "response": "Government regulations prevent financial institutions or other entities that are domiciled in countries or territories subject to comprehensive OFAC trade sanctions, or those included on OFAC’s list of Specially Designated Nationals and Blocked Persons, from issuing or acquiring Visa cards or engaging in transactions using Visa products and services.",
        "source": "finqa"
    },
    {
        "query": "Does the investigation into Tesla's waste segregation practices relate to environmental regulations?",
        "response": "Yes, the investigation into Tesla's waste segregation practices relates to environmental regulations.",
        "source": "finqa"
    },
    {
        "query": "What is the PCAOB ID number for the Independent Registered Public Accounting Firm that audited Meta Platforms, Inc.'s financial statements?",
        "response": "The PCAOB ID number is 42.",
        "source": "finqa"
    },
    {
        "query": "What key finding did the consultant report from the Talent Management Equity Audit at Chipotle?",
        "response": "The consultant concluded that Chipotle has a robust set of processes, practices, and policies for equitable talent recruiting, development, and retention, and identified opportunities to strengthen existing practices.",
        "source": "finqa"
    },
    {
        "query": "What was the total goodwill impairment recorded by Comcast in their Sky reporting unit in 2022?",
        "response": "$8.1 billion",
        "source": "finqa"
    },
    {
        "query": "What type of financial growth did the company report for the fiscal year ended December 31, 2023?",
        "response": "For the fiscal year ended December 31, 2023, the company reported a revenue of $2.2 billion, which is a 17% growth from the previous year.",
        "source": "finqa"
    },
    {
        "query": "Which companies operate under the Trip.com Group?",
        "response": "Trip.com Group operates under the brands Ctrip.com, Trip.com, Qunar, Tongcheng-eLong, and SkyScanner.",
        "source": "finqa"
    },
    {
        "query": "What process does a company follow if it determines that the fair value of a reporting unit is less than its carrying amount?",
        "response": "If a company determines that the fair value of a reporting unit is less than its carrying amount, it is required to perform a quantitative assessment for impairment. If the reporting unit's carrying amount exceeds its fair value, an impairment loss is recognized in an amount equal to the excess, but not more than the total goodwill allocated to that reporting unit.",
        "source": "finqa"
    },
    {
        "query": "How does a downgrade in the company's Public Debt Rating affect its interest costs?",
        "response": "A downgrade in the company's Public Debt Rating could increase the interest cost and applicable margin on borrowings under the company's credit facility.",
        "source": "finqa"
    },
    {
        "query": "What critical accounting estimates are considered by the management, and why are they considered critical?",
        "response": "Critical accounting estimates include stock-based compensation, income taxes, business combinations, valuation of goodwill, and leases, due to the subjectivity associated with them and their potential significant impact on the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "What was the gross margin reported by Broadcom Inc. for the fiscal year ended October 29, 2023?",
        "response": "$24,690 million",
        "source": "finqa"
    },
    {
        "query": "What was the goodwill impairment charge for the HPC & AI reporting unit in fiscal 2022?",
        "response": "$815 million",
        "source": "finqa"
    },
    {
        "query": "What was the cash, cash equivalents, and restricted cash at the beginning of the period as noted for GameStop Corp.?",
        "response": "$1,319.9 million",
        "source": "finqa"
    },
    {
        "query": "What were BofAS and MLPF&S's regulatory net capital amounts and minimum requirements as of December 31, 2023?",
        "response": "As of December 31, 2023, BofAS had a regulatory net capital of $19.4 billion, which exceeded its minimum requirement of $4.6 billion. MLPF&S had a regulatory net capital of $5.8 billion, exceeding the minimum requirement of $134 million.",
        "source": "finqa"
    },
    {
        "query": "What section of the Annual Report on Form 10-K discusses the company's material pending legal proceedings?",
        "response": "The Legal Matters section in Note 10 of the Notes to Consolidated Financial Statements, included in Part II, Item 8 of the Annual Report on Form 10-K, discusses the company's material pending legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How much did the United States generate in earnings before income taxes in fiscal year 2023?",
        "response": "The United States generated $12,107 million in earnings before income taxes in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "Describe the role of stored value cards and the loyalty program in Starbucks' strategy.",
        "response": "Stored value cards provide a convenient payment method and increase visit frequency, while the loyalty program offers benefits based on the acquisition of reward points.",
        "source": "finqa"
    },
    {
        "query": "What are the primary factors influencing Garmin's gross profit margins?",
        "response": "Product mix, segment mix, and factors like foreign currency fluctuations.",
        "source": "finqa"
    },
    {
        "query": "How much did cash and cash equivalents increase by the end of 2023 compared to the end of 2022?",
        "response": "$7.8 billion",
        "source": "finqa"
    },
    {
        "query": "In Item 8, which schedule is referenced and where is it located in the Form 10-K?",
        "response": "The Financial Statement Schedule located on page S-1.",
        "source": "finqa"
    },
    {
        "query": "What was the reason for a $2.7 billion impairment charge in 2022?",
        "response": "The $2.7 billion impairment charge in 2022 was due to an expected delay in the launch of an HR+/HER2- IPR&D intangible asset, which led to a decrease in market share assumptions amid a competitive environment.",
        "source": "finqa"
    },
    {
        "query": "What are the main business segments of Bank of America as mentioned in their management's discussion and analysis?",
        "response": "The main business segments of Bank of America include Consumer Banking, Global Wealth & Investment Management, Global Banking, Global Markets, and All Other.",
        "source": "finqa"
    },
    {
        "query": "How many hours of training and development did Bank of America provide to its employees in 2023?",
        "response": "6.7 million hours",
        "source": "finqa"
    },
    {
        "query": "What is the total restructuring charge incurred by Procter & Gamble for the fiscal year ended June 30, 2023?",
        "response": "Procter & Gamble incurred a total restructuring charge of $329 million for the fiscal year ended June 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "How does Intuit support entrepreneurs according to the document?",
        "response": "Intuit assists entrepreneurs by helping them find and retain customers, manage payments, and ensure accurate financial management.",
        "source": "finqa"
    },
    {
        "query": "What are the key aims of solar PV installers when installing string inverters?",
        "response": "Solar PV installers aim for simple installation design, fast installation times, maximum system performance, and predictability.",
        "source": "finqa"
    },
    {
        "query": "What is the cumulative dividend payable annually on the redeemable preferred stock of the Company?",
        "response": "The cumulative dividend payable annually on the redeemable preferred stock is $0.10 per share.",
        "source": "finqa"
    },
    {
        "query": "What are the trademarks under which Garan sells its apparel products?",
        "response": "Garan sells its apparel products under its own trademarks Garanimals®, 365 Kids from Garanimals®, and easy-peasy®, as well as customer-private label brands.",
        "source": "finqa"
    },
    {
        "query": "How has the company prepared for the increasing complexity and number of data protection laws?",
        "response": "The company has developed strategies to address regulatory trends and developments, including required changes to its privacy and data protection compliance programs and policies.",
        "source": "finqa"
    },
    {
        "query": "What impact could the exercise of the 2025 Warrants have on the Company's earnings per share if the market value of its common stock exceeds the strike price?",
        "response": "If the market value per share of the Company’s common stock exceeds the strike price of the 2025 Warrants, it will have a dilutive effect on the Company’s earnings per share, unless the Company elects, under certain conditions, to settle the 2025 Warrants in cash.",
        "source": "finqa"
    },
    {
        "query": "How much did net cash provided by operating activities change from 2022 to 2023?",
        "response": "It increased by $1,349 million",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 of a financial document entail?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What was the outstanding number of common stock shares for Equifax as of December 31, 2023?",
        "response": "123.3 million",
        "source": "finqa"
    },
    {
        "query": "What was the ending store count for the Family Dollar segment after the fiscal year ended January 28, 2023?",
        "response": "The ending store count for the Family Dollar segment after the fiscal year ended January 28, 2023 was 8,206.",
        "source": "finqa"
    },
    {
        "query": "What is the estimated total underfunding for the multi-employer pension plans in which the company participates as of the end of 2022?",
        "response": "Approximately $1.0 billion",
        "source": "finqa"
    },
    {
        "query": "How does American Express differentiate its brand?",
        "response": "American Express differentiates its brand through trust, security and service, focusing heavily on managing, promoting and protecting its brand, consistent with its brand promise. Its brand is ranked among the world's most valuable brands.",
        "source": "finqa"
    },
    {
        "query": "How did the company's net sales performance in fiscal 2023 compare to fiscal 2022?",
        "response": "The company's net sales increased by 2% in fiscal 2023 compared to fiscal 2022.",
        "source": "finqa"
    },
    {
        "query": "What types of stores does Helzberg Diamonds operate, and in what types of locations are they found?",
        "response": "Helzberg Diamonds operates a chain of retail jewelry stores located in malls, lifestyle centers, power strip centers, and outlet malls.",
        "source": "finqa"
    },
    {
        "query": "How long did Mr. Cook serve as Chairman of the Board at Intuit?",
        "response": "February 1993 to July 1998",
        "source": "finqa"
    },
    {
        "query": "What were the company's total outstanding standby letters of credit as of January 28, 2023?",
        "response": "$310 million",
        "source": "finqa"
    },
    {
        "query": "What were some of the programs affected by the entertainment industry strikes in 2023?",
        "response": "The strikes affected several programs including the fifth and sixth seasons of 'Rookie,' the second season of 'Rookie Feds,' the second season of 'The Recruit,' the third season of 'Yellowjackets,' and the third season of 'Cruel Summer'.",
        "source": "finqa"
    },
    {
        "query": "What are the intellectual property protections offered under the TRIPs Agreement?",
        "response": "The TRIPs Agreement administered by the World Trade Organization provides global protection for certain intellectual property rights.",
        "source": "finqa"
    },
    {
        "query": "What was the total net income attributable to Humana Inc. for the year ended December 31, 2023?",
        "response": "$2,489 million",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the adjusted operating income decrease in 2023 compared to 2022?",
        "response": "12.0%",
        "source": "finqa"
    },
    {
        "query": "What were the proceeds from the sale of investment in Saudi Cinema Company, LLC during 2023?",
        "response": "$30.0 million",
        "source": "finqa"
    },
    {
        "query": "What is the relationship between the ESG goals and the long-term growth strategy?",
        "response": "The ESG goals are believed to align with the long-term growth strategy and financial and operational priorities.",
        "source": "finqa"
    },
    {
        "query": "Are the consolidated financial statements presented directly within the body of the Annual Report on form 10-K?",
        "response": "No, the consolidated financial statements are not presented directly within the body of the Annual Report on Form 10-K; they are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "What are the net deferred tax liabilities for the company at the end of 2023?",
        "response": "The net deferred tax liabilities for the company at the end of 2023 is $304.",
        "source": "finqa"
    },
    {
        "query": "What is the role of Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) in the financial reporting of a company?",
        "response": "The role of MD&A is to promote understanding of the company's results of operations and financial condition by providing supplemental information that should be read in conjunction with the consolidated financial statements",
        "source": "finqa"
    },
    {
        "query": "What does the company routinely face in the ordinary course of its business?",
        "response": "The company routinely faces litigation in the ordinary course of its business.",
        "source": "finqa"
    },
    {
        "query": "How did Delta Air Lines adjust its fuel expenses for 2023?",
        "response": "Adjusted for MTM adjustments and settlements on hedges, resulting in a total adjusted fuel expense of $11,121 million.",
        "source": "finqa"
    },
    {
        "query": "What does the company's supplier diversity program involve?",
        "response": "development and resources for diverse suppliers",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in the Economic Value of Equity (EVE) calculation as mentioned?",
        "response": "The Economic Value of Equity (EVE) calculation considers factors such as interest rate scenarios with rate floors, prepayment speeds of mortgage-related investments, term structure models of interest rates, behavior of non-maturity client cash on the balance sheet, and pricing assumptions.",
        "source": "finqa"
    },
    {
        "query": "What international refineries does Chevron have interests in and what are their respective countries?",
        "response": "Three large refineries located in Singapore, South Korea, and Thailand.",
        "source": "finqa"
    },
    {
        "query": "Where can information about legal proceedings be found in the financial statements?",
        "response": "Information about legal proceedings can be found in Note 15 of the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "Under what circumstances are unrecognized tax benefits adjusted?",
        "response": "Unrecognized tax benefits and related interests are adjusted in response to changing facts and circumstances, such as receiving audit assessments.",
        "source": "finqa"
    },
    {
        "query": "What do the Health Plan Price Transparency Rules require starting January 1, 2023?",
        "response": "Starting January 1, 2023, most group health plans and health insurance issuers must provide enrollees with out-of-pocket cost and underlying provider negotiated rate information for a list of 500 designated services.",
        "source": "finqa"
    },
    {
        "query": "What critical audit matter was highlighted in the recent audit report regarding inventory valuation?",
        "response": "The critical audit matter highlighted was the estimation of excess and obsolescence reserves for inventory which involved significant judgment due to factors such as market conditions and forecasted demand.",
        "source": "finqa"
    },
    {
        "query": "What was the main reason for the entertainment segment operating losses in 2023 at the Company?",
        "response": "The main reason for the operating losses in the Company's entertainment segment in 2023 was primarily due to substantial non-cash goodwill impairment charges, losses from business disposals, and other asset impairments.",
        "source": "finqa"
    },
    {
        "query": "How many participants has the MARC program had since its inception?",
        "response": "Since its inception, the MARC program has had over 5,000 participants.",
        "source": "finqa"
    },
    {
        "query": "How much did Starbucks' cash and investments increase from the end of fiscal 2022 to the end of fiscal 2023?",
        "response": "Starbucks' cash and investments increased by $700 million, from $3.5 billion as of October 2, 2022, to $4.2 billion as of October 1, 2023.",
        "source": "finqa"
    },
    {
        "query": "What does the reference to page S-1 in IBM’s Form 10-K pertain to?",
        "response": "The Financial Statement Schedule",
        "source": "finqa"
    },
    {
        "query": "What were the total unconditional purchase obligations of the company as of October 31, 2023?",
        "response": "$1.6 billion",
        "source": "finqa"
    },
    {
        "query": "How much did the unbilled accounts receivable amount to as of December 30, 2023?",
        "response": "$1.1 billion",
        "source": "finqa"
    },
    {
        "query": "What percentage of Meta's U.S. workforce in 2023 were represented by people with disabilities, veterans, and members of the LGBTQ+ community?",
        "response": "In 2023, people with disabilities represented 7.2% of Meta's U.S. workforce, veterans accounted for 2.3%, and members of the LGBTQ+ community made up 9.8%.",
        "source": "finqa"
    },
    {
        "query": "How long did Joanne D. Smith serve as the Vice President - Marketing at Delta?",
        "response": "From November 2005 to February 2007",
        "source": "finqa"
    },
    {
        "query": "When is the guidance from ASU No. 2023-09 effective, and what adoption choices are offered?",
        "response": "The guidance from ASU No. 2023-09 is effective for fiscal years beginning after December 15, 2021, with options for early adoption and application methods of either prospective or retrospective.",
        "source": "finqa"
    },
    {
        "query": "How much did the other income category contribute to GM's net sales and revenue at the end of the year 2021?",
        "response": "$285 million",
        "source": "finqa"
    },
    {
        "query": "What factor might continue to adversely impact the demand for Comcast's products and services?",
        "response": "Global economic conditions and consumer sentiment may continue to adversely impact the demand for Comcast's products and services.",
        "source": "finqa"
    },
    {
        "query": "What was the growth rate of Visa Inc.'s commercial payments volume internationally between 2021 and 2022?",
        "response": "23%",
        "source": "finqa"
    },
    {
        "query": "What aviation sustainability project did Delta Air Lines join in 2023 involving Boeing and NASA?",
        "response": "In 2023, Delta Air Lines joined a coalition alongside Boeing and NASA to support the Sustainable Flight Demonstrator program.",
        "source": "finqa"
    },
    {
        "query": "What type of data does Item 8 cover in the company's filing?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What are the three levels of inputs defined in the fair value hierarchy?",
        "response": "The three levels of inputs defined in the fair value hierarchy are: Level 1 uses unadjusted quoted prices available in active markets for identical assets or liabilities, Level 2 uses inputs other than quoted prices included in Level 1 that are directly or indirectly observable, and Level 3 uses unobservable inputs that are significant to the fair value determination and are supported by little or no market activity.",
        "source": "finqa"
    }
]