[
    {
        "query": "What type of situations will the company record a liability for legal proceedings?",
        "response": "The company will record a liability when it is probable that a loss has been incurred and the amount is reasonably estimable.",
        "source": "finqa"
    },
    {
        "query": "What impact did the adoption of ASU 2021-08 have on Enphase Energy's consolidated financial statements in 2023?",
        "response": "The adoption of ASU 2021-08 did not have an impact on Enphase Energy's consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "Since when has Ms. Tessel been the Executive Vice President and Chief Technology Officer at Intuit?",
        "response": "January 2019",
        "source": "finqa"
    },
    {
        "query": "Are re-bannered stores immediately included in the calculation of comparable store net sales changes?",
        "response": "No, re-bannered stores are not included in the calculation of comparable store net sales changes until after the first fifteen months of operation under the new brand.",
        "source": "finqa"
    },
    {
        "query": "What are the components of operating and finance lease obligations as defined in ASU 2016-02, Leases (Topic 842)?",
        "response": "Operating and finance lease obligations include related interest in accordance with ASU 2016-02, Leases (Topic 842).",
        "source": "finqa"
    },
    {
        "query": "How much did Garmin Ltd.'s comprehensive income amount to for the fiscal year ended December 30, 2023?",
        "response": "$1,338,555",
        "source": "finqa"
    },
    {
        "query": "What was the gross gaming revenue increase in Macao for the year ended December 31, 2023, compared to 2019?",
        "response": "The gross gaming revenue in Macao decreased approximately 37.4% for the year ended December 31, 2023 compared to 2019.",
        "source": "finqa"
    },
    {
        "query": "How much cash was used for financing activities in 2023, and how does this compare to 2021 and 2022?",
        "response": "In 2023, cash used for financing activities was $4.5 billion, compared to $5.1 billion in 2022 and $4.4 billion in 2021.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the 'Glossary of Terms and Acronyms' included in the financial section?",
        "response": "The 'Glossary of Terms and Acronyms' is included to provide definitions and explanations for specific terms used in the financial documents.",
        "source": "finqa"
    },
    {
        "query": "What is the primary source of cash used by the company to fund operating needs and capital expenditures?",
        "response": "The primary source of cash used to fund operating needs and capital expenditures is operating cash flow.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Economic Value of Equity (EVE) measurement in assessing financial risk?",
        "response": "The Economic Value of Equity (EVE) measurement is used to assess the longer-term interest rate risk exposure on non-trading assets and liabilities by determining the net impact of interest rate changes on the present value of their cash flows.",
        "source": "finqa"
    },
    {
        "query": "What distinguishes IBM from other tech providers?",
        "response": "IBM's differentiation comes from its combination of deep expertise in technology, incumbent relationships with enterprises, a broad go-to-market strategy that includes a partner ecosystem, and a strong emphasis on innovation.",
        "source": "finqa"
    },
    {
        "query": "What was the total depreciation and amortization expense for the fiscal year ended June 30, 2023?",
        "response": "The total depreciation and amortization expense for the fiscal year ended June 30, 2023 was $124.3 million.",
        "source": "finqa"
    },
    {
        "query": "What advancements in technology and products is the company focusing on, according to the management's discussion in the 2023 Annual Report?",
        "response": "The company is focusing on advancements in products and services based on artificial intelligence, robotics, and automation. It is also working on improving and further deploying its FSD capabilities and developing its battery technologies.",
        "source": "finqa"
    },
    {
        "query": "How much did the provision for income taxes change by from 2022 to 2023?",
        "response": "The provision for income taxes changed by $6.13 billion from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did the provision for credit losses decrease for Las Vegas Sands Corp. from 2022 to 2023?",
        "response": "The provision for credit losses decreased by $11 million for Las Vegas Sands Corp. from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the home products mentioned in the text?",
        "response": "The home products mentioned are Apple TV, HomePod, and HomePod mini.",
        "source": "finqa"
    },
    {
        "query": "How are foreign currency assets and liabilities managed in a U.S. dollar functional currency environment?",
        "response": "Foreign currency assets and liabilities for monetary accounts are remeasured into U.S. dollars at current exchange rates. Non-monetary items such as inventory and property, plant, and equipment are measured and recorded at historical exchange rates.",
        "source": "finqa"
    },
    {
        "query": "What led to the recognition of $38 million in impairment losses during 2023?",
        "response": "$38 million of impairment losses were recognized in 2023 on assets associated with certain leased hotels.",
        "source": "finqa"
    },
    {
        "query": "How do the number of low-income senior members and changes in membership mix impact the quarterly PDP benefit ratio pattern?",
        "response": "The number of low-income senior members and year-over-year changes in the mix of membership in standalone PDP products affect the quarterly PDP benefit ratio pattern. Changing demographics and membership composition influence how costs are shared throughout the year.",
        "source": "finqa"
    },
    {
        "query": "How many hotels are franchised by Hilton as of December 31, 2023?",
        "response": "6,679 hotels",
        "source": "finqa"
    },
    {
        "query": "What mechanism is used in the GDPR to review draft decisions of investigations by the IDPC?",
        "response": "The GDPR uses a consistency mechanism to review draft decisions in investigations by the IDPC.",
        "source": "finqa"
    },
    {
        "query": "What accounting method is used to value merchandise inventories?",
        "response": "Merchandise inventories are valued at the lower of cost or market generally using the average cost method.",
        "source": "finqa"
    },
    {
        "query": "What factors influenced the cash conversion cycle during fiscal year 2023?",
        "response": "The cash conversion cycle in fiscal year 2023 was influenced by changes in business mix, payment terms, timing and extent of receivables factoring, seasonal trends, and the timing of revenue recognition and inventory purchases.",
        "source": "finqa"
    },
    {
        "query": "What was the gross amount of unrecognized tax benefits as of December 31, 2023, and what would be the net benefit to the company if it prevailed on all uncertain tax positions?",
        "response": "As of December 31, 2023, the gross amount of unrecognized tax benefits was $929 million. If the company were to prevail on all uncertain tax positions, the net benefit would be $632 million, excluding any benefits related to interest and penalties.",
        "source": "finqa"
    },
    {
        "query": "What amount was payable within 12 months from the aggregate lease obligations as of January 29, 2023?",
        "response": "$1.5 billion",
        "source": "finqa"
    },
    {
        "query": "What is the maturity date of the Virginia 4/5 Credit Agreement?",
        "response": "October 31, 2025",
        "source": "finqa"
    },
    {
        "query": "What are the risks related to Goldman Sachs' future effective income tax rate as mentioned in their 2023 Form 10-K?",
        "response": "The future effective income tax rate for Goldman Sachs may differ from expectations due to changes in applicable tax rates, changes in earnings mix, profitability, the entities generating profits, forecasting assumptions, interpretations or applications of tax statutes and regulations, and potential new corporate tax legislation or IRS guidance.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the divestiture of the Longwall business on operating profit in the first quarter of 2023?",
        "response": "The divestiture of the company’s Longwall business resulted in an unfavorable impact to operating profit of $586 million, primarily a non-cash item driven by the release of accumulated foreign currency translation.",
        "source": "finqa"
    },
    {
        "query": "What additional exclusivity period may biologics receive for conducting pediatric studies under the Biologics Price Competition and Innovation Act?",
        "response": "180 days",
        "source": "finqa"
    },
    {
        "query": "Why are deferred tax assets and liabilities netted by taxing jurisdiction in financial reporting?",
        "response": "Deferred tax assets and liabilities are netted by taxing jurisdiction to reflect a more accurate picture of the company's actual tax liability considering the specific tax regulations of each jurisdiction.",
        "source": "finqa"
    },
    {
        "query": "What are the critical accounting estimates identified by management in the financial statements?",
        "response": "Self-insurance reserves, income taxes, and valuation allowances are identified as critical accounting estimates.",
        "source": "finqa"
    },
    {
        "query": "How is goodwill impairment evaluated for the Company's reporting units as of January 31, 2023?",
        "response": "As of January 31, 2023, goodwill impairment for the Company's reporting units is evaluated using either a qualitative or quantitative approach. Initially, a qualitative assessment is conducted to decide if a quantitative test is necessary. If it is determined that the fair value of the reporting unit is likely lower than its carrying amount, or a higher fair value cannot be assured, a quantitative impairment test, which involves determining the fair value of the reporting units, is performed.",
        "source": "finqa"
    },
    {
        "query": "How does FedEx Freight accommodate rapid delivery needs?",
        "response": "FedEx Freight offers FedEx Freight Priority, a service designed for rapid delivery to meet critical supply chain needs.",
        "source": "finqa"
    },
    {
        "query": "What impact does Hewlett Packack Enterprise anticipate from currency exchange rates based on their recent financial statements?",
        "response": "Hewlett Packard Enterprise anticipates increased costs of products and moderated revenue and earnings growth due to a challenging foreign exchange environment, as they have significant revenue generation outside the U.S.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage point decrease in earnings from operations as a percentage of net revenue for the Printing segment in the fiscal year 2023?",
        "response": "0.2 percentage points",
        "source": "finqa"
    },
    {
        "query": "How much did the net cash provided by operating activities decrease in 2023 compared to 2022?",
        "response": "Net cash provided by operating activities decreased by $1.47 billion to $13.26 billion in 2023 from $14.72 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "When did The Charles Schwab Corporation change its corporate headquarters from San Francisco to Westlake, Texas?",
        "response": "January 1, 2021",
        "source": "finqa"
    },
    {
        "query": "What is Walmart's goal for emissions reduction as part of their sustainability efforts?",
        "response": "Walmart's goal is to achieve zero emissions in their operations by 2040 without offsets and to reduce or avoid one billion metric tons of emissions in their value chain by 2030 through Project Gigaton.",
        "source": "finqa"
    },
    {
        "query": "What are the penalties for non-compliance with Brazil's data protection laws?",
        "response": "The maximum fine for non-compliance is 50 million Brazilian real or 2% of the company’s turnover.",
        "source": "finqa"
    },
    {
        "query": "Who are NVIDIA's primary suppliers for semiconductor wafer production?",
        "response": "NVIDIA's primary suppliers for semiconductor wafer production are Taiwan Semiconductor Manufacturing Company Limited and Samsung Electronics Co. Ltd.",
        "source": "finqa"
    },
    {
        "query": "What regulatory bodies oversee American Express National Bank (AENB)?",
        "response": "American Express National Bank (AENR) is overseen by the Office of the Comptroller of the Currency (OCC).",
        "source": "finqa"
    },
    {
        "query": "Why might actual results differ from GameStop's forward-looking statements?",
        "response": "Actual results may vary from GameStop's forward-looking statements due to certain factors that could cause discrepancies, as explained in the disclosures under specific sections of the Form 10-K like 'Risk Factors'.",
        "source": "finqa"
    },
    {
        "query": "How are loss contingencies accounted for in financial statements?",
        "response": "Loss contingencies are recorded as a liability when it is probable that a loss has been incurred and the amount can be reasonably estimated. If a loss is reasonably possible and the loss or range of loss can be reasonably estimated, it is disclosed in the accompanying notes to the consolidated financial statements. If the loss or range of loss cannot be reasonably estimated, it is stated that an estimate cannot be made.",
        "source": "finqa"
    },
    {
        "query": "What was the net production increase percentage of Chevron's worldwide oil-equivalent from 2022 to 2023?",
        "response": "4 percent",
        "source": "finqa"
    },
    {
        "query": "What are the main components of technology and infrastructure costs?",
        "response": "The main components of technology and infrastructure costs include payroll and related expenses for employees involved in R&D, design and maintenance of stores, curation of products, and infrastructure costs like servers and data centers.",
        "source": "finqa"
    },
    {
        "query": "What activities does FedEx engage in to promote its brand?",
        "response": "To promote its brand, FedEx engages in television, print, digital advertising, sponsorships, and special events, including sponsoring sports events and teams such as UEFA Champions League and the sportsperson Denny Hamlin’s NASCAR team.",
        "source": "finqa"
    },
    {
        "query": "What action can Iron Mountain Incorporated take with the 7% Notes due 2029 before their par call date?",
        "response": "Iron Mountain Incorporated may redeem the 7% Notes due 2029 at any time, at their option, in whole or in part.",
        "source": "finqa"
    },
    {
        "query": "How much did Chipotle Mexican Grill's depreciation and amortization expenses amount to in 2023?",
        "response": "$319,394",
        "source": "finqa"
    },
    {
        "query": "What range of executive positions has Matthew Friend held at NIKE?",
        "response": "Matthew Friend has held several executive positions at NIKE, including Senior Director of Corporate Strategy and Development, Chief Financial Officer of Emerging Markets, Chief Financial Officer of Global Categories, Product and Functions, and Vice President of Investor Relations, culminating in his appointment as Executive Vice President and Chief Financial Officer of NIKE, Inc. in April 2020.",
        "source": "finqa"
    },
    {
        "query": "What kind of support does QuickBooks Live offer to small businesses?",
        "response": "QuickBooks Live provides Full-Service Bookkeeping for hands-on book management and Assisted Bookkeeping Service for on-demand access to expert bookkeepers.",
        "source": "finqa"
    },
    {
        "query": "What was the total number of outstanding stock option awards at the beginning and end of 2023, and what were their weighted average exercise prices?",
        "response": "The number of outstanding stock option awards was 6.2 million at both the beginning and end of 2023, with a weighted average exercise price of $50.40 and $50.42, respectively.",
        "source": "finqa"
    },
    {
        "query": "What is the date on the audit report for the Consolidated Financial Statements?",
        "response": "February 16, 2024",
        "source": "finqa"
    },
    {
        "query": "What can be found at Part IV Item 15 in the document mentioned?",
        "response": "Indexes to Financial Statements and Financial Statement Schedules",
        "source": "finqa"
    },
    {
        "query": "What led to the reduced amortization of intangible assets in 2023?",
        "response": "The decrease in 2023 reflects the discontinuation of amortization expense associated with intangible assets included with the sale of the eOne Film and TV business to Lionsgate, lower expense due to the impairment of the Company's definite-lived intangible asset, eOne Trademark during the second quarter of 2023, lower expense due to the partial impairment of the Company's definite-lived Power Rangers intangible assets during the fourth quarter of 2022, and lower expense due to certain classic gaming properties becoming fully amortized during the first quarter of 2023.",
        "source": "finqa"
    },
    {
        "query": "What types of sales are included in General Motors' total vehicle sales data for China?",
        "response": "General Motors includes sales of non-GM trademarked vehicles by certain joint ventures in their total vehicle sales data for China.",
        "source": "finqa"
    },
    {
        "query": "What were the main drivers behind the sales growth of TREMFYA?",
        "response": "market growth, continued strength in Psoriasis and Psoriatic Arthritis, and patient mix",
        "source": "finqa"
    },
    {
        "query": "What was the increase in interest expense for Las Vegas Sands Corp. and subsidiaries due to the downgrades in the years 2023 and 2022, respectively?",
        "response": "The interest expense increased by $30 million and $16 million for the years 2023 and 2022, respectively, due to the downgrades.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net revenues for Vraylar at AbbVie in 2023?",
        "response": "35%",
        "source": "finqa"
    },
    {
        "query": "What is the estimated potential incremental tax and interest liability as of December 31, 2023, if the Tax Court Methodology is upheld and applied to subsequent years?",
        "response": "The estimated potential incremental tax and interest liability is approximately $16 billion as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the main raw materials used by IMC in the manufacturing of cutting tools?",
        "response": "The main raw materials used by IMC in the manufacturing of cutting tools are cemented tungsten carbide powder and tungsten.",
        "source": "finqa"
    },
    {
        "query": "Which two business segments does Johnson & Johnson currently operate under?",
        "response": "Innovative Medicine and MedTech",
        "source": "finqa"
    },
    {
        "query": "What percentage of billings is for subscription and support services?",
        "response": "Over 90 percent",
        "source": "finqa"
    },
    {
        "query": "What was the impact of renovations on room revenues in 2023?",
        "response": "Room revenues in 2023 were negatively impacted by disruptions due to renovations, which involved the introduction of new and elevated suites and rooms and other amenities throughout the year.",
        "source": "finqa"
    },
    {
        "query": "In what year was the Select-SLE study initiated by AbbVie to evaluate Rinvoq for systemic Lupus Erythematosus?",
        "response": "2023",
        "source": "finqa"
    },
    {
        "query": "What amount did NVIDIA record as an acquisition termination cost in fiscal year 2023?",
        "response": "NVIDIA recorded an acquisition termination cost of $1.35 billion in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "Where can more detailed information regarding the legal proceedings be found?",
        "response": "More detailed information regarding the legal proceedings can be found in Note 13 - Commitments and Contingencies in the Notes to Consolidated Financial Statements in Part II, Item 8 of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the net other income in 2023, and how did it change from 2022?",
        "response": "Other income, net was $13.0 million in 2023, which increased by $16.4 million from other expense, net of $3.4 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What were the operating lease costs for the company for the year ended December 31, 2023?",
        "response": "$1.4 billion",
        "source": "finqa"
    },
    {
        "query": "What was the total amount invested in purchases from Vebu during the year ended December 31, 2023?",
        "response": "$991",
        "source": "finqa"
    },
    {
        "query": "What percentage of Chubb's U.S. workforce were underrepresented minorities as of December 31, 2023?",
        "response": "31 percent",
        "source": "finqa"
    },
    {
        "query": "What is the projected range for capital expenditures for fiscal 2024?",
        "response": "approximately $17 billion to $18 billion",
        "source": "finqa"
    },
    {
        "query": "How do changes in tax laws and regulations affect the company?",
        "response": "Changes in both domestic and international tax laws or regulations have affected and may affect the effective tax rate, results of operations, and cash flows. These changes include the active proposal and enactment of tax law changes across different countries.",
        "source": "finqa"
    },
    {
        "query": "What components primarily affect changes in lease residuals for Ford Credit?",
        "response": "Changes in lease residuals are mainly influenced by residual gains and losses and changes in accumulated supplemental depreciation.",
        "source": "finqa"
    },
    {
        "query": "How many employees did the company have at the end of 2023, and what percentages worked in membership warehouses, distribution channels, and were represented by unions?",
        "response": "At the end of 2023, the company employed 316,000 employees worldwide. Approximately 95% are employed in membership warehouses and distribution channels, while approximately 5% are represented by unions.",
        "source": "finqa"
    },
    {
        "query": "What was the gross profit of Garmin Ltd. in 2023?",
        "response": "$3,004,955",
        "source": "finqa"
    },
    {
        "query": "What changes are occurring with vehicle safety regulations outside of the U.S.?",
        "response": "Many countries are adopting more stringent vehicle safety regulations and are likely to implement even stricter standards in the future.",
        "source": "finqa"
    },
    {
        "query": "On which pages does the Glossary of Terms and Acronyms appear in the financial document?",
        "response": "The Glossary of Terms and Acronyms appears on pages 315-321.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the earnings from operations as a percentage of net revenue decrease in the Personal Systems segment from 2022 to 2023?",
        "response": "0.3%",
        "source": "finqa"
    },
    {
        "query": "How much did the shipping and handling costs incurred by the company amount to in fiscal years 2023, 2022, and 2021?",
        "response": "$0.9 billion in 2023, $0.8 billion in 2022, and $0.8 billion in 2021",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in IBM's Form 10-K for 2023?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What was the amount of Comcast's net deferred tax liability as of December 31, 2023?",
        "response": "$25,894 million",
        "source": "finqa"
    },
    {
        "query": "What actions are taken to manage credit risks in the commercial businesses?",
        "response": "Several actions are implemented to manage credit risks in commercial businesses, including increasing the frequency and intensity of portfolio monitoring, engaging in hedging activities, and transferring the management of deteriorating commercial exposures to independent special asset officers as credits enter criticized categories.",
        "source": "finqa"
    },
    {
        "query": "What significant achievement did eBay make in 2023 regarding its gross merchandise volume?",
        "response": "In 2023, eBay enabled more than $73 billion of gross merchandise volume.",
        "source": "finqa"
    },
    {
        "query": "What new features does Windows 11 offer?",
        "response": "Windows 11 offers innovations such as Windows Copilot with centralized AI assistance and Dev Home, aimed at enhancing productivity.",
        "source": "finqa"
    },
    {
        "query": "How do differences between North American and UNECE based regulations impact vehicle development?",
        "response": "These differences add complexity and costs to vehicle development.",
        "source": "finqa"
    },
    {
        "query": "How does the company integrate large language models with its software platforms?",
        "response": "The company integrates large language models (LLMs) with its existing software platforms, Gotham and Foundry, to help connect AI to enterprise data. This integration is aimed at facilitating decision-making within the constraints required by the users.",
        "source": "finqa"
    },
    {
        "query": "What types of audio products does Garmin's Fusion and JL Audio brands offer?",
        "response": "Garmin's audio brands, Fusion and JL Audio, offer head units, speakers, amplifiers, subwothers, and other audio components, designed for marine, powersports, aftermarket automotive, home, or RV environments, supporting various connectivity options.",
        "source": "finqa"
    },
    {
        "query": "How did foreign exchange rate fluctuations impact the company's consolidated revenues and income before income taxes for the fiscal years ended May 31, 2023, 2022, and 2021?",
        "response": "Foreign exchange rate fluctuations had a negative impact on the company's consolidated revenues by approximately $2,859 million in 2023, $295 million in 2022, and positively by $893 million in 2021. Similarly, for income before income taxes, the impact was a detriment of approximately $824 million in 2023, $87 million in 2022, and a benefit of $260 million in 2021.",
        "source": "finqa"
    },
    {
        "query": "Which sectors are the primary targets for the company's Embedded Segment products?",
        "response": "The Embedded Segment products are targeted at markets such as Aerospace and Defense, Test and Measurement, Industrial, Automotive, Consumers, Broadcast, Communication Infrastructure, and Data Center.",
        "source": "finqa"
    },
    {
        "query": "How much did the marketing and sales expenses increase by in fiscal 2023?",
        "response": "In fiscal 2023, marketing and sales expenses increased by $1.3 billion.",
        "source": "finqa"
    },
    {
        "query": "Why is the outcome of the claims and proceedings uncertain?",
        "response": "The outcome of the claims and proceedings is uncertain because it is inherently unpredictable, regardless of the merits of the case.",
        "source": "finqa"
    },
    {
        "query": "What are the implications of a company disclosing violations of the Foreign Corrupt Practices Act?",
        "response": "Disclosures of FCPA violations by a company may result in it being subjected to severe criminal and civil sanctions, increased exposure to enforcement activities, and potentially additional penalties across multiple jurisdictions.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in interest income for the fiscal year 2023 compared to the previous year?",
        "response": "from $40,826 to $77,302",
        "source": "finqa"
    },
    {
        "query": "What was the amount of cash generated from operations by the company in fiscal year 2023?",
        "response": "The company generated $18,085 million of cash from operations in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "Why are critical accounting estimates essential for preparing financial statements in accordance with U.S. GAAP?",
        "response": "Critical accounting estimates are essential because they involve estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses, and related disclosures.",
        "source": "finqa"
    },
    {
        "query": "Who prepared the report on the Consolidated Financial Statements for the document?",
        "response": "The report on the Consolidated Financial Statements was prepared by PricewaterhouseCoopers LLP, the firm's independent registered public accounting firm.",
        "source": "finqa"
    },
    {
        "query": "What are the primary treatment options available for ESKD?",
        "response": "The primary treatment options for ESKD are dialysis and kidney transplantation.",
        "source": "finqa"
    },
    {
        "query": "What were the main components of the change in interest and other income (expense) for the year ended December 31, 2025?",
        "response": "The change was primarily due to a significant decrease in foreign exchange gains, partially offset by an increase in interest income.",
        "source": "finqa"
    },
    {
        "query": "What is the minimum project cost for the development described in the Second Development Agreement involving MBS?",
        "response": "SGD 4.5 billion",
        "source": "finqa"
    },
    {
        "query": "What types of industries does TTI service?",
        "response": "TTI services a variety of industries, including telecommunications, medical devices, computers and office equipment, military/aerospace, automotive, and industrial electronics.",
        "source": "finqa"
    },
    {
        "query": "Why is Note 16 important in the analysis of a Form 10-K for legal matters?",
        "response": "Note 16 provides in-depth details on legal issues in the form of commitments and contingencies that are vital for understanding the company's legal exposure.",
        "source": "finqa"
    },
    {
        "query": "How much did the operating income for Google Cloud change from 2022 to 2023?",
        "response": "Increased by $3.6 billion",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 refer to in a financial document?",
        "response": "Item 8 refers to Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "How does the distribution network support the company's low-cost operating structure?",
        "response": "The company's distribution network, consisting of multiple centers strategically located to serve both Dollar Tree and Family Dollar stores, supports its low-cost operating structure by enhancing efficiency and maintaining flexibility.",
        "source": "finqa"
    },
    {
        "query": "What topics are covered in the Commitments and Contingencies section related to Note 14?",
        "response": "Legal proceedings",
        "source": "finqa"
    },
    {
        "query": "What energy management technologies does the Enphase bidirectional EV charger integrate with?",
        "response": "IQ8 Microinverters and Ensemble OS",
        "source": "finqa"
    },
    {
        "query": "What are the details of Starbucks' Reinvention Plan in the U.S.?",
        "response": "The Reinvention Plan focuses on increasing efficiency while improving the partner and customer experience through purpose-built store concepts and technology innovations.",
        "source": "finqa"
    },
    {
        "query": "Under what condition will the Company record a liability?",
        "response": "The Company will record a liability when it is probable that a loss has been incurred and the amount is reasonably estimable.",
        "source": "finqa"
    },
    {
        "query": "How much did the company spend on share repurchases as part of its capital return to shareholders?",
        "response": "$2.5 billion",
        "source": "finqa"
    },
    {
        "query": "What was the carrying amount of the company's non-marketable equity securities accounted for using the fair value measurement alternative as of September 30, 2023?",
        "response": "$1,173 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net cash provided by operating activities from 2022 to 2023?",
        "response": "5%",
        "source": "finqa"
    },
    {
        "query": "What financial challenge did the company face in 2017 and how did it impact them legally?",
        "response": "In 2017, the company experienced a material cybersecurity incident involving the theft of personal information of consumers, leading to various proceedings and investigations as described in their legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What section of a financial document includes financial statements and supplementary data?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What method does the company use to account for income taxes?",
        "response": "The company accounts for income taxes using the asset and liability method.",
        "source": "finqa"
    },
    {
        "query": "How is the information regarding legal proceedings incorporated in the Annual Report on Form 10-K?",
        "response": "Information regarding legal proceedings is incorporated by reference from Note 11—Commitments and Contingencies to the Consolidated Financial Statements in the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What are some examples of alternative payments providers and how do they compete with Visa?",
        "response": "Examples of alternative payments providers include closed commerce ecosystems, BNPL solutions, and cryptocurrency platforms. They compete with Visa by offering payments through ecommerce and mobile channels and might use in-house transfers, electronic funds transfer networks like ACH, or networks like Visa.",
        "source": "finqa"
    },
    {
        "query": "When is the first production at the New Gas Consortium Project (NGC) in the Quiluma and Maboqueiro fields expected?",
        "response": "2026",
        "source": "finqa"
    },
    {
        "query": "What was the basic earnings per common share attributable to Comcast Corporation shareholders in 2023?",
        "response": "$3.73",
        "source": "finqa"
    },
    {
        "query": "What was the change in other income (expense), net, for 2023 compared to the previous year?",
        "response": "Other income (expense), net changed by $204.1 million for the year ended December 31, 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the total company matching contributions for Johnson & Johnson's 401(k) savings plans in the fiscal year 2023?",
        "response": "$263 million",
        "source": "finqa"
    },
    {
        "query": "How much did acquisition-related transaction and integration costs amount to in 2023, and what were they primarily for?",
        "response": "In 2023, acquisition-related transaction and integration costs amounted to $269 million, primarily due to legal, consulting, and integration expenses related to the acquisition and integration of Black Knight and our integration of Ellie Mae.",
        "source": "finqa"
    },
    {
        "query": "In what sequence do the signature pages appear relative to the financial documents in this report?",
        "response": "The signature pages appear immediately before the financial documents, which start on page 105.",
        "source": "finqa"
    },
    {
        "query": "What year was the European Central Bank's approval granted for two intermediate parent undertakings for the Firm?",
        "response": "2023",
        "source": "finqa"
    },
    {
        "query": "What actions are taken by Caterpillar if a dealer fails to return an acceptable core within the specified time period?",
        "response": "Caterpillar recognizes the core deposit and the cost of the core in Sales and Cost of goods sold.",
        "source": "finqa"
    },
    {
        "query": "When is the United States composition of matter patent for ibrutinib expected to expire?",
        "response": "2027",
        "source": "finqa"
    },
    {
        "query": "What are the expected financial results for General Motors for the year ending December 31, 2024?",
        "response": "For the year ending December 31, 2024, General Motors expects Net income attributable to stockholders to be between $9.8 billion and $11.2 billion, and EBIT-adjusted to be between $12.0 billion and $14.0 billion.",
        "source": "finqa"
    },
    {
        "query": "In which year did lululemon's sales per square foot amount to $1,443?",
        "response": "Lululemon's sales per square foot amounted to $1,443 in the year 2021.",
        "source": "finqa"
    },
    {
        "query": "What does 'incorporated by reference' mean in the context of IBM’s 2023 Annual Report?",
        "response": "It means that the material is not physically within the report but is considered as part of it.",
        "source": "finqa"
    },
    {
        "query": "Who owns the patents related to DARZALEX and what is their relationship with Janssen Biotech, Inc.?",
        "response": "Genmab A/S owns the patents related to DARZALEX, and Janssen Biotech, Inc. has an exclusive license to these patent families.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of the Company's fixed lease payment obligations as of September 30, 2023?",
        "response": "$15.8 billion",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for the year ended December 31, 2023?",
        "response": "$705,513 thousand",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of GameStop Corp's net deferred tax assets as of January 28, 2023?",
        "response": "$18.2 million",
        "source": "finqa"
    },
    {
        "query": "How is the average price per ad calculated, and what impact did the year-over-year changes have on advertising revenue in 2023?",
        "response": "The average price per ad is calculated by dividing total advertising revenue by the number of ads delivered. In 2023, the number of ads delivered increased, but the average price per ad decreased by 9% due to higher ad delivery volumes and monetization rates of certain products like Reels.",
        "source": "finqa"
    },
    {
        "query": "How does Chipotle calculate revenue recognition for redeemed Chipotle Rewards?",
        "response": "Chipotle recognizes revenue from redeemed Chipotle Rewards within food and beverage revenue when a customer redeems an earned reward.",
        "source": "finqa"
    },
    {
        "query": "What was the dollar value of the cash dividends paid per share by Johnson & Johnson in 2023?",
        "response": "$4.70",
        "source": "finqa"
    },
    {
        "query": "How many new hotels did Hilton open in the year ended December 31, 2023?",
        "response": "395",
        "source": "finqa"
    },
    {
        "query": "What was the increase in revenues for the International segment from fiscal 2022 to fiscal 2023, and what primarily drove this increase?",
        "response": "The revenues for the International segment increased by $548 million from fiscal 2022 to 2023. This increase was primarily driven by 927 net new Starbucks company-operated stores and higher product sales to and royalty revenues from licensees.",
        "source": "finqa"
    },
    {
        "query": "What are the requirements for Gilead's cell therapy products under the FDA's Risk Evaluation and Mitigation Strategy program?",
        "response": "For Gilead's cell therapy products, the FDA requires compliance with the Risk Evaluation and Mitigation Strategy program, which includes educating and certifying medical personnel about the therapy procedures and the potential side effects, such as cytokine release syndrome and neurologic toxicities.",
        "source": "finqa"
    },
    {
        "query": "How many Canadian class actions were initiated against Equifax related to the 2017 cybersecurity incident?",
        "response": "Five",
        "source": "finqa"
    },
    {
        "query": "How has the company addressed its responsibilities in connection with Superfund clean-up orders?",
        "response": "The company has been named as a responsible party on Superfund clean-up orders for three sites and has entered into settlement agreements with other responsible parties who have agreed to assume most foreseeable costs and the primary role in conducting remediation activities.",
        "source": "finqa"
    },
    {
        "query": "How much was the Adjusted Free Cash Flow for the company in 2023?",
        "response": "The Adjusted Free Cash Flow for the company in 2023 was $14.0 billion.",
        "source": "finqa"
    },
    {
        "query": "As of December 31, 2023, what is the Company's intent regarding the sale of securities in an unrealized loss position?",
        "response": "As of December 31, 2023, the Company did not have the intent to sell any of the securities in an unrealized loss position.",
        "source": "finqa"
    },
    {
        "query": "What was the provision for lululemon Studio obsolescence listed in the financial data?",
        "response": "The provision for lululemon Studio obsolescence was 23,709.",
        "source": "finqa"
    },
    {
        "query": "What was the change in general and administrative expenses for the year 2023 compared to the previous year?",
        "response": "General and administrative expenses decreased by $72.0 million, or 12%, for the year ended December 31, 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What were the total net earnings of Johnson & Johnson in the year 2023?",
        "response": "$35,153 million",
        "source": "finqa"
    },
    {
        "query": "How much cash, cash equivalents, and unrestricted marketable securities did the company have as of September 30, 2023?",
        "response": "$148.3 billion",
        "source": "finqa"
    },
    {
        "query": "What sustainability-linked targets were included in Ford's credit agreements as of November 24, 2023?",
        "response": "The sustainability-linked targets included in Ford's credit agreements related to global manufacturing facility greenhouse gas emissions, renewable electricity consumption, and Ford Europe CO2 tailpipe emissions.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash used in financing activities in 2023 and how does it compare to 2022?",
        "response": "Net cash used in financing activities was $2,614 in 2023, compared to $4,283 in 2022.",
        "source": "finqa"
    },
    {
        "query": "What financial document provides detailed information about Enphase Energy's stock options, RSUs, and other securities excluded from diluted net income per share calculations?",
        "response": "Enphase Energy's 2023 Form 10-K provides detailed information about stock options, RSUs, and other securities that were excluded from diluted net income per share calculations due to their antidilutive effect.",
        "source": "finqa"
    },
    {
        "query": "What are the potential risks faced by Garmin due to its reliance on single or limited suppliers for key components?",
        "response": "Garmin faces supply and pricing risks due to its reliance on single or limited suppliers for certain key components, which also limits its near-term flexibility to switch suppliers if needed.",
        "source": "finqa"
    },
    {
        "query": "How does Walmart support associates who are on the U.S. Medical Plan?",
        "response": "Walmart supports associates on the U.S. Medical Plan with free virtual visits for medical urgent care and mental health care.",
        "source": "finqa"
    },
    {
        "query": "In which product categories is Apple focused on expanding its market opportunities?",
        "response": "Apple is focused on expanding its market opportunities related to smartphones, personal computers, tablets, wearables and accessories, and services.",
        "source": "finqa"
    },
    {
        "query": "What are the two main categories into which Ford Motor Company classifies its costs and expenses, excluding those related to Ford Credit?",
        "response": "Cost of sales and selling, administrative, and other expenses.",
        "source": "finqa"
    },
    {
        "query": "Where can information about commitments and contingencies be found in financial documents?",
        "response": "Information about commitments and contingencies, specifically related to legal proceedings, can be found in Item 8 of Part II under the section 'Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings'.",
        "source": "finqa"
    },
    {
        "query": "What were the main causal factors influencing the increase in Ford Blue's EBIT in 2022?",
        "response": "The increase in Ford Blue's EBIT in 2022 was primarily influenced by higher net pricing and higher wholesales, offset by inflationary increases on commodity, material, and freight costs, higher warranty costs, higher structural costs, and weaker currencies.",
        "source": "finqa"
    },
    {
        "query": "What is the unique mechanism of action for the drug Imbruvica, and what conditions does it target?",
        "response": "Imbruvica works by inhibiting a protein called Bruton's tyrosine kinase, and it is approved for the treatment of adult patients with chronic lymphocytic leukemia (CLL) and certain forms of non-Hodgkin lymphoma.",
        "source": "finqa"
    },
    {
        "query": "What types of transportation equipment does XTRA Corporation manage in its fleet?",
        "response": "XTRA Corporation manages a diverse fleet that includes over-the-road and storage trailers, chassis, temperature-controlled vans, and flatbed trailers.",
        "source": "finqa"
    },
    {
        "query": "What are some of the key elements of Hasbro's strategic plan?",
        "response": "Key elements include building innovative toys and games, pursuing a franchise-first approach, focusing on fewer but more profitable brands, investing in direct-to-consumer business, cultivating digital gaming, licensing brands, executing operational savings initiatives, and fostering a diverse and inclusive culture.",
        "source": "finqa"
    },
    {
        "query": "What are the primary forms of retiree benefits offered by the Company and who is eligible for these benefits?",
        "response": "The primary forms of retiree benefits offered by the Company are primarily health care benefits. These benefits are eligible for the majority of U.S. employees who meet minimum age and service requirements.",
        "source": "finqa"
    },
    {
        "query": "What method does the Company use to calculate the relative standalone selling price (SSP) of certain map updates, map care, and traffic services?",
        "response": "The Company uses the expected cost plus a margin method as the primary indicator to calculate the relative standalone selling price (SSP) of certain map updates, map care, and traffic services.",
        "source": "finqa"
    },
    {
        "query": "How does the company approach environmental concerns in its Integrated Resort operations?",
        "response": "The company seeks to reduce environmental impacts by implementing strategies such as lowering utility costs, improving staffing efficiencies, and centralizing transportation, marketing, sales, and procurement which contributes to more sustainable operations.",
        "source": "finqa"
    },
    {
        "query": "What section of the annual report provides information on the legal proceedings the company is involved in?",
        "response": "The information on the legal proceedings the company is involved in is provided under 'Litigation' in Note 12, which is part of the Commitments and Contingencies in the notes to the Consolidated Financial Statements located in Item 8 of Part II of the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What is denoted by 'Item 8' in a document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What factors influenced consumer purchasing behaviors and spending in the company's sector during the period discussed?",
        "response": "Consumer purchasing behaviors and spending were influenced by uncertain economic conditions such as inflation, higher interest rates, and other factors.",
        "source": "finqa"
    },
    {
        "query": "What are the rules regarding resolution planning by the OCC for JPMorgan Chase Bank, N.A.?",
        "response": "JPMorgan Chase Bank, N.A. is required to prepare and submit a recovery plan annually as directed by the OCC and submit a separate resolution plan pursuant to the FDIC's IDI Resolution Rule.",
        "source": "finqa"
    },
    {
        "query": "What legal framework governs the approval process for biosimilars in the United States?",
        "response": "In the United States, the approval process for biosimilars is governed by the Public Health Service Act (PHSA) and the regulations implementing these statutes, specifically including provisions made under federal health care reform legislation enacted in March 2010.",
        "source": "finqa"
    },
    {
        "query": "How did the net income in 2023 compare to 2022?",
        "response": "The net income in 2023 was $187,263, which was significantly lower than the $562,149 reported in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did Iron Mountain spend on supplier diversity in fiscal 2023?",
        "response": "$70 million",
        "source": "finqa"
    },
    {
        "query": "What caused the decrease in the company's net revenue in fiscal year 2023?",
        "response": "The decrease in net revenue in fiscal year 2023 was mainly due to demand softness and foreign currency impacts in both Personal Systems and Printing, along with lower average selling prices in Personal Systems.",
        "source": "finqa"
    },
    {
        "query": "What types of revenue does the payments company generate from its various products and services?",
        "response": "The company generates discount revenue, interest income, net card fees, service fees and other revenue, and processed revenue from its various products and services.",
        "source": "finqa"
    },
    {
        "query": "Are the company's legal issues ongoing or resolved?",
        "response": "The company's legal issues are ongoing, as they are involved in numerous lawsuits and regulatory proceedings arising in ordinary course of business.",
        "source": "finqa"
    },
    {
        "query": "What are the main reasons for using Adjusted EBITDA as a measure in evaluating business performance?",
        "response": "Adjusted EBITDA is used to measure business performance because it eliminates the impact of non-cash depreciation and amortization expenses due to the capital-intensive nature of some businesses and intangible assets from business combinations. It also remains unaffected by capital and tax structures, and investment activities, including results from entities not consolidated.",
        "source": "finqa"
    },
    {
        "query": "What major factors contributed to the increase in net revenues in 2023?",
        "response": "The increase in net revenues in 2023 was primarily due to the investment in focus categories and a higher take rate driven by the expansion of promoted listings and payment services, along with the launch of eBay International Shipping.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the total contractual obligations are expected to be paid in the short term as of October 31, 2023?",
        "response": "11.7%",
        "source": "finqa"
    },
    {
        "query": "What is the amended maturity date of the UK Bilateral Revolving Credit Facility following its extension in 2023?",
        "response": "September 24, 2025",
        "source": "finqa"
    },
    {
        "query": "What are some key goals of the corporation related to climate change?",
        "response": "The corporation aims to achieve its Net Zero goal and 2030 Financing Activity Emissions Targets, which involves technological advances, better emissions data reporting, new standards, public policies that improve the cost of capital for transitioning to a low-carbon economy, and engagement with various stakeholders.",
        "source": "finqa"
    },
    {
        "query": "What types of royalty expenses are included in the company's financial reports?",
        "response": "The company's royalty expenses include payments to content licensors, independent software developers, and co-publishing and distribution affiliates.",
        "source": "finqa"
    },
    {
        "query": "What are the total long-term debt figures reported as of the latest fiscal period?",
        "response": "$37,621 million",
        "source": "finqa"
    },
    {
        "query": "By what percentage did HIV product sales increase in 2023 compared to the previous year?",
        "response": "6%",
        "source": "finqa"
    },
    {
        "query": "What significant estimates and assumptions does Salesforce management make in their financial statements?",
        "response": "Salesforce management makes significant estimates and assumptions including the fair value of assets acquired and liabilities assumed for business combinations, the standalone selling price of performance obligations for revenue contracts with multiple performance obligations, the valuation of privately-held strategic investments, including impairments, the recognition, measurement and valuation of current and deferred income taxes and uncertain tax positions, the average period of benefit associated with costs capitalized to obtain revenue contracts, the useful lives of intangible assets, and the fair value of certain stock awards issued.",
        "source": "finqa"
    },
    {
        "query": "By how much did the adjusted operating loss decrease in 2023 compared to the previous year?",
        "response": "$295 million",
        "source": "finqa"
    },
    {
        "query": "What percentage of Salesforce's total assets were located outside the Americas as of January 31, 2023?",
        "response": "15 percent of Salesforce's total assets were located outside the Americas as of January 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What measures does Goldman Sachs employ to handle their cyber incident response?",
        "response": "Goldman Sachs uses external technical assessments, including external penetration tests and “red team” engagements, and third-party forensics firms to augment their cyber incident response capabilities.",
        "source": "finqa"
    },
    {
        "query": "What were the end dates for GameStop's fiscal years 2020, 2021, and 2022?",
        "response": "Fiscal year 2020 ended on January 30, 2021, fiscal year 2021 ended on January 29, 2022, and fiscal year 2022 ended on January 28, 2023.",
        "source": "finqa"
    },
    {
        "query": "What potential impacts of the Rebate Rule have led PCMA to file a lawsuit?",
        "response": "PCMA has filed a lawsuit claiming that the Rebate Rule would lead to higher premiums in Medicare Part D and was adopted in an unlawful manner.",
        "source": "finqa"
    },
    {
        "query": "What was the net loss for the year ended December 31, 2022?",
        "response": "$973.6 million",
        "source": "finqa"
    },
    {
        "query": "What does it mean for the consolidated financial statements to be incorporated by reference in the Annual Report on Form 10-K?",
        "response": "It means that the consolidated financial statements are officially part of the Annual Report even though they are placed in another location within the document and are included as integral components of the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of capital returned to shareholders in the provided data?",
        "response": "$3.9 billion",
        "source": "finqa"
    },
    {
        "query": "What are the classification and reporting criteria for marketable debt securities?",
        "response": "Marketable debt securities are classified as available-for-sale and are reported at fair value. The unrealized gains and losses from these securities are included in 'Accumulated other comprehensive income (loss).",
        "source": "finqa"
    },
    {
        "query": "What actions did Slack and the other defendants take in the State Court Action in February 2020?",
        "response": "Slack and the other defendants filed demurrers to the complaint in the State Court Action.",
        "source": "finqa"
    },
    {
        "query": "What benefits are offered to the company's associates?",
        "response": "The company offers competitive health and welfare benefits, retirement savings plans with match contributions, an employee stock purchase plan, and various other benefits like disability and life insurance, primary caregiver and parental leave, and a scholarship program for associates' children.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily contributed to the increase in non-interest revenues across all revenue categories?",
        "response": "The increase in non-interest revenues was primarily driven by higher Discount revenue and Service fees and other revenues.",
        "source": "finqa"
    },
    {
        "query": "What degree does Kevin M. Connor hold from the University of Missouri-Kansas City?",
        "response": "LLM in Taxation",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Clayton Homes' revenues from 2021 to 2022?",
        "response": "Clayton Homes' revenues increased by 21.1% from 2021 to 2022.",
        "source": "finqa"
    },
    {
        "query": "When is the Term Loan A scheduled to mature and what will happen at maturity?",
        "response": "March 18, 2027, when all obligations under it become due.",
        "source": "finqa"
    },
    {
        "query": "When does the latest expiring European composition of matter patent for STELARA expire?",
        "response": "2024",
        "source": "finqa"
    },
    {
        "query": "How much did GameStop report in total cash, cash equivalents, and restricted cash for the year 2022?",
        "response": "$1,196.0 million",
        "source": "finqa"
    },
    {
        "query": "How are legal proceedings discussed in the Annual Report on Form 10-K incorporated into the document?",
        "response": "Legal proceedings information is incorporated by reference from 'Note 13 — Commitments and Contingencies — Litigation and Other Legal Matters' in the consolidated financial statements located in Part IV, Item 15.",
        "source": "finqa"
    },
    {
        "query": "What are the new requirements proposed by the EPA for the power sector to address GHG emissions, effective January 1, 2030?",
        "response": "The new requirements proposed by the EPA for the power sector include subcategorizing the best system of emissions reduction based on fuel type, determining carbon capture and sequestration as the best method for existing coal plants, setting an emissions limit of 1,300 to 1,500 pounds of carbon dioxide per gross megawatt hour for natural gas-fueled steam units, and requiring large, high-load natural gas combustion turbines to either use carbon capture and sequestration or a co-fueling with hydrogen.",
        "source": "finqa"
    },
    {
        "query": "What recent change did the Accelerating Holding Foreign Companies Accountable Act implement?",
        "response": "The Accelerating Holding Foreign Companies Accountable Act reduced the number of consecutive non-inspection years required for triggering the listing and trading prohibitions under the HFCA Act from three years to two years.",
        "source": "finqa"
    },
    {
        "query": "What was the restricted cash held by the Lending Trust and the Charge Trust as of December 31, 2022?",
        "response": "As of December 31, 2022, the restricted cash held by the Lending Trust was $59 million, and the Charge Trust held nil.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of restructuring charges in 2022 on the company and what changes occurred in 2023?",
        "response": "In 2022, the company recorded restructuring charges of $89 million due to a shift to a remote work model; however, there were no restructuring charges in 2023.",
        "source": "finqa"
    },
    {
        "query": "What does the technology and development expenses include?",
        "response": "Technology and development expenses primarily include payroll, stock-based compensation, facilities, and other expenses related to technology personnel, as well as costs for hardware and software.",
        "source": "finqa"
    },
    {
        "query": "What factors could lead to a substantial decline in the market data subscriptions and trading volumes?",
        "response": "Factors such as adverse market conditions, weak macroeconomic environment, industry-wide cost-cutting, market consolidation, changes in trading demand, regulatory or legislative changes, political uncertainty, climate change impacts, decreased financial market volatility, heightened financial regulations, defaults by market participants, unfavorable changes in contract specifications, and reduced access to capital could lead to a substantial decline in market data subscriptions and trading volumes.",
        "source": "finqa"
    },
    {
        "query": "What is the role of Level 1, Level 2, and Level 3 inputs in the fair value hierarchy according to ASC 820?",
        "response": "In the fair value hierarchy as per ASC 820, Level 1 inputs are unadjusted quoted prices in active markets for identical assets or liabilities, Level 2 inputs involve observable inputs other than quoted market prices included within Level 1, and Level 3 inputs consist of unobservable inputs based on the company’s own assumptions due to limited observable activity.",
        "source": "finqa"
    },
    {
        "query": "What is the warranty term for Enphase Energy's microinverter and storage products as mentioned in their 2023 financial statements?",
        "response": "10 to 25 years",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in services revenue in 2023?",
        "response": "The increase in services revenue was primarily driven by a 16.9% increase in on-site advertising revenue.",
        "source": "finqa"
    },
    {
        "query": "What are the critical assumptions used in the quantitative Family Dollar goodwill evaluation?",
        "response": "Critical assumptions include potential future revenue, EBITDA, and cash flows of the reporting unit, along with economic and market conditions over the projected period.",
        "source": "finqa"
    },
    {
        "query": "What is the main purpose of Walmart's EDLC strategy?",
        "response": "EDLC, or Everyday Low Cost, is Walmart's commitment to controlling expenses in order to pass cost savings back to customers, ensuring low prices can be maintained.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of the commitments under the 2022 Credit Facility?",
        "response": "$1.0 billion",
        "source": "finqa"
    },
    {
        "query": "What was the total debt of the company as of December 31, 2023?",
        "response": "$37.88 billion",
        "source": "finqa"
    },
    {
        "query": "When might fair value adjustments for observable transactions occur for non-marketable equity securities?",
        "response": "Fair value adjustments for observable transactions might occur in a period subsequent to when the transaction actually occurred, due to delays in reporting from investee companies.",
        "source": "finqa"
    },
    {
        "query": "What are the primary products and services offered by NIKE?",
        "response": "NIKE designs, develops, markets, and sells athletic footwear, apparel, equipment, accessories, and services worldwide.",
        "source": "finqa"
    },
    {
        "query": "How is the VOBA asset amortized in relation to policy costs?",
        "response": "The VOBA is amortized as a component of Policy acquisition costs in relation to the profit emergence of the underlying contracts, generally in proportion to premium revenue recognized.",
        "source": "finqa"
    },
    {
        "query": "What financial measures are presented on a non-GAAP basis in this Annual Report on Form 10-K?",
        "response": "The non-GAAP financial measures presented are revenue on a constant currency basis and free cash flow.",
        "source": "finqa"
    },
    {
        "query": "What is the role of the Bermuda Monetary Authority in relation to Caterpillar Insurance Co. Ltd.?",
        "response": "The Bermuda Monetary Authority is responsible for monitoring compliance with solvency requirements and requires an Annual Financial Filing.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in Humira's revenue in the United States from the year 2023 compared to 2022?",
        "response": "-34.7%",
        "source": "finqa"
    },
    {
        "query": "What additional information is included in the document regarding financial terminology?",
        "response": "A Glossary of Terms and Acronyms",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of long-term debt for Broadcom Inc. as of October 29, 2023?",
        "response": "$37,621 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in the foreign exchange gain or loss between the years ended on December 31, 2022 and 2023?",
        "response": "2,981.6%",
        "source": "finqa"
    },
    {
        "query": "What do the company's health plans integrate?",
        "response": "The company's health plans integrate clinical programs, plan designs, communication tools, and spending accounts.",
        "source": "finqa"
    },
    {
        "query": "What was the primary purpose of the business realignment activities that led to costs in recent years?",
        "response": "The primary purpose of the business realignment activities, which led to costs in recent years, was to improve operational efficiency in China through the International Optimization Program.",
        "source": "finqa"
    },
    {
        "query": "What was the net income reported by the company for the year ended December 31, 2023?",
        "response": "$2,438 million",
        "source": "finqa"
    },
    {
        "query": "What were the impacts of cost reductions implemented by FedEx in response to market conditions in 2023?",
        "response": "In 2023, FedEx implemented cost reductions including reducing flight hours, temporarily parking and retiring aircraft, and consolidating operations among other actions to partially mitigate the effect of volume declines but the impact lagged, particularly in the first half of the year.",
        "source": "finqa"
    },
    {
        "query": "Who conducted the audit of Garmin Ltd.'s consolidated financial statements for the period ended December 30, 2023?",
        "response": "Ernst & Young LLP",
        "source": "finqa"
    },
    {
        "query": "What are the key features of AMC's proprietary PLF auditoriums?",
        "response": "AMC's proprietary PLF auditoriums feature superior sight and sound technology, enhanced seating, and offer an enhanced theatrical experience at a lower price premium compared to IMAX or Dolby Cinema.",
        "source": "finqa"
    },
    {
        "query": "How are impairment charges for the years 2021, 2022, and 2023 recorded for restaurants and offices, and what is their impact on financial statements?",
        "response": "Impairment charges were $4,727, $2,387, and $12,613 respectively for the years 2021, 2022, and 2023, affecting Consolidated Statements of Income and Comprehensive Income.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of additional stock-based compensation expense recognized due to the Type 3 modification in the year ended December 31, 2023?",
        "response": "$20.2 million",
        "source": "finqa"
    },
    {
        "query": "What are the revenue sources for the Company’s Health Care Benefits Segment?",
        "response": "Insurance premiums and fees billed to customers.",
        "source": "finqa"
    },
    {
        "query": "What does determining distinct performance obligations in the contracts involve?",
        "response": "Determining distinct performance obligations involves significant judgment to decide if promises are separate obligations that should be accounted for individually or together within the contract context.",
        "source": "finqa"
    },
    {
        "query": "How much in charges did the company incur in connection with its restructuring plan in fiscal 2023?",
        "response": "$828 million",
        "source": "finqa"
    },
    {
        "query": "What rights are associated with Comcast's sports broadcasting agreements for the NFL?",
        "response": "rights to produce and broadcast a specified number of regular season and playoff games, additional exclusive games on Peacock, and Spanish-language broadcast rights for certain games on Telemundo",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of Delta Air Lines' future aircraft purchase commitments as of December 31, 2023?",
        "response": "$17.5 billion",
        "source": "finqa"
    },
    {
        "query": "When must MBS give notice to the STB to renew the casino concession and what is the deadline for the expiration of the current concession?",
        "response": "MBS must give notice to the STB at least five years before the concession's expiration in August 2036.",
        "source": "finqa"
    },
    {
        "query": "How much total cash did The Hershey Company use for share repurchases in 2023 excluding excise tax?",
        "response": "$267.3 million",
        "source": "finqa"
    },
    {
        "query": "How is the information for legal proceedings presented in the financial documents?",
        "response": "The information for legal proceedings is presented through reference to 'Legal Matters' and 'Government Investigations, Audits and Reviews' detailed in Note 12 of the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "By how much did membership fees increase in 2023?",
        "response": "Membership fees increased by 8% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the total fair value of derivative assets listed in the financial statement for May 31, 2023?",
        "response": "$557 million",
        "source": "finqa"
    },
    {
        "query": "What adjustments are made to the P&C combined ratio to exclude catastrophe losses and prior period development?",
        "response": "The combined ratio is adjusted by excluding catastrophe losses, prior period development, net premiums earned adjustments, prior period expense adjustments, and reinstatement premiums from both the numerator and the denominator.",
        "source": "finqa"
    },
    {
        "query": "How does Starbucks leverage technology in its international markets?",
        "response": "Starbucks invests in technology and forms partnerships to increase digital adoption, enhancing convenience and customer experience.",
        "source": "finqa"
    },
    {
        "query": "What is included in the cost of revenue according to the text?",
        "response": "The cost of revenue includes manufacturing and distribution costs for products sold and programs licensed, operating costs related to product support service centers and product distribution centers, costs incurred to include software on PCs sold by OEMs to drive traffic to websites and acquire online advertising space, costs to support and maintain cloud-based and other online products and services, warranty costs, inventory valuation adjustments, costs associated with the delivery of consulting services, and the amortization of capitalized software development costs.",
        "source": "finqa"
    },
    {
        "query": "How many pages does Item 8, which includes Financial Statements and Supplementary Data, span?",
        "response": "39 pages",
        "source": "finqa"
    },
    {
        "query": "How many Hosts does Airbnb have worldwide as mentioned in the text?",
        "response": "Airbnb has over 5 million Hosts worldwide.",
        "source": "finqa"
    },
    {
        "query": "What changes were introduced in The Home Depot's store leadership structure in fiscal 2022?",
        "response": "In fiscal 2022, The Home Depot introduced a new store leadership structure by creating new management positions focused on the customer service experience, which increased the number of managers on the floor at any given time.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net sales for Procter & Gamble in 2023 compared to the previous year?",
        "response": "Net sales for Procter & Gamble increased by 2% in 2023 compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "How much of the $44.8 million invested in lululemon's Centre for Social Impact was contributed directly to social impact organizations?",
        "response": "Of the $44.8 million invested in lululemon's Centre for Social Impact, $32.4 million was contributed directly to social impact organizations.",
        "source": "finqa"
    },
    {
        "query": "What are the main factors that influence the timing and cost of the company's inventory purchases?",
        "response": "The main factors influencing the timing and cost of the company's inventory purchases include revenue growth, assortment and purchasing decisions, product costs including freight and duty, and the availability of production capacity and speed.",
        "source": "finqa"
    },
    {
        "query": "What authority does the Macao government have over VML's recapitalization plans?",
        "response": "The Macao gaming authorities must approve any recapitalization plan proposed by VML's Board of Directors.",
        "source": "finqa"
    },
    {
        "query": "What types of products does the MedTech segment of Johnson & Johnson include?",
        "response": "Products used in the Orthopaedic, Surgery, Interventional Solutions and Vision fields",
        "source": "finqa"
    },
    {
        "query": "What aspect of recording a liability for legal matters requires significant judgment?",
        "response": "Determining when it is probable that a loss has been incurred and the amount is reasonably estimable requires significant judgment.",
        "source": "finqa"
    },
    {
        "query": "What were the funded status and obligations of Delta's defined benefit pension plans as of December 31, 2023?",
        "response": "The unfunded benefit obligation was $145 million, which is the difference between the benefit obligation of $15.9 billion and plan assets of $15.8 billion.",
        "source": "finqa"
    },
    {
        "query": "What recent development allows Dollar Tree customers to receive same-day delivery without visiting a store?",
        "response": "Dollar Tree has implemented the Instacart online delivery service, enabling customers to shop online and receive same-day delivery without visiting a store.",
        "source": "finqa"
    },
    {
        "query": "What is the principal business activity of NIKE, Inc.?",
        "response": "The principal business activity of NIKE, Inc. is the design, development, and worldwide marketing and selling of athletic footwear, apparel, equipment, accessories, and services.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did Electronic Arts' operating income grow in the fiscal year ended March 31, 2023?",
        "response": "18 percent",
        "source": "finqa"
    },
    {
        "query": "How much did a stronger U.S. dollar negatively impact net sales in fiscal 2022?",
        "response": "$339 million",
        "source": "finqa"
    },
    {
        "query": "What section of the Annual Report on Form 10-K includes the consolidated financial statements and accompanying notes?",
        "response": "Part IV, Item 15(a)(1)",
        "source": "finqa"
    },
    {
        "query": "In which section are the consolidated financial statements that include 'Commitments and Contingencies' located?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What do marketing initiatives and amortization expense relate to in a financial context?",
        "response": "Marketing initiatives and amortization expense relate to acquired customer relationships and trademark intangible assets.",
        "source": "finqa"
    },
    {
        "query": "What was the variation in Ford Pro's EBIT from 2021 to 2022, and what caused this change?",
        "response": "Ford Pro's EBIT increased by $557 million from 2021 to 2022, primarily due to improved performance in the Ford Pro segment.",
        "source": "finqa"
    },
    {
        "query": "How many shares vested and are expected to vest by the end of 2023 for PSUs, and what is their expected fair value per share?",
        "response": "114 shares expected to vest with an expected fair value of $1,557.11 per share",
        "source": "finqa"
    },
    {
        "query": "How did The Home Depot, Inc.'s basic earnings per share change from 2020 to 2022?",
        "response": "The Home Depot, Inc.'s basic earnings per share increased from $11.98 in 2020, to $15.59 in 2021, and then to $16.74 in 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of return provisions recorded as a reduction to Connected Fitness Products revenue for the fiscal year ended June 30, 2023?",
        "response": "$14.6 million",
        "source": "finqa"
    },
    {
        "query": "What was the net cash flow from operating activities for the year ended December 31, 2023?",
        "response": "$1,113,567",
        "source": "finqa"
    },
    {
        "query": "What are Iron Mountain's expectations for organic service revenue growth in 2024?",
        "response": "Iron Mountain expects the organic service revenue growth in 2024 to benefit from new and existing digital offerings and ALM, as well as their traditional services.",
        "source": "finqa"
    },
    {
        "query": "When was the report on the Consolidated Financial Statements in Item 8 dated?",
        "response": "The report was dated February 16, 2024.",
        "source": "finqa"
    },
    {
        "query": "What is the commercial paper program limit, and was it utilized by the end of fiscal year 2023?",
        "response": "The commercial paper program limit is $575 million, and it was not utilized by the end of fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "What would be the effect of a 0.50% decrease in the expected long-term rate of return on 2024 combined pension and postretirement costs?",
        "response": "A 0.50% decrease in the expected long-term rate of return would cause the 2024 combined pension and postretirement costs to increase by $150.",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue of Alphabet Inc. in 2023?",
        "response": "$307.4 billion",
        "source": "finqa"
    },
    {
        "query": "What was the change in net cash provided by financing activities from 2022 to 2023?",
        "response": "Net cash provided by financing activities changed from $9,718 million in 2022 to -$15,879 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the limits on the federal reinsurance coverage under the Program for each TRIA year?",
        "response": "The federal reinsurance coverage under the Program has an aggregate limit of $100 billion for each TRIA year.",
        "source": "finqa"
    },
    {
        "query": "What is the function of Walmart Luminate?",
        "response": "Walmart Luminate offers a suite of data products for merchants and suppliers.",
        "source": "finqa"
    },
    {
        "query": "What measures have the European Union adopted to regulate pharmaceutical pricing and trade?",
        "response": "The European Union mandates pricing controls, permits parallel trade, and promotes generic substitution through directives and legislation.",
        "source": "finqa"
    },
    {
        "query": "What was Chipotle Mexican Grill's total revenue for the year 2023?",
        "response": "$9,871,649",
        "source": "finqa"
    },
    {
        "query": "How might the use of open-source software impact the company's ability to commercialize its products and services?",
        "response": "The use of open-source software could subject the company to litigation and impose unanticipated conditions or restrictions on its ability to commercialize its products and services.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the AMC Entertainment Visa Card launched in 2023?",
        "response": "The AMC Entertainment Visa Card allows cardholders to earn Stubs rewards points with every purchase, and extra points when making purchases at an AMC theatre, aiming to enhance customer loyalty and spending.",
        "source": "finqa"
    },
    {
        "query": "What changes has the company implemented in response to regulatory developments in Europe?",
        "response": "The company announced plans to switch the legal basis for behavioral advertising from 'legitimate interests' to 'consent' in Europe, offered a 'subscription for no ads' alternative, and is engaging with regulators on the new consent model.",
        "source": "finqa"
    },
    {
        "query": "What mechanisms does the company use to hedge foreign currency exposure for its Canadian subsidiary?",
        "response": "The company uses forward currency contracts to hedge a portion of the foreign currency exposure associated with the translation of its net investment in the Canadian subsidiary.",
        "source": "finqa"
    },
    {
        "query": "What type of information is included in Note 13 of the Annual Report on Form 10-K?",
        "response": "Information related to commitments and contingencies.",
        "source": "finqa"
    },
    {
        "query": "What types of products does the Canada operation offer?",
        "response": "The Canada operation offers a variety of products derived from credit information including credit reporting, monitoring and scoring, marketing products, risk management, fraud detection, identity management and authentication services, among others.",
        "source": "finqa"
    },
    {
        "query": "What was the net change in GameStop's cash, cash equivalents, and restricted cash from the beginning to the end of the financial period mentioned?",
        "response": "The net change was a decrease of $123.9 million.",
        "source": "finqa"
    },
    {
        "query": "What were the cash and cash equivalents at the end of 2023, and how did this figure change from the end of 2022?",
        "response": "At the end of 2023, the company had $29.09 billion in cash and cash equivalents and investments, marking an increase of $6.91 billion from the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the weighted average yield for held-to-meatrity securities as of December 2023 and how is it calculated?",
        "response": "The weighted average yield for held-to-maturity securities as of December 2023 is calculated on a pre-tax basis using the effective interest rate of each security at the end of the period, weighted based on the amortized cost of each security.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the Huatai Insurance Group Co. Ltd does Chubb Limited own as of July 1, 2023?",
        "response": "As of July 1, 2023, Chubb Limited owns approximately 76.5 percent of Huatai Insurance Group Co. Ltd.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Item 8 in a financial document?",
        "response": "Item 8 includes the Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What was the decrease in pre-tax earnings due to the $1.0 billion in IBNR liabilities?",
        "response": "The decrease in pre-tax earnings was approximately $1.0 billion.",
        "source": "finqa"
    },
    {
        "query": "What percentage reduction in carbon emissions did GameStop achieve in the United States in 2022?",
        "response": "In 2022, GameStop achieved a reduction in year over year carbon emissions in excess of 10% in the United States.",
        "source": "finqa"
    },
    {
        "query": "How much cash did acquisition activities use in 2023?",
        "response": "Acquisition activities used $765 million of cash in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is included in the cost of revenues for Google?",
        "response": "The cost of revenues includes Traffic Acquisition Costs (TAC) paid to distribution partners and Google Network partners primarily for ads displayed on their properties, and other costs like compensation expense related to data centers, content acquisition costs, depreciation expense of technical infrastructure, and costs related to the sale of devices.",
        "source": "finqa"
    },
    {
        "query": "What types of matters do the legal proceedings that the company may be involved in cover?",
        "response": "The legal proceedings that the company may be involved in cover antitrust and trade regulation, product liability, advertising, contracts, environmental issues, patent and trademark matters, labor and employment matters, and tax.",
        "source": "finqa"
    },
    {
        "query": "What significant accounting matter related to Delta Air Lines' employee benefit plans was addressed in the 2023 audit?",
        "response": "The significant accounting matter addressed was the estimation of the fair value of employee benefit plan assets, particularly those measured at Net Asset Value (NAV), which required significant judgment due to the lag in data availability from investment fund managers.",
        "source": "finqa"
    },
    {
        "query": "How did the fluctuation in foreign currency exchange rates impact the consolidated net operating revenues in 2023?",
        "response": "It decreased by 4%",
        "source": "finqa"
    }
]