[
    {
        "query": "What strategic collaborations did Gilead enter to expand its research and development portfolio?",
        "response": "Gilead entered strategic collaborations with companies like Arcellx Inc. and Tentarix Biotherapeutics Inc. to co-develop and co-commercialize late-stage clinical assets and discover and develop novel therapies across oncology and inflammation using proprietary platforms.",
        "source": "finqa"
    },
    {
        "query": "What was the total alternative assets value for Goldman Sachs as of December 2023?",
        "response": "$485 billion",
        "source": "finqa"
    },
    {
        "query": "How much cash and how many shares of Broadcom common stock did VMware stockholders receive upon completion of the VMware Merger in November 2023?",
        "response": "Upon the completion of the VMware Merger, VMware stockholders received approximately $30.8 billion in cash and 54.4 million shares of Broadcom common stock in aggregate.",
        "source": "finqa"
    },
    {
        "query": "What is the total crude capacity of the GS Caltex Yeosu Refinery in South Korea?",
        "response": "800,000 barrels per day",
        "source": "finqa"
    },
    {
        "query": "How does Optum Health enhance its health care delivery?",
        "response": "Optum Health enhances health care delivery by building a comprehensive, connected health care delivery and engagement platform which includes high-quality direct care, chronic and complex health needs management, and proactive consumer health engagement through various platforms like in-person, in-home, virtual, and digital clinical services.",
        "source": "finqa"
    },
    {
        "query": "What were the reasons for declining equity in net income of affiliates and other income in 2023?",
        "response": "The decline in equity in net income of affiliates was mainly due to underperformance by DIRECTV, despite gains from a sale-leaseback transaction. Other income dropped because of actuarial remeasurement losses of pension assets, impairments, and reduced net pension and postretirement benefit credits.",
        "source": "finqa"
    },
    {
        "query": "What types of costs does Ford Motor Company include in its 'cost of sales' category?",
        "response": "Costs included in the 'cost of sales' category are material costs, freight costs, warranty and product recall costs, labor and other costs related to development and production, depreciation and amortization, and other associated costs.",
        "source": "finqa"
    },
    {
        "query": "How is Amazon's business organized operationally?",
        "response": "Amazon's business is organized into three operational segments: North America, International, and Amazon Web Services (AWS).",
        "source": "finqa"
    },
    {
        "query": "What are the typical initial terms of Hilton's management contracts?",
        "response": "20 to 30 years",
        "source": "finqa"
    },
    {
        "query": "What accounting method is used for the joint venture detailed in the summary?",
        "response": "The joint venture is accounted for as an equity method investment.",
        "source": "finqa"
    },
    {
        "query": "What condition does Synthroid treat and what type of drug is it formulated as?",
        "response": "Synthroid is formulated as levothyroxine sodium tablets and is used in the treatment of hypothyroidism.",
        "source": "finqa"
    },
    {
        "query": "What is the Company's procedure when it determines that an unrealized loss on a debt security is due to market conditions or industry-related events?",
        "response": "The Company assesses whether it intends to sell the debt security or if it is likely that it will need to sell the debt security before the anticipated recovery of the amortized cost basis. If so, it recognizes a non-credit related impairment and writes down the cost basis or carrying amount to fair value.",
        "source": "finqa"
    },
    {
        "query": "What is the accounting treatment of deferred revenue?",
        "response": "Deferred revenue is recognized when there is an obligation to transfer goods or services to a customer and consideration has already been received from the customer.",
        "source": "finqa"
    },
    {
        "query": "What was the value of estimated variable consideration in HP Inc.'s consolidated balance sheets as of October 31, 2023?",
        "response": "$3.1 billion",
        "source": "finqa"
    },
    {
        "query": "What is the interest rate for the 4.500% notes due in August 2034?",
        "response": "4.55%",
        "source": "finqa"
    },
    {
        "query": "What led to the decrease in net cash provided by operating activities in fiscal year 2023?",
        "response": "The decrease in net cash provided by operating activities was due to lower earnings before taxes, working capital management activities, and changes in receivables from contract manufacturers.",
        "source": "finqa"
    },
    {
        "query": "What is a paid membership as defined in the provided context?",
        "response": "A paid membership is defined as a membership that has provided a payment method, is not in a free trial or certain promotions, and has the right to receive service from the company.",
        "source": "finqa"
    },
    {
        "query": "What are the specific structures and legal considerations for a management services organization (MSO) in relation to its relationship with physician owners?",
        "response": "Management services organizations (MSOs) must structure their fees to comply with state fee splitting laws and often use stock transfer restriction agreements and/or other relationships to maintain a 'friendly' relationship with physician owners of the professional corporation.",
        "source": "finqa"
    },
    {
        "query": "What was the valuation allowance against deferred tax assets at the end of 2023, and what changes may affect its realization?",
        "response": "The valuation allowance against deferred tax assets was $7.0 billion at the end of 2023. Realization of these assets depends on generating sufficient taxable income within the provided tax periods, and changes in market conditions, governmental actions, or events could materially affect this.",
        "source": "finqa"
    },
    {
        "query": "Who are Visa's principal competitors in the electronic payments industry?",
        "response": "Visa's principal competitors in the electronic payment space include global or multi-regional networks like American Express, Discover, JCB, Mastercard, and UnionPay.",
        "source": "finqa"
    },
    {
        "query": "What documents follow the signature pages in the report?",
        "response": "The Financial Statements, the accompanying Notes to the Financial Statements, and the Financial Statement Schedule",
        "source": "finqa"
    },
    {
        "query": "How is the fair value of cash equivalents generally determined?",
        "response": "The fair value of cash equivalents is based on a market approach using prices generated by market transactions involving identical or comparable assets.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities in fiscal 2023?",
        "response": "The net cash provided by operating activities in fiscal 2023 was $7,111 million.",
        "source": "finqa"
    },
    {
        "query": "What are the primary types of merchandise offered by Walmart U.S.?",
        "response": "Walmart U.S. primarily offers groceries, general merchandise, and health and wellness products.",
        "source": "finqa"
    },
    {
        "query": "What was the net investment income in 2023 according to the provided data?",
        "response": "$4,937 million",
        "source": "finqa"
    },
    {
        "query": "What was the revenue growth for the integrated kidney care (IKC) business in 2023?",
        "response": "35.2%",
        "source": "finqa"
    },
    {
        "query": "By what percentage did admissions revenues increase during the year ended December 31, 2023 compared to the prior year?",
        "response": "22.7%",
        "source": "finqa"
    },
    {
        "query": "By how much did domestic distribution revenue excluding the Olympics change from 2021 to 2023?",
        "response": "Domestic distribution revenue excluding the Olympics increased from $9,558 million in 2021 to $10,663 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What factors had the largest positive impact on the company's net operating revenues for 2023?",
        "response": "Price, product, and geographic mix",
        "source": "finqa"
    },
    {
        "query": "What were the primary drivers behind the increase in product development expenses in 2023?",
        "response": "The increase in product development expenses in 2023 was primarily driven by an increase in employee related costs as the company continued to innovate and modernize the shopping experience across its platforms.",
        "source": "finqa"
    },
    {
        "query": "What is Biktarvy used for?",
        "response": "Biktarvy is used for the treatment of HIV-1 infection in certain patients.",
        "source": "finqa"
    },
    {
        "query": "What is the revenue recognition method for Marketplace Sales at Chipotle?",
        "response": "Chipotle recognizes revenue for Marketplace Sales when control of the food is transferred to the delivery partner, excluding delivery fees collected by the delivery partner.",
        "source": "finqa"
    },
    {
        "query": "What are the two distinct business segments into which Humana realigned its businesses?",
        "response": "Insurance and CenterWell",
        "source": "finqa"
    },
    {
        "query": "How does the company define comparable sales?",
        "response": "Comparable sales is defined by the company as including comparable company-operated store and all e-commerce net revenue, but excluding sales from new stores that have not been open for at least 12 full fiscal months, from stores which have not been in their significantly expanded space for at least 12 full fiscal months, from stores which have been temporarily relocated for renovations or temporarily closed, and sales from company-operated stores that have closed.",
        "source": "finqa"
    },
    {
        "query": "What are the factors that significantly affect the sales and earnings of a vehicle manufacturer?",
        "response": "The factors that significantly affect the sales and earnings of a vehicle manufacturer include the ability to satisfy changing consumer and business preferences regarding the type or size of vehicle, design and performance characteristics, and the services offered by the vehicles.",
        "source": "finqa"
    },
    {
        "query": "How did the assumptions and estimates used for assessing the fair value of reporting units potentially impact the company's financial statements?",
        "response": "If the assumptions and estimates used in the fair value assessment of reporting units change, this could lead to a required write-down of the carrying value of Goodwill, which might significantly affect the results of operations in the period when the charge is recorded.",
        "source": "finqa"
    },
    {
        "query": "Which year's Proxy Statement includes information regarding executive compensation?",
        "response": "The 2023 Proxy Statement includes information regarding executive compensation.",
        "source": "finqa"
    },
    {
        "query": "Under what captions is the executive compensation information detailed in the 2023 Proxy Statement?",
        "response": "In the 2023 Proxy Statement, the executive compensation information is detailed under the captions 'Executive Compensation', 'Compensation Committee Interlocks and Insider Participation', 'Director Compensation', and 'Compensation Committee Report'.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities in 2023?",
        "response": "Net cash provided by operating activities in 2023 amounted to $11,068.",
        "source": "finqa"
    },
    {
        "query": "What new financial program was announced on February 1, 2024, and what are its specifics?",
        "response": "On February 1, 2024, the initiation of the first ever cash dividend program was announced, with a quarterly dividend of $0.50 per share, equivalent to $2.00 per share annually.",
        "source": "finqa"
    },
    {
        "query": "What total proceeds did Kenvue raise through its initial public offering in May 2023?",
        "response": "$4.2 billion",
        "source": "finqa"
    },
    {
        "query": "What does the Infrastructure Investment and Jobs Act direct the FCC to adopt rules on?",
        "response": "The Infrastructure Investment and Jobs Act directs the FCC to adopt rules facilitating equal access to broadband service by preventing digital discrimination based on factors such as income level, race, or ethnicity.",
        "source": "finqa"
    },
    {
        "query": "How does the GDPR penalize non-compliance in terms of fines?",
        "response": "Under the GDPR, regulatory penalties can reach up to the greater of 4% of worldwide turnover or €20 million.",
        "source": "finqa"
    },
    {
        "query": "What role does Chubb's Chief Risk Officer play in the company's executive structure?",
        "response": "Chubb's Chief Risk Officer reports to the Board's Risk & Finance Committee, which helps execute the Board's supervisory responsibilities pertaining to Enterprise Risk Management (ERM).",
        "source": "finqa"
    },
    {
        "query": "What is the depreciation expense of property and equipment for the year ended December 31, 2023?",
        "response": "$1.1 billion",
        "source": "finqa"
    },
    {
        "query": "When did Carla C. Chavarria start serving as Senior Vice President, Chief Human Resources Officer at AMC?",
        "response": "January 2019",
        "source": "finqa"
    },
    {
        "query": "What amount of commercial paper was outstanding as of September 30, 2023?",
        "response": "$6.0 billion",
        "source": "finqa"
    },
    {
        "query": "When did the injunctive relief ordered in the MDL concerning prescription opiates go into effect?",
        "response": "February 20, 2023",
        "source": "finqa"
    },
    {
        "query": "How does AutoZone manage its foreign operations in terms of currency?",
        "response": "AutoZone accounts for its foreign operations using the local market currency and converts its financial statements from these currencies to U.S. dollars.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage of total level 3 financial liabilities relative to total financial liabilities at fair value for the year 2023?",
        "response": "4.5%",
        "source": "finqa"
    },
    {
        "query": "When was AT&T Inc. incorporated and under which state's laws?",
        "response": "AT&T Inc. was incorporated under the laws of the State of Delaware in 1983.",
        "source": "finqa"
    },
    {
        "query": "What was the net income of The Hershey Company for the year ending December 31, 2023?",
        "response": "$1,861,787,000",
        "source": "finqa"
    },
    {
        "query": "What was the fiscal year 2023 percentage for research and development expenses as a percent of revenue?",
        "response": "The research and development expenses represented 27.2% of revenue in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the Company's effective tax rate for the year ended August 26, 2023?",
        "response": "20.2%",
        "source": "finqa"
    },
    {
        "query": "Is there a cost to access reports filed by Intuit Inc. with the SEC?",
        "response": "No, there is no cost to access reports filed by Intuit Inc. with the SEC; they are available free of charge on the Investor Relations section of their corporate website.",
        "source": "finqa"
    },
    {
        "query": "What products are included in AbbVie’s aesthetics portfolio and where do they hold market-leading positions?",
        "response": "AbbVie’s aesthetics portfolio includes facial injectables, plastics and regenerative medicine, body contouring, and skincare products. They hold market-leading positions in the U.S. and in key markets around the world.",
        "source": "finqa"
    },
    {
        "query": "How many times did the Federal Reserve raise the Fed Funds rate in 2022?",
        "response": "seven times",
        "source": "finqa"
    },
    {
        "query": "What growth strategies are pursued by the Small Business & Self-Employed segment?",
        "response": "They focus on growing the core by transforming financial management software, connecting the ecosystem by meeting a range of customer needs with a single integrated platform, and expanding globally.",
        "source": "finqa"
    },
    {
        "query": "Where in IBM’s 2023 Form 10-K can the Financial Statement Schedule be found?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What types of requirements do some jurisdictions have in place regarding beverage containers?",
        "response": "Various jurisdictions require that deposits or certain ecotaxes or fees be charged in connection with the sale, marketing, and use of certain beverage containers.",
        "source": "finqa"
    },
    {
        "query": "What types of intellectual property rights does Nike maintain?",
        "response": "Nike holds a variety of intellectual property rights including trademarks, copyrights, utility and design patents, and trade secrets that protect aspects such as product designs, technologies, manufacturing processes, and marketing.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's U.S. employees had a retention rate of approximately 90% in 2023?",
        "response": "In 2023, approximately 90% of the company's U.S. employees who have been with the company for at least one year had a retention rate of about 90%.",
        "source": "finqa"
    },
    {
        "query": "What new compliance requirement was established by the CFPB's final rule issued on March 30, 2023, regarding small business credit applications?",
        "response": "The CFPB's final rule issued on March 30, 2023, requires covered financial institutions to collect and report data regarding certain small business credit applications.",
        "source": "finqa"
    },
    {
        "query": "What is the operational name of the Indian Regional Navigation Satellite System used by Garmin?",
        "response": "NavIC",
        "source": "finqa"
    },
    {
        "query": "How is Note 8 relevant to legal proceedings in financial statements detailed in an Annual Report on Form 10-K?",
        "response": "Note 8 is relevant to legal proceedings as it details commitments and contingencies related to such matters in the financial statements within an Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the net impact of catastrophe losses and related adjustments in 2021?",
        "response": "The net impact of catastrophe losses and related adjustments in 2021 was (2,401) million U.S. dollars.",
        "source": "finqa"
    },
    {
        "query": "What is ciltacabtagene autoleucel used for?",
        "response": "Ciltacabtagene autoleucel is used for the treatment of relapsed and refractory multiple myeloma with 1-3 prior lines of therapy.",
        "source": "finqa"
    },
    {
        "query": "How did the FedEx Ground segment's revenue change in 2023?",
        "response": "Increased by 1%",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of hedging programs in relation to foreign currency volatility?",
        "response": "Hedging programs are used to actively monitor foreign currency volatility and attempt to mitigate significant risks associated with it.",
        "source": "finqa"
    },
    {
        "query": "What was the net income (loss) attributable to Las Vegas Sands Corp. for the year 2023?",
        "response": "$1.60",
        "source": "finqa"
    },
    {
        "query": "How are the fair values of intangible assets determined in a business combination?",
        "response": "The fair values of intangible assets in a business combination are determined utilizing information available near the acquisition date, based on expectations and assumptions that are considered reasonable by management.",
        "source": "finqa"
    },
    {
        "query": "How does the corporation's future strategic direction on environmental transition impact its financial performance during the period discussed?",
        "response": "The climate-related initiatives did not result in a significant effect on the corporation's results of operations or financial position during the periods presented.",
        "source": "finqa"
    },
    {
        "query": "What was the total adjusted revenue for Delta Air Lines in 2023?",
        "response": "$54,669 million",
        "source": "finqa"
    },
    {
        "query": "What unique brand positions does GameStop leverage?",
        "response": "GameStop leverages its brand position and unique offerings in the gaming industry to attract partnerships, expand product offerings, and acquire new customers.",
        "source": "finqa"
    },
    {
        "query": "How did the penetration rate of GM Financial's retail sales in the U.S. change from 2022 to 2023?",
        "response": "The penetration rate of GM Financial's retail sales in the U.S. decreased slightly from 43% in 2022 to 42% in 2023.",
        "source": "finqa"
    },
    {
        "query": "Are AbbVie's corporate governance materials available to the public, and if so, where?",
        "response": "Yes, AbbVie's corporate governance materials are available to the public on AbbVie's investor relations website.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities in 2022?",
        "response": "$4.5 billion",
        "source": "finqa"
    },
    {
        "query": "How much common stock did eBay repurchase in 2023?",
        "response": "In 2023, eBay repurchased $1.4 billion of common stock.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the postretirement benefit plan actuarial assumptions?",
        "response": "The actuarial assumptions for postretirement benefit plans are influenced by market conditions, company policies, historical data, and demographic assumptions.",
        "source": "finqa"
    },
    {
        "query": "How are the financial statements and notes in the Annual Report on Form 10-K connected to Part IV?",
        "response": "They follow Part IV and are incorporated by reference into it.",
        "source": "finqa"
    },
    {
        "query": "What is the relationship of the consolidated financial statements to Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are included immediately following Part IV and are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did UnitedHealthcare's total revenues increase from 2022 to 2023?",
        "response": "13%",
        "source": "finqa"
    },
    {
        "query": "How did the Bank of America Corporation's capital ratios under Basel 3 compare at December 31, 2023 and 2022?",
        "response": "At December 31, 2023 and 2022, the Common equity tier 1 capital ratio was 11.8% and 11.2% respectively, the Tier 1 capital ratio was 13.5% and 13.0% respectively, and the Total capital ratio was 15.2% and 14.9% respectively.",
        "source": "finqa"
    },
    {
        "query": "What financial impact is expected from the accelerated retirement of 46 MD-11F aircraft and related engines in 2023 at FedEx Express?",
        "response": "The accelerated retirement is expected to result in a net increase of approximately $12 million in depreciation expense in 2024, with the expense impact in 2025 being immaterial.",
        "source": "finqa"
    },
    {
        "query": "What recent technological advancements has the company implemented in set-top box (STB) solutions?",
        "response": "The company has implemented High Efficiency Video Coding (HEVC) in set-top boxes, which enables ultra-high definition services by effectively doubling the capacity of existing networks to deploy new or existing content.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's 2023 product sales in the U.S. were from three large wholesalers?",
        "response": "Approximately 91%",
        "source": "finqa"
    },
    {
        "query": "What is included in the index mentioned in Item 8?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What was the total operating income for the Company’s segments in the year ended December 30, 2023?",
        "response": "$401 million",
        "source": "finqa"
    },
    {
        "query": "How much did the total payments volume growth rate for Visa Inc. change between 2021 and 2022?",
        "response": "9%",
        "source": "finqa"
    },
    {
        "query": "What was the change in the rate per contract for NYSE cash equities from 2022 to 2023?",
        "response": "increased by 6%",
        "source": "finqa"
    },
    {
        "query": "What caused the drop in gross margin in 2022 from 2021 levels?",
        "response": "The gross margin drop in 2022 was primarily caused by negative mark-to-market impacts from commodity derivative instruments and increased supply chain inflation, including higher logistics and labor costs. These were partially offset by favorable price realizations and volume increases.",
        "source": "finqa"
    },
    {
        "query": "How is mall net operating income (NOI) useful in evaluating mall operating performance?",
        "response": "Commercial property can be exempt from property tax for up to twelve years if the building is newly constructed in Cotai and also qualifies for Tourism Utility Status. The initial exemption is for the first six years.",
        "source": "finqa"
    },
    {
        "query": "What were the purchases of property and equipment, net of proceeds from sales and incentives, for the year ended December 31, 2023?",
        "response": "The purchases of property and equipment, net of proceeds from sales and incentives, for the year ended December 31, 2023, were -$48,133 million.",
        "source": "finqa"
    },
    {
        "query": "What is the primary regulatory authority for Chubb in Bermuda and what are its responsibilities?",
        "response": "The primary regulatory authority for Chubb in Bermuda is the Bermuda Monetary Authority (BMA), which has the power to supervise, investigate, and intervene in the affairs of insurance companies.",
        "source": "finqa"
    },
    {
        "query": "What was the deduction for net recoveries related to allowances for credit losses for the fiscal year ended October 31, 2023?",
        "response": "$12 million",
        "source": "finqa"
    },
    {
        "query": "What types of customers does HP sell to?",
        "response": "HP sells to individual consumers, small- and medium-sized businesses, and large enterprises, including customers in the government, health, and education sectors.",
        "source": "finqa"
    },
    {
        "query": "What impact did extending the amortization period for deferred acquisition and fulfillment contract costs have on AT&T's financials in 2022?",
        "response": "It decreased 'Other cost of revenues' by approximately $395 million, or $0.04 per diluted share from continuing operations for the year ended December 31, 2022.",
        "source": "finqa"
    },
    {
        "query": "What are AMD Radeon PRO graphics cards designed to optimize and for what use cases?",
        "response": "Design workloads for use cases such as 3D rendering, design and manufacturing for CAD, and media and entertainment for broadcast and animation pipelines on high resolution displays.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of stress testing at Bank of America?",
        "response": "The purpose of stress testing at Bank of America is to develop a comprehensive understanding of the potential impacts of on- and off-balance sheet risks on the corporation's financial resiliency. This assists in providing confidence to management, regulators, and investors.",
        "source": "finqa"
    },
    {
        "query": "What are the components of Amazon.com, Inc.'s consolidated financial statements for the years ending on December 31, 2023?",
        "response": "The components of Amazon.com, Inc.'s consolidated financial statements for the years ending on December 31, 2023, include consolidated balance sheets, consolidated statements of operations, consolidated statements of comprehensive income (loss), consolidated statements of stockholders' equity, and consolidated statements of cash flows.",
        "source": "finqa"
    },
    {
        "query": "What is the minimum amount of consolidated cash, cash equivalents, and U.S. Treasury Bills Berkshire aims to maintain?",
        "response": "Berkshire aims to maintain at least $30 billion in consolidated cash, cash equivalents, and U.S. Treasury Bills.",
        "source": "finqa"
    },
    {
        "query": "What was the total intrinsic value of options exercised in 2023, and how does it compare to the values in 2022 and 2021?",
        "response": "The total intrinsic value of options exercised in 2023 was $35,474, which shows a decrease when compared to $40,882 in 2022 and $38,645 in 2021.",
        "source": "finqa"
    },
    {
        "query": "What legal action did Janssen Pharmaceuticals, Inc. take regarding the Inflation Reduction Act?",
        "response": "Janssen filed litigation against the U.S. Department of Health and Human Services and the Centers for Medicare and Medicaid Services, challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program.",
        "source": "finqa"
    },
    {
        "query": "What was the guaranty fund contribution to ICE Clear Europe as of December 31, 2022?",
        "response": "$50 million",
        "source": "finqa"
    },
    {
        "query": "What does COPPA restrict and how does it affect the company's operations?",
        "response": "COPPA restricts the collection of information from children under the age of thirteen, placing limitations on the company regarding advertising to children and collecting data from them.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash and temporary cash investments at the end of 2022?",
        "response": "$1.0 billion",
        "source": "finqa"
    },
    {
        "query": "What was the amount of AT&T's currency translation adjustments reported in their investments in equity affiliates for the year 2023?",
        "response": "$61 million",
        "source": "finqa"
    },
    {
        "query": "Which operating systems received updates in the third quarter of 2023?",
        "response": "In the third quarter of 2023, updates were made to iOS 17, macOS Sonoma, iPadOS 17, tvOS 17, and watchOS 10.",
        "source": "finqa"
    },
    {
        "query": "How much did the net investment income change from 2021 to 2023?",
        "response": "Increased by 43.0%",
        "source": "finqa"
    },
    {
        "query": "What does 'Item 15. Exhibits and Financial Statement Schedules' include according to the report?",
        "response": "Exhibits and Financial Statement Schedules",
        "source": "finqa"
    },
    {
        "query": "How much did FedEx Express improve its vehicle fleet efficiency from a 2005 baseline by 2022?",
        "response": "40%",
        "source": "finqa"
    },
    {
        "query": "What were aggregate liabilities for unrecognized tax benefits as of January 29, 2023?",
        "response": "$643 million",
        "source": "finqa"
    },
    {
        "query": "How are collateral requirements for captive reinsurance companies managed?",
        "response": "Collateral requirements for captive reinsurance companies are generally managed by obtaining collateral equal to the expected losses that may be ceded to the captive. Exceptions to this requirement are granted only after senior management review.",
        "source": "finqa"
    },
    {
        "query": "What long-term effects do legislative, regulatory, and platform changes have on advertising revenue?",
        "response": "The company expects that legislative, regulatory, and platform changes will continue to adversely impact advertising revenue indefinitely.",
        "source": "finqa"
    },
    {
        "query": "How are net realized capital gains and losses treated in the financial statements according to the Company?",
        "response": "Net realized capital gains and losses, arising primarily from portfolio management, are recorded in the consolidated statements of operations in net investment income within each segment and are excluded from non-GAAP measures as they do not directly relate to the Company's core business operations.",
        "source": "finqa"
    },
    {
        "query": "What are the two business segments of Johnson & Johnson?",
        "response": "Innovative Medicine and MedTech",
        "source": "finqa"
    },
    {
        "query": "How much cash did Hasbro generate from operating activities in the year 2021?",
        "response": "$817.9 million",
        "source": "finqa"
    },
    {
        "query": "What factors led to the 7% decrease in U.S. Information Solutions revenue in 2022 compared to 2021?",
        "response": "The decrease was primarily due to the negative impact of declining mortgage inquiry volumes and a decline in marketing solutions, partially offset by growth in non-mortgage online services and acquisition-related revenue.",
        "source": "finqa"
    },
    {
        "query": "How much was the impairment related to the CAT loan receivable in 2023?",
        "response": "The impairment related to the CAT loan receivable was $16 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did net proceeds from the issuance of the 7% Notes due 2029 amount to in 2023?",
        "response": "$990,000",
        "source": "finqa"
    },
    {
        "query": "What was the total net revenue for the fiscal year 2023?",
        "response": "The total net revenue for fiscal year 2023 was $7,426 million.",
        "source": "finqa"
    },
    {
        "query": "What types of assets are classified under 'Earning Assets' in a financial context?",
        "response": "Earning Assets are classified as assets primarily comprising of total finance receivables net of unearned income, plus equipment on operating leases net of accumulated depreciation.",
        "source": "finqa"
    },
    {
        "query": "What was the effect of prior-period medical claims reserve development on the Insurance segment's benefit ratio in 2023?",
        "response": "Decreased the Insurance segment benefit ratio by approximately 90 basis points",
        "source": "finqa"
    },
    {
        "query": "How are legal proceedings described in the Annual Report?",
        "response": "Legal proceedings are described in Note 14 to the consolidated financial statements, which is part of Item 8 in the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "Where is the financial statement schedule in IBM's 2023 Form 10-K?",
        "response": "On page S-1.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily drove the increase in net cash provided by operating activities for fiscal 2023?",
        "response": "The increase in net cash provided by operating activities for fiscal 2023 was primarily due to moderated levels of inventory purchases, partially offset by a decline in operating income and the timing of certain payments.",
        "source": "finqa"
    },
    {
        "query": "How much cash collateral did AT&T receive on a net basis during 2023?",
        "response": "$220",
        "source": "finqa"
    },
    {
        "query": "How are the translation adjustments of foreign entity operations recorded in financial statements?",
        "response": "Translation adjustments are recorded in accumulated other comprehensive loss on the consolidated balance sheets.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in net earnings from 2022 to 2023?",
        "response": "12%",
        "source": "finqa"
    },
    {
        "query": "What steps has the company taken to manage cybersecurity risks?",
        "response": "The company operates an Information Security program designed to prevent, detect, track, and mitigate cyber incidents, which has detected and mitigated such incidents in the past.",
        "source": "finqa"
    },
    {
        "query": "What are the pre-tax and after-tax adjustments for goodwill and fixed asset impairment charges related to Vitacost.com?",
        "response": "$164",
        "source": "finqa"
    },
    {
        "query": "What is the primary role of NVIDIA's partner network in system design?",
        "response": "NVIDIA's partner network is primarily involved in designing, testing, and qualifying system designs that incorporate NVIDIA's platforms.",
        "source": "finqa"
    },
    {
        "query": "How much was the statutory federal income tax expense at 21% for the years ended December 30, 2023, December 31, 2022, and December 25, 2021?",
        "response": "The statutory federal income tax expense at 21% was $107 million for the year ended December 30, 2023, $252 million for the year ended December 31, 2022, and $772 million for the year ended December 25, 2021.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock did CSC repurchase during the year ended December 31, 2023, and what was the total cost?",
        "response": "CSC repurchased 37 million shares of its common stock for $2.8 billion during the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How do competitors of Apple primarily compete in the market?",
        "response": "Competitors primarily compete through aggressive pricing and very low cost structures, by imitating Apple's products and infringing on its intellectual property.",
        "source": "finqa"
    },
    {
        "query": "What were the dividend amounts declared by AT&T for its preferred and common shares in December 2022 and December 2023?",
        "response": "In December 2022 and December 2023, AT&T declared a quarterly preferred dividend of $36 and a quarterly common dividend of $0.2775 per share of common stock.",
        "source": "finqa"
    },
    {
        "query": "How is information about legal proceedings included in financial statements?",
        "response": "Information about legal proceedings is included as part of Note 14 in the Consolidated Financial Statements.",
        "source": "finqa"
    }
]