[
    {
        "query": "What were the key reasons mentioned for the increased price transparency in the valuation of certain financial instruments?",
        "response": "The key reasons for increased price transparency in the valuation of certain financial instruments included market evidence like market transactions and the fact that certain unobservable yield and duration inputs were no longer significant to their valuation.",
        "source": "finqa"
    },
    {
        "query": "What does Part I, Item 3 refer to in an Annual Report on Form 10-K?",
        "response": "Part I, Item 3 refers to the section that deals with Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "When was the first Chipotle restaurant opened and where?",
        "response": "The first Chipotle restaurant opened in Denver, Colorado in 1993.",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock were sold in fiscal 2021 under GameStop Corp.'s at-the-market equity offering programs?",
        "response": "34,000,000 shares",
        "source": "finqa"
    },
    {
        "query": "What methodology does the company use to recognize automotive sales revenue?",
        "response": "The company recognizes automotive sales revenue upon delivery to the customer, which is the point when control of a vehicle transfers.",
        "source": "finqa"
    },
    {
        "query": "What are the primary revenue sources for eBay?",
        "response": "eBay's primary revenue sources include final value fees, feature fees, fees to promote listings, payment service fees, listing fees, and store subscription fees from sellers on its platforms. Additionally, revenues come from the sale of advertisements, revenue sharing arrangements, and shipping fees.",
        "source": "finqa"
    },
    {
        "query": "What percentage of HP's external U.S. hires in fiscal year 2023 were racially or ethnically diverse?",
        "response": "45%",
        "source": "finqa"
    },
    {
        "query": "What achievements in diversity and inclusion has The Hershey Company accomplished?",
        "response": "The Hershey Company has achieved 1:1 pay equity for people of color and gender, and ranked high on lists by DiversityInc and Forbes for its diversity and inclusion efforts.",
        "source": "finqa"
    },
    {
        "query": "How did Berkshire respond to the U.K. leaving the EU in relation to its insurance operations?",
        "response": "In response to the U.K. leaving the EU, Berkshire Hathaway European Insurance DAC in Ireland was established to allow property and casualty insurance and reinsurance businesses to continue operating in the EU, and Berkshire maintained a substantial presence in London.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule for IBM’s 2023 Form 10-K be found?",
        "response": "on page S-1",
        "source": "finqa"
    },
    {
        "query": "How are Level 3 assets measured under fair value hierarchy?",
        "response": "Level 3 assets are measured using a discounted cash flow approach when they are impaired.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash, cash equivalents, and short-term investments as of June 30, 2023?",
        "response": "As of June 30, 2023, the total amount of cash, cash equivalents, and short-term investments was $111.3 billion.",
        "source": "finqa"
    },
    {
        "query": "What names do GameStop's stores and ecommerce sites operate under?",
        "response": "GameStop's stores and ecommerce sites operate primarily under the names GameStop®, EB Games®, and Micromania®.",
        "source": "finqa"
    },
    {
        "query": "What are the primary offerings to consumers through Amazon's online and physical stores?",
        "response": "Amazon offers a vast selection of products, competitive pricing, and focuses on convenience in its online and physical stores.",
        "source": "finqa"
    },
    {
        "query": "How much did Electronic Arts spend on share repurchases during the fiscal year ending March 31, 202ustomed_shantions 2023?",
        "response": "$1,295 million",
        "source": "finqa"
    },
    {
        "query": "How much did the company pay in cash dividends during fiscal year 2023?",
        "response": "The company paid $7,645 million in cash dividends during fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Item 8 in a financial document?",
        "response": "Item 8 provides the Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What methods does the company use to advertise its products?",
        "response": "The company uses digital marketing, social media, and television to advertise its products. Products are cross-promoted by featuring specific items alongside related offerings to enhance sales of both the featured and complementary products.",
        "source": "finqa"
    },
    {
        "query": "What were the total intrinsic values of options exercised in 2021, 2022, and 2023?",
        "response": "$41 million in 2021, $28 million in 2022, and $25 million in 2023",
        "source": "finqa"
    },
    {
        "query": "What approaches does the company use to analyze goodwill for potential impairment in the quantitative impairment test?",
        "response": "The company uses the market approach, or a combination of the income and market approaches, to analyze goodwill for potential impairment in the quantitative impairment test.",
        "source": "finqa"
    },
    {
        "query": "What position has Brian T. Olsavsky held at Amazon since June 2015?",
        "response": "Senior Vice President and Chief Financial Officer",
        "source": "finqa"
    },
    {
        "query": "How is information about commitments and contingencies presented in the Annual Report on Form 10-K?",
        "response": "It is incorporated by reference under Note 13 in Item 3.",
        "source": "finqa"
    },
    {
        "query": "How much did the company's royalty-related assets amount to as of March 31, 2022 and 2023?",
        "response": "As of March 31, 2022, the royalty-related assets were $63 million, and as of March 31, 2023, they were $136 million.",
        "source": "finqa"
    },
    {
        "query": "What is the impact of structural changes on the unit case volume and concentrate sales volume of the company on a consolidated basis or at the geographic operating segment level?",
        "response": "Typically, structural changes do not impact the company's unit case volume or concentrate sales volume on a consolidated basis or at the geographic operating segment level.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of QuickBooks Self-Employed?",
        "response": "To help self-employed individuals maintain preparedness for tax time by categorizing business and personal transactions, tracking mileage, and calculating estimated taxes.",
        "source": "finqa"
    },
    {
        "query": "How many steel fabrication plants does W&W|AFCO operate across the U.S.?",
        "response": "W&W|AFCO operates 19 steel fabrication plants located across the U.S.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the funding and liquidity risk management process?",
        "response": "The purpose of the funding and liquidity risk management process is to ensure that the company can meet its ongoing financial and business obligations at a reasonable cost as they become due.",
        "source": "finqa"
    },
    {
        "query": "How much were lease obligations related to office space and other facilities as of June 30, 2023, and what were the terms?",
        "response": "As of June 30, 2023, lease obligations related to office space, warehouses, retail locations, production studios, and equipment totaled $883.1 million. The original lease terms range between one and 21 years, with most agreements renewable at the end of the period.",
        "source": "finqa"
    },
    {
        "query": "When did AT&T first become a publicly traded company?",
        "response": "AT&T first became a publicly traded company on January 1, 1984, after being spun-off from ATTC.",
        "source": "finqa"
    },
    {
        "query": "What action did the FTC take against the Company in relation to its money transfer services on June 28, 2022?",
        "response": "On June 28, 2022, the FTC filed a complaint against the Company in the U.S. District Court for the Northern District of Illinois, alleging violations of the Federal Trade Commission Act and the Telemarketing Sales Rule regarding its money transfer services, and requested non-monetary relief and civil penalties.",
        "source": "finqa"
    },
    {
        "query": "How do future changes in judgments and estimates regarding uncertain tax positions affect income?",
        "response": "Future changes in judgments and estimates related to uncertain tax positions affect income in the quarter the changes occur.",
        "source": "finqa"
    },
    {
        "query": "How are legal proceedings mentioned in the company's Annual Report structured?",
        "response": "Information on legal proceedings is primarily detailed in Item 3 and further elaborated in Note 4 under 'Contingencies' and within 'Item 1A. Risk Factors' on specific pages discussing implications and product recall strategies.",
        "source": "finqa"
    },
    {
        "query": "What factors influence the competition among Benjamin Moore's products?",
        "response": "The competition is influenced by product quality, product innovation, breadth of product line, technical expertise, service, and price.",
        "source": "finqa"
    },
    {
        "query": "What does the company report in Item 8, Part II of its Annual Report on Form 10-K?",
        "response": "In Item 8, Part II of its Annual Report on Form 10-K, the company reports on commitments and contingencies including legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What are some components of the described company's growth strategy in the dialysis market?",
        "response": "Significant components of the company's growth strategy include acquisitions, developing new outpatient dialysis centers, maintaining referral source relationships, and patient retention.",
        "source": "finqa"
    },
    {
        "query": "What new consumer duty became effective in July 2023 in the U.K.?",
        "response": "The Consumer Duty, which encompasses requirements on the types of products and services offered to consumers, how to balance value and pricing for consumers, and how to promote good consumer understanding and post-sale support.",
        "source": "finqa"
    },
    {
        "query": "Where can detailed information about certain legal proceedings be found in a 10-K filing?",
        "response": "In Item 8 of Part II, as indicated in Note 16 described in Item 3.",
        "source": "finqa"
    },
    {
        "query": "What strategies does the company plan to use to compete in the market for delivering self-driving technologies and other features?",
        "response": "The company plans to compete by making progress on Autopilot, FSD, neural network capabilities, expanding the Supercharger network, and enhancing infotainment offerings.",
        "source": "finqa"
    },
    {
        "query": "What section of the document is labeled 'Item 8'?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "Why is offering low prices to customers considered fundamental to the company's success?",
        "response": "Offering low prices is considered fundamental to the company's success because it drives customer satisfaction and loyalty, helping to sustain and grow the business.",
        "source": "finqa"
    },
    {
        "query": "What is referred to by Item 8 in the context of a document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What was the reason for Salesforce changing its corporate name in March 2022?",
        "response": "Salesforce changed its corporate name from salesforce.com, inc. to Salesforce, Inc. in March 2022.",
        "source": "finqa"
    },
    {
        "query": "How did R&D expenses change in fiscal year 2023, and what were the reasons?",
        "response": "R&D expenses decreased by 4.5% in fiscal year 2023, mainly due to disciplined cost management and higher R&D partner funding, partially offset by the Poly acquisition.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's workforce reported their race/ethnicity as White in 2023?",
        "response": "47%",
        "source": "finqa"
    },
    {
        "query": "What strategic focus does Etsy have for its marketplace?",
        "response": "Etsy's strategic focus for its marketplace includes building a sustainable competitive advantage, growing the marketplace in six core geographies and globally, and leveraging their marketplace playbook across their 'House of Brands'.",
        "source": "finqa"
    },
    {
        "query": "What factors are difficult to isolate and quantify regarding their impacts on the results of the company's operations?",
        "response": "Macroeconomic factors like inflation, interest rates changes, significant capital market and supply chain volatility, as well as global economic and geopolitical developments, are difficult to isolate and quantify in terms of their impact on the company's operations.",
        "source": "finqa"
    },
    {
        "query": "Who was the independent registered public accounting firm for the firm's financial statements as of February 16, 2024?",
        "response": "PricewaterhouseCoopers LLP",
        "source": "finqa"
    },
    {
        "query": "What was the quarterly dividend declared by Bank of America's board of directors on January 31, 2024?",
        "response": "$0.24 per share",
        "source": "finqa"
    },
    {
        "query": "What principle did Google's founders emphasize about the company in their original letter?",
        "response": "Google's founders emphasized that Google is not a conventional company and does not intend to become one.",
        "source": "finqa"
    },
    {
        "query": "What are the key factors contributing to Apple's success in competition?",
        "response": "Key factors contributing to Apple's success include price, product and service features (including security features), relative price and performance, product and service quality and reliability, design innovation, a strong third-party software and accessories ecosystem, marketing and distribution capability, service and support, and corporate reputation.",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in estimating rebates and chargebacks for healthcare products?",
        "response": "Estimates for rebates and chargebacks are based on product sales, expected payer mix, discount rates, product mix and pricing, historical and estimated payer mix, statutory discount requirements and contractual terms, historical claims experience and processing time lags, estimated patient population, known market events or trends, market research, channel inventory data, and other pertinent internal or external information.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of deferred revenue for products and services as of January 29, 2023?",
        "response": "$2.0 billion",
        "source": "finqa"
    },
    {
        "query": "What is the maturity date for the amended 2019 Secured Facility with Intuit?",
        "response": "July 20, 2026",
        "source": "finqa"
    },
    {
        "query": "What are some potential consequences for a company if it fails to comply with CMS or state regulations regarding Medicaid and dual eligible programs?",
        "response": "The company may face fines, withheld payments, demands for premium and other refunds, termination of contracts, denial of new contracts or non-renewal of existing ones, prohibitions on marketing or enrolling members in certain programs, exclusions from Medicaid or dual eligible programs, and other sanctions or civil monetary penalties.",
        "source": "finqa"
    },
    {
        "query": "What was the total provision for income taxes at the end of 2023?",
        "response": "$836 million",
        "source": "finqa"
    },
    {
        "query": "What is the focal area of investment for the technical infrastructure mentioned?",
        "response": "The focal area of investment for the technical infrastructure includes making significant investments in technology to improve existing products and services, develop new ones, and protect the security, privacy, and integrity of the platform.",
        "source": "finqa"
    },
    {
        "query": "What types of specialized storage services does Iron Mountain offer?",
        "response": "Iron Mountain offers specialized storage services including secure shredding of used documents, storing and handling of fine arts, and consumer storage solutions that leverage data analytics for customer acquisition.",
        "source": "finqa"
    },
    {
        "query": "What is the total number of accounts that defaulted after being modified as TDRs in 2022?",
        "response": "18 thousand accounts",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements listed in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are listed in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What action did the U.S. Department of Justice take in relation to the antitrust allegations against Delta, American, United, and Southwest airlines?",
        "response": "The U.S. Department of Justice served civil investigative demands on the airlines seeking documents and information regarding the alleged conspiracy to restrain capacity.",
        "source": "finqa"
    },
    {
        "query": "What was the carrying value of the French Term Loans as of January 28, 2023?",
        "response": "$39.5 million",
        "source": "finqa"
    },
    {
        "query": "What was the total of future interest payments associated with the senior notes as of January 29, 2023?",
        "response": "$24.9 billion",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in net premiums written in 2023?",
        "response": "The increase was primarily driven by growth in commercial and consumer lines, consolidation of Huatai Group's P&C business, and acquisition of Cigna's business in Asia.",
        "source": "finqa"
    },
    {
        "query": "What accounting method is predominantly used to determine inventory costs in the Company's supermarket divisions before LIFO adjustments?",
        "response": "The item-cost method is predominantly used to determine inventory costs in the Company's supermarket divisions before LIFO adjustments.",
        "source": "finqa"
    },
    {
        "query": "How did the loss on certain U.S. affiliates impact the Company's effective tax rate in the fiscal fourth quarter of 2021?",
        "response": "The loss on certain U.S. affiliates reduced the Company's effective tax rate by approximately 1.6% in the fiscal fourth quarter of 2021.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in U.S. sales of the COVID-19 vaccine from 2022 to 2023?",
        "response": "There was a complete cessation of U.S. sales from $120 million in 2022 to $0 in 2023, representing a 100% decrease.",
        "source": "finqa"
    },
    {
        "query": "What was the total operating revenue for AT&T Inc. in 2023?",
        "response": "$83,982 million",
        "source": "finqa"
    },
    {
        "query": "How are non-GAAP financial measures justified for aiding investors according to the document?",
        "response": "Non-GAAP financial measures are justified as they provide additional insight into operational performance and help clarify trends affecting the business, aiding investors.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of share repurchases made by the company in 2023?",
        "response": "The total amount of share repurchases made by the company in 2023 was $7.4 billion.",
        "source": "finqa"
    },
    {
        "query": "How does Enphase Energy, Inc. manage compliance with various international laws and regulations?",
        "response": "Enphase Energy, Inc. adheres to a patchwork of federal, state, regional, local, and international laws and regulations governing trade and customs, tax, and import operations, ensuring compliance through continuous monitoring and adaptation to changes.",
        "source": "finqa"
    },
    {
        "query": "What total number of theatre screens did AMC Entertainment Holdings, Inc. operate at the end of the most recent year?",
        "response": "11,041",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Affordable Connectivity Program (ACP) and how much can qualifying customers receive to assist with their internet bill?",
        "response": "The purpose of the Affordable Connectivity Program (ACP) is to provide a monthly, low-income broadband benefit to assist with internet bills, where qualifying customers can receive up to thirty dollars per month or seventy-five dollars for those on Tribal lands.",
        "source": "finqa"
    },
    {
        "query": "What do asset impairment charges consist of?",
        "response": "Asset impairment charges consist of non-cash charges related to the impairment of goodwill, finite-lived intangible assets, and other long-lived assets.",
        "source": "finqa"
    },
    {
        "query": "How are government incentives treated in accounting according to the given information?",
        "response": "Government incentives are accounted for as a reduction of expense, a reduction of the cost of the capital investment or as other income, depending on the substance of the incentive received. Benefits are generally recorded when there is reasonable assurance of receipt or upon the generation of advanced manufacturing production credits.",
        "source": "finqa"
    },
    {
        "query": "What is the revenue recognition policy for the company's sales of concentrates, syrups, and finished products?",
        "response": "The company recognizes revenue when performance obligations under the terms of the contracts with customers are satisfied. The control of the products is transferred upon shipment to, or receipt at, the customers' locations, as determined by the specific terms of the contract. Revenue is recognized upon the transfer of control to the customer.",
        "source": "finqa"
    },
    {
        "query": "How does Intuit ensure equitable treatment within its workforce?",
        "response": "Intuit practices equitable treatment by conducting pay equity analyses twice a year with independent, third-party vendors, being transparent about the results and providing avenues for employee queries regarding their pay.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of the company's net operating loss and capital loss carryforwards as of January 31, 2023?",
        "response": "Approximately $32.3 billion",
        "source": "finqa"
    },
    {
        "query": "What does T&E spend represent in a corporate financial context?",
        "response": "T&E spend represents expenditures on travel and entertainment, which primarily includes costs related to airline tickets, cruise bookings, lodging accommodations, and dining.",
        "source": "finqa"
    },
    {
        "query": "What was the effect on net cash used in financing activities in fiscal 2023 due to the repayments of long-term debt and related payments?",
        "response": "The decrease is primarily due to repayments of long-term debt and related payment of premiums for the early extinguishment of certain notes in the prior fiscal period, partially offset by the equity funding from the sale of subsidiary stock in the prior fiscal period.",
        "source": "finqa"
    },
    {
        "query": "How much did the deferred income taxes, net, change from January 29, 2022, to January 28, 2023?",
        "response": "An increase from $987.2 million to $1,105.7 million",
        "source": "finqa"
    },
    {
        "query": "What are the key components of cost of net revenues?",
        "response": "Cost of net revenues includes costs related to customer support, site operations, payment processing, employee compensation, contractor and facilities costs, depreciation of equipment, bank transaction fees, and digital services tax.",
        "source": "finqa"
    },
    {
        "query": "What governs the treatment of goods or services that are not distinct within a contractual arrangement?",
        "response": "Goods or services that are not distinct within a contractual arrangement are combined with other non-distinct goods or services and treated as a single performance obligation. The transaction price is then allocated to each performance obligation based on the relative standalone selling price.",
        "source": "finqa"
    },
    {
        "query": "What method is primarily used to estimate the fair value of each reporting unit?",
        "response": "The fair value of each reporting unit is primarily estimated through the use of a discounted cash flow methodology.",
        "source": "finqa"
    },
    {
        "query": "What drove the increase in cost of sales for The Hershey Company from 2022 to 2023?",
        "response": "The cost of sales for The Hershey Company increased by $246.7 million in 2023 due to higher supply chain costs, such as labor and unfavorable mark-to-market activity on commodity derivatives, partially offset by favorable supply chain productivity and price realization.",
        "source": "finqa"
    },
    {
        "query": "Under what conditions is the unrecognized tax benefit liability and income tax expense adjusted?",
        "response": "The unrecognized tax benefit liability and income tax expense are adjusted when the uncertain tax position is effectively settled, the statute of limitations expires for the relevant taxing authority to examine the tax position, or when new information becomes available.",
        "source": "finqa"
    },
    {
        "query": "Can the company predict the outcome of its legal suits with certainty?",
        "response": "No, the company cannot predict the outcome of the legal suits with certainty.",
        "source": "finqa"
    },
    {
        "query": "What effect would a 25 basis point decrease in discount rate have on the 2024 Pension Expense for U.S. Plans?",
        "response": "A 25 basis point decrease in the discount rate would have a $58 negative impact on the 2024 Pension Expense for U.S. Plans.",
        "source": "finqa"
    },
    {
        "query": "What principles do HP's Consolidated Financial Statements adhere to?",
        "response": "United States generally accepted accounting principles (GAAP).",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the translation of a stronger U.S. dollar on gross profit in fiscal 2022?",
        "response": "Translation impact of a stronger U.S. dollar partially offset the increase in gross profit",
        "source": "finqa"
    },
    {
        "query": "What was the total sales increase percentage for The Kroger Co. in 2022 compared to 2021?",
        "response": "7.5%",
        "source": "finqa"
    },
    {
        "query": "How much was the income tax benefit recognized for the fiscal year ended December 30, 2023?",
        "response": "The income tax benefit recognized for the fiscal year ended December 30, 2023 was $89.3 million.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in amortization expense in 2023?",
        "response": "The increase in amortization expense in 2023 was partially offset by the full amortization of certain intangible assets and certain software project costs, but was driven by new software additions.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Intelligent Edge net revenue in fiscal 2023 compared to fiscal 2022?",
        "response": "41.6%",
        "source": "finqa"
    },
    {
        "query": "How is goodwill recorded in the balance sheets and tested for impairment according to the principles described?",
        "response": "Goodwill is recorded in other assets on the consolidated balance sheets and is not amortized. Instead, it is subject to an annual impairment test. This impairment test is performed on the first day of the fourth quarter each year, or more frequently if circumstances indicate that the fair value of the reporting unit may have fallen below its carrying amount.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of the aggregate transaction for acquiring Black Knight, Inc. by ICE in 2023?",
        "response": "The total value of the aggregate transaction for acquiring Black Knight, Inc. by ICE in 2023 was approximately $11.8 billion.",
        "source": "finqa"
    },
    {
        "query": "How much non-cash impairment losses were recognized on theaters in international markets in 2022?",
        "response": "$59.7 million",
        "source": "finqa"
    },
    {
        "query": "What is the total number of countries and territories served by Delta and its alliance partners as of 2023?",
        "response": "Over 130",
        "source": "finqa"
    },
    {
        "query": "How did the International segment's revenue performance in fiscal 2023 compare to fiscal 2022, despite COVID-19 impacts?",
        "response": "The International segment's revenue grew by 8% in fiscal 2023 compared to fiscal 2022, despite COVID-19 related challenges in China during the first half of the year.",
        "source": "finqa"
    },
    {
        "query": "What item number discusses Legal Proceedings in the context of consolidated financial statements?",
        "response": "Item 3",
        "source": "finqa"
    },
    {
        "query": "What content does Item 8 cover in the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What principles does Starbucks formulate to support global pay equity?",
        "response": "Starbucks has formulated pay-equity principles that provide equal footing, transparency, and accountability, focusing on addressing known, systemic barriers to global pay equity.",
        "source": "finqa"
    },
    {
        "query": "What financial derivatives did Alphabet Inc. use as cash flow hedges, and what was the gross notional amount of these in 2023?",
        "response": "Alphabet Inc. used foreign exchange contracts as cash flow hedges, with a gross notional amount of $18,039 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the net income reported by the company for the fiscal year ended December 31, 2023?",
        "response": "The net income reported for the fiscal year ended December 31, 2023 was $217,375 thousand.",
        "source": "finqa"
    },
    {
        "query": "What percentage interest does Chevron hold in the Lianzi Unitization Zone in the Joint Development Area between Angola and Republic of Congo?",
        "response": "31.25 percent",
        "source": "finqa"
    },
    {
        "query": "What are the core principles guiding Microsoft's AI endeavors as mentioned in the text?",
        "response": "Microsoft's AI endeavors are guided by principles of fairness, reliability and safety, privacy and security, inclusiveness, transparency, and accountability.",
        "source": "finqa"
    },
    {
        "query": "How is adjusted debt to EBITDAR calculated?",
        "response": "Adjusted debt to EBITDAR is calculated as the sum of total debt, finance lease obligations, and annual rents times six, divided by net income plus interest, taxes, depreciation, amortization, rent, and share-based compensation expense.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Nights and Experiences Booked from 2022 to 2023?",
        "response": "Nights and Experiences Booked increased by 14% from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "How does the intellectual property support GM's operations?",
        "response": "GM's intellectual property supports its operations by protecting innovations crucial for continued technological development and operations.",
        "source": "finqa"
    },
    {
        "query": "How much did SG&A expenses increase in fiscal 2022?",
        "response": "$878 million",
        "source": "finqa"
    },
    {
        "query": "How many new aircraft did Delta Air Lines add to their fleet in 2023, and what was their fuel efficiency improvement over retired aircraft?",
        "response": "Delta Air Lines added 43 new aircraft to their fleet in 2023, which are on average 28% more fuel efficient per seat mile than the aircraft retired since 2019.",
        "source": "finqa"
    },
    {
        "query": "What programs does Amazon offer to sellers to help grow their businesses?",
        "response": "Amazon offers programs that allow sellers to grow their businesses, sell their products in Amazon's stores, and use Amazon's fulfillment services, through various fee models.",
        "source": "finqa"
    },
    {
        "query": "What percentage of total U.S. dialysis revenues were from outpatient services in 2023?",
        "response": "76%",
        "source": "finqa"
    },
    {
        "query": "What was the reported change in the value of the Mexican peso against the U.S. dollar from 2022 to 2023?",
        "response": "The Mexican peso strengthened from 1% in 2022 to 14% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the requirements for JPMorgan Chase as a large Bank Holding Company (BHC) under the Federal Reserve's CCAR framework?",
        "response": "JPMorgan Chase must conduct annual company-run stress tests, submit an annual capital plan considering separate stress tests by the Firm and the Federal Reserve, and file its annual CCAR submission on April 5, 2024.",
        "source": "finqa"
    },
    {
        "query": "In which ways does IBM compete in its industry?",
        "response": "IBM competes through technology innovation, performance, price, quality, brand, breadth of capabilities, products and services, talent, client relationships and trust, and its ability to deliver business value to clients.",
        "source": "finqa"
    },
    {
        "query": "What was the operating expenses as a percentage of total revenues in 2023?",
        "response": "15.3%",
        "source": "finqa"
    },
    {
        "query": "What drove the increase in general and administrative expenses for the year ended December 31, 2025?",
        "response": "The increase was primarily due to a $82 million rise in third-party expenses and a $78 million increase in personnel-related costs.",
        "source": "finqa"
    },
    {
        "query": "What was the net income of Electronic Arts Inc. for the fiscal year ended March 31, 2023?",
        "response": "$802 million",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in operating income for Procter & Gamble in 2023?",
        "response": "The increase in operating income for Procter & Gamble in 2023 was due to the increase in net sales, partially offset by a modest decrease in operating margin.",
        "source": "finqa"
    },
    {
        "query": "What factors primarily drove the flat research and development expenses as a percentage to sales in 2023?",
        "response": "Higher milestone payments in the Innovative Medicine business and the acquisition of an in-process research and development asset from the Laminar acquisition in the MedTech business.",
        "source": "finqa"
    },
    {
        "query": "What part of the Annual Report on Form 10-K includes the consolidated financial statements and accompanying notes?",
        "response": "The consolidated financial statements and accompanying notes are included in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements listed in the Annual Report on Form 10-K located?",
        "response": "Following Part IV and incorporated by reference",
        "source": "finqa"
    },
    {
        "query": "What pages of IBM's 2023 Annual Report to Stockholders contain the Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the company's third-party risk management program?",
        "response": "The purpose of the company's third-party risk management program is to assess vendors' cybersecurity processes, ensuring that they maintain compliance with the company's cybersecurity standards.",
        "source": "finqa"
    },
    {
        "query": "What measures does Hilton implement to support diversity and inclusion?",
        "response": "Hilton implements Team Member Resource Groups, Pathway Programs for economic mobility, and annual trainings on unconscious bias, inclusive culture, preventing human trafficking, and anti-harassment.",
        "source": "finqa"
    },
    {
        "query": "Under which item are the Financial Statements and Supplementary Data listed in the document?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "How are the undistributed profits of non-U.S. subsidiaries treated for tax purposes as of the end of 2023?",
        "response": "The undistributed profits of non-U.S. subsidiaries, totaling approximately $15 billion, are considered indefinitely reinvested and thus do not have a determined amount of unrecognized deferred tax liability primarily due to the complexity of U.S. and local tax laws and the company's legal entity structure.",
        "source": "finqa"
    },
    {
        "query": "What new high did active buyers on the Etsy marketplace reach as of December 31, 2023?",
        "response": "92.0 million",
        "source": "finqa"
    },
    {
        "query": "How did the goodwill value change over the period in the data provided?",
        "response": "The goodwill value remained constant at $69,021 before decreasing by $1 to $69,022.",
        "source": "finqa"
    },
    {
        "query": "What are the main factors that caused the unrealized losses on the Company's debt securities?",
        "response": "The unrealized losses on the Company's debt securities were primarily caused by interest rate increases.",
        "source": "finqa"
    },
    {
        "query": "What method is used to evaluate the fair value of Kroger Specialty Pharmacy's reporting unit?",
        "response": "Multiple valuation techniques including a discounted cash flow model, a market multiple model, and a comparable mergers and acquisition model.",
        "source": "finqa"
    },
    {
        "query": "How much did cash flows from operations amount to in 2022?",
        "response": "Cash flows from operations amounted to $4.5 billion in 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of dividends declared by AbbVie Inc. in the year 2023?",
        "response": "$10,647 million",
        "source": "finqa"
    },
    {
        "query": "What are the primary businesses included in FedEx's reportable segments?",
        "response": "FedEx's reportable segments include FedEx Express (express and ground package transportation, and freight transportation), FedEx Custom Critical (time-critical transportation), FedEx Ground (ground package delivery), FedEx Freight (LTL freight transportation), and FedEx Services (providing sales, marketing, IT, communications, customer service, technical support, and administrative functions).",
        "source": "finqa"
    },
    {
        "query": "Why is ICE Mortgage Technology subject to the examination by the Federal Financial Institutions Examination Council (FFIEC) and its member agencies?",
        "response": "ICE Mortgage Technology is subject to examination by the FFIEC and its member agencies because it serves as a third-party technology service provider to financial institutions that are directly regulated by these agencies.",
        "source": "finqa"
    },
    {
        "query": "What percentage excess of fair value over carrying value did the HPC & AI reporting unit have as of the latest goodwill impairment test in 2023?",
        "response": "12%",
        "source": "finqa"
    },
    {
        "query": "What percentage of total net sales did Costco's e-commerce operations represent in 2023?",
        "response": "Costco's e-commerce operations represented approximately 6% of total net sales in 2023.",
        "source": "finqa"
    },
    {
        "query": "What were the net changes in 'Other income (expense), net' for the years ending December 30, 2023, December 31, 2022, and December 25, 2021?",
        "response": "The changes were $197 million in 2023, $8 million in 2022, and $55 million in 2021.",
        "source": "finqa"
    },
    {
        "query": "How much cash was used in investing activities in fiscal 2022 compared to fiscal 2021?",
        "response": "Cash used in investing activities was $222.7 million in fiscal 2022 compared to $64.8 million in fiscal 2021.",
        "source": "finqa"
    },
    {
        "query": "What new feature did Airbnb launch in 2023 to aid Hosts?",
        "response": "In 2023, Airbnb launched new pricing tools to help Hosts set competitive prices, easily add weekly and monthly discounts, and compare their listing to similar ones in their area.",
        "source": "finqa"
    },
    {
        "query": "How much does Ford anticipate generating in adjusted free cash flow for 2024?",
        "response": "$6 billion to $7 billion",
        "source": "finqa"
    },
    {
        "query": "How much debt is AT&T Inc. expected to repay within one year as of December 31, 2023?",
        "response": "$9,477 million",
        "source": "finqa"
    },
    {
        "query": "What are the features of Intuit's ProConnect Tax Online service?",
        "response": "ProConnect Tax Online is a cloud-based solution designed for full-service, year-round practices, preparing all forms of consumer and small business returns, and integrates with QuickBooks Online offerings.",
        "source": "finqa"
    },
    {
        "query": "What are the projected environmental protection expenditures for AbbVie in 2024?",
        "response": "In 2024, capital expenditures for pollution control are estimated to be approximately $22 million and operating expenditures are estimated to be approximately $45 million.",
        "source": "finqa"
    },
    {
        "query": "What is the debt covenant requirement for the Company's bank credit facilities regarding the debt to debt-plus-shareholders’ equity ratio?",
        "response": "The Company's bank credit facilities require maintaining a debt to debt-plus-shareholders’ equity ratio of not more than 60%.",
        "source": "finqa"
    },
    {
        "query": "What is Apple's vision regarding inclusion and diversity within its workforce?",
        "response": "Apple's vision is to build and sustain a more inclusive workforce that is representative of the communities it serves and to increase diverse representation at every level.",
        "source": "finqa"
    },
    {
        "query": "What is the percentage change in Family of Apps revenue from 2022 to 2023?",
        "response": "The revenue for Family of Apps increased by 16% from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of corporate bonds in a less than 12-month continuous unrealized loss position as of December 31, 2023?",
        "response": "$28,401",
        "source": "finqa"
    },
    {
        "query": "What types of customers rely on Optum Insight's services?",
        "response": "Hospital systems, physicians, health plans, governments, life sciences companies, and other organizations rely on Optum Insight for integrated services and solutions that improve performance, achieve efficiency, reduce costs, meet compliance mandates, and modernize core operating systems.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the Company's portfolio of securities was in an unrealized loss position as of December 30, 2023?",
        "response": "Approximately 92% of the securities were in an unrealized loss position as of December 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "On which date was the report on the consolidated financial statements issued?",
        "response": "February 16, 2024",
        "source": "finqa"
    },
    {
        "query": "What percentage of the loans in Americas were investment-grade as of December 2022?",
        "response": "47%",
        "source": "finqa"
    },
    {
        "query": "What provisions are included in California's revised ZEV regulation for light-duty vehicles starting from model year 2026?",
        "response": "Starting from model year 2026, the revised ZEV regulation in California mandates a 35% light-duty ZEV sales requirement, rising to 100% by 2035.",
        "source": "finqa"
    },
    {
        "query": "How did the accumulated other comprehensive income (loss) change from January 1, 2021, to December 31, 2021, for Amazon.com, Inc.?",
        "response": "The accumulated other comprehensive income (loss) changed from $(1,837) as of January 1, 2021, to $(1,376) as of December 31, 2021, indicating an improvement.",
        "source": "finqa"
    },
    {
        "query": "What was the operating income of FedEx Ground segment in 2023?",
        "response": "$3,140 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in worldwide sales to customers from 2022 to 2023?",
        "response": "6.5%",
        "source": "finqa"
    },
    {
        "query": "How much did asset impairments related to store-level assets decrease in fiscal 2022 compared to fiscal 2021?",
        "response": "decreased by $4.0 million or 59.7%",
        "source": "finqa"
    },
    {
        "query": "How does Starbucks recognize the interest and penalties related to income tax matters on their financial statements?",
        "response": "Starbucks recognizes interest and penalties related to income tax matters as income tax expense on their consolidated statements of earnings. Accrued interest and penalties are included within the related tax balances on the consolidated balance sheets.",
        "source": "finqa"
    },
    {
        "query": "What significant roles did W. Craig Jelinek hold before becoming CEO?",
        "response": "Before becoming CEO, W. Craig Jelinek was President and Chief Operating Officer from February 2010 to December 2011 and Executive Vice President, Chief Operating Officer, Merchandising since 2004.",
        "source": "finqa"
    },
    {
        "query": "What are Good Manufacturing Practices (GMP) as defined by the FDA and EMA?",
        "response": "Good Manufacturing Practices (GMP) are extensive regulations that govern manufacturing processes, stability testing, record keeping, and quality standards.",
        "source": "finqa"
    },
    {
        "query": "What additional responsibilities does the company have regarding remediation efforts beyond the settlement agreements?",
        "response": "The company remains responsible for additional costs beyond the scope of the settlement agreements, as well as all remaining costs in the event that the other parties do not fulfill their obligations under these agreements.",
        "source": "finqa"
    },
    {
        "query": "How did the company's supply chain disruption impact its transport costs?",
        "response": "The supply chain disruption led the company to use higher cost modes of transport, specifically increasing the use of air freight.",
        "source": "finqa"
    },
    {
        "query": "Are U.S. franchised hotels allowed to participate in the company's insurance programs?",
        "response": "No, U.S. franchised hotels are not permitted to participate in the company's insurance programs.",
        "source": "finqa"
    },
    {
        "query": "What was the change in net earnings for Procter & Gamble and what factors influenced it?",
        "response": "Net earnings for Procter & Gamble declined modestly by $55 million to $14.7 billion, influenced by an increase in earnings before income taxes which was more than offset by the increase in the effective income tax rate.",
        "source": "finqa"
    },
    {
        "query": "What was the total operating cost for 2023?",
        "response": "$339,264 million",
        "source": "finqa"
    },
    {
        "query": "What is included in Item 8 of the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "Where is MLMIC Insurance Company based and what type of insurance does it provide?",
        "response": "MLMIC Insurance Company is based in Albany, New York, and it provides medical professional liability insurance policies to medical and dental professionals, health care providers, and hospitals in New York State.",
        "source": "finqa"
    },
    {
        "query": "What was the decrease in pre-tax earnings for BNSF in 2022 compared to 2021?",
        "response": "Pre-tax earnings for BNSF decreased by 1.9% in 2022 compared to 2021.",
        "source": "finqa"
    },
    {
        "query": "What was the annual maturities for the French Term Loans in fiscal 2024 according to the schedule presented?",
        "response": "$10.9 million",
        "source": "finqa"
    },
    {
        "query": "How many shares of common stock did the company receive initially from the 2024 $3.0 billion ASR agreement with Morgan Stanley?",
        "response": "Approximately 31.4 million shares",
        "source": "finqa"
    },
    {
        "query": "What are the projected years covered by the new CAFE and GHG emission standards proposed by NHTSA and the EPA?",
        "response": "NHTSA has proposed new CAFE standards covering the 2027 to 2031 model years, while the EPA has proposed GHG standards extending from 2027 to 2032.",
        "source": "finqa"
    },
    {
        "query": "How much did the net investment income increase from 2022 to 2023?",
        "response": "31.9%",
        "source": "finqa"
    },
    {
        "query": "What is the strategic focus for The Home Depot in handling professional customers’ needs?",
        "response": "meeting the Pros’ planned purchase needs",
        "source": "finqa"
    },
    {
        "query": "How much waste was generated per square meter at Hilton's properties in 2023?",
        "response": "0.0056 metric tons",
        "source": "finqa"
    },
    {
        "query": "What was the change in casino revenue at Marina Bay Sands from 2022 to 2023?",
        "response": "Casino revenues at Marina Bay Sands increased by $1.0 billion from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the reported amount for 'Fuel' expense in the fiscal year ended May 31, 2023 according to the consolidated statement?",
        "response": "$5,909 million",
        "source": "finqa"
    },
    {
        "query": "What types of financial services are offered through Walmart's fintech venture, ONE?",
        "response": "Walmart's fintech venture, ONE, offers services like money orders, prepaid access, money transfers, check cashing, bill payment, and certain types of installment lending.",
        "source": "finqa"
    },
    {
        "query": "What legal basis for behavioral advertising on Facebook and Instagram in the EU, EEA, and Switzerland was announced to be changed and what was it changed to?",
        "response": "The legal basis for behavioral advertising on Facebook and Instagram in the EU, EEA, and Switzerland was announced to be changed from 'legitimate interests' to 'consent'.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash dividends declared by the company per share in the fiscal year ending on October 1, 2023?",
        "response": "$2.16 per share",
        "source": "finqa"
    },
    {
        "query": "What is the main objective of AutoZone's Diversity, Equity, and Inclusion (DEI) initiatives?",
        "response": "The main objective of AutoZone's DEI initiatives is to influence and inform many parts of human capital management including talent acquisition, retention, professional development, and workforce management.",
        "source": "finqa"
    },
    {
        "query": "What is the main objective in managing foreign currency risk for ME&T operations?",
        "response": "To minimize the risk of exchange rate movements that would reduce the U.S. dollar value of the company's foreign currency cash flow",
        "source": "finqa"
    },
    {
        "query": "How does the company manage fluctuations in foreign currency exchange rates?",
        "response": "The company hedges foreign currency exchange-based cash flow variability of certain fees using forward contracts designated as hedging instruments. Additionally, it holds short-term forward contracts to offset exposure to fluctuations in its foreign currency denominated cash balances and intercompany financing arrangements, without designating these forward contracts as hedging instruments.",
        "source": "finqa"
    },
    {
        "query": "In which markets does NIKE operate its Converse brand, and what products are included?",
        "response": "In the markets where it operates, the Converse brand by NIKE designs, distributes, and licenses casual sneakers, apparel, and accessories under several trademarks including Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell.",
        "source": "finqa"
    },
    {
        "query": "What were the weighted average remaining lease terms for operating and finance leases as of January 31, 2023?",
        "response": "The weighted average remaining lease terms were 7 years for operating leases and 3 years for finance leases as of January 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "Which section of IBM’s 2023 Annual Report is reserved for Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What major legislative act mentioned in the text was enacted by the U.S. government on August 16, 2022?",
        "response": "The Inflation Reduction Act of 2022 was enacted by the U.S. government on August 16, 2022.",
        "source": "finqa"
    },
    {
        "query": "What were the main factors contributing to the change in net sales for fiscal 2022?",
        "response": "stronger U.S. dollar, decline in sales from new software releases, and a decline in sales of video game accessories, offset by an increase in sales of new gaming hardware and toys and collectibles",
        "source": "finqa"
    },
    {
        "query": "What do derivative financial instruments generally hedge against in a corporate financial strategy?",
        "response": "Derivative financial instruments typically hedge against market risks such as interest rate risk and foreign currency exchange risk.",
        "source": "finqa"
    },
    {
        "query": "What services does the ICE Bonds platform provide and what is its focus?",
        "response": "The ICE Bonds platform provides electronic markets supporting multiple trading protocols like click-to-trade, RFQ, and auctions, focusing on enhancing efficiency across fixed income markets.",
        "source": "finqa"
    },
    {
        "query": "When was the company awarded the next generation of TRICARE Managed Care Support Contracts for the TRICARE East Region?",
        "response": "The company was awarded the next generation of TRICARE Managed Care Support Contracts for the TRICARE East Region in December 2022.",
        "source": "finqa"
    },
    {
        "query": "What kind of competition does Comcast face in the media industry?",
        "response": "Competition from companies providing technology and tools to media industry customers",
        "source": "finqa"
    },
    {
        "query": "How are extra content and subscriptions revenue recognized by the company?",
        "response": "Extra content revenue is recognized based on the functionality of the content; if it has offline capabilities, it's treated like Games with Services. Subscription revenue is recognized ratably over the subscription term as the single performance obligation of providing access to games and benefits is met.",
        "source": "finqa"
    },
    {
        "query": "What are the total upcoming obligations for short-term and long-term debt and trust preferred securities over the next twelve months?",
        "response": "The total upcoming obligations for short-term and long-term debt and trust preferred securities over the next twelve months are $1.5 billion.",
        "source": "finqa"
    },
    {
        "query": "What was the maximum credit amount available under the Amended and Restated Credit Agreement initially?",
        "response": "$500 million",
        "source": "finqa"
    },
    {
        "query": "What is operational risk defined as in the context of the company's risk management?",
        "response": "Operational risk is defined as the risk of loss due to inadequate or failed processes, people, information systems, or impacts from the external environment, including failures to comply with laws and regulations and impacts from relationships with third parties.",
        "source": "finqa"
    },
    {
        "query": "What page number does Item 8 start on in the referenced context?",
        "response": "Page 39",
        "source": "finqa"
    },
    {
        "query": "What was the starting interest rate for the Virginia 3 Term Loans entered into on August 31, 2023?",
        "response": "6.2%",
        "source": "finqa"
    },
    {
        "query": "What types of customers and counterparties are monitored in the company's financial exposure tracking process?",
        "response": "The company monitors financial exposure to both sovereign and non-sovereign customers and counterparties.",
        "source": "finqa"
    },
    {
        "query": "What was the projected liability for U.S. Tax Act transitional charge as of June 30, 2023?",
        "response": "The projected liability for the U.S. Tax Act transitional charge as of June 30, 2023, was $1,575 million.",
        "source": "finqa"
    },
    {
        "query": "What initiatives are included in FedEx's approach to employee well-being and safety?",
        "response": "FedEx's approach to employee well-being and safety includes comprehensive health benefits, competitive time-off policies, and a focus on mental health resources. Additionally, the company prioritizes workplace safety through its 'Safety Above All' philosophy.",
        "source": "finqa"
    },
    {
        "query": "Which online platforms offering experiences are mentioned in the text?",
        "response": "The online platforms offering experiences mentioned in the text include Viator, GetYourGuide, Klook, Traveloka, TUI Musement, and KKDay.",
        "source": "finqa"
    },
    {
        "query": "What educational support does Walmart provide to its associates through the Live Better U program?",
        "response": "Walmart pays 100% of associates' college tuition, books, and fees through the Live Better U program.",
        "source": "finqa"
    },
    {
        "query": "How is Chubb International's P&C business typically conducted?",
        "response": "Chubb International's P&C business is typically conducted by writing insurance policies on both a direct and assumed basis, through major international, regional, and local brokers and agents, and digital-commerce platforms.",
        "source": "finqa"
    },
    {
        "query": "What primary subject does Item 3 address according to the context provided?",
        "response": "Legal Proceedings",
        "source": "finqa"
    },
    {
        "query": "How much did the Office Consumer products and cloud services revenue increase by?",
        "response": "The Office Consumer products and cloud services revenue increased by $140 million.",
        "source": "finqa"
    },
    {
        "query": "What does qui tam litigation refer to in the context of legal proceedings?",
        "response": "Qui tam litigation refers to lawsuits brought by individuals seeking to sue on behalf of the government.",
        "source": "finqa"
    },
    {
        "query": "What aspects of Garmin's business are subject to environmental laws?",
        "response": "Garmin's operations are subject to various environmental laws addressing air and water pollution, and the management of hazardous substances and wastes.",
        "source": "finqa"
    },
    {
        "query": "How much did Olumiant revenue increase in percentage terms in 2023?",
        "response": "11%",
        "source": "finqa"
    },
    {
        "query": "What considerations are involved in recording an uncertain tax position?",
        "response": "Recording an uncertain tax rights involves various qualitative considerations including evaluation of comparable and resolved tax exposures, applicability of tax laws, and likelihood of settlement.",
        "source": "finqa"
    },
    {
        "query": "Where can the financial statements and notes referenced in Part IV, Item 15(a)(1) be found?",
        "response": "They are included immediately following Part IV and incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "How are jet fuel purchases typically structured under the current contractual arrangements?",
        "response": "Approximately 70% of jet fuel is purchased based on the index price for the preceding week, with the remainder primarily tied to the index prices for the preceding month and day.",
        "source": "finqa"
    },
    {
        "query": "What was the change in cash and cash equivalents for Hewlett Packard Enterprise from the beginning to the end of the fiscal year 2023?",
        "response": "$182 decrease",
        "source": "finqa"
    },
    {
        "query": "What agreement did Ford reach with California regarding vehicle GHG standards, and how do these standards compare with the federal standards rolled back in 2020?",
        "response": "Ford reached an agreement with California to meet a designated set of GHG standards on a national basis for model years 2021 through 2026, which were more stringent than the federal standards that had been rolled back in 2020.",
        "source": "finqa"
    },
    {
        "query": "What contributed to the increase in Google Services' operating income in 2023?",
        "response": "The increase was primarily driven by a rise in revenues, offset by higher content acquisition costs and compensation expenses, including an increase in SBC expense.",
        "source": "finqa"
    },
    {
        "query": "What are included immediately following Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included immediately following Part IV.",
        "source": "finqa"
    },
    {
        "query": "How are definite-lived intangible assets treated in the consolidated balance sheets?",
        "response": "Definite-lived intangible assets, which primarily relate to acquired customer contracts and relationships, are included with other long-term assets in the consolidated balance sheets and are amortized over their useful life generally using the straight-line method.",
        "source": "finqa"
    },
    {
        "query": "How does The Hershey Company ensure flexibility and work-life balance for its employees?",
        "response": "The Hershey Company offers SmartFlex benefits, allowing employees to flex their working hours, and a 'Best of Both' flexible work model that supports remote and on-site work options.",
        "source": "finqa"
    },
    {
        "query": "What types of financial reports does the company file or furnish?",
        "response": "The company files or furnishes periodic reports such as Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, among others.",
        "source": "finqa"
    },
    {
        "query": "How much did subscription revenue change for the fiscal year ended June 30, 2023 compared to the previous fiscal year?",
        "response": "Subscription revenue increased by $275.4 million for the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the primary goals of the asset allocation strategy for USRIP's plan, and what standards must investment managers follow?",
        "response": "The primary goals of the asset allocation strategy for USRIP's plan are to produce a total investment return that satisfies future annual cash benefit payments and minimize future contributions from the company. Additionally, the strategy aims to diversify the plan assets to minimize nonsystemic risk and ensure no single security or class of security has a disproportionate negative impact on the plan. Investment managers are required to follow the provisions of ERISA, with performance standards including expected return versus an assigned benchmark, a measure of volatility, and a specific evaluation period.",
        "source": "finqa"
    },
    {
        "query": "What factors substantially affected operating expenses as a percentage of net sales in fiscal 2023?",
        "response": "Operating expenses as a percentage of net sales in fiscal 2023 were affected by charges related to opioid legal settlements and restructuring, offset by growth in net sales and reduced COVID-19 costs.",
        "source": "finqa"
    },
    {
        "query": "What factors drove the increase in operating income for Google Cloud in 2023?",
        "response": "Increased revenues and a reduction in costs due to the change in the estimated useful lives of servers and network equipment.",
        "source": "finqa"
    },
    {
        "query": "How many common stock shares did the Company repurchase in the fiscal year ending January 31, 2022, and what was the approximate total cost?",
        "response": "Approximately 28 million shares for about $4.0 billion",
        "source": "finqa"
    },
    {
        "query": "What was the effective income tax rate for the Company in 2023?",
        "response": "25.1%",
        "source": "finqa"
    },
    {
        "query": "What was the net income attributable to Hilton stockholders in 2023?",
        "response": "$1,141 million",
        "source": "finqa"
    },
    {
        "query": "What is the trend observed in finance lease liabilities from 2019 to 2023?",
        "response": "Finance lease liabilities have generally increased from $162,591 in 2019 to $296,599 in 2023.",
        "source": "finqa"
    },
    {
        "query": "When did Jeffrey P. Bezos serve as Chief Executive Officer?",
        "response": "From May 1996 until July 2021",
        "source": "finqa"
    },
    {
        "query": "What benefits does Kroger offer to promote further education among its associates?",
        "response": "Kroger offers a tuition reimbursement benefit that provides up to $3,500 annually, totaling $21,000 over the span of employment, for continuing education such as certifications and degrees.",
        "source": "finqa"
    },
    {
        "query": "What were the financial outcomes for the company in fiscal year 2023 regarding net earnings and tax benefits?",
        "response": "In fiscal year 2023, the company reported net earnings of $3,263 million and recorded $1.1 billion of net income tax benefits related to discrete items in the provision for taxes.",
        "source": "finqa"
    },
    {
        "query": "What was the total gross asset amount in the year 2023?",
        "response": "$1,591 million",
        "source": "finqa"
    },
    {
        "query": "What constitutes the largest expense in the company's various expense categories?",
        "response": "Personnel-related costs are the largest expense in various expense categories of the company, excluding restructuring and asset impairment charges.",
        "source": "finqa"
    },
    {
        "query": "What are the three principles of liquidity risk management at Goldman Sachs?",
        "response": "The three principles of liquidity risk management at Goldman Sachs are: holding sufficient excess liquidity in the form of GCLA to cover outflows during a stressed period, maintaining appropriate Asset-Liability Management, and maintaining a viable Contingency Funding Plan.",
        "source": "finqa"
    },
    {
        "query": "What does it mean for financial statements to be incorporated by reference?",
        "response": "For financial statements to be incorporated by reference means they are not presented in full in the document but are referenced and treated as part of the document legally and for all reporting purposes.",
        "source": "finqa"
    },
    {
        "query": "How much did AT&T's common stock dividends per share total in 2023?",
        "response": "$1.11",
        "source": "finqa"
    },
    {
        "query": "What is the primary goal of value-based care according to the company?",
        "response": "The primary goal of value-based care is to incentivize healthcare providers to simultaneously increase the quality of care while lowering the cost of care for patients.",
        "source": "finqa"
    },
    {
        "query": "What is the amortization method used for software costs and what is their expected useful life range?",
        "response": "Software costs are amortized using the straight-line method over an expected useful life of generally 3 to 7 years.",
        "source": "finqa"
    },
    {
        "query": "What are the potential consequences for a company if its PBMs fail to comply with pharmacy audit regulations?",
        "response": "If a company's PBMs do not comply with regulations governing pharmacy audits, especially in relation to claim submissions, the company might be unable to recover overpayments, leading to significant financial losses and potentially other legal penalties.",
        "source": "finqa"
    },
    {
        "query": "What are included in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included.",
        "source": "finqa"
    },
    {
        "query": "Where are the Microsoft® and Windows® trademarks registered?",
        "response": "In the United States and/or other countries.",
        "source": "finqa"
    },
    {
        "query": "What is VisaNet?",
        "response": "Visa's proprietary advanced transaction processing network, designed to offer a single connection point for facilitating payment transactions to multiple endpoints through various form factors",
        "source": "finqa"
    },
    {
        "query": "What were the total cash discounts provided by AbbVie in 2023, 2022, and 2021?",
        "response": "AbbVie provided cash discounts of $2.0 billion in 2023, $1.8 billion in 2022, and $1.6 billion in 2021.",
        "source": "finqa"
    },
    {
        "query": "Are environmental matters discussed in the same context as legal proceedings in this document?",
        "response": "Yes, environmental matters are discussed along with legal proceedings under Note 22 in the document.",
        "source": "finqa"
    },
    {
        "query": "What could be the financial implication for a company following a downgrade of its credit ratings?",
        "response": "A downgrade of a company's credit ratings could increase its borrowing costs and impair its ability to access capital and credit markets on commercially acceptable terms. Additionally, a downgrade in short-term credit ratings could limit the company's access to commercial paper markets, potentially requiring reliance on more expensive types of debt financing.",
        "source": "finqa"
    },
    {
        "query": "What is the significance of the Gramm-Leach-Bliley Act (GLBA) in regards to privacy and data protection?",
        "response": "The Gramm-Leach-Bliley Act (GLBA) imposes specific limitations on sharing consumers' nonpublic personal information with nonaffiliated third parties and mandates the development, implementation, and maintenance of a comprehensive information security program containing appropriate safeguards, based on the size and complexity of a company's business, the nature and scope of its activities, and the sensitivity of the customer information processed.",
        "source": "finqa"
    },
    {
        "query": "What performance criteria are considered critical for the ICE trading platforms?",
        "response": "Critical performance criteria for the ICE trading platforms include speed, reliability, resilience, capacity, and security.",
        "source": "finqa"
    },
    {
        "query": "Which section lists the Report of Independent Registered Public Accounting Firm along with the Financial Statements?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What was the total matching contribution for the Chipotle 401(k) Plan in 2023?",
        "response": "$13,821",
        "source": "finqa"
    },
    {
        "query": "How does Chipotle ensure pay equity among its employees?",
        "response": "Chipotle retains an independent third-party consultant annually to conduct a pay equity analysis, considering factors like grade level, tenure in role, and geographic location.",
        "source": "finqa"
    },
    {
        "query": "What comprehensive services does FedEx Logistics provide within its segment?",
        "response": "FedEx Logistics provides a suite of integrated logistics solutions including air and ocean cargo transportation, customs brokerage, trade management tools and data through FedEx Trade Networks Transport & Brokerage, and third party logistics and supply chain solutions through FedEx Supply Chain.",
        "source": "finqa"
    },
    {
        "query": "When did FedEx announce DRIVE, the business optimization program, and what are its main components?",
        "response": "FedEx announced DRIVE, a comprehensive program to improve the company’s long-term profitability, in the second quarter of 202a3. The program includes a business optimization plan aimed at driving efficiency among transportation segments, lowering overhead and support costs, consolidating sortation facilities and equipment, reducing pickup-and-delivery routes, and optimizing the enterprise linehaul network through Network 2.0.",
        "source": "finqa"
    },
    {
        "query": "How did the inclusion of restricted stock units affect the treasury stock method computation of diluted shares?",
        "response": "Certain restricted stock units, market-based restricted stock units, and performance-based restricted stock units were excluded from the treasury stock method computation of diluted shares because their inclusion would have had an antidilutive effect.",
        "source": "finqa"
    },
    {
        "query": "How much did the company spend on research and development in 2022?",
        "response": "$26,251 million",
        "source": "finqa"
    },
    {
        "query": "What were the company's outstanding obligations under the supplier finance program as of December 31, 2023?",
        "response": "The amount of obligations confirmed under the program that remained unpaid by the company as of December 31, 2023, were $43.3 million.",
        "source": "finqa"
    },
    {
        "query": "How has the litigation and investigation landscape changed for the company over recent years?",
        "response": "Over recent years, there has been an increase in the number and significance of litigation and investigations involving the company, with uncertain future trends.",
        "source": "finqa"
    },
    {
        "query": "What therapeutic areas are targeted by the strategic collaborations, in-licensing and acquisitions conducted by the company in 2023?",
        "response": "The strategic collaborations, in-licensing and acquisitions in 2023 targeted virology, oncology, and inflammation.",
        "source": "finqa"
    },
    {
        "query": "What are the primary types of equity accounts used within U.S. large cap investment classifications?",
        "response": "A mix of index funds and actively managed equity accounts are used within U.S. large cap investment classifications.",
        "source": "finqa"
    },
    {
        "query": "What item in the Annual Report contains detailed descriptions of legal proceedings?",
        "response": "Item 8 of the Annual Report contains the detailed descriptions of legal proceedings, specifically within Note 14 of the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "What are the main objectives of the economic sanctions imposed by the United States and other international bodies?",
        "response": "Economic sanctions are used to advance a range of foreign policy goals, including conflict resolution, counterterrorism, counternarcotics, and promoting democracy and human rights.",
        "source": "finqa"
    },
    {
        "query": "What is the function of the amended revolving credit agreement that the Company entered into with Bank of America in September 2023?",
        "response": "The Amended Revolving Credit Agreement provides the Company with a maximum aggregate principal amount of $1.25 billion, with a potential additional incremental commitment increase of up to $500 million, and includes certain financial covenants and limitations typical of an investment grade facility.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of goodwill remaining for Vitacost.com at the end of January 2023?",
        "response": "$0",
        "source": "finqa"
    },
    {
        "query": "How much was the Company's income tax expense for the year ended December 31, 2022, and what was the effective tax rate for that year?",
        "response": "$91,389 with an effective tax rate of approximately 9%",
        "source": "finqa"
    },
    {
        "query": "What section of IBM's 2023 Annual Report to Stockholders contains the Financial Statements and Supplementary Data?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What was the range of before tax restructuring costs incurred by the company in fiscal 2023?",
        "response": "The company incurred before tax restructuring costs within the range of $250 million to $500 million in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the total net cash provided by (used for) financing activities for the company?",
        "response": "$(6,932)",
        "source": "finqa"
    },
    {
        "query": "What was the impact on net periodic benefit cost and projected benefit obligation from a 50 basis point change in the assumed discount rate for AbbVie's plans as of December 31, 2023?",
        "response": "A 50 basis point increase would decrease the net periodic benefit cost by $49 million and the projected benefit obligation by $674 million. Conversely, a 50 basis point decrease would increase the net periodic benefit cost by $70 million and the projected benefit obligation by $756 million.",
        "source": "finqa"
    },
    {
        "query": "What types of services and hardware does the Aruba brand offer for business connectivity?",
        "response": "The Aruba brand offers services such as LAN, Wi-Fi, and Wide area network alongside hardware like Wi-Fi access points, and software such as network management programs, which facilitate secure business connectivity and data analysis.",
        "source": "finqa"
    },
    {
        "query": "What was the net carrying value of the Senior Notes as of March 31, 2023?",
        "response": "$1,880 million",
        "source": "finqa"
    },
    {
        "query": "What were the key components audited in Salesforce, Inc.'s financial statements for the years ending January 31, 2023?",
        "response": "The key components audited in Salesforce, Inc.'s financial statements for the years ending January 31, 2023, included the consolidated balance sheets, statements of operations, comprehensive income, stockholders' equity, and cash flows.",
        "source": "finqa"
    },
    {
        "query": "What actions has Peloton taken to protect its intellectual property?",
        "response": "Peloton relies on a combination of patents, trademarks, trade secrets, copyrights, and confidentiality agreements to protect its intellectual property, including entering into confidentiality and invention assignment agreements with employees and consultants.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in operating profit in 2023?",
        "response": "The increase in operating profit in 2023 was predominantly due to higher gross profit, despite being partially offset by higher SM&A expenses.",
        "source": "finqa"
    },
    {
        "query": "How have CARB's regulations adjusted in response to changes in the EPA's GHG emission standards?",
        "response": "CARB amended its regulations in December 2018 to specify that should the EPA alter its GHG emission stringency, compliance with the EPA’s standards would no longer deem a manufacturer compliant with CARB's separate GHG requirements.",
        "source": "finqa"
    },
    {
        "query": "When was Intercontinental Exchange, Inc. founded, and what was its initial focus?",
        "response": "Intercontinental Exchange, Inc. was founded in 2000 with the initial focus on transforming energy markets by creating a network that improved transparency, efficiency, and access.",
        "source": "finqa"
    },
    {
        "query": "How does the company plan to manage its liquidity and finance requirements over the next twelve months?",
        "response": "The company plans to manage its liquidity needs and finance requirements through generated cash flows from operations, existing cash, cash equivalents, marketable securities balances, and borrowing arrangements which are believed to be sufficient for meeting anticipated operating cash needs for at least twelve months.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Management's Discussion and Analysis of Financial Condition and Results of Operations section in the Annual Report on Form 10-K?",
        "response": "The purpose of the Management's Discussion and Analysis of Financial Condition and Results of Operations section in the Annual Report on Form 10-K is to provide a detailed overview and analysis of the company's financial condition and operational results.",
        "source": "finqa"
    },
    {
        "query": "What are the company's primary sources of revenue?",
        "response": "The company's primary sources of revenue include sales of full games, extra content and services, subscriptions, and licensing to third parties to distribute and host their games and content.",
        "source": "finqa"
    },
    {
        "query": "What was the cash change related to changes in operating assets and liabilities, including working capital, in 2022?",
        "response": "$3.2 billion",
        "source": "finqa"
    },
    {
        "query": "Where are the descriptions of legal proceedings housed in the Annual Report?",
        "response": "Descriptions of legal proceedings are housed in Note 14 of the consolidated financial statements within Item 8 of the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What was the growth rate of Visa Inc.'s overall total nominal volume from 2021 to 2022?",
        "response": "12%",
        "source": "finqa"
    },
    {
        "query": "How much did the company's net working capital amount to as of December 31, 2023?",
        "response": "$859,665 thousand",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue for the year 2023?",
        "response": "$4,812.6 million",
        "source": "finqa"
    },
    {
        "query": "What cost-saving measures were implemented by Humana beginning in 2022 to support growth and investment in their Medicare Advantage business?",
        "response": "Beginning in 2022, Humana committed to driving additional value through cost-saving, productivity initiatives, and value acceleration from previous investments including recording severance and impairment charges within operating costs.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the refinery segment's operating revenue decrease in 2023 compared to 2022?",
        "response": "29%",
        "source": "finqa"
    },
    {
        "query": "What was the net income of Humana Inc. for the year ending December 31, 2023?",
        "response": "$2,484 million",
        "source": "finqa"
    },
    {
        "query": "How does the company plan to fund its substantial cash requirements?",
        "response": "The company plans to fund its significant cash requirements through the use of liquidity and cash flows generated from business operations.",
        "source": "finqa"
    },
    {
        "query": "How does Airbnb, Inc. handle the accounting of unrecognized tax benefits?",
        "response": "Airbnb, Inc. uses a two-step approach to account for unrecognized tax benefits. First, recognition occurs if a tax position is more-likely-than-not to be sustained based on its technical merits. Second, measurement is determined by the largest amount of benefit that is more than 50% likely to be realized upon ultimate settlement with a taxing authority fully aware of all relevant information.",
        "source": "finqa"
    },
    {
        "query": "What was the total change in net cash provided by operating activities between fiscal years 2022 and 2023?",
        "response": "-$349 million",
        "source": "finqa"
    },
    {
        "query": "What was the increase in postpaid phone subscribers at AT&T Inc. from 2021 to 2023?",
        "response": "3,995 (in thousands)",
        "source": "finqa"
    },
    {
        "query": "How does the described company's U.S. dialysis business compete in the market?",
        "response": "The company faces intense competition from large and medium-sized providers for acquisition targets, individual patients, and to engage physicians qualified to provide medical director services.",
        "source": "finqa"
    },
    {
        "query": "In which section of the document can Note 22's discussion be found?",
        "response": "Note 22's discussion can be found in Part II, Item 8, titled 'Financial Statements and Supplementary Data'.",
        "source": "finqa"
    },
    {
        "query": "What type of approval is contingent upon verification and description of clinical benefit in confirmatory trials according to the FDA?",
        "response": "Accelerated approval",
        "source": "finqa"
    },
    {
        "query": "What regions does the company currently target for its product offerings?",
        "response": "The company targets the residential and commercial markets in regions including the United States, Canada, Mexico, Europe, Australia, New Zealand, India, Brazil, the Philippines, Thailand, South Africa, and certain Central American and Asian markets.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of stock repurchases on AutoZone's diluted earnings per share for fiscal 2023?",
        "response": "The impact of stock repurchases on AutoZone's diluted earnings per share for fiscal 2023 was an increase of $1.15.",
        "source": "finqa"
    },
    {
        "query": "How do the legal and accounting teams contribute to the evaluation of contingencies?",
        "response": "The legal and accounting teams, along with external counsel, engage in a comprehensive evaluation process which includes regular communications and scheduled meetings to assess new and existing legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How many countries and territories does Hilton operate in as of December 31, 2023?",
        "response": "126 countries and territories",
        "source": "finqa"
    },
    {
        "query": "What significant corporate action did the company take in terms of share repurchases during 2023?",
        "response": "In 2023, the company repurchased 17.9 million shares of Class A common stock amounting to $2.3 billion through two share repurchase programs.",
        "source": "finqa"
    },
    {
        "query": "What was the loss on the sale of business for the year ended December 31, 2023?",
        "response": "$2,630",
        "source": "finqa"
    },
    {
        "query": "How much did AMD spend on research and development in 2023?",
        "response": "$5,872 million",
        "source": "finqa"
    },
    {
        "query": "How much were the unconditional purchase commitments as of December 30, 2023, and how much is expected to be incurred in 2024?",
        "response": "$4.6 billion total, with $3.9 billion expected in 2024",
        "source": "finqa"
    },
    {
        "query": "How much did the amortization of intangible assets decrease from 2021 to 2022?",
        "response": "The amortization of intangible assets decreased by $30 from 2021 to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the primary function of a company's internal control over financial reporting according to PCAOB standards?",
        "response": "The primary function of a company's internal control over financial reporting is to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with generally accepted accounting principles (GAAP).",
        "source": "finqa"
    },
    {
        "query": "What changes occurred in the company's network of retail locations during 2023?",
        "response": "Most of the company's retail locations remained open throughout 2023, although some were temporarily closed due to COVID-19 resurgences during earlier periods.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash dividends paid in 2022?",
        "response": "$682 million",
        "source": "finqa"
    },
    {
        "query": "What type of business operations are subject to local regulatory control regarding gaming licenses?",
        "response": "Business operations at gaming facilities are subject to the licensing and regulatory control of the local regulatory agency responsible for gaming licenses and operations in those jurisdictions.",
        "source": "finqa"
    },
    {
        "query": "What were the company's restructuring charges in 2023?",
        "response": "$507 million",
        "source": "finqa"
    },
    {
        "query": "What is the primary therapeutic use of Linzess (linaclotide)?",
        "response": "Linzess (linaclotide) is used to treat irritable bowel syndrome with constipation (IBS-C) and chronic idiopathic constipation in adults.",
        "source": "finqa"
    },
    {
        "query": "In the Annual Report on Form 10-K, under which section are the consolidated financial statements and notes listed?",
        "response": "The consolidated financial statements and accompanying notes are listed under Part IV, Item 15(a)(1) in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "How much did the proprietary basic cards-in-force total in the most recent year noted in the list?",
        "response": "The proprietary basic cards-in-force totaled 61.7 million in the most recent year noted.",
        "source": "finqa"
    },
    {
        "query": "How is the outcome of the described legal proceedings characterized?",
        "response": "The outcome of described legal proceedings is characterized as inherently uncertain.",
        "source": "finqa"
    },
    {
        "query": "What advancements have been made in Ethernet transceiver technology?",
        "response": "Ethernet transceivers now support higher speeds, energy efficiency, data encryption, and time synchronization features, leveraging a proprietary digital signal processing architecture.",
        "source": "finqa"
    },
    {
        "query": "What was the effect of divestitures on the Company's operating expenses in 2022?",
        "response": "The gains on divestitures of subsidiaries, such as bswift and PayFlex, were reflected as a reduction of operating expenses in the Company’s GAAP consolidated statement of operations within the Health Care Benefits segment.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for the year ended December 31, 2023?",
        "response": "$13,426 million",
        "source": "finqa"
    },
    {
        "query": "What type of projects did Chevron continue to work on in the United States to enhance their refinery operations?",
        "response": "Projects aimed at improving refinery flexibility and reliability.",
        "source": "finqa"
    },
    {
        "query": "What are the three reportable segments of HP?",
        "response": "Personal Systems, Printing, and Corporate Investments.",
        "source": "finqa"
    },
    {
        "query": "What was the cash dividend per common share declared by Comcast in 2023?",
        "response": "$1.16",
        "source": "finqa"
    },
    {
        "query": "What do Financial Statements and Supplementary Data include in a financial report?",
        "response": "An index.",
        "source": "finqa"
    },
    {
        "query": "What notable accolades has Hasbro received for its corporate citizenship?",
        "response": "Hasbro has been named one of the 100 Best Corporate Citizens by 3BL Media and one of the World's Most Ethical Companies by Ethisphere Institute.",
        "source": "finqa"
    },
    {
        "query": "What were the unallocated corporate expenses for all segments in fiscal 2021, 2022, and 2023?",
        "response": "Unallocated corporate expenses for all segments totaled $2.9 billion in fiscal 2021, $4.3 billion in fiscal 2022, and $4.9 billion in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What percentage of lululemon's products were manufactured by their five largest manufacturers in 2023?",
        "response": "In 2023, 55% of lululemon's products were manufactured by their five largest manufacturers.",
        "source": "finqa"
    },
    {
        "query": "What significant financial activity occurred on December 1, 2023, under the ASR program?",
        "response": "On December 1, 2023, $10.0 billion was advanced under the ASR program, resulting in the acquisition and immediate retirement of approximately 215 million shares of common stock valued at $6.8 billion.",
        "source": "finqa"
    },
    {
        "query": "How much total dividends were paid to common stockholders in fiscal year 2023?",
        "response": "$7,645 million",
        "source": "finqa"
    },
    {
        "query": "How is the information about legal proceedings incorporated into Part I Item 3 of the report?",
        "response": "It is incorporated by reference to Note 15 of the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "How did FedEx's revenue in 2023 compare to its revenue in 2022?",
        "response": "FedEx's revenue decreased by 4%, going from $93,512 million in 2022 to $90,155 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "When did the U.S. Court of Appeals for the Ninth Circuit affirm the District Court's ruling?",
        "response": "The U.S. Court of Appeals for the Ninth Circuit affirmed the District Court’s ruling on April 24, 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the threshold for recognizing uncertain tax positions in financial statements?",
        "response": "The threshold for recognizing uncertain tax positions in financial statements is that a tax position must meet a minimum recognition threshold before being recognized.",
        "source": "finqa"
    },
    {
        "query": "How does the company recognize revenue from its services?",
        "response": "The company recognizes revenue when promised goods or services are transferred to customers, in an amount reflecting the consideration expected in exchange for those goods or services.",
        "source": "finqa"
    },
    {
        "query": "What is the total value of foreign net operating losses reported, and what is the valuation allowance percentage applied to them?",
        "response": "The total value of foreign net operating losses reported was $133.5 million, with a valuation allowance of approximately 73.8%.",
        "source": "finqa"
    },
    {
        "query": "What positions did Adam N. Selipsky hold at Amazon Web Services prior to becoming its CEO in July 2021?",
        "response": "Senior Vice President from May 2021 until July 2021 and Vice President, Marketing, Sales and Support from May 2005 to September 2016",
        "source": "finqa"
    },
    {
        "query": "What were the adjusted effective tax rates for 2022 and 2021 excluding certain adjustments?",
        "response": "The adjusted effective tax rates were 28.1% for 2022 and 26.2% for 2021, excluding the impairment of goodwill and other assets related to the lululemon Studio business unit and the gain on sale of an administrative building in 2022, as well as the MIRROR acquisition-related expenses in 2021.",
        "source": "finqa"
    },
    {
        "query": "What is the subject of Item 3 in the report?",
        "response": "The subject of Item 3 in the report is Legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What types of legal proceedings is the Company involved in?",
        "response": "The Company is involved in various legal proceedings that arise in the ordinary course of its business.",
        "source": "finqa"
    },
    {
        "query": "How much did the Vision franchise sales grow in 2023 compared to 2022?",
        "response": "4.6%",
        "source": "finqa"
    },
    {
        "query": "What were the Company's total matching contributions to employee 401(k) plans in fiscal years 2021, 2022, and 2023?",
        "response": "The Company made matching contributions to employee 401(k) accounts of $34.1 million in 2021, $37.9 million in 2022, and $37.3 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of dividends paid in fiscal year 2023?",
        "response": "In fiscal year 2023, dividends paid totaled $2.4 billion.",
        "source": "finqa"
    },
    {
        "query": "How much was the amortized cost of the closed portfolios used in hedging relationships at the end of 2023?",
        "response": "$39.1 billion",
        "source": "finqa"
    },
    {
        "query": "What services does the company offer related to its automotive and energy products?",
        "response": "The company offers vehicle showrooms, service centers, Mobile Service, body shops, Supercharger stations, Destination Chargers, and financial and other services tailored to its products.",
        "source": "finqa"
    },
    {
        "query": "Which item discusses Financial Statements and Supplementary Data?",
        "response": "Item 8.",
        "source": "finqa"
    },
    {
        "query": "What was the net increase in GM Financial's cash provided by counterparty derivative collateral posting activities in 2023?",
        "response": "$1.3 billion",
        "source": "finqa"
    },
    {
        "query": "What section of the document is entitled 'Financial Statements and Supplementary Data'?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What role do AbbVie's Employee Resource Groups play in the organization?",
        "response": "AbbVie's Employee Resource Groups help nurture an inclusive culture by building community and creating connections.",
        "source": "finqa"
    },
    {
        "query": "What is the total unrecognized compensation cost related to unvested stock-based awards as of October 29, 2023?",
        "response": "$6,375 million",
        "source": "finqa"
    },
    {
        "query": "What is the net income reported by Meta Platforms, Inc. for the fiscal year ended December 31, 2023?",
        "response": "Meta Platforms, Inc. reported a net income of $39,098 million for the fiscal year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What were GM's research and development expenses in 2023?",
        "response": "$9.9 billion",
        "source": "finqa"
    },
    {
        "query": "What is the primary responsibility of the Operational Risk team at Goldman Sachs in 2023?",
        "response": "The primary responsibility of the Operational Risk team at Goldman Sachs in 2023 is to develop and implement a formalized framework for assessing, monitoring, and managing operational risk, with the goal of maintaining exposure to operational risk within the firm's risk appetite.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for Alphabet Inc. in 2023?",
        "response": "$101,746 million",
        "source": "finqa"
    },
    {
        "query": "What was the balance of the accrual for U.S. covered litigation at the beginning and end of the period in 2023?",
        "response": "The balance of the accrual for U.S. covered litigation was $1,441 million at the beginning and $1,621 million at the end of the period in 2023.",
        "source": "finqa"
    },
    {
        "query": "What were the total assets of Hasbro, Inc. as of December 31, 2023?",
        "response": "$6,540.9 million",
        "source": "finqa"
    },
    {
        "query": "What is the accounting treatment of software development costs before technological feasibility is established?",
        "response": "Software development costs incurred internally in researching and developing a computer software product are charged to expense until technological feasibility of the product is established.",
        "source": "finqa"
    },
    {
        "query": "What productivity target has the company set for adjusted free cash flow?",
        "response": "The company has set a productivity target for adjusted free cash flow of 90% or greater.",
        "source": "finqa"
    },
    {
        "query": "How does Intuit support employee development and training?",
        "response": "Intuit supports employee development and training by providing access to company-sponsored learning paths, online courses on various topics, a goal setting tool for tracking progress, and resources to develop leadership skills among employees.",
        "source": "finqa"
    },
    {
        "query": "What were the effective income tax rates for fiscal years 2023, 2022, and 2021, and how did specific tax events affect these rates?",
        "response": "The effective income tax rates were 18% for both fiscal 2023 and fiscal 2022, and 23% for fiscal 2021. In fiscal 2023, a $142 million tax benefit related to prior years due to the reassessment of an uncertain tax position during an ongoing tax examination contributed to maintaining the 18% rate. For fiscal 2022, the rate was similarly affected by a $176 million tax benefit from a decrease in the state apportionment ratio due to a specific tax position. In contrast, the higher rate of 23% in fiscal 2021 was impacted by a $1.0 billion non-recurring tax expense due to the remeasurement of UK deferred tax liabilities after a tax rate increase, and $255 million in tax benefits resulting from the conclusion of audits.",
        "source": "finqa"
    },
    {
        "query": "How much of the company's revenues, less transaction-based expenses, were denominated in pounds sterling or euros in 2023?",
        "response": "In 2023, 14% of the company's consolidated revenues, less transaction-based expenses, were denominated in pounds sterling or euros.",
        "source": "finqa"
    },
    {
        "query": "What percentage of debt securities were considered investment-grade at the end of 2023, and what was the weighted average credit rating of these securities?",
        "response": "Approximately 97% of debt securities were investment-grade quality, with a weighted average credit rating of AA- at the end of 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the focus of the 'selling, administrative, and other expenses' category at Ford Motor Company?",
        "response": "This category includes labor and other costs not directly related to development and production, such as advertising and sales promotion costs.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decline in Portfolio Brands net revenues in 2022?",
        "response": "Lower net revenues were driven primarily by lower sales from BABY ALIVE, FURREAL FRIENDS, PJ MASKS, and MY LITTLE PONY products, and to a lesser extent, from core PLAYSKOOL and POTATO HEAD products.",
        "source": "finqa"
    },
    {
        "query": "What method is used to determine the discount rates for defined benefit pension and retiree health benefit plans?",
        "response": "A plan-specific yield curve of high quality, fixed income debt instruments.",
        "source": "finqa"
    },
    {
        "query": "How are Hilton Honors points accounted for in financial statements before they are redeemed?",
        "response": "Before Hilton Honors points are redeemed, the expected payments to third parties and estimated breakage are evaluated and adjusted, thus influencing the revenue recognized from these points when they are eventually redeemed.",
        "source": "finqa"
    },
    {
        "query": "In which section of Form 10-K do financial statements and supplementary data begin?",
        "response": "Page F-1",
        "source": "finqa"
    },
    {
        "query": "What specific actions were initiated by employees against Costco in the Nevarez v. Costco Wholesale Corp. case?",
        "response": "Employees filed claims for failure to pay overtime, to provide meal and rest periods and itemized wage statements, to timely pay wages due to terminating employees, to pay minimum wages, and for engaging in unfair business practices.",
        "source": "finqa"
    },
    {
        "query": "How is the information in Note 15 presented in relation to the document?",
        "response": "It is incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "What is the role of management in maintaining internal control over financial reporting at a company?",
        "response": "Management is responsible for establishing and maintaining adequate internal control over financial reporting. This includes defining policies and procedures for conducting and governing the business, employing sophisticated information systems for transaction processing, and ensuring that staff are properly trained. Management also regularly monitors and tests the effectiveness of these controls, and corrective actions are taken when deficiencies are identified.",
        "source": "finqa"
    },
    {
        "query": "What methods can be used to obtain a copy of Intuit Inc.'s Annual Report on Form 10-K?",
        "response": "A copy of Intuit Inc.'s Annual Report on Form 10-K can be obtained by contacting Investor Relations via post, phone, or email, without incurring any charges.",
        "source": "finqa"
    },
    {
        "query": "How many cores do the Ryzen Threadripper 7000 Series processors feature?",
        "response": "Up to 64 cores",
        "source": "finqa"
    },
    {
        "query": "What was the net earnings for the company in 2023 as reported in the document?",
        "response": "The net earnings for the company in 2023 were $12,759 million.",
        "source": "finqa"
    },
    {
        "query": "How does the Charles Schwab Corporation manage its interest rate risk?",
        "response": "The Charles Schwab Corporation manages its interest rate risk through net interest revenue simulation modeling, using derivative instruments, projecting interest rate scenarios with rate floors, managing prepayment speeds, repricing of financial instruments, and adjusting the asset and liability composition.",
        "source": "finqa"
    },
    {
        "query": "What are the effective durations of the total Available-for-Sale (AFS) and Held-to-Maturity (HTM) investment securities as of December 31, 2023?",
        "response": "The effective duration of total AFS and HTM investment securities as of December 31, 2023 is approximately 3.9 years.",
        "source": "finqa"
    },
    {
        "query": "What was the Adjusted Free Cash Flow for the fiscal year ending June 30, 2023, according to the text?",
        "response": "The Adjusted Free Cash Flow for the fiscal year ending June 30, 2023 was $14,011 million.",
        "source": "finqa"
    },
    {
        "query": "What is Jamie S. Gorelick's current profession and where?",
        "response": "Partner at Wilmer Cutler Pickering Hale and Dorr LLP",
        "source": "finqa"
    },
    {
        "query": "What growth strategy does lululemon plan to employ for their operations in China Mainland?",
        "response": "Lululemon plans to continue expanding its operations and building brand awareness in China Mainland, anticipating that this will drive an increase in international net revenue.",
        "source": "finqa"
    },
    {
        "query": "What was Amazon's total non-operating income (expense) in 2023?",
        "response": "Amazon's total non-operating income (expense) for 2023 was $705 million.",
        "source": "finqa"
    },
    {
        "query": "What is GameStop's approach to building relationships with its vendors?",
        "response": "GameStop believes that maintaining and strengthening long-term relationships with its vendors is essential to its operations.",
        "source": "finqa"
    },
    {
        "query": "What was the IRS seeking in the notice of deficiency issued to the company on September 17, 2015?",
        "response": "The IRS was seeking approximately $3.3 billion of additional federal income tax for the years 2007 through 2009 by reallocating over $9 billion of income from foreign affiliates to the U.S. parent company.",
        "source": "finqa"
    },
    {
        "query": "What impact did the superfund transformation costs have in terms of financials in 2020 and 2021?",
        "response": "Pre-tax adjustment for transformation costs was $111 in 2020 and $136 in 2021.",
        "source": "finqa"
    },
    {
        "query": "What does the Comprehensive Environmental Response, Compensation and Liability Act impose on property owners?",
        "response": "The Comprehensive Environmental Response, Compensation and Liability Act imposes liability on property owners for the cost of removal or remediation of hazardous substances, even if they were not responsible for the release of such substances.",
        "source": "finqa"
    },
    {
        "query": "How are direct and indirect reimbursements recognized as revenue for managed and franchised properties?",
        "response": "Direct reimbursements are recognized based on the amount of expenses incurred, while indirect reimbursements are typically based on the underlying hotel's sales or usage and recognized as services are provided.",
        "source": "finqa"
    },
    {
        "query": "What specific measures contributed to the increase in cash flow from operating activities in 2023?",
        "response": "The increase in cash flow from operating activities in 2023 was primarily due to a higher net income, an increase in cash collection from customers, and a decrease in payments to vendors.",
        "source": "finqa"
    },
    {
        "query": "How does HPE address the need for talent and culture within the organization?",
        "response": "HPE addresses the need for talent and culture by investing in team members, embedding key cultural beliefs into daily operations, conducting global engagement surveys, and focusing on diversity, equity, and inclusion initiatives.",
        "source": "finqa"
    },
    {
        "query": "What advancement in charging standard did Tesla introduce in November 2022?",
        "response": "In November 2022, Tesla opened up their previously proprietary charging connector as the North American Charging Standard (NACS), allowing all electric vehicles and charging stations to interoperate.",
        "source": "finqa"
    },
    {
        "query": "What courses does Starbucks encourage its U.S.-based partners to enroll in to promote an inclusive culture?",
        "response": "Starbucks encourages its U.S.-based partners to enroll in the 'To Be Welcoming' courses, created in partnership with Arizona State University, to address different forms of bias and discrimination.",
        "source": "finqa"
    },
    {
        "query": "What total amount in gross proceeds did GameStop generate from the sales under the ATM Transactions in fiscal 2021?",
        "response": "$1.68 billion",
        "source": "finqa"
    },
    {
        "query": "How did macroeconomic conditions impact FedEx's operating results in 2023?",
        "response": "In 2023, FedEx's operating results were negatively affected by macroeconomic conditions, including inflation above historical levels and high global interest rates, contributing to elevated operating expenses relative to demand.",
        "source": "finqa"
    },
    {
        "query": "What financial documents are included in this report?",
        "response": "Financial documents included in this report are the Report of Independent Registered Public Accounting Firm, Financial Statements, Notes to the Financial Statements, and the Financial Statement Schedule.",
        "source": "finqa"
    },
    {
        "query": "What was the U.S. minimum hourly wage for Bank of America employees increased to in October 2023?",
        "response": "$23 per hour",
        "source": "finqa"
    },
    {
        "query": "What were the risk-free interest rates for the fiscal years 2021, 2022, and 2023?",
        "response": "0.3%, 1.4%, and 4.0% respectively",
        "source": "finqa"
    },
    {
        "query": "What amount did the Company record in Equity income in investee for the years 2023, 2022, and 2021?",
        "response": "The Company recorded gains of $16 million, $14 million, and $6 million in Equity income in investee for the years 2023, 2022, and 2021, respectively.",
        "source": "finqa"
    },
    {
        "query": "What are the components excluded in the calculation of Adjusted EBITDA?",
        "response": "Adjusted EBITDA is calculated by excluding certain items from EBITDA such as gains, losses, revenues and expenses related to asset dispositions, foreign currency transactions, debt restructurings, replacements reserves for furnished equipment at leased hotels, share-based compensation, reorganization costs, non-cash impairment, and the net effect of cost reimbursement revenues and expenses.",
        "source": "finqa"
    },
    {
        "query": "For which conditions is Stribild indicated?",
        "response": "Stribild is indicated for the treatment of HIV-1 infection in certain patients.",
        "source": "finqa"
    },
    {
        "query": "What financial benefits does Comcast offer to its employees?",
        "response": "Comcast provides a 401(k) retirement plan with company match, employee stock purchase plans with discounts, annual awards of restricted stock units and stock options, and financial literacy training and counseling.",
        "source": "finqa"
    },
    {
        "query": "How long do Enterprise Agreements last and who are they designed for?",
        "response": "Enterprise Agreements are designed for medium or large organizations to license cloud services and on-premises software organization-wide and last for a three-year period.",
        "source": "finqa"
    },
    {
        "query": "How does seasonality affect the company's fourth-quarter billing?",
        "response": "There is a disproportionate weighting toward annual billings in the fourth quarter due to large enterprise account buying patterns.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Free Cash Flow Margin from the previous year to 2023?",
        "response": "The Free Cash Flow Margin increased from 39% to 41% from the previous year to 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the key categories included in a company's annual operating expenses?",
        "response": "The key categories included in a company's annual operating expensess are marketing, product development, general and administrative expenses, and asset impairment charges.",
        "source": "finqa"
    },
    {
        "query": "How is noncontrolling interest accounted for in a company's financial statements?",
        "response": "Noncontrolling interest is recorded in the earnings and equity of entities less than 100% owned but controlled by the company. Adjustments are made to noncontrolling interests for the allocable portion of income or loss based on the noncontrolling interest holders’ share of subsidiaries. Noncontrolling interests are reported under the heading 'Net income attributable to noncontrolling interests' in the consolidated statements of income and presented as a component of equity in the consolidated balance sheets.",
        "source": "finqa"
    },
    {
        "query": "What was the total gross unrecognized tax benefit recorded as of December 31, 2023?",
        "response": "$112.0 million",
        "source": "finqa"
    },
    {
        "query": "In which part of the Annual Report on Form 10-K are the consolidated financial statements and accompanying notes listed?",
        "response": "They are listed in Part IV, Item 15(a)(1).",
        "source": "finqa"
    },
    {
        "query": "What has historically caused Apple to experience higher net sales in its first quarter compared to other quarters?",
        "response": "Seasonal holiday demand has historically caused Apple to experience higher net sales in its first quarter compared to other quarters.",
        "source": "finqa"
    },
    {
        "query": "Which section of the financial document outlines details regarding Commitments and Contingencies specifically linked to legal proceedings?",
        "response": "The section titled 'Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings' in Item 8 of Part II outlines details regarding Commitments and Contingencies specifically linked to legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How much was borrowed under the Japanese yen-denominated credit facilities as of October 1, 2023?",
        "response": "As of October 1, 2023, ¥5 billion, or $33.5 million, of borrowings were outstanding under the Japanese yen-denominated credit facilities.",
        "source": "finqa"
    },
    {
        "query": "What percentage of BNSF Railway's freight revenue for the year ending December 31, 2023, came from consumer products?",
        "response": "34% of BNSF Railway's freight revenue for the year ending December 31, 2023, was derived from consumer products.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the increased audit effort for PCC goodwill and indefinite-lived intangible assets?",
        "response": "The primary reason for the increased audit effort was the significant judgments made by management in evaluating potential impairment of PCC goodwill and PCC indefinite-lived intangible assets, which required a high degree of auditor judgment.",
        "source": "finqa"
    },
    {
        "query": "What factors can affect the overall effective tax rate of a company?",
        "response": "The overall effective tax rate can be affected by factors such as acquisitions, changes in international corporate structure, geographic location of business functions or assets, the geographic mix and amount of income, agreements with tax authorities, valuation allowances, applicable accounting rules, tax laws and regulations, and variations in estimated and actual pre-tax income.",
        "source": "finqa"
    },
    {
        "query": "Which item in the report contains the information incorporated into Item 3 regarding Legal Proceedings?",
        "response": "Item 8 of the report contains the information incorporated into Item 3 regarding Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Note 17 in the consolidated financial statements?",
        "response": "Note 17, titled 'Litigation and Contingencies', provides information regarding legal proceedings associated with the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "What are the potential consequences if a company infringes the valid patents of third parties?",
        "response": "If a company infringes the valid patents of third parties, it may face damage to its reputation, significant monetary damages, prevention from commercializing certain products, and necessity to obtain licenses, potentially on unfavorable terms or not at all, which can impede the development and commercialization of its products.",
        "source": "finqa"
    },
    {
        "query": "What were the total client assets at Schwab at the end of 2022?",
        "response": "$7.05 trillion",
        "source": "finqa"
    },
    {
        "query": "What was the cap price per share for the Capped Calls related to the 2026 Notes?",
        "response": "$360.80",
        "source": "finqa"
    },
    {
        "query": "What percentage discount do employees receive on Chipotle's common stock through the Employee Stock Purchase Plan (ESPP)?",
        "response": "7.5%",
        "source": "finqa"
    },
    {
        "query": "Where in IBM’s 2023 Annual Report can the financial statements and supplementary data be found?",
        "response": "Pages 44 to 121.",
        "source": "finqa"
    },
    {
        "query": "How many full-time employees were employed by the company as of December 31, 2023, and how are they distributed geographically?",
        "response": "As of December 31, 2023, the company employed about 113,200 full-time persons, with approximately 62,400 located outside the United States and about 50,800 inside the United States.",
        "source": "finqa"
    },
    {
        "query": "What section in a financial report provides financial statements and supplementary data?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "Why did payroll expenses increase in 2022, and how did it impact the overall expense rate?",
        "response": "Payroll expenses increased primarily due to minimum wage increases and other investments in store payroll, resulting in an 85 basis points increase in the overall expense rate.",
        "source": "finqa"
    },
    {
        "query": "What type of legal action did the company seek in the initial lawsuit filed against Aqua-Chem in Georgia in 2002?",
        "response": "The company sought a declaratory judgment that it has no obligations to Aqua-Chem for any liabilities or expenses related to claims or lawsuits against Aqua-Chem.",
        "source": "finqa"
    },
    {
        "query": "What caused the increase in Medicare receivables in 2023 compared to 2022?",
        "response": "The increase in Medicare receivables in 2023 was primarily due to membership growth in Medicare Advantage and the timing of accruals and collections associated with the CMS risk-adjustment model.",
        "source": "finqa"
    },
    {
        "query": "How did changes in foreign exchange rates affect the cost of sales in 2023?",
        "response": "Changes in foreign exchange rates reduced the cost of sales by $254 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did the company spend on repurchasing shares during the year 2023?",
        "response": "$62.2 billion",
        "source": "finqa"
    },
    {
        "query": "How does Chipotle treat payment terms in Marketplace Sales?",
        "response": "Chipotle receives payment from the delivery partner subsequent to the transfer of food, and the payment terms are short-term in nature.",
        "source": "finqa"
    },
    {
        "query": "What should one refer to for details about the legal proceedings of a company?",
        "response": "One should refer to Note 12 to the Consolidated Financial Statements for details about a company's legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What services do companies that build fiber-based networks provide in the Connectivity & Platforms markets?",
        "response": "Bundled services including wireless and broadband",
        "source": "finqa"
    }
]