[
    {
        "query": "What factors contributed to the decrease in GM North America's EBIT-adjusted in 2023?",
        "response": "Increased cost primarily from warranty-related initiatives and EV-related charges, unfavorable vehicle mix shifts, and other operational expenses were major contributors.",
        "source": "finqa"
    },
    {
        "query": "What was the purpose stated by AbbVie for borrowing $5.0 billion under the term loan credit agreement on February 12, 2024?",
        "response": "The text does not specify the purpose for borrowing $5.0 billion under the term loan credit agreement on February 12, 2024.",
        "source": "finqa"
    },
    {
        "query": "What was the cash flow from investing activities in 2023?",
        "response": "The cash flow from investing activities in 2023 was $(49.8) billion.",
        "source": "finqa"
    },
    {
        "query": "What are the liquidity requirements under the Liquidity Coverage Ratio (LCR) rule for Charles Schwab?",
        "response": "Under the LCR rule, Charles Schwach is required to maintain a sufficient amount of High Quality Liquid Assets to cover 100% of the total stressed net cash outflows over a 30-day stress period.",
        "source": "finqa"
    },
    {
        "query": "What was the total of Visa Inc.'s current assets as of September 30, 2023?",
        "response": "$33,532 million",
        "source": "finqa"
    },
    {
        "query": "How are the consolidated financial statements and accompanying notes organized in the Annual Report on Form 10-K?",
        "response": "They are listed under Part IV, Item 15(a)(1).",
        "source": "finqa"
    },
    {
        "query": "What have some vendors requested due to their impacts in the supply chain financing market?",
        "response": "Some vendors have requested credit support collateral for inventory purchase obligations.",
        "source": "finqa"
    },
    {
        "query": "What expansion is planned for the Ocala, Florida distribution center and when?",
        "response": "A significant expansion of the Ocala, Florida distribution center is planned for 2024, which will include enhanced automation.",
        "source": "finqa"
    },
    {
        "query": "What is the focus of the Personal Systems segment at HP Inc.?",
        "response": "The Personal Systems segment focuses on profitable growth through innovation, market segmentation, simplification of the portfolio, investing in endpoint services and solutions, and driving innovation for productivity and collaboration in hybrid work environments.",
        "source": "finqa"
    },
    {
        "query": "What types of guarantees does Tesla provide to its solar and energy storage customers?",
        "response": "Tesla provides customers with performance guarantees that commit that the underlying system will meet or exceed the minimum energy generation or performance requirements specified in the contract.",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements and accompanying notes found in the annual report?",
        "response": "They are included immediately following Part IV and are incorporated by reference therein.",
        "source": "finqa"
    },
    {
        "query": "What financial impact did the actuarial adjustments of pension and postretirement healthcare plans have in 2023 compared to 2022?",
        "response": "In 2023, there was a pre-tax noncash MTM gain of $650 million ($493 million, net of tax) compared to a $1.6 billion loss in 2022 ($1.2 billion, net of tax).",
        "source": "finqa"
    },
    {
        "query": "What were the main causes for the increase in cash provided by operating activities during fiscal year 2023?",
        "response": "Higher net income and lower non-cash adjustments",
        "source": "finqa"
    },
    {
        "query": "What were the year-end discount rates for U.S. and Non-U.S. pension plans in 2023?",
        "response": "5.17% for U.S. plans and 3.98% for Non-U.S. plans",
        "source": "finqa"
    },
    {
        "query": "How will the Inflation Reduction Act of 2022 impact Medicare Part D and Part B drug pricing?",
        "response": "The Inflation Reduction Act requires government-set prices for select drugs more than nine years from FDA approval and mandates rebates when drug prices increase faster than inflation.",
        "source": "finqa"
    },
    {
        "query": "What are the primary types of financial statements included in Delta Air Lines, Inc.'s 2023 Form 10-K?",
        "response": "The primary types of financial statements included are the consolidated balance sheets, consolidated statements of operations, consolidated statements of comprehensive income, consolidated statements of cash flows, and consolidated statements of stockholders' equity.",
        "source": "finqa"
    },
    {
        "query": "What are the factors that could affect a company's credit ratings?",
        "response": "Factors that could affect a company's credit ratings include changes in its operating performance, the general economic environment, conditions in the retail industry, the company's financial position, including its total debt and capitalization, and changes in its business strategy.",
        "source": "finqa"
    },
    {
        "query": "What original companies formed IBM in 1911?",
        "response": "IBM was formed from the consolidation of the Computing Scale Co. of America, the Tabulating Machine Co., and The International Time Recording Co. of New York.",
        "source": "finqa"
    },
    {
        "query": "How much did general and administrative expenses related to merger, acquisition, and other costs change from 2022 to 2023?",
        "response": "Decreased by 37.0%",
        "source": "finqa"
    },
    {
        "query": "By how much did the consolidated operating income increase in 2023 compared to 2022?",
        "response": "$402 million, or 4%",
        "source": "finqa"
    },
    {
        "query": "What is the total notional amount of forward-starting interest rate and treasury lock contracts designated as cash flow hedging instruments as of December 31, 2023?",
        "response": "$1.10 billion",
        "source": "finqa"
    },
    {
        "query": "What phase of renovation was announced for Marina Bay Sands in 2023?",
        "response": "In 2023, the next phase of renovation for Marina Bay Sands involved the renovation of the Tower 3 hotel rooms into world-class suites and other property changes.",
        "source": "finqa"
    },
    {
        "query": "What is the headcount of Apple's full-time equivalent employees as of September 30, 2023?",
        "response": "As of September 30, 2023, Apple had approximately 161,000 full-time equivalent employees.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in research and development expense for Enphase Energy in the year ended December 31, 2023?",
        "response": "35%",
        "source": "finqa"
    },
    {
        "query": "What were the non-cash impairment losses recognized on theatres in the U.S. markets during the year ended December 31, 2023?",
        "response": "$49.2 million",
        "source": "finqa"
    },
    {
        "query": "What types of share-based compensation awards does Procter & Gamble offer to certain managers and directors, and what are the main characteristics of these awards?",
        "response": "Procter & Gamble offers stock options, restricted stock units (RSUs), and performance stock units (PSUs) as share-based compensation awards to certain managers and directors. The main characteristics include stock options and RSUs being available annually for managers to elect, with all options vesting after three years and having a ten-year life. Exercise prices are set equal to the market price on the grant date. RSUs vest and settle in shares three years from the grant date. PSUs are awarded to senior-level executives and are paid in shares after a three-year performance period subject to pre-established goals, with the number of shares granted also impacted by the company's actual shareholder return relative to its peer set.",
        "source": "finqa"
    },
    {
        "query": "What led to the deterioration of Corporate Other's EBIT in 2023 compared to 2022?",
        "response": "The EBIT deterioration was primarily driven by lower past service pension and OPEB income, although it was partially offset by higher Company excluding Ford Credit interest income due to higher interest rates.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in Iron Mountain's storage rental revenue in 2023?",
        "response": "The increase in storage rental revenue in 2023 was driven by organic growth from increased volume in faster-growing markets and Global Data Center Business segment alongside revenue management.",
        "source": "finqa"
    },
    {
        "query": "What types of Medicare plans does the company offer and what are the key benefits provided?",
        "response": "The company offers Medicare eligible persons a variety of plans such as HMO, PPO, Private Fee-For-Service (PFFS), and Special Needs Plans, including Dual Eligible Special Needs Plans (D-SNP). Key benefits generally include reduced cost sharing, enhanced prescription drug benefits, care coordination, and various health management programs. Most Medicare Advantage plans also include the prescription drug benefit under Part D, with subject to cost sharing and other limitations.",
        "source": "finqa"
    },
    {
        "query": "What are the conditions under which AENB is restricted from making dividend distributions to TRS without OCC approval?",
        "response": "AENB is prohibited from making dividend distributions to TRS without OCC approval if such distributions are not paid out of available recent earnings or would cause AENB to fail to meet capital adequacy standards.",
        "source": "finqa"
    },
    {
        "query": "What was the main reason for the termination of NVIDIA's Share Purchase Agreement with SoftBank?",
        "response": "The main reason for the termination of NVIDIA's Share Purchase Agreement with SoftBank was significant regulatory challenges that prevented the completion of the transaction.",
        "source": "finqa"
    },
    {
        "query": "How much did Gross Merchandise Sales (GMS) for Depop amount to in the year 2023?",
        "response": "$942.1 million",
        "source": "finqa"
    },
    {
        "query": "What are Core Net New Client Assets?",
        "response": "Core net new client assets are the net new client assets excluding significant one-time inflows or outflows related to events like acquisitions or extraordinary client activity, and do not include off-platform brokered CDs issued by CSB.",
        "source": "finqa"
    },
    {
        "query": "What percentage of a global firm's workforce was based in strategic locations as of December 2023?",
        "response": "41%",
        "source": "finqa"
    },
    {
        "query": "Who is the independent registered public accounting firm for this report and what is their PCAOB ID?",
        "response": "The independent registered public accounting firm for this report is PricewaterhouseCoopers LLP with PCAOB ID 238.",
        "source": "finqa"
    },
    {
        "query": "How much did the company repay on the Term Loan between September and December 2023?",
        "response": "The company repaid $800 million on the Term Loan between September and December 2023.",
        "source": "finqa"
    },
    {
        "query": "What partnerships does Visa seek to foster?",
        "response": "Visa partners with both traditional and emerging players in the payments ecosystem to innovate and expand, allowing them to use the resources of Visa's platform to scale and grow their businesses.",
        "source": "finqa"
    },
    {
        "query": "What movies contributed to higher revenue in 2023 compared to the previous year?",
        "response": "The Super Mario Bros. Movie, Oppenheimer, and Fast X",
        "source": "finqa"
    },
    {
        "query": "What was the total net cash provided by operating activities in 2023?",
        "response": "$3,884 million",
        "source": "finqa"
    },
    {
        "query": "What percentage increase did the Hilton Honors guest loyalty program see from December 31, 2022, to December 31, 2023?",
        "response": "19 percent increase",
        "source": "finqa"
    },
    {
        "query": "What is the definition of Adjusted EBITDA according to Iron Mountain?",
        "response": "Adjusted EBITDA is defined as net income (loss) before interest expense, net, provision (benefit) for income taxes, depreciation and amortization, and excluding certain items not indicative of core operating results such as acquisition and integration costs, restructuring and other transformation costs, and gains or losses on disposal or write-down of property, plant and equipment, among others.",
        "source": "finqa"
    },
    {
        "query": "What positions did Charlie Pleas, III hold within the company before being named Senior Vice President, Finance and Accounting in 2021?",
        "response": "Senior Vice President and Controller during 2007",
        "source": "finqa"
    },
    {
        "query": "In the context of Hewlett Packard Enterprise's recent financial discussions, what factors are expected to impact their operational costs and revenue growth moving forward?",
        "response": "Factors such as the mildly improving industry-wide supply constraints, fluctuations in foreign exchange rates, persistent inflationary pressures, and the implementation of new tax developments like the global minimum corporate tax are expected to impact their operational costs and moderate revenue growth.",
        "source": "finqa"
    },
    {
        "query": "Is there a specific location within the Annual Report on Form 10-K where the consolidated financial statements and accompanying notes are included?",
        "response": "Yes, they are included in Part IV, Item 15(a)(1)",
        "source": "finqa"
    },
    {
        "query": "What was the increase in interest income for the year ended December 31, 2023 compared to 2022?",
        "response": "Interest income increased by $112.3 million for the year ended December 31, 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What approach is used to test goodwill for impairment at The Hershey Company?",
        "response": "The Hershey Company conducts annual impairment tests for goodwill either through a qualitative assessment evaluating economic, industry, and company-specific factors, or through a quantitative approach that compares the fair value of a reporting unit with its carrying amount. If fair value is less than the carrying amount, a goodwill impairment is recognized.",
        "source": "finqa"
    },
    {
        "query": "Why should forward-looking statements not be relied upon as predictions of future events according to the document?",
        "response": "Forward-looking statements should not be relied upon as predictions of future events because the actual events or circumstances may differ materially from those projected in the statements.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the auto OEM gross margin decrease in the fiscal year 2023 compared to the year-ago period?",
        "response": "870 basis points",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decrease in royalty expense in 2023?",
        "response": "Lower sales of certain Partner Brands products with higher royalty rates, exit of certain license agreements in December 2022, and lower royalty expense associated with the eOne Film & TV business.",
        "source": "finqa"
    },
    {
        "query": "How much did depreciation and amortization total to in the financial statements?",
        "response": "$4,856",
        "source": "finqa"
    },
    {
        "query": "In what ways is Alphabet diversifying its revenue streams beyond advertising?",
        "response": "Alphabet is expanding its revenue sources by growing its cloud services, consumer subscriptions, platforms, and devices sectors, which generally have lower margins compared to traditional advertising revenues.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Eli Lilly and Company?",
        "response": "The purpose of Eli Lilly and Company is to unite caring with discovery to create medicines that make life better for people around the world.",
        "source": "finqa"
    },
    {
        "query": "What was the return on tangible common equity for The Charles Schwab Corporation in 2023?",
        "response": "54%",
        "source": "finqa"
    },
    {
        "query": "What was the impairment loss recorded by the company for its equity interest in the Network for the year ended December 31, 2023?",
        "response": "$1.3 million",
        "source": "finqa"
    },
    {
        "query": "What are the primary currencies that pose a foreign currency risk to the company besides the U.S. dollar?",
        "response": "The primary currencies that pose a foreign currency risk to the company besides the U.S. dollar are the Chinese yuan and the euro.",
        "source": "finqa"
    },
    {
        "query": "What are the conditions under which the company may redeem the Notes for cash?",
        "response": "The company may redeem the Notes for cash on or after February 20, 2024 and on or before the 20th scheduled trading day immediately before the maturity date. Redemption is contingent upon the condition that the last reported sale price per share of the Class A common stock exceeds 130% of the conversion price on each of at least 20 trading days during a 30-day period ending the day immediately preceding the notice of redemption, and also on the trading day immediately before the notice is sent.",
        "source": "finqa"
    },
    {
        "query": "What are the primary features of Apollo, and when was it first offered commercially?",
        "response": "Apollo is a cloud-agnostic software that provides a single control layer for delivering new features, security updates, and platform configurations. It was first offered commercially in 2021 and enables continuous operation of critical systems across various environments.",
        "source": "finqa"
    },
    {
        "query": "What rights do note holders have in the event of a change in control according to the terms mentioned?",
        "response": "Note holders have the right to require the repurchase of their notes at a price equal to 101% of the principal amount, plus accrued and unpaid interest.",
        "source": "finqa"
    },
    {
        "query": "What did Carin L. Fike do at Kroger before becoming Vice President and Treasurer?",
        "response": "Before becoming Vice President and Treasurer, Carin L. Fike served as Assistant Treasurer and Director of Investor Relations at Kroger.",
        "source": "finqa"
    },
    {
        "query": "Where are Salesforce's principal executive offices located?",
        "response": "Salesforce's principal executive offices are located at Salesforce Tower, 415 Mission St, 3rd Floor, in San Francisco, California.",
        "source": "finqa"
    },
    {
        "query": "What are the goals defined in General Motors' vision for the future?",
        "response": "Zero crashes, zero emissions, and zero congestion",
        "source": "finqa"
    },
    {
        "query": "What are the primary liabilities related to the run-off business mentioned in the text?",
        "response": "The primary liabilities related to the run-off business are asbestos and environmental (A&E) liabilities and molestation claims.",
        "source": "finqa"
    },
    {
        "query": "What constitutes the core business of the company's Data Center Segment customers?",
        "response": "The Data Center Segment customers mainly consist of hyperscale data centers, original equipment manufacturers (OEMs), original design manufacturers (ODMs), system integrators, and independent distributors in both domestic and international markets.",
        "source": "finqa"
    },
    {
        "query": "What factors can cause variations in fulfillment costs as a percentage of net sales?",
        "response": "Variations in fulfillment costs as a percentage of net sales can be caused by several factors including changes in volume, unit size and weight, the use of Fulfillment by Amazon services by third-party sellers, fulfillment network expansion timing, and the mix of products and services sold.",
        "source": "finqa"
    },
    {
        "query": "What effects did inflation have on the company's operating results during 2022 and 2023?",
        "response": "Inflationary factors such as increases in wage rates and air freight costs impacted the company's operating and gross margins during 2022 and 2023.",
        "source": "finqa"
    },
    {
        "query": "What method is employed to determine the fair value of customer and supplier relationship intangible assets?",
        "response": "Discounted cash flow models are employed to determine the fair value of customer and supplier relationship intangible assets.",
        "source": "finqa"
    },
    {
        "query": "How are voluntary and involuntary cancellations different according to the provided information?",
        "response": "Voluntary cancellations generally become effective at the end of the prepaid membership period, while involuntary cancellations, such as those resulting from a failed payment method, become effective immediately.",
        "source": "finqa"
    },
    {
        "query": "How is information about legal proceedings structured in a 10-K document?",
        "response": "Information about legal proceedings is indicated in Item 3, detailed in Note 16, and further elaborated in Item 8 of Part II.",
        "source": "finqa"
    },
    {
        "query": "How often does senior management recommend modifications to the capital allocation program to the Board of Directors?",
        "response": "Senior management recommends modifications to the capital allocation program to the Board of Directors not less than once annually.",
        "source": "finqa"
    },
    {
        "query": "How is the discount rate used in measuring projected benefit obligations developed?",
        "response": "The discount rate is developed by using the yield on a theoretical portfolio of high-grade corporate bonds that are selected to match the cash flows to benefit payments, limit concentration by industry and issuer, and exclude bonds with a call feature unless there is a low probability of them being called.",
        "source": "finqa"
    },
    {
        "query": "What additional revenue sources does Google Services have beyond advertising?",
        "response": "Beyond advertising, Google Services generates revenue from consumer subscriptions, platforms, and device sales; specifically from YouTube services, Google Play, and the Pixel family of devices.",
        "source": "finqa"
    },
    {
        "query": "What is the primary business of AMC Entertainment Holdings, Inc.?",
        "response": "AMC Entertainment Holdings, Inc. is principally involved in the theatrical exhibition business.",
        "source": "finqa"
    },
    {
        "query": "What was the effective tax rate for 2023 and how did it compare to 2022?",
        "response": "The effective tax rate was 25.9% for 2023, compared to 21.9% for 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the potential financial impact on our investment portfolio if the enterprise values of our largest privately held equity securities decrease by ten percent?",
        "response": "A ten percent decrease in the enterprise values of our largest privately held equity securities, representing 37 percent of our total strategic investments as of January 31, 2023, could result in a $115 million reduction in the value of our investment portfolio.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's net revenues is generated internationally?",
        "response": "Approximately half of the company's net revenues are generated internationally.",
        "source": "finqa"
    },
    {
        "query": "How much did dividends per common share increase in 2023?",
        "response": "Dividends per common share increased by 4% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What steps are followed by the company to recognize revenue from its sales?",
        "response": "The company follows five steps to recognize revenue from its sales: identification of the contract with a customer, identification of the performance obligations in the contract, determination of the transaction price, allocation of the transaction price to the performance obligations in the contract, and recognition of revenue when or as it satisfies a performance obligation.",
        "source": "finqa"
    },
    {
        "query": "Does Item 8 directly contain the financial statements and supplementary data?",
        "response": "No, the information is included in Item 15(a)",
        "source": "finqa"
    },
    {
        "query": "What is the predominant strategy for monetizing the company's substantial majority of owned film and television content?",
        "response": "on an individual basis",
        "source": "finqa"
    },
    {
        "query": "What was the initial price per share for the stocks received from the 2023 $2.0 billion ASR with Citibank?",
        "response": "$92.19 per share",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of equipment acquired under finance leases in 2023?",
        "response": "In 2023, the total amount of equipment acquired under finance leases was $310 million.",
        "source": "finqa"
    },
    {
        "query": "What do the pages 44 through 121 of IBM’s 2023 Annual Report to Stockholders contain?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "When does Chevron's interest in the Lianzi Unitization Zone expire?",
        "response": "2031",
        "source": "finqa"
    },
    {
        "query": "What was the revenue attributed to Japan in the year 2023?",
        "response": "2,367.0 million",
        "source": "finqa"
    },
    {
        "query": "What percentage of the company's total costs and expenses in 2023 were recognized in the Family of Apps segment?",
        "response": "In 2023, 80% of the company's total costs and expenses were recognized in the Family of Apps segment.",
        "source": "finqa"
    },
    {
        "query": "What is the seating capacity of the theater at the Parisian Macao?",
        "response": "1,200 seats",
        "source": "finqa"
    },
    {
        "query": "What type of merchandising strategy does AutoZone employ to ensure customer satisfaction?",
        "response": "AutoZone employs a targeted merchandising strategy that includes tailoring store inventory to the specific vehicle profiles and demographics of the local area, ensuring prompt availability of desired automotive products.",
        "source": "finqa"
    },
    {
        "query": "What are the key components of the HPE Aruba Networking product portfolio?",
        "response": "The HPE Aruba Networking portfolio includes networking hardware such as switches and gateways, and software solutions including cloud-based network management and analytics.",
        "source": "finqa"
    },
    {
        "query": "What was the ME&T free cash flow amount reported in 2023?",
        "response": "$10,025 million",
        "source": "finqa"
    },
    {
        "query": "What is the significance of Part IV, Item 15(a)(1) in an Annual Report on Form 10-K?",
        "response": "It is significant as it lists the consolidated financial statements and accompanying notes.",
        "source": "finqa"
    },
    {
        "query": "What type of travel partners can Hilton Honors members transact with using their points?",
        "response": "Hilton Honors members can transact with a variety of travel partners using their points, including airlines, rail and car rental companies.",
        "source": "finqa"
    },
    {
        "query": "Where in a document can one expect to find details on supplementary data and financial statements?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What is Organic Sales Growth defined as in the text?",
        "response": "Organic Sales Growth is defined as the measure of sales growth excluding the impacts of acquisitions, divestitures, and foreign exchange from year-over-year comparisons.",
        "source": "finqa"
    },
    {
        "query": "What were the net catastrophe losses in 2023, 2022, and 2021?",
        "response": "In 2023, the net catastrophe losses were $1,828 million, in 2022 they were $2,182 million, and in 2021 they were $2,401 million.",
        "source": "finqa"
    },
    {
        "query": "What percentage of net revenues came from Mutual Funds, ETFs, and Collective Trust Funds (CTFs) in 2023?",
        "response": "13%",
        "source": "finqa"
    },
    {
        "query": "What types of professional customers does The Home Depot cater to?",
        "response": "professional renovators/remodelers, general contractors, maintenance professionals, handymen, property managers, building service contractors, and specialty tradespeople",
        "source": "finqa"
    },
    {
        "query": "What is the company's target for shareholder distributions as a percentage of its adjusted free cash flow?",
        "response": "The company targets shareholder distributions to be between 40% to 50% of adjusted free cash flow.",
        "source": "finqa"
    },
    {
        "query": "What types of products does AutoZone offer in its stores?",
        "response": "AutoZone offers automotive hard parts, maintenance items, accessories, and non-automotive products in its stores.",
        "source": "finqa"
    },
    {
        "query": "What are included immediately following Part IV in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1) are included immediately following Part IV in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "How many supermarkets does Kroger operate and what additional features do these include?",
        "response": "As of January 28, 2023, Kroger operates 2,719 supermarkets, of which 2,252 have pharmacies and 1,637 have fuel centers.",
        "source": "finqa"
    },
    {
        "query": "In 2023, how many employees at a global firm were trained in Mental Health First Aid certification?",
        "response": "600",
        "source": "finqa"
    },
    {
        "query": "When did the Company announce a new share repurchase program and raise its quarterly dividend?",
        "response": "In May 2023, the Company announced a new share repurchase program of up to $90 billion and raised its quarterly dividend from $0.23 to $0.24 per share.",
        "source": "finqa"
    },
    {
        "query": "What is the main focus of the Productivity and Business Processes segment at Microsoft?",
        "response": "The Productivity and Business Processes segment at Microsoft focuses on productivity, communication, and information services across various devices and platforms.",
        "source": "finqa"
    },
    {
        "query": "What caused the decrease in total operating revenue for Workforce Solutions in 2023?",
        "response": "A decline in Verification Services, particularly in the mortgage vertical, partly offset by growth in Employer Services.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in the capacity of the common stock repurchase program as of November 2023?",
        "response": "In November 2023, the capacity under the common stock repurchase program was increased by $10.0 billion to a total of $11.4 billion.",
        "source": "finqa"
    },
    {
        "query": "What percentage of our total U.S. dialysis patients in 2023 was covered under some form of government-based program?",
        "response": "89%",
        "source": "finqa"
    },
    {
        "query": "How long has Enrique Lores served as President and Chief Executive Officer of HP as of the last update?",
        "response": "Since November 2019",
        "source": "finqa"
    },
    {
        "query": "What was the total amount repurchased by the company in fiscal years 2022 and 2023 under the share repurchase program?",
        "response": "$5.0 billion",
        "source": "finqa"
    },
    {
        "query": "How much is the total net interest income and its corresponding yield on earning assets for the most recent period?",
        "response": "$57,498 and 2.08%",
        "source": "finqa"
    },
    {
        "query": "As of December 31, 2023, what was the total amount of outstanding letters of credit under the 2022 Credit Facility?",
        "response": "$29 million",
        "source": "finqa"
    },
    {
        "query": "How much did the impairment losses total for the owned hotel assets, based on non-recurring fair value measurements in 2023?",
        "response": "$38 million",
        "source": "finqa"
    },
    {
        "query": "What does Item 3 of the financial document refer to?",
        "response": "Item 3 refers to legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What kind of financial documentation includes an Item 8?",
        "response": "Financial documentation that outlines detailed financial data includes an Item 8.",
        "source": "finqa"
    },
    {
        "query": "How have foreign exchange rates affected the company's tax position?",
        "response": "Changes in foreign exchange rates have affected the company's tax position.",
        "source": "finqa"
    },
    {
        "query": "What additional document is included in the financial document apart from the Consolidated Financial Statements?",
        "response": "The 'Glossary of Terms and Acronyms' is included apart from the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What kind of investment plans does the company have according to the latest report?",
        "response": "The company plans to continue investing in sales, marketing, new product development, security, and technology, as well as make strategic acquisitions.",
        "source": "finqa"
    },
    {
        "query": "By what amount did the automotive available liquidity change in the year ended December 31, 2023?",
        "response": "The automotive available liquidity decreased by $3.2 billion in the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "How is basic earnings per share calculated?",
        "response": "Basic earnings per share is calculated using the weighted-average outstanding common shares.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the decrease in net income in 2022?",
        "response": "The primary reason for the decrease in net income in 2022 was an increase in selling, general and administrative expenses.",
        "source": "finqa"
    },
    {
        "query": "How does HP handle variable consideration in revenue recognition?",
        "response": "HP estimates the variable consideration using the expected value or most likely amount method, and reduces the transaction price at the time of revenue recognition for various customer and distributor incentives.",
        "source": "finqa"
    },
    {
        "query": "What legal action did the State of Texas initiate against Meta Platforms, Inc. on February 14, 2022?",
        "response": "The State of Texas filed a lawsuit against Meta Platforms, Inc. in Texas state court alleging that \"tag suggestions\" and other uses of facial recognition technology violated the Texas Capture or Use of Biometric Identifiers Act and the Texas Deceptive Trade Practices-Consumer Protection Act.",
        "source": "finqa"
    },
    {
        "query": "How does LinkedIn intend to create economic opportunity?",
        "response": "LinkedIn aims to create economic opportunities for every member of the global workforce through the development of the world's first Economic Graph, a digital representation of the global economy.",
        "source": "finqa"
    },
    {
        "query": "What are the components listed in the consolidated financial statements of The Home Depot, Inc. for the fiscal years ending in January 2023?",
        "response": "The components include consolidated balance sheets, consolidated statements of earnings, comprehensive income, stockholders' equity, cash flows, and the related notes.",
        "source": "finqa"
    },
    {
        "query": "What was the pre-tax restructuring charge for the fiscal year 2023 related to the discontinuation of certain R&D programs?",
        "response": "Approximately $0.5 billion",
        "source": "finqa"
    },
    {
        "query": "Where is the Financial Statement Schedule located in the Form 10-K?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What changes does the Inflation Reduction Act introduce to the Medicare Part D Coverage Gap Discount Program?",
        "response": "The Inflation Reduction Act replaces the 70 percent Coverage Gap Discount Program discount with a 10 percent manufacturer discount for Medicare Part D beneficiaries below a $2,000 out-of-pocket threshold and a 20 percent discount above this threshold, starting January 2025.",
        "source": "finqa"
    },
    {
        "query": "How is the interest rate determined for lease contracts that are not readily ascertainable?",
        "response": "The incremental borrowing rate is used, which reflects the rate for borrowing on a collateralized basis over a similar lease term in a comparable economic environment.",
        "source": "finqa"
    },
    {
        "query": "What challenges may arise during patent litigation related to technology?",
        "response": "Challenges in patent litigation may include the unpredictability and high costs of the litigation, potential to divert management's attention from other operations, and the risk of adverse impacts even if successful in securing patent rights or defending against claims.",
        "source": "finqa"
    },
    {
        "query": "What determines the fair value of available-for-sale short-term investments?",
        "response": "The fair value of available-for-sale short-term investments is determined primarily by changes in interest rates and market liquidity.",
        "source": "finqa"
    },
    {
        "query": "How does Schwab manage its exposure to operational risk from third-party service providers?",
        "response": "Schwab manages its exposure to operational risk from third-party service providers through internal policies, procedures and controls, and contractual provisions. These include control standards, ongoing monitoring of third-party performance, and appropriate testing with third-parties.",
        "source": "finqa"
    },
    {
        "query": "How many regulated exchanges and clearing houses does Intercontinental Exchange operate, and where are they located?",
        "response": "Intercontinental Exchange operates 13 regulated exchanges and six clearing houses, strategically located in major market centers around the world including the U.S., U.K., European Union, Canada, Asia Pacific, and the Middle East.",
        "source": "finqa"
    },
    {
        "query": "What was the total notional amount of foreign currency derivative instruments outstanding as of December 31, 2023?",
        "response": "As of December 31, 2023, the total notional amount of foreign currency derivative instruments outstanding was approximately $39 billion.",
        "source": "finqa"
    },
    {
        "query": "What was the net equity income in 2023 and how did it compare to 2022?",
        "response": "In 2023, the equity income was $1,691 million, which was $219 million or 15% higher than the $1,472 million recorded in 2022.",
        "source": "finqa"
    },
    {
        "query": "How are the Financial Statement Schedules presented in IBM's Form 10-K for 2023?",
        "response": "The Financial Statement Schedule is on page S-1.",
        "source": "finqa"
    },
    {
        "query": "What is the date of the report on the Consolidated Financial Statements provided by PricewaterhouseCoopers LLP?",
        "response": "February 16, 2024",
        "source": "finqa"
    },
    {
        "query": "Where can one find the consolidated financial statements mentioned in an Annual Report on Form 10-K?",
        "response": "The consolidated financial statements can be found in Part IV, specifically under Item 15(a)(1) of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "How did the total sales and trading revenue for Bank of America change from 2021 to 2023?",
        "response": "Total sales and trading revenue increased from $14,768 million in 2021 to $16,830 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "In which item and part of a financial document would you find information on legal proceedings?",
        "response": "Information on legal proceedings is provided in Item 8 of Part II under 'Financial Statements and Supplementary Data — Note 7 — Commitments and Contingencies — Legal Proceedings'.",
        "source": "finqa"
    },
    {
        "query": "What was the net income of The Charles Schwab Corporation during the year ended December 31, 2023?",
        "response": "$5,067 million",
        "source": "finqa"
    },
    {
        "query": "How was The Rocket Science Group LLC (Mailchimp) integrated into a company's structure after its acquisition on November 1, 2021?",
        "response": "After its acquisition on November 1, 2021, The Rocket Science Group LLC (Mailchimp) was integrated into the Small Business & Self-Employed segment of the acquiring company, and its operations were included in the consolidated results from the acquisition date.",
        "source": "finqa"
    },
    {
        "query": "Which section of a financial document provides an index to Financial Statements and Supplementary Data?",
        "response": "Item 8.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the Company's consolidated total revenues from the federal government in 2023 came from contracts with CMS for coverage of Medicare-eligible individuals?",
        "response": "73%",
        "source": "finqa"
    },
    {
        "query": "How much was the cumulative impairment and downward adjustments for observable price changes for the equity investments without readily determinable fair values as of December 31, 2023?",
        "response": "As of December 31, 2023, the cumulative impairment and downward adjustments for observable price changes were $56 million.",
        "source": "finqa"
    },
    {
        "query": "What were the total risk-weighted assets under Basel 3 for credit risk at Bank of America as of December 31, 2023?",
        "response": "$1,580 billion",
        "source": "finqa"
    },
    {
        "query": "What was the principal amount outstanding of Ford Interest Advantage notes and deposits at FCE and Ford Bank as of December 31, 2023?",
        "response": "The principal amount outstanding was $17.2 billion as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the aggregate intrinsic value of vested stock options as of January 31, 2023?",
        "response": "Approximately $1.8 billion.",
        "source": "finqa"
    },
    {
        "query": "What risks are associated with the non-GAAP income tax rate used in the calculations?",
        "response": "The non-GAAP income tax rate is subject to change due to the rapidly evolving global tax environment, significant changes in the geographic earnings mix including due to acquisition activity, or other strategic or operational changes.",
        "source": "finqa"
    },
    {
        "query": "What are the potential implications of reclassifying broadband services under Title II of the Communications Act?",
        "response": "Reclassifying broadband services under Title II could allow the FCC to regulate customer rates, speeds, data usage thresholds, or other terms for internet services, and might also restrict arrangements between broadband providers and internet content, applications, and service providers.",
        "source": "finqa"
    },
    {
        "query": "What role did Ellen Copaken hold at AMC before becoming the Senior Vice President, Marketing in August 2023?",
        "response": "Vice President, Growth Strategy",
        "source": "finqa"
    },
    {
        "query": "What measures are taken to protect the intellectual property used in the business?",
        "response": "The company protects its intellectual property through intellectual property laws, confidentiality procedures, contractual provisions, and registrations under applicable patent laws. Trademarks, service marks, logos, and internet domain names are also protected, including prominent marks like 'Equifax' and 'The Work Number'.",
        "source": "finqa"
    },
    {
        "query": "How does the company update its disclosure of contingencies in the financial statements?",
        "response": "The company updates its disclosure of contingencies by reflecting the most current understanding of the contingencies at the time the financial statements are issued.",
        "source": "finqa"
    },
    {
        "query": "What methods does the company use to gauge employee satisfaction?",
        "response": "The company conducts confidential employee surveys to collect feedback on various topics.",
        "source": "finqa"
    },
    {
        "query": "How is credit loss determined for a security in financial accounting?",
        "response": "Credit loss for a security is determined by comparing the present value of the expected future cash flows of the security to its amortized cost basis. However, this comparison is limited to the amount by which the fair value is less than the amortized cost basis.",
        "source": "finqa"
    },
    {
        "query": "What factors are contributing to the increase in technology and infrastructure costs in 2023?",
        "response": "The increase in technology and infrastructure costs in 2023 is mainly due to increased spending on infrastructure and increased payroll and related costs for technical teams expanding existing products and services.",
        "source": "finqa"
    },
    {
        "query": "What was the accrued employee compensation and benefits as of December 31, 2023?",
        "response": "$592 million",
        "source": "finqa"
    },
    {
        "query": "What is the trajectory of the AMPTC for microinverters starting in 2030?",
        "response": "The AMPTC for microinverters decreases by 25% each year beginning in 2030 and ending after 2032.",
        "source": "finqa"
    },
    {
        "query": "What was the change in net revenue for the Consumer Printing unit in the fiscal year 2023?",
        "response": "Decreased by 17.9%",
        "source": "finqa"
    },
    {
        "query": "How many employees did FedEx Office have as of May 31, 2023?",
        "response": "As of May 31, 2023, FedEx Office had approximately 12,000 employees.",
        "source": "finqa"
    },
    {
        "query": "What is the relationship between Items 3 and 8 in terms of information flow?",
        "response": "The relationship involves Item 3 using information from Note 19 included in Item 8, incorporating it by reference to provide details on Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "What was the net income of the company for fiscal 2023?",
        "response": "The net income for the company in fiscal 2023 was $2.5 billion.",
        "source": "finqa"
    },
    {
        "query": "What new facility is the company planning to construct as part of its investment plan in Macao?",
        "response": "The company plans to construct a state-of-the-art MICE facility which will encompass roughly 18,000 square meters and will adjoin their existing Venetian Macao exhibition center.",
        "source": "finqa"
    },
    {
        "query": "What specific section of the Annual Report on Form 10-K includes the consolidated financial statements and accompanying notes?",
        "response": "Part IV, Item 15(a)(1)",
        "source": "finqa"
    },
    {
        "query": "What types of products from Enphase Energy, Inc. are recognized for revenue at the point of delivery?",
        "response": "Products from Enphase Energy, Inc. such as microinverter units, accessories, storage and EV solutions, design, proposal, permitting and lead generation services, and completed work orders from their platform recognizing cleantech asset owners are recorded for revenue at the point of delivery.",
        "source": "finqa"
    },
    {
        "query": "What are the key priorities outlined in the cybersecurity strategy described?",
        "response": "The key priorities of the cybersecurity strategy include assessing risk, prioritizing testing, identifying remedial actions and validating improvements.",
        "source": "finqa"
    },
    {
        "query": "What was the total investment in Nuro, Inc. as stated in the financial documents for December 31, 2023?",
        "response": "$15,968",
        "source": "finqa"
    },
    {
        "query": "What new type of internet service does the Consumer Wireline business unit offer?",
        "response": "AT&T Internet Air",
        "source": "finqa"
    },
    {
        "query": "What are the conditions required for CSC's banking subsidiaries to draw on secured credit facilities?",
        "response": "CSC's banking subsidiaries must maintain positive tangible capital, as defined by the Federal Housing Finance Agency, to place new draws on these credit facilities.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in Comcast's operating income from 2022 to 2023?",
        "response": "Comcast's operating income increased by 66.0% from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What proportion of Starbucks' partners in U.S. company-operated stores are represented by unions?",
        "response": "Approximately 3.6% of Starbucks partners in U.S. company-operated stores are represented by unions.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of noncurrent investments on December 31, 2023?",
        "response": "$2,901.8 million",
        "source": "finqa"
    },
    {
        "query": "What was the performance of automotive and other selling, general and administrative expense from 2022 to 2023?",
        "response": "It decreased primarily due to reduced advertising, selling, and administrative costs, and the absence of charges related to Cruise stock incentive awards modification, partially offset by charges related to VSP.",
        "source": "finqa"
    },
    {
        "query": "What are the key priorities for human capital management at Gilead?",
        "response": "Gilead's key priorities for human capital management include inclusion and diversity, health and safety, total rewards, employee development, and engagement.",
        "source": "finqa"
    },
    {
        "query": "How are changes in economic factors considered in the assessment of disability insurance claims?",
        "response": "Economic factors such as GDP growth, employment trends, and disposable income levels are considered in the estimation of liabilities for benefit claims.",
        "source": "finqa"
    },
    {
        "query": "How many stores did the Family Dollar segment close in the fiscal year ending January 29, 2022?",
        "response": "The Family Dollar segment closed 88 stores in the fiscal year ending January 29, 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in food and beverage costs for the company in 2023 compared to 2022?",
        "response": "41.7%",
        "source": "finqa"
    },
    {
        "query": "What was the change in interest income from 2022 to 2023, and what was the primary reason?",
        "response": "Interest income increased from $989 million in 2022 to $2.9 billion in 2023, primarily due to an increase in prevailing interest rates.",
        "source": "finqa"
    },
    {
        "query": "What are the consequences for a Medicare Part D contract if it fails to meet the minimum MLR for five consecutive years?",
        "response": "The contract will be terminated by CMS.",
        "source": "finqa"
    },
    {
        "query": "What are the key components of the transparency provisions included in the Consolidated Appropriations Act of 2021 regarding healthcare?",
        "response": "The Consolidated Appropriations Act of 2021 includes transparency provisions requiring group health plans and health insurance issuers to report prescription drug costs, overall spending on health services and prescription drugs, and information about premiums and the impact of rebates on premiums and out-of-pocket costs.",
        "source": "finqa"
    },
    {
        "query": "What was the adjusted effective tax rate for 2023 according to Non-GAAP measures?",
        "response": "21.9%",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of gross unrecognized tax benefits as of December 30, 2023?",
        "response": "$13,571",
        "source": "finqa"
    },
    {
        "query": "What is the weighted-average useful life of the total acquired identifiable intangible assets?",
        "response": "12.0 years",
        "source": "finqa"
    },
    {
        "query": "How did the foreign exchange rate fluctuations impact Nike's consolidated revenues in fiscal 2023?",
        "response": "The impact of foreign exchange rate fluctuations on the translation of Nike's consolidated revenues was detrimental by approximately $2,859 million in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What were the financial impacts of Ford's investments in Rivian and Argo in the year 2022?",
        "response": "In 2022, Ford incurred a $7.4 billion mark-to-market net loss on its Rivian investment and a $2.7 billion impairment on its Argo investment, contributing to a total of $12.2 billion in special item charges.",
        "source": "finqa"
    },
    {
        "query": "What are the primary locations where the majority of the business operations for the parent company are based?",
        "response": "The majority of the business operations are based in Macao, held by various Macao-incorporated indirect subsidiaries of SCL.",
        "source": "finqa"
    },
    {
        "query": "What was the goal of the FedEx Cares 50 by 50 initiative, and was it achieved by April 2023?",
        "response": "The goal of the FedEx Cares 50 by 50 initiative was to positively impact 50 million people around the world by FedEx's 50th anniversary in April 2023, and this goal was exceeded.",
        "source": "finqa"
    },
    {
        "query": "What are The Home Depot's goals related to environmental sustainability?",
        "response": "The Home Depot aims to reduce its environmental impact through goals such as cleaning products chemical reduction, science-based carbon emissions reduction, recyclable packaging, increasing renewable/alternative energy sources, and achieving 100% renewable electricity for all its facilities by the end of fiscal 2030.",
        "source": "finqa"
    },
    {
        "query": "What is the content of Item 8 in the document?",
        "response": "Item 8 of the document includes Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What does IBM’s 2023 Annual Report to Stockholders include?",
        "response": "IBM’s 2023 Annual Report to Stockholders includes financial statements and supplementary data.",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources of Ford Credit's revenue?",
        "response": "Ford Credit's primary sources of revenue come from payments made under retail installment sale and finance lease contracts, supplements and other payments from Ford and affiliates, and dealer financing programs.",
        "source": "finqa"
    },
    {
        "query": "How much did the Marketplace revenue increase by percentage from 2022 to 2023?",
        "response": "4.5%",
        "source": "finqa"
    },
    {
        "query": "Where is the Glossary of Terms and Acronyms found in the document?",
        "response": "Pages 315-321",
        "source": "finqa"
    },
    {
        "query": "What is included in the lending-related fees in a Corporation's revenue structure?",
        "response": "Lending-related fees generally represent transactional fees earned from certain loan commitments, financial guarantees and Standby Letters of Credit (SBLCs).",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in determining the Estimated Offering Period for revenue recognition of transactions with future update rights and/or online hosting?",
        "response": "The determination of the Estimated Offering Period considers factors such as the average time customers are online, the period from when a game unit is sold to a reseller until it reaches the customer, known and expected online gameplay trends, and disclosed service periods of competitors' games.",
        "source": "finqa"
    },
    {
        "query": "What method is used to record amortization and costs for owned content that is predominantly monetized on an individual basis?",
        "response": "individual film forecast computation method",
        "source": "finqa"
    },
    {
        "query": "How much growth did the Automotive sector experience in fiscal year 2023 compared to fiscal year 2022?",
        "response": "The Automotive sector experienced a 60% growth in fiscal year 2023 compared to fiscal year 2022.",
        "source": "finqa"
    },
    {
        "query": "What was the primary cause of the increase in marketing and sales expenses in fiscal year 2023?",
        "response": "The increase in marketing and sales expenses in fiscal year 2023 was primarily due to increased spending on advertising and promotions related to the release of Apex Legends Mobile and the FIFA franchise.",
        "source": "finqa"
    },
    {
        "query": "How did net sales at The Hershey Company in 2023 compare with those in 2022?",
        "response": "In 2023, The Hershey Company's net sales were $11,165.0 million, an increase of $745.7 million or 7.2% from 2022, where net sales totaled $10,419.3 million.",
        "source": "finqa"
    },
    {
        "query": "What percentage did Iron Mountain's net income decrease from 2022 to 2023?",
        "response": "Iron Mountain's net income decreased by 66.7% from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What specific part of the financial statements covers information on legal proceedings?",
        "response": "The information on legal proceedings is covered in Note 15 of the Notes to Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What were the changes in total incurred and paid amounts concerning claims for the current and prior years between 2021 and 2023?",
        "response": "From 2021 to 2023, total incurred amounts concerning claims increased from $69,199 million to $88,394 million. Simultaneously, total paid amounts for claims increased from $69,095 million to $87,479 million.",
        "source": "finqa"
    },
    {
        "query": "What is the role of the Chairman’s Inclusion Council at Chevron?",
        "response": "The Chairman’s Inclusion Council provides Chevron’s employee network presidents with a direct line of communication to the Chairman and CEO along with other executives, to discuss how employee networks can reinforce the company’s values of diversity and inclusion.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in marine segment operating income in the fiscal year ending December 30, 2023, compared to the previous year?",
        "response": "-17%",
        "source": "finqa"
    },
    {
        "query": "What standards does NCQA use to assess compliance with health plans?",
        "response": "NCQA reviews compliance with health plans based on standards such as quality improvement, population health management, credentialing, utilization management, network management, and member experience.",
        "source": "finqa"
    },
    {
        "query": "What is Peloton Interactive, Inc. known for in the interactive fitness industry?",
        "response": "Peloton Interactive, Inc. is known for pioneering connected, technology-enabled fitness, creating interactive fitness equipment, and streaming immersive, instructor-led boutique classes to its members anytime, anywhere.",
        "source": "finqa"
    },
    {
        "query": "What was the diluted earnings per share for the company in fiscal 2022?",
        "response": "$16.69",
        "source": "finqa"
    },
    {
        "query": "What measures has Bank of America taken to streamline its organizational structure?",
        "response": "Bank of America Corporation has reduced and intends to continue to reduce the number of its corporate subsidiaries, including through intercompany mergers, as part of its efforts to streamline the Corporation’s organizational structure and reduce complexity and costs.",
        "source": "finqa"
    },
    {
        "query": "Where in the Annual Report on Form 10-K is Note 13 located?",
        "response": "Note 13 is located in the Notes to Consolidated Financial Statements, which are included in Part II, Item 8 of the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What is the ending balance of the Chipotle Rewards liability for the year 2023?",
        "response": "The ending balance of the Chipotle Rewards liability for 2023 was $44,750.",
        "source": "finqa"
    },
    {
        "query": "What are the principles used in preparing the discussed financial statements?",
        "response": "U.S. generally accepted accounting principles (U.S. GAAP).",
        "source": "finqa"
    },
    {
        "query": "How much did the Wizards of the Coast and Digital Gaming segment's operating profit change in 2022?",
        "response": "Decreased 2%",
        "source": "finqa"
    },
    {
        "query": "What does GDPR require in case of a personal data breach, and what penalties does it impose for non-compliance?",
        "response": "GDPR requires submission of personal data breach notifications to the lead European Union privacy regulator and includes significant penalties for non-compliance with the notification requirement and other aspects of the regulation.",
        "source": "finqa"
    },
    {
        "query": "What was the global increase in Monthly Active People (MAP) as of the end of 2023 compared to the end of 2022?",
        "response": "As of the end of 2023, there was a 6% increase in Monthly Active People (MAP), rising from 3.74 billion as of December 31, 2022, to 3.98 billion as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Botox Therapeutic revenue in the United States from 2021 to 2023?",
        "response": "9.8%",
        "source": "finqa"
    },
    {
        "query": "Where can one find the detailed Financial Statements and Supplementary Data in IBM’s 2023 Annual Report?",
        "response": "They are located from pages 44 through 121.",
        "source": "finqa"
    },
    {
        "query": "What method is used to amortize the cost of definite-lived intangible assets, and what does this method reflect?",
        "response": "The straight-line basis is used to amortize the cost of definite-lived intangible assets, reflecting the pattern of expected economic benefit.",
        "source": "finqa"
    },
    {
        "query": "How much did the company's Adjusted EBITDA grow in 2023?",
        "response": "The company's Adjusted EBITDA grew by 26% in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the net revenue from digital full game downloads for Electronic Arts in fiscal year 2023?",
        "response": "$1,262 million",
        "source": "finqa"
    },
    {
        "query": "What online resources does the company provide for investors and the public?",
        "response": "The company maintains a website that provides reports and other filings with the SEC, as well as news releases and announcements on its 'Investors' page.",
        "source": "finqa"
    },
    {
        "query": "What are the core pillars of the Company's Diversity, Equity, and Inclusion (DEI) Strategy?",
        "response": "The core pillars are building a diverse workforce, fostering a culture of inclusion, transforming talent and business processes for equitable opportunities, and driving innovation and growth to serve diverse markets.",
        "source": "finqa"
    },
    {
        "query": "What are some of the competitive pressures faced by large financial firms like Goldman Sachs?",
        "response": "Large financial firms like Goldman Sachs face competitive pressures including the need to commit capital to support international operations, competition from larger financial institutions with more resources, and competitors with more targeted service offerings such as independent advisory firms. They also face competition based on the types of financial products and client experiences offered, with some competitors providing products and technologies that Goldman Sachs may not.",
        "source": "finqa"
    },
    {
        "query": "How did the expenses from comparable owned and leased hotels change and what were the contributing factors?",
        "response": "Expenses from comparable owned and leased hotels increased by $137 million on a currency neutral basis due to increased occupancy and cost inflation which drove higher labor costs, utilities, other operating expenses, and an increase in rent expense.",
        "source": "finqa"
    },
    {
        "query": "How does the company account for warranties in its financial statements?",
        "response": "The company accrues a warranty reserve for projected costs to repair or replace items under warranties and recalls, based on actual claims and an estimate of future claims. This warranty expense is recorded as a component of Cost of revenues.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decrease in total average daily volume for FedEx Ground in 2023?",
        "response": "Reduced demand for services, primarily from macroeconomic conditions",
        "source": "finqa"
    },
    {
        "query": "How can customers use market development funds under the co-marketing development programs?",
        "response": "Customers can use market development funds as reimbursement for advertisements and marketing programs related to our products and third-party systems integrating our products, subject to meeting defined criteria.",
        "source": "finqa"
    },
    {
        "query": "How much did the interest expense change from 2022 to 2023?",
        "response": "The interest expense increased by 1% from $935 million in 2022 to $944 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What types of businesses does HPE serve?",
        "response": "HPE serves a wide range of customers including small-and-medium-sized businesses (SMBs), large global enterprises, and governmental entities.",
        "source": "finqa"
    },
    {
        "query": "What is the total shareholder's deficit according to the latest financial statement?",
        "response": "The total shareholders' deficit is $7,994.8 million.",
        "source": "finqa"
    },
    {
        "query": "What could be the impact on securities exchanges if the SEC's proposed rule prohibiting volume-based transaction pricing is adopted?",
        "response": "It would negatively impact the securities exchanges’ ability to compete with off-exchange trading venues.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in total revenue from fiscal year 2022 to fiscal year 2023?",
        "response": "The total revenue decreased by 21.8% from fiscal year 2022 to fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of dividends paid by the company in the year prior to the most recently reported period?",
        "response": "$589 million",
        "source": "finqa"
    },
    {
        "query": "Which companies contribute to the development of the Linux operating system?",
        "response": "Many computer manufacturers contribute to the development of the Linux operating system.",
        "source": "finqa"
    },
    {
        "query": "What are the total expected operational and capital expenditures under the Macao Concession through 2032?",
        "response": "approximately $3.76 billion",
        "source": "finqa"
    },
    {
        "query": "What percentage of S&P 500 companies were listed on the New York Stock Exchange as of December 31, 2023?",
        "response": "As of December 31, 2023, over 70% of S&P 500 companies were listed on the New York Stock Exchange.",
        "source": "finqa"
    },
    {
        "query": "How much did the gross margin increase in fiscal year 2023 compared to 2022?",
        "response": "$2,595 million",
        "source": "finqa"
    },
    {
        "query": "What were the primary reasons for the decline in FedEx Express segment's operating income in 2023?",
        "response": "The primary reasons were global volume declines, partially offset by yield improvement and lower operating expenses.",
        "source": "finqa"
    },
    {
        "query": "What effect do the normal routine litigation have on Berkshire's financial condition or results of operations?",
        "response": "The normal and routine litigation are not believed to have a material effect on Berkshire's financial condition or results of operations.",
        "source": "finqa"
    },
    {
        "query": "How has the regulatory environment impacted the company's advertising revenue?",
        "response": "The company's advertising revenue has been adversely affected by reduced marketer spending due to limitations on ad targeting and measurement tools arising from changes in the regulatory environment and third-party mobile operating systems and browsers.",
        "source": "finqa"
    },
    {
        "query": "What does the Corporate and Other segment include in its composition?",
        "response": "The Corporate and Other segment includes unallocated corporate expenses, administrative costs, and activities not considered when evaluating segment performance, as well as certain assets that benefit more than one segment. It also involves the elimination of intersegment transactions.",
        "source": "finqa"
    },
    {
        "query": "What financial instruments does the company invest in that are sensitive to interest rates?",
        "response": "The company invests in bonds, loans, and other interest rate sensitive instruments.",
        "source": "finqa"
    },
    {
        "query": "What does Item 3 of the report refer to?",
        "response": "Item 3 of the report refers to Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "What is the mission of the company described in the text?",
        "response": "The mission of the company is to give people the power to build community and bring the world closer together.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Management’s Discussion and Analysis section in Equifax Inc.’s Form 10-K?",
        "response": "The Management’s Discussion and Analysis (MD&A) section in Equifax Inc.’s Form 10-K is intended to help the reader understand the results of operations and financial condition of the company.",
        "source": "finqa"
    },
    {
        "query": "How does the company's membership format affect its profitability?",
        "response": "The membership format significantly affects the company's profitability by reinforcing member loyalty and providing continuing fee revenue. The growth in the membership base, increased penetration of Executive members, and high renewal rates are key drivers of profitability.",
        "source": "finqa"
    },
    {
        "query": "What types of financial instruments does the entity use to hedge against interest rate changes?",
        "response": "The entity uses interest rate swap agreements and treasury locks to hedge against changes in benchmark interest rates related to anticipated debt issuances.",
        "source": "finqa"
    },
    {
        "query": "What position did Chris A. Cox hold at the Dial Corporation before joining AMC?",
        "response": "Director of Corporate Accounting",
        "source": "finqa"
    },
    {
        "query": "What impact does a change in the final tax outcome have on the company's financial statements?",
        "response": "If the final tax outcome is different from the amounts recorded, it will impact the provision for or benefit from income taxes and the effective tax rate in the period such determination is made.",
        "source": "finqa"
    },
    {
        "query": "What factors were responsible for the unchanged global market share in the oral care category?",
        "response": "The global market share in the oral care category remained unchanged, largely due to steady sales and competitive factors within the market.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of net cash used in financing activities in 2023?",
        "response": "$2,430 million",
        "source": "finqa"
    },
    {
        "query": "What was the effect of financing activities on the Company's net cash in fiscal 2022?",
        "response": "The increase was primarily due to repayments of long-term debt and related payment of premiums for the early extinguishment of certain notes, as well as increased share repurchases, partially offset by long-term debt issuances and equity funding from the sale of subsidiary stock.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash and shares received by VMware stockholders in the 2023 merger?",
        "response": "VMware stockholders received approximately $30.8 billion in cash and 54.4 million shares of Broadcom common stock in aggregate in the 2023 merger.",
        "source": "finqa"
    },
    {
        "query": "What is the total debt as of the end of 2023, and how has it changed from the previous year?",
        "response": "The total debt as of December 31, 2023 was $25.23 billion, an increase from $16.24 billion at the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "How many new aircraft did Delta Air Lines take delivery of in 2023?",
        "response": "43",
        "source": "finqa"
    },
    {
        "query": "What are the total noncancelable purchase commitments as of December 31, 2023, and how are they distributed over different time periods?",
        "response": "As of December 31, 2023, the total noncancelable purchase commitments amounted to $2,082,992 thousand, distributed as $131,342 thousand due in less than 1 year, $367,400 thousand due in 1-3 years, $481,150 thousand due in 3-5 years, and $1,103,100 thousand due in more than 5 years.",
        "source": "finqa"
    },
    {
        "query": "What was the adjustment made for the voluntary separation program in 2023?",
        "response": "1035",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in Veklury's product sales in 2023?",
        "response": "44%",
        "source": "finqa"
    },
    {
        "query": "How much of the Credit Facility was available to ME&T as of December 31, 2023?",
        "response": "$2.75 billion",
        "source": "finqa"
    },
    {
        "query": "How does AbbVie ensure it realizes the full value of its workforce?",
        "response": "AbbVie ensures it realizes the full value of its workforce from recruitment through retirement.",
        "source": "finqa"
    },
    {
        "query": "How does the Asia Pacific operation support its clients?",
        "response": "The Asia Pacific operation supports its clients by providing consumer and commercial information solutions, marketing products, employment verification services, and consumer credit protection products. It also offers services to support talent management and debt collections and recovery management.",
        "source": "finqa"
    },
    {
        "query": "Where can an individual obtain copies of the code of ethics for senior financial officers?",
        "response": "Copies of the code of ethics for senior financial officers can be obtained free of charge by writing to Secretary, Costco Wholesale Corporation, 999 Lake Drive, Issaquah, WA 98027.",
        "source": "finqa"
    },
    {
        "query": "Where can information regarding legal proceedings be found in relation to consolidated financial statements?",
        "response": "Information regarding legal proceedings can be found in Note 17, titled 'Litigation and Contingencies', which is part of the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "What are some of the components of the company's material cash requirements?",
        "response": "Licensing intellectual property, debt repayment obligations, and funding operating requirements.",
        "source": "finqa"
    },
    {
        "query": "How are advertising costs handled in accounting according to the noted business's financial statements for the specified years?",
        "response": "Advertising costs are expensed the first time the advertising takes place or as incurred. For the years ending December 31, 2023, 2022, and 2021, the recorded advertising costs were $47 million, $29 million, and $31 million respectively.",
        "source": "finqa"
    },
    {
        "query": "What is the primary target of Palantir's customer acquisition strategy?",
        "response": "Palantir's primary target in its customer acquisition strategy is to engage large-scale, complex, and technology-intensive opportunities at major government and commercial institutions.",
        "source": "finqa"
    },
    {
        "query": "What significant acquisition did Chubb Limited complete to expand their life insurance business in Asia?",
        "response": "In 2022, Chubb Limited acquired Cigna's business in several Asian markets to expand their life insurance business.",
        "source": "finqa"
    },
    {
        "query": "How does the company manage its exposure to credit and interest rate risks?",
        "response": "The company manages its exposure to credit and interest rate risks through investments that are primarily made up of investment grade fixed-income securities, and all investments are maintained at investment grade to minimize credit risk.",
        "source": "finqa"
    },
    {
        "query": "What proportion of Electronic Arts' total units sold in fiscal year 2023 were sold digitally?",
        "response": "68 percent",
        "source": "finqa"
    },
    {
        "query": "How does the CMS risk-adjustment model affect the premium payments to Medicare Advantage plans and on what bases are these adjustments made?",
        "response": "The CMS risk-adjustment model adjusts premium payments to Medicare Advantage plans based on the health status of covered members, using collected diagnosis data from providers to calculate health status-related premium payments. These payments are further adjusted to account for differences in coding patterns between the health plans and the government fee-for-service program.",
        "source": "finqa"
    },
    {
        "query": "What is the strategic focus of the company's research and development resources?",
        "response": "The company strategically focuses its research and development resources to address niche opportunities in its target markets and to leverage its extensive portfolio of U.S. and other patents, and other intellectual property (IP) to integrate multiple technologies and create system-on-chip (SoC) component and software solutions that target growth opportunities.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in adjusted net earnings per diluted share in 2022?",
        "response": "The increase resulted primarily from increased FIFO operating profit, excluding fuel, increased fuel earnings, and lower weighted average common shares outstanding due to common share repurchases, partially offset by a higher LIFO charge and higher income tax expense.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage growth in footwear revenues on a currency-neutral basis in fiscal 2023 compared to the previous fiscal year?",
        "response": "Footwear revenues increased 19% on a currency-neutral basis in fiscal 2023 compared to the previous fiscal year.",
        "source": "finqa"
    },
    {
        "query": "How much did Ford's net income change from 2021 to 2022?",
        "response": "Ford's net income decreased by $19.9 billion from 2021 to 2022.",
        "source": "finqa"
    },
    {
        "query": "What does ITEM 8 in the Annual Report on Form 10-K refer to?",
        "response": "Financial statements and supplementary data",
        "source": "finqa"
    },
    {
        "query": "What is the maximum percentage of earnings that employees can contribute to Chipotle's Employee Stock Purchase Plan (ESPP)?",
        "response": "15%",
        "source": "finqa"
    },
    {
        "query": "Where can information about Apple’s financial performance and annual meeting of shareholders be accessed?",
        "response": "Information about Apple's financial performance and annual meeting of shareholders can be accessed at the company's corporate website and its investor relations website.",
        "source": "finqa"
    },
    {
        "query": "What is the worldwide effective income tax rate for the company in 2023?",
        "response": "11.5%",
        "source": "finqa"
    },
    {
        "query": "How does the company treat income taxes in its financial reports?",
        "response": "The company is subject to income taxes in the U.S. and many foreign jurisdictions, and significant judgment is used to determine the provision for income taxes, deferred tax assets and liabilities, and any valuation allowances against net deferred tax assets.",
        "source": "finqa"
    },
    {
        "query": "What was the total unrecognized compensation expense related to RSUs as of January 28, 2023, and over what period is it expected to be recognized?",
        "response": "As of January 28, 2023, there was $58.0 million of total unrecognized compensation expense related to RSUs, which is expected to be recognized over a weighted-average period of 1.2 years.",
        "source": "finqa"
    },
    {
        "query": "Where can one find the consolidated financial statements and accompanying notes in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes can be found immediately following Part IV in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What were the total product sales in 2023?",
        "response": "$27,305 million",
        "source": "finqa"
    },
    {
        "query": "How many employees does Garmin have as of December 30, 2023, and in which regions are they located?",
        "response": "As of December 30, 2023, Garmin has approximately 19,900 full and part-time employees worldwide, with around 7,300 in the Americas, 9,900 in APAC, and 2,700 in EMEA.",
        "source": "finqa"
    },
    {
        "query": "What is the role of Bank of America Corporation's management in relation to internal control over financial reporting?",
        "response": "The management of Bank of America Corporation is responsible for establishing and maintaining adequate internal control over financial reporting. This includes ensuring the reliability of financial reporting and the preparation of financial statements in accordance with U.S. GAAP. They are involved in maintaining records that reflect transactions accurately, ensuring that financial transactions are recorded properly, and safeguarding the company's assets to prevent unauthorized use.",
        "source": "finqa"
    },
    {
        "query": "What measures does Schwab take to manage credit risk?",
        "response": "Schwab manages credit risk by establishing policies and procedures which include setting and reviewing credit limits, monitoring credit limits and quality of counterparties, and adjusting margin, pledged asset lending (PAL), option, and futures requirements for certain securities and instruments.",
        "source": "finqa"
    },
    {
        "query": "What is the extent of Bank of America's operations as of December 31, 2023?",
        "response": "As of December 31, 2023, Bank of America had operations across the U.S., its territories, and more than 35 countries with a retail banking footprint covering all major markets in the U.S.",
        "source": "finqa"
    },
    {
        "query": "What was the leverage ratio requirement for GSBE as of December 2023?",
        "response": "As of December 2023, the leverage ratio requirement for GSBE was 3.0%.",
        "source": "finqa"
    },
    {
        "query": "What caused the increase in depreciation and amortization expenses in 2023 and what is expected for 2024?",
        "response": "The increase in 2023 was caused by higher depreciation from ongoing capital spending on fiber and network upgrades. In 2024, depreciation expenses are expected to further increase due to an anticipated shortening of estimated economic lives of wireless equipment related to the deployment of Open RAN.",
        "source": "finqa"
    },
    {
        "query": "What is the maximum daily borrowing capacity under the commercial paper program as of January 2023?",
        "response": "$2.75 billion",
        "source": "finqa"
    },
    {
        "query": "When and under what condition will the company record an impairment charge for the IPR&D intangible asset related to Trodelvy?",
        "response": "The company will record an impairment charge if the fair value of the IPR&D intangible asset related to Trodelvy is found to be less than its carrying value, with the charge recorded in the Consolidated Statements of Income for the period ending March 31, 2024.",
        "source": "finqa"
    },
    {
        "query": "How does Hasbro support the wellness of its employees?",
        "response": "Hasbro supports employee wellness through various programs including mental, physical, and financial wellness programs, robust employee assistance programs, childcare solutions, and flexible work arrangements.",
        "source": "finqa"
    },
    {
        "query": "What is the definition of demand creation expense for NIKE?",
        "response": "Demand creation expense for NIKE consists of advertising and promotion costs, including costs of endorsement contracts, complimentary product, television, digital and print advertising and media costs, brand events, and retail brand presentation.",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in fulfillment costs in 2023?",
        "response": "The increase in fulfillment costs in 2023 was primarily due to increased sales and investments in the fulfillment network, partially offset by efficiencies within the fulfillment network.",
        "source": "finqa"
    },
    {
        "query": "How much of the Company's fixed-rate notes' principal amount was payable within 12 months as of September 30, 2023?",
        "response": "$9.9 billion",
        "source": "finqa"
    },
    {
        "query": "What factors influence the determination of income tax provisions and related tax balances?",
        "response": "Key factors influencing income tax provisions and related tax balances include forecasts of future income and expenses, tax planning strategies, and the likelihood of certain tax positions being upheld during tax authority reviews.",
        "source": "finqa"
    },
    {
        "query": "How is the information about NVIDIA's equity compensation plans provided in the proxy statement?",
        "response": "The information about NVIDIA's equity compensation plans is incorporated by reference in the proxy statement.",
        "source": "finqa"
    },
    {
        "query": "What is the U.S. Department of Labor's proposed rule in October 2023 aimed at regulating?",
        "response": "The proposed rule aims to significantly broaden the definition of \"fiduciary\" under the Employee Retirement Income Security Act of 1974, making broker-dealers who provide non-discretionary investment advice to retirement plans and accounts subject to a \"best interest\" standard.",
        "source": "finqa"
    },
    {
        "query": "How can employees report misconduct or safety concerns?",
        "response": "Employees can report misconduct or safety concerns by contacting the integrity line, submitting concerns through the Take Charge process, or notifying their Human Resource Partner or any member of management.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of cash, cash equivalents, and marketable securities as of December 30, 2023?",
        "response": "As of December 30, 2023, the amount of cash, cash equivalents, and marketable securities was approximately $3.1 billion.",
        "source": "finqa"
    },
    {
        "query": "What primarily caused the change in net cash from financing activities in 2023?",
        "response": "The change in net cash from financing activities in 2023 was primarily due to a $3.93 billion increase in proceeds from issuances of debt and a $2.01 billion decrease in repayments of debt.",
        "source": "finqa"
    },
    {
        "query": "What are the environmental compliance requirements faced by FedEx Express regarding noise and emissions?",
        "response": "FedEx Express is subject to stringent environmental regulations, including compliance with aircraft noise standards set by the FAA and EPA, and greenhouse gas emissions standards set by ICAO, EPA, and potentially future U.S. climate change legislation. FedEx Express aligns with these standards and participates in international efforts like CORSIA to manage and offset emissions.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in pharmacy same store sales in 2023 compared to 2022?",
        "response": "13.6%",
        "source": "finqa"
    },
    {
        "query": "How many company-operated stores were there in the United States as of January 28, 2024?",
        "response": "As of January 28, 2024, there were 367 company-operated stores in the United States.",
        "source": "finqa"
    },
    {
        "query": "What aspects of professional interests are covered by AT&T's employee groups?",
        "response": "AT&T's employee groups cover professional interests in cybersecurity, engineering, innovation, and project management.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash, cash equivalents, and restricted cash reported by GameStop in 2022?",
        "response": "$1,196.0 million",
        "source": "finqa"
    },
    {
        "query": "What was the amount of cash and cash equivalents held by the company as of December 31, 2023?",
        "response": "As of December 31, 2023, the company had $545.4 million in cash and cash equivalents.",
        "source": "finqa"
    },
    {
        "query": "What can you expect to find covered in Item 8 of a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What led to the decrease in the MedTech segment's income before tax as a percent to sales in 2023?",
        "response": "The decrease in the MedTech segment’s income before tax as a percent to sales in 2023 was primarily due to higher amortization expenses related to Abiomed and the expense for an acquired in process research and development asset from the Laminar acquisition, among other factors.",
        "source": "finqa"
    },
    {
        "query": "How many countries and territories does Visa facilitate global commerce in?",
        "response": "more than 200 countries and territories",
        "source": "finqa"
    },
    {
        "query": "What is the expected financial impact of transfer pricing issues on the consolidated financial statements?",
        "response": "The transfer pricing issues could have a material impact on the consolidated financial statements once resolved.",
        "source": "finqa"
    },
    {
        "query": "How is the potential impairment of the IPR&D intangible asset related to Trodelvy indicated?",
        "response": "The potential impairment is indicated by new information suggesting that the fair value of the IPR&D intangible asset related to Trodelvy may be below its carrying value in the first quarter of 2024.",
        "source": "finqa"
    },
    {
        "query": "How does Garmin manage the costs of manufacturing its products?",
        "response": "By designing and manufacturing in-house, sourcing components from diverse suppliers, and redesigning products to use lower-cost components.",
        "source": "finqa"
    },
    {
        "query": "What is the frequency of conducting quantitative assessments for cable franchise rights as per the company's practice?",
        "response": "approximately once every four years",
        "source": "finqa"
    },
    {
        "query": "What was the outcome of the EVOKE-01 study conducted by Gilead?",
        "response": "The Phase 3 EVOKE-01 study of Trodelvy versus docetaxel in previously treated metastatic non-small cell lung cancer did not meet its primary endpoint of overall survival. However, an encouraging trend was observed in a subgroup of patients non-responsive to prior anti-PD-(L)1 immunotherapy.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of derivatives not designated as hedging instruments categorized as current foreign exchange contracts in prepaids and other current assets as of December 31, 2023?",
        "response": "The fair value was $23 million.",
        "source": "finqa"
    },
    {
        "query": "What does Adjusted EBITDA exclude in terms of capital requirements?",
        "response": "Adjusted EBITDA does not reflect cash capital expenditure requirements for replacements or new capital expenditures.",
        "source": "finqa"
    },
    {
        "query": "What was the strategy of the company regarding fiscal year 2023?",
        "response": "The company's strategy in fiscal year 2023 was to combine best-of-breed technology leadership in semiconductor and infrastructure software solutions, with unmatched scale on a common sales and administrative platform to deliver comprehensive infrastructure technology products to leading business and government customers globally.",
        "source": "finqa"
    },
    {
        "query": "What contributed to the decrease in Walmart's consolidated net income between fiscal 2022 and 2023?",
        "response": "Walmart's consolidated net income decreased by $2.6 billion from $13.9 billion in fiscal 2022 to $11.3 billion in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What changes does the IRA make to the Medicare Part D benefit plan?",
        "response": "The IRA redesigns the Medicare Part D benefit by shifting a greater portion of costs to manufacturers within certain coverage phases and replacing the Part D coverage gap discount program with a new manufacturer discounting program.",
        "source": "finqa"
    },
    {
        "query": "What are the pricing mechanisms for crude oil sales contracts in Israel?",
        "response": "The sales contracts for Israel incorporate pricing that generally involves an initial base price subject to indexation linked to Brent crude oil or other benchmarks over the life of the contract.",
        "source": "finqa"
    },
    {
        "query": "What items from the Annual Report on Form 10-K are incorporated by reference?",
        "response": "The consolidated financial statements and accompanying notes listed in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "What typical reimbursement methods are used in the company's contracts with hospitals for inpatient and outpatient services?",
        "response": "The company typically contracts with hospitals on either a per diem rate for inpatient services or a case rate for diagnosis-related groups (DRG). For outpatient services, contracts are generally at a flat rate by type of service (APC) or at a discounted charge.",
        "source": "finqa"
    },
    {
        "query": "What was the average number of common shares used in the basic earnings per share calculation for The Kroger Co. in the year ending January 28, 2023?",
        "response": "773 million shares",
        "source": "finqa"
    },
    {
        "query": "What fiscal changes did Garmin make in January 2023?",
        "response": "Garmin combined the consumer auto operating segment with the outdoor operating segment.",
        "source": "finqa"
    },
    {
        "query": "Since when has Mr. Goodarzi been the President and CEO of Intuit?",
        "response": "January 2019",
        "source": "finqa"
    },
    {
        "query": "How much did Visa authorize for its share repurchase program in October 2023?",
        "response": "Visa authorized a $25.0 billion share repurchase program in October 2023.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did Total Phone Net Additions decrease in 2023 compared to 2021?",
        "response": "45.0%",
        "source": "finqa"
    },
    {
        "query": "What is the primary function of the Small Business & Self-Employed segment as described?",
        "response": "To serve small businesses and self-employed individuals around the world, including assisting them with financial management and offering advice through accounting professionals.",
        "source": "finqa"
    },
    {
        "query": "How does AutoZone's Point-of-Sale System enhance customer service?",
        "response": "AutoZone's Point-of-Sale System incorporates bar code scanning and point-of-sale data collection terminals which enhances customer service by facilitating efficient transaction processing and providing administrative support.",
        "source": "finqa"
    },
    {
        "query": "What is the weighted-average remaining lease term for operating leases as of September 30, 2023?",
        "response": "approximately six years",
        "source": "finqa"
    },
    {
        "query": "How much did net cash inflows resulting from non-cash charges to operations increase in the year 2023 compared to 2022?",
        "response": "$256.7 million",
        "source": "finqa"
    },
    {
        "query": "In which city and state did Costco originally start its business?",
        "response": "Costco originally started its business in Seattle, Washington.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Individual Medicare Advantage membership in 2023?",
        "response": "18.5%",
        "source": "finqa"
    },
    {
        "query": "How are revenues and expenses of the company's consolidated foreign operations calculated?",
        "response": "Revenues and expenses of the company's consolidated foreign operations are translated at average exchange rates prevailing during the year.",
        "source": "finqa"
    },
    {
        "query": "How does Delta Air Lines account for the revenue from its marketing agreements, such as the one with American Express?",
        "response": "Delta Air Lines allocates the revenue from marketing agreements like that with American Express by associating the consideration with the different products and services provided, such as travel awards and priority boarding.",
        "source": "finqa"
    },
    {
        "query": "How did noncash interest income net change from 2022 to 2023?",
        "response": "It decreased by 53, from 369 in 2022 to 316 in 2023.",
        "source": "finqa"
    },
    {
        "query": "How did total revenue change for the Company in 2023 compared to 2022?",
        "response": "In 2023, the total revenue for the Company increased by $35.3 billion, or 10.9%, compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is indicated by 'Item 8' in a financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What legal mechanism shields DaVita's forward-looking statements from litigation?",
        "response": "DaVita's forward-looking statements are intended to be protected under the safe harbor provisions provided by the Private Securities Litigation Reform Act of 1995.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of float at Berkshire Hathaway as of December 31, 2023?",
        "response": "The total amount of float at Berkshire Hathaway as of December 31, 2023 was approximately $169 billion.",
        "source": "finqa"
    },
    {
        "query": "What score did the company receive from CDP in February 2023?",
        "response": "B",
        "source": "finqa"
    },
    {
        "query": "What was the purpose of pre-tax adjustments for transformation costs by The Kroger Co.?",
        "response": "Transformation costs primarily include costs related to store and business closure costs and third party professional consulting fees associated with business transformation and cost saving initiatives.",
        "source": "finqa"
    },
    {
        "query": "What is presented in Item 8 of the financial report?",
        "response": "The index to Financial Statements and Supplementary Data is presented.",
        "source": "finqa"
    },
    {
        "query": "What is JPMorgan Chase's approach to promoting an inclusive work environment during the recruitment process?",
        "response": "JPMorgan Chase promotes an inclusive work environment during the recruitment process by focusing on career coaching, mentorship, and prioritizing the unique skills of candidates over traditional degree requirements.",
        "source": "finqa"
    },
    {
        "query": "How are indefinite-lived intangible assets evaluated for impairment in a business?",
        "response": "Indefinite-lived intangible assets are evaluated for impairment by first conducting a qualitative assessment to determine if a quantitative impairment test is necessary. If it is determined that the fair value of the asset is more likely than not less than its carrying amount, a quantitative impairment test involving estimation of future cash flows, growth rates, and economic conditions is performed.",
        "source": "finqa"
    },
    {
        "query": "What is the proportion of Nike Brand footwear manufactured in Vietnam, Indonesia, and China for fiscal 2023?",
        "response": "For fiscal 2023, approximately 50% of Nike Brand footwear was manufactured in Vietnam, 27% in Indonesia, and 18% in China.",
        "source": "finqa"
    },
    {
        "query": "What amount of cash, cash equivalents, and restricted cash did the company have at the end of the period?",
        "response": "$6,985",
        "source": "finqa"
    },
    {
        "query": "How does Walmart ensure the well-being of its associates?",
        "response": "Walmart invests in the physical, emotional, and financial well-being of its associates by offering competitive wages and a variety of benefits. In the U.S., these benefits include affordable healthcare coverage, 401(k) matches, and parental leave among others.",
        "source": "finqa"
    },
    {
        "query": "What subsection of the financial documents contains information on legal matters as per Item 3's referencing?",
        "response": "Notes to Consolidated Financial Statements — Note 17 — Commitments and Contingencies — Litigation",
        "source": "finqa"
    },
    {
        "query": "What mechanism does the ACO REACH model use to calculate payments and savings?",
        "response": "The ACO REACH model uses a retrospective payment system where Medicare reimburses providers according to their usual fee-for-service payment schedule while tracking the total fee-for-service costs for billable services rendered for attributed Medicare beneficiaries over the year. If the costs exceed a benchmark, the ACO owes to CMS, and if lower, CMS pays the ACO the savings achieved.",
        "source": "finqa"
    },
    {
        "query": "What was the financial impact of the non-cash NCM exhibitor services agreement?",
        "response": "The non-cash NCM exhibitor services agreement involved receiving common membership units from NCM in exchange for exclusive theater screen access, recognized due to the extended period between receiving these units and fulfilling the performance obligation.",
        "source": "finqa"
    },
    {
        "query": "What principles are the company's total rewards programs based on?",
        "response": "The company's total rewards programs are based on the principles of paying for performance, paying competitively versus peer companies, and focusing on long-term success through a combination of short-term and long-term incentive programs.",
        "source": "finqa"
    },
    {
        "query": "What changes to income tax disclosures are mandated by ASU No. 2023-09, and when does it become effective?",
        "response": "ASU No. 2023-09 requires enhanced disclosures related to income taxes, including the rate reconciliation and information on income taxes paid, and becomes effective January 1, 2025.",
        "source": "finqa"
    },
    {
        "query": "What types of revenues are included in the management and franchise segment of a hospitality company?",
        "response": "The management and franchise segment includes revenues from management and franchise fees charged to third-party hotel owners, licensing fees from strategic partners, and fees for managing hotels in the ownership segment.",
        "source": "finqa"
    },
    {
        "query": "What was the effective income tax rate for fiscal 2022?",
        "response": "(3.6)%",
        "source": "finqa"
    },
    {
        "query": "What technologies is Hewlett Packard Labs investing in?",
        "response": "Hewlett Packard Labs is investing in technological advancements such as artificial intelligence software, advanced systems architectures, networking, and photonics.",
        "source": "finqa"
    },
    {
        "query": "How much did Caterpillar's total sales and revenues increase by in 2023 compared to 2022?",
        "response": "$7.633 billion",
        "source": "finqa"
    },
    {
        "query": "What were the total charges related to the Restructuring Plan for the fiscal year ended June 30, 2023?",
        "response": "The total charges related to the Restructuring Plan were $332.4 million for the fiscal year ended June 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the decrease in cash provided by continuing operating activities from 2022 to 2023?",
        "response": "The decrease was primarily due to a $409 million reduction in operating income.",
        "source": "finqa"
    },
    {
        "query": "What were the allegations made against Peloton Interactive, Inc. in the consolidated securities class action lawsuit involving the City of Hialeah Employees' Retirement System and Anastasia Deulina?",
        "response": "The lawsuit alleged that the defendants made false and/or misleading statements about the demand for the company’s products and the reasons for the company's inventory growth, and engaged in improper trading practices in violation of Sections 10(b) and 20A of the Exchange Act.",
        "source": "finqa"
    },
    {
        "query": "How does the company support multi-billion-dollar end markets with their technology?",
        "response": "The company supports multi-billion-dollar end markets by using a variety of software stacks developed either internally or by third-party developers and partners, utilizing a shared underlying technology across all these markets.",
        "source": "finqa"
    },
    {
        "query": "What services does Amazon Web Services (AWS) offer to its clients?",
        "response": "AWS provides a broad set of on-demand technology services including compute, storage, database, analytics, machine learning, and more to various client types such as start-ups, government agencies, and academic institutions.",
        "source": "finqa"
    },
    {
        "query": "How is the Hilton Honors program funded?",
        "response": "The Hilton Honors program is funded by contributions from eligible revenues generated by Hilton Honors members and collected from properties, as well as strategic partnerships. These funds are used to reimburse hotels and partners for point redemptions and to cover administrative and marketing costs.",
        "source": "finqa"
    },
    {
        "query": "What was the primary driver for the increase in Caterpillar's sales and revenues in 2023?",
        "response": "The increase was primarily due to favorable price realization and higher sales volume.",
        "source": "finqa"
    },
    {
        "query": "How much interest does Chevron hold in the production sharing contract for deepwater Block 14?",
        "response": "31 percent",
        "source": "finqa"
    },
    {
        "query": "What is the significance of Note 13 in the context of legal proceedings described in the Annual Report on Form 10-K?",
        "response": "Note 13 is significant because it contains a detailed description of the company's significant pending legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What is the location of the consolidated financial statements and accompanying notes in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are listed in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "When did The Hershey Company declare the dividend that was paid on March 15, 2023?",
        "response": "January 31, 2023",
        "source": "finqa"
    },
    {
        "query": "What are the benefits of registering trademarks for the company's business?",
        "response": "Trademark registrations help protect brand identity, are essential for marketing, and can be renewed indefinitely, maintaining their validity as long as they are in use.",
        "source": "finqa"
    },
    {
        "query": "What are the contents of Item 8 in the financial document?",
        "response": "Item 8 includes the Consolidated Financial Statements, the Notes to the statements, and the report by PricewaterhouseCoopers LLP, dated February 16, 2024.",
        "source": "finqa"
    },
    {
        "query": "How much did the International segment's income change from 2021 to 2023?",
        "response": "The segment income increased from $74.2 million in 2021 to $148.3 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "How long can a European patent be extended through Supplementary Protection Certificates?",
        "response": "A European patent can be extended up to an additional five years through Supplementary Protection Certificates, subject to a 15-year cap from European Medicines Agency (EMA) approval.",
        "source": "finqa"
    },
    {
        "query": "Does the company believe its ongoing legal matters will materially impact its financial condition or operations?",
        "response": "No, the company does not believe that the ongoing legal matters, either individually or in aggregate, will result in liabilities material to its financial condition, results of operations, or cash flows.",
        "source": "finqa"
    },
    {
        "query": "How much cash did continuing operating activities provide in 2023?",
        "response": "$2,431 million",
        "source": "finqa"
    },
    {
        "query": "By how much did the selling, general and administrative expenses increase in fiscal year 2023?",
        "response": "$210 million",
        "source": "finqa"
    },
    {
        "query": "What major focusing strategy did Hasbro emphasize in 2023 in regards to their brands?",
        "response": "In 2023, Hasbro emphasized a strategy of focusing on fewer, bigger, and more profitable brands, particularly pointing to the success of brands like MAGIC: THE GATHERING and DUNGEONS & DRAGONS.",
        "source": "finqa"
    },
    {
        "query": "How are foreign currency fluctuations managed in Iron Mountain's financial reports?",
        "response": "Iron Mountain manages foreign currency fluctuations in its financial reports by presenting a constant currency growth rate, calculated by translating the previous year's results at the current year's average exchange rates.",
        "source": "finqa"
    },
    {
        "query": "What represents the company’s remaining performance obligation?",
        "response": "All future revenue under contract that has not yet been recognized as revenue, which includes unearned revenue and unbilled amounts.",
        "source": "finqa"
    },
    {
        "query": "What is the process used to estimate the company's effective tax rate on an interim basis?",
        "response": "On an interim basis, the company estimates its effective tax rate for the full fiscal year and applies this to the year-to-date Income before income taxes, excluding unusual items, to determine the year-to-date Income tax expense. The income tax effects of infrequent or unusual items are recognized when they occur.",
        "source": "finqa"
    },
    {
        "query": "How long did Mr. Karros serve as Senior Vice President, Finance and Treasurer before taking his current role?",
        "response": "From November 2015 to May 2022",
        "source": "finqa"
    },
    {
        "query": "How does Chubb Life distribute its insurance products?",
        "response": "Chubb Life distributes its insurance products through various channels including captive and independent agencies, bancassurance, worksite marketing, retailers, brokers, telemarketing, and direct to consumer marketing.",
        "source": "finqa"
    },
    {
        "query": "What are the primary costs included in the company's restructuring and asset impairment charges?",
        "response": "The primary costs included in the company's restructuring and asset impairment charges consist of employee severance, one-time benefits, workforce reorganization charges, and asset impairment charges.",
        "source": "finqa"
    },
    {
        "query": "What was the total equity of Hewlett Packard Enterprise on October 31, 2023?",
        "response": "$21,238 million",
        "source": "finqa"
    },
    {
        "query": "How much remains of the $60 billion share repurchase program as of June 30, 2023?",
        "response": "As of June 30, 2023, $22.3 billion remains of the $60 billion share repurchase program.",
        "source": "finqa"
    },
    {
        "query": "What are the critical accounting estimates mentioned in relation to financial results evaluation?",
        "response": "Critical accounting estimates mentioned in relation to financial results evaluation include revenue recognition, accounts receivable, fair value estimates for goodwill and noncontrolling interests, accounting for income taxes, and loss contingencies.",
        "source": "finqa"
    },
    {
        "query": "What major business decision did Humana announce in February 2023 about its commercial products?",
        "response": "In February 2023, Humana announced its planned exit from the Employer Group Commercial Medical Products business.",
        "source": "finqa"
    },
    {
        "query": "What led to the reduction of the effective tax rate by 1.6% in the fiscal fourth quarter of 2021?",
        "response": "The reduction was caused by a recognized loss on certain U.S. affiliates related to the previously impaired book value of certain intangibles.",
        "source": "finqa"
    },
    {
        "query": "What strategic changes has Hasbro made regarding its global supply chain?",
        "response": "Hasbro launched a multi-year initiative starting in late 2022 aimed at transforming its global supply chain into a best-in-class network, focusing on performance efficiency, operating model integration, and organizational accountability.",
        "source": "finqa"
    },
    {
        "query": "What approvals and authorizations did Gilead's Trodelvy receive from regulatory bodies?",
        "response": "Trodelvy received FDA approval for an updated label to include overall survival data and also received EC approval as monotherapy for the treatment of adult patients with unresectable or metastatic HR+/HER2- breast cancer after certain prior therapies.",
        "source": "finqa"
    },
    {
        "query": "How much was the total fair value of PSUs vested during the years ended January 28, 2023, January 29, 2022, and January 30, 2021?",
        "response": "The total fair value of the PSUs vested during the years ended January 28, 2023, January 29, 2022, and January 30, 2021 was $44.5 million, $17.3 million, and $19.6 million, respectively.",
        "source": "finqa"
    },
    {
        "query": "What were the total assets of HP Inc. at the end of the fiscal year 2023?",
        "response": "$37,004 million",
        "source": "finqa"
    },
    {
        "query": "What are the effects of a 100 basis point increase in interest rates on the fair value of the entity's long-term debt?",
        "response": "A 100 basis point increase in interest rates would decrease the fair value of the entity's long-term debt by $820 million.",
        "source": "finqa"
    },
    {
        "query": "How many hotels and resorts, including timeshare properties, were franchised by Hilton as of December 31, 2023?",
        "response": "6,679 hotels and resorts",
        "source": "finqa"
    },
    {
        "query": "What unique features does Rinvoq offer for treating inflammatory diseases, and in which regions is it approved?",
        "response": "Rinvoq is an oral, once-daily selective and reversible JAK inhibitor, approved for treating inflammatory diseases such as rheumatoid arthritis and psoriatic arthritis in regions including North America, the European Union, and Japan.",
        "source": "finqa"
    },
    {
        "query": "What are the two reportable segments of the company's operations?",
        "response": "The company operates as two reportable segments: automotive and energy generation and storage.",
        "source": "finqa"
    },
    {
        "query": "In which part of the Consolidated Financial Statements is information regarding legal proceedings specified?",
        "response": "Information regarding legal proceedings is specified in Note 15 of the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What change occurred in 2022 regarding the inclusion of dealership courtesy transportation vehicles in General Motors' total vehicle sales reports?",
        "response": "Starting in 2022, General Motors stopped including dealership courtesy transportation vehicles in their total vehicle sales reports until those vehicles were sold to the end customer.",
        "source": "finqa"
    },
    {
        "query": "What pages in Item 8 contain the Consolidated Financial Statements?",
        "response": "The Consolidated Financial Statements are found on pages 163 to 309 in Item 8.",
        "source": "finqa"
    },
    {
        "query": "How does the company manage working capital to facilitate sales growth?",
        "response": "The company manages working capital by achieving shorter days sales outstanding than days payable outstanding, which helps facilitate positive cash generation that supports sales growth.",
        "source": "finqa"
    },
    {
        "query": "How much did Medicare receivables increase from 2022 to 2023?",
        "response": "$166 million",
        "source": "finqa"
    },
    {
        "query": "How much did the Company sell in trade accounts receivables in the year ended December 31, 2023?",
        "response": "$17,704 million",
        "source": "finqa"
    },
    {
        "query": "In which country is Linzess marketed as Constella for the treatment of IBS-C?",
        "response": "Linzess is marketed as Constella outside of the United States.",
        "source": "finqa"
    },
    {
        "query": "How is revenue from bookings recognized in terms of GBV?",
        "response": "Revenue from bookings is recognized upon check-in.",
        "source": "finqa"
    },
    {
        "query": "How much did the interest expense increase in 2023 compared to 2022?",
        "response": "$645 million, or 73%",
        "source": "finqa"
    },
    {
        "query": "What does orphan drug designation entail in the U.S.?",
        "response": "Orphan drug designation in the U.S. entitles a particular use of the drug to seven years of market exclusivity, intended for conditions affecting fewer than 200,000 people, or where recovery of development and marketing costs through U.S. sales is not expected.",
        "source": "finqa"
    },
    {
        "query": "What is the financial impact of the acquisition agreement Visa entered into in June 2023?",
        "response": "Visa entered into a definitive agreement to acquire Pismo Holdings for $1.0 billion in cash, pending customary closing conditions and regulatory approvals.",
        "source": "finqa"
    },
    {
        "query": "What information is contained in Item 8 of a financial document?",
        "response": "Item 8 contains the Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "How are the details about the company's legal proceedings provided in the report?",
        "response": "The details about the company's legal proceedings are incorporated by reference in the report.",
        "source": "finqa"
    },
    {
        "query": "How are gross realized gains and losses on available-for-sale debt securities accounted for in the consolidated statements of operations?",
        "response": "Gross realized gains and losses on available-for-sale debt securities are included in interest and other income or expense in the consolidated statements of operations.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of long-term income tax liabilities related to unrecognized tax benefits for the company as of December 30, 2023 and December 31, 2022?",
        "response": "$1.4 billion for December 30, 2023, and $1.3 billion for December 31, 2022.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities in 2023?",
        "response": "$1,667 million",
        "source": "finqa"
    },
    {
        "query": "What contributed to the sales growth of DARZALEX?",
        "response": "continued share gains in all regions and market growth",
        "source": "finqa"
    },
    {
        "query": "When does the Company's fiscal year end?",
        "response": "The Company's fiscal year ends on the last Saturday of September.",
        "source": "finqa"
    },
    {
        "query": "What was the net carrying amount of leasehold rights assets as of January 28, 2023 following amortization?",
        "response": "$2.4 million",
        "source": "finqa"
    },
    {
        "query": "What types of payment rates are used for dialysis treatments and associated pharmaceuticals?",
        "response": "Payment for dialysis treatments and associated pharmaceuticals can either be in a single lump-sum per treatment, referred to as bundled rates, or as separate payments, referred to as FFS rates.",
        "source": "finqa"
    },
    {
        "query": "What is the nature of the lawsuit filed by the U.S. Department of Justice against the Company in December 2020?",
        "response": "Violations of the Controlled Substances Act related to nationwide distribution and dispensing of opioids",
        "source": "finqa"
    },
    {
        "query": "How did advertising revenue change in 2023 compared to 2022 and what were the causes?",
        "response": "Advertising revenue decreased in 2023 primarily due to a decline in domestic political advertising and overall market weakness, while it increased in 2022 mainly due to increases in domestic political advertising and revenue from advanced advertising business.",
        "source": "finqa"
    },
    {
        "query": "How is Item 3 'Legal Proceedings' related to other parts of the document?",
        "response": "Item 3 'Legal Proceedings' is integrated by reference to Note 22 and Part II, Item 8 'Financial Statements and Supplementary Data'.",
        "source": "finqa"
    },
    {
        "query": "What were the primary drivers behind the increase in income before tax as a percent to sales in the Innovative Medicine segment in 2023?",
        "response": "The increase in the income before tax as a percent to sales in the Innovative Medicine segment in 2023 was driven by lower one-time Covid-19 vaccine related exit costs, lower in-process research and development impairments, and leveraging in selling and marketing expenses, among other factors.",
        "source": "finqa"
    },
    {
        "query": "What is the expected amount of capital expenditures for fiscal year 2024?",
        "response": "$275 million",
        "source": "finqa"
    }
]