[
    {
        "query": "How have certain vendors been impacted in the supply chain financing market?",
        "response": "Certain vendors have been impacted by volatility.",
        "source": "finqa"
    },
    {
        "query": "Where can one find the consolidated financial statements and accompanying notes in the Annual Report on Form 10-K?",
        "response": "They are included elsewhere in the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "Where is the Financial Statement Schedule located in the Form 10-K for IBM?",
        "response": "On page S-1.",
        "source": "finqa"
    },
    {
        "query": "Who are GameStop's main competitors in the global gaming industry?",
        "response": "GameStop's main competitors include Sony, Microsoft, Nintendo, as well as mass merchants like Walmart and Target, computer product and consumer electronics stores, other gaming and related specialty stores, direct sales by software publishers, numerous online environments, and Web 3.0 platforms.",
        "source": "finqa"
    },
    {
        "query": "How did Rest of Asia Pacific net sales change in 2023 compared to 2022?",
        "response": "They increased by 1% or $240 million",
        "source": "finqa"
    },
    {
        "query": "What was the main cause for the increase in General and Administrative expenses in 2023?",
        "response": "The main cause for the increase in General and Administrative expenses in 2023 was a $991 million increase related to business and operational taxes.",
        "source": "finqa"
    },
    {
        "query": "What types of companies form the origins of the described global technology leader?",
        "response": "The described global technology leader originated from Hewlett-Packard Company, AT&T, LSI Corporation, Broadcom Corporation, Brocade Communications Systems LLC, CA, Inc., Symantec Enterprise Security, and VMware, Inc.",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in determining indicators of impairment for lease intangible assets and property equipment?",
        "response": "Factors considered include historical trends, current trends and future expectations of the hospitality industry, the general economy and regional performance, capital costs, and other asset-specific information.",
        "source": "finqa"
    },
    {
        "query": "What policy change regarding adjusted operating income reporting took effect on January 1, 2023?",
        "response": "Effective January 1, 2023, the adjusted operating income related to Maintenance Choice® transactions is reported only in the Pharmacy & Consumer Wellness segment, eliminating the need for adjusted operating income elimination between segments.",
        "source": "finqa"
    },
    {
        "query": "When did the FASB issue ASU 2019-12 and what does this standard aim to simplify?",
        "response": "The FASB issued ASU 2019-12 in December 2019, aiming to simplify the accounting and disclosure requirements for income taxes by eliminating various exceptions in accounting for income taxes as well as clarifying and amending existing guidance to improve consistency in the application of ASC 740.",
        "source": "finqa"
    },
    {
        "query": "How is the fair value of in-place operating leases assessed?",
        "response": "The fair value of in-place operating leases is assessed internally using a discounted cash flow model, which utilizes the difference between the contractual lease payments and the estimated market rental rates.",
        "source": "finqa"
    },
    {
        "query": "How did constant currency affect the average monthly revenue per paying membership in 2025 compared to 2022?",
        "response": "If constant currency conditions were applied, revenues would have been $597 million higher in 2025 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "How much income tax benefit did HP receive from the US tax return filing in fiscal 2021?",
        "response": "$12 million",
        "source": "finqa"
    },
    {
        "query": "Is the information from the company's website incorporated into the Annual Report on Form 10-K?",
        "response": "No, the information posted on the company's website is not incorporated by reference into the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What are the main features included in the Skills for Jobs initiative launched by Microsoft?",
        "response": "The Skills for Jobs initiative includes learning resources, certification opportunities, and job-seeker tools from LinkedIn, GitHub, and Microsoft Learn, based on data insights from LinkedIn's Economic Graph.",
        "source": "finqa"
    },
    {
        "query": "Are there any legal proceedings currently considered material by the company?",
        "response": "No, as of the date of the report, the company does not consider any of the pending legal proceedings to be material.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in total broadband and DSL net additions from 2021 to 2023?",
        "response": "Total broadband and DSL net additions decreased by 40.2% from 2021 to 2023.",
        "source": "finqa"
    },
    {
        "query": "How many warehouses did Costco operate worldwide as of September 3, 2023?",
        "response": "As of September 3, 2023, Costco operated 861 warehouses worldwide.",
        "source": "finqa"
    },
    {
        "query": "How are the costs associated with product recalls and corrective actions recognized in the financial statements?",
        "response": "Costs of product recalls and corrective actions are recognized in Connected Fitness Products cost of revenue.",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in operating income margin for the Dollar Tree segment in 2022?",
        "response": "The increase in operating income margin for the Dollar Tree segment in 2022 was primarily due to the gross profit margin increase and a decrease in the selling, general and administrative expense rate.",
        "source": "finqa"
    },
    {
        "query": "How much did Airbnb Ireland agree to pay to the Italian Revenue Agency to settle the 2017-2021 audit period regarding Host income tax obligations?",
        "response": "Airbnb Ireland agreed to pay the Italian Revenue Agency 576 million Euro.",
        "source": "finqa"
    },
    {
        "query": "What challenges related to trade protectionism has Nike faced, and what measures has the company taken in response?",
        "response": "Nike has faced challenges due to trade protectionism which led to increased costs of products. In response, Nike monitors protectionist trends, engages in administrative and judicial processes to mitigate trade restrictions, and advocates for trade liberalization in various international forums.",
        "source": "finqa"
    },
    {
        "query": "What role does Google envision for AI in society?",
        "response": "Google believes AI can solve some of the hardest societal, scientific, and engineering challenges of our time.",
        "source": "finqa"
    },
    {
        "query": "What was the net inventory balance of the Company as of December 30, 2023?",
        "response": "$4,351 million",
        "source": "finqa"
    },
    {
        "query": "How does American Express's integrated payments platform differentiate itself from bankcard networks?",
        "response": "American Express's integrated payments platform is differentiated by maintaining direct relationships with both Card Members and merchants, allowing it to have direct access to information at both ends of the card transaction. This contrasts with traditional bankcard networks that may not have such direct relationships.",
        "source": "finqa"
    },
    {
        "query": "How are the consolidated financial statements presented in the Annual Report on Form 10-K?",
        "response": "The consolidated financial states are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "How does the company's sales and marketing strategy support its technology distribution?",
        "response": "The global sales and marketing teams work closely with end customers and various industry ecosystems through a partner network that includes OEMs, ODMs, system builders, add-in board manufacturers, and other ecosystem participants, contributing to rapid market entry, high customer satisfaction, and strong relationships.",
        "source": "finqa"
    },
    {
        "query": "How many full-time employees does the company have as of December 31, 2023?",
        "response": "3,157",
        "source": "finqa"
    },
    {
        "query": "How are the proceeds from the shelf registration statement planned to be used?",
        "response": "For general corporate purposes including working capital, capital expenditures, and potential acquisitions.",
        "source": "finqa"
    },
    {
        "query": "When does Intuit Inc. make its filed or furnished reports available on its website?",
        "response": "Intuit Inc. makes its filed or furnished reports available on its corporate website as soon as reasonably practicable after they are filed or furnished.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of a $200 million charge from a regulatory matter settled in 2022 on other expenses in 2021?",
        "response": "The $200 million charge from a regulatory matter settled in 2022 partially offset lower other expenses in 2021.",
        "source": "finqa"
    },
    {
        "query": "What kind of compliance efforts does the company undertake to ensure accurate diagnosis data under the risk adjustment model?",
        "response": "The company conducts medical record reviews as part of its data and payment accuracy compliance efforts. These reviews help to more accurately reflect diagnosis conditions under the risk adjustment model. The company also relies on providers, including some network employees, to appropriately code their claim submissions with diagnoses, which are sent to CMS as the basis for health status-adjusted payment.",
        "source": "finqa"
    },
    {
        "query": "What is the casino license renewal term for MBS and when is it set to expire?",
        "response": "The casino license renewal term for MBS is three years, and it is set to expire in April 2025.",
        "source": "finqa"
    },
    {
        "query": "What did the District Court issue against Apple regarding its App Store Review Guidelines?",
        "response": "The District Court issued an injunction enjoining Apple from prohibiting developers from including external links in their apps that direct customers to purchasing mechanisms other than Apple in-app purchasing.",
        "source": "finqa"
    },
    {
        "query": "How much expense did the company incur in 2023 due to currency losses from Argentina to the U.S.?",
        "response": "$3.9 million",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the Form 10-K?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What were the net revenues for Global Banking & Markets in 2023?",
        "response": "$29,996 million",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of net cash provided by operating activities for fiscal year 2023?",
        "response": "$5,641 million",
        "source": "finqa"
    },
    {
        "query": "What types of vehicles does the company design, develop, and manufacture?",
        "response": "The company designs, develops, and manufactures high-performance fully electric vehicles.",
        "source": "finqa"
    },
    {
        "query": "What types of services do the Financial Marketing Services products provide?",
        "response": "The Financial Marketing Services products provide services that help clients manage their marketing efforts, including targeting and segmentation for client acquisition, developing portfolio strategies, and cross-selling additional products and services. They also support digital identity verification and fraud detection and protection.",
        "source": "finqa"
    },
    {
        "query": "How does Intuit foster diversity, equity and inclusion within its workforce?",
        "response": "Intuit fosters diversity, equity, and inclusion through various initiatives including setting goals for workforce diversity, establishing a Center of Excellence led by the Chief Diversity, Equity & Inclusion Officer, running Employee Resource Groups, including dedicated DEI questions in employee engagement surveys, and appointing a Racial Equity Advancement Leadership team.",
        "source": "finqa"
    },
    {
        "query": "What kind of products are offered under the AppleCare brand?",
        "response": "AppleCare offers fee-based service and support products including priority access to technical support, repair and replacement services, and additional coverage for accidental damage or theft and loss, depending on the country and product type.",
        "source": "finqa"
    },
    {
        "query": "How much did the net income change from 2021 to 2023 for a company?",
        "response": "Decreased from $76,033 million in 2021 to $73,795 million in 2023",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in making assumptions for valuing potentially obsolete or over-valued inventory items?",
        "response": "Factors considered include quantities on hand, recent sales, potential price protections, and returns to vendors.",
        "source": "finqa"
    },
    {
        "query": "What was the average remaining lease term for operating leases as reported?",
        "response": "The average remaining lease term for operating leases is 20 years.",
        "source": "finqa"
    },
    {
        "query": "What will happen if the proposed revisions on incentive-based payment arrangements are adopted?",
        "response": "If the proposed revisions on incentive-based payment arrangements are adopted, they will impose restrictions on how compensation can be structured for employees, which could negatively impact the ability to hire, retain, and motivate key personnel.",
        "source": "finqa"
    },
    {
        "query": "What does the 'Energy & Transportation' segment of a company typically involve?",
        "response": "The 'Energy & Transportation' segment typically involves supporting customers using reciprocating engines, turbines, diesel-electric locomotives, and related services across industries like Oil and Gas, Power Generation, and Transportation. It includes responsibilities such as product design, development, marketing, and sales of products like turbines, gas compressors, generator sets, and marine systems.",
        "source": "finqa"
    },
    {
        "query": "How much did eBay's FX-Neutral net revenues increase in 2023 compared to 2022?",
        "response": "eBay's FX-Neutral net revenues increased by 4% in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "By what amount did fiscal 2022 diluted earnings per share increase from fiscal 2021?",
        "response": "$1.16",
        "source": "finqa"
    },
    {
        "query": "How many consumer vehicles were produced and delivered by the company in 2023?",
        "response": "In 2023, the company produced 1,845,985 consumer vehicles and delivered 1,808,581 consumer vehicles.",
        "source": "finqa"
    },
    {
        "query": "How much did the provision from the Tax Cuts and Jobs Act increase the cash taxes paid in fiscal 2023?",
        "response": "This increased our cash taxes paid.",
        "source": "finqa"
    },
    {
        "query": "What acquisitions did the Life Insurance segment include in 2023?",
        "response": "In 2023, the Life Insurance segment included 100 percent of the results of Huatai Group's life and asset management business as required under consolidation accounting.",
        "source": "finqa"
    },
    {
        "query": "What were the EBITDA margins for Consumer Wireline from 2021 to 2023?",
        "response": "Consumer Wireline EBITDA margins were 28.8% in 2021, 29.8% in 2022, and 31.3% in 2023.",
        "source": "finqa"
    },
    {
        "query": "How does the company assess the likelihood of achieving performance conditions for RSUs granted after the Direct Listing?",
        "response": "The company periodically assesses the probability of achieving the performance conditions to determine if the achievement of the performance metric is still probable, and recognizes any cumulative effects of changes in this assessment.",
        "source": "finqa"
    },
    {
        "query": "What uncertainties exist regarding projections of future cash needs and cash flows?",
        "response": "The company acknowledges substantial uncertainty regarding projections of future cash needs and cash flows.",
        "source": "finqa"
    },
    {
        "query": "How many products had Garmin delivered since the inception of its business up to fiscal 2023?",
        "response": "Over 282 million products",
        "source": "finqa"
    },
    {
        "query": "How many pages cover the Financial Statements and Supplementary Data in IBM's 2023 Annual Report to Stockholders?",
        "response": "78 pages",
        "source": "finqa"
    },
    {
        "query": "What was the current debt balance of commercial paper as of December 31, 2023, including its weighted average interest rate and maturity?",
        "response": "The current debt balance of commercial paper as of December 31, 2023, was $2.0 billion, with a weighted average interest rate of 5.37% and a maturity of approximately two months.",
        "source": "finqa"
    },
    {
        "query": "How many active sellers and buyers were connected through Etsy's marketplaces as of December 31, 2023?",
        "response": "As of December 31, 2023, Etsy's marketplaces connected 9.0 million active sellers to 96.5 million active buyers.",
        "source": "finqa"
    },
    {
        "query": "What are the two operating segments of NVIDIA as mentioned in the text?",
        "response": "The two operating segments of NVIDIA are \"Compute & Networking\" and \"Graphics.\"",
        "source": "finqa"
    },
    {
        "query": "What approach did the company adopt in response to the COVID-19 pandemic for their work policies?",
        "response": "In response to the COVID-19 pandemic, the company introduced a global work-from-home policy, which was later modified to allow hybrid work mode in certain countries and locations as business necessitates.",
        "source": "finqa"
    },
    {
        "query": "What condition is Trodelvy approved to treat by the FDA?",
        "response": "Trodelvy is approved by the FDA for the treatment of unresectable locally advanced or metastatic HR+/HER2- breast cancer in patients who have previously received endocrine-based therapy and at least two additional systemic therapies in the metastatic setting.",
        "source": "finqa"
    },
    {
        "query": "What is the primary subject of Item 3 in the report?",
        "response": "Legal Proceedings",
        "source": "finqa"
    },
    {
        "query": "What significant financial activity occurred in continuing investing activities in 2023?",
        "response": "In 2023, significant activity in continuing investing activities included receiving proceeds of $14.5 billion from the maturities and sales of investments, offset by spending $13.9 billion on investments and $456 million on property and equipment.",
        "source": "finqa"
    },
    {
        "query": "How are the gain and loss amounts associated with pension plans amortized in the company's financial statements?",
        "response": "Gain and loss amounts associated with pension plans are amortized over the average remaining future service of each plan. For plans without active employees, the amounts are amortized over the average life expectancy. Additionally, the amortization for other U.S. benefit plans is determined by using a 10% corridor of the greater of the market value of assets or the accumulated postretirement benefit obligation, with excess amounts amortized over the average remaining future service.",
        "source": "finqa"
    },
    {
        "query": "What section title corresponds to page 39 in the financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What happens to the Company's lease ROU assets and liabilities at the commencement of a lease?",
        "response": "At the commencement of the lease, the Company classifies its leases and recognizes lease ROU assets and liabilities on the consolidated balance sheets.",
        "source": "finqa"
    },
    {
        "query": "What type of products does PCC manufacture using investment casting technology?",
        "response": "PCC uses investment casting technology to manufacture aircraft engines, industrial gas turbine and other aeroderivative engines, airframes, medical implants, armament, unmanned aerial vehicles, and various other industrial applications.",
        "source": "finqa"
    },
    {
        "query": "What was the purpose of the partnerships announced with Ukraine in 2023?",
        "response": "The partnerships with Ukraine announced in 2023 were aimed to support the country in its defense and reconstruction efforts, and to assist in investigations of potential war crimes among other activities.",
        "source": "finqa"
    },
    {
        "query": "What revenue growth did the company's U.S. business and International segment experience in fiscal 2023?",
        "response": "In fiscal 2023, the company's U.S. business and International segment revenue growth primarily drove the consolidated revenue increase of 12%, from $32.3 billion in fiscal 2022 to $36.0 billion.",
        "source": "finqa"
    },
    {
        "query": "What segments does the Company manage its business on?",
        "response": "The Company manages its business primarily on a geographic basis, with reportable segments consisting of the Americas, Europe, Greater China, Japan, and Rest of Asia Pacific.",
        "source": "finqa"
    },
    {
        "query": "What significant change is set for General Motors' EVs starting in 2025 regarding charging hardware?",
        "response": "They will be built with North American Charging Standard (NACS) hardware.",
        "source": "finqa"
    },
    {
        "query": "What financial instruments does the company use to manage commodity price exposure?",
        "response": "The company uses futures, options, and swap contracts to manage commodity price exposure.",
        "source": "finqa"
    },
    {
        "query": "What investments has the company made to enhance the interconnected shopping experience?",
        "response": "The company has made investments in digital properties, focusing on improving website and mobile app functionality, search capabilities, and product presentation, to provide a seamless shopping experience across physical and digital platforms.",
        "source": "finqa"
    },
    {
        "query": "Who was appointed as Hasbro's Chief Financial Officer in 2023, and what was her previous position?",
        "response": "Gina Goetter was appointed as Hasbro's Chief Financial Officer in 2023, having previously served as Chief Financial Officer at Harley Davidson, Inc.",
        "source": "finqa"
    },
    {
        "query": "What strategy is used for managing risks related to insurance claims?",
        "response": "The company uses self-insurance for certain risks and has a wholly-owned captive insurance subsidiary and participates in a reinsurance program to manage risks related to insurance claims.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the significant increase in Interest Expense in 2023?",
        "response": "The primary reason for the significant increase in Interest Expense in 2023 was non-recurring interest paid relating to withholding tax payments on behalf of Hosts.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Tractor's common stock did we own as of December 31, 2023?",
        "response": "10.2%",
        "source": "finqa"
    },
    {
        "query": "What are Kroger’s four strategic pillars?",
        "response": "Kroger's four strategic pillars are Fresh, Our Brands, Data & Personalization, and Seamless.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount spent by Enphase Energy, Inc. on repurchasing shares under the 2023 Repurchase Program during the year ending December 31, 2023?",
        "response": "$410.0 million",
        "source": "finqa"
    },
    {
        "query": "Why are the consolidated financial statements included immediately after Part IV?",
        "response": "The consolidated financial statements are included immediately after Part IV to provide a structured and sequential presentation of the financial information following the earlier sections of the document.",
        "source": "finqa"
    },
    {
        "query": "What was the largest loss recorded in trading-related revenue during 2022?",
        "response": "$9 million",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the revenues from ICE Bonds' fixed income execution increase in 2023 compared to 2022?",
        "response": "23%",
        "source": "finqa"
    },
    {
        "query": "Which regulations have influenced the company's use of data in advertising?",
        "response": "Regulations such as the General Data Protection Regulation, ePrivacy Directive, the European Digital Services Act, and U.S. state privacy laws including the California Consumer Privacy Act have influenced the company's use of data in advertising.",
        "source": "finqa"
    },
    {
        "query": "What is the specialty of See's Candy Shops, and how seasonal is their revenue pattern?",
        "response": "See's Candy Shops specializes in producing and selling boxed chocolates and confections, emphasizing quality and distinctiveness. Their revenue is highly seasonal with about half of the annual revenue earned in the fourth quarter.",
        "source": "finqa"
    },
    {
        "query": "What was Caterpillar's consolidated net worth at the end of 2023, and what was the minimum required under the Credit Facility?",
        "response": "Caterpillar’s consolidated net worth at the end of 2023 was $19.55 billion, which was above the $9.00 billion required under the Credit Facility.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of the goodwill generated from the acquisition of Xilinx?",
        "response": "$22,784 million",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of a company's internal control over financial reporting?",
        "response": "A company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for Hasbro in 2023?",
        "response": "$725.6 million",
        "source": "finqa"
    },
    {
        "query": "What is the total value of short-term and long-term investments held by the company as of December 31, 2023?",
        "response": "$322,794 thousand",
        "source": "finqa"
    },
    {
        "query": "What actions do supervisory agencies have the authority to take against the Company according to U.S. regulations?",
        "response": "Supervisory agencies have the authority to grant, suspend, or revoke the Company's licenses; suspend or exclude the Company from government programs; limit its marketing authority; regulate pricing and underwriting; assess fines and penalties; terminate contracts with government agencies; impose premium adjustments and require refunds; restrict acquisitions; mandate minimum capital levels; regulate investment activities; and exclude the Company's plans from Public Exchanges for unreasonable rate increases or other failures.",
        "source": "finqa"
    },
    {
        "query": "For comprehensive information on a company's legal matters, which part of the financial statement should one consult?",
        "response": "One should consult Note 12 to the Consolidated Financial Statements for comprehensive information on a company's legal matters.",
        "source": "finqa"
    },
    {
        "query": "What legislative act defines the term 'forward-looking statements' as used in the provided report?",
        "response": "The term 'forward-looking statements' as used in the report is defined by the Private Securities Litigation Reform Act of 1995.",
        "source": "finqa"
    },
    {
        "query": "What is the item number where you can find details about the company's legal proceedings in the Form 10-K?",
        "response": "Details about the company's legal proceedings can be found in Item 8 of Part II of the Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in total net sales during the fiscal year ending December 30, 2023 compared to the previous fiscal year?",
        "response": "7%",
        "source": "finqa"
    },
    {
        "query": "What occurs if the carrying amount of an indefinite-lived intangible asset, other than goodwill, exceeds its fair value?",
        "response": "An impairment charge is recognized in the amount equal to the excess of the carrying amount over the fair value.",
        "source": "finqa"
    },
    {
        "query": "What are the components of cost of revenue for a Connected Fitness Subscriptions subscription?",
        "response": "The cost of revenue for a Connected Fitness Subscriptions subscription includes costs associated with content creation and costs to stream content to members, which consist of both fixed and variable costs such as studio rent, instructor expenses, music royalty fees, and payment processing fees.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of the Russia-Ukraine conflict on The Hershey Company's commodity prices in 2023?",
        "response": "In 2023, the conflict between Russia and Ukraine did not have a material impact on The Hershey Company's commodity prices or supply availability.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash used by investing activities in 2022?",
        "response": "$3.0 billion",
        "source": "finqa"
    },
    {
        "query": "What percentage of consolidated net sales and earnings did the Ukraine business contribute in the fiscal year ended June 30, 2023?",
        "response": "The Ukraine business contributed less than 1% to both consolidated net sales and consolidated net earnings in the fiscal year ended June 30, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the focus areas for the HP GreenLake platform?",
        "response": "The HP GreenLake platform focuses on providing software-defined disaggregated storage services, cloud data protection, and unified cloud-based management for storage.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in operating margin from fiscal 2022 to fiscal 2023?",
        "response": "The operating margin increased from 14.3% in fiscal 2022 to 16.3% in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the capital categories established under FDICIA for FDIC-insured banks?",
        "response": "The capital categories established under FDICIA for FDIC-insured banks are well-capitalized, adequately capitalized, undercapitalized, significantly undercapitalized, and critically undercapitalized.",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in a financial document generally contain?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "Under what conditions might the civil penalties assessed to GM and Ultium Cells LLC increase?",
        "response": "The penalties could increase depending on the import activity prior to receipt of a TSCA 5(e) order",
        "source": "finqa"
    },
    {
        "query": "What were the net proceeds from the issuance of $4.0 billion senior notes in March 2022 used for?",
        "response": "For general corporate purposes, including repayment of outstanding indebtedness.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the Employee Resource Groups (ERGs) in the organization?",
        "response": "The Employee Resource Groups (ERGs) help ensure different voices and perspectives contribute to the organization's strategy for long-term profitable growth and engage employees to contribute to their development and retention.",
        "source": "finqa"
    },
    {
        "query": "How is the impairment of assets assessed for projects still under development?",
        "response": "For assets still under development, impairment is assessed by grouping them with their asset group. Future cash flows, including remaining construction costs, are estimated and compared to the carrying value to assess impairment.",
        "source": "finqa"
    },
    {
        "query": "What are the key variables used in the statistical model to estimate credit losses for a residential real estate portfolio?",
        "response": "Key variables include delinquency roll rates, housing prices, interest rates, and the unemployment rate.",
        "source": "finqa"
    },
    {
        "query": "What primarily constituted marketing expenses for the year ended December 31, 2025?",
        "response": "Marketing expenses primarily consisted of advertising expenses and payments made to marketing and advertising sales partners.",
        "source": "finqa"
    },
    {
        "query": "What was the net income reported for the fiscal year ending in August 2023?",
        "response": "$2,528,426",
        "source": "finqa"
    },
    {
        "query": "What obligations does VML have if an annual execution proposal is not approved by the Macao government?",
        "response": "If any annual execution proposal is not approved, VML must propose reallocating the funds to other projects related to its activity, which also require Macao government approval.",
        "source": "finqa"
    },
    {
        "query": "What are the key segments under Google for reporting purposes?",
        "response": "Google comprises two segments for reporting purposes: Google Services and Google Cloud.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage impact on gross margin from inventory provisions and sales of previously written down items in fiscal year 2023?",
        "response": "The impact on gross margin from inventory provisions and sales of previously written down items was an unfavorable 7.5% in fiscal year 2023.",
        "source": "finqa"
    },
    {
        "query": "How much was the gross margin as a percentage of net revenue in 2023?",
        "response": "46%",
        "source": "finqa"
    },
    {
        "query": "What are the expiration dates for Comcast's NFL streaming and broadcast rights?",
        "response": "2033-34 season",
        "source": "finqa"
    },
    {
        "query": "How is NIKE's return on invested capital (ROIC) calculated, and what was its value as of May 31, 2023?",
        "response": "NIKE's ROIC is calculated by adding net income, interest expense (net), and income tax expense, then dividing by total invested capital. As of May 31, 2023, the ROIC was 31.5%.",
        "source": "finqa"
    },
    {
        "query": "What actions have the U.S. NHTSA and EPA taken to preempt California’s ZEV and GHG standards, and what were the outcomes?",
        "response": "NHTSA and the EPA initially took actions to preempt California’s GHG and ZEV standards, but later repealed these preemptions and rescinded withdrawals, allowing California and adopting states to enforce these standards, despite the actions facing litigation.",
        "source": "finqa"
    },
    {
        "query": "What was the GAAP income before taxes for 2023?",
        "response": "$17,780 million",
        "source": "finqa"
    },
    {
        "query": "What is the accumulated benefit obligation for AT&T's pension plans as of December 31, 2023?",
        "response": "$32,481 million",
        "source": "finqa"
    },
    {
        "query": "What was the balance of net cash used in financing activities for Costco for the 52 weeks ended August 28, 2022?",
        "response": "The balance of net cash used in financing activities for Costco for the 52 weeks ended August 28, 2022, was 4,283 million dollars.",
        "source": "finqa"
    },
    {
        "query": "What are included in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included.",
        "source": "finqa"
    },
    {
        "query": "How does the company recognize stock-based compensation in its financial statements?",
        "response": "The company recognizes stock-based compensation by estimating the fair value, net of estimated forfeitures, of equity awards and recording the related expense as Cost of sales or Operating overhead expense in the Consolidated Statements of Income. This expense is recognized on a straight-line basis over the vesting period of the awards.",
        "source": "finqa"
    },
    {
        "query": "How did the change in non-rolling chip win percentage at The Venetian Macao from 2022 to 2023 affect overall revenues?",
        "response": "The non-rolling chip win percentage at The Venetian Macao decreased from 25.7% in 2022 to 24.2% in 2023, which was part of the context for the revenue changes mentioned.",
        "source": "finqa"
    },
    {
        "query": "How much did the company repay in fixed rate senior notes in April 2023?",
        "response": "$1.0 billion",
        "source": "finqa"
    },
    {
        "query": "What factors influenced the decrease in net bookings in fiscal year 2023 compared to 2022?",
        "response": "The decrease in net bookings for fiscal year 2023 by $174 million or 2 percent compared to 2022 was primarily due to the release of Battlefield 2042 in the prior year, a $244 million impact related to fluctuations in foreign exchange rates net of hedging activities, and partially offset by strong performances in the FIFA franchise.",
        "source": "finqa"
    },
    {
        "query": "What are some of the regulations that U.S. state and local authorities impose on Comcast's Studios and Theme Parks businesses?",
        "response": "Regulations include accessibility to video and voice services and broadcast television programming for people with disabilities, customer service standards, inside wiring, cable equipment, pole attachments, universal service fees, regulatory fees, public safety, telemarketing, leased access, indecency, loudness of commercial advertisements, advertising, political broadcasting, sponsorship identification, Emergency Alert System, equal employment opportunity, and other employment-related laws, environmental matters, equipment supply chain, and technical standards relating to the operation of cable systems and television stations.",
        "source": "finqa"
    },
    {
        "query": "What were the pre-tax earnings of the manufacturing sector in 2023, 2022, and 2021?",
        "response": "The pre-tax earnings of the manufacturing sector were $11,445 million in 2023, $11,177 million in 2022, and $9,841 million in 2021.",
        "source": "finqa"
    },
    {
        "query": "What was the return on average common equity for Asset & Wealth Management in 2023?",
        "response": "3.2%",
        "source": "finqa"
    },
    {
        "query": "How does FedEx Express primarily fulfill its jet fuel needs?",
        "response": "FedEx Express purchased jet fuel from various suppliers under contracts that vary in length and which provide for estimated amounts of fuel to be delivered. These contracts are purchased at market prices.",
        "source": "finqa"
    },
    {
        "query": "Which part of the Annual Report on Form 10-K refers to disclosures about legal proceedings?",
        "response": "Item 3",
        "source": "finqa"
    },
    {
        "query": "How much did AT&T Inc.'s operating income increase by in percentage terms from 2022 to 2023?",
        "response": "8.6%",
        "source": "finqa"
    },
    {
        "query": "What types of arrangements does the company have with healthcare providers to influence where members seek care?",
        "response": "The company employs several techniques including contractual discounts, coordination of care, product and benefit designs, hospital inpatient management systems, use of analytics, and entering members into care management programs, to influence where members seek healthcare services.",
        "source": "finqa"
    },
    {
        "query": "What is the status of Item 6 in the document?",
        "response": "Item 6 is reserved.",
        "source": "finqa"
    },
    {
        "query": "How are paid clicks and cost-per-click defined and calculated by Google?",
        "response": "Paid clicks represent user engagement with advertisements on Google search properties and other Google properties like Gmail, Google Maps, and Google Play. Cost-per-click is calculated as the revenue obtained from click-driven advertisements divided by the total number of paid clicks, representing the average amount charged to advertisers per engagement.",
        "source": "finqa"
    },
    {
        "query": "What impact would a five percentage point change in the tail factor have on the projected net loss and loss expense reserves for the main U.S. Excess/Umbrella portfolios?",
        "response": "A five percentage point change in the tail factor would result in a change of approximately $0.7 billion, either positive or negative, in the projected net loss and loss expense reserves.",
        "source": "finqa"
    },
    {
        "query": "How does referencing Note 16 help in understanding the legal proceedings discussed in Item 3 of a Form 10-K?",
        "response": "Referencing Note 16 allows for access to comprehensive details on legal proceedings which are not exhaustively covered in Item 3 but are crucial for a thorough understanding.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage growth of advertising expenses in absolute dollars for the fiscal year ending December 30, 2023?",
        "response": "3%",
        "source": "finqa"
    },
    {
        "query": "What are some of the products and services offered by the globally integrated payments company?",
        "response": "The company offers credit and charge cards, banking, merchant acquisition and processing services, network services, fraud prevention, customer loyalty programs, expense management, and travel and lifestyle services.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of income tax benefits related to capital losses utilized by HP in fiscal 2021?",
        "response": "$27 million",
        "source": "finqa"
    },
    {
        "query": "What contributed to the growth in NIKE Brand footwear revenues in fiscal 2023?",
        "response": "The growth in NIKE Brand footwear revenues in fiscal 2023 was primarily due to higher revenues in Men's, the Jordan Brand, Women's, and Kids', with an increase in unit sales by 13% and higher average selling price per pair contributing approximately 7 percentage points to the revenue growth.",
        "source": "finqa"
    },
    {
        "query": "What percentage of annual net trade sales did the sales returns reserve for the total Company account for during each of the fiscal years 2021, 2022, and 2023?",
        "response": "Less than 1.0%",
        "source": "finqa"
    },
    {
        "query": "What methodology does the company employ quarterly to assess the adequacy of warranty liability?",
        "response": "a consistent, systematic and rational methodology",
        "source": "finqa"
    },
    {
        "query": "How is goodwill impairment assessed at Peloton?",
        "response": "Goodwill impairment at Peloton is assessed annually on April 1, and more frequently if events or changes indicate potential impairment. The assessment begins with qualitative factors to determine if it's likely that the fair value of a reporting unit is less than its carrying amount, followed by a quantitative assessment if necessary.",
        "source": "finqa"
    },
    {
        "query": "When are the near final market risk rules issued by the PRA expected to become effective in the U.K.?",
        "response": "July 1, 2025",
        "source": "finqa"
    },
    {
        "query": "What contributed to the increase in interest income in 2023 compared to 2022?",
        "response": "The increase in interest income in 2023 was mainly due to higher interest earned on cash and cash equivalents and short-term investments, influenced by rising interest rates and an increase in the portfolio balance.",
        "source": "finqa"
    },
    {
        "query": "How much did the GAAP cost of sales decrease in 2023 compared to 2022?",
        "response": "$94 million",
        "source": "finqa"
    },
    {
        "query": "How does the company measure and support employee engagement and cultural growth?",
        "response": "The company uses Performance Enablement and Culture & Engagement Survey platforms to measure and support progress against growth behaviors, ensuring employees are engaged and fulfilled at work.",
        "source": "finqa"
    },
    {
        "query": "How does Credit Karma support its users' financial journey?",
        "response": "Credit Karma offers free services like access to credit scores and reports, credit and identity monitoring, dispute resolutions, financial progress tools, and personalized financial product recommendations.",
        "source": "finqa"
    },
    {
        "query": "How much uncalled capital was available for future investing by Goldman Sachs as of December 2023?",
        "response": "$58 billion",
        "source": "finqa"
    },
    {
        "query": "In which document are the consolidated financial statements and accompanying notes included?",
        "response": "Annual Report on Form 10-K",
        "source": "finqa"
    },
    {
        "query": "How many destinations does Delta Air Lines offer flights to as of the end of 2023?",
        "response": "More than 280",
        "source": "finqa"
    },
    {
        "query": "What types of risks are usually covered by the company's insurance policies?",
        "response": "The company's insurance policies typically cover general liability, property, business interruption, terrorism, and other risks associated with their business operations.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of The Home Depot's distribution network?",
        "response": "The purpose of The Home Depot's distribution network is to provide a competitive advantage with unique, industry-leading capabilities to meet home improvement needs for both professional and consumer customers.",
        "source": "finqa"
    },
    {
        "query": "What additional short-term funding options do CSC's banking subsidiaries have access to?",
        "response": "CSC's banking subsidiaries have access to short-term secured funding through the Federal Reserve discount window.",
        "source": "finqa"
    },
    {
        "query": "What does LinkedIn's Talent Solutions include?",
        "response": "LinkedIn's Talent Solutions includes insights for workforce planning and tools for hiring, nurturing, and developing talent. Additionally, it encompasses Learning Solutions which assist businesses in closing critical skills gaps, especially during times when companies have to maximize their existing workforce.",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements and accompanying notes located in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included elsewhere in the Annual Report on Form 10-K, specifically listed in Part IV, Item 15(a)(1).",
        "source": "finqa"
    },
    {
        "query": "What criteria was used to audit the internal control over financial reporting of The Procter & Gamble Company as of June 30, 2023?",
        "response": "The criteria used to audit the internal control over financial reporting of The Procter & Gamble Company as of June 30, 2023, were established in the Internal Control — Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).",
        "source": "finqa"
    },
    {
        "query": "What is the effect of a 0.75% increase in completion factors on medical costs payable as of December 31, 2023?",
        "response": "An increase of $880 million.",
        "source": "finqa"
    },
    {
        "query": "How might future market volatility affect the company's costs associated with issuing commercial paper?",
        "response": "Future volatility may increase the costs associated with issuing commercial paper or other debt instruments.",
        "source": "finqa"
    },
    {
        "query": "What kind of services does PhonePe offer in India?",
        "response": "PhonePe in India offers services like mobile and bill payment, person-to-person (P2P) payment, investment and insurance solutions, financial services, and advertising.",
        "source": "finqa"
    },
    {
        "query": "What do Note 10 and Item 8 of the report encompass?",
        "response": "Note 10 and Item 8 of the report encompass the discussion of Legal Proceedings.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in general and administrative expenses in 2023 compared to 2022?",
        "response": "9.9%",
        "source": "finqa"
    },
    {
        "query": "Where can you find the consolidated financial statements in the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements are located immediately following Part IV of the Annual Report on Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "How are the adjusted income from operations and gross profit figures calculated for the company?",
        "response": "The adjusted income from operations and gross profit figures for the company are calculated by excluding stock-based compensation and related employer payroll taxes from the reported income from operations and gross profit values.",
        "source": "finqa"
    },
    {
        "query": "Is the information in Item 3 considered an integral part of the document?",
        "response": "Yes, the information in Item 3 is considered an integral part of the document, specifically referencing Note 22 and Part II, Item 8.",
        "source": "finqa"
    },
    {
        "query": "Who is responsible for the management and performance of The Hershey Company?",
        "response": "The Company's Board is solely responsible and accountable for the management and performance of The Hershey Company.",
        "source": "finqa"
    },
    {
        "query": "What are forward-looking statements within the context of DaVita's annual report?",
        "response": "Forward-looking statements in DaVita's annual report refer to statements predicting or projecting future events, outcomes, and conditions related to the company's operations, financial condition, and prospects. These include expectations about revenues, expenses, treatment volumes, macroeconomic conditions, and impacts from innovative technologies or treatments among others.",
        "source": "finqa"
    },
    {
        "query": "What considerations are made when assessing the recoverability of deferred tax assets?",
        "response": "The recoverability of deferred tax assets is assessed based on the likelihood of recovery, considering sources of taxable income, tax planning strategies, and future taxable income.",
        "source": "finqa"
    },
    {
        "query": "What former roles has Indra K. Nooyi held?",
        "response": "Chair and CEO of PepsiCo, Inc.",
        "source": "finqa"
    },
    {
        "query": "What potential consequences could the company face due to these legal proceedings?",
        "response": "The company could be subject to monetary damage awards, fines, penalties, or injunctive orders.",
        "source": "finqa"
    },
    {
        "query": "How does IMC support its customer base in terms of local inventory management?",
        "response": "IMC maintains additional small quantities of products at local IMC sales offices to provide on-time customer support and inventory management.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by financing activities in 2023, and how does it compare to 2022?",
        "response": "$649.3 million in 2023 and $(91.3 million) in 2022",
        "source": "finqa"
    },
    {
        "query": "What were the carrying amounts of the hedged item and the cumulative amounts of fair value hedging adjustments included in the carrying amount for fixed-to-floating interest rate swaps on October 1, 2023 and October 2, 2022?",
        "response": "The carrying amounts of the hedged item related to fixed-to-floating interest rate swaps were $1,060 million on October 1, 2023, and $1,047.7 million on October 2, 2022. The cumulative amounts of fair value hedging adjustments included in the carrying amount were $(40.0) million on October 1, 2023, and $(52.3) million on October 2, 2022.",
        "source": "finqa"
    },
    {
        "query": "Where is the “Glossary of Terms and Acronyms” located in a set of financial documents?",
        "response": "Pages 315-321",
        "source": "finqa"
    },
    {
        "query": "What type of products does Huatai P&C offer in China?",
        "response": "Huatai P&C offers a range of commercial and personal P&C products in China, including automobile, homeowners, property, professional liability, product liability, employer liability, business interruption, marine cargo, personal accident, and specialty risk.",
        "source": "finqa"
    },
    {
        "query": "What strategies does the company employ to manage translational exposures from foreign currencies?",
        "response": "The company uses excess cash from certain foreign subsidiaries to purchase U.S. Dollar denominated available-for-sale investments, which helps minimize the impact of translating foreign currency denominated revenues and expenses. Additionally, they utilize forward contracts and/or options to mitigate the variability of forecasted future purchases and sales of these investments.",
        "source": "finqa"
    },
    {
        "query": "Where can NVIDIA's financial reports be accessed?",
        "response": "NVIDIA's financial reports can be accessed for free on their website or through links provided on the website as soon as they are electronically filed or furnished to the SEC.",
        "source": "finqa"
    },
    {
        "query": "What segment of NIKE's business is used to describe the company's internal organizational structure?",
        "response": "NIKE's operating segments, defined by geographic regions for operations participating in NIKE Brand sales activity, describe the company's internal organizational structure.",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue generation of Emgality in 2023?",
        "response": "678.3",
        "source": "finqa"
    },
    {
        "query": "How frequently is the investment portfolio of privately held securities assessed for impairment?",
        "response": "The investment portfolio of privately held securities is assessed quarterly for impairment.",
        "source": "finqa"
    },
    {
        "query": "What factors may cause actual results of the company to differ materially from those in the forward-looking statements?",
        "response": "Factors that may cause actual results to differ materially from those in the forward-looking statements include known and unknown risks, uncertainties, and other factors beyond the company's control.",
        "source": "finqa"
    },
    {
        "query": "What were the main concerns raised in the audit of Peloton Interactive, Inc.'s internal control over financial reporting as of June 30, 2023?",
        "response": "The audit raised concerns about material weaknesses in Peloton Interactive, Inc.'s inventory process and ineffective user access controls over an information technology system that supports the company's financial reporting process.",
        "source": "finqa"
    },
    {
        "query": "What was Delta Air Lines' total profit sharing payments to employees in 2023?",
        "response": "$1.4 billion",
        "source": "finqa"
    },
    {
        "query": "How does Electronic Master's Edition contribute to the company's standing in the marketplace?",
        "response": "Electronic Game's global football franchise, consistently one of its most financially significant offerings, guides its strong marketplace standing. This includes annualized console, PC, and mobile games, like FIFA Ultimate Team, which are instrumental in generating significant revenue and maintaining brand recognition and competitiveness in a crowded market.",
        "source": "finqa"
    },
    {
        "query": "What was the operational procedure performed to ensure the accuracy of the revenue recognition for the Hilton Honors guest loyalty and marketing program?",
        "response": "To ensure the accurate recognition of revenue associated with the Hilton Honors guest loyalty and marketing program, audit procedures included testing the clerical accuracy, consistency with US generally accepted accounting principles of the accounting model developed by the Company, and testing significant inputs into this model.",
        "source": "finqa"
    },
    {
        "query": "How many vehicle brands does General Motors develop, manufacture, or market under in China?",
        "response": "Five",
        "source": "finqa"
    },
    {
        "query": "What methods can a refinery use to meet its Environmental Protection Agency (EPA) requirements for blending renewable fuels?",
        "response": "A refinery can meet its EPA requirements for blending renewable fuels by blending the necessary volumes of renewable fuels, purchasing Renewable Identification Numbers (RINs) in the open market, or through a combination of both blending and purchasing RINs.",
        "source": "finqa"
    },
    {
        "query": "What is the core purpose of the company according to the text?",
        "response": "Advancing a sustainable future for all",
        "source": "finqa"
    },
    {
        "query": "Where can information about the company's legal proceedings be found in the Annual Report on Form 10-K?",
        "response": "Information about the company's legal proceedings can be found in Note 13, Commitments and Contingencies - Legal Proceedings, of the Notes to Consolidated Financial Statements, which is included in Part II, Item 8 of the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What were the main components of the increased cost of sales in 2022 compared to 2021?",
        "response": "The increase in cost of sales in 2022 was mainly due to $767.7 million of unfavorable costs driven by higher sales volume and higher supply chain inflation costs, including logistics and labor.",
        "source": "finqa"
    },
    {
        "query": "How much did the company repurchase of its common stock under the stock repurchase programs during 2023?",
        "response": "$1.4 billion",
        "source": "finqa"
    },
    {
        "query": "What method is used by the company to record revenue for map updates, map care, and server-based traffic services?",
        "response": "The revenue and associated costs for map updates, map care, and server-based traffic services are deferred and recognized ratably over the contractual service period or estimated life of the products.",
        "source": "finqa"
    },
    {
        "query": "What is listed under Item 8 in the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What are the three business segments of Goldman Sachs as mentioned in their 2023 Form 10-K?",
        "response": "The three business segments of Goldman Sachs are Global Banking & Markets, Asset & Wealth Management, and Platform Solutions.",
        "source": "finqa"
    },
    {
        "query": "What seasonal pattern does the Insurance segment experience in its commercial fully-insured product offerings?",
        "response": "The Insurance segment experiences a seasonal pattern in its commercial fully-insured product offerings, where the benefit ratio increases as members progress through their annual deductible and maximum out-of-pocket expenses.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Intuit's revenues came from the Small Business & Self-Employed segment in fiscal 2023?",
        "response": "56%",
        "source": "finqa"
    },
    {
        "query": "What financial performance metrics are reported for equity investments in Tractor Beverages, Inc. as of December 31, 2023?",
        "response": "As of December 31, 2023, the company owns 4,325 shares of common stock in Tractor Beverages, Inc., representing approximately 10.2% ownership with a total cash consideration of $10,000, and no impairment charges for the year.",
        "source": "finqa"
    },
    {
        "query": "What total amount was spent on capital expenditures in 2023, and what is the planned expenditure for 2024?",
        "response": "In 2023, $4,323 was spent on capital expenditures, and the planned expenditure for 2024 is between $4,400 to $4,600.",
        "source": "finqa"
    },
    {
        "query": "Why did iPhone net sales decrease in 2023 compared to 2022?",
        "response": "Due to lower net sales of non-Pro iPhone models, partially offset by higher net sales of Pro iPhone models",
        "source": "finqa"
    },
    {
        "query": "How many shares of class A common stock were authorized for grant under Visa's Equity Incentive Compensation Plan?",
        "response": "198 million",
        "source": "finqa"
    },
    {
        "query": "What total value of payments and cash volume did Visa process in fiscal year 2023?",
        "response": "$15 trillion",
        "source": "finqa"
    },
    {
        "query": "Which company filed a lawsuit against Apple alleging violations of federal and state antitrust laws and California's unfair competition law?",
        "response": "Epic Games, Inc. filed the lawsuit against Apple.",
        "source": "finqa"
    },
    {
        "query": "When was Kenneth C. Kimball appointed as Senior Vice President at Kroger?",
        "response": "Kenneth C. Kimball was elected Senior Vice President in March 2022.",
        "source": "finqa"
    },
    {
        "query": "What does it mean when an item is 'incorporated by reference' in a document?",
        "response": "'Incorporated by reference' means that the item is included indirectly through a reference to another part of the document where it is discussed in detail.",
        "source": "finqa"
    },
    {
        "query": "What services does NIKE, Inc. provide for all U.S. employees regarding financial management?",
        "response": "NIKE, Inc. provides all U.S. employees with unlimited free financial coaching through a third-party provider.",
        "source": "finqa"
    },
    {
        "query": "What major plan did the company announce in the U.S. market in fiscal 2023?",
        "response": "In fiscal 2023, the company announced the Reinvention Plan in the U.S. market to increase efficiency while enhancing the partner and customer experience.",
        "source": "finqa"
    },
    {
        "query": "What was the total monetary penalty assessed by CBP against the company on November 18, 2021?",
        "response": "$1.3 billion",
        "source": "finqa"
    },
    {
        "query": "What unique aspect does DaVita's Board leadership hold among S&P 500 companies?",
        "response": "DaVita is one of the minority of companies in the S&P 500 to have a woman serving as the Chair of the Board.",
        "source": "finqa"
    },
    {
        "query": "What was the postpaid churn rate for AT&T Inc. in 2023?",
        "response": "0.98%",
        "source": "finqa"
    },
    {
        "query": "What does Note 16 in a 10-K filing pertain to?",
        "response": "Note 16 pertains to Commitments and Contingencies and includes information about certain legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What is required by the New York Community Reinvestment Act (NYCRA) when reviewing applications involving certain transactions for a bank?",
        "response": "The NYCRA requires the NYDFS to consider the NYCRA rating when reviewing applications for certain transactions, like mergers and asset purchases, and this assessment can be a basis for denying the application.",
        "source": "finqa"
    },
    {
        "query": "What challenges do solar power system owners face with traditional string inverters?",
        "response": "With traditional string inverters, owners often cannot optimize the size or shape of their solar PV installations due to string design limitations, leading to performance loss from shading and other obstructions, frequent system failures, and the inability to effectively monitor performance. They also face significant fire risks.",
        "source": "finqa"
    },
    {
        "query": "What documents are detailed in Item 8 of Part IV of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes.",
        "source": "finqa"
    },
    {
        "query": "What conditions must be met for the UK loss sharing agreement to compensate for losses?",
        "response": "The UK loss sharing agreement compensates for losses only if either losses valued in excess of €1.0 billion have arisen in UK covered claims, or the conversion rate of the series B preferred stock has been reduced to zero due to losses in claims related to multilateral interchange fee rate setting in the Visa Europe territory.",
        "source": "finqa"
    },
    {
        "query": "What copyright issues are addressed in the U.S. cable compulsory copyright license?",
        "response": "The cable compulsory copyright license requires video distribution businesses to contribute a specified percentage of revenue to a federal copyright royalty pool for retransmitting copyrighted material in broadcast signals.",
        "source": "finqa"
    },
    {
        "query": "What was Etsy's total revenue in the year ended December 31, 2023?",
        "response": "$2.7 billion",
        "source": "finqa"
    },
    {
        "query": "What triggers the reassessment of probabilities for uncertain tax positions?",
        "response": "Changes in facts and circumstances trigger the reassessment of probabilities for uncertain tax positions.",
        "source": "finqa"
    },
    {
        "query": "How does Walmart support diversity, equity, and inclusion within its workforce?",
        "response": "Walmart aims to build a diverse, equitable, and inclusive company where associates' ideas and opinions matter, focusing onView on inclusion and belonging. They review processes related to fair-pay practices, and their workforce comprises 52% women and 50% people of color in the U.S.",
        "source": "finqa"
    },
    {
        "query": "What caused the increase in U.S. dialysis depreciation and amortization expense in 2023?",
        "response": "The increase in U.S. dialysis depreciation and amortization expense in 2023 was primarily due to accelerated depreciation for expected center closures.",
        "source": "finqa"
    },
    {
        "query": "What is the total cash flow from operating activities for Airbnb, Inc. in 2023?",
        "response": "In 2023, the total cash flow from operating activities for Airbnb, Inc. was $3,884 million.",
        "source": "finqa"
    },
    {
        "query": "What types of Internet transactions are regulated by jurisdictions globally?",
        "response": "Many jurisdictions globally have adopted regulations that require payments system participants to monitor, identify, filter, restrict, or take other actions regarding certain types of payment transactions on the Internet, including those involving gambling, digital currencies, and the purchase of regulated products like cigarettes or alcohol.",
        "source": "finqa"
    },
    {
        "query": "Where are the headquarters of Gilead Sciences, Inc. located?",
        "response": "The headquarters of Gilead Sciences, Inc. are located in Foster City, California.",
        "source": "finqa"
    },
    {
        "query": "What were the net cash used in investing activities for the year 2023?",
        "response": "The net cash used in investing activities for the year 2023 was $4,972.",
        "source": "finqa"
    },
    {
        "query": "Under what conditions are the Company required to disclose certain proceedings according to SEC regulations?",
        "response": "The company is required to disclose certain proceedings if they may result in monetary sanctions above $1 million.",
        "source": "finqa"
    },
    {
        "query": "How does the Bermuda Solvency Capital Requirement (BSCR) influence capitalization for Bermuda insurers under the BMA?",
        "response": "The BSCR applies a standard measurement format to assess the risk associated with a Bermuda insurer's assets, liabilities, and premiums. It employs a mathematical model that correlates the risk underwritten to their capital. Bermuda insurers use the BSCR to calculate their solvency requirements, and it forms part of the statutory Economic Balance Sheet framework.",
        "source": "finqa"
    },
    {
        "query": "How much did the company return to shareholders through share repurchases and dividend payments in 2022?",
        "response": "The company returned $1.7 billion to shareholders through share repurchases and dividend payments in 2022.",
        "source": "finqa"
    },
    {
        "query": "What methodology is primarily used for testing goodwill impairment at the company annually?",
        "response": "The company primarily uses a discounted cash flow methodology.",
        "source": "finqa"
    },
    {
        "query": "What type of insurance does GSBE provide through its voluntary deposit protection program?",
        "response": "GSBE provides additional insurance for certain eligible deposits beyond the statutory limitations through its voluntary deposit protection program.",
        "source": "finqa"
    },
    {
        "query": "How much did net income increase by from the previous year to fiscal 2023?",
        "response": "Net income increased by 32% from the previous year to fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What were the results of investment activities in Saudi Cinema Company LLC in 2023?",
        "response": "The investment activities resulted in a $15.5 million gain from the sale of the investment and a $6.6 million decline in the estimated fair value of common shares.",
        "source": "finqa"
    },
    {
        "query": "How did the auditors address the complexity in auditing Palantir Technologies Inc.'s revenue recognition practices?",
        "response": "The auditors addressed the complexity by obtaining an understanding, evaluating the design, and testing the operating effectiveness of the company's controls regarding terms and conditions and performance obligations that impact revenue recognition. They performed substantive procedures including testing completeness and accuracy of management’s identification and evaluation of non-standard terms and conditions, reading executed contracts, and evaluating the company’s application of its revenue recognition policy.",
        "source": "finqa"
    },
    {
        "query": "How did theme park segment revenue change from 2021 to 2023, and what were the factors influencing this change?",
        "response": "There was an increase from $5,051 million in 2021 to $8,947 million in 2023, influenced by improved operating conditions and increased attendance at international and domestic parks.",
        "source": "finqa"
    },
    {
        "query": "How much did net premiums written increase in 2023?",
        "response": "Net premiums written increased by $75 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "How much did Johnson & Johnson invest in research and development in 2023?",
        "response": "$15.1 billion",
        "source": "finqa"
    },
    {
        "query": "Under which item are the Financial Statements and Supplementary Data listed in the report?",
        "response": "They are listed under 'Item 15. Exhibits and Financial Statement Schedules'.",
        "source": "finqa"
    },
    {
        "query": "Where can more detailed information about the legal proceedings be found?",
        "response": "More detailed information about the legal proceedings can be found in Note 21, included in Item 8 of Part II of this report.",
        "source": "finqa"
    },
    {
        "query": "Who is the chief executive officer of Starbucks as of March 2023 and what was his previous position?",
        "response": "Laxman Narasimhan, who joined Starbucks as chief executive officer-elect in 2022, has served as CEO since March 2023. Prior to this, he was CEO of Reckitt Benckiser Group Plc.",
        "source": "finqa"
    },
    {
        "query": "How much did the revenue for the U.S. dialysis business increase from 2022 to 2023?",
        "response": "$337 million",
        "source": "finqa"
    },
    {
        "query": "How much net cash was used in financing activities in 2023?",
        "response": "In 2023, approximately $516.8 million of net cash was used in financing activities.",
        "source": "finqa"
    },
    {
        "query": "What was the total dollar value of outstanding commercial real estate loans at the end of 2023?",
        "response": "$72.878 billion",
        "source": "finqa"
    },
    {
        "query": "How are equity investments without readily determinable fair values accounted for under the measurement alternative?",
        "response": "Equity investments without readily determinable fair values are measured at cost minus any impairment, with adjustments for changes based on observable price changes in orderly transactions for the identical or a similar investment of the same issuer.",
        "source": "finqa"
    },
    {
        "query": "How is impairment evaluated for long-lived assets such as leases, property, and equipment?",
        "response": "Impairment is evaluated by comparing the carrying amounts of the assets to the future undiscounted cash flows expected to be generated by them.",
        "source": "finqa"
    },
    {
        "query": "What sections of IBM's 2023 Annual Report are incorporated into Item 8 of the Form 10-K?",
        "response": "Pages 44 through 121 are incorporated into Item 8 of the Form 10-K.",
        "source": "finqa"
    },
    {
        "query": "What are the three primary objectives of a company's internal control over financial reporting as described?",
        "response": "The three primary objectives are: 1) ensuring that transactions and asset dispositions are accurately and fairly reflected in detail, 2) providing reasonable assurance that transactions are recorded as necessary for the preparation of financial statements in accordance with generally accepted accounting principles and that expenditures are made only with management and directors' authorization, and 3) providing reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could materially affect the financial statements.",
        "source": "finqa"
    },
    {
        "query": "How is the fair value of U.S. wireless licenses assessed?",
        "response": "The fair value of U.S. wireless licenses is assessed using a discounted cash flow model known as the Greenfield Approach and a qualitative corroborative market approach based on auction prices.",
        "source": "finqa"
    },
    {
        "query": "How are leases recorded on the consolidated balance sheet for terms over one year?",
        "response": "Leases with a term over one year are recognized as right-of-use (ROU) assets and lease obligations, with long-term obligations included if applicable.",
        "source": "finqa"
    },
    {
        "query": "What is the primary basis for the preparation of the discussed company's consolidated financial statements?",
        "response": "The primary basis for the preparation of the discussed company's consolidated financial statements is accounting principles generally accepted in the United States (U.S. GAAP).",
        "source": "finqa"
    },
    {
        "query": "How does JPMorgan Chase ensure that its compensation practices align with its Business Principles and culture?",
        "response": "JPMorgan Chase’s compensation philosophy includes pay-for-performance practices, aligns with shareholder interests, and reinforces the Firm's culture and Business Principles through a balanced and integrated consideration of risk, controls, and conduct.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did AbbVie's Skyrizi net revenues increase in 2023?",
        "response": "51%",
        "source": "finqa"
    },
    {
        "query": "What was reported as the percentage revenue increase for the Asia Pacific & Latin America segment of NIKE from fiscal 2022 to fiscal 2023?",
        "response": "The revenue increase for the Asia Pacific & Latin America segment of NIKE from fiscal 2022 to fiscal 2023 was 8% excluding currency changes.",
        "source": "finqa"
    },
    {
        "query": "What was the total number of common stock shares repurchased by FedEx in 2023?",
        "response": "9.2 million shares",
        "source": "finqa"
    },
    {
        "query": "When is Chevron's concession for operating Saudi Arabia's interest in the hydrocarbon resources in the Partitioned Zone due to expire?",
        "response": "2046",
        "source": "finqa"
    },
    {
        "query": "What accounting methods are utilized by Schwab when it does not have a controlling financial interest in an entity?",
        "response": "When Schwab does not have a controlling financial interest in an entity, it accounts for its investments under the equity method of accounting if it has the ability to exercise significant influence over the entity's operating and financing decisions. Otherwise, investments are generally carried at cost, adjusted for impairment and observable price changes of identical or similar investments of the same issuer, except for investments in qualified affordable housing projects which are accounted for using the proportional amortization method.",
        "source": "finqa"
    },
    {
        "query": "What percentage of global electricity usage does NVIDIA aim to match with renewable energy by the end of fiscal year 2025?",
        "response": "By the end of fiscal year 2025, NVIDIA aims to match 100% of its global electricity usage with renewable energy.",
        "source": "finqa"
    },
    {
        "query": "What measures is the company taking to address supply chain disruptions?",
        "response": "The company is working to minimize supply chain challenges to meet customer demand and continues to assess the environment for any additional necessary actions.",
        "source": "finqa"
    },
    {
        "query": "What decision did the Ninth Circuit make regarding Slack's case on September 20, 2021?",
        "response": "The Ninth Circuit affirmed the district court’s ruling.",
        "source": "finqa"
    },
    {
        "query": "What factors influenced the company's effective tax rate in 2023?",
        "response": "The effective tax rate in 2023 was influenced by excess tax benefits recognized from share-based compensation, additional guidance from the IRS providing relief on foreign tax credits, and a decrease in U.S. tax benefits from foreign-derived intangible income. Additionally, further clarifications on research and development expenses subject to mandatory capitalization and amortization affected the rate.",
        "source": "finqa"
    },
    {
        "query": "How did Hasbro's net revenues in 2023 compare to the previous year?",
        "response": "In 2023, Hasbro's net revenues were $5,003.3 million, a 15% decrease from $5,856.7 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What new capabilities is lululemon integrating in their retail locations to enhance omni-channel experience?",
        "response": "Lululemon is integrating capabilities such as buying online and picking up in-store, shipping products from store, and shared inventory pools across distribution centers and retail locations.",
        "source": "finqa"
    },
    {
        "query": "When was the European Union and the three additional EEA countries designated as a \"qualifying state\" under the E.O. by the U.S. Attorney General?",
        "response": "On June 30, 2023, the European Union and the three additional countries making up the EEA were designated as a \"qualifying state\" under Section 3(f) of the E.O. by the U.S. Attorney General.",
        "source": "finqa"
    },
    {
        "query": "How does IBM's service and product offerings in the tech sector stand out from competitors?",
        "response": "IBM offers a unique blend of software and consulting services that are distinguished by innovation, global reach, deep industry expertise, and a robust research foundation.",
        "source": "finqa"
    },
    {
        "query": "What was the total enterprise operating cash flow for 2023?",
        "response": "$12.9 billion",
        "source": "finqa"
    },
    {
        "query": "Where can information regarding certain legal proceedings with contingencies be found?",
        "response": "Information regarding certain legal proceedings with contingencies can be found in Note 13 to the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What are the typical higher sales quarters for companies due to seasonal and holiday-related sales patterns?",
        "response": "The third and fourth quarters of the year.",
        "source": "finqa"
    },
    {
        "query": "What are the two main approaches used to measure the fair value of reporting units in a quantitative goodwill impairment assessment?",
        "response": "The two main approaches used to measure the fair value of reporting units in a quantitative goodwill impairment assessment are the income approach, specifically using discounted cash flows, and the market approach, particularly using market multiples.",
        "source": "finqa"
    },
    {
        "query": "What type of information does Item 15(a) contain in the Annual Report?",
        "response": "Item 15(a) contains the Financial Statements and Supplementary Data required by Item 8.",
        "source": "finqa"
    },
    {
        "query": "What impact did the Writers Guild and SAG work stoppages have on Comcast's content licensing revenue in 2023?",
        "response": "The Writers Guild and SAG work stoppages in 2023 partially offset the decrease in Comcast's content licensing revenue.",
        "source": "finqa"
    },
    {
        "query": "What was the total deferred income tax asset as of December 31, 2023?",
        "response": "$1,157,486",
        "source": "finqa"
    },
    {
        "query": "What is the largest source of revenue for the payments company and how is it determined?",
        "response": "The largest source of revenue for the company is discount revenue, which is determined by fees charged for accepting the company's cards as payment, varying by factors such as the merchant's industry, transaction volume, and payment method.",
        "source": "finqa"
    },
    {
        "query": "Where can one find commitments and contingencies related to legal proceedings in the context provided?",
        "response": "In Part II, Item 8, under 'Financial Statements and Supplementary Data – Note 14' of Commitments and Contingencies section",
        "source": "finqa"
    },
    {
        "query": "What types of hybrid vehicles are offered by several manufacturers?",
        "response": "Several manufacturers offer hybrid vehicles, including plug-in versions.",
        "source": "finqa"
    },
    {
        "query": "What impact could litigation related to our operations have?",
        "response": "The ultimate disposition of litigation related to our operations could have a material adverse effect on our operations, financial EBITDA, or cash flows.",
        "source": "finqa"
    },
    {
        "query": "What amount was reported for cash paid for income taxes, net in the fiscal year 2023?",
        "response": "$3,433",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of cash being swept off-balance sheet in the 2023 IDA agreement?",
        "response": "To deposit accounts at the TD Depository Institutions",
        "source": "finqa"
    },
    {
        "query": "What was the percentage decrease in research and development expenses for the fiscal year ended June 30, 2023 compared to the prior year?",
        "response": "The research and development expenses decreased by 11.4% in the fiscal year ended June 30, 2023 compared to the previous year.",
        "source": "finqa"
    },
    {
        "query": "What were the total unrealized losses on U.S. Treasury securities as of the last reporting date?",
        "response": "$134 million",
        "source": "finqa"
    },
    {
        "query": "What roles did David A. Zapolsky occupy at the company before being appointed Senior Vice President, Global Public Policy and General Counsel in May 2023?",
        "response": "Vice President and Associate General Counsel for Litigation and Regulatory matters from April 2002 until September 2012 and various General Counsel roles until May 2023",
        "source": "finqa"
    },
    {
        "query": "How many network tokens did Visa provision by the end of fiscal year 2023?",
        "response": "More than 7.5 billion network tokens",
        "source": "finqa"
    },
    {
        "query": "What legal regulations must the company comply with in their operations?",
        "response": "The company must comply with regulations including the Federal Food, Drug, and Cosmetic Act, Federal Trade Commission Act, Lanham Act, various consumer protection and competition laws, as well as environmental, employment, privacy, and data protection laws.",
        "source": "finqa"
    },
    {
        "query": "What is the adjusted operating income for the year when the operating income was reported as $529?",
        "response": "The adjusted operating income for the year when the operating income was $529 was $709.",
        "source": "finqa"
    },
    {
        "query": "What are some factors that lead to a reduction in net product prices for a company?",
        "response": "Pressures from private insurers and government payers often lead to a reduction in net product prices.",
        "source": "finqa"
    },
    {
        "query": "What financial documents and data does Item 8 encompass in Etsy, Inc.'s filings?",
        "response": "Item 8 encompasses Etsy, Inc.'s financial statements and supplementary data, which include the consolidated balance sheets, consolidated statements of operations, consolidated statements of comprehensive income (loss), consolidated statements of changes in stockholders' equity (deficit), and consolidated statements of cash flows.",
        "source": "finqa"
    },
    {
        "query": "How was the cash portion of the VMware acquisition funded?",
        "response": "The cash portion of the VMware Merger consideration was funded with net proceeds from the issuance of $30.4 billion in term loans under a credit agreement entered into on August 15, 2023, along with cash on hand.",
        "source": "finqa"
    },
    {
        "query": "What types of games and services does Electronic Arts develop and distribute?",
        "response": "Electronic Arts develops and distributes games and services across diverse genres including sports, racing, first-person shooter, action, role-playing, and simulation. They also offer live services and create content that can be experienced on various platforms like game consoles, PCs, mobile phones, and tablets.",
        "source": "finqa"
    },
    {
        "query": "As of October 31, 2023, what was the goodwill amount for the HPC & AI reporting unit?",
        "response": "$2.9 billion",
        "source": "finqa"
    },
    {
        "query": "What are the criminal penalties for obtaining and disclosing PHI with intent to sell or use maliciously as outlined by HIPAA?",
        "response": "Criminal penalties can reach up to $250,000 and ten years in prison for obtaining and disclosing PHI with the intent to sell, transfer or use such information for commercial advantage, personal gain or malicious harm.",
        "source": "finqa"
    },
    {
        "query": "How much did Eli Lilly and Company's net cash from financing activities increase or decrease from the previous year?",
        "response": "Net cash from financing activities decreased by $8,902.3 million from the previous year.",
        "source": "finqa"
    },
    {
        "query": "What are the main competitive factors for the company's products?",
        "response": "The main factors that determine the competitiveness of the company's products include total cost of ownership, timely product introductions, product quality, product features and capabilities, reliability, performance, size, selling price, adherence to industry standards, level of integration, software and hardware compatibility, ease of use, security, brand recognition, and availability.",
        "source": "finqa"
    },
    {
        "query": "What was the net loss for the year ended December 31, 2023?",
        "response": "$396.6 million",
        "source": "finqa"
    },
    {
        "query": "How does the company view its free shipping offers in terms of marketing strategy?",
        "response": "The company views its free shipping offers as effective worldwide marketing tools, which are intended to continue being offered indefinitely to attract and retain customers.",
        "source": "finqa"
    },
    {
        "query": "How could extended disruptions at Garmin's suppliers affect its business?",
        "response": "Extended disruptions could impact Garmin's ability to meet customer demand due to component shortages or increased lead times, or cause Garmin to incur higher product costs.",
        "source": "finqa"
    },
    {
        "query": "How much was Costco's interest expense for the 53 weeks ended September 3, 2023?",
        "response": "Costco's interest expense for the 53 weeks ended September 3, 2023 was $160 million.",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the decrease in automotive leasing revenue in 2023?",
        "response": "The decrease in automotive leasing revenue in 2023 was primarily due to a decrease in direct sales-type leasing revenue driven by lower deliveries year over year.",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in the report primarily discuss?",
        "response": "Item 8 primarily discusses the Report of Independent Registered Public Accounting Firm, Financial Statements, Notes to the Financial Statements, and the Financial Statement Schedule that are part of the report.",
        "source": "finqa"
    },
    {
        "query": "What was the main driver behind the increase in the provision for credit losses at Bank of America in 2023?",
        "response": "Consumer portfolio driven by credit card loan growth and asset quality",
        "source": "finqa"
    },
    {
        "query": "What were the key elements of the equity securities reclassification that took place in the third quarter of 2023?",
        "response": "In the third quarter of 2023, certain equity securities were reclassified from Other assets to Investment securities, following the completion of transactions where the issuers of these securities became public companies. The investments held a fair value of $24 million with a cost basis of $10 million as of December 31, 2023, and included net unrealized gains of $37 million that were recognized prior to the transactions.",
        "source": "finqa"
    },
    {
        "query": "What total volume of natural gas is Chevron contracted to deliver from its operations in Australia and Israel from 2024 through 2026?",
        "response": "2.9 trillion cubic feet",
        "source": "finqa"
    },
    {
        "query": "What model does the Bank of America use to estimate the expected credit losses (ECL) for consumer loans secured by residential real estate?",
        "response": "The Bank of America uses quantitative modeling methodologies to estimate the ECL for consumer loans secured by residential real estate. This involves estimating the number of loans that will default over the life of the existing portfolio, factoring in estimated prepayment, using attributes such as refreshed loan-to-value ratio, borrower credit score, months since origination, and geography.",
        "source": "finqa"
    },
    {
        "query": "What amount of valuation allowance was released by the company in 2023?",
        "response": "The company released $2.9 billion of its valuation allowance in 2023.",
        "source": "finqa"
    },
    {
        "query": "What does Google's new model 'Gemini' aim to achieve?",
        "response": "Gemini aims to generalize and seamlessly understand, operate across, and combine different types of information, including text, code, audio, images, and video.",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in the Annual Report on Form 10-K include?",
        "response": "Financial statements and supplementary data.",
        "source": "finqa"
    },
    {
        "query": "How does customer size and geography affect the determination of SSP for products and services?",
        "response": "SSP varies for individual products and services due to the stratification by customer size and geography, resulting in more than one SSP for each.",
        "source": "finqa"
    },
    {
        "query": "What is the main business focus of Johnson & Johnson?",
        "response": "Products related to human health and well-being",
        "source": "finqa"
    },
    {
        "query": "Where in the Annual Report on Form 10-K can the consolidated financial statements and accompanying notes be found?",
        "response": "In Part IV, Item 15(a)(1)",
        "source": "finqa"
    },
    {
        "query": "What is the total number of rooms in the hotels managed by Hilton as of the end of 2023?",
        "response": "250,472 rooms",
        "source": "finqa"
    },
    {
        "query": "What is the primary function of long-term funding management at Goldman Sachs as outlined in their 2023 reporting?",
        "response": "The primary function of long-term funding management at Goldman Sachs includes ensuring sufficient liquidity to meet long-term financing requirements by using various strategies, including managing secured and unsecured borrowings, assessing total unsecured long-term borrowings, and equity levels reviewed by the Firmwide Asset Liability Committee.",
        "source": "finqa"
    },
    {
        "query": "How much did noninterest income from investment banking fees change from 2022 to 2023 in Bank of America's Global Banking segment?",
        "response": "decreased by 6%",
        "source": "finqa"
    },
    {
        "query": "What accounting firm conducted the audit on Equifax Inc.'s internal control over financial reporting and consolidated financial statements as of December 31, 2023?",
        "response": "Ernst & Young LLP",
        "source": "finqa"
    },
    {
        "query": "What financial obligations does the company have under executed agreements related to manufacturing capacity?",
        "response": "The company could be required to pay up to approximately $10 billion if it does not purchase specified amounts of goods or services over the durations of the agreements.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Item 8 in the financial document?",
        "response": "Item 8 provides the financial statements and supplementary data.",
        "source": "finqa"
    },
    {
        "query": "How much did Johnson & Johnson's net earnings increase from 2022 to 2023?",
        "response": "$35,153 million in 2023 compared to $17,941 million in 2022",
        "source": "finqa"
    },
    {
        "query": "What was the amount of Broadcom Inc.'s cash and cash equivalents as of October 29, 2023?",
        "response": "$14,189 million",
        "source": "finqa"
    },
    {
        "query": "What was the net loss reported in the other gains and losses section for fiscal 2023 and how did it mainly occur?",
        "response": "The net loss reported in the other gains and losses section for fiscal 2023 was $1.5 billion, primarily consisting of net losses associated with the fair value changes of equity and other investments, a gain recognized on the sale of an equity method investment in Brazil, and a dividend from an investment.",
        "source": "finqa"
    },
    {
        "query": "Are assessments of potential losses from legal matters considered predictable?",
        "response": "No, assessments of losses are inherently subjective and involve unpredictable factors.",
        "source": "finqa"
    },
    {
        "query": "What operational changes occurred at ICE post-acquisition of Black Knight in 2023?",
        "response": "Post-acquisition of Black Knight in 2023, ICE sold Black Knight’s Optimal Blue and Empower loan origination system businesses to subsidiaries of Constellation Software, Inc.",
        "source": "finqa"
    },
    {
        "query": "What was the total stockholders' equity for Enphase Energy, Inc. at the end of 2023?",
        "response": "$983,624",
        "source": "finqa"
    },
    {
        "query": "What could affect the Company’s financial condition and operating results?",
        "response": "Resolution of legal matters in a manner inconsistent with management’s expectations could affect the Company’s financial condition and operating results.",
        "source": "finqa"
    },
    {
        "query": "What factors are considered in selecting an appropriate discount rate for goodwill impairment evaluation?",
        "response": "The selection of an appropriate discount rate is based on a weighted-average cost of capital analysis that reflects current market conditions and is adjusted for specific reporting unit risks.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did food and beverage revenue increase during the year ended December 31, 2023?",
        "response": "25.0%",
        "source": "finqa"
    },
    {
        "query": "How has Peloton adapted its manufacturing strategy as of July 2022?",
        "response": "As of July 2022, Peloton shifted from in-house manufacturing to utilizing third-party manufacturing partners for all of its products.",
        "source": "finqa"
    },
    {
        "query": "How much cash was acquired through acquisitions in 2023?",
        "response": "$283.8 million of cash was acquired in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the free cash flow for fiscal 2023 and how was it calculated?",
        "response": "The free cash flow for fiscal 2023 was $11.984 billion, calculated as net cash provided by operating activities ($28.841 billion) minus payments for property and equipment ($16.857 billion).",
        "source": "finqa"
    },
    {
        "query": "How did the net premiums written for the Europe, Middle East, and Africa region change from 2021 to 2023?",
        "response": "The net premiums written for this region increased from $5,242 million in 2021 to $5,713 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the change in total cash, cash equivalents, and restricted cash from the beginning to the end of the year?",
        "response": "$177,197 increase",
        "source": "finqa"
    },
    {
        "query": "What is the title of Item 8 in the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "Where in the 2023 Annual Report can IBM’s Management’s Discussion and Analysis be found?",
        "response": "Pages 6 through 40",
        "source": "finqa"
    },
    {
        "query": "How does NVIDIA's platform strategy contribute to the markets it serves?",
        "response": "NVIDIA's platform strategy brings together hardware, systems, software, algorithms, libraries, and services to create unique value.",
        "source": "finqa"
    },
    {
        "query": "What are the main focus areas of FedEx Dataworks?",
        "response": "FedEx Dataworks focuses on enhancing the efficiency of FedEx's network and our customers’ supply chains, facilitating a collaborative e-commerce ecosystem, and leveraging data for predictive anomaly detection and dynamic pricing infrastructure.",
        "source": "finqa"
    },
    {
        "query": "What specific regulatory bodies oversee the U.S. futures exchange, ICE Futures U.S.?",
        "response": "The U.S. futures exchange, ICE Futures U.S., is regulated by the Commodity Futures Trading Commission (CFTC) under the Commodity Exchange Act.",
        "source": "finqa"
    },
    {
        "query": "What does Delta Air Lines' commercial arrangement with China Eastern entail?",
        "response": "Delta Air Lines' commercial arrangement with China Eastern involves reciprocal codesharing, loyalty program participation, mutual lounge access, and joint sales cooperation, covering traffic flows between China and the U.S.",
        "source": "finqa"
    },
    {
        "query": "How did the operating expenses as a percentage of net sales benefit during the fiscal period after the classification of operations in the U.K. and Japan as held for sale?",
        "response": "Operating expenses as a percentage of net sales benefited from the lack of depreciation and amortization expenses being recorded for operations in the U.K. and Japan after they were classified as held for sale.",
        "source": "finqa"
    },
    {
        "query": "What is the three-pillared growth strategy of the Small Business & Self-Employed segment as outlined?",
        "response": "The three-pillared growth strategy consists of Grow the Core, Connect the Ecosystem, and Expand Globally.",
        "source": "finqa"
    },
    {
        "query": "How much has been paid in transition tax for fiscal year 2023 and what is the remaining amount due over the next three years?",
        "response": "For fiscal year 2023, $1.5 billion was paid in transition tax, with a remaining amount of $10.5 billion due over the next three years.",
        "source": "finqa"
    },
    {
        "query": "What is conducted on the first day of new hire orientation?",
        "response": "Anti-harassment training is conducted on the first day of new hire orientation.",
        "source": "finqa"
    },
    {
        "query": "How much did the special items impact the 2023 adjusted earnings before taxes?",
        "response": "$9,583 million",
        "source": "finqa"
    },
    {
        "query": "What is contribution margin and why is it an important business measure?",
        "response": "Contribution margin is defined as the revenue generated by a company less the cost of revenue and sales and marketing expenses, excluding stock-based compensation, divided by the revenue. It is an essential measure of business efficiency, helping to evaluate performance and formulating financial strategies.",
        "source": "finqa"
    },
    {
        "query": "How much undrawn revolving commitment was available under the 2014 Credit Facility as of December 31, 2023?",
        "response": "There was $500.0 million of undrawn revolving commitment available under the 2014 Credit Facility as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "During 2023, what percentage of the Company’s net sales came from direct sales channels?",
        "response": "During 2023, 37% of the Company's net sales came from direct sales channels.",
        "source": "finqa"
    },
    {
        "query": "What are the key benefits offered by American Express to its Card Members through cobrand arrangements like with Delta Air Lines?",
        "response": "American Express offers various benefits to its Card Members through cobrand arrangements such as with Delta Air Lines, including travel-related benefits like airport lounge access, and the ability to earn and redeem points for spending on Delta cobrand cards.",
        "source": "finqa"
    },
    {
        "query": "What was the accrued legal liability balance as of December 31, 2023?",
        "response": "$7,640",
        "source": "finqa"
    },
    {
        "query": "What types of products are included in Goldman Sachs' derivatives and how are they categorized in their financial reports?",
        "response": "Goldman Sachs includes futures and forwards, swaps, and options in their derivatives. These are categorized and accounted for in their financial reports based on whether they are exchange-traded, OTC-cleared, or bilateral OTC contracts.",
        "source": "finqa"
    },
    {
        "query": "How much net income did Hilton Worldwide Holdings Inc. report for the year ending December 31, 2023?",
        "response": "$1,141 million",
        "source": "finqa"
    },
    {
        "query": "What is Walmart's EDLP strategy?",
        "response": "EDLP, or Everyday Low Prices, is Walmart's pricing philosophy where items are priced low every day to build customer trust and avoid frequent promotional changes.",
        "source": "finqa"
    },
    {
        "query": "What was the total balance of Level 3 pension assets including equities, fixed income funds, and real estate and real assets as of December 31, 2023?",
        "response": "$2,957 million",
        "source": "finqa"
    },
    {
        "query": "What factors could cause fluctuations in the company's capital expenditures?",
        "response": "Fluctuations in the company's capital expenditures could be caused by the specific pace of capital-intensive projects and variables such as rising material prices, increases in supply chain costs, and labor expenses due to changes in global trade conditions and labor availability.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in sales from 2022 to 2023 for the Trauma segment in the U.S.?",
        "response": "3.6%",
        "source": "finqa"
    },
    {
        "query": "What factors contributed to the increase in net investment income in 2023?",
        "response": "The increase in net investment income in 2023 was primarily due to higher reinvestment rates on fixed maturities and the consolidation of Huatai Group.",
        "source": "finqa"
    },
    {
        "query": "Where is the Investor Relations office of Intuit Inc. located?",
        "response": "The Investor Relations office of Intuit Inc. is located at P.O. Box 7850, Mountain View, California 94039-7850.",
        "source": "finqa"
    },
    {
        "query": "What were the main uses of cash in financing activities for fiscal 2023?",
        "response": "The main uses of cash in financing activities for fiscal 2023 included funding for share repurchases and dividend payments.",
        "source": "finqa"
    },
    {
        "query": "What type of financial documents are included in Part IV, Item 15(a)(1) of the Annual Report on Form 10-K?",
        "response": "The consolidated financial statements and accompanying notes are included.",
        "source": "finqa"
    },
    {
        "query": "What was the net amount of leasehold improvements, property, and equipment as of December 31, 2023?",
        "response": "The net amount of leasehold improvements, property, and equipment as of December 31, 2023 was $2,170,038.",
        "source": "finqa"
    },
    {
        "query": "What criteria must investments meet for Palantir Technologies Inc. to classify them as cash equivalents?",
        "response": "Investments must have an original maturity of three months or less at the time of purchase to be classified as cash equivalents by Palantir Technologies Inc.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Operations and Support expenses in 2023 compared to the previous year?",
        "response": "Operations and Support expenses increased by 14% in 2023 compared to 2022.",
        "source": "finqa"
    },
    {
        "query": "What online platforms does The Home Depot operate for its product offerings?",
        "response": "homedepot.com, homedepot.ca, homedepot.com.mx, hdsupply.com, blinds.com, and thecompanystore.com",
        "source": "finqa"
    },
    {
        "query": "What was the weighted average interest rate on the company's debt as of October 31, 2023?",
        "response": "5.4%",
        "source": "finqa"
    },
    {
        "query": "How does Marmon's Water Technologies business group operate and where are its main operations based?",
        "response": "Marmon's Water Technologies manufactures water treatment equipment for residential, commercial, and industrial applications worldwide. Its main operations are based primarily in the U.S., Canada, China, Singapore, India, and Poland.",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of time in hours that colleagues invested in learning and development courses during the year ended December 31, 2023?",
        "response": "14 million hours",
        "source": "finqa"
    },
    {
        "query": "How is asset securitization conducted as per the provided description?",
        "response": "Asset securitization involves transferring and selling loans or receivables to a special-purpose entity, typically a trust, which issues securities secured by the transferred loans or receivables. The trust uses the proceeds from the securities sale to pay for the transferred loans or receivables.",
        "source": "finqa"
    },
    {
        "query": "What is the requirement regarding the FDIC's deposit insurance reserve ratio and its statutory minimum as of October 2022?",
        "response": "The FDIC is required to maintain a deposit insurance reserve ratio of at least 1.35%, and a final rule was adopted in October 2022 to raise bank assessments to meet this statutory minimum by September 30, 2028.",
        "source": "finqa"
    },
    {
        "query": "What were the reasons behind the reduction in net interest expense in fiscal 2022?",
        "response": "The reduction in net interest expense in fiscal 2022 was primarily due to refinancing of debt which included prepayment penalties and the acceleration of expensing amortizable non-cash deferred financing costs, along with higher interest income on investments offsetting interest expense on credit facility borrowings.",
        "source": "finqa"
    },
    {
        "query": "How much did AbbVie's gross margin percentage decrease in 2023 compared to 2022?",
        "response": "8%",
        "source": "finqa"
    },
    {
        "query": "What adjustments to the regular quarterly dividend on common shares did the company announce for the first quarter of 2024?",
        "response": "The company announced a 17 percent increase in the regular quarterly dividend on common shares, from 60 cents to 70 cents per share, beginning with the first quarter of 2024.",
        "source": "finqa"
    },
    {
        "query": "How much was the net cash provided by Coca-Cola's financing activities in 2023?",
        "response": "-$8,310 million",
        "source": "finqa"
    },
    {
        "query": "What are the market solutions offered by LinkedIn?",
        "response": "LinkedIn offers Market Solutions that aid companies in reaching, engaging, and converting their audiences at a large scale.",
        "source": "finqa"
    },
    {
        "query": "What does critical accounting policy mean as defined by the SEC?",
        "response": "A critical accounting policy, as defined by the SEC, refers to a policy that is crucial for presenting a company's financial condition and results of operations and requires the company to make difficult and subjective judgments.",
        "source": "finqa"
    },
    {
        "query": "What was the total notional amount of the Company's undesignated derivative instruments as of May 31, 2023?",
        "response": "The total notional amount of the Company's undesignated derivative instruments was $4.7 billion as of May 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What caused the decrease in the 2022 gross margin compared to 2021?",
        "response": "The decrease in the 2022 gross margin compared to 2021 was primarily due to a provision against hardware inventory, a decrease in product margin, increased costs related to product departments and distribution centers as a percentage of net revenue, and an unfavorable impact of foreign currency exchange rates.",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue for the year 2023?",
        "response": "$371,620 million",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the S&P 500 Index increase in 2023 compared to the end of 2022?",
        "response": "24%",
        "source": "finqa"
    },
    {
        "query": "When did Domingo J. Hurtado become Senior Vice President – International at AutoZone?",
        "response": "September 2018",
        "source": "finqa"
    },
    {
        "query": "What does Item 8 in the Annual Report refer to?",
        "response": "Item 8 refers to Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the total annual net trade sales did the sales returns reserve represent for the company during each of the fiscal years 2023, 2022, and 2021?",
        "response": "Less than 1.0%",
        "source": "finqa"
    },
    {
        "query": "What is the Common Equity Tier 1 (CET1) Capital?",
        "response": "CET1 Capital comprises common stock and related surplus net of treasury stock, retained earnings, AOCI, and qualifying minority interests, reduced by applicable regulatory adjustments and deductions.",
        "source": "finqa"
    },
    {
        "query": "How is revenue recognized in Enphase Energy, Inc.?",
        "response": "Enphase Energy, Inc. recognizes revenue when control of the promised goods or services is transferred to customers at a price that reflects the expected consideration for those goods or services.",
        "source": "finqa"
    },
    {
        "query": "What was the adjusted FIFO operating profit in 2022 and how did it compare to the previous year?",
        "response": "The adjusted FIFO operating profit in 2022 was $5.1 billion, an 18% increase from 2021.",
        "source": "finqa"
    },
    {
        "query": "What were the total net revenues for Goldman Sachs in 2023 compared to 2022, and what were the primary reasons for the difference?",
        "response": "The total net revenues for Goldman Sachs were $46.25 billion in 2023, which was 2% lower than in 2022. This decrease primarily resulted from lower net interest income and lower investment banking revenues, although it was partially offset by higher revenues in other principal transactions.",
        "source": "finqa"
    },
    {
        "query": "What was the financial impact of the impairment of goodwill and other assets related to the lululemon Studio business unit in 2022?",
        "response": "The impairment of goodwill and other long-lived assets related to the lululemon Studio business unit resulted in costs of $407,913 in thousands in 2022.",
        "source": "finqa"
    },
    {
        "query": "How much was the allowance for credit losses at the end of the first quarter of 2023?",
        "response": "$14,551 million",
        "source": "finqa"
    }
]