[
    {
        "query": "Why did interest expense increase in 2023, and what is expected for 2024?",
        "response": "Interest expense increased in 2023 mainly due to lower capitalized interest associated with spectrum acquisitions and higher interest rates. It is expected to increase further in 2024 due to the cessation of capitalization of interest for C-band spectrum licenses now in service.",
        "source": "finqa"
    },
    {
        "query": "What type of service is provided by Walmart in Mexico to enhance digital connectivity?",
        "response": "In Mexico, Walmart offers a value-based internet and telephone service to enhance digital connectivity.",
        "source": "finqa"
    },
    {
        "query": "How does the text describe the changes expected in the competitive environment of the company?",
        "response": "The text suggests that competition will increase due to existing competitors and new market entrants that may offer lower priced or better performing products with additional features.",
        "source": "finqa"
    },
    {
        "query": "How has Iron Mountain transitioned its business to adapt to changes in information storage?",
        "response": "Iron Mountain has shifted towards a hybrid of physical and digital media storage solutions to adapt to the increase in digital information by customers. The company focuses on growth in physical storage and complementary digital services.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the cost of sales as a percent of net revenues change from 2021 to 2023?",
        "response": "Increased from 30.0% to 34.1%",
        "source": "finqa"
    },
    {
        "query": "What is the PCAOB ID number for PricewaterhouseCoopers LLP as mentioned in their 2024 report?",
        "response": "The PCAOB ID number for PricewaterhouseCoopers LLP is 238.",
        "source": "finqa"
    },
    {
        "query": "What are the U.S. insurance coverage limits under the FDIC as per the Financial Reform Act?",
        "response": "Under the Financial Reform Act, the U.S. insurance coverage limits under the FDIC are $250,000 per depositor, per insured bank for each account ownership category.",
        "source": "finqa"
    },
    {
        "query": "What are the primary components of free cash flow considered in the assessment of liquidity in a financial evaluation?",
        "response": "The primary components of free cash flow considered in the assessment of liquidity include the timing impact between content payments and amortization, non-cash stock-based compensation expense, non-cash remeasurement gain or loss on euro-denominated debt, excess property and equipment purchases over depreciation, and other working capital differences.",
        "source": "finqa"
    },
    {
        "query": "What types of activities are lululemon's athletic apparels designed for?",
        "response": "Lululemon's athletic apparels are designed for activities such as yoga, running, training, and most other athletic activities.",
        "source": "finqa"
    },
    {
        "query": "What was the significant tax benefit recorded in 2023 for federal research and development credits?",
        "response": "In 2023, there was a tax benefit of approximately $600 million recorded for federal research and development credits associated with the 2022 fiscal year.",
        "source": "finqa"
    },
    {
        "query": "What accounting principle requires entities to maximize the use of observable inputs and minimize the use of unobservable inputs in measuring fair value?",
        "response": "Fair value measurement under applicable accounting standards",
        "source": "finqa"
    },
    {
        "query": "What are the maximum and minimum number of days that the notes under the commercial paper program may be issued?",
        "response": "The notes may vary in duration but may not exceed 397 days.",
        "source": "finqa"
    },
    {
        "query": "How does the company handle foreign currency risks related to various aspects of its operations?",
        "response": "The company handles foreign currency risks by not typically hedging against them, which means that exchange rate fluctuations directly affect their operating results as expressed in U.S. dollars.",
        "source": "finqa"
    },
    {
        "query": "What were the specific impairment charges related to the Company's definite-lived Power Rangers intangible asset during 2022?",
        "response": "In 2022, the Company recorded impairment charges totaling $281.0 million related to the partial impairment of the Company's definite-lived Power Rangers intangible asset.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of the total consideration transferred for the acquisition discussed, and how was it composed?",
        "response": "The fair value of the total consideration transferred for the acquisition was $212.1 million, composed of $211.3 million in net cash consideration and $0.8 million in non-cash consideration, which represented the portion of the replacement equity awards issued in connection with the acquisition that was associated with services rendered through the date of the acquisition.",
        "source": "finqa"
    },
    {
        "query": "What strategies does Google employ to support its advertising business?",
        "response": "Google supports its advertising business by continuously investing in performance and brand advertising, improving measurability of advertising effectiveness, stopping bad advertising practices, and protecting users.",
        "source": "finqa"
    },
    {
        "query": "What factors were attributed to the net unrealized losses on level 3 trading cash instrument assets for Goldman Sachs in 2022?",
        "response": "The net unrealized losses on level 3 trading cash instrument assets for 2022 were primarily driven by broad macroeconomic and geopolitical concerns affecting certain equity securities.",
        "source": "finqa"
    },
    {
        "query": "What does FCF stand for, and how is it calculated?",
        "response": "FCF stands for Free Cash Flow. It is calculated as cash flow from operations, excluding the impact of proceeds received from a one-time Itanium litigation judgment, less net capital expenditures, and adjusted for exchange rate fluctuations on cash, cash equivalents, and restricted cash.",
        "source": "finqa"
    },
    {
        "query": "What was the growth in cash, cash equivalents, and marketable securities at Enphase Energy, Inc. for the year ending December 31, 2023?",
        "response": "$82.2 million",
        "source": "finqa"
    },
    {
        "query": "How are development wells defined?",
        "response": "A development well is defined as a well drilled within the known area of a crude oil or natural gas reservoir to the depth of a stratigraphic horizon known to be productive.",
        "source": "finqa"
    },
    {
        "query": "What section of the Annual Report on Form 10-K provides information on legal proceedings involving the company?",
        "response": "Item 3. Legal Proceedings",
        "source": "finqa"
    },
    {
        "query": "How much did cash and cash equivalents increase from January 31, 2022 to January 31, 2023?",
        "response": "$1,971 million",
        "source": "finqa"
    },
    {
        "query": "What were the clinical trial results for Skyrizi in the Phase 3 maintenance study called COMMAND related to ulcerative colitis?",
        "response": "Skyrizi met the primary and key secondary endpoints.",
        "source": "finqa"
    },
    {
        "query": "How did the diluted earnings per common share attributable to Comcast Corporation shareholders change from 2021 to 2023?",
        "response": "It decreased from $3.04 in 2021 to $3.71 in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the primary focus of AutoZone's commercial sales program?",
        "response": "The commercial sales program provides comercial credit and prompt delivery of parts and other products to local, regional, and national repair garages, dealers, service stations, fleet owners, and other accounts.",
        "source": "finqa"
    },
    {
        "query": "What primarily constitutes general and administrative expenses?",
        "response": "General and administrative expenses primarily consist of employee compensation-related expenses for general corporate functions and costs associated with the use of facilities and equipment, including depreciation and amortization.",
        "source": "finqa"
    },
    {
        "query": "What are the critical accounting estimates significantly impacting financial statement presentation?",
        "response": "Critical accounting estimates include allowances for revenue adjustments, inventory valuation, and goodwill impairments.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by financing activities for the fiscal year ended June 30, 2023?",
        "response": "The net cash provided by financing activities for the fiscal year ended June 30, 2023 was $76.8 million.",
        "source": "finqa"
    },
    {
        "query": "Where can the consolidated financial statements and accompanying notes be found in the Annual Report on Form 10-K?",
        "response": "They are included immediately following Part IV and incorporated by reference therein.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the IBM Form 10-K for 2023?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What were the major factors contributing to the increased expenses excluding interest for Investor Services and Advisor Services in 2023?",
        "response": "The increase in expenses excluding interest for both Investor Services and Advisor Services in 2023 was driven by higher compensation and benefits expenses due to restructuring costs, higher average headcount to support TDA client account transitions, and annual merit increases, along with increased regulatory fees and assessments.",
        "source": "finqa"
    },
    {
        "query": "According to the text, what is the global market share and leadership position of Procter & Gamble in the retail hair care market?",
        "response": "Procter & Gamble is a global market leader in the retail hair care market with nearly 20% global market share.",
        "source": "finqa"
    },
    {
        "query": "What items are filed under Item 15 of the report?",
        "response": "The items filed under Item 15 of the report include the Report of Independent Registered Public Accounting Firm, Financial Statements, Notes to the Financial Statements, and the Financial Statement Schedule.",
        "source": "finqa"
    },
    {
        "query": "What are the components of total derivative assets/liabilities and how are they impacted by financial instruments collateral?",
        "response": "Total derivative assets/liabilities initially amount to $39.3 million, which is then reduced to $23.8 million after accounting for $15.5 million in financial instruments collateral. This collateral includes securities collateral received or pledged, as well as cash securities held and posted at third-party custodians, which are used to derive the net derivative assets and liabilities.",
        "source": "finqa"
    },
    {
        "query": "How does reclassifying Financial Products' payables to accrued expenses or customer advances affect the financial statements?",
        "response": "Reclassifying Financial Products' payables into accrued expenses or customer advances repositions liabilities to better reflect their nature and timing, thus providing a more precise financial representation.",
        "source": "finqa"
    },
    {
        "query": "What led to the increase in general and administrative expenses in fiscal year 2023?",
        "response": "The increase in general and administrative expenses in fiscal year 2023 was primarily due to higher personnel and related expenses.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of FedEx's DRIVE program?",
        "response": "The purpose of the DRIVE program is to improve long-term profitability through initiatives like Network 2.0, aimed at enhancing the efficiency of FedEx's package pickup, transport, and delivery operations in the U.S. and Canada.",
        "source": "finqa"
    },
    {
        "query": "How does HP determine whether goodwill impairment exists?",
        "response": "HP first performs a qualitative assessment to determine if the fair value of a reporting unit is likely less than its carrying amount; if impairment is likely, a quantitative assessment is then performed.",
        "source": "finqa"
    },
    {
        "query": "What were the significant contributors to the gross margin contraction and by how many basis points did it contract?",
        "response": "The gross margin contracted by 310 basis maintenance points primarily due to higher product costs, reflecting increased input costs and inbound freight and logistics costs, along with a product mix and lower margins in NIKE Direct due to higher promotional activity and a lower mix of full-price sales.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Z-net in AutoZone stores?",
        "response": "Z-net is AutoZone's proprietary electronic catalog that allows AutoZoners to efficiently look up necessary parts for customers and provide complete job solutions, advice, and information based on the year, make, model, and engine type of a vehicle. It also tracks inventory availability within the store, at nearby stores, and through special orders.",
        "source": "finqa"
    },
    {
        "query": "From which sources does Apple obtain certain essential components?",
        "response": "Apple obtains certain essential components from single or limited sources.",
        "source": "finqa"
    },
    {
        "query": "How is information about legal proceedings incorporated in Item 3 of a Form 10-K?",
        "response": "Information is incorporated by reference from the Notes to the Consolidated Financial Statements found in Part II, Item 8, specifically Note 16.",
        "source": "finqa"
    },
    {
        "query": "What strategic initiative did The Hershey Company complete in 2023 to enhance its operational effectiveness?",
        "response": "In 2023, The Hershey Company completed the International Optimization Program, aimed at enhancing operational effectiveness, reducing costs, and generating savings for reinvestment.",
        "source": "finqa"
    },
    {
        "query": "What is the projected impact on the entity's net earnings from a 10% increase in foreign exchange rates?",
        "response": "A 10% increase in foreign exchange rates could increase the entity's net earnings by $27 million.",
        "source": "finqa"
    },
    {
        "query": "Where can the Financial Statement Schedule be found in the Form 10-K for IBM?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Microsoft's newly launched AI Skills Initiative?",
        "response": "The AI Skills Initiative is designed to help people learn how to effectively utilize artificial intelligence.",
        "source": "finqa"
    },
    {
        "query": "How did the other comprehensive income (loss), net of income taxes, for Walmart change between 2021 and 2023?",
        "response": "The other comprehensive income (loss) attributable to Walmart was $1,039 million in 2021, $3,000 million in 2022, and a loss of $1,652 million in 2023.",
        "source": "finqa"
    },
    {
        "query": "What are some of the key risks and uncertainties facing forward-looking statements mentioned in the report?",
        "response": "The risks and uncertainties include managing global financial risks such as foreign currency fluctuations, managing economic volatility, disruptions in business operations from various factors like natural disasters or terrorism, cost fluctuations including commodity prices, competing with local and global competitors, maintaining key customer relationships, and legal and regulatory requirements among others.",
        "source": "finqa"
    },
    {
        "query": "What was the adjusted Tier 1 Leverage Ratio for CSC consolidated as of December 31, 2023?",
        "response": "4.9%",
        "source": "finqa"
    },
    {
        "query": "What were the projected future benefit payments for the Company's retirement plans in 2024 and 2025?",
        "response": "$1,481 million in 2024 and $1,473 million in 2025.",
        "source": "finqa"
    },
    {
        "query": "What are some leadership development programs offered by Chevron to promote diversity and inclusion?",
        "response": "Chevron offers the Global Women’s Leadership Development Program and Transformational Leadership for Multicultural Women, designed to foster discussion, promote professional growth, and enhance inclusivity.",
        "source": "finqa"
    },
    {
        "query": "Under which item are the exhibits and financial statement schedules listed in the report?",
        "response": "Item 15",
        "source": "finqa"
    },
    {
        "query": "How much cash was utilized for common stock repurchases in the year ended December 31, 2023?",
        "response": "$505 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in premiums revenue from 2022 to 2023?",
        "response": "15.5%",
        "source": "finqa"
    },
    {
        "query": "What financial statement item provides insight into the company's critical accounting estimates?",
        "response": "Item 8 of Part II, 'Financial Statements and Supplementary Data — Note 1 — Description of Business, Accounting Policies, and Supplemental Disclosures' provides insight into the company's critical accounting estimates.",
        "source": "finqa"
    },
    {
        "query": "What was the total value of Johnson & Johnson's current assets at the end of 2023?",
        "response": "$53,495 million",
        "source": "finqa"
    },
    {
        "query": "What was the operating income for fiscal year 2023?",
        "response": "$5,870.8 million",
        "source": "finqa"
    },
    {
        "query": "How were the fair values of the acquired businesses Signify Health and Oak Street Health used in assessing goodwill impairment in 2023?",
        "response": "The fair values of Signify Health and Oak Street Health were closely aligned with the carrying values of these businesses at the time of the 2023 goodwill impairment test, due to the acquisitions' proximity to the test date.",
        "source": "finqa"
    },
    {
        "query": "What were the respective net earnings per share for Palantir Technologies Inc. common stockholders in the years 2023, 2022, and 2021?",
        "response": "The net earnings per share for Palantir Technologies Inc. common stockholders were $0.10 in 2023, -$0.18 in 2022, and -$0.27 in 2021.",
        "source": "finqa"
    },
    {
        "query": "What were the primary components included in the cost of automotive leasing revenue?",
        "response": "The cost of automotive leasing revenue includes the depreciation of operating lease vehicles, the cost of goods sold associated with direct sales-type leases, and warranty expense related to leased vehicles.",
        "source": "finqa"
    },
    {
        "query": "What previous roles did John J. Donahoe II hold before becoming President and CEO of NIKE, Inc.?",
        "response": "Before becoming President and CEO of NIKE, Inc., John J. Donahoe II served as President and CEO of ServiceNow, Inc. and of eBay, Inc. He also held leadership roles at Bain & Company for two decades.",
        "source": "finqa"
    },
    {
        "query": "What were the main factors contributing to the increase in net income in 2023?",
        "response": "The main factors contributing to the increase in net income in 2023 were an increase in gross profit of $1.1 billion, an increase in other income (expense), net of $38.9 million, and lower impairment and restructuring charges compared to the previous year, partially offset by an increase in selling, general and administrative expenses, higher income tax expense, and a gain on disposal of assets in the previous year.",
        "source": "finqa"
    },
    {
        "query": "What non-GAAP financial measures does the company provide, and why?",
        "response": "The company provides constant dollar changes and adjusted financial results as non-GAAP financial measures. They supply this information to enable the evaluation of the underlying trend in operating performance and facilitate comparisons to historical financial information.",
        "source": "finqa"
    },
    {
        "query": "What were the gross margin rates as a percentage of sales in 2022 and 2021?",
        "response": "In 2022, the gross margin rate was 21.43% and in 2021, it was 22.01%.",
        "source": "finqa"
    },
    {
        "query": "What is the expected market entry year for a biosimilar version of STELARA in the United States?",
        "response": "2025",
        "source": "finqa"
    },
    {
        "query": "What specific competitive advantages does IBM leverage in the hybrid cloud infrastructure market?",
        "response": "IBM leverages investments in high-value capabilities like security, scalability, and reliability, designed especially for mission-critical and regulated workloads, to differentiate from competitors in the hybrid cloud infrastructure market.",
        "source": "finqa"
    },
    {
        "query": "What are some expenses considered non-indicative of core operating results according to the reconciliations provided in the financial breakdown?",
        "response": "Expenses considered non-indicative of core operating results include Acquisition and Integration Costs, Restructuring and other transformation, (Gain) loss on disposal/write-down of property, plant and equipment, net, and Other expense (income), net.",
        "source": "finqa"
    },
    {
        "query": "What was the revenue for the Innovative Medicine segment in 2023?",
        "response": "$11,963 million",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Electronic Arts' diluted earnings per share in the fiscal year ended March 31, 2023?",
        "response": "4 percent",
        "source": "finqa"
    },
    {
        "query": "Which note in the report provides details about legal proceedings?",
        "response": "Note 20",
        "source": "finqa"
    },
    {
        "query": "What are some of the digital tools Walmart uses to improve associate productivity, engagement, and performance?",
        "response": "Me@Walmart, MyClub, and Me@Campus",
        "source": "finqa"
    },
    {
        "query": "What impact did the UAW strike in 2023 have on General Motors' financial results?",
        "response": "The UAW strike in 2023 resulted in an unfavorable impact of approximately $0.8 billion on Net income attributable to stockholders and $1.1 billion on GMNA EBIT-adjusted.",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of the 340B drug discount program established by the Veterans Health Care Act of 1992?",
        "response": "The 340B drug discount program requires pharmaceutical manufacturers to offer products at reduced prices to various designated health care entities and facilities.",
        "source": "finqa"
    },
    {
        "query": "What were the primary drivers of the increase in FS earnings from operations as a percentage of net revenue?",
        "response": "The decrease primarily resulted from an increase in cost of services as a percentage of net revenue.",
        "source": "finqa"
    },
    {
        "query": "How is revenue from Palantir Cloud subscriptions recognized over the term of the contract?",
        "response": "Revenue from Palantir Cloud subscriptions is generally recognized over the contract term on a ratable basis, consistent with the transfer of control of the Palantir Cloud services to the customer.",
        "source": "finqa"
    },
    {
        "query": "What are the expected financial impacts of GameStop's cost reduction efforts?",
        "response": "GameStop expects its cost reduction efforts to favorably impact its selling, general, and administrative expenses in future quarters as it pursues profitability.",
        "source": "finqa"
    },
    {
        "query": "What types of payments does Costco accept at its warehouses?",
        "response": "Costco accepts credit cards, debit cards, cash, checks, Executive member 2% reward certificates, co-brand cardholder rebates, and its proprietary stored-value card at its warehouses.",
        "source": "finqa"
    },
    {
        "query": "What is the impact of a 0.50% change in the weighted average discount rate on Delta's pension cost and accrued pension liability for 2023?",
        "response": "A 0.50% decrease in the discount rate would increase the pension cost by $5 million and the accrued pension liability by $742 million, while a 0.50% increase would decrease the pension cost by $1 million and the accrued pension liability by $685 million.",
        "source": "finqa"
    },
    {
        "query": "How much did Airbnb, Inc.'s accumulated deficit reduce by from 2022 to 2023?",
        "response": "Airbnb, Inc.'s accumulated deficit was reduced by $2,213 million from 2022 to 2023.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash equivalents and unrestricted marketable securities as of September 30, 2023?",
        "response": "$148.3 billion",
        "source": "finqa"
    },
    {
        "query": "When was Apollo offered as a commercial solution, and what is its primary function?",
        "response": "Apollo was offered as a commercial solution beginning in 2021, and its primary function is to serve as a cloud-agnostic, single control layer that coordinates the delivery of new features, security updates, and platform configurations.",
        "source": "finqa"
    },
    {
        "query": "How much did Google Services revenues increase in 2023?",
        "response": "$19.0 billion",
        "source": "finqa"
    },
    {
        "query": "What results did AbbVie announce concerning the Phase 3 SEQUENCE study about Skyrizi for Crohn's disease in September 2023?",
        "response": "Skyrizi met both primary endpoints at week 24, achieved superiority of endoscopic remission at week 48 versus Stelara, and all secondary endpoints achieved statistical significance.",
        "source": "finqa"
    },
    {
        "query": "Where should one look in the Annual Report to find financial statements and supplementary data?",
        "response": "Item 15(a)",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the increase in head office costs in 2023?",
        "response": "The increase in head office costs was primarily due to a rise in employee costs, brand and community costs, depreciation, other head office costs, and technology costs.",
        "source": "finqa"
    },
    {
        "query": "Where are the consolidated financial statements positioned within the document?",
        "response": "The consolidated financial statements are included elsewhere in the Annual Report.",
        "source": "finqa"
    },
    {
        "query": "What was the unamortized pre-tax actuarial loss on the pension plans at December 31, 2023, and how does it compare to the previous year?",
        "response": "The unamortized pre-tax actuarial loss on the pension plans was $5.9 billion at December 31, 2023, compared to $3.3 billion at the end of 2022.",
        "source": "finqa"
    },
    {
        "query": "In which item of the Annual Report can the information required by Item 8 be found?",
        "response": "Item 15(a)",
        "source": "finqa"
    },
    {
        "query": "What are the core focus areas for creating consumer delight mentioned by Procter & Gamble?",
        "response": "Procter & Gamble focuses on product performance, packaging, brand communication, retail execution and value to delight consumers.",
        "source": "finqa"
    },
    {
        "query": "How much did depreciation and amortization decrease by in the year ended December 31, 2023?",
        "response": "$31.0 million",
        "source": "finqa"
    },
    {
        "query": "What is the focus of AutoZone's commercial sales program?",
        "response": "AutoZone's commercial sales program focuses on distributing automotive parts and other products to various automotive service providers like repair garages, dealers, and fleet owners predominantly in the Americas. It features services such as credit, delivery, and online ordering.",
        "source": "finqa"
    },
    {
        "query": "For how many consecutive years had the Company increased its dividend by 2023?",
        "response": "61 years",
        "source": "finqa"
    },
    {
        "query": "What factors led to the increase in the 2023 full year EBIT of Ford Blue?",
        "response": "The increase in Ford Blue's 2023 full year EBIT was primarily driven by a favorable mix, lower commodity costs, higher wholesales, and net pricing, along with some increases in warranty and material costs partially offsetting the gains.",
        "source": "finqa"
    },
    {
        "query": "What compensation and benefit programs does The Home Depot offer to its associates?",
        "response": "The Home Depot offers competitive compensation, comprehensive benefits including healthcare, wellness programs, vacation and leave benefits, a 401(k) match, ESPPs, personal finance education, assistance programs for personal and work-life challenges, family support programs, and educational assistance.",
        "source": "finqa"
    },
    {
        "query": "What does the management need to judge significantly in regard to the provision for income taxes?",
        "response": "Management needs to significantly judge the interpretation of relevant facts and laws in the jurisdictions in which the company operates, in regard to the provision for income taxes.",
        "source": "finqa"
    },
    {
        "query": "What is the target number of high-powered chargers General Motors aims to install across North America?",
        "response": "At least 30,000 chargers",
        "source": "finqa"
    },
    {
        "query": "How did the Consumer segment's contribution to total net revenue change from Fiscal 2021 to Fiscal 2022?",
        "response": "It decreased from 31% in Fiscal 2021 to 29% in Fiscal 2022",
        "source": "finqa"
    },
    {
        "query": "What was the operating profit margin for 2023?",
        "response": "19.3 percent",
        "source": "finqa"
    },
    {
        "query": "What were the total compensation and benefits costs recognized in expense for the year ended December 31, 2023, according to The Charles Schwab Corporation?",
        "response": "$292 million",
        "source": "finqa"
    },
    {
        "query": "What was the net income of Gilead Sciences, Inc. for the year ended December 31, 2023?",
        "response": "$5,613 million",
        "source": "finqa"
    },
    {
        "query": "What is discussed in Item 3. Legal Proceedings of a company's report?",
        "response": "Item 3. Legal Proceedings covers Litigation and Regulatory Matters, detailed further in Note 12 – Commitments and Contingencies of the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What are some of the potential consequences for Meta Platforms, Inc. from inquiries or investigations as noted in the provided text?",
        "response": "Potential consequences for Meta Platforms include being subjected to substantial fines and costs, required changes to business practices, diversion of resources, and management attention from business operations, or adverse effects on the business.",
        "source": "finqa"
    },
    {
        "query": "What factors are considered significant in estimating Chubb's asbestos liabilities?",
        "response": "Significant factors in estimating Chubb's asbestos liabilities include the legal environment, precedents from specific settlements, trends in claim severity and frequency, ability to allocate liability among defendants and other insurers, claimant’s ability to bring claims in different states, policyholder's right to unaggregated coverage, access to high-level excess policies, payments to unimpaired claimants, and the potential liability of peripheral defendants.",
        "source": "finqa"
    },
    {
        "query": "What is the status of the company's inventory as of January 28, 2024, in terms of its valuation and provisions for obsolescence?",
        "response": "As of January 28, 2024, the company's inventory is valued at $1.3 billion at the lower of cost and net realizable value, and provisions for obsolescence and damaged goods are included which totals $139.7 million.",
        "source": "finqa"
    },
    {
        "query": "How often are goodwill impair and what events might trigger an additional review?",
        "response": "Goodwill is reviewed for impairment annually in the fourth quarter and also upon the occurrence of triggering events.",
        "source": "finqa"
    },
    {
        "query": "What U.S. regulations govern the transport of lithium-ion batteries in vehicles and energy storage products?",
        "response": "Regulations on \"dangerous goods\" which include lithium-ion batteries",
        "source": "finqa"
    },
    {
        "query": "How were overhead costs affected in the fiscal year, according to the text?",
        "response": "Overhead costs as a percentage of net sales increased by 40 basis points due to wage inflation and other cost increases, partially offset by the positive scale impacts of the net sales increase and productivity savings.",
        "source": "finqa"
    },
    {
        "query": "How much did The Charles Schwab Corporation's net income total in 2023?",
        "response": "$5.1 billion",
        "source": "finqa"
    },
    {
        "query": "What were the main factors contributing to the flattening of Research and Development expenditures as a percentage of sales?",
        "response": "The main factors contributing to the flattening of research and development expenditures as a percentage of sales were higher milestone payments in the Innovative Medicine business and the acquisition of an in-process research and development asset from the Laminar acquisition in the MedTech business.",
        "source": "finqa"
    },
    {
        "query": "What strategic actions has Walmart International taken over the last three years?",
        "response": "Over the last three years, Walmart International has divested of Walmart Argentina, Asda Group Limited in the U.K., and a majority stake in Seiyu in Japan, bought out the noncontrolling interest shareholders of Massmart, exited operations in certain countries in Africa, and increased ownership in PhonePe in India.",
        "source": "finqa"
    },
    {
        "query": "What percentage increase did Kroger's net earnings per diluted common share experience from 2021 to 2022?",
        "response": "41%",
        "source": "finqa"
    },
    {
        "query": "What are the future minimum lease payments under operating leases as of March 31, 2023?",
        "response": "The future minimum lease payments under operating leases as of March 31, 2023, are as follows: $73 million for 2024, $69 million for 2025, $56 million for 2026, $41 million for 2027, $32 million for 2028, and $116 million thereafter, totaling $387 million.",
        "source": "finqa"
    },
    {
        "query": "Where can the Glossary of Terms and Acronyms be found in the document?",
        "response": "On pages 315-321",
        "source": "finqa"
    },
    {
        "query": "What were the total cash dividends paid by the company in 2022?",
        "response": "$489 million",
        "source": "finqa"
    },
    {
        "query": "What were the risk-free interest rates used in the Black-Scholes option-pricing model for the years 2023, 2022, and 2021?",
        "response": "The risk-free interest rates were 4.1% in 2023, 2.1% in 2022, and 0.3% in 2021.",
        "source": "finqa"
    },
    {
        "query": "What was the impact of COVID-19 on customer sales in China during fiscal year 2023, and what could happen if lockdowns return?",
        "response": "During fiscal year 2023, end customer sales for NVIDIA's products in China were negatively impacted by lockdowns. This impact may continue if lockdowns return.",
        "source": "finqa"
    },
    {
        "query": "What was the total loss on the disposal of business in 2023, and how did this compare as a percentage of net revenues to previous years?",
        "response": "The Loss on disposal of business in 2023 was $539.0 million, or 10.8% of net revenues. In 2022 and 2021, the loss on disposal was significantly lower at $22.1 million, or 0.4% of net revenues, and $108.8 million, or 1.7% of net revenues, respectively.",
        "source": "finqa"
    },
    {
        "query": "What steps does the company plan to take next after discussing data with regulators and key opinion leaders?",
        "response": "The company intends to discuss the data with regulators and key opinion leaders to determine the most appropriate next steps.",
        "source": "finqa"
    },
    {
        "query": "What is the estimated timeline for stock options and RSUs to vest as stated by the company?",
        "response": "The vesting period for stock options and RSUs is generally four years.",
        "source": "finqa"
    },
    {
        "query": "What were Las Vegas Sands Corp.'s cash equivalents and restricted cash and cash equivalents at the end of 2023?",
        "response": "$6,436 million",
        "source": "finqa"
    },
    {
        "query": "By what percentage did Kroger's adjusted FIFO operating profit increase in 2022 compared to 2021?",
        "response": "17.8%",
        "source": "finqa"
    },
    {
        "query": "How has Tesla sought to increase the affordability of their vehicles in international markets?",
        "response": "Tesla has manufacturing facilities in China and Germany, which helps to increase vehicle affordability in local markets by reducing transportation and manufacturing costs and eliminating the impact of unfavorable tariffs.",
        "source": "finqa"
    },
    {
        "query": "What does Apple believe contributes significantly to employee thriving in professional and personal lives?",
        "response": "Apple believes that providing competitive and equitable compensation, as well as a wide variety of benefits and support, contributes significantly to employees thriving in their professional and personal lives.",
        "source": "finqa"
    },
    {
        "query": "What is the AMPTC rate for microinverters under the IRA as of December 31, 2023?",
        "response": "11 cents per alternating current watt",
        "source": "finqa"
    },
    {
        "query": "What standard duration do Hilton's franchise contracts typically have for newly franchised hotels?",
        "response": "Approximately 20 years",
        "source": "finqa"
    },
    {
        "query": "What does ITEM 8 in Form 10-K refer to?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What potential negative effects of legal proceedings on the company's business are mentioned in the report?",
        "response": "Adverse effects on the business, financial condition, and results of operations",
        "source": "finqa"
    },
    {
        "query": "How much was the total deferred revenue balance for Mortgage Technology segment at the end of 2023?",
        "response": "$106 million",
        "source": "finqa"
    },
    {
        "query": "What was the total provision for income taxes in 2021?",
        "response": "$14,527 million",
        "source": "finqa"
    },
    {
        "query": "How does the company evaluate its uncertain tax positions?",
        "response": "The company evaluates its uncertain tax positions by recognizing a tax benefit from uncertain tax positions when it is more likely than not that the position will be sustained upon examination.",
        "source": "finqa"
    },
    {
        "query": "What measures does the company take to ensure supplier compliance with responsible sourcing standards?",
        "response": "The company's standard supplier buying agreement includes a factory audit right related to responsible sourcing standards, and they conduct factory audits and compliance visits with suppliers outside Canada and the U.S.",
        "source": "finqa"
    },
    {
        "query": "What does the company imply about the severity of the lawsuits and regulatory proceedings they are involved in?",
        "response": "The company implies that the lawsuits and regulatory proceedings they are involved in are not severe enough to be considered material, as none are required to be disclosed as material legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How is average invested capital calculated for ROIC?",
        "response": "Average invested capital is calculated as the sum of the average of total assets, the average LIFO reserve, and the average accumulated depreciation and amortization, minus the average taxes receivable, the average trade accounts payable, the average accrued salaries and wages, and the average other current liabilities, excluding accrued income taxes.",
        "source": "finqa"
    },
    {
        "query": "How many states did the company operate stores in as of January 28, 2023?",
        "response": "As of January 28, 2023, the company operated stores in 48 states and the District of Columbia.",
        "source": "finqa"
    },
    {
        "query": "What is the H100 GPU designed to accelerate?",
        "response": "The H100 GPU is designed to accelerate applications such as large language models, deep recommender systems, genomics, and complex digital twins.",
        "source": "finqa"
    },
    {
        "query": "What types of fees do Hilton's franchisees pay?",
        "response": "Application, initiation or other initial fees, monthly program fees, and a royalty fee based on a percentage of the hotel’s monthly gross room revenue.",
        "source": "finqa"
    },
    {
        "query": "What number is associated with Item 8 in the document?",
        "response": "39",
        "source": "finqa"
    },
    {
        "query": "What potential business issues related to product safety are mentioned on page 12 of the Annual Report?",
        "response": "The possibility of stopping sales or recalling products for safety-related or other issues",
        "source": "finqa"
    },
    {
        "query": "How much did the company pay in cash dividends per share of common stock in 2023?",
        "response": "$1.68",
        "source": "finqa"
    },
    {
        "query": "What was the net change in cash from financing activities from 2022 to 2023?",
        "response": "Net cash from financing activities changed by $6.12 billion to $2.59 billion net cash provided by financing activities during the year ended December 31, 2023 from $3.53 billion net cash used in financing activities during the year ended December 31, 2022.",
        "source": "finqa"
    },
    {
        "query": "What contributed to the decrease in net cash used in financing activities in 2022 compared to 2021?",
        "response": "The decrease in net cash used in financing activities in 2022 compared to 2021 was primarily due to lower cash spending on stock repurchases and the avoidance of a prepayment penalty incurred in the prior year.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did bank deposit account fees decrease from 2022 to 2023, and what were the main reasons for this decrease?",
        "response": "50%",
        "source": "finqa"
    },
    {
        "query": "What were the challenges identified by auditors in the valuation of certain merchandise inventory products for GameSpot Corp.?",
        "response": "The challenges included significant estimates and assumptions regarding excess, slow-moving, and obsolete inventory adjustments which required a high degree of auditor judgment and increased effort in audit procedures.",
        "source": "finqa"
    },
    {
        "query": "How much did the variable portion of the Macao gaming annual premium amount to in 2023?",
        "response": "approximately $691 million",
        "source": "finqa"
    },
    {
        "query": "What acquisitions did CVS Health Corporation complete in 2023 to enhance their care delivery strategy?",
        "response": "In 2023, CVS Health Corporation acquired Signify Health, Inc. and Oak Street Health, Inc. to enhance their ability to execute on their care delivery strategy.",
        "source": "finqa"
    },
    {
        "query": "How much did the company's net cash flows used in investing activities increase in fiscal 2023?",
        "response": "$876.2 million",
        "source": "finqa"
    },
    {
        "query": "Describe the Garmin EmpirBus digital switching products.",
        "response": "Garmin's EmpirBus line features digital switching products that provide power distribution and control solutions for marine and RV applications, enabling smart electrical systems with advanced logic controls, and customizable graphics user interfaces controlled through Garmin’s marine MFDs and RV OEM products.",
        "source": "finqa"
    },
    {
        "query": "How much net cash was provided by operating activities for Advanced Micro Devices, Inc. in the fiscal year ended December 30, 2023?",
        "response": "$1,667 million",
        "source": "finqa"
    },
    {
        "query": "Who are the stakeholders involved in the assessment of topics impacting enterprise value and broader societal and environmental issues?",
        "response": "The stakeholders involved include investors, customers, suppliers, employees, executives, non-governmental organizations, and sector organizations.",
        "source": "finqa"
    },
    {
        "query": "Who holds the patents for the active pharmaceutical ingredients of some of the company's products?",
        "response": "The patents for the active pharmaceutical ingredients of some of the company's products are held by third parties, from whom the company has acquired exclusive rights through agreements.",
        "source": "finqa"
    },
    {
        "query": "What types of clients and customers does the Company's Health Services segment primarily serve?",
        "response": "The Company's Health Services clients and customers include employers, insurance companies, unions, government employee groups, health plans, and other sponsors of health benefit plans, as well as patients receiving care in various settings.",
        "source": "finqa"
    },
    {
        "query": "What is Amazon's approach to intellectual property?",
        "response": "Amazon regards its intellectual property, including trademarks, service marks, copyrights, patents, domain names, trade dress, trade secrets, and proprietary technologies, as critical to its success and relies on legal protections and agreements to secure its proprietary rights.",
        "source": "finqa"
    },
    {
        "query": "How much did the after-tax earnings of the real estate brokerage decrease in 2023, and what were the primary factors for this decrease?",
        "response": "The after-tax earnings of the real estate brokerage decreased by $87 million, or 87.0%, in 2023. The primary factors for this decrease were lower brokerage services revenues and margins, mainly due to a 19% reduction in closed brokerage transaction volumes, as well as lower mortgage services revenues and margins due to a 28% decrease in closed transaction volumes. These declines were influenced by rising interest rates and lower existing home sales.",
        "source": "finqa"
    },
    {
        "query": "What triggers the reclassification of the cumulative change in fair value from Accumulated other comprehensive income to Other (income) expense, net?",
        "response": "The reclassification of the cumulative change in fair value from Accumulated other comprehensive income to Other (income) expense, net is triggered during the quarter in which the decrease occurs.",
        "source": "finqa"
    },
    {
        "query": "What were the deferred contract fulfillment and acquisition cost balances included in Other Non-Current Assets on HP's Consolidated Balance Sheets as of October 31, 2023?",
        "response": "$44 million",
        "source": "finqa"
    },
    {
        "query": "What information is provided in Part I Item 3 of the report?",
        "response": "Information about legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What reasons do some competitors have for potentially providing products at little or no profit?",
        "response": "Certain competitors have the resources, experience, or cost structures to provide products at little or no profit, or even at a loss.",
        "source": "finqa"
    },
    {
        "query": "How does the company account for shipping and handling costs associated with outbound freight after control over a product has transferred to a customer?",
        "response": "The company accounts for shipping and handling costs associated with outbound freight after control over a product has transferred to a customer as fulfillment costs, and these costs are included in the Cost of Sales when the related revenues are recognized.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in NIKE, Inc.'s revenues in fiscal 2023 compared to fiscal 2022 on a reported basis?",
        "response": "NIKE, Inc.'s revenues increased by 10% in fiscal 2023 compared to fiscal 2022 on a reported basis.",
        "source": "finqa"
    },
    {
        "query": "What percentage of employees at AT&T are represented by unions such as the Communications Workers of America or the International Brotherhood of Electrical Workers?",
        "response": "Approximately 42% of AT&T's employees are represented by unions such as the Communications Workers of America (CWA) or the International Brotherhood of Electrical Workers (IBEW).",
        "source": "finqa"
    },
    {
        "query": "What is the weighted-average remaining contractual life of options that are vested or expected to vest as of January 31, 2023?",
        "response": "Approximately 4.37 years.",
        "source": "finqa"
    },
    {
        "query": "In which section of the document can information about legal proceedings be found?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "By what amount did cash and cash equivalents change from January 29, 2022, to January 28, 2023?",
        "response": "decreased by $132.4 million",
        "source": "finqa"
    },
    {
        "query": "What standards were followed in the audit of The Hershey Company’s internal control over financial reporting?",
        "response": "The audit of The Hershey Company’s internal control over financial reporting was conducted in accordance with the standards of the Public Company Accounting Oversight Board (PCAOB).",
        "source": "finqa"
    },
    {
        "query": "For how long did Jeffrey P. Bezos serve as President at Amazon?",
        "response": "From 1994 until June 1999 and again from October 2000 to July 2021",
        "source": "finqa"
    },
    {
        "query": "What position did Timothy S. Teter acquire at NVIDIA in 2018?",
        "response": "In February 2018, Timothy S. Teter became the Executive Vice President, General Counsel, and Secretary at NVIDIA.",
        "source": "finqa"
    },
    {
        "query": "What effect would a 100 basis-point change in the rate of return have on the annual after-tax benefit or expense for both pension and OPRB assets?",
        "response": "A 100 basis-point change in the rate of return for both pension and OPRB assets would impact the annual after-tax benefit or expense by approximately $135 million.",
        "source": "finqa"
    },
    {
        "query": "What methods are used by HP to determine the fair value of a reporting unit during a quantitative goodwill impairment test?",
        "response": "In a quantitative goodwill impairment test, HP uses estimates and assumptions such as revenue growth rates, operating margins for future cash flows, risk-adjusted discount rates, and future economic and market conditions.",
        "source": "finqa"
    },
    {
        "query": "What is the total number of screens and theatres operated by the company as of December 31, 2023?",
        "response": "The company owned, leased, or operated 898 theatres and 10,059 screens in 11 countries.",
        "source": "finqa"
    },
    {
        "query": "By how much did Services revenue grow in 2023 compared to 2022?",
        "response": "14.6%",
        "source": "finqa"
    },
    {
        "query": "What assumptions influence HP's pension and post-retirement benefit costs and obligations?",
        "response": "Assumptions related to discount rates, mortality rates, expected increases in compensation levels, and the expected long-term return on plan assets.",
        "source": "finqa"
    },
    {
        "query": "How often does the company review debt investments for credit losses and impairment?",
        "response": "The company reviews debt investments for credit losses and impairment on a quarterly basis.",
        "source": "finqa"
    },
    {
        "query": "What was the comparative increase in comparable store sales for the North America segment and U.S. market in fiscal 2023?",
        "response": "Comparable store sales for the North America segment and the U.S. market increased by 9% in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What actions are taken when uncertain tax positions do not meet the threshold for recognition in financial statements?",
        "response": "For uncertain tax w_positions that do not meet the threshold, a related liability is recorded.",
        "source": "finqa"
    },
    {
        "query": "How much did Chipotle Mexican Grill's food and beverage revenue increase from 2022 to 2023?",
        "response": "$1,246,123",
        "source": "finqa"
    },
    {
        "query": "What impact could future legal and administrative proceedings under the FCPA have on a company?",
        "response": "Future legal and administrative proceedings under the FCPA could include civil penalties, criminal sanctions, and other administrative remedies, potentially causing material adverse impacts on a company's operations, liquidity, and financial position.",
        "source": "finqa"
    },
    {
        "query": "In which region was Produodopa (ABBV-951) launched for the treatment of advanced Parkinson's disease in January 2024?",
        "response": "European Union",
        "source": "finqa"
    },
    {
        "query": "What was Goldman Sachs' net earnings for the year 2023?",
        "response": "$8,516 million",
        "source": "finqa"
    },
    {
        "query": "How does Iron Mountain's reported EPS fully diluted from net income in 2023 compare to 2022?",
        "response": "In 2023, Iron Mountain's reported EPS fully diluted from net income was $0.63 compared to $1.90 in 2022.",
        "source": "finqa"
    },
    {
        "query": "What factors drove the increase in restructuring expense in the fiscal year ended June 30, 2023?",
        "response": "The increase in restructuring expense was primarily due to an increase in stock-based compensation expense and professional fees, which were partially offset by a decrease in cash severance and other personnel costs.",
        "source": "finqa"
    },
    {
        "query": "How much did Chevron's U.S. refining network's crude distillation capacity utilization rate increase from 2022 to 2023?",
        "response": "from 87.3 percent to 90.8 percent",
        "source": "finqa"
    },
    {
        "query": "What was the reason for the decline in TTI's revenue in 2023 compared to 2022?",
        "response": "The decline in TTI's revenue in 2023 compared to 2022 was primarily due to new orders slowing down in several regions, especially in the Asia-Pacific region, which was impacted by elevated customer inventory levels and increasing price competition.",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the loss from operations in the Corporate Investments division for fiscal year 2023?",
        "response": "The loss from operations in the Corporate Investments division for fiscal year 2023 was primarily due to expenses associated with incubation projects.",
        "source": "finqa"
    },
    {
        "query": "What is the coverage area of The Home Depot's express car and van delivery service?",
        "response": "The Home Depot's express car and van delivery service covers over 80% of the U.S. population.",
        "source": "finqa"
    },
    {
        "query": "What is the company's approach to reporting on foreign currency impacts on net revenue?",
        "response": "The company reports foreign currency impacts on net revenue by supplementing year-over-over percentage changes with constant currency measures, which exclude the effect of foreign currency exchange fluctuations.",
        "source": "finqa"
    },
    {
        "query": "How does Gilead handle the complex logistics of manufacturing and delivering cell therapy products?",
        "response": "Gilead maintains a complex chain of identity and custody for patient material, ensuring it is correctly handled from collection, through the manufacturing process, to delivery back to the patient.",
        "source": "finqa"
    },
    {
        "query": "What is presented in Item 8 of the financial statements?",
        "response": "The index to Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "How much would the estimated cost of a recall campaign increase with a 10% increase in the estimated take rate?",
        "response": "$0.4 billion",
        "source": "finqa"
    },
    {
        "query": "What primarily comprises unearned revenue according to the discussed financial statements?",
        "response": "Unearned revenue primarily comprises unearned revenue related to volume licensing programs, which may include Software Assurance and cloud services.",
        "source": "finqa"
    },
    {
        "query": "How much is the Company agreed to pay under the opioid settlement to resolve all lawsuits and future claims by government entities nationwide?",
        "response": "$5.0 billion",
        "source": "finqa"
    },
    {
        "query": "What does GBV represent in the financial context of a company?",
        "response": "GBV represents the total dollar value of bookings on a company's platform, which includes host earnings, service fees, cleaning fees, and taxes, and is adjusted for any cancellations and alterations within a specific period.",
        "source": "finqa"
    },
    {
        "query": "What was the effective income tax rate for the year ended December 31, 2023, and how does it compare to the previous year's rate?",
        "response": "The effective income tax rate for the year ended December 31, 2023, was 24.2%, which is higher than the previous year's rate of 23.9%.",
        "source": "finqa"
    },
    {
        "query": "In fiscal year 2023, how much did the company decrease its total debt compared to 2022?",
        "response": "$10.3 billion",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of purchase obligations as of December 31, 2023?",
        "response": "$100 million",
        "source": "finqa"
    },
    {
        "query": "What was the primary reason for the increase in net cash used in investing activities in fiscal 2023?",
        "response": "An increase in capital expenditures",
        "source": "finqa"
    },
    {
        "query": "What is the PCAOB ID of the firm that prepared the report on the Consolidated Financial Statements?",
        "response": "The PCAOB ID of the firm that prepared the report is 238.",
        "source": "finqa"
    },
    {
        "query": "What are the estimated global financially regulated subsidiaries’ statutory capital and surplus as of December 31, 2023?",
        "response": "$38.5 billion",
        "source": "finqa"
    },
    {
        "query": "What are the changes in sales and marketing expenses between 2022 and 2023?",
        "response": "Sales and marketing expenses increased in 2023 compared to 2022 primarily due to an increase in employee related costs and marketing program costs, partially offset by a decrease in user coupons and rewards.",
        "source": "finqa"
    },
    {
        "query": "What model does Visa traditionally refer to regarding their transaction process among consumers, financial institutions, and merchants?",
        "response": "the 'four-party' model",
        "source": "finqa"
    },
    {
        "query": "What are the anticipated 2024 EBIT contributions for the Ford Pro and Ford Blue segments?",
        "response": "Ford Pro EBIT is expected to be between $8 billion and $9 billion, while Ford Blue's projected EBIT ranges from $7 billion to $7.5 billion.",
        "source": "finqa"
    },
    {
        "query": "What conditions must be met for a company to not accrue additional taxes under ASC 740 when it comes to the reinvestment of foreign earnings?",
        "response": "Under ASC 740, a company may not accrue additional taxes on foreign earnings if there is sufficient evidence that the foreign subsidiary has invested or will invest the undistributed earnings indefinitely, thereby overcoming the presumption that investments in foreign subsidiaries will be recovered through sales or distributions to the parent entity.",
        "source": "finqa"
    },
    {
        "query": "What was the net change in unearned revenue that benefited cash from operating activities in fiscal 2023?",
        "response": "$1.7 billion",
        "source": "finqa"
    },
    {
        "query": "What is included in Item 8 of the document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "How much did the operating lease liabilities for 2023 amount to after subtracting imputed interest?",
        "response": "$1,107.4 million",
        "source": "finqa"
    },
    {
        "query": "What functionality does the Foundry platform provide to organizations?",
        "response": "The Foundry platform provides a central operating system for data within organizations, allowing users to integrate and analyze data in one place, thereby accelerating the speed at which new ideas can be tested and implemented.",
        "source": "finqa"
    },
    {
        "query": "Which inputs are categorized as Level 3 in the fair value hierarchy?",
        "response": "Level 3 inputs are unobservable inputs for the asset or liability, and include situations where there is little, if any, market activity for the asset or liability.",
        "source": "finqa"
    },
    {
        "query": "What affected the cash flows from operating activities for the business?",
        "response": "The cash flows from operating activities were significantly affected by cash investments in areas such as research and development, selling, general and administrative, and working capital.",
        "source": "finqa"
    },
    {
        "query": "How is GameStop aiming to improve its margins and ensure a sustainable cost structure?",
        "response": "GameStop aims to improve margins through operational discipline and emphasizing higher margin collectibles and pre-owned product categories. It also focuses on ensuring a sustainable cost structure by optimizing its workforce.",
        "source": "finqa"
    },
    {
        "query": "What activities are included in the services and other revenue segment of General Motors Company?",
        "response": "The services and other revenue segment of General Motors Company includes revenue from vehicle-related service arrangements and after-sale services such as maintenance, OnStar, Super Cruise, vehicle connectivity, and extended service warranties.",
        "source": "finqa"
    },
    {
        "query": "How quickly are filed reports available on AbbVie's investor relations website after submission to the SEC?",
        "response": "Filed reports are available on AbbVie's investor relations website as soon as reasonably practicable after submission to the SEC.",
        "source": "finqa"
    },
    {
        "query": "What pages contain the Financial Statements and Supplementary Data in IBM’s 2023 Annual Report to Stockholders?",
        "response": "Pages 44 through 121",
        "source": "finqa"
    },
    {
        "query": "What was the effective income tax rate for Comcast Corporation in 2023?",
        "response": "26.2%",
        "source": "finqa"
    },
    {
        "query": "Where can one find the indexes related to financial statements and schedules?",
        "response": "The indexes to financial statements and schedules are located at Part IV Item 15, labeled as 'Exhibits, Financial Statement Schedules'.",
        "source": "finqa"
    },
    {
        "query": "How many rooms did Hilton have globally as of December 31, 2023?",
        "response": "1,182,937",
        "source": "finqa"
    },
    {
        "query": "What other information is included along with the company’s financial statements in the Annual Report on Form 10-K?",
        "response": "The accompanying notes are included along with the financial statements.",
        "source": "finqa"
    },
    {
        "query": "How much long-term debt did the company have outstanding as of December 31, 2023?",
        "response": "As of December 31, 2023, the company had $47.9 billion in long-term debt outstanding.",
        "source": "finqa"
    },
    {
        "query": "How many AutoZone stores are there in the U.S., Mexico, and Brazil as of the end of fiscal 2023?",
        "response": "At the end of fiscal 2023, AutoZone operated 6,300 stores in the U.S., 740 stores in Mexico, and 100 stores in Brazil.",
        "source": "finqa"
    },
    {
        "query": "How does Amazon fulfill customer orders?",
        "response": "Amazon fulfills customer orders through a combination of North America and International fulfillment networks operated by the company, co-sourced and outsourced arrangements in some countries, digital delivery, and through its physical stores.",
        "source": "finqa"
    },
    {
        "query": "What percentage of the aggregate transaction consideration for acquiring Black Knight was paid in cash and how much was it?",
        "response": "90% of the aggregate transaction consideration for acquiring Black Knight was paid in cash, amounting to $10.5 billion.",
        "source": "finqa"
    },
    {
        "query": "What was the total cost of TNT Express's business realignment through 2023?",
        "response": "$430 million",
        "source": "finqa"
    },
    {
        "query": "How much does HP expect to pay for benefit claims for its post-retirement benefit plans in fiscal year 2024?",
        "response": "$3 million",
        "source": "finqa"
    },
    {
        "query": "How does Hershey describe its position in the global market according to the 2023 Form 10-K?",
        "response": "Hershey describes itself as the largest producer of quality chocolate in North America, a leading snack maker in the United States, and a global leader in both chocolate and non-chocolate confectionery.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage change in the total net sales for fiscal 2022 from Canada commercially?",
        "response": "increased by 3.6%",
        "source": "finqa"
    },
    {
        "query": "What are the SEC's regulations for security-based swap dealers like Goldman Sachs' subsidiaries?",
        "response": "The SEC regulations for security-based swap dealers include capital, margin and segregation requirements; record-keeping, financial reporting, and notification requirements; business conduct standards; regulatory and public trade reporting; and risk mitigation techniques for uncleared portfolios of security-based swaps.",
        "source": "finqa"
    },
    {
        "query": "What was the net earnings of The Home Depot, Inc. for fiscal years 2020, 2021, and 2022?",
        "response": "For fiscal years 2020, 2021, and 2022, The Home Depot, Inc. reported net earnings of $12,866 million, $16,433 million, and $17,105 million, respectively.",
        "source": "finqa"
    },
    {
        "query": "What was Bank of America's total loans and leases charged off amount in 2023?",
        "response": "$4,817 million",
        "source": "finqa"
    },
    {
        "query": "What sections are included alongside the Financial Statements in this report?",
        "response": "The sections include the Report of Independent Registered Public Accounting Firm, the accompanying Notes to the Financial Statements, and the Financial Statement Schedule.",
        "source": "finqa"
    },
    {
        "query": "What were the main reasons for the increased net revenue in 2023 compared to 2022?",
        "response": "The increase in net revenue in 2023 compared to 2022 was primarily due to increased Americas net revenue, and also increases in China Mainland and Rest of World net revenues.",
        "source": "finqa"
    },
    {
        "query": "By what percentage did the Australian dollar weaken against the U.S. dollar in 2023?",
        "response": "5%",
        "source": "finqa"
    },
    {
        "query": "What are the modes through which lululemon serves its guests via e-commerce?",
        "response": "Lululemon serves its guests via e-commerce through websites, digital marketplaces, mobile apps, and includes services such as buy online pick-up in store, back-back room, and ship from store.",
        "source": "finqa"
    },
    {
        "query": "How has the average age of light vehicles on the road in the U.S. changed by January 1, 2023?",
        "response": "As of January 1, 2023, the average age of light vehicles on the road was 12.5 years.",
        "source": "finqa"
    },
    {
        "query": "What is the current outstanding amount on the company's Americas credit facility as of January 28, 2024?",
        "response": "As of January 28, 2024, the company had no borrowings outstanding, aside from letters of credit totaling $6.3 million, under their Americas credit facility.",
        "source": "finqa"
    },
    {
        "query": "What change was observed in the cash provided by operating activities between fiscal 2022 and 2023?",
        "response": "Cash provided by operating activities increased from $4.4 billion in fiscal 2022 to $6.0 billion in fiscal 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the weighted-average remaining term of the financing obligations as of December 31, 2023?",
        "response": "The weighted-average remaining term of the financing obligations was 17.0 years as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the total estimated payments for future policy benefits and market risk benefits as stated?",
        "response": "The total estimated payments for future policy benefits are $56.0 billion and for market risk benefits are $1.5 billion.",
        "source": "finqa"
    },
    {
        "query": "How much did the AUS for equity increase from 2022 to 2023?",
        "response": "$95 billion",
        "source": "finqa"
    },
    {
        "query": "What is the length of the interstate natural gas pipeline system operated by Kern River?",
        "response": "The Kern River operates an interstate natural gas pipeline system that is approximately 1,400 miles long.",
        "source": "finqa"
    },
    {
        "query": "How much was the net cash used in financing activities for the year specified in the financial data?",
        "response": "$686.8 million",
        "source": "finqa"
    },
    {
        "query": "What was the amount of premiums written by Berkshire Hathaway's Insurance Underwriting in 2023, and how did it compare to the previous year?",
        "response": "In 2023, the premiums written amounted to $18,142 million, which was an increase of $3,523 million or 24.1% from 2022 where the premiums written were $14,619 million.",
        "source": "finqa"
    },
    {
        "query": "What criteria define the comparable hotels in the company's system?",
        "response": "Comparable hotels are defined as those that have been active and operating in the system for at least one full calendar year as of the end of the current period, were open on January 1st of the previous year, have not changed brand or ownership type during the current or comparable periods reported, and have not undergone large-scale capital projects, sustained substantial property damage, encountered business interruption, or lacked available comparable results.",
        "source": "finqa"
    },
    {
        "query": "What types of products does Garmin design, develop, and distribute?",
        "response": "GPS-enabled products and other navigation, communications, sensor-based, and information products",
        "source": "finqa"
    },
    {
        "query": "What are the attendance figures for movie theaters in the United Kingdom and Germany in 2023?",
        "response": "United Kingdom had 124.4 million and Germany had 96.3 million.",
        "source": "finqa"
    },
    {
        "query": "Can you name some of IBM's strategic partners?",
        "response": "IBM's strategic partners include Adobe, Amazon Web Services (AWS), Microsoft, Oracle, Salesforce, Samsung Electronics, and SAP, among others.",
        "source": "finqa"
    },
    {
        "query": "What percentage of Humana Inc.'s total premiums and services revenue in 2023 came from contracts with the federal government?",
        "response": "84%",
        "source": "finqa"
    },
    {
        "query": "What input relies on a combination of industry mean time between failure estimates and third-party data for establishing its initial estimates?",
        "response": "initial return rate estimates",
        "source": "finqa"
    },
    {
        "query": "What were the dividend payments to stockholders in 2023, 2022, and 2021?",
        "response": "The company paid dividends to stockholders amounting to $431 million in 2023, $392 million in 2022, and $354 million in 2021.",
        "source": "finqa"
    },
    {
        "query": "What type of regulations do U.S. automobiles need to comply with under the National Highway Traffic Safety Administration?",
        "response": "Federal Motor Vehicle Safety Standards (FMVSS) and the NHTSA bumper standard",
        "source": "finqa"
    },
    {
        "query": "What are the potential legal consequences for a company's failure to comply with laws and regulations governing the retail and health care sectors?",
        "response": "The potential legal consequences for a company's failure to comply with laws and regulations governing the retail and health care sectors include fines or other sanctions by governmental authorities.",
        "source": "finqa"
    },
    {
        "query": "What is the seasonal trend observed in vehicle production by a manufacturer?",
        "response": "The seasonal trend observed in vehicle production by a manufacturer tends to be higher in the first half of the year, particularly in the spring and summer, which are typically the strongest sales months of the year.",
        "source": "finqa"
    },
    {
        "query": "What type of merchandise is included under seasonal and electronics merchandise?",
        "response": "Seasonal and electronics merchandise includes items for Christmas, Easter, Halloween, and Valentine's Day, as well as personal electronics like pre-paid cellular phones and services.",
        "source": "finqa"
    },
    {
        "query": "What can cause delays in pharmaceutical product launches?",
        "response": "Delays in pharmaceutical product launches can be caused by regulatory inconsistencies, unpredictability in approval processes, and varying standards across different markets.",
        "source": "finqa"
    },
    {
        "query": "What technology does Garmin use in their marine VHF radios and AIS transceivers?",
        "response": "Garmin's marine VHF radios and AIS transceivers include integrated GPS receivers and are NMEA 2000 compatible, with multi-station support and monitoring of all AIS channels.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of dividends paid by the company in 2023?",
        "response": "$2.56 billion.",
        "source": "finqa"
    },
    {
        "query": "What significant acquisitions did Chevron complete in 2023 to enhance its operations?",
        "response": "In 2023, Chevron completed the acquisition of PDC, adding substantial acreage in west Texas to its position.",
        "source": "finqa"
    },
    {
        "query": "What was the effective tax rate for Microsoft in fiscal year 2023?",
        "response": "The effective tax rate for Microsoft in fiscal year 2023 was 19%.",
        "source": "finqa"
    },
    {
        "query": "How many hotels does Hilton manage as of December 31, 2023?",
        "response": "800 hotels",
        "source": "finqa"
    },
    {
        "query": "What is the maximum capital commitment that Ford has contributed to BlueOval SK, LLC over a five-year period ending in 2026?",
        "response": "$6.6 billion",
        "source": "finqa"
    },
    {
        "query": "What is the carrying value of the indefinite-lived intangible assets related to the Certificate of Needs and Medicare licenses as of December 31, 2023?",
        "response": "$1.4 billion",
        "source": "finqa"
    },
    {
        "query": "Is there any consolidated financial data provided in ITEM 6?",
        "response": "No, there is no consolidated financial data provided in ITEM 6 as it states 'Not applicable'.",
        "source": "finqa"
    },
    {
        "query": "What significant transaction did the company complete on August 11, 2022, involving Gentiva Hospice?",
        "response": "The company completed the sale of a 60% interest in Gentiva Hospice to Clayton, Dubilier & Rice.",
        "source": "finqa"
    },
    {
        "query": "What was the credit exposure of loans and lending commitments extended for securitization purposes in December 2023, and how did it change compared to December 2022?",
        "response": "The credit exposure from loans held for securitization purposes was $7.65 billion in December 2023, showing a decrease from $8.07 billion in December 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the title of item 8 in the financial document?",
        "response": "Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What were the cash and cash equivalents at the end of 2023?",
        "response": "Cash and cash equivalents were $2.82 billion as of December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What are the sources of operating cash inflows?",
        "response": "Operating cash inflows include cash from vehicle sales, related servicing, customer lease and financing payments, customer deposits, sales of regulatory credits, energy generation and storage products, and interest income on the cash and investments portfolio.",
        "source": "finqa"
    },
    {
        "query": "What is the voluntary turnover rate (VTR) at the company in 2023 and how does it compare to 2022?",
        "response": "In 2023, the voluntary turnover rate (VTR) was 13.4%, which represents a decrease from 17% in 2022.",
        "source": "finqa"
    },
    {
        "query": "What does Item 3 of the Annual Report on Form 10-K direct the reader to for information on legal proceedings?",
        "response": "Note 14 of the Notes to the Consolidated Financial Statements in Item 8",
        "source": "finqa"
    },
    {
        "query": "How did higher prices on direct materials affect The Hershey Company's business in 2023?",
        "response": "Higher prices for direct materials used in manufacturing The Hershey Company's products were the primary incremental cost to the business in 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the basis for recognizing revenue from the company's professional services?",
        "response": "Revenue from the company's professional services is recognized over the contractual term as services are provided on-demand throughout the contract period.",
        "source": "finqa"
    },
    {
        "query": "How does the company assess the relevance of lawsuits and regulatory proceedings to which it is involved?",
        "response": "The company assesses that none of the lawsuits and regulatory proceedings to which it is involved are significant enough to be reported as material legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "How does Visa ensure the protection of its intellectual property?",
        "response": "Visa protects its intellectual property through a combination of patent, trademark, copyright, trade secret laws, confidentiality procedures, and contractual provisions in the U.S. and other jurisdictions.",
        "source": "finqa"
    },
    {
        "query": "What triggers a quantitative impairment test for a company?",
        "response": "A quantitative impairment test is triggered if the company concludes that it is more likely than not that the fair value of an asset is less than its carrying amount.",
        "source": "finqa"
    },
    {
        "query": "How does Costco handle freight and shipments from suppliers?",
        "response": "Costco receives large shipments from suppliers at depots and quickly ships them to warehouses, creating freight volume and handling efficiencies.",
        "source": "finqa"
    },
    {
        "query": "What was the net change in cash, cash equivalents, restricted cash, and restricted cash equivalents at the end of the year as reported?",
        "response": "$21,990",
        "source": "finqa"
    },
    {
        "query": "What types of financial reports does Gilead Sciences, Inc. provide in their consolidated financial statements for the years ending 2023, 2022, and 2021?",
        "response": "Consolidated Balance Sheets, Consolidated Statements of Income, Consolidated Statements of Comprehensive Income, Consolidated Statements of Stockholders’ Equity, Consolidated Statements of Cash Flows, and Notes to Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What were the total sales of STELARA in the United States in 2023?",
        "response": "Approximately $7.0 billion",
        "source": "finqa"
    },
    {
        "query": "How does a company classify and report short-term investments in debt securities on its balance sheet?",
        "response": "A company classifies its short-term investments in debt securities as available-for-sale, allowing these securities to be sold at any time for use in current operations or other purposes. These investments are classified within current assets on the Consolidated Balance Sheets, even for securities with maturities beyond twelve months.",
        "source": "finqa"
    },
    {
        "query": "What are the primary competitive advantages of Azure listed in the text?",
        "response": "Azure's competitive advantages include its hybrid cloud capabilities, large-scale deployments suitable for all business sizes, AI offerings like AI-optimized infrastructure, and its ability to integrate large language models for advanced application development.",
        "source": "finqa"
    },
    {
        "query": "What exclusive products can be purchased from the SECRET LAIR platform?",
        "response": "Fans of MAGIC: THE GATHERING can purchase exclusive and limited versions of cards from the SECRET LAIR, an internet-based storefront.",
        "source": "finqa"
    },
    {
        "query": "What options does the company have at the end of the lease term for their leased properties?",
        "response": "At the end of the lease term, the company has options to renew the lease, purchase the property, or exercise a right of first refusal if there's a third-party offer.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount of cash and cash equivalents reported by Palantir Technologies Inc. as of December 31, 2023?",
        "response": "$831,047",
        "source": "finqa"
    },
    {
        "query": "How does a company account for potential liabilities from legal proceedings in its financial statements?",
        "response": "A company records a liability for potential legal proceedings when it is probable that a loss has been incurred and the amount is reasonably estimatable. The company also regularly reviews the materiality and likelihood of potential loss contingencies to determine the need for adjusting recorded liabilities or providing additional disclosures in the financial statements.",
        "source": "finqa"
    },
    {
        "query": "How did foreign currency movements affect the cost of net revenues in the years 2022 and 2023?",
        "response": "In 2023, foreign currency movements had an unfavorable impact of $2 million on cost of net revenues, while in 2022, they had a favorable impact of $81 million.",
        "source": "finqa"
    },
    {
        "query": "What are considered forward-looking statements in GameStop's report?",
        "response": "In GameStop's report, forward-looking statements include predictions about future economic performance, management's plans and objectives, and any assumptions related to these topics.",
        "source": "finqa"
    },
    {
        "query": "What technologies does the Company use to ensure employee health across physical, mental, emotional, and financial aspects?",
        "response": "The Company uses various programs and practices designed to protect and enhance employee health across physical, mental, emotional, and financial areas.",
        "source": "finqa"
    },
    {
        "query": "What significant changes did the Canadian federal government make in its 2030 Emissions Reduction Plan concerning ZEVs?",
        "response": "The Canadian 2030 Emissions Reduction Plan introduced increasingly stringent ZEV supply regulations starting with 20% ZEVs required in 2026 and moving towards a 100% requirement by 2035.",
        "source": "finqa"
    },
    {
        "query": "What was the net fair value of derivatives as of December 2023 according to the financial data provided?",
        "response": "$51,120 million",
        "source": "finqa"
    },
    {
        "query": "What led to the decrease in video revenue in 2023?",
        "response": "The decrease in video revenue in 2023 was primarily due to declines in the overall number of residential video customers, although this was partially offset by an overall increase in average rates.",
        "source": "finqa"
    },
    {
        "query": "What was the increase in total lease payments from the base amount to the final amount including interest in 2023?",
        "response": "$43 million",
        "source": "finqa"
    },
    {
        "query": "How did the sales and marketing expense change from the fiscal year ended June 30, 2022 to the fiscal year ended June 30, 2023?",
        "response": "Sales and marketing expense decreased by $370.7 million in the fiscal year ended June 30, 2023 compared to the fiscal year ended June 30, 2022.",
        "source": "finqa"
    },
    {
        "query": "How much were Electronic Arts Inc.'s cash and cash equivalents on March 31, 2022?",
        "response": "$2,732 million",
        "source": "finqa"
    },
    {
        "query": "What are the required amendments in the ASU No. 2023-09 regarding income tax disclosures?",
        "response": "The required amendments in ASU No. 2023-09 include enhanced income tax disclosures, primarily related to the standardization and disaggregation of rate reconciliation categories and income taxes paid by jurisdiction.",
        "source": "finqa"
    },
    {
        "query": "What was the effective income tax rate for the company in the fiscal year ended December 30, 2023, and what significant factors contributed to this rate?",
        "response": "The effective income tax rate was approximately -7% in the fiscal year ended December 30, 2023. Significant contributing factors included a substantial income tax benefit of $181,410 recognized due to the revaluation of Switzerland deferred tax assets related to an increase in the Schaffhausen cantonal tax rate, and an income tax benefit of $12,116 related to Auto OEM manufacturing tax incentives in Poland.",
        "source": "finqa"
    },
    {
        "query": "Where is the index to the Financial Statements and Supplementary Data located?",
        "response": "The index to the Financial Statements and Supplementary Data is presented in the document.",
        "source": "finqa"
    },
    {
        "query": "What was the proportion of Americas' net revenue to the company's total net revenue in 2023, and how did it change from 2022?",
        "response": "In 2023, Americas' net revenue accounted for 79.3% of the total net revenue, a decrease from 84.1% in 2022.",
        "source": "finqa"
    },
    {
        "query": "What percentage increase was there in segmented income from operations for the Americas from 2021 to 2022?",
        "response": "The segmented income from operations for the Americas increased by 36.7% from 2021 to 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the focus of companies engaged with the Java Platform Enterprise Edition?",
        "response": "The focus of companies engaged with the Java Platform Enterprise Edition is competing with Microsoft's enterprise-wide computing solutions.",
        "source": "finqa"
    },
    {
        "query": "What section follows Item 8 in the document?",
        "response": "The index to Financial Statements and Supplementary Data",
        "source": "finqa"
    },
    {
        "query": "What is the total amount authorized for the repurchase of common stock up to December 2023?",
        "response": "The total amount authorized for the repurchase of common stock up to December 2023 is $7.23 billion.",
        "source": "finqa"
    },
    {
        "query": "What are the key components of the HPE Global Wellness Program?",
        "response": "The key components of the HPE Global Wellness Program are physical health, financial well-being, mental and emotional health, and community well-being.",
        "source": "finqa"
    },
    {
        "query": "How did Ford Pro's EBIT in 2023 compare to the previous year, and what contributed to this change?",
        "response": "Ford Pro's EBIT in 2023 was $7,222 million, showing a substantial increase of $4,000 million from 2022. This improvement was largely due to higher net pricing and lower commodity costs, alongside an increase in wholesales.",
        "source": "finqa"
    },
    {
        "query": "What risks are associated with operating clearing houses and how can they impact the business?",
        "response": "Operating clearing houses carries risks such as defaults by clearing members, market liquidity risks, and risks related to the custody and investment of margin and guaranty fund assets. Defaults or a decrease in the market value of securities held as contributions could lead to substantial losses and weaken confidence in the clearing houses, impacting the business substantially.",
        "source": "finqa"
    },
    {
        "query": "What types of vessels are included in Chevron's operated marine fleet?",
        "response": "Chevron's operated fleet consists of conventional crude tankers, product carriers, and LNG vessels.",
        "source": "finqa"
    },
    {
        "query": "What primarily drove the increase in service fees and other revenue associated with Card Member cross-currency spending?",
        "response": "The increase in service fees and other revenue associated with Card Member cross-currency spending was primarily driven by foreign exchange related revenues.",
        "source": "finqa"
    },
    {
        "query": "How are interchange rates regulated internationally?",
        "response": "Interchange rates are regulated internationally through specific laws like the Dodd-Frank Wall Street Reform and Consumer Act in the U.S., which limits interchange rates for certain debit transactions, and the EU Interchange Fee Regulation (IFR) which sets limits within the European Economic Area. Additionally, central banks such as the Reserve Bank of Australia and the Central Bank of Brazil regulate permissible levels of interchange.",
        "source": "finqa"
    },
    {
        "query": "What was the fair value of Johnson & Johnson Common Stock held in plan assets at the end of 2023 compared to 2022?",
        "response": "$14 million in 2023 and $21 million in 2022",
        "source": "finqa"
    },
    {
        "query": "What firm provided the report on the Consolidated Financial Statements mentioned in a set of financial statements?",
        "response": "PricewaterhouseCoopers LLP",
        "source": "finqa"
    },
    {
        "query": "What caused the operating income of Intuit's Consumer segment to increase by $224 million or 9% in fiscal 2023 compared to fiscal 2022?",
        "response": "The increase in operating income for Intuit's Consumer segment in fiscal 2023 was primarily due to an increase in revenue and lower marketing expenses.",
        "source": "finqa"
    },
    {
        "query": "How can Hilton Honors members use their points?",
        "response": "Hilton Honors members can use their points to book stays, using a flexible payment slider to choose any combination of points and money, and can also transact with strategic partners like American Express, airlines, and car rental companies.",
        "source": "finqa"
    },
    {
        "query": "What does Visa's Management and Analysis section say about comparing fiscal years?",
        "response": "The section discusses fiscal 2023 compared to fiscal 2022 and provides information on fiscal 2022 compared to 2021 in a separate part of the annual report.",
        "source": "finqa"
    },
    {
        "query": "What method does the company use to record stock-based compensation expense?",
        "response": "The company records stock-based compensation expense using the accelerated attribution method.",
        "source": "finqa"
    },
    {
        "query": "How did investment banking revenues at Goldman Sachs change in 2023 compared to 2022, and what factors contributed to this change?",
        "response": "Investment banking revenues at Goldman Sachs were $6.22 billion in 2023, marking a 16% decrease from 2022. This decline was primarily due to significantly lower revenues in advisory, reflecting a substantial drop in industry-wide completed mergers and acquisitions transactions, though this was partially offset by increased revenues from equity underwriting due to higher activity in secondary offerings.",
        "source": "finqa"
    },
    {
        "query": "Where is the Financial Statement Schedule for IBM’s Form 10-K found?",
        "response": "Page S-1",
        "source": "finqa"
    },
    {
        "query": "What actions is the FDIC authorized to undertake upon the insolvency of JPMorgan Chase Bank, N.A.?",
        "response": "Upon insolvency, the FDIC could be appointed as conservator or receiver for JPMorgan Chase Bank, N.A., with broad powers to transfer assets and liabilities without creditor approval.",
        "source": "finqa"
    },
    {
        "query": "What is the significant raw material used by MiTek and how does its supply impact the company?",
        "response": "A significant raw material used by MiTek is hot dipped galvanized sheet steel. Variations in the supply of this material have historically produced significant variations in cost and availability.",
        "source": "finqa"
    },
    {
        "query": "What does Item 15(a)(1) of Part IV in the Annual Report on Form 10-K contain?",
        "response": "It contains the consolidated financial statements and accompanying notes.",
        "source": "finqa"
    },
    {
        "query": "What are the operational effects of productivity improvements detailed by Procter & Gamble?",
        "response": "Productivity improvements enable investments in product and packaging innovation, more efficient supply chains, advertising, and sales and R&D programs expansion. They also help mitigate challenging cost environments, including increasing commodity costs and negative foreign exchange impacts.",
        "source": "finqa"
    },
    {
        "query": "What measures does the Company take to address the risk associated with excess or obsolete inventory?",
        "response": "The Company records a write-down for product and component inventories that have become obsolete or exceed anticipated demand, or for which cost exceeds net realizable value. It also accrues necessary cancellation fee reserves for orders of excess products and components, and reviews long-lived assets for impairment whenever events or circumstances indicate the assets may not be recoverable.",
        "source": "finqa"
    },
    {
        "query": "What are the main responsibilities of the 'Microsoft Security' group within the company?",
        "response": "The 'Microsoft Security' group is responsible for delivering a comprehensive portfolio of services that protect customers' digital infrastructure. This includes cloud platform and application security, data protection and governance, identity and network access, and device management.",
        "source": "finqa"
    },
    {
        "query": "What was the allowance for loan losses on GM Financial’s retail finance receivables portfolio at the end of 2023?",
        "response": "$2.3 billion",
        "source": "finqa"
    },
    {
        "query": "What was the total comprehensive income for Johnson & Johnson in 2023?",
        "response": "$30,412 million",
        "source": "finqa"
    },
    {
        "query": "What is the purpose of Visa according to the overview provided?",
        "response": "to uplift everyone, everywhere by being the best way to pay and be paid",
        "source": "finqa"
    },
    {
        "query": "How is the inclusion of the financial statements in the IBM's Form 10-K described?",
        "response": "They are incorporated by reference.",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources from which the company's insurance and reinsurance operations generate gross revenues?",
        "response": "Premiums and investment income.",
        "source": "finqa"
    },
    {
        "query": "How did Delta Air Lines' total operating expenses change in 2023 compared to 2022?",
        "response": "Total operating expenses increased by $5,606 million, a 12% increase from the previous year.",
        "source": "finqa"
    },
    {
        "query": "What actions is the EPA taking under the 2016 Lautenberg Chemical Safety for the 21st Century Act?",
        "response": "The EPA is moving forward with risk analysis and management of high priority chemicals.",
        "source": "finqa"
    },
    {
        "query": "What method is used to present legal proceedings details in Item 3 of a Form 10-K?",
        "response": "The details are presented through incorporation by reference, redirecting to Note 16 in the Notes to the Consolidated Financial Statements.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage contribution of Bank Deposit Account Fees to net revenues in 2023, and how did it change from 2022?",
        "response": "From 7% in 2022 to 4% in 2023",
        "source": "finqa"
    },
    {
        "query": "By what percentage did sugar futures and options volumes increase in 2023 compared to 2022?",
        "response": "20%",
        "source": "finqa"
    },
    {
        "query": "What supplementary measures does the company use to manage litigation costs beyond self-funding?",
        "response": "The company uses commercial liability insurance policies and, in limited cases, indemnification from third parties to manage litigation costs.",
        "source": "finqa"
    },
    {
        "query": "In which section of the Annual Report on Form 10-K are financial statements and supplementary data typically discussed?",
        "response": "These are typically discussed in Item 8.",
        "source": "finqa"
    },
    {
        "query": "What initiative does the Basel, Rotterdam and Stockholm Conventions focus on?",
        "response": "chemical regulations",
        "source": "finqa"
    },
    {
        "query": "What manufacturing strategy does NVIDIA employ for its products?",
        "response": "NVIDIA employs a fabless manufacturing strategy, relying on key suppliers for all phases of the manufacturing process including wafer fabrication, assembly, testing, and packaging.",
        "source": "finqa"
    },
    {
        "query": "What does HP's Printing segment provide?",
        "response": "HP's Printing segment provides consumer and commercial printer hardware, supplies, services, and solutions, focusing on Graphics, 3D Printing, and Personalization in commercial and industrial markets.",
        "source": "finqa"
    },
    {
        "query": "What types of assets are classified as indefinite-lived intangible assets in this description?",
        "response": "Indefinite-lived intangible assets include routes, slots, the Delta tradename, and assets related to alliances and collaborative arrangements.",
        "source": "finqa"
    },
    {
        "query": "What method does the company use to determine realized gains or losses on the sale of marketable securities?",
        "response": "The company uses a specific identification method to determine realized gains or losses on the sale of marketable securities.",
        "source": "finqa"
    },
    {
        "query": "How much did Delta Air Lines' passenger revenue increase from 2022 to 2023?",
        "response": "$8,691 million",
        "source": "finqa"
    },
    {
        "query": "What factors contribute to disruptions in the supply chain of pharmaceutical products?",
        "response": "Factors such as consolidation in supply chains, labor market issues, international tensions, economic fluctuations, and increased demand for specific products and materials can contribute to supply chain disruptions in the pharmaceutical industry.",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in Humalog revenue from 2022 to 2023?",
        "response": "(19)%",
        "source": "finqa"
    },
    {
        "query": "Where are the majority of the company's cash and cash equivalents domiciled as of March 31, 2023?",
        "response": "In foreign tax jurisdictions",
        "source": "finqa"
    },
    {
        "query": "What contributed to the increase in gross margin in the recent fiscal year?",
        "response": "The increase in gross margin was contributed by higher pricing, manufacturing productivity savings, and partially offset by increased commodity and input material costs, among other factors.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of impairment of goodwill in 2023, and what percentage of net revenues did it represent?",
        "response": "$1,191.2 million, 23.8% of net revenues",
        "source": "finqa"
    },
    {
        "query": "Are the outcomes of these legal issues predictable?",
        "response": "No, the outcomes of legal proceedings, claims, and government investigations are inherently unpredictable.",
        "source": "finqa"
    },
    {
        "query": "What methods does the Company use to encourage appropriate utilization of medical services?",
        "response": "The Company uses contracts with providers for negotiated rates of reimbursement, risk-sharing arrangements that align economic incentives with providers, the development and implementation of guidelines for appropriate utilization, and providing data to providers to improve health care quality.",
        "source": "finqa"
    },
    {
        "query": "How many Canadian provinces did the company operate stores in as of January 28, 2023?",
        "response": "As of January 28, 2023, the company operated stores in five Canadian provinces.",
        "source": "finqa"
    },
    {
        "query": "What sources of financing did the Company use to manage foreign exchange rate risks as of 2023?",
        "response": "Forward foreign exchange contracts and currency swap contracts",
        "source": "finqa"
    },
    {
        "query": "What strategic areas is Intuit focusing on to enhance its AI-driven platform?",
        "response": "Intuit is focusing on connecting customers to experts, unlocking smart money decisions, and being the center of small business growth, among other areas.",
        "source": "finqa"
    },
    {
        "query": "Where can an index to the Financial Statements and Supplementary Data be found in a financial document?",
        "response": "It is presented in Item 8.",
        "source": "finqa"
    },
    {
        "query": "What was the performance result of Delta Air Lines' loyalty program in 2023 compared to 2022?",
        "response": "The revenue from the loyalty program increased by $496 million, a 19% increase from 2022.",
        "source": "finqa"
    },
    {
        "query": "What is the classification and reporting method for long-term investments with maturities greater than twelve months but less than 37 months, excluding those made through the Company’s Impact Investment Fund?",
        "response": "Long-term investments with maturities greater than twelve months but less than 37 months, excluding those made through the Company’s Impact Investment Fund, are classified as available-for-sale and are reported at fair value using the specific identification method.",
        "source": "finqa"
    },
    {
        "query": "What does Note 14 of the Notes to the Consolidated Financial Statements provide information about?",
        "response": "Legal proceedings",
        "source": "finqa"
    },
    {
        "query": "What was the percentage increase in the general and administrative expenses from the fiscal year ending on October 2, 2022, to the fiscal year ending on October 1, 2023?",
        "response": "The general and administrative expenses increased by 2.8% from fiscal year ending October 2, 2022, to fiscal year ending October 1, 2023.",
        "source": "finqa"
    },
    {
        "query": "What is the company's 2040 sustainability ambition?",
        "response": "The company has announced a 2040 net zero ambition.",
        "source": "finqa"
    },
    {
        "query": "How much net proceeds did Kenvue generate from its initial public offering?",
        "response": "$4.2 billion",
        "source": "finqa"
    },
    {
        "query": "What does Part IV Item 15 title 'Exhibits, Financial Statement Schedules' refer to?",
        "response": "It refers to a section that includes both the indexes and detailed schedules related to financial statements.",
        "source": "finqa"
    },
    {
        "query": "What legal tools does the company use to protect its intellectual property?",
        "response": "The company protects its intellectual property through patents, trademarks, copyrights, trade secrets, license agreements, confidentiality agreements, non-disclosure agreements with third parties, employee disclosure and invention assignment agreements, and other contractual rights.",
        "source": "finqa"
    },
    {
        "query": "What was the Annual Subscription Value (ASV) of ICE Global Network offerings as of December 31, 2023?",
        "response": "$1.752 billion",
        "source": "finqa"
    },
    {
        "query": "What previous role did Julie Jacobs hold before becoming Chief Legal Officer and General Counsel at HP?",
        "response": "Senior Executive Vice President, General Counsel and Corporate Secretary of Yahoo",
        "source": "finqa"
    },
    {
        "query": "What was the funded status of the U.S. pension plans as of September 30, 2023, and how does it compare to the previous year?",
        "response": "The funded status of the U.S. pension plans as of September 30, 2023 was $374 million, compared to $297 million in the previous year.",
        "source": "finqa"
    },
    {
        "query": "What was the main reason for the decrease in U.S. dialysis treatments in 2023?",
        "response": "The decrease in U.S. dialysis treatments in 2023 was primarily attributed to fewer treatment days.",
        "source": "finqa"
    },
    {
        "query": "What was the amount of total debt for the company as of June 30, 2023?",
        "response": "The total debt for the company as of June 30, 2023, was $34.6 billion.",
        "source": "finqa"
    },
    {
        "query": "What was the total amount returned to shareholders through dividends and share repurchases by the company in the year ended December 31, 2023?",
        "response": "The company returned a total of $5.3 billion to shareholders through dividends and share repurchases in the year ended December 31, 2023.",
        "source": "finqa"
    },
    {
        "query": "What section of a document might cover 'Financial Statements and Supplementary Data'?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "How has Microsoft addressed racial injustice and inequity for Black and African American communities?",
        "response": "Microsoft has addressed racial injustice and inequity through their Racial Equity Initiative, focusing on improving lives using data, technology, partnerships, strengthening community, increasing representation, and engaging their ecosystem by investing significantly and working with diverse suppliers and partners.",
        "source": "finqa"
    },
    {
        "query": "What were the one-time pilot agreement expenses for Delta Air Lines in 2023?",
        "response": "$864 million",
        "source": "finqa"
    },
    {
        "query": "How is diluted earnings per share (EPS) calculated for Equifax?",
        "response": "Diluted earnings per share (EPS) is calculated to reflect the potential dilution that would occur if stock options or other contracts to issue common stock were exercised and resulted in additional common shares outstanding.",
        "source": "finqa"
    },
    {
        "query": "How are assets and liabilities that are measured at fair value on a nonrecurring basis identified in the financial statements?",
        "response": "Assets and liabilities that are recognized or disclosed at fair value on a nonrecurring basis in the consolidated financial statements include property, plant and equipment, ROU assets, goodwill and other intangible assets, equity and other investments, and other assets. These are measured at fair value if determined to be impaired.",
        "source": "finqa"
    },
    {
        "query": "What type of reinsurance contracts are offered by Berkshire Hathaway Reinsurance Group?",
        "response": "Berkshire Hathaway Reinsurance Group offers treaty and facultative contracts, which are further classified as quota-share or excess reinsurance contracts.",
        "source": "finqa"
    },
    {
        "query": "What changes occurred in the selling, general and administrative expense rate from 2021 to 2022?",
        "response": "The selling, general, and administrative expense rate increased to 23.4% in 2022 from 20.9% in 2021.",
        "source": "finqa"
    },
    {
        "query": "Which section of a financial document covers Financial Statements and Supplementary Data?",
        "response": "Item 8",
        "source": "finqa"
    },
    {
        "query": "What are the primary sources of revenue for the company mentioned in the text?",
        "response": "The primary sources of revenue for the company are advertising on Facebook and Instagram.",
        "source": "finqa"
    },
    {
        "query": "How much were the valuation allowances provided for deferred tax assets related to loss carryforwards as of December 31, 2023?",
        "response": "$498 million",
        "source": "finqa"
    },
    {
        "query": "What are the primary types of businesses that Berkshire Hathaway Inc. owns?",
        "response": "Berkshire Hathaway Inc. primarily owns insurance businesses, a freight rail transportation business, and a group of utility and energy generation and distribution businesses.",
        "source": "finqa"
    },
    {
        "query": "How much of the total future lease payments under operating leases as of December 31, 2023, was allocated for short-term?",
        "response": "$3.2 billion",
        "source": "finqa"
    },
    {
        "query": "What total amount of debt did eBay repay in 2023?",
        "response": "eBay repaid a total of $1.2 billion in debt in 2023.",
        "source": "finqa"
    },
    {
        "query": "Under what sections of the Internal Revenue Code can standalone energy storage technology receive a tax credit?",
        "response": "Sections 48, 48E, and 25D",
        "source": "finqa"
    },
    {
        "query": "What percentage of FedEx-branded cardboard packaging contains recycled content?",
        "response": "36%",
        "source": "finqa"
    },
    {
        "query": "What is the monthly cost of a Connected Fitness Subscription if it includes a combination of a Bike, Tread, Guide, or Row product in the same household as of June 2022?",
        "response": "The monthly cost of a Connected Fitness Subscription that includes a combination of a Bike, Tread, Guide, or Row product in the same household increased to $44 USD in June 2022.",
        "source": "finqa"
    },
    {
        "query": "What brands are used for System-on-Module (SOM) and compute and network acceleration board products?",
        "response": "System-on-Module (SOM) products are branded as Kria, and compute and network acceleration board products are sold under the Alveo and Pensando brands.",
        "source": "finqa"
    },
    {
        "query": "Which markets feature electric vehicles from major automobile manufacturers including those from the U.S., China, and Europe?",
        "response": "Major markets including the U.S., China, and Europe feature electric vehicles from major automobile manufacturers.",
        "source": "finqa"
    },
    {
        "query": "How much did total revenues increase in 2023 compared to the previous year?",
        "response": "$8.2 billion",
        "source": "finqa"
    },
    {
        "query": "What does Item 3 in the report reference for more detailed information on legal proceedings?",
        "response": "Note 20 in Item 8",
        "source": "finqa"
    },
    {
        "query": "What is presented in Item 8 according to Financial Statements and Supplementary Data?",
        "response": "The index to Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "What was the cost of the capped call transactions entered into in 2021?",
        "response": "approximately $100 million",
        "source": "finqa"
    },
    {
        "query": "What comprehensive solutions does the company provide for the AI market?",
        "response": "The company provides a complete, end-to-end accelerated computing platform for deep learning and machine learning, which includes GPUs, interconnects, systems, CUDA programming language, algorithms, libraries, and other software.",
        "source": "finqa"
    },
    {
        "query": "How much interest income did GameStop receive in the presented financial period?",
        "response": "GameStop received $8.2 million in interest income.",
        "source": "finqa"
    },
    {
        "query": "Where can details related to the legal proceedings be found in the report?",
        "response": "In the \"Contingencies\" section under Note 15 to the consolidated financial statements.",
        "source": "finqa"
    },
    {
        "query": "How did the change in diluted net earnings per common share from 2022 to 2023 compare to the change in net earnings for Procter & Gamble?",
        "response": "While net earnings for Procter & Gamble decreased slightly from 2022 to 2023, diluted net earnings per common share increased by 2% over the same period.",
        "source": "finqa"
    },
    {
        "query": "How has CVS Health's operating model realignment impacted its business segments?",
        "response": "CVS Health's operating model realignment in 2023 resulted in the formation of new business segments including the Health Services segment, which offers pharmacy benefit management and health care services, and the Pharmacy & Consumer Wellness segment, which includes retail and long-term care pharmacy operations.",
        "source": "finqa"
    },
    {
        "query": "What was the total cash, cash equivalents, and short-term investments as of December 30, 2023?",
        "response": "$5.8 billion",
        "source": "finqa"
    },
    {
        "query": "What was the reported amount of cash and cash equivalents held by Chipotle Mexican Grill, Inc. as of December 31, 2023?",
        "response": "$560,609",
        "source": "finqa"
    },
    {
        "query": "Can the content of Item 8 be directly accessed in the document?",
        "response": "No, Item 8 references to get the information from Item 15(a).",
        "source": "finqa"
    },
    {
        "query": "What are the expected industry challenges that HP Inc. faces?",
        "response": "HP Inc. faces challenges related to the macroeconomic environment impacting product demand, changes in the competitive landscape, and business model transformations in a shifting distribution and reseller landscape.",
        "source": "finqa"
    },
    {
        "query": "What is the company's perspective on the impact of the legal proceedings on its financial condition?",
        "response": "The company believes that the current legal proceedings are not material to its financial condition.",
        "source": "finqa"
    },
    {
        "query": "Where can a description of the Firm's material legal proceedings be found?",
        "response": "Note 30",
        "source": "finqa"
    },
    {
        "query": "What type of data is found in Item 8 of detailed financial documentation?",
        "response": "Financial Statements and Supplementary Data.",
        "source": "finqa"
    },
    {
        "query": "How does CARB enforce its ZEV mandates and what consequence faces non-compliance?",
        "response": "CARB has enforced ZEV mandates that incrementally increase the percentage of ZEVs sold, with substantial penalties for non-compliance, potentially leading to monetary fines.",
        "source": "finqa"
    },
    {
        "query": "How does Walmart measure the results of its business segments?",
        "response": "Walmart measures the results of its business segments using each segment's operating income, including specific corporate overhead allocations, along with other performance metrics.",
        "source": "finqa"
    },
    {
        "query": "How are adjustments to depreciation on vehicles subject to operating leases determined by Ford Credit?",
        "response": "Ford Credit revises depreciation based on its evaluation of expected residual values for the vehicles. If the expected residual values change, they adjust the depreciation on a straight-line basis to reflect the revised estimates.",
        "source": "finqa"
    },
    {
        "query": "What was the total revenue for the year 2023 and the percentage increase from 2022?",
        "response": "The total revenue for the year 2023 was $134.90 billion, marking a 16% increase from 2022.",
        "source": "finqa"
    },
    {
        "query": "What are the primary use cases for prepaid cards as described by Visa?",
        "response": "Prepaid cards cater to a range of needs including general purpose reloadable, payroll, government and corporate disbursements, healthcare, gift, and travel.",
        "source": "finqa"
    },
    {
        "query": "What was the total approximate area of casinos and gaming areas that reverted to the ownership of the Macao government after VML's subconcession expired on December 31, 2022?",
        "response": "Approximately 136,000 square meters",
        "source": "finqa"
    },
    {
        "query": "As of the report's date, how does the company view the necessity of disclosing pending legal proceedings?",
        "response": "As of the date of the report, the company does not believe that any pending legal proceedings to which they or their subsidiaries are subject need to be disclosed as material legal proceedings.",
        "source": "finqa"
    },
    {
        "query": "What services does Iron Mountain provide to protect organizations' information and reduce storage costs?",
        "response": "Iron Mountain provides services such as storing physical records and data backup media, offering information management solutions, and providing data center space for enterprise-class colocation and hyperscale deployments.",
        "source": "finqa"
    },
    {
        "query": "What were the main factors contributing to the increase in consolidated operating profit in 2023?",
        "response": "The increase was primarily due to favorable price realization, higher sales volume and the absence of a 2022 goodwill impairment charge related to the Rail division.",
        "source": "finqa"
    },
    {
        "query": "What method is used to calculate depreciation for leasehold improvements, property, and equipment?",
        "response": "Depreciation for leasehold improvements, property, and equipment is calculated using the straight-line method over the estimated useful lives of the assets.",
        "source": "finqa"
    },
    {
        "query": "What were the total matching contributions made by Intuit Inc. for its 401(k) Plan in 2023, 2022, and 2021?",
        "response": "$136 million in 2023, $118 million in 2022, and $80 million in 2021",
        "source": "finqa"
    },
    {
        "query": "What is Meta's approach to managing its health and well-being programs?",
        "response": "Meta's health and well-being programs are designed to offer employees a choice of flexible benefits that support their personal well-being goals, focusing on physical and mental health, financial peace of mind, family support, and community building.",
        "source": "finqa"
    },
    {
        "query": "How much did the U.S. Dollar weaken against the Polish Zloty in fiscal 2023 leading to a gain of $24.4 million?",
        "response": "12.3%",
        "source": "finqa"
    },
    {
        "query": "How is a membership's territory determined according to the description?",
        "response": "A membership's territory is determined based on the geographic location used at the time of sign-up, as determined by the company's internal systems using geo-location technology.",
        "source": "finqa"
    },
    {
        "query": "How much was the depreciation and amortization expense for property and equipment in 2023?",
        "response": "The depreciation and amortization expense for property and equipment in 2023 was $23.7 million.",
        "source": "finqa"
    },
    {
        "query": "What are the different types of partnerships that facilitate the sales of the company's products and services?",
        "response": "The company partners with independent software vendors, systems integrators, and advisory firms to facilitate the sales of its products and services. These partners integrate the company's offerings with their own products and services, provide specialized software products, offer expertise in IT solution design and implementation, and deliver management and IT consulting services.",
        "source": "finqa"
    },
    {
        "query": "What was the net cash provided by operating activities for 2023 and how did it compare to 2022?",
        "response": "Net cash provided by operating activities was $712.2 million for 2023, an increase compared to $223.7 million in 2022.",
        "source": "finqa"
    },
    {
        "query": "What intellectual property protections does Enphase Energy, Inc. utilize?",
        "response": "Enphase Energy, Inc. protects its technology through patents, trademarks, copyright, and trade secrets laws in the United States and similar laws in other countries, along with confidentiality agreements and other contractual arrangements.",
        "source": "finqa"
    },
    {
        "query": "How are unpaid losses and loss expenses calculated in the financial statements of an insurance and reinsurance company?",
        "response": "Unpaid losses and loss expenses are calculated based on estimated unpaid portions of liabilities for losses under insurance policies and agreements, considering reported but unpaid claims (case reserves), and claims incurred but not reported (IBNR). This process involves significant judgment and estimation, and the reserves are not discounted for time value of money except for structured settlements and certain claims where timing and amount are predictable.",
        "source": "finqa"
    },
    {
        "query": "What was the operating income for Google Cloud in 2023?",
        "response": "$1.7 billion",
        "source": "finqa"
    },
    {
        "query": "What is the total amount of property, plant, and equipment, net, reported by the company for the fiscal year 2023?",
        "response": "$19,898 million",
        "source": "finqa"
    }
]