[
    {
        "query": "Innocent Pictures ApS is a Danish independent film company founded in 2001, originally as a subsidiary of Lars von Trier's film company Zentropa, which is best known for the production of the erotic feature film, All About Anna is a Danish film released in which year, directed by Jessica Nilsson?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1994 crime-thriller produced by Lawrence Turman?",
        "response": "Curtis Hanson",
        "source": "hotpot_qa"
    },
    {
        "query": "UPA was an animation studio that created the 1962 film musical that gave who her only animated film voice role?",
        "response": "Judy Garland",
        "source": "hotpot_qa"
    },
    {
        "query": "The melody of \"Baubles, Bangles & Beads\"  was based on works by a composer that died in what year?",
        "response": "1887",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in her final film role in the 1964 film directed by the man who also did Vera Cruz and Kiss Me Deadly?",
        "response": "Mary Astor",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Zhucheng and Suining both county-level cities?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Aram Avakian and David Wall both actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Death of Cook depicts the death of James Cook at a bay on what coast?",
        "response": "Kona coast",
        "source": "hotpot_qa"
    },
    {
        "query": " What is the title of the memoir written by the honoree of the Black and White Ball?",
        "response": "Personal History",
        "source": "hotpot_qa"
    },
    {
        "query": "Dodo bird verdict was named after which fictional character from Chapters 2 and 3 of Alice in Wonderland?",
        "response": "Dodo",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Simon Wincer and Patrice Leconte film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who portrayed the character in \"Criminal Minds\" that quit in \"The Boogeyman\"?",
        "response": "Lola Glaudini",
        "source": "hotpot_qa"
    },
    {
        "query": "Nico di Biase plays for the soccer league that has how many teams?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "Dresser Industries, merged in 1998 with its main rival, what American multinational corporation, that is one of the world's largest oil field service companies?",
        "response": "Halliburton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American plant species, Liquidambar or Claytonia, is also native to northeastern Asia?",
        "response": "Claytonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Frank Fertitta Jr was the founder of Station Casinos based in what county?",
        "response": "Clark County",
        "source": "hotpot_qa"
    },
    {
        "query": "Current European Commisioner for Competition, Margrethe Vestager, served under what political party from 2002-2014?",
        "response": "Radikale Venstre",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chaplain of the Austrian branch of the Order of the Golden Fleeze, serves as what?",
        "response": "He serves as the Archbishop of Vienna and President of the Austrian Bishops' Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "what does Sodomy and Anal sex have in common?",
        "response": "sexual activity",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Gale co-wrote famously a movie starring Michael J. Fox was which character?",
        "response": "Marty McFly",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chamizal dispute was caused by a shift in which one of the principal rivers in the southwest United States and northern Mexico?",
        "response": "Rio Grande",
        "source": "hotpot_qa"
    },
    {
        "query": "Base was the first EP by the singer-songwriter from which boy band?",
        "response": "Shinee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founding member of U-FLY Alliance is based in New North Zone, Chongqing, People's Republic of China?",
        "response": "West Air",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Liberian President born who tried to eliminate Roosevelt Johnson?",
        "response": "28 January 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these is has more episodes/books in the series, Storm Rider Clash of the Evils or Pettson and Findus?",
        "response": "Pettson and Findus",
        "source": "hotpot_qa"
    },
    {
        "query": "Royal Italian Navy had submarines built, and named them for Italian colonies, such as Italian East Africa, which was Italian colony located where?",
        "response": "Horn of Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the second most penalized brawl in the NBA?",
        "response": "Madison Square Garden",
        "source": "hotpot_qa"
    },
    {
        "query": "What year saw the founding of the baseball team where Hal McRae played from 1973-87?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hamasa Shrine Temple Theater houses one of only two Robert Morton theatre organs, with the other at the Saenger Theater in a city primarily in Forrest County with a population at the 2010 census of what? ",
        "response": "45,989",
        "source": "hotpot_qa"
    },
    {
        "query": "What modern countries border the ancient territory of the Kinambroi?",
        "response": "Albania and Montenegro",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Field of Dreams\" character is comparable to hockey's Christian Soucy?",
        "response": "Moonlight Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "Say Say Say, released in 1983, was written and performed by which two artists?",
        "response": "Paul McCartney and Michael Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "The New American Story is a book written by former United States Senator and who, which 2000 presidential hopeful, and an American former professional basketball player and politician?",
        "response": "Bill Bradley",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth day of the the Irish rugby union player who competed in the Pro14?",
        "response": "22 December 1993",
        "source": "hotpot_qa"
    },
    {
        "query": "California Suite is a 1976 play by an american playwright born in what year?",
        "response": "1927",
        "source": "hotpot_qa"
    },
    {
        "query": "Which character in William Shakespeare's \"Macbeth\" is Lady Macduff  the wife of ",
        "response": "Lord Macduff",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mine was established earlier, Murray Brook Mine or Temagami-Lorrain Mine?",
        "response": "Temagami-Lorrain Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Freebairn appeared on the weeknight program that was on what Australian TV network?",
        "response": "Network Ten",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American college and professional football player who held the franchise record in rushing before Barry Sanders passed him in 1992?",
        "response": "Billy Sims",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created this American apocalyptic supernatural action television series in which Christopher Egan played Alex Lannon?",
        "response": "Vaun Wilmott",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film parodied by Enteng the Dragon?",
        "response": "Robert Clouse",
        "source": "hotpot_qa"
    },
    {
        "query": "Aerangis and Satureja can both be found on which continent?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Just a Lil Bit\" is the third single from 50 Cent's second album, \"The Massacre\", released on which date?",
        "response": "March 3, 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor playing Father Gabriel Stokes was born when?",
        "response": "November 5, 1968",
        "source": "hotpot_qa"
    },
    {
        "query": "How long does the fall festival at the place formerly known as MOSI last?",
        "response": "eleven days",
        "source": "hotpot_qa"
    },
    {
        "query": "Vertical Horizon and Wheatus, are of which nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which national park was recognized first, Garajonay National Park or Guadarrama National Park?",
        "response": "Garajonay National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Buster Bloodvessel and Jonathan Davis both frontmen for their respective bands?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Evan Williams played for what professional football club that was originally known as St. Luke's FC?",
        "response": "Wolverhampton Wanderers Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "An Opera House in San Francisco, California is located on the western side of Van Ness Avenue across from the rear facade of City Hall was the opera house that held the first performance of Elegy, who performed Elegy?",
        "response": "San Francisco Symphony",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the album by Monument/Columbia Records released with the Song Travelin Soldier on it?",
        "response": "2002",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of Codename: Kids Next Door also served as production design for what series?",
        "response": "Beavis and Butt-Head",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game allows the most players to participate, Mad Gab or Blokus?",
        "response": "Mad Gab",
        "source": "hotpot_qa"
    },
    {
        "query": "In what English district is the town Digby, Victoria may be named after?",
        "response": "North Kesteven, Lincolnshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What U.S. Army division, referred to as  is the focus of Bravo Company, a 1998 Vietnam War memoir by Robert Hemphill, the commander of this division?",
        "response": "25th Infantry Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy Anthony Barnett a former American football defensive lineman in the National Football League manages an amazing group of teammates at an American company that manufactures footwear, sports and casual apparel headquartered where? ",
        "response": "Baltimore, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the president died during who's presidency The Dance of the Forty-One scandal occurred?",
        "response": "2 July 1915",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did Vyacheslav Senchenko represent in boxing?",
        "response": "Ukraine",
        "source": "hotpot_qa"
    },
    {
        "query": " Ballad for Americans is a studio album of phonograph records by an American singer and actor whose sold how many records, tapes, compact discs and digital downloads?",
        "response": "over one billion",
        "source": "hotpot_qa"
    },
    {
        "query": "What professions did Bob Marley and Eric Bloom have in common?",
        "response": "singer, songwriter and musician",
        "source": "hotpot_qa"
    },
    {
        "query": "which hospital Children's National Medical Center or George Washington University Hospital has more beds?",
        "response": "George Washington University Hospital",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the careers of Luigi Cherubini and Leoš Janáček?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What Monteverdi ballet was first performed in Lombardy, Italy? ",
        "response": "Il ballo delle ingrate",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of birth of the woman who inspired the opera Midnight Son?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Qianzhousaurus was first mentioned in a journal published by which publishing group ?",
        "response": "Nature Publishing Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Which sports is Alex O'Brien and Marc Rosset related to ?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "Princess Ozma lives in the fictional City of Thi in which L. Frank Baum book?",
        "response": "\"The Lost Princess of Oz\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Barrie Ciliberti is a professor at a unviersity located in what county?",
        "response": "Prince George's County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manufactures small arms ammunition for the British armed forces?",
        "response": "ROF Radway Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Gatti's Pizza and MOD Pizza, are located in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Who sang \"The Trouble with Love Is\" and has had vocals compared to the singer who rose to fame with the release of \"Vision of Love\"?",
        "response": "Kelly Clarkson",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the American voice actor born who played the voice of Harold Kelp?",
        "response": "June 27, 1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the producer of the 2002 British action horror film written and directed by Neil Marshall, and starring Kevin McKidd, Sean Pertwee and Liam Cunningham?",
        "response": "Christopher Figg",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Death on the Nile and Mia Farrow have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the position in the Wehrmacht of the deputy head of the counter-espionage bureau in the Abwehr who worked with Otto Armster?",
        "response": "general",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Naperville Central High School quarterback, became the 1988 starting quarterback for the Leicester Panthers?",
        "response": "Patrick Sean Payton",
        "source": "hotpot_qa"
    },
    {
        "query": "For what edition of the UEFA European Championship is Elkhan Mammadov spearheading a bid for Baku?",
        "response": "16th edition",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a Japanese anime series and the sixth \"Pretty Cure\" installment by Izumi Todo, Otra Película de Huevos y un Pollo or Fresh Pretty Cure! ?",
        "response": "Fresh Pretty Cure!",
        "source": "hotpot_qa"
    },
    {
        "query": "\"This Ole House\" topped the UK chart in 1981 in a recording by a platinum-selling British rock and roll singer whose recording and performing career began when? ",
        "response": "in the late 1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "Hannah Arterton starred in the musical Walking on Sunshine which was also the debut role for what singer-songwriter?",
        "response": "Leona Lewis",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the theatre established where Leonid Kmit was later invited to join in 1936?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "Clinton v. Jones and Baker v. Carr were both court cases that took place in what United States court?",
        "response": "Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Republican has represented the district in which Wilkins Township, Allegheny Count, Pennsylvania resides?",
        "response": "Tim Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "The Energia Lunar Expedition was a project during 1988 to create a lunar base using the Energia booster, initiated by which Soviet engineer, and designer of rocket engines during the Soviet/American Space Race?",
        "response": "Valentin Petrovich Glushko",
        "source": "hotpot_qa"
    },
    {
        "query": "which actress met the prime minister of Gordon at the head quarters of the government of the United Kingdom whose debut album is named faryl released in 2009?",
        "response": "British mezzo-soprano Faryl Smith",
        "source": "hotpot_qa"
    },
    {
        "query": " Hurricane Keith weakened to a tropical storm, before another landfall occurred near a city with a population of what?",
        "response": "57,169",
        "source": "hotpot_qa"
    },
    {
        "query": "The pavilion where the film Circle of Life: An Environmental Fable is shown opened on what date?",
        "response": "October 1, 1982",
        "source": "hotpot_qa"
    },
    {
        "query": " Mario Testino OBE has also created images for brands such as Gucci, Burberry, Versace, Michael Kors, Chanel,  Carolina Herrera, Estée Lauder, Lancôme, and Stuart Weitzman, often credited with making what?",
        "response": "expensive shoes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a punk rock musician, John Mayer or Ben Weasel?",
        "response": "Ben Weasel",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this American television crime drama mystery series that aired on Showtime from 2006 to 2013, where Hello, Dexter Morgan was the 11th episode of the 4th season?",
        "response": "Dexter",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original purpose of the site, used now as a studio, where a hologram of Paul Harris is a permanent feature ?",
        "response": "aircraft factory and airfield",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ameican Jazz saxophonist nicked named the \"Hawk\", once played with what musician who died in 2009 and once played with Johnny Carson during Carson's residency?",
        "response": "Shep Meyers",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gerard Way and Saffron both singers and songwriters?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did Cristian Dario Alvarez play for the Spanish football team based in Zaragoza?",
        "response": "as a goalkeeper.",
        "source": "hotpot_qa"
    },
    {
        "query": "Hotride is the fifteenth single released by what music group from Braintree, Essex, that was formed in 1990?",
        "response": "The Prodigy",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the man married to Jaclyn Smith when Victoria Winters was written of the show \"Dark Shadows\" born?",
        "response": "1939",
        "source": "hotpot_qa"
    },
    {
        "query": " Teri W. Odom is a member of a scientific journal first published in 2007 by who?",
        "response": "the American Chemical Society",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the miles of road which Kirkby la Thorpe village is near the start of ",
        "response": "62 miles",
        "source": "hotpot_qa"
    },
    {
        "query": "Trisha Silvers' husband played for what football club?",
        "response": "Melbourne Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Sir David Mark Rylance Waters, is an English actor, theatre director, and playwright his film appearances include Prospero's Books a 1991 British avant-garde film adaptation of William Shakespeare's \"The Tempest\", written and directed by ?",
        "response": "Peter Greenaway",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed the 2002 horror film Hunting Humans which was found among the possessions of murderer Adam Leroy Lane?",
        "response": "Kevin Kangas",
        "source": "hotpot_qa"
    },
    {
        "query": "Lunic's album Future Sex Drama is similar to which English indie pop band formed in 2005?",
        "response": "The xx",
        "source": "hotpot_qa"
    },
    {
        "query": "Kara Louise Tointon, is an English actress, and is known for playing who, in the ITV live production of \"The Sound of Music Live\"?",
        "response": "Maria",
        "source": "hotpot_qa"
    },
    {
        "query": "Donna Gigliotti is an American film producer who produced a 2008 German-American romantic drama film that was written by David Hare and directed by who?",
        "response": "Stephen Daldry",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast in a 1937 British romantic drama film directed by Raoul Walsh was born in Larne, County Antrim, in present-day Northern Ireland?",
        "response": "Valerie Hobson",
        "source": "hotpot_qa"
    },
    {
        "query": "A waltz, is dance music in triple meter, often written in time, probably deriving from which German word, and is a folk dance in time which was popular in Austria, south Germany, German Switzerland, and Slovenia at the end of the 18th century?",
        "response": "Ländler",
        "source": "hotpot_qa"
    },
    {
        "query": "What American statesman and a retired four-star general in the United States Army has attended events at the Southern Center for International Studies? ",
        "response": "Colin Powell",
        "source": "hotpot_qa"
    },
    {
        "query": "Yahya Al Bishri has designed garments for a King who passed away in which year ?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cavaliers–Warriors rivalry is a National Basketball Association (NBA) rivalry between the Cleveland Cavaliers and the Golden State Warriors, the two teams feature 11 NBA All-Stars, including which American professional basketball player, and was named an NBA All-Star and All-NBA Team member the following two seasons?",
        "response": "Draymond Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the Dallas team is a member of the Nation Football Conference located?",
        "response": "Dallas metropolitan area",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Transylvanian Hound and Pumi dog origin in from which country?",
        "response": "Hungary",
        "source": "hotpot_qa"
    },
    {
        "query": "Which UFC weight division did Chris Leben and Anderson Silva compete in?",
        "response": "Middleweight",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is situated in a more populous region? Petersburg James A. Johnson Airport or Lehigh Valley International Airport?",
        "response": "Lehigh Valley International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "6 Interpretations included the songwriter who performed in what band from 1985 to 1995?",
        "response": "Requiem in White",
        "source": "hotpot_qa"
    },
    {
        "query": "What is it called when a piece of media is altered from its original state like when Bubba Sparxxx was featured in the song Oops?",
        "response": "Remix",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the convention center in which the first prototype models of the BluOnyx were first demonstrated? ",
        "response": "Las Vegas Convention Center",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the foreign born victim of Singapore's caning punishment before Oliver Fricker experienced the same?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people were abord the flight that Umar Farouk Abdulmutallab attempted to bomb in 2009?",
        "response": "290",
        "source": "hotpot_qa"
    },
    {
        "query": "KAKU-LP (88.5 FM, \"The Voice of Maui County\") is a low-power FM radio station broadcasting a variety format, licensed to Kahului, Hawaii, United States, the station is currently owned by Maui County Community Television, Kahului is a census-designated place (CDP) in which county, on the island of Maui?",
        "response": "Maui County",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the character played by the son of veteran comedians and actors Jerry Stiller and Anne Meara in the film Tower Heist?",
        "response": "Josh Kovaks",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Shine\" is a song that has lyrics that revolve around which fictional character in children's literature?",
        "response": "Paddington Bear",
        "source": "hotpot_qa"
    },
    {
        "query": "From which alphabet was this alphabet derived that the name of the club Ilysiakos B.C. has the starting letter of?",
        "response": "Phoenician alphabet",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did camera work on the show that the Indian composer born on May 31, 1927 worked on?",
        "response": "Jehangir Chowdhury",
        "source": "hotpot_qa"
    },
    {
        "query": "Lauri Markkanen was traded for which player who was born in Houston?",
        "response": "Jimmy Butler III",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player is older, Paul Haarhuis or Jana Novotná?",
        "response": "Paul Vincent Nicholas Haarhuis",
        "source": "hotpot_qa"
    },
    {
        "query": "Bat Country peaked at #20 on the list of which hard rock and heavy metal magazine's Top 21st Century Hard Rock Songs?",
        "response": "Loudwire",
        "source": "hotpot_qa"
    },
    {
        "query": "The Stanbic Bank Twenty20 formerly known as the Metropolitan Bank Twenty20 is the domestic Twenty20 cricket competition in Zimbabwe, recently, the tournament has risen in profile with some high-quality cricket, and the attraction of major international stars such as which former Australian cricketer, who recently retired from all three formats of the game, and played in the Big Bash League for the Hobart Hurricanes? ",
        "response": "Shaun Tait",
        "source": "hotpot_qa"
    },
    {
        "query": "Korean actress Shin Min-a starred in Oh My Venus and what other television dramas?",
        "response": "A Love to Kill",
        "source": "hotpot_qa"
    },
    {
        "query": "where is the headquarters of the  Chinese investment holding company  who developed WeChat ",
        "response": "Nanshan District, Shenzhen.",
        "source": "hotpot_qa"
    },
    {
        "query": "Frederick Steven \"Freddie\" Roach, is an American boxing trainer and former professional boxer, and is the enduring boxing coach of top prospect Peter Quillin, an American professional boxer who held the WBO middleweight title, from which span of years?",
        "response": "2012 to 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2000 movie starring a veteran of NBC's \"Saturday Night Live\" was promoted using fictionalized reviews attributed to \"David Manning\"?",
        "response": "The Animal",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Helenium and Orychophragmus both annuals?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The city where Benton County State Bank Building is in had a population of what as of the 2010 United States Census?",
        "response": "54,462",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the book that Peggy Robertson's 1948 movie is based on?",
        "response": "Helen Simpson",
        "source": "hotpot_qa"
    },
    {
        "query": "What NBA team did the person who played forward on 2007–08 Duke Blue Devils men's basketball team play on?",
        "response": "Oklahoma City Thunder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  fictional character from the sitcoms \"Good Morning, Miss Bliss\" did  Mark-Paul Gosselaar play ",
        "response": "Zack Morris",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was this child actress, who proceeded Janet Burston as the leading lady in \"Our Gang\", born?",
        "response": "Leedey, Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the cult shows created by Eric Fogel was produced by Tornante Animation in association with Cuppa Coffee Studios and Rogers Communications?",
        "response": "Glenn Martin, DDS",
        "source": "hotpot_qa"
    },
    {
        "query": "In what BART District is Bayfair Center located?",
        "response": "BART District 3",
        "source": "hotpot_qa"
    },
    {
        "query": "Ruth Higham is a former \"Page 3\" girl,that modelled for which British tabloid newspaper?",
        "response": "\"The Sun\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What structure under the Hudson River did Mark di Suvero have his sculpture Joie de Vivre placed?",
        "response": "The Holland Tunnel",
        "source": "hotpot_qa"
    },
    {
        "query": "Little Finland has a landscape similar to a state park in what Nevada city?",
        "response": "Overton",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryant, Oklahoma is a nation made up of which federally recognized tribe?",
        "response": "Muscogee",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor born in 1988 stars in a 2014 Telugu drama film directed by Bharathi Ganesh?",
        "response": "Yami Gautam",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  South Korean singer-songwriter  who is a member of , 2PM born ",
        "response": "January 25, 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "At which University will you find a varsity intercollegiate athletic team known as the Flashes who played their first game in 1920 and whose head coach Paul Haynes since December 2012 has been assistant coach and a former player with stints as defensive coordinator at the University of Arkansas? ",
        "response": "Kent State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1916 tone poem was composed by the husband of Elsa Respighi?",
        "response": "Fountains of Rome",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film came out first Dumbo or The Country Bears ?",
        "response": "Dumbo",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the official position of this American career diplomat who died during the attack in which Ahmed Abu Khattala participated in 2012?",
        "response": "U.S. Ambassador to Libya",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Canadian retired professional ice hockey defenceman who played for nine teams in the National Hockey League, who had a Canadian ice hockey executive currently serving as Senior Advisor to the President-General Manager of the New York Rangers negotiated the playing and marketing contract?",
        "response": "Paul Douglas Coffey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Athyrium or Diploglottis?",
        "response": "Athyrium",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the band formed in 2015 by JYP Entertainment through the reality show \"Sixteen\". How many tracks are on the reissue of their third album?",
        "response": "13",
        "source": "hotpot_qa"
    },
    {
        "query": "Which metal band from Melbourne, Victoria released their debut studio album through Volkanik Music on November 13, 2012?",
        "response": "Twelve Foot Ninja",
        "source": "hotpot_qa"
    },
    {
        "query": "Costas Menegakis is a member of a political party colloquially known by what name?",
        "response": "the Tories",
        "source": "hotpot_qa"
    },
    {
        "query": "Would you find the Almond plant and Aloinopsis in alaska?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the psychic, artist, and author died along with whom  McMoneagle is best known for claims surrounding the investigation of RV?",
        "response": "31 January 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the 1958 movie starring Sofia Costanza Brigida Villani Scicolone set?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Cinco paul and Ken daurio Dr. Seuss' The Lorax",
        "response": "2012",
        "source": "hotpot_qa"
    },
    {
        "query": "What wars did the division of which Steven N. Wickstrom is a commander serve in?",
        "response": "World War I, World War II and the Global War on Terrorism",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1974–75 Seattle SuperSonics season included which former Boston Celtics center as head coach?",
        "response": "William Felton Russell",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mazda Familia, also marketed prominently as the Mazda 323 and Mazda Protegé, was a small family car that was manufactured by Mazda between 1963 and 2003, the Familia line was replaced by the Mazda3/Axela for 2004, a compact car manufactured in which country, by Mazda?",
        "response": "Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who opened Dorin Park Special School and former football player?",
        "response": "Phil Neville",
        "source": "hotpot_qa"
    },
    {
        "query": "The Prussian General Carl von Clausewitz is associated with what type of realism?",
        "response": "Modern thinkers associated with classical realism are Carl von Clausewitz",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Egyptian method actor regarded as one of the most influential and important actors of Egyptian cinema?",
        "response": "Zaki Rostom",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Monte Porzio (also called the Battle of Tusculum) was fought on 29 May 1167 between the Holy Roman Empire and the Commune of Rome, comparing its effect on the city of Rome, one historian has been called Monte Porzio the \"Cannae of the Middle Ages\",which major battle of the Second Punic War that took place on 2 August 216 BC in Apulia, in southeast Italy, is called?",
        "response": "Battle of Cannae",
        "source": "hotpot_qa"
    },
    {
        "query": "Fort Qualls refers to an encampment that supported a president born in which year ?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": " An Annapolis Story stars which American stage, film, and television actor born on February 15, 1914?",
        "response": "Kevin McCarthy",
        "source": "hotpot_qa"
    },
    {
        "query": "Igor Naming Agency named a resort located where?",
        "response": "Las Vegas Strip",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first, \"Bambi\" or \"Underdog\"?",
        "response": "Bambi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has a larger population, Hays, Kansas or Ellis County, Kansas?",
        "response": "Ellis County, Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "What seventh studio album is recorded by American rapper Pitbull.",
        "response": "Global Warming",
        "source": "hotpot_qa"
    },
    {
        "query": "Sumner, New Zealand was named in 1849 in honour of an Archbishop born in which year?",
        "response": "1780",
        "source": "hotpot_qa"
    },
    {
        "query": "Day One starring David Strathairn as Dr. J. Robert Oppenheimer is a docu-drama movie about what research and development of the atomic bomb during WWII?",
        "response": "The Manhattan Project",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was not born in the United States, Akim Tamiroff or Mark Hoplamazian?",
        "response": "Akim Mikhailovich Tamiroff",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the person, who was executed a day after William Joyce was hanged for treason in 1946, born? ",
        "response": "5 May 1918",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2013 Spengler Cup were played at this Swiss ice hockey club's home, known as what?",
        "response": "Vaillant Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which region did this son of Marion Kozak and British politician who was Leader of the Labour Party and Leader of the Opposition in the 2010s, represent as Member of Parliament in 2005?",
        "response": "Doncaster North",
        "source": "hotpot_qa"
    },
    {
        "query": "Jaroslawa Mirowska spied on which party?",
        "response": "Nazi Party",
        "source": "hotpot_qa"
    },
    {
        "query": "Anthony Jung currently plays for Brondby on loan from what German association football club that is based in Leipzig, Saxony?",
        "response": "RB Leipzig",
        "source": "hotpot_qa"
    },
    {
        "query": "Curt Weldon represented the congressional district that involved which major city's suburbs?",
        "response": "Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "On what date was the album released on which \"Rock is Dead\" is a single?",
        "response": "September 14, 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "the NASA space radiation Laboratory and the National Weather Service weather forecast office are both located in what part of New York?",
        "response": "Long Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Which material was created by Leo Baekeland and makes up the door handles at the Tivoli Theatre?",
        "response": "Bakelite",
        "source": "hotpot_qa"
    },
    {
        "query": "Knoxville: Summer of 1915 is a work for voice and orchestra by what American composer of orchestral, opera, choral, and piano music, who is one of the most celebrated composers of the 20th century?",
        "response": "Samuel Osborne Barber II",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the main campus of university to which Excel Engineering College was affiliated located? ",
        "response": "Guindy, Chennai",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Shin Hyun-joon in the successful South Korean comey sequel?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a transportation themed comdey film staring Steve Martin?",
        "response": "John Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Days of Our Nights includes a cover of what Guns N Roses hit Released in August 1988 .",
        "response": "Sweet Child o' Mine",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original release name of the movie for which Carlo Savina arranged, and conducted music, adapted from the novel \"The Grizzly King\"?",
        "response": "L'Ours",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the 2014 film Camp X-Ray, which starred a leading Twilight actress, debut?",
        "response": "Sundance Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the production company for Kal Ho Naa Ho based?",
        "response": "Mumbai",
        "source": "hotpot_qa"
    },
    {
        "query": "Which astronaut went up in space first, Samantha Cristoforetti or Mirosław Hermaszewski?",
        "response": "Mirosław Hermaszewski",
        "source": "hotpot_qa"
    },
    {
        "query": "The Central European monarchy of which Johann Rudolf, Count Chotek of Chotkow and Wognin was Government President was the predecessor of what modern country?",
        "response": "Czech Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band had more members, The Why Store or Tegan and Sara?",
        "response": "The Why Store",
        "source": "hotpot_qa"
    },
    {
        "query": "Mickaël-Méba Zeze broke the French Youth Record for the 200m dash formerly held by the first white man to break 10 seconds in the 100m, when he did so in what year?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Kohler created commercials and promos for what network that was launched on October 1, 1992?",
        "response": "Cartoon Network",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Indians were killed in the massacre that \"kyáiyótokan\" was a survivor of?",
        "response": "About 200",
        "source": "hotpot_qa"
    },
    {
        "query": "An originator of the Anti-Corn Law also originated an agreement between what two countries in 1860?",
        "response": "United Kingdom and France",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tommy Karevik and Serri members of the same band",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the team which drafted Brenden Blair Morrow based when it was founded?",
        "response": "Bloomington, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017 MTV Video Music Awards was the platform for the premiere of the video for a song off of what singer's upcoming sixth album entitled Reputation?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Photinia and Chamaerops which one is in the family Arecaceae?",
        "response": "Chamaerops",
        "source": "hotpot_qa"
    },
    {
        "query": "Battle: Los Angeles was developed by which video game designer founded in 2001?",
        "response": "Saber Interactive Incorporated",
        "source": "hotpot_qa"
    },
    {
        "query": "When were the revolutions that Joanneum was named after this member of the House of Habsburg-Lorraine?",
        "response": "1848",
        "source": "hotpot_qa"
    },
    {
        "query": "What role have both Matthew Tuck and Frank Iero performed in musical groups?",
        "response": "rhythm guitarist",
        "source": "hotpot_qa"
    },
    {
        "query": "What team was formed in 1996 that starred players like Robert Parish?",
        "response": "50 Greatest Players in National Basketball Association History",
        "source": "hotpot_qa"
    },
    {
        "query": "Which horrer television series aired on AMC on oct 18 2015 directed by the author of the secret diary of laura palmer? ",
        "response": "\"The Walking Dead\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which female actress appeared in both \"The Five(ish) Doctors Reboot\" and \"Doctor Who\"?",
        "response": "Jenna Coleman",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1986 South Antrim by-election included a candidate from which Northern Irish unionist party?",
        "response": "Democratic Unionist Party",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the name of the debut single by the group that finished fourth in The X factor and was signed by the company founded as American Record Corporation in 1929?",
        "response": "Carry You",
        "source": "hotpot_qa"
    },
    {
        "query": "Alex Haley wrote what novel about a man that was born in 1750?",
        "response": "Roots: The Saga of an American Family",
        "source": "hotpot_qa"
    },
    {
        "query": "The American industrialist and a founder of Standard Oil had a hotel built in St. Augustine, Florida by what architecture firm?",
        "response": "Carrère & Hastings",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Super Bowl had starting center Kevin Dale Long playing against the rival team St. Louis Rams?",
        "response": "Super Bowl XXXIV",
        "source": "hotpot_qa"
    },
    {
        "query": "Is MODE or $pread made for sex workers?",
        "response": "$pread",
        "source": "hotpot_qa"
    },
    {
        "query": "At which junction does the motorway terminate which has junction 36 in the south west corner of Preston Patrick?",
        "response": "Gretna junction",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was made in the 20th century, Let's Get Lost or Red State?",
        "response": "Let's Get Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport was the player born in the county seat of Osage County involved in?",
        "response": "Rugby",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Peter Tägtgren and Judith Durham nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actor who was starred in \"Intrepid\" with James Coburn and Finola Hughes born?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "U.S. Representative Mike Conaway is investigating interference in what US elections with the help of American attorney, politician and former prosecutor Trey Gowdy and Tom Rooney?",
        "response": "2016 United States elections",
        "source": "hotpot_qa"
    },
    {
        "query": "BWI Rail Station is served by which Amtrak flagship service?",
        "response": "Acela Express",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was teacher of the composer of Faschingsschwank aus Wien? ",
        "response": "Friedrich Wieck",
        "source": "hotpot_qa"
    },
    {
        "query": "La princesse de Navarre had music by which French composer?",
        "response": "Jean-Philippe Rameau",
        "source": "hotpot_qa"
    },
    {
        "query": "Which movie came out first Born into Brothels or Punk's Not Dead ?",
        "response": "Born into Brothels",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fireworks incident, was a very serious case of Football hooliganism which took place on Easter Sunday, on which date, after a 30 minute recess in which marketing director Edwin van der Sar addressed the crowd?",
        "response": "20 April 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What football team represented the University of Oklahoma and was featured as  #11 (BCS ranked) on the The 80th annual Sugar Bowl?",
        "response": "Oklahoma Sooners",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the king of this ancient nation, in which the people worshiped Imentet as a goddess representing the necropolises west of the Nile, called?",
        "response": "pharaoh",
        "source": "hotpot_qa"
    },
    {
        "query": "What category of academic qualification can be awarded at The Naval Postgraduate School operated by the United States Navy in Monterey, California and the private American research university, Lehigh University, located in Bethlehem, Pennsylvania and established by businessman Asa Packer?",
        "response": "degree",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Do I Sound Gay? and Paper Clips Project a documentary project?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant grows in East Asia, Aquilegia or Semiarundinaria?",
        "response": "Semiarundinaria",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has more species, Clianthus or Callicoma?",
        "response": "Clianthus",
        "source": "hotpot_qa"
    },
    {
        "query": "What  is a large, public flagship research university in Seattle, Washington, established in 1861,  University of Florida or University of Washington?",
        "response": "The University of Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie that was used the song Nirvana?",
        "response": "Danny Boyle",
        "source": "hotpot_qa"
    },
    {
        "query": "This longtime collaborator of director Craig R. Baxley wrote the musical scote for Under Seige, the American action-thriller that Strven Seagal received sound production nominations for this award?",
        "response": "Academy Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the essay written in 1919 by a German sociologist, philosopher, jurist, and political economist claiming that the state is the \"only human Gemeinschaft which lays claim to the monopoly on the legitimated use of physical force>?",
        "response": "\"Politics as a Vocation\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The company that has held the distributorship of Polo and Ralph Lauren products in Asia is chaired by a businessman that controls 40.13% of the voting capital of DCIL through what?",
        "response": "trusts",
        "source": "hotpot_qa"
    },
    {
        "query": "James Calhoun was the brother-in-law of a soldier who was brevetted to brigadier general at what age?",
        "response": "23",
        "source": "hotpot_qa"
    },
    {
        "query": " Las Vegas Uncork'd has had partners that include the casino on the strip located in which Nevada town?",
        "response": "Paradise",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series include the episodes called Bathroom Break and Supersize Me?",
        "response": "Beavis and Butt-Head",
        "source": "hotpot_qa"
    },
    {
        "query": "What characteristics do Lutherville and Baltimore County share? ",
        "response": "Maryland, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Extinction stars which Australian model and actress?",
        "response": "Emma Booth",
        "source": "hotpot_qa"
    },
    {
        "query": "Austerlitz is a turn-based strategy video game revolves around defending the Austrian village of Austerlitz from the invading army of an Emperor sometimes called what?",
        "response": "Alexander the Blessed",
        "source": "hotpot_qa"
    },
    {
        "query": "How many stores does the main feature of the Oaklands Park suburb contain?",
        "response": "341",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, The Saved or Grey Gardens?",
        "response": "Grey Gardens",
        "source": "hotpot_qa"
    },
    {
        "query": "Which festival screened the move In Secret which started English actor Tom Felton? ",
        "response": "Toronto International Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the town in Hertfordshire, England where Benslow Music Trust is based?",
        "response": "Hitchin",
        "source": "hotpot_qa"
    },
    {
        "query": "What cant is commonly used by pavees and is also known as De Gammon?",
        "response": "Shelta",
        "source": "hotpot_qa"
    },
    {
        "query": "What stadium is named after Darrell Royal, past coach of the 1976 Texas Longhorns football team?",
        "response": "Darrell K Royal – Texas Memorial Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Adriano Zumbo was known for his fairytale house on an Australian reality competitive cooking game show, that is produced by Shine Australia, and screens where?",
        "response": "Network Ten",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of navigation is still being taught as of 2014, and has been known to use the word Kanake?",
        "response": "Polynesian navigation",
        "source": "hotpot_qa"
    },
    {
        "query": "Makbule Atadan was the sister of a Turkish army officer whose policies and theories became known as what?",
        "response": "Kemalism",
        "source": "hotpot_qa"
    },
    {
        "query": "What do it yourself magazine does William Gurstelle write for?",
        "response": "Make",
        "source": "hotpot_qa"
    },
    {
        "query": "The physicist who wrote the textbook that was used to name Deutsche Physik won the Nobel Prize for Physics in what year?",
        "response": "1905",
        "source": "hotpot_qa"
    },
    {
        "query": "Death of a Gentleman included interviews with the batsman who currently plays for what Big Bash League team?",
        "response": "Melbourne Stars",
        "source": "hotpot_qa"
    },
    {
        "query": "How many episodes were in the South Korean television series in which Ryu Hye-young played Bo-ra?",
        "response": "20",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 2010 census, what was the population of the city that housed an attraction using Disney's Omnimover conveyance system?",
        "response": "47",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country has the world's 16th largest city as its capital, a city which has Hyoja-dong as a \"dong\"?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the school which is football rivalry of the The Hill School located? ",
        "response": "the historic Lawrenceville section of Lawrence Township",
        "source": "hotpot_qa"
    },
    {
        "query": "Lisa Flanagan movie debut was in a film irected by who?",
        "response": "Paul Goldman",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the air date of \"The Simpsons\" episode written by Matt Selman which parodied the VH1 series \"Behind the Music\"?",
        "response": "May 21, 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Wizboy\" is the first episode of the first season of the animated television series \"Fanboy & Chum Chum\", an American 3D CGI animated television series created by Eric Robles for which organization?",
        "response": "Nickelodeon",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Bob Mould or Kendall Schmidt better known for their television career?",
        "response": "Kendall Francis Schmidt",
        "source": "hotpot_qa"
    },
    {
        "query": "What job does the promotor of the term \"Alt-Right\" Richard Spencer have?",
        "response": "He is president of the National Policy Institute",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the location of The 2016 iHeartRadio Music Award open?",
        "response": "December 30, 1967",
        "source": "hotpot_qa"
    },
    {
        "query": "The Dickens novel that tells the story of the French Doctor Manette was written at what home?",
        "response": "Tavistock House",
        "source": "hotpot_qa"
    },
    {
        "query": "Troy McClure first appeared in what 13th episode of The Simpsons second season?",
        "response": "Homer vs. Lisa and the 8th Commandment",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the shop visited by Gemmy Industries product development vice president Joe known for?",
        "response": "stocking a wide selection",
        "source": "hotpot_qa"
    },
    {
        "query": "Which restaurant opened first, Jet's Pizza or East of Chicago Pizza?",
        "response": "Jet's Pizza",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people live in the county seat where the school superintendent is John A. Provost?",
        "response": "28,549",
        "source": "hotpot_qa"
    },
    {
        "query": "What star of Tumbleweed was also one of the most decorated American combat soldiers of World War II?",
        "response": "Audie Murphy",
        "source": "hotpot_qa"
    },
    {
        "query": "Which did construction start on first, the Delaware and Raritan Canal or the Pennsylvania Canal?",
        "response": "Pennsylvania Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Jimmy C. Newman was a long time star of?",
        "response": "The Grand Ole Opry",
        "source": "hotpot_qa"
    },
    {
        "query": "Chuck Versus the Cougars, is the fourth episode of the second season of \"Chuck\", Heather's nerdy husband Mark Ratner, is played by which American actor, born on September 13, 1980?",
        "response": "Bennett Joseph Savage",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does Cangzhou and Miquan have in common?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Wilkes-Barre/Scranton International Airport and Long Island MacArthur Airport, which airport is owned by a higher government?",
        "response": "Wilkes-Barre/Scranton International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": " The Carlton House Block is a historic commercial and retail block at 9-13 Hampden Street in Springfield, a city in western New England, and the seat of Hampden County, Massachusetts, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the company that manufactures agricultural,construction, forest machinery, diesel engines, drivetrains used in heavy equipment, and lawn care equipment?",
        "response": "Hans Walter Becherer",
        "source": "hotpot_qa"
    },
    {
        "query": "What prize did the man who used the ideas of Lars Onsager in 1957 to describe the magnetic phase diagram of type-II superconductors in 2003?",
        "response": "Nobel Prize in Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Which contributor to Fear: 13 Stories of Suspense and Horror was born on March 15, 1953 ?",
        "response": "Heather Graham",
        "source": "hotpot_qa"
    },
    {
        "query": "Roger Duane \"Zeke\" Smith, was an American football player in the National Football League, other Auburn greats, include Bo Jackson, one of the few athletes to be named an All-Star in two major sports, and the only one to do so in both baseball, and what sport?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Kaurna name of the river that runs along Mount Torrens in South Australia?",
        "response": "Ngangkiparri",
        "source": "hotpot_qa"
    },
    {
        "query": "The We Are Family Foundation was founded by a musician who is famous for which guitar style ?",
        "response": "\"chucking\" rhythm guitar",
        "source": "hotpot_qa"
    },
    {
        "query": "Evan Turner was selected in what NBA draft that also included five players being drafted from the same school in the first round?",
        "response": "2010 NBA draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film produced by Blinding Edge Pictures starred actors Joaquin Phoenix, Adrien Brody, and Bryce Dallas Howard?",
        "response": "The Village",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Padmarajan and Wanda Jakubowska have in common?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has a wider scope of profession, Alan Mak or Harry Lachman?",
        "response": "Alan Mak Siu-fai",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voices one of the main characters in the film for which Goe Verbinski won the Academy Award for Best Animated Feature in 2012?",
        "response": "Johnny Depp",
        "source": "hotpot_qa"
    },
    {
        "query": "A Modest Video Game Proposal is an allusion to the essay written in what year?",
        "response": "1729",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following has released ten solo albums: Kristin Hersh or Mike Patton?",
        "response": "Kristin Hersh",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the current rhythm guitarist of The Smashing Pumpkins?",
        "response": "February 4, 1974",
        "source": "hotpot_qa"
    },
    {
        "query": "What single was released on May 22, 2012 is also a dance of the same name?",
        "response": "Harlem Shake",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2015 population of the city where Straight Street Bridge is?",
        "response": "147,754",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was created first, Where Have All the Flowers Gone? or American Pimp?",
        "response": "American Pimp",
        "source": "hotpot_qa"
    },
    {
        "query": "Publius Valerius Poplicola was the consul of the era of ancient Roman civilization traditionally dated to when?",
        "response": "509 BC",
        "source": "hotpot_qa"
    },
    {
        "query": "Hurricane Fico was the longest lived hurricane of what hurricane season?",
        "response": "1978 Pacific hurricane season",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Griffin is a fictional character from the American animated television series \"Family Guy\", an anthropomorphic white dog voiced by which American actor, filmmaker, comedian, and singer, working primarily in animation and comedy, as well as live-action and other genres, and is the creator of the TV series, \"The Orville\" (2017–present)?",
        "response": "Seth MacFarlane",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is considered the more well known author, Roger Angell or Harry Stephen Keeler?",
        "response": "Roger Angell",
        "source": "hotpot_qa"
    },
    {
        "query": "Buffalo Springfield recorded a song in 1966 released on what record label?",
        "response": "Atco Records",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the man who Carol Kane played the wife of who was a lovable-but-goofy mechanic in a television series?",
        "response": "Latka Gravas",
        "source": "hotpot_qa"
    },
    {
        "query": "State Route 160 runs on top of a mountain peak with an elevation how far above mean sea level?",
        "response": "4145 ft",
        "source": "hotpot_qa"
    },
    {
        "query": "James D. Ewing is the publisher or a paper printed where?",
        "response": "Keene, New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the actor that played in \"Dawson's Creek\" and a 2000 American supernatural horror film directed by James Wong?",
        "response": "Kerr Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sugarcubes and SCH, are related to music?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Jerzy Kawalerowicz and Richard Marquand both from Wales?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has the highest scope of profession in Mike Love or Nick Cave ",
        "response": "Nick Cave",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the  \"King of Denmark, the Vends and the Goths, elected King of Norway's\" brother?",
        "response": "king John of Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did actress Irene Jacob complete before the American action crime thriller film directed by Stuart Bird?",
        "response": "Beyond the Clouds",
        "source": "hotpot_qa"
    },
    {
        "query": "For which film did this British actor from \"The Shadow Line\" collaborate with Steven Spielberg?",
        "response": "Amistad",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of a large inhabited island in Hawai'i that is 69.5 sqmi and was also part of the name of a Hawaiian musical group formed in 1976 before they dropped it?",
        "response": "Niihau",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lego Ninjago Movie starred the voice of which Pakistani-American comedian?",
        "response": "Kumail Nanjiani",
        "source": "hotpot_qa"
    },
    {
        "query": "Heavy is a 1995 independent American drama film starring an American singer-songwriter and actress best known as the lead singer of what new wave band? ",
        "response": "Blondie",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress and singer is overdubbed in German by Gabrielle Pietermann?",
        "response": "Selena Gomez",
        "source": "hotpot_qa"
    },
    {
        "query": "How many costumers do this company have that is a \"global e-learning player\" along with Element K?",
        "response": "10,000",
        "source": "hotpot_qa"
    },
    {
        "query": "Eddie Kendricks co-founded a singing group that was highly influential in the evolution of which genre of music ?",
        "response": "R&B and soul music",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Mirabilis and Podocarpus part of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Royal Windermere Yacht Club located in Bowness-on-Windermere founded?",
        "response": "1860",
        "source": "hotpot_qa"
    },
    {
        "query": "Avi Wisnia won the OutMusic Award for Outstanding Jazz Song in 2009 for the cover of a TLC song from which 1999 album?",
        "response": "FanMail",
        "source": "hotpot_qa"
    },
    {
        "query": "On what year the Pakistani drama could've been nominated for the Hum Awards?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "What magazine has printed works by Ian Young and is published by an activist group of the same name who denied the existence of HIV/AIDS?",
        "response": "Continuum",
        "source": "hotpot_qa"
    },
    {
        "query": "Which class was this Austro-Hungarian dreadnought battleship that was renamed to Jugoslavija and rigged with explosives and sunk near the end of World War I?",
        "response": "Tegetthoff",
        "source": "hotpot_qa"
    },
    {
        "query": "The army officer who comitted a murder in 1970 at fort bragg was born on which year ?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "Mere Brother Ki Dulhan was written by the writer of what action drama film?",
        "response": "Gunday",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor who starred in the movie Gryphon and as the voice of Pops in \"Johnny Bravo\" born? ",
        "response": "February 21, 1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Which field of studies did Semyon Aranovich Gershgorin and Anatoly Maltsev work in?",
        "response": "He was a mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Parrotiopsis and Emilia both types of plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What country where Dysoxylum gotadhora is native to is officially a Kingdom?",
        "response": "Bhutan",
        "source": "hotpot_qa"
    },
    {
        "query": "For which role was actress who made her debut in the film  No Small Affair nominated for an Academy Award ? ",
        "response": "Olive Neal",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animated short film created by Patrick McHale was Over the Garden Wall based on ",
        "response": "Tome of the Unknown",
        "source": "hotpot_qa"
    },
    {
        "query": "Ultra Cute was a manga series originally serialized in the shojo publication created by which company?",
        "response": "Kodansha",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of publications are both Jane and Woman's Viewpoint?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Christy Canyon or Kourtney Kardashian?",
        "response": "Christy Canyon",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Johnny Carson's sidekick that had a drunk clip of him drunk on \"The Tonight Show\" shown on The Show with No Name?",
        "response": "Ed McMahon",
        "source": "hotpot_qa"
    },
    {
        "query": "James Patrick Maguire is a fictional character from the British Channel 4 comedy drama, \"Shameless\", portrayed by which Northern Irish actor, born on which date?",
        "response": "26 November 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "What industrial metal band had a single from their 1992 album called \"Just One Fix\" which featured samples from the 1986 British biopic \"Sid and Nancy\"? ",
        "response": "Ministry",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Godspell and David Haskell have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Steve Dildarian or Ian Bremmer?",
        "response": "Steve Dildarian",
        "source": "hotpot_qa"
    },
    {
        "query": "What computer accessory was the result of the work on human-computer interaction by the creator of hypertext?  ",
        "response": "mouse",
        "source": "hotpot_qa"
    },
    {
        "query": "In which arena did Thato Batshegi lose to Kenyan Nick Okoth in the gold medal match?",
        "response": "Workers Indoor Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Jackie Vernold Shipp, is a former American football linebacker who played in the National Football League, and also was the defensive line coach for which college football team that represents the University of Oklahoma? ",
        "response": "Oklahoma Sooners football",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Alan Wynn (\"né\" Weinberg; born January 27, 1942) is an American real estate businessman and art collector, early in his career he oversaw the construction and operation of several notable Las Vegas and Atlantic City hotels, including which hotel and casino, located on the Las Vegas Strip in Paradise, Nevada, USA with 2,664 rooms and 220 suites, and is connected by tram to The Mirage, as well as pedestrian bridge to the Fashion Show Mall shopping center?",
        "response": "Treasure Island Hotel & Casino",
        "source": "hotpot_qa"
    },
    {
        "query": "Piero Mingoia played as midfielder for the ffootball club, established in 1948, that has a local rivalry with what other team?",
        "response": "St Albans City",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Edward Teller also starred in a 1999 science fiction film loosely based on the video game series named what",
        "response": "Wing Commander",
        "source": "hotpot_qa"
    },
    {
        "query": "What shopping center is Komtar JBCC adjacent to?",
        "response": "Johor Bahru City Square",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American musician who wrote all songs of the album \"Brighten the Corners\" born?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheick Guillaume Ouedraogo holds notable wins over the likes of a mixed martial artist whois currentaly ranked as the #7 contender in what?",
        "response": "the official UFC rankings",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress played the role of Hillary Winston on \"The Royal Family\" at the age of 4 and was also in the Tina in the Sky with Diamonds episode of Glee?",
        "response": "Naya Rivera",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the vocalist to which the song Ask is credited ?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "What city near Space Coast has a population of 11,231 in the 2010 United States Census?",
        "response": "Cocoa Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "The current president of the University of Oklahoma approved the Oklahoma Housing Finance Agency's first trust indenture in what year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "IS Paul Sloane noted for directing more musicals than  Jacques Demy",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What liquor is found in both a Black Russian and a Glowtini?",
        "response": "is a cocktail of vodka",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1960's stage revue written by Peter Cook and Dudley Moore has been regarded as beginning the Satire Boom?",
        "response": "Beyond the Fringe",
        "source": "hotpot_qa"
    },
    {
        "query": "What festival was founded by a Congressman for California's 44th district and had support from a free community newspaper?",
        "response": "Palm Springs International Film Festival",
        "source": "hotpot_qa"
    },
    {
        "query": "Which horologist who served members of European nobility employed members of the Oudin family?",
        "response": "Abraham-Louis Breguet",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine launched first, Real Simple or Life?",
        "response": "Life",
        "source": "hotpot_qa"
    },
    {
        "query": "John Stubbs died in a city with an urban population of what in 2015?",
        "response": "29,413",
        "source": "hotpot_qa"
    },
    {
        "query": "Kerry Condon is the youngest Royal Shakespeare Company actress ever to play a character who is whose daughter?",
        "response": "Polonius",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1971 film in which Pat Ashton starred in?",
        "response": "Harry Booth",
        "source": "hotpot_qa"
    },
    {
        "query": "Blackfin is a family of processors developed by the company that is headquartered in what city?",
        "response": "Norwood, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is both an american attorney and a politician?",
        "response": "Tim Kaine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is airport is located in German and second busiest airport in Germany and operates a dense domestic and European network as a member of Lufthansa Cityline? ",
        "response": "Munich Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the father of the character Alfie Allen portrayed in \"Game of Thrones\"?",
        "response": "Balon Greyjoy",
        "source": "hotpot_qa"
    },
    {
        "query": "This actor born August 26, 1909 stared in the tv show \" The Cowboys \".",
        "response": "Jim Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "What film about the 1972 'Bloody Sunday' shootings in Northern Ireland won the Golden Bear at the 52nd annual Berlin International Film Festival?",
        "response": "Bloody Sunday",
        "source": "hotpot_qa"
    },
    {
        "query": "Games for Windows – Live or GFWL (trademarked as Games for Windows – LIVE) was an online gaming service used by \"Games for Windows\"–branded PC titles that enables Windows PCs to connect to Microsoft's Live service, some games allow for cross-platform play, such as which first-person shooter video game, developed by FASA Studio for Xbox 360 and Windows Vista?",
        "response": "Shadowrun",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry Mosley and his cousin Shane Mosley both box in which division?",
        "response": "Welterweight",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of this retired professional footballer who was named as man of the match at 2001 Intercontinental Cup? ",
        "response": "Ghanaian",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of Intuit, Inc's popular accounting software, that is powered by SQL Anywhere?",
        "response": "QuickBooks",
        "source": "hotpot_qa"
    },
    {
        "query": "Michele Ferrero created a spread that was first introduced in what year?",
        "response": "1965",
        "source": "hotpot_qa"
    },
    {
        "query": "Kennett High School serves the students of a town in what New Hampshire county?",
        "response": "Carroll",
        "source": "hotpot_qa"
    },
    {
        "query": "Wal-Mart: The High Cost of Low Price and The Conquest of Everest, have which attributes in common?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the year of birth of the mathematician that is credited with developing infinitesimal calculus and using Jean Picard's measurement of earth to create his theory of universal gravitation?",
        "response": "1642",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the boyfriend of Thelma Lou in the series with Jim Nabors?",
        "response": "Barney Fife",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the star of the 1930 film Miss Europe ?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Ernest Augustus Anderson  was installed in Hay, New South Wales as the second Anglican Bishop of the Diocese of Riverina, Hay is a town in the western Riverina region of south western New South Wales, in which country?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Shah of Iran for almost four decades until being overthrown in the Iranian Revolution?",
        "response": "Mohammad Reza Pahlavi",
        "source": "hotpot_qa"
    },
    {
        "query": "who directed the American sports comedy film which Sandler appeared in ",
        "response": "Dennis Dugan",
        "source": "hotpot_qa"
    },
    {
        "query": "Along which river is the Kentucky Department of Corrections headquarted?",
        "response": "Kentucky River",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the Bronx cocktail and the Bramble cocktail both have juice in them?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "School for Secrets included a supporting role for which Scottish actor from \"Dad's Army\"?",
        "response": "John Paton Laurie",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Riverside Canal and Lake Washington Ship Canal both in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "George Robert Reed shares which claim with a Canadian football player who played for Drake University?",
        "response": "greatest running back",
        "source": "hotpot_qa"
    },
    {
        "query": "What Grand Prairie, Alberta-born hockey player was traded in 1987 to the Washington Capitals?",
        "response": "Clint Malarchuk",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of movie is the 2014 Hindi film that was inspired by a 2003 film directed by Yann Samuell and starred Marion Cotillard and Guillaume Canet?",
        "response": "romantic",
        "source": "hotpot_qa"
    },
    {
        "query": "Jolo, West Virginia is the home of the snake handling churches of what denomination?",
        "response": "Pentecostal Holiness",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Robert De Niro's Waiting...\" is a song by a group formed in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the name of a 2002 thriller film starring Agnes Bruckner",
        "response": "Murder by Numbers",
        "source": "hotpot_qa"
    },
    {
        "query": "Kool-Aid and  Lucozade are examples of what?",
        "response": "drinks",
        "source": "hotpot_qa"
    },
    {
        "query": "\"That's Just About Right\" is a song recorded by a band founded in which year ?",
        "response": "1992",
        "source": "hotpot_qa"
    },
    {
        "query": "What dramatic work does Eugene Onegin and Il trovatore have in common?",
        "response": "opera",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 WPA World Nine-ball Championship was organized by an event promotions company founded by who?",
        "response": "Barry Hearn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which superhero created by Jerry Siegel and artist Joe Shuster was featured in virtually every issue of World's Finest Comics?",
        "response": "Superman",
        "source": "hotpot_qa"
    },
    {
        "query": "If She Knew What She Wants was covered in 1986 by a band formed in which city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays the title character of the British crime drama programme written by Neil Cross that is also credited to the English and Canadian filmmaker Stefan Schwartz?",
        "response": "Idris Elba",
        "source": "hotpot_qa"
    },
    {
        "query": "The winners of the Norwegian Melodi Grand Prix Junior 2012 are how old?",
        "response": "15 years",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Forman and Anand Patwardhan, are in the film industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of the co-assistant coach of the team Mikel Arteta plays for?",
        "response": "29 May 1949",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport El Paso International Airport or Martha's Vineyard Airport is located closer to the centre of the local settlements ?",
        "response": "Martha's Vineyard Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the river that begins 40 mi southwest of the county seat of Beltrami County?",
        "response": "192 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Who described the captain of the winners of the 1964-65 European Cup Winners Cup as the best defender he had ever played against ?",
        "response": "Pelé",
        "source": "hotpot_qa"
    },
    {
        "query": "According to the 2010 Census, what was the population of the city in which the Library of MIchigan is located?",
        "response": "114,297",
        "source": "hotpot_qa"
    },
    {
        "query": "How many operas did the person who wrote Eduardo e Cristina write?",
        "response": "39",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the offical language of the canton that is home to the Arulmiku Sivan Temple?",
        "response": "German",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a novelist, Neil Simon or Erica Jong?",
        "response": "Erica Jong",
        "source": "hotpot_qa"
    },
    {
        "query": "What day did a TV drama, which has an episode titled \"Revenge\" as its 22nd episode of its tenth season, premier on?",
        "response": "September 23, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1958 Pro Bowl was played at the California stadium that is the home for which college?",
        "response": "University of Southern California",
        "source": "hotpot_qa"
    },
    {
        "query": "At what schools did the man who was co-captain of the 1982-83 Princeton Tigers men's basketball team later serve as head coach?  ",
        "response": "Oregon State University and Brown University",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Ryah Nixon originally from? ",
        "response": "Seattle, Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Who will direct the upcoming biological film Papillon which is a remake of a film of the same name starring the American actor who won an Academy Award for Best Actor in 1980?",
        "response": "Michael Noer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born 33 years before Pia Getty?",
        "response": "co-founder of DFS (Duty Free Shops)",
        "source": "hotpot_qa"
    },
    {
        "query": "What award has the costume designer for the Michael Collins biopic starring Liam Neeson been nomination for, a total of six times?",
        "response": "Best Costume Design",
        "source": "hotpot_qa"
    },
    {
        "query": "Show Me Where the Good Times Are is a musical comedy with book by Leonora Thuna, and was inspired by Jean-Baptiste Poquelin, was a French playwright and actor who is considered to be one of the greatest masters of comedy in Western literature, and known by which stage name?",
        "response": "Molière",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor and comedian known for playing the role of Newman in Seinfeld, also stars in the series The Exes on TV Land?",
        "response": "Wayne Knight",
        "source": "hotpot_qa"
    },
    {
        "query": "What media franchise features a title character whose friends include Piglet, Eeyore, and Owl? ",
        "response": "Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television series features considerable use of special effects? ",
        "response": "Doubutsu Sentai Zyuohger",
        "source": "hotpot_qa"
    },
    {
        "query": "Only God Can Judge Me is a mixtape that included an appearance by which rapper who debuted in 1996?",
        "response": "Yo Gotti",
        "source": "hotpot_qa"
    },
    {
        "query": "Imre Kemecsey, is a Hungarian sprint canoeist who competed in 1960s, competing in two Summer Olympics, he won a silver in 1960 at Rome, Rome, is the capital of Italy and a special comune, and also serves as the capital, of which region?",
        "response": "Lazio",
        "source": "hotpot_qa"
    }
]