[
    {
        "query": "What Chicago gang were Charles \"Chuckie\" Anthony Nicoletti and Salvatore \"Mooney Sam\" Giancana, better known as Sam Giancana, apart of?",
        "response": "Outfit",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Physocarpus and Rudbeckia both genus of flowering plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Pro Street cars are built similar to what class of car that is described as \"all motor\"?",
        "response": "Pro Stock",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Maurice Ravel or William Walton?",
        "response": "Maurice Ravel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which port city lies approximately 25 km north of the Lingnan Fine Arts Museum?",
        "response": "Keelung",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the Simpson's episode written by Matt Selman that aired in the United States on May 21, 2000?",
        "response": "Behind the Laughter",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin Cooney appeared in which film directed by Peter Weir ?",
        "response": "Dead Poets Society",
        "source": "hotpot_qa"
    },
    {
        "query": "7 Day Sunday, is a British comedy radio talk show, who joined regular guest, Andy Zaltzman?",
        "response": "Sarah Millican",
        "source": "hotpot_qa"
    },
    {
        "query": "Which retired Major League Baseball player is also the brother of former American sports commentator Craig James?",
        "response": "Chris James",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Gordon and Vincenzo Natali, have which mutual nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gitlow v. New York and City of Boerne v. Flores both Supreme Court cases?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "which medalist in the 2004 Commonwealth Youth Games is a former British recold holder in the 100 metres hurdles, the high jump and the indoor pentathlon?",
        "response": "Jessica Ennis-Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "USA for Indonesia is a parody sung to a tune written by Lionel Richie and what other singer?",
        "response": "Michael Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1999 American buddy cop movie staring a German-born actor born April 16, 1965?",
        "response": "Les Mayfield",
        "source": "hotpot_qa"
    },
    {
        "query": "For which University did the quarterback featured on the cover of Madden NFL 06 play basketball ?",
        "response": "Syracuse University.",
        "source": "hotpot_qa"
    },
    {
        "query": "In what nationality's folklore is the cat mentioned in Live Fast, Love Hard, Die Young?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What instrument does this musician of Nirvana who was featured in only one Nirvana album play for his current band?",
        "response": "bass",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country was the Seat of the Culdares line?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which broadcasting company owned the website that premiered \"Penelope Princess of Pets\" in 2007?",
        "response": "Turner Broadcasting",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ernst Toller and Patricia Highsmith both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did this hotel and casino, located nearer to Gold Mountain Casino than any other casinos, open?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What film about the trafficking of children did an actor from Northern IReland who starred in Excalibur and The Bouny star in?",
        "response": "Taken",
        "source": "hotpot_qa"
    },
    {
        "query": "Surfrider is located at the water park owned by what company?",
        "response": "Village Roadshow Theme Parks",
        "source": "hotpot_qa"
    },
    {
        "query": "Woh Ladki Hai Kahan is a song from what 2001 Indian comedy-drama?",
        "response": "Dil Chahta Hai",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Shock of the Lightning\" is a song by English rock band Oasis and is the fourth track from which seventh and final studio album by English rock band Oasis, released on 6 October 2008 by Big Brother Records?",
        "response": "Dig Out Your Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "Andreas Katsulas plays the villain Sykes in a film based on a 1960's tv series created by who?",
        "response": "Roy Huggins",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hayes  is the second Olympic gold medalist to be inducted to the Hall of Fame, after what  member of the Sac and Fox Nation",
        "response": "Jim Thorpe",
        "source": "hotpot_qa"
    },
    {
        "query": "Annie Potts had a role in which sequel film written by Dan Aykroyd and Harold Ramis?",
        "response": "Ghostbusters II",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the actress who plays an abnormal, Ashley Magnus?",
        "response": "Danish",
        "source": "hotpot_qa"
    },
    {
        "query": "Wha documentary portrayed someone paralyzed by a bullet to the spine while deployed in Iraq?",
        "response": "Body of War",
        "source": "hotpot_qa"
    },
    {
        "query": "Diego García-Borreguero has completed fellowships in sleep medicine and sleep research at an agency founded when ?",
        "response": "in the late 1870s",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the actor Keith from the show Watch my chops nationality? ",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "How many cast and crew members are there for stage production at the Wynn Las Vegas casino resort created by the director of the Cirque du Soleil show that was first performed on December 25, 1993?",
        "response": "250",
        "source": "hotpot_qa"
    },
    {
        "query": "Damernas Värld, a Swedish language magazine and The Lady's Realm, a British magazine both target which demographic as their key audience?",
        "response": "women",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Jonah Matranga and Cho Kyuhyun, which singer has appeared on postage stamps?",
        "response": "Cho Kyu-hyun",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2011 UTSA Roadrunners football team were coached by the former head coach of what Florida college?",
        "response": "University of Miami",
        "source": "hotpot_qa"
    },
    {
        "query": " Which band was formed first Parabelle or +44?",
        "response": "+44",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cirrus SR22 is a single-engine four- or five-seat composite aircraft built from 2001 by which aircraft, manufacturer of Duluth, Minnesota, that was founded in 1984 by Alan and Dale Klapmeier to produce the VK-30 kit aircraft?",
        "response": "Cirrus Aircraft Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "The capital of Slovenia is located between which two cities",
        "response": "Carniola and Styria",
        "source": "hotpot_qa"
    },
    {
        "query": "Australia's Got Talent judge Geri Halliwell used to be a part of what pop group?",
        "response": "the Spice Girls",
        "source": "hotpot_qa"
    },
    {
        "query": "What position on the Hot Country Songs did the song recorded by the American country music group Lonestar reach?",
        "response": "number 1",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Ernst Messerschmid and Reinhold Ewald ESA astronauts?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What role did eight-time Academy Award nominee have in \"A Lie of the Mind?\"",
        "response": "Lorraine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fictional character was first developed in 1959 and was the main character in a 1983 film?",
        "response": "Norman Bates",
        "source": "hotpot_qa"
    },
    {
        "query": "Anna Camp had a recurring role in the Fox series created by whom?",
        "response": "Mindy Kaling",
        "source": "hotpot_qa"
    },
    {
        "query": "The creator of the Lisa Simpson character was born in what year?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the hero of the book by J.R.R. Tolkien published in 1977?",
        "response": "Húrin",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfred Thomas \"Freddie\" Highmore starred in an American drama film involving an 11-year-old musical prodigy living in an orphanage who runs away to where?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "American Beauty: Original Motion Picture Score was composed bu what American composer born in 1955",
        "response": "Thomas Newman",
        "source": "hotpot_qa"
    },
    {
        "query": "What person does Airstream and Spirit of St. Louis have in common?",
        "response": "Charles Lindbergh",
        "source": "hotpot_qa"
    },
    {
        "query": "Born Again starred the American film actor who played what role in The Best Years of Our Lives?",
        "response": "Fred Derry",
        "source": "hotpot_qa"
    },
    {
        "query": "In between  Grant Nicholas and Terry Glaze, who was raised in Texas?",
        "response": "Terrence Lee Glaze",
        "source": "hotpot_qa"
    },
    {
        "query": "Vera Zorina (January 2, 1917 – April 9, 2003) was a Norwegian ballerina, theatre and film actress, and choreographer, today she is chiefly remembered for her films choreographed by her then husband, who (born January 22, 1904 - April 30, 1983) was a choreographer, styled as the father of American ballet, he co-founded the New York City Ballet and remained its Artistic Director for more than 35 years?",
        "response": "George Balanchine",
        "source": "hotpot_qa"
    },
    {
        "query": "In what army is Mehmetçik slang for a common a common soldier?",
        "response": "Ottoman Army",
        "source": "hotpot_qa"
    },
    {
        "query": "What month was the founder of L.L.Bean born?",
        "response": "October",
        "source": "hotpot_qa"
    },
    {
        "query": "The aviation accident that Jacob Veldhuyzen van Zanten was involved in killed how many people?",
        "response": "583",
        "source": "hotpot_qa"
    },
    {
        "query": "Who drove the Force India VJM09 along with a Mexican racing driver \"Checo\"?",
        "response": "Nico Hülkenberg",
        "source": "hotpot_qa"
    },
    {
        "query": "Aditya Seal, is an Indian model and film actor best known for his work in bollywood, Seal was a world champion in which Korean martial art, characterized by its emphasis on head-height kicks, jumping and spinning kicks, and fast kicking techniques?",
        "response": "Taekwondo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the setting of J.T. Petty's video game \"Outlast 2\"?",
        "response": "the Arizona desert",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian actress, and star of the TV show \"Pretty Little Liars,\" participated in Logan Paul's music video entitled \"Help Me Help You\"?",
        "response": "Shay Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a retired Mexican tennis player, Jakob Hlasek or Raúl Ramírez?",
        "response": "Raúl Ramírez",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010–11 Tour de Ski was the 5th edition of the Tour de Ski and took place from 31 December 2010 to which date, Swiss cross-country skier, Dario Cologna won the Men's class?",
        "response": "9 January 2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Brothers Barry, Robin and Maurice Gibb, in addition to headlining the pop group the Bee Gees, wrote several hits for other artists, including 1980 hit \"Woman in Love\" performed by who?",
        "response": "Barbra Streisand",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera seria by Handel was created first, Orlando or Alcina?",
        "response": "Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "The Tyndall crater was named after John Tyndall, what was John Tyndall famous for?",
        "response": "his study of diamagnetism",
        "source": "hotpot_qa"
    },
    {
        "query": "The French Air Force aircraft engine series Hispano-Suiza V-12's last two models were used mainly around what war(s)?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "The nickname of this National Hockey Leagues front line that featured three French Canadians from Quebec is also the name of a popular early 70's film scored by Don Ellis?",
        "response": "The French Connection",
        "source": "hotpot_qa"
    },
    {
        "query": " Jacqueline Yvonne Meta is best known for her friendship with a German-born diarist born in what year?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "Which club does Brett Emerton play in that competes in League One?",
        "response": "Blackburn Rovers Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was an Anglo-Irish soldier and statesman who was one of the leading military and political figures of 19th-century Britain, who said \"Publish and be damned!\" to an English publisher and editor with something of a reputation as a pornographer?",
        "response": "Arthur Wellesley",
        "source": "hotpot_qa"
    },
    {
        "query": "I Never Knew That About Britain was a British factual show that aired on ITV from 3 March to 21 April 2014 and was hosted by Paul Martin with which female reporter, a British historian, academic and television presenter who has written and appeared in a number of television and radio programmes about British history?",
        "response": "Suzannah Lipscomb",
        "source": "hotpot_qa"
    },
    {
        "query": "How many members exist in the conference represented by the Michigan State Spartans in the 1993 Liberty Bowl?",
        "response": "14 members",
        "source": "hotpot_qa"
    },
    {
        "query": "Tevar is a film starring the Indian actor appearing in what type of films?",
        "response": "Bollywood",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was featured as a guest contribution in \"Press Play\" and in a leaked sex tape with Rick Salomon?",
        "response": "Paris Hilton",
        "source": "hotpot_qa"
    },
    {
        "query": "What American football running back for the New Orleans Saints was suspended in 2013 and 2014?",
        "response": "Adrian Peterson",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the presenters of the 2016 Brit Awards from?",
        "response": "Newcastle upon Tyne, England",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Beatles' box set, originally released in Japan by Odeon Records, consists of their second album released in the United states among other albums?",
        "response": "The Japan Box",
        "source": "hotpot_qa"
    },
    {
        "query": "The McCarran Airport Connector serves what airport named after late U.S. Senator Pat McCarran?",
        "response": "McCarran International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a documentary on the Louisville, Kentucky band Slint with a focus on their seminal final album that is their second and final studio album?",
        "response": "Lance Bangs",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a film based on a work that is also called \"Crush On You\"?",
        "response": "Ryoo Jang-ha",
        "source": "hotpot_qa"
    },
    {
        "query": "Fünf Minuten Amerika and Felix Salten both were creators of what media?",
        "response": "book",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the 36th head coach of Purdue Boilermakers football born? ",
        "response": "April 24, 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Salmita Mine and Tundra Mine, produced what?",
        "response": "gold",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is from England, Republica or AFI?",
        "response": "Republica",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Shannon Reed on the soap opera \"Home and Away\" also appeared in a 2008 romantic comedy directed by Adam Brooks that is set in what city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Western Auto Supply company was started by a man who later founded this not-for-profit university?",
        "response": "Pepperdine University",
        "source": "hotpot_qa"
    },
    {
        "query": "What Israeli national park extends from the unoccupied territory to the West bank?",
        "response": "Canada Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeff Sanders was selected  in the 1st round of the 1989 NBA Draft by a team that plays it's home games at what arena?",
        "response": "United Center",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Norwegian fairytale, published between 1841 and 1844 is the character, who in Julia Donaldson and David Roberts children story walks the plank, based on?",
        "response": "Three Billy Goats Gruff",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American retired Florida state circuit court judge who replaced Jerry Sheindlin on the television program \"The People's Court\" born?",
        "response": "May 1, 1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the co-founder of The Alliance for Lupus Research currently serving as?",
        "response": "United States Ambassador",
        "source": "hotpot_qa"
    },
    {
        "query": "A Story is an album recorded in 1974 by a singer born in what year?",
        "response": "1933",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Italian professional footballer that Taiwanese goalkeeper Lu Kun-Chai is nicknamed after?",
        "response": "Gianluigi \"Gigi\" Buffon",
        "source": "hotpot_qa"
    },
    {
        "query": "Which General was involved in the destruction of Frampol during the Bombing of Frampel in 1939 and who was born in 1895?",
        "response": "Wolfram Freiherr von Richthofen",
        "source": "hotpot_qa"
    },
    {
        "query": "Khizir Khan spoke at the convention in Philadelphia that nominated which person for Democratic presidential candidate?",
        "response": "Hillary Clinton",
        "source": "hotpot_qa"
    },
    {
        "query": "Kochi 5s was a team led by the retired footballer from what country?",
        "response": "Spanish",
        "source": "hotpot_qa"
    },
    {
        "query": "The Campbell and Kelly Building is located in what Nevada county?",
        "response": "Nye County",
        "source": "hotpot_qa"
    },
    {
        "query": "which nuclear reservation in the United States  did  the U.S. Atomic Energy Commission acquired Meyers Mill  as part of ",
        "response": "The Savannah River Site",
        "source": "hotpot_qa"
    },
    {
        "query": "Benita Valente was lauded for her interpretations of which German, later British, baroque composer?",
        "response": "George Frideric",
        "source": "hotpot_qa"
    },
    {
        "query": "What did a suitor of queen Elizabeth I say Sir Roger Williams was?",
        "response": "\"worth his weight in gold\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Thomas Keneally and Peter Straub both novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "william J. Monahan's second produced screenplay was a remake of what film?",
        "response": "\"Infernal Affairs\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Robbie Gee appeared in which 2000 British crime comedy film by Guy Ritchie?",
        "response": "Snatch",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, \"VHS or Beta\" or \"Knuckle Puck,\" is originally from a city that is further west?",
        "response": "Knuckle Puck",
        "source": "hotpot_qa"
    },
    {
        "query": "Who published the game Iron Man and X-O Manowar in Heavy Metal, for Sega's 32 bit game console?",
        "response": "Acclaim Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "from 2003 to 2009, Charlie Sadler was the defensive ends coach for a football team that plays its home games at which stadium ?",
        "response": "Jones AT&T Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Free will theorem published in the Foundations of Physics/",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the comedy film that starred an American actress who played Erin Hannon in \"The Office\"?",
        "response": "Jake Kasdan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jonathan Demme and Chris Renaud both American filmmakers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Make America Number 1 super PAC's largest donor is better known as whom?",
        "response": "Bob Mercer",
        "source": "hotpot_qa"
    },
    {
        "query": "It's an Adventure, Charlie Brown inspired what Saturday morning show that aired from 1983 to 1985?",
        "response": "The Charlie Brown and Snoopy Show",
        "source": "hotpot_qa"
    },
    {
        "query": "MV Gadila was one of nine Anglo Saxon oil tankers from which multinational oil and gas company headquartered in the Netherlands?",
        "response": "Royal Dutch Shell",
        "source": "hotpot_qa"
    },
    {
        "query": "How many passengers has the rail service, that uses Burke Centre, carried in fiscal year 2013?",
        "response": "8.04 million passengers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2008 Australian comedy-drama film in which Rhys Wakefield played Thomas Mollison?",
        "response": "Elissa Down",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this city, which is also known as \"The City of the Crosses\" and is located 60 miles (97 km) east of Luna City, New Mexico, United States?",
        "response": "Las Cruces",
        "source": "hotpot_qa"
    },
    {
        "query": "Olaf Stapledon and Maurice Maeterlinck, are British?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was Mark Dacascos featured in first, Brotherhood of the Wolf or Cradle 2 the Grave?",
        "response": "Brotherhood of the Wolf",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played June Moone's role in 2016?",
        "response": "Cara Jocelyn Delevingne",
        "source": "hotpot_qa"
    },
    {
        "query": "Which New York City based newspaper named Rhonda Lee Vincent \"the new Queen of Bluegrass\"?",
        "response": "The Wall Street Journal",
        "source": "hotpot_qa"
    },
    {
        "query": "During which years was the politician, upon whom the character Allison Taylor from \"24\" is baded, First Lady of the United States?",
        "response": "1993 to 2001",
        "source": "hotpot_qa"
    },
    {
        "query": "What American indie rock group first had Jesse Sandoval as the drummer and now has Jon Sortland on drums?",
        "response": "The Shins",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population according to the 2007 population census of the city in which the National Archives and Library of Ethiopia is located?",
        "response": "3,384,569",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed 149 films between 1907 and 1926, Luis Buñuel or J. Searle Dawley ?",
        "response": "James Searle Dawley",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Cross Florida Barge Canal and Lake Worth Lagoon both located in Florida?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "How old was Rose Hartwick Thorpe when she wrote the poem she would be largely remembered for writing? ",
        "response": "16 years old",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Khady Sylla and György Pálfi from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What private research university in New York City was Vinnie Yablonski enrolled in?",
        "response": "Fordham University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which system by Hero Games is a combination of the Interlock and HERO systems? ",
        "response": "Fuzion",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the unit who fought in the war in the 1807 - 1814 war against Napoleon?",
        "response": "Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Looking for... the best is an album by the man who set a Guinness World Record as the most watched man on TV, and was released in Germany when?",
        "response": "October 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the woman whose former chief of staff was Rachel Noerdlinger born?",
        "response": "1954",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following directors was a friend of Max Reinhardt: Marco Bellocchio or F. W. Murnau?",
        "response": "Friedrich Wilhelm \"F. W.\" Murnau",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the voice of the character who owned a left-handed store in the \"When Flanders Failed\" episode of \"The Simpsons\"?",
        "response": "Harry Shearer",
        "source": "hotpot_qa"
    },
    {
        "query": "The woman that anchored \"Our World\" with Ray Gandolf was a Washington, D.C. correspondent for what network?",
        "response": "NBC News",
        "source": "hotpot_qa"
    },
    {
        "query": "While at the University of Michigan, Louis Smith played with what American jazz trumpeter, bandleader, and composer?",
        "response": "Miles Dewey Davis III",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Winnie the Pooh\" is the title song for the franchise of the same name, a music video was released for this version and it was included in The Many Adventures of Winnie the Pooh,  an American animated film produced by Walt Disney Productions and distributed by Buena Vista Distribution, released in what year?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "What two countries supported the project that Louis Slotin died working on?",
        "response": "the United Kingdom and Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Bruno Soares or Ilie Năstase?",
        "response": "Ilie \"Nasty\" Năstase",
        "source": "hotpot_qa"
    },
    {
        "query": "Which First Nations group of over 200'000 members living in Canada signed an accord with the Quebec government, leading to the creation of Eeyou Istchee James Bay Territory?",
        "response": "The Cree",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born last, Dave Peverett or Jang Hyun-seung?",
        "response": "Jang Hyun-seung",
        "source": "hotpot_qa"
    },
    {
        "query": "In which ancient civilzation of ancient Northeastern Africa did the official Djehuty under the ruling queen Hatshepsut live? ",
        "response": "Ancient Egypt",
        "source": "hotpot_qa"
    },
    {
        "query": "What Greek mathematician who spend most of his professional life in Germany lends his name to the Vitali–Carathéodory theorem?",
        "response": "Constantin Carathéodory",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rolling Stones album that contains the song \"Sweet Black Angel\" was released in what country?",
        "response": "United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people were killed by Hyatt Regency walkway collapse in Kansas City, Missouri on July 17, 1981?",
        "response": "114",
        "source": "hotpot_qa"
    },
    {
        "query": "Roland Harper, is a former professional American football player who played running back for eight seasons for the Chicago Bears, he was a starting fullback known in his playing days as a punishing blocker who opened holes in opposing defenses for which star halfback, and an American football running back who played for the Chicago Bears of the National Football League (NFL) for thirteen seasons?",
        "response": "Walter Jerry Payton",
        "source": "hotpot_qa"
    },
    {
        "query": "The person that formed The Jeff Beck Group had been a guitarist in a group formed when? ",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "The 204th overall pick in the 2010 NHL draft played for a European club located in which country?",
        "response": "Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which contract killer that goes by alias 'Daddy' entered the Mumbai underworld in the 1970's?",
        "response": "Arun Gawli",
        "source": "hotpot_qa"
    },
    {
        "query": "What role-playing game, published by Dream Pod 9 in 1992, had it's graphics designed by Ghislain Barbe?",
        "response": "Jovian Chronicles",
        "source": "hotpot_qa"
    },
    {
        "query": "Haleakala Trail is now part of a national park covering how many acres?",
        "response": "33,265",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the show's pilot episode that John Bliss played Irving Pal in?",
        "response": "September 7, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the company that developed the Nokia 130 start operating?",
        "response": "December 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "Isidorus led a revolt during the reign of an emperor who was the last of a group known as the what?",
        "response": "Five Good Emperors",
        "source": "hotpot_qa"
    },
    {
        "query": "Which intercity train station services a university that ranks in the top 2% and in 2015 had an enrollment of over 32,000 students?",
        "response": "Coniston",
        "source": "hotpot_qa"
    },
    {
        "query": "The band who performs \"Sunny Sundae Smile\" was formed in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Naval Station Bremerton located?",
        "response": "Washington state",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a 2015 zombie film with Northern Irish actor?",
        "response": "Dougray Scott",
        "source": "hotpot_qa"
    },
    {
        "query": "Kristofor Brown was the head writer of an MTV show created by who?",
        "response": "Mike Judge",
        "source": "hotpot_qa"
    },
    {
        "query": "Not including Arizona, what U.S. State's border is on Lake Mead located near the Hoover Damn?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Dramaturgy is a sociological perspective commonly used in microsociological accounts of social interaction in everyday life,  later acknowledge as an influence, had earlier presented his notions of dramatism in 1945, which in turn derives from Shakespeare, what's the phrase that begins a monologue from William Shakespeare's, \"As You Like It\", spoken by the melancholy Jaques in Act II Scene VII?",
        "response": "All the world's a stage",
        "source": "hotpot_qa"
    },
    {
        "query": " How does the Ralph Saenz is differentiated by Daron Malakian?",
        "response": "He is best known as the lead singer for the comedic glam metal band Steel Panther",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American world boxing champion thatwho met with  Sammy Angott?",
        "response": "Henry Armstrong",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the river that comes out of the Appalachian mountains and runs past Embreeville, Tennessee?",
        "response": "Nolichucky River",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the bands Foje and Evermore both come out of Feilding, New Zealand?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Sandra Buckler is a former director of communications for the Office of the Prime Minister of Canada under Conservative Party of Canada Prime Minister Stephen Harper, she joined Canadian Tire Corporation, Limited, a Canadian retail company which sells a wide range of automotive, sports and leisure, and home products, as Vice President of communications in which year?",
        "response": "2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Night of Champions in 2009 was held at what multi-purpose indoor arena in Philadelphia?",
        "response": "Wells Fargo Center",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality where Terry Disley and Billy Bragg?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "When was a ballet company founded who's most popular performance is a two-act ballet choreographed by Marius Petipa and Lev Ivanov?",
        "response": "1997",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1979–80 Colorado Rockies season was the franchise's fourth season in Colorado and their sixth in the NHL, trrying to jolt the fan base and create some excitement for the club, the team hired Don Cherry away from which organization?",
        "response": "Boston Bruins",
        "source": "hotpot_qa"
    },
    {
        "query": "who was an American composer, Dean Parisot or Victor Schertzinger?",
        "response": "Victor L. Schertzinger",
        "source": "hotpot_qa"
    },
    {
        "query": "On which semi-autobiographical film is based the 2009 romantic musical drama, which features an ensemble cast including the English actress who made her debut with the Old Vic Company?",
        "response": "8½",
        "source": "hotpot_qa"
    },
    {
        "query": "Nathan S. Beman begam president of what college in 1818, which is located in the in the sixth largest city in Georgia?",
        "response": "Franklin College",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the meaning of the nickname of Messalina's second-cousin?",
        "response": "\"little soldier's boot\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Joe Orton and Henry James, which author is the adjective \"Ortonesque\" used to refer to his work?",
        "response": "John Kingsley \"Joe\" Orton",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original stage name of the artist who recorded the song element ?",
        "response": "K-Dot",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Macfusion's network file systems based on?",
        "response": "Macfusion is an open-source network file-system client, based on FUSE, CurlFtpFS",
        "source": "hotpot_qa"
    },
    {
        "query": "Emmett Brown rides in a sports car that features what type of doors?",
        "response": "gull-wing doors",
        "source": "hotpot_qa"
    },
    {
        "query": "Which occurred first, the first publication of The Ladder or Heat?",
        "response": "The Ladder",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game show hosted by Mike O'Malley had celebrity guest episodes starring the cast of Welcome Freshmen?",
        "response": "Get the Picture",
        "source": "hotpot_qa"
    },
    {
        "query": "The player traded from the Indiana Packers to the Oklahoma City Thunder prior to the 2017-18 season was born in what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Whenever You Need Somebody\" by O'Chi Brown was recycled by the song's producers for an English singer who by time of his retirement in 1993 had sold approximately how many records worldwide?",
        "response": "40 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Tunnel Vision is a single from an album, when was the album released?",
        "response": "March 31, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the middle names of the senator who is running for reelection in the United States Senate election in Michigan, 2018 ?",
        "response": "Ann Greer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Slappy and the Stinkers was born in the year 1960 ?",
        "response": "B. D. Wong",
        "source": "hotpot_qa"
    },
    {
        "query": "Which guitar brand was endorsed by the band centered by Ann and Nancy Wilson?",
        "response": "Kramer Guitars",
        "source": "hotpot_qa"
    },
    {
        "query": "Which short film was directed by John Sanford and Elaine Bogan for the How to Train Your Dragon franchise?",
        "response": "Dawn of the Dragon Racers",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Green starred in the 2014 film Noble and what Showtime and Sky series?",
        "response": "\"Penny Dreadful\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the album on which the Beatles covered a song from the album The Fabulous Miracles by The Miracles?",
        "response": "With the Beatles",
        "source": "hotpot_qa"
    },
    {
        "query": "The professor that Melba Newell Phillips completed her doctoral studies under participated in what World War II project?",
        "response": "the Manhattan Project",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the actor who was replaced by Jeong Jae-heon on \"\"?",
        "response": "October 2, 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Raga Jaunpuri , Jonpuri, or Javanpuri is a rāga in Hindustani classical music, some experts consider it indistinguishable from the shuddha rishabh, in which titled Hindustani classical raga thaat?",
        "response": "Asavari",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a considered a better tennis player, Martina Navratilova or Jack Sock?",
        "response": "Martina Navratilova",
        "source": "hotpot_qa"
    },
    {
        "query": "Len Wiseman and Ken Kwapis, are Americans, that have which occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Narakasuravadham is an Aattakatha authored by a maharajah that was born in what year?",
        "response": "1724",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation Soberanía was a planned invasion due to a conflict over the possession of what islands?",
        "response": "Picton, Lennox and Nueva islands",
        "source": "hotpot_qa"
    },
    {
        "query": "What is Rob Houwer and Paul Verhoeven's nationality?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "Second Skin and Out of Place, are films of which genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American banjo player was featured in the album \"Once in a Very Blue Moon\"",
        "response": "Béla Fleck",
        "source": "hotpot_qa"
    },
    {
        "query": "Kansai International Airport, is an international airport located on an artificial island in the middle of Osaka Bay, 38 km southwest of Ōsaka Station, the airport serves as an international hub for Nippon Cargo Airlines Company, Limited, or NCA, a cargo airline with its head office on the property of Narita International Airport in Narita, Chiba Prefecture, outside Tokyo, its main base is where?",
        "response": "Narita Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state did Jamie Aube win a race in the  NASCAR Busch Series?",
        "response": "Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the series creators of the show whose 186th episode is titled \"Fishsticks\"?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a contributor to the journal \"FIRE!!\" who was also a visual arts educator?",
        "response": "Aaron Douglas",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the husband of the first olympic gymnast to be awarded a perfect score of 10.0?",
        "response": "Bart Conner",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Langside involved a dispute between James VI and his sister, who was locked away in which location?",
        "response": "Loch Leven Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "The Republican Party was known to be made up primarily of ethnic groups composed of descendants who settled in Liberia from what year?",
        "response": "1822",
        "source": "hotpot_qa"
    },
    {
        "query": "Word of Mouth is the third studio album by English-Irish boy band The Wanted, and was preceded by the release of six singles, including Walks Like Rihanna, and was released in the United Kingdom and Ireland, on which date?",
        "response": "23 June 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "The Swedish group Rednex's \"Cotton Eye Joe\" got its inspiration from folk songs that are today mostly associated with which part of the US?",
        "response": "American South",
        "source": "hotpot_qa"
    },
    {
        "query": "What UK TV series did Lucy Pargeter land thrid place?",
        "response": "I'm a Celebrity...Get Me Out of Here!",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is located in Tenerife (Canary Islands, Spain) Teide National Park or Cabañeros National Park?",
        "response": "Teide National Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Denton and Albert Costa are both tennis players, which one began playing at the age if five?",
        "response": "Costa",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American patriot Hamilton, New York Wass named after born?",
        "response": "January 11, 1755 or 1757July",
        "source": "hotpot_qa"
    },
    {
        "query": "Cassius Marcellus Clay Sr. is the father of this American former heavyweight boxer, younger brother to Muhammad, born in what year?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "What sports league did a star of Learning the Ropes play in?",
        "response": "the National Football League",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2005 Florida Atlantic University Owls football team represented Florida Atlantic University in the 2005 NCAA Division I-A football season, the team was coached by Howard Leslie Schnellenberger, an retired football coach, of which nationality, with long service at both the professional and college levels?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Leighton Meester made her Broadway debut in a novella written by who ?",
        "response": "John Steinbeck",
        "source": "hotpot_qa"
    },
    {
        "query": "Edwin Brockholst Livingston is related to the lawyer and politician of what state who was also a Founding Father?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Filipino-owned regional boutique airline company, which owns an airstrip at El Nido Airport, formerly known as?",
        "response": "Island Transvoyager",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of the current manager of Maidenhead United appeared more than 100 times in what football league?",
        "response": "The Football League for Chester and Crystal Palace",
        "source": "hotpot_qa"
    },
    {
        "query": "The largest bank by assets in Pakistan formed a Pakistani football club based in which city ?",
        "response": "Karachi",
        "source": "hotpot_qa"
    },
    {
        "query": "Frew McMillan and Billy Martin, have which previous occupation in common?",
        "response": "professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "What band did Gator Country guitarist that co-wrote Bloody Reunion come from?",
        "response": "Molly Hatchet",
        "source": "hotpot_qa"
    },
    {
        "query": "How many film and television roles has the actress had, who starred in Something Wicked This Way Comes, with Jason Robards, Jonathan Pryce, and Pam Grier ?",
        "response": "over 120",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Flight of the Navigator and Popeye considered films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Live  is a song that was covered by which Los Angeles-based pop-rock band?",
        "response": "The Bangles",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Dead Milkmen and Thousand Foot Krutch from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who were Joan Didion and Aleister Crowley?",
        "response": "Aleister Crowley ( ; born Edward Alexander Crowley; 12 October 1875 – 1 December 1947) was an English occultist, ceremonial magician, poet, painter, novelist, and mountaineer.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is in the family Asparagaceae, Anoda or Dipcadi?",
        "response": "Dipcadi",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was founded first, High Times or Airliners?",
        "response": "High Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Georgia was released in 2016 during which annual event, held in April?",
        "response": "Record Store Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Jerome Robbins and K-Michel Parandi an American filmmaker?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Empire of the Sun or 3 Doors Down have more band members?",
        "response": "3 Doors Down",
        "source": "hotpot_qa"
    },
    {
        "query": "How much did the director of Die Hard 2 bring in from his 1993 movie about a mountain climber?",
        "response": "$255 million worldwide",
        "source": "hotpot_qa"
    },
    {
        "query": "The character Sandy on the radio program \"Round the Home\" was played by an actor that died in what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "WHAT WAS THE NAME OF THE BOOK MADE INTO THE 2015 SOUTH KOREAN CRIME THRILLER, THE DEAL, DIRECTED BY SON YONG-HO AND FEATURING SOUTH KOREAN ACTOR PARK SUNG-WOONG (BORN JANUARY 9, 1973) AS A SERIAL KILLER?",
        "response": "\"Murder Request\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor played Lewis in a 2012 American romantic comedy film directed by Gabriele Muccino?",
        "response": "Noah Lomax",
        "source": "hotpot_qa"
    },
    {
        "query": "In what month was the crash that Dennis Nielsen is most widely known for having participated in the rescue effort for?",
        "response": "July",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population at the 2010 census of the town which is connected to Lewiston, Maine by Maine State Route 126?",
        "response": "1,527",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach of the Missouri Tigers women's basketball team that was hired in 2010?",
        "response": "Robin Pingeton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American cinematographer is best know  for his work in a 1998 American romantic comedy-drama film directed by Nora Ephron?",
        "response": "John Warwick Lindley",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the company that came out with VisionPLUS headquartered?",
        "response": "Atlanta, Georgia, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birthday of the man who Don Melnick's position is named after?",
        "response": "September 25, 1866",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Fastbacks and Local Natives both from the same US state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rail network that was established in 2007 and serves a large part of Greater London also manages and serves Kensington?",
        "response": "London Overground",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the monarch of Norway ascend to the throne?",
        "response": "17 January 1991",
        "source": "hotpot_qa"
    },
    {
        "query": "Sunrise Mall is a two-story, enclosed shopping mall in Corpus Christi, Texas, tenants include Planet Fitness, an American franchisor and operator of fitness centers based in Hampton, in which US state?",
        "response": "New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the record label founded by the member of the Wu-Tang Clan who made an album inspired by a comic book in 2013?",
        "response": "Starks Enterprises",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an award-winning Austrian artist, filmmaker, writer, actor, curator, theatre director and lecturer, Johannes Grenzfurthner or Jaap Speyer?",
        "response": "Johannes Grenzfurthner",
        "source": "hotpot_qa"
    },
    {
        "query": "What heroic qualities are anti-hero, Seth Gecko, lacking?",
        "response": "idealism, courage, or morality",
        "source": "hotpot_qa"
    },
    {
        "query": "What song by a Barbadian singer was covered by Marié Christina Digby?",
        "response": "\"Umbrella\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What American prison inmate shot and killed John Lennon?",
        "response": "Mark David Chapman",
        "source": "hotpot_qa"
    },
    {
        "query": "This revamped Nigerian-based record label founded by Don Jazzy is home to recording artists such as a Nigerian singer and songwriter best known for his hit single called what?",
        "response": "Godwin",
        "source": "hotpot_qa"
    },
    {
        "query": "Do You Believe? starred the football player who played for what team?",
        "response": "Seattle Seahawks",
        "source": "hotpot_qa"
    },
    {
        "query": "Pedro Mascarenhas was the first to explore the island atoll that comprises what landform?",
        "response": "Chagos Archipelago",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, Nick Cave and the Bad Seeds or the Scanners?",
        "response": "Nick Cave and the Bad Seeds",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the actor who played Edward Snowden act in a movie with Heath Ledger and Julia Styles?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "who is the younger brother of The episode guest stars of The Hard Easy ",
        "response": "Bill Murray",
        "source": "hotpot_qa"
    },
    {
        "query": "Bryan Sterling, was an authority on the life and work of which American political commentator, humorist, and entertainer , he scripted and co-produced \"Will Rogers' USA,\" a one-man Broadway play about Rogers starring actor James Whitmore, he was an American film, theatre, and television actor?",
        "response": "Will Rogers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this English naturalist, geologist and biologist who mentioned the French botanist, Henri Lecoq, 1859 in the preface of his book?",
        "response": "Charles Darwin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is longer, the Lake Washington Ship Canal or the Colorado River Aqueduct?",
        "response": "The Colorado River Aqueduct",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Jarvis Cocker and Hoodoo Gurus are musians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Nuruddin Farah and Rachel Carson Somali novelists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What country does the professional footballer play for who has a older brother that plays as a winger for Bolton Wanderers?",
        "response": "Nigerian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Walking with Beasts or Rosenwald?",
        "response": "Walking with Beasts",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Grindelia and Jaborosa have in common?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Rips the Covers Off was an album by the hard rock band formed in what year?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "What film that Bill Tytla worked on came out in 1937?",
        "response": "Snow White and the Seven Dwarfs",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the man that popularized the Nanissáanah shoot an enemy?",
        "response": "August 5, 1881",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miniaturist was inspired by a woman of what nationality?",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2016 population of the town that Tura Beach, New South Wales is a suburb of?",
        "response": "3,544",
        "source": "hotpot_qa"
    },
    {
        "query": "Whats was the population in 2003 of Centralia, the least populated municipality in Pennsylvania, USA?",
        "response": "7",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress, born on May 23, 1919, starred in the 1949 film \"Neptune's Daughter\"?",
        "response": "Elizabeth \"Betty\" Garrett",
        "source": "hotpot_qa"
    },
    {
        "query": "On the coast of what ocean is the birthplace of Diogal Sakho?",
        "response": "Atlantic",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the school loacted in Lawrence Township, New Jersey attended by Lewis Perry?",
        "response": "Lawrenceville School",
        "source": "hotpot_qa"
    },
    {
        "query": "The Magne Charge system was produced by a General Motors subsidiary based in what Indiana town?",
        "response": "Kokomo",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what countries was Strut-Harald's half-brother the king?",
        "response": "Denmark and Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the operational conversion unit of the aerial warfare branch of the Australian Defence Force formed?",
        "response": "December 1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Tom Blankenship is an American rock musician, he currently plays bass guitar for My Morning Jacket is an American rock band, formed in Louisville, Kentucky in what year?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed in a country closer to England, Kodaline or Rivermaya ?",
        "response": "Kodaline",
        "source": "hotpot_qa"
    },
    {
        "query": "What community is the team Isaac Gómez played midfielder for located?",
        "response": "the autonomous community of Madrid",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country are the Cathedral of the Holy Spirit and St. Joseph High School located?",
        "response": "Turkey",
        "source": "hotpot_qa"
    },
    {
        "query": "Warren Truss continued as Deputy Prime Minister, until he retired in 2016 and was replaced by a politician born in which year ?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Parasite\" is a kind of text that has how many words?",
        "response": "between 7,500 and 40,000",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the code name for this Allied operation in WWII, also known as D-Day?",
        "response": "Operation Overlord",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the AVN Media Network hold it's yearly expo?",
        "response": "Las Vegas, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "What coach during the 2014-15 NCAA Division 1 men's basketball season saw one of his players go on to play for the Atlanta Hawks?",
        "response": "Mike Krzyzewski",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Filipino name of the university which Jai Reyes attended?",
        "response": "Pamantasang Ateneo de Manila",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist has sold over 100 million records worldwide and also created an album that included \"Every picture tells a story\"? ",
        "response": "Rod Stewart",
        "source": "hotpot_qa"
    },
    {
        "query": "Heathrow Terminal 3 is the base for an airline established in what year?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "“Regarding Margie” is an episode from a Simpson's season that was released in Region 1 on which day ?",
        "response": "December 2, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "David Wildstein was a director overseeing the Port Authority in what two states does it have jurisdiction?",
        "response": "New York and New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are shopping malls like The Promenade at Sagemore often located? ",
        "response": "affluent suburban areas",
        "source": "hotpot_qa"
    },
    {
        "query": "The painting The Quarrel of Oberon and Titania depicts a scene from a Shakespeare play that portrays the events surrounding the marriage of Theseus to who?",
        "response": "Hippolyta",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dance form of Alex Magno originated in the mid-1970s in NY?",
        "response": "Salsa",
        "source": "hotpot_qa"
    },
    {
        "query": "What MTV television drama starred an actor who had once boxed with a boxer born in Belarus?",
        "response": "\"Skins\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Kim Guadagno, an American politician, attorney, former Sheriff, and first Lieutenant Governor of New Jersey, ran as the Republican party nominee for the election occurring on what day in 2017?",
        "response": "November 7",
        "source": "hotpot_qa"
    },
    {
        "query": "William Gaddis and Virginia Woolf, are Americans?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Dancing Barefoot\" is a rock song written by what artist whose debut album was called \"Horses\"?",
        "response": "Patti Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "In Dreams from My Real Father: A Story of Reds and Deception, the person who is presented as Barack Obama's biological father is born on what date?",
        "response": "December 31, 1905",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mysterious Origins of Man included material by the man who goes by what devotional name?",
        "response": "Drutakarmā dāsa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which comune is located in Latium, the city in Rome which grew to be the capital of the Roman Empire?",
        "response": "Paganico Sabino",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the warfare branch that includes the No. 3 Operational Training Unit (3OTU), and was formed March 1921?",
        "response": "The Royal Australian Air Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Giacomo Gentilomo or Samira Makhmalbaf?",
        "response": "Giacomo Gentilomo",
        "source": "hotpot_qa"
    },
    {
        "query": "116th Street lies in what community district?",
        "response": "Manhattan Community District 11",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man owns the company that owns Fox Sports Ohio?",
        "response": "Rupert Murdoch",
        "source": "hotpot_qa"
    },
    {
        "query": "Which large mammal that appears in the engraving for the Wildebeest Kuil Rock Art Centre, is one of any five extant species of odd-toed ungulates in the family Rhinocerotidae?",
        "response": "rhinoceros",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor starred in Brother from Another Series born? ",
        "response": "April 3, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the beach in the town of West Tisbury on the island of Martha's Vineyard? ",
        "response": "Lambert's Cove Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "What county is The Northland Arboretum located in?",
        "response": "Crow Wing County",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is the Grist mill located in a town apart of Great Neck in Nassau County, New york with a population of 830 per the 2010 census",
        "response": "2 ⁄ -story gambrel-roofed structure",
        "source": "hotpot_qa"
    },
    {
        "query": "The fictional private detective that appears in \"The Adventure of the Seven Clocks\" what written by whom?",
        "response": "Sir Arthur Conan Doyle",
        "source": "hotpot_qa"
    },
    {
        "query": "Pietro Abbati Marescotti taught mathematics in what comune on the south side of the Po Valley?",
        "response": "Modena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which science fiction author and game designer wrote the \"Star Wars\" novel \"Crucible\"?",
        "response": "Troy Denning",
        "source": "hotpot_qa"
    },
    {
        "query": "How old is the woman in the Park Chul-soo film that premiered at the 2005 Sundance Film Festival?",
        "response": "thirty-two-year-old",
        "source": "hotpot_qa"
    },
    {
        "query": "Which castle serving as the seat of clan chief John MacLeod of Macleod was was remodelled in a mock-medieval style?",
        "response": "Dunvegan Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Emily Haines and Dickie Peterson both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What music genre do Richard Ashcroft and the band Galaxie 500 play?",
        "response": "alternative rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the green that centres the village where Greystoke Castle is located, surrounded by?",
        "response": "stone houses and cottages.",
        "source": "hotpot_qa"
    },
    {
        "query": "Sahara was turned into a film directed by whom?",
        "response": "Breck Eisner",
        "source": "hotpot_qa"
    },
    {
        "query": "During which period the sedan variant of the Volvo V50 car was manufactured?",
        "response": "1995 to 2012",
        "source": "hotpot_qa"
    },
    {
        "query": "American Airlines Flight 11 was flying away from the airport in what major city?",
        "response": "Boston",
        "source": "hotpot_qa"
    },
    {
        "query": "Belle Gold is a fictional character portrayed by an actress born in which year ?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "The front man for the band The Ballas Hough Band was born in what year?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Wynn Resorts and Wynn Macau share who as their CEO?",
        "response": "Steve Wynn",
        "source": "hotpot_qa"
    },
    {
        "query": "According to Jim is an American sitcom television series starring an American comic actor, voice actor, comedian, singer and what?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Less Than Jake and Wheatus connected?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the HBO play adaptation  about A Gay Fantasia on National Themes, stars Meryl Streep?",
        "response": "Angels in America",
        "source": "hotpot_qa"
    },
    {
        "query": "Which entertainment complex located in Blackpool, Lancashire, England, hosted the 2007 World Matchplay?",
        "response": "Winter Gardens, Blackpool",
        "source": "hotpot_qa"
    },
    {
        "query": "In which of the 13 countries that Telenor owns networks is Grameen Telecom located?",
        "response": "Bangladesh",
        "source": "hotpot_qa"
    },
    {
        "query": "which  Sydney-based Australian actor, hosted Monster House",
        "response": "Bernard Curry",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has McGruff works alongside who started with the hip hop trio, Three the Hard Way?",
        "response": "Big L",
        "source": "hotpot_qa"
    },
    {
        "query": "What episode of South Park was the episode that aired in May before Funnybot?",
        "response": "146th",
        "source": "hotpot_qa"
    },
    {
        "query": "Sugarcult and Morphine are both what types of groups?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bethune–Cookman Wildcats, are the athletic teams that represent which private, co-ed, historically black university located in Daytona Beach, Florida?",
        "response": "Bethune–Cookman University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is based off of more stories, Bedknobs and Broomsticks or The Little Mermaid",
        "response": "Bedknobs and Broomsticks",
        "source": "hotpot_qa"
    },
    {
        "query": "Under which Roman Emperor's effective conquest of Britain was it possible that Jews visited Scotland?",
        "response": "Emperor Claudius",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is Hawthornden Castle located relative to a castle 9 miles south of Edinburgh?",
        "response": "downstream",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director has won three Academy of Canadian Cinema and Television Awards for Best Motion Picture, Sathish Kalathil or Denis Villeneuve?  ",
        "response": "Denis Villeneuve",
        "source": "hotpot_qa"
    },
    {
        "query": "Productions filmed at Space Studios Mancheter include a BBC drama television series that is based on what Israeli series?",
        "response": "Yellow Peppers",
        "source": "hotpot_qa"
    },
    {
        "query": "This Godless Endeavor, is the sixth album by which American progressive metal band from Seattle, Washington, United States?",
        "response": "Nevermore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Takin' Place or Lake of Fire?",
        "response": "Lake of Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "What American author born in 1915, and won a Pulitzer Prize for Fiction, wrote the 1965 novel, 'Don't Stop the Carnival'?",
        "response": "Herman Wouk",
        "source": "hotpot_qa"
    },
    {
        "query": "From which ethnic tribe hail the Catuvellani, a settlement of whose can be found near the city of St Albans in Hertfordshire?",
        "response": "Celtic tribe",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first David Draiman or Terry Kath?",
        "response": "David Michael Draiman",
        "source": "hotpot_qa"
    },
    {
        "query": "In which language is the notable song by Suresh Peters from \"Gentleman \"?",
        "response": "Tamil",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American politician was the 61st Governor of Maryland and had help on his first campaign in 1998 from Richard Burton?",
        "response": "Martin O'Malley",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the comedy film which was written by Tina Fey and based on a book by American parenting educator Rosalind Wiseman?",
        "response": "Mark Waters",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has won more Grand Slam women's doubles titles, Lisa Raymond or Liezel Huber?",
        "response": "Liezel Huber",
        "source": "hotpot_qa"
    },
    {
        "query": "Do You Believe Me Now is the second studio album of American country music singer Jimmy Wayne, the album is also Wayne's first album in five years and his debut for Valory Music Group, a subsidiary of which independent American record label specializing in country and pop artists, and  based on Music Row in Nashville, Tennessee, and is distributed by Universal Music Group (UMG)?",
        "response": "Big Machine Records, LLC",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Steve Miller and Jun. K from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The official remix of Up! features a rapper who was shot how many times in 2000?",
        "response": "nine",
        "source": "hotpot_qa"
    },
    {
        "query": "Transocean Air Lines Flight 512 crashed into the Pacific Ocean east of which island that is one of the most isolated islands in the world?  ",
        "response": "Wake Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Epworth by the Sea is named after a small town in what part of North Lincolnshire, England?",
        "response": "Axholme",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the last date the creator of  the NOI was seen by Elijah Muhammad?",
        "response": "last seen in 1933",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did the band that included Romy and Oliver Sim, and Jamie xx record their first album?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the actor who was a leading man of Michèle Mercier and born on November 3, 1921?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Willi Forst and William Nigh both actors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did the star of Mean Machine play?",
        "response": "midfielder",
        "source": "hotpot_qa"
    },
    {
        "query": "The music program \"Yesterday\" was named after a song from what Beatles album?",
        "response": "Help!",
        "source": "hotpot_qa"
    },
    {
        "query": "The  folklore  which Daniel C. Taylor gavea definitive explanation for the century-old is for which people ",
        "response": "Nepal,",
        "source": "hotpot_qa"
    },
    {
        "query": "What song was co-written by Verse Simmonds and can be found in an album know as \"Loud\" (2010)?",
        "response": "Man Down",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worew and directed the 2000 film in which Ameesha Patel made her acting debut?",
        "response": "Rakesh Roshan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city, commonly referred to as \"the District\", showed a play from January 19-24, 1931 at the National Theatre entitled Green Grow the Lilacs? ",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band was formed first, Aaroh or Goldfinger?",
        "response": "Goldfinger",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director won an oscar Dziga Vertov or Robert Benton?",
        "response": "Robert Douglas Benton",
        "source": "hotpot_qa"
    },
    {
        "query": "Twins Brook and Robin Lopez were drafted as professional basketball players in what year?",
        "response": "2008",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cast member from the original 1984 movie made a cameo appearance in the 2016 comedy remake?",
        "response": "Dan Aykroyd",
        "source": "hotpot_qa"
    },
    {
        "query": "In the CBS television sitcome Double Rush, Johnny Verona, manager of a bicycle delivery service in New York City was played by an actor of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country is the grading system based on a 1/4 point scale and has five letter grades?",
        "response": "the United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bawku municipal district is part of what region?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "Which premiered first, the TV series Eden of the East or the movie Mary and Max?",
        "response": "Mary and Max",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lillian Carter Center for International Nursing is named after a woman who was a Peace Corps volunteer in what country?",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a provincial capital, Zhengzhou or Huangzhou District?",
        "response": "Zhengzhou",
        "source": "hotpot_qa"
    },
    {
        "query": "What Player Draft was held at Gaddafi Stadium and initial squads were finalised in Decenber 2015?",
        "response": "2016 Pakistan Super League players draft",
        "source": "hotpot_qa"
    },
    {
        "query": "Sofian El Fani's credits include a 2013 French coming-of-age romantic drama film based on a graphic novel by who?",
        "response": "Julie Maroh",
        "source": "hotpot_qa"
    },
    {
        "query": "Omni Group's DICT client differs from the application known as Dictionary, developed by what company as part of macOS?",
        "response": "Apple Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "From which country is the composer of La cetra, published in 1727?",
        "response": "Antonio Lucio Vivaldi (] ; 4 March 1678 – 28 July 1741) was an Italian Baroque composer,",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre is the film whose character inspired the name of Anelosimus dude?",
        "response": "crime comedy",
        "source": "hotpot_qa"
    },
    {
        "query": "The cartoon network is operated by who?",
        "response": "Turner Broadcasting System Asia Pacific",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the origin city and state of the singer in which Jorge Salan played lead guitarist for in an European tour?",
        "response": "Brooklyn, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Shelving worked at the Stratford-upon-Avon theatre that has how many seats?",
        "response": "1,040+",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the company which had Dr. Lawrence A. May as former chairman of it's Medical Advisory Board ?",
        "response": "Mark Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Dutch painter specialized in domestic interior scenes of middle class life and has a painting of a young woman dressed in a yellow shawl in the Louvre, Paris?",
        "response": "Johannes Vermeer",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this high-speed banked oval that this motor racing circuit in Melbourne, Victoria, Australia, had where 2001 Calder Park V8 Supercar round took place?",
        "response": "Thunderdome",
        "source": "hotpot_qa"
    },
    {
        "query": "Which canal was completed first, the Erie Canal or the Carondelet Canal?",
        "response": "The Carondelet Canal",
        "source": "hotpot_qa"
    },
    {
        "query": "Does George Bernard Shaw or E. L. Doctorow write plays?",
        "response": "George Bernard Shaw",
        "source": "hotpot_qa"
    },
    {
        "query": "The drama film The Journey is a fictional account of the true story of political enemies, Ian Paisley and which Irish republican?",
        "response": "James Martin Pacelli McGuinness",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the scientific name of the true creature featured in \"Creature from the Black Lagoon?",
        "response": "Eucritta melanolimnetes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2nd Army Corps took part in the Battle of Tannenberg,  fought between Russia and Germany from 26–30 August 1914, during the first month of what war?",
        "response": "World War I",
        "source": "hotpot_qa"
    },
    {
        "query": "Under what name did the founder and lead guitarist of the band Porcupine Tree use when he released his album Indicates Void?",
        "response": "Bass Communion",
        "source": "hotpot_qa"
    },
    {
        "query": "Have filmmakers Brent Hodge and Ayoub Qanir both received awards for their work?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the poker players on I Bet You is Irish?",
        "response": "Philip \"Phil\" Courtney Laak",
        "source": "hotpot_qa"
    },
    {
        "query": "What footballer was rejected after a trial by former Northern Ireland football manager born 5 August 1931?",
        "response": "Cochrane",
        "source": "hotpot_qa"
    },
    {
        "query": "Which  province in the north of the island of Ireland did Queen Medb of Connacht  made his invasion",
        "response": "Ulster",
        "source": "hotpot_qa"
    },
    {
        "query": "Alicia Molik and Anna Kournikova, have had which occupation?",
        "response": "former professional tennis player",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth date of a film director who wrote a film based on the anthropomorphic concept that all toys, unknown to humans, are secretly alive?",
        "response": "December 3, 1965",
        "source": "hotpot_qa"
    },
    {
        "query": "The first wife of US President Ronald Reagan starred in a 1945 film directed by whom?",
        "response": "Billy Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the home of the common party princess voiced by Idina Menzel?",
        "response": "Arendelle",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was nominated for more Academy Awards, Vittorio De Sica or Robert Altman?",
        "response": "Robert Bernard Altman",
        "source": "hotpot_qa"
    },
    {
        "query": "Derby Racer was the name of how many wooden roller coasters that operated at Revere Beach in Revere, Massachusetts, both coasters were racing roller coasters, with side-by-side track pairs where two coaster trains would race each other around the circuit of the coaster, a roller coaster train is a vehicle made up of two or more cars connected by specialized joints which transports passengers around a roller coaster's circuit?",
        "response": "two",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Gleneig North and the City of Holdfast Bay are suburbs of what South Australian city?",
        "response": "Adelaide",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Kesha song that was at one point the best-selling digital single in history and parodied by the group The Midnight Beast?",
        "response": "Tik Tok",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Sharleen Spiteri and Cho Kyuhyun from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Kochi 5s was led by which retired Spanish footballer?",
        "response": "Miguel Ángel \"Míchel\" Salgado Fernández",
        "source": "hotpot_qa"
    },
    {
        "query": "Salesman and One Big Hapa Family, are both which type of films?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American worldwide automotive industry components and parts supplier had a division that manufactured the Norge brand of appliances?",
        "response": "BorgWarner",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was the mission founded where Father José Barona, performed his first baptism in San Diego ?",
        "response": "1769",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Andrew Stockdale and Marty Balin have in common?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "could both  Terceira Mastiff and Dachshund be your pet",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Polypodium and Mukdenia considered genus species of ferns?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The Habbaniya is a part of the Baggara people whose name comes from what Arabic word?",
        "response": "badawī",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company has hired Corey Burton as a voice actor for several characters?",
        "response": "The Walt Disney Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the music for Danny Burstein's Tony win in Follies? ",
        "response": "Stephen Sondheim",
        "source": "hotpot_qa"
    },
    {
        "query": "The airport closest to Remington Ranch, Texas was named after what numbered President of the United States?",
        "response": "41st",
        "source": "hotpot_qa"
    },
    {
        "query": "The missile explosion that occurred on September 19, 1980 was discussed in what Eric Schlosser book?",
        "response": "Command and Control",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the plane flown by Kampfgeschwader 55, exclusively untill 1943, designed?",
        "response": "Heinkel Flugzeugwerke",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1971 Oklahoma State Cowboys football team played for the college that was founded in what year?",
        "response": "1890",
        "source": "hotpot_qa"
    }
]