[
    {
        "query": "Svengali is a American pre-Code supernatural drama/horror film, released in which year, produced and distributed by Warner Bros, it stars John Barrymore, he was an American actor on stage, screen and radio, and a member of the Drew and Barrymore theatrical families?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "The first performance of the opera \"Lord Byron\" was choreophraphed by a man that was awarded the Spingarn Medal in what year?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "How long does the lower level degree program, offered at Helene Fuld College of Nursing, typically last?",
        "response": "two years",
        "source": "hotpot_qa"
    },
    {
        "query": "What shows have seen guest appearances by the actor who played the voice of Hamm in \"Toy Story\"?",
        "response": "\"St. Elsewhere\", \"Wings\" and \"Frasier\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick Stewart plays which character in the film series based on the comic books created by Stan Lee and Jack Kirby?",
        "response": "Professor Charles Xavier",
        "source": "hotpot_qa"
    },
    {
        "query": "The project that would have led to the lowering of the surface of the Mediterranean Sea by up to 200 m was devised by an architect who died in which year ?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the company that sponsered the 2009 Grand National produce?",
        "response": "beer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Hannah Arendt or Peter Ackroyd?",
        "response": "Johanna \"Hannah\" Arendt",
        "source": "hotpot_qa"
    },
    {
        "query": "Katie sagona is known as what kind of actor because she was a child acting on stage or in motion pictures or television?",
        "response": "child actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a three-time Olympic Champion, that starred in the musical film \"Sun Valley Serenade\"?",
        "response": "Sonja Henie",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of Darren Aronofsky's movies is based on a Russian ballet?",
        "response": "Swan Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "What continent are both Mitella and Inula found in?",
        "response": "Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "What channel aired the stand up special Buddies by Dave Chappelle in 1996?",
        "response": "ABC",
        "source": "hotpot_qa"
    },
    {
        "query": "Rolls-Royce Welland's name is taken from this river that is low long",
        "response": "65 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Forrest Edwin Behm (July 31, 1919 – June 29, 2015) was an American football player, he played college football for the Nebraska Cornhuskers (often abbreviated to Huskers) is the name given to the intercollegiate athletic teams of which organization?",
        "response": "University of Nebraska–Lincoln",
        "source": "hotpot_qa"
    },
    {
        "query": "In January 2012, which team represented the Urraca Clube de Futbol in its opening game? ",
        "response": "Spain national under-17 football team",
        "source": "hotpot_qa"
    },
    {
        "query": "Waterkasteel was a defense in the colony coming under the administration of the Dutch government in what year?",
        "response": "1800",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the award for his performances throughout the campaign of the 25th season of the Premier League?",
        "response": "Dele Alli",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Dutch theoretical physicist that created the 't Hooft η symbol?",
        "response": "Gerard 't Hooft",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the longest street of the suburb that borders Enfield at the Northern end?",
        "response": "Florence Avenue",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the episode from the \"Walking Dead\" where Rosita Espinosa and the others find the Alexandria Safe Zone?",
        "response": "\"Self Help\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 biographical sports film was written by Simon Beaufoy and directed by husband and wife, Jonathan Dayton and Valerie Faris?",
        "response": "Battle of the Sexes",
        "source": "hotpot_qa"
    },
    {
        "query": "Question: What characters did the focus of the 2011 documentary I Am Nancy play in the sitcom \"Growing Pains\"?",
        "response": "Marie Lubbock and Amy Boutilier",
        "source": "hotpot_qa"
    },
    {
        "query": "Jung Sung-il placed 17th at the Winter Olympics figure stating competition that was held at what Olympic Amphitheatere?",
        "response": "Hamar",
        "source": "hotpot_qa"
    },
    {
        "query": "Which season did the UCF Knights represent at an American metropolitan public research university in Orlando, Florida?",
        "response": "2010 NCAA Division",
        "source": "hotpot_qa"
    },
    {
        "query": "Which prominent mathematician in the Bernoulli family did Jakob II Bernoulli study under?",
        "response": "Daniel Bernoulli",
        "source": "hotpot_qa"
    },
    {
        "query": "What plan, designed by Daniel Burnham, called for new construction throughout Cleveland?",
        "response": "1903 Group Plan",
        "source": "hotpot_qa"
    },
    {
        "query": "The Big Moo includes an essay by the co-owner and chairman of what television station?",
        "response": "AXS TV",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Real Simple and Bust both names of women's interest and lifestyle magazines?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "David Berman was a partner with what mobster who was a driving force behind the development of the Las Vegas Strip?",
        "response": "Benjamin \"Bugsy\" Siegel",
        "source": "hotpot_qa"
    },
    {
        "query": "From which phrase the name of the place where Hazina Towers is under construction?",
        "response": "Maasai phrase",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population  in 2007 of the the city where Addis Abab served as mayor?",
        "response": "3,384,569",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2017–18 Wigan Athletic F.C. season will be a year in which the team competes in the league cup known as what for sponsorship reasons?",
        "response": "Carabao Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of industry do Zozo and Josef Far have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the weekday ridership for the line serving the South Norwalk Metro-North Railroad station?",
        "response": "125,000",
        "source": "hotpot_qa"
    },
    {
        "query": "How many girls and boys are in the seventeen sibling family featured on Counting On?",
        "response": "nine girls and 10 boys",
        "source": "hotpot_qa"
    },
    {
        "query": "Noir Désir and Balance and Composure are both what?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "What supernatural horror film did Miles Doleac have a role in?",
        "response": "Sleepy Hollow",
        "source": "hotpot_qa"
    },
    {
        "query": "Pearson Plaza replaces what mall and hotel previously located in the middle of Elliot Lake, Ontario's commercial district on Highway 108?",
        "response": "Algo Centre Mall",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2010 American action crime thriller featuring American actor Paul Walker",
        "response": "John Luessenhop",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is linfield football club based?",
        "response": "Northern Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Alnwick (1174) is one of two battles fought near the town of Alnwick, in Northumberland, England, the battle, which occurred on 13 July 1174, William I of Scotland, also known as William the Lion, was captured by a small English force led by which Chief Justiciar of England during the reign of King Henry II (1154–89) and was the probable author of \"Tractatus de legibus et consuetudinibus regni Anglie\"?",
        "response": "Ranulf de Glanvill",
        "source": "hotpot_qa"
    },
    {
        "query": "What game did Alexey Pajitnov's partner produce?",
        "response": "The Black Onyx",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is Robert Lips who is best known for his work on a cartoon character, a blue parrot with a yellow beak, a beret and checkered trousers?",
        "response": "Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the sister of Dorothy Gish known as?",
        "response": "First Lady of American Cinema",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Keri Hulme and Flannery O'Connor from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The ;largest mall in Windsor, Ontario is served by what bike trail?",
        "response": "Devonwood Bike Trail",
        "source": "hotpot_qa"
    },
    {
        "query": "The work of philosophy and social criticism known as the \"Dialectic of Enlightenment\" was written, in part, by Theodor W. Adorno, a philosopher, sociologist, and composer know for for his critical theory of what?",
        "response": "society",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Bobby Managoff and Tim Kurkjian, who had an extensive career in baseball? ",
        "response": "Timothy Bell \"Tom\" Kurkjian",
        "source": "hotpot_qa"
    },
    {
        "query": " NCAA College Football 2K2: Road to the Rose Bowl has the quarterback for which NFL team on the cover?",
        "response": "New Orleans Saints",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the person who co-wrote the winning Russian entry for the 2008 Eurovision Song Contest with Jim Beanz?",
        "response": "Dima Bilan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the winner of the Heisman Trophy in 1952 drafted to the NFL?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company produced both Toby Tyler and Honey, I Shrunk the Kids?",
        "response": "Walt Disney Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the third track on the Rolling Stones album that was the first to feature the same track listings in both its UK and US versions?",
        "response": "\"In Another Land\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in \"Bob's Burgers\" and hosted the US version of \"The Planet's Funniest Animals\" from 2005 to 2008?",
        "response": "Keegan-Michael Key",
        "source": "hotpot_qa"
    },
    {
        "query": "The television series on which Will Mellor starred as Steve Connolly premiered on what date?",
        "response": "4 March 2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What Christmas album featuring Eric Hansen had songs included on the Christmas 25th Anniversary Collection album by Mannheim Streamroller?",
        "response": "A Fresh Aire Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "Erik Hivju is the father of which Game of Thrones actor?",
        "response": "Kristofer Hivju",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed this South Korean action noir film starring Lee Min-ki and Lee Tae-im?",
        "response": "Park Sang-jun",
        "source": "hotpot_qa"
    },
    {
        "query": "Matt Doheny ran in the Republican primary for New York's 21st congressional district, a congressional district for the United States House of Representatives that is currently represented by who?",
        "response": "Republican Elise Stefanik",
        "source": "hotpot_qa"
    },
    {
        "query": "Ole and Lena are central characters in jokes by which specific portion of  Americans, in the broad sense?",
        "response": "Scandinavian Americans",
        "source": "hotpot_qa"
    },
    {
        "query": "Japan Paralympic Committee is recognized by International Paralympic Committee (IPC), Ministry of Health and what other committee?",
        "response": "Asian Paralympic Committee",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the overall record of the head coach whom Bill Pace served as offensive coordinator under beginning in 1974?",
        "response": "201–77–10",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Russian composer who composed \"Prisoner of the Caucasus\" born? ",
        "response": "[O.S. 6 January] 1835",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was created first, Around the World in 80 Days or The Adventures of Ichabod and Mr. Toad?",
        "response": "The Adventures of Ichabod and Mr. Toad",
        "source": "hotpot_qa"
    },
    {
        "query": "The chef who has been nicknamed The Demon Chef is judging what Canadian competitive cooking show?",
        "response": "MasterChef Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the net worth of the inventor of the Swift Boat Challenge?",
        "response": "$500 million",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the songwriter of the song by The Beach boys refering to the Maraishi born? ",
        "response": "March 15, 1941",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the Macuá and Bourbon Lancer both use rum?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Robbie Tucker plays in what series that follows a group of friends who run an Irish bar?",
        "response": "It's Always Sunny in Philadelphia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which one, Purshia or Maihuenia, is a small genus of 5-8 species of flowering plants in the family Rosaceae?",
        "response": "Purshia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Monastery of the Transfiguration, Kinaliada and Süreyya Opera House both Greek Orthodox monasteries? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "DesiHits raised venture capital in 2008 from which American firm?",
        "response": "Draper Fisher Jurvetson",
        "source": "hotpot_qa"
    },
    {
        "query": "James Cruze and Juan Escobedo both lived where?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "Which states are consistently included in the region where the Cayuse War took place?",
        "response": "Oregon, Washington, and Idaho",
        "source": "hotpot_qa"
    },
    {
        "query": "From what town is the actor from who played Denham in the 1967 film directed by James Clavell?",
        "response": "Southmoor, Berkshire, England",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Decaisnea and Zamioculcas have in common?",
        "response": "flowering plant",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the postcode for Kilburn, a suburb located in the inner north of Adelaide, South Australia, and Blair Athol, a suburb located 15km north of Adelaide CBD, Australia?",
        "response": "5084",
        "source": "hotpot_qa"
    },
    {
        "query": "Who won the Sawamura Award in 2007 and is a starting pitcher for the Los Angeles Dodgers?",
        "response": "Yu Darvish",
        "source": "hotpot_qa"
    },
    {
        "query": "DVLP produced what song by Eminem that premiered via YouTube on October 14, 2013?",
        "response": "Rap God",
        "source": "hotpot_qa"
    },
    {
        "query": "who stars in the drama Witness to a Prosecution ||?",
        "response": "Bobby Au-yeung",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the drummer on the Rhino Bucket album \"PAIN\" born?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What Union Occupied estate near Fort Craig overlooks the Potomac River ?",
        "response": "Arlington House",
        "source": "hotpot_qa"
    },
    {
        "query": "Goldilocks and the Three Bares was a film that was totally separate from the fairy tale from what century?",
        "response": "19th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "What album was released on October 24, 2006, by Big Machine Records and contains Should've Said No?",
        "response": "Taylor Swift",
        "source": "hotpot_qa"
    },
    {
        "query": "Millian Dollar Challenge is hosted by Chris Rose, and features what Canadian professional poker player who has won six World Series of Poker bracelets?",
        "response": "Daniel Negreanu",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which Christoph Koncz starred as Kaspar Weiss ?",
        "response": "François Girard",
        "source": "hotpot_qa"
    },
    {
        "query": "What concert tour visited Asia, Europe, and North America from 6 August 2015 to 11 January 2016 features collaborations with singers Jon Bellion, Troye Sivan, and rapper Logic?",
        "response": "The True Colors Tour",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the San Diego State Aztecs baseball team's head coach died who was with the team until 2014?",
        "response": "June 16, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "HopSkipDrive is aimed at youth who are restricted from using the services of the hire company headquartered in what city?",
        "response": "San Francisco, California",
        "source": "hotpot_qa"
    },
    {
        "query": "To Catch a Predator was devoted to impersonating people below the age of consent for which in North America varies by what?",
        "response": "jurisdiction",
        "source": "hotpot_qa"
    },
    {
        "query": "Blanco was used in what organization of 52 states of the British Empire to clean equipment?",
        "response": "Commonwealth of Nations",
        "source": "hotpot_qa"
    },
    {
        "query": "Where do John Mitchell's current team play their home games ?",
        "response": "Quicken Loans Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer/songwriter was older, Gwen Stefani or Freddie Mercury?",
        "response": "Farrokh \"Freddie\" Mercury",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the season of \"The Simpsons\", that contains the episode \"Barthood\", begin airing in the United States?",
        "response": "September 27, 2015",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician performed with Stephen Malkmus and the Jicks, Jon Spencer or Stephen Malkmus?",
        "response": "Stephen Joseph Malkmus",
        "source": "hotpot_qa"
    },
    {
        "query": "This South-African born actress played a real-life person who was executed in 2002 for crimes committed in what movie?",
        "response": "Monster",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show, staring Karen Elizabeth Faction Hamilton, ran on Nickelodeon from October 15, 1994 through February 2, 1995?",
        "response": "My Brother and Me",
        "source": "hotpot_qa"
    },
    {
        "query": "Sharon Thomas' children include an AMerican actor who is known for his role as Superman, and for being the host of what show?",
        "response": "Ripley's Believe It or Not!",
        "source": "hotpot_qa"
    },
    {
        "query": "Wellesley Farms is a rail station located in what Massachusetts county?",
        "response": "Norfolk",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the first film based on Bram Stoker's famous novel produced?",
        "response": "1923",
        "source": "hotpot_qa"
    },
    {
        "query": "She Got the Goldmine was recorded by the singer who had the theme song for what 1977 blockbuster movie?",
        "response": "Smokey and the Bandit",
        "source": "hotpot_qa"
    },
    {
        "query": "What postion did the footballer who scored the opening goal in the 10th minute of the 2009 UEFA Champions League Final play?",
        "response": "striker",
        "source": "hotpot_qa"
    },
    {
        "query": "How are Ceephax Acid Crew  and Squarepusher's music similar?",
        "response": "drum and bass electronic musician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the subsidiary company of Sri Venkateswara Creations which has produced a 2010 film starring Varun Sandesh?",
        "response": "Matinee Entertainments",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jumeirah Carlton Tower is located near what luxury British department store that was founded in 1831?",
        "response": "Harvey Nichols",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist collaboated with Snoop Lion to release Ashtrays and Heartbreaks?",
        "response": "Miley Cyrus",
        "source": "hotpot_qa"
    },
    {
        "query": "What show included an actress who was also in a show set in modern-day San Francisco?",
        "response": "\"Melrose Place\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the wife of the king of the Scots who was assassinated on 21 February 1437?",
        "response": "Mary of Guelders",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the hometown of the man who came up with the Alcubierre drive idea?",
        "response": "Mexico City",
        "source": "hotpot_qa"
    },
    {
        "query": "Are King Vidor and Géza von Cziffra both American directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was Patrick Dolan's brother born?",
        "response": "1955",
        "source": "hotpot_qa"
    },
    {
        "query": "What band released a studio album in 1974 and a compilation album in 1993?",
        "response": "Judas Priest",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Amos Gitai or Anatole Litvak?",
        "response": "Anatole Litvak",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country aided Finland in Operation Stella Polaris against the Soviet Union?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has released more solo albums, Ozzy Osbourne or Curt Smith?",
        "response": "John Michael \"Ozzy\" Osbourne",
        "source": "hotpot_qa"
    },
    {
        "query": "What type creative work do Yodel It! and Shake It Off have in common?",
        "response": "song",
        "source": "hotpot_qa"
    },
    {
        "query": "What amusement and water park has the Alpine Bobsled roller coaster but is separate from the Six Flags brand?",
        "response": "Great Escape",
        "source": "hotpot_qa"
    },
    {
        "query": "What former partner of Melissa Etheridge directed Teresa's Tattoo?",
        "response": "Julie Cypher",
        "source": "hotpot_qa"
    },
    {
        "query": "I Cavalry Corps had a detached division that fought at the battle in which present-day country?",
        "response": "Belgium",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the japanese company who hired Camelia as a spokesmodel traditionally known for?",
        "response": "timepieces",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that is a 2006 gay romantic comedy film about  four gay friends  who vow upon graduating high school that they will all lose their virginity of he insertion and thrusting of the erect penis into a person's anus ?",
        "response": "Todd Stephens",
        "source": "hotpot_qa"
    },
    {
        "query": "The father of the actress who played Vanessa Doofenshmirtz in \"Phineas and Ferb\" was an original member of what group?",
        "response": "Boston Comedy Scene",
        "source": "hotpot_qa"
    },
    {
        "query": "Released through what company was the five trackEP, released by American singer who is an American alternative singer and songwriter, originally from Long Island, New York?",
        "response": "Warner Bros",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1995 film in which Jeremy Sisto starred ? ",
        "response": "Amy Heckerling.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeff Ragsdale and Millard Webb both authors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Baller Brand is an American company that designs, manufactures, and sells sports apparel, footwear, and accessories, it was launched in 2016 by LaVar Ball, together with his sons Lonzo, LiAngelo, and LaMelo Ball, an American basketball player who attends Chino Hills High School, in Chino Hills in which US state?",
        "response": "California",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie received 3 Awards at the event held at the Golden Tulip Hotel?",
        "response": "Sinking Sands",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game has satisfied most players, Entdecker or Qwirkle ?",
        "response": "Qwirkle",
        "source": "hotpot_qa"
    },
    {
        "query": "Journey to the Center of the Earth starred a former Metro-Goldwyn-Mayer contract star who is the mother of what actor?",
        "response": "Lorenzo Lamas",
        "source": "hotpot_qa"
    },
    {
        "query": "Ella Mikhaylovna Polyakova, is a Russian human rights activist, a member of which current President of Russia, holding the office since 7 May 2012?",
        "response": "Vladimir Vladimirovich Putin",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the magazine, which featured \"A Sound of Thunder\" in 1952, founded?",
        "response": "1888",
        "source": "hotpot_qa"
    },
    {
        "query": "Women on Web sends medicine by mail that are taken by what?",
        "response": "mouth",
        "source": "hotpot_qa"
    },
    {
        "query": "The music video of \"Palat – Tera Hero Idhar Hai\" features the assistant director to Karan Johar on what 2010 drama?",
        "response": "My Name Is Khan",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Another Day of Sun\" is the opening number from a film that stars who as a jazz pianist?",
        "response": "Ryan Gosling",
        "source": "hotpot_qa"
    },
    {
        "query": "What title did Krofft Productions give the remake of their half-hour Saturday-morning children's series?",
        "response": "Land of the Lost",
        "source": "hotpot_qa"
    },
    {
        "query": "This English actor who starred in the CBS drama \"Eleventh Hour\" appeared in this 1998 American-Australian Neo-noir science fiction film directed by Alex Proyas?",
        "response": "Dark City",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Michael Matricciani play his home matches? ",
        "response": "Newton Village Sports Complex",
        "source": "hotpot_qa"
    },
    {
        "query": "The song Love Is All I Got was relased by a band who's second album was released in May 2013, what was their second album called?",
        "response": "\"Cave Rave\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack Hill and Pedro Costa are both what?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Robert Zickert plays for the football club that is near what major city?",
        "response": "Leipzig",
        "source": "hotpot_qa"
    },
    {
        "query": "Petunia and Dodonaea, are which type of entity?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "A mineral discovered by Travis Olds is named in honor of what Hungarian-born physicist and inventor?",
        "response": "Leo Szilard",
        "source": "hotpot_qa"
    },
    {
        "query": "What Filipino singer, who rose to popularity on YouTube, released an EP in May 2008 under the the name Charice?",
        "response": "Jake Zyrus",
        "source": "hotpot_qa"
    },
    {
        "query": "Which plant genus contain two to four species, Greyia or Calycanthus?",
        "response": "Calycanthus",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Sun Tiantian and Tom Gullikson have the same nationality ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Lonny Price best known for his creation of the role of Charley Kringas in a Broadway musical based on a play by George S. Kaufman and what other man?",
        "response": "Moss Hart",
        "source": "hotpot_qa"
    },
    {
        "query": "David upheld his support for his niece, the former Empress-consort, who had how many children?",
        "response": "no children",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of Death in Brunswick was born in New Zealand?",
        "response": "John Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "Foxcatcher is a 2014 American true crime sports drama film, the film stars Steve Carell, Mark Ruffalo, and Channing Matthew Tatum is an American actor, born when?",
        "response": "April 26, 1980",
        "source": "hotpot_qa"
    },
    {
        "query": "Which son of Arnold Schwarzenegger and Maria Shriver stars in coming-of-age thriller \"Go North\"?",
        "response": "Patrick Schwarzenegger",
        "source": "hotpot_qa"
    },
    {
        "query": "Brian Kerr, is a Scottish football player and manager who is currently in charge of Albion Rovers, Kerr represented Scotland at senior international level, earning three caps during the reign of who, as national team manager?",
        "response": "Berti Vogts",
        "source": "hotpot_qa"
    },
    {
        "query": "Carver Glacier is on the north slope of a complex volcano with three peaks each exceeding how many feet in elevation?",
        "response": "10000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film inspired Zahra Laari, A Tiger Walks or Ice Princess?",
        "response": "Ice Princess",
        "source": "hotpot_qa"
    },
    {
        "query": "The Devil's Dinner Party is a reality game show hosted by an actor known for his role as Tommy Lascelles in what Netflix drama?",
        "response": "The Crown",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times was Bertha of Savoy's husband excommunicated?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the two middle names of the man who won the football match against Werder Bremen in 2005-06?",
        "response": "Miguel Pizarro",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gabe Saporta and Robert Plant both English?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre of music is represented here?",
        "response": "Rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Dutch footballer is featured on the song Wij zijn Ajax by Ajax and Friends?",
        "response": "Ryan Guno Babel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 55th president of Mexico was involved in the Desafuero of Manuel López Obrador?",
        "response": "Vicente Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization does Capture of Stuff Redoubt and 36th have in common?",
        "response": "Army",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actors is more likely to have performed on a stage, James Bridges or Michael Dolan?",
        "response": "Michael Dolan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song by Jon Secada and Shanice was featured on Disney's 33rd animated feature film?",
        "response": "\"If I Never Knew You\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which iconic symbol of American independence is located along surface streets off the Interstate 676?",
        "response": "Liberty Bell",
        "source": "hotpot_qa"
    },
    {
        "query": "How is Noye's Fludde connected to Chester Mystery Plays?",
        "response": "it is based on the 15th-century Chester \"mystery",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the first store of the chain which the Wales National Ice Rink was demolished to make room for opened?",
        "response": "1864",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas Joseph Papa provided some voiceover work for a spin-off of what Pixar franchise?",
        "response": "Cars",
        "source": "hotpot_qa"
    },
    {
        "query": "Wade Watts is the uncle of a politican who played college footbal for which team ?",
        "response": "the Oklahoma Sooners",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Swabian name of the city in Baden-Württemberg with a T-Systems Multimedia Solutions office?",
        "response": "Schduagert",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fictional character devised by Lewis Carroll did  Alice recited ",
        "response": "The Mock Turtle",
        "source": "hotpot_qa"
    },
    {
        "query": "In which district of the Badakhshan Province is the settlement located which is famous for its ancient mines, which produce a deep blue metamorphic rock used as a semi-precious stone that has been prized since antiquity for its intense color, and are said to produce the world's finest of this stone?",
        "response": "the Kuran Wa Munjan District",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor had a role in both the movies \"Bridesmaids\" and \"Alice in Wonderland\"?",
        "response": "Matt Lucas",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airline, that flew only with foreign models, is the largest airline of the Russian Federation?",
        "response": "Aeroflot",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2010 musical was written by the same author as a whodunnit novel similar to \"Big Brother\" ",
        "response": "Love Never Dies",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Bedlington Terrier and Border Collie bred for the same purposes?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What Scottish actor that read Pest Control?",
        "response": "David Tennant",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the prototype Big Daddy characters called in the sequel version of the BioShock series?",
        "response": "Subject Delta",
        "source": "hotpot_qa"
    },
    {
        "query": "Who in the Jewish Guild did The Irish Football Association consider to be the greatest player to ever pull on the green shirt of Northern Ireland?",
        "response": "George Best",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1996 American historical drama film in which William Preston appeared?",
        "response": "Arthur Miller",
        "source": "hotpot_qa"
    },
    {
        "query": "What American self-help author sold over 100 million copies of his book Think and grow Rich worldwide by 2015 after his death in 1970?",
        "response": "Napoleon Hill",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the laboratory that houses The Tandem Van de Graaff located?",
        "response": "Upton, New York",
        "source": "hotpot_qa"
    },
    {
        "query": " Alf Aage Olsen played as a forward for a sports club founded on what date?",
        "response": "26 April 1876",
        "source": "hotpot_qa"
    },
    {
        "query": "Between the Vizsla and the Saint-Usuge Spaniel which dog breed national breed club was founded in 1990?",
        "response": "Saint-Usuge Spaniel",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Saint Motel and Dinosaur Pile-Up both rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What man who was the husband of a noblewoman during the reign of Henry VIII of England wished to marry the Queen of England from 1533 to 1536?",
        "response": "Henry Percy",
        "source": "hotpot_qa"
    },
    {
        "query": "What position does Igor Jelavić's nephew usually play? ",
        "response": "winger",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song \"Nothing but Your Love Matters\" and was a part of a trio with his brothers Steve and Rudy?",
        "response": "Larry Gatlin",
        "source": "hotpot_qa"
    },
    {
        "query": "How large is this city in North Rhine-Westphalia as compared to other cities in Germany from which the Krupp family comes?",
        "response": "the ninth-largest",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation did both Carole Penny Marshall and Doug Langway perform?",
        "response": "director",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2006 film did the actor who plays Professor Atticus Shane star in?",
        "response": "Anniversary Present",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the Byzantine capital?",
        "response": "Constantinople",
        "source": "hotpot_qa"
    },
    {
        "query": "The Pardoner's Tale is a tale by an author known as what?",
        "response": "the Father of English literature",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1986 South Korean drama film directed by Lee Doo-yong did Lee Mi-sook play in?",
        "response": "Mulberry",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Waratah and Trachymene native to Fiji?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 2014 Chinese-Hong Kong biographical drama starring a Chinese actress who rose to prominence for her appearance in \"Lust, Caution\" ?",
        "response": "Ann Hui",
        "source": "hotpot_qa"
    },
    {
        "query": "Which puppet producer for \"Team America: World Police\" was co-creator of \"South Park\"?",
        "response": "Trey Parker",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of submarine was the non-nuclear U-32?",
        "response": "German Type 212 class",
        "source": "hotpot_qa"
    },
    {
        "query": "What South Korean actor struggled to emerge from under the shadow of his older sister,starred in a modern take on Edmond Rostand's 1897 play \"Cyrano de Bergerac\"?",
        "response": "Uhm Tae-woong",
        "source": "hotpot_qa"
    },
    {
        "query": "Australian Liberty Alliance launched in 2015 with the anti-Islam activist who is director of which organization as a keynote speaker?",
        "response": "Sharia Watch UK",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Ventimilia co-wrote the Simpsons episode that was the 22nd episode of which season",
        "response": "sixth",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeje Lalpekhlua is an Idian professional football player who played for?",
        "response": "Chennaiyin FC",
        "source": "hotpot_qa"
    },
    {
        "query": "In which region of New South Wales is Abercrombie House?",
        "response": "Central Tablelands",
        "source": "hotpot_qa"
    },
    {
        "query": "What second book of the Torah and the Old Testament narrates how Moses led the Israelites in building the Tabernacle?",
        "response": "The Book of Exodus",
        "source": "hotpot_qa"
    },
    {
        "query": "Jennifer Aniston is the daughter of an actor best known for his role on what daytime drama series?",
        "response": "\"Days of Our Lives\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American country music band released a 13 song album on July 27 2017?",
        "response": "Midland",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor, who starred in Staten Island Summer and has Carrie Brownstein as a comedy partner, was born on what day?",
        "response": "born December 4, 1966",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film does a compiler of an Under the Influence album play a cameo role?",
        "response": "Harry Potter and the Prisoner of Azkaban",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Billy Gibbons and Deni Hines both from Australia?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Ricky Wilde, is a British songwriter, musician, record producer and brother of Kim Wilde, an English pop singer, author, DJ and television presenter who burst onto the music scene in which year, with her debut single \"Kids in America\"?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "The High German consonant shift  took place in the Germanic family of languages that is larger than which other two branches?",
        "response": "North Germanic and the extinct East Germanic languages",
        "source": "hotpot_qa"
    },
    {
        "query": "Bowling has been part of the pan american games since the games held in which city ?",
        "response": "Havana, Cuba",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the band with the song \"Songs from the Big Chair formed?",
        "response": "Bath",
        "source": "hotpot_qa"
    },
    {
        "query": "Which European breed of dog is smaller, Bedlington Terrier or Transylvanian Hound?",
        "response": "Bedlington Terrier",
        "source": "hotpot_qa"
    },
    {
        "query": "Who started his career in film first, Alex Proyas or Alexander Mackendrick?",
        "response": "Alexander Mackendrick",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of Jean-Philippe Rameau and Modest Mussorgsky?",
        "response": "Jean-Philippe Rameau",
        "source": "hotpot_qa"
    },
    {
        "query": "Yuen Woo-ping and Louis Le Prince, have which mutual industry occupation?",
        "response": "cinema",
        "source": "hotpot_qa"
    },
    {
        "query": "Austendike is a village in what district?",
        "response": "South Holland district",
        "source": "hotpot_qa"
    },
    {
        "query": "Which musician or band is from further north, Matthew Good or Modern Baseball?",
        "response": "Matthew Good",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress that played Jackie Clunes in the series \"Hotel Babylon\" was part of what short-lived pop duo?",
        "response": "Jackson Mendoza",
        "source": "hotpot_qa"
    },
    {
        "query": "Puffin Rock is an Irish children's television series that originally aired on RTÉjr in Ireland, and in the UK on Nick Jr. Too, (formerly Nick Jr. 2) is the British second channel of Nick Jr. available in the United Kingdom and in the Republic of Ireland, generally presenting popular Nick Jr. programming at other times of the day, it launched on which date? ",
        "response": "24 April 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cribs and Julian Cope, is of which nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American filmmaker who directed dramas such as \"George Washington\" and \"All the Real Girls\", directed episodes of the HBO sports comedy television series which starred Danny McBride?",
        "response": "David Gordon Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Tye White plays Kevin Satterlee in a drama series that premiered in what date?",
        "response": "June 21, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What state of origin does Louis DeSalvio and Staten Island have in common?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "The inventor of the first thermionic valve made what visual mnemonic tool for generators?",
        "response": "Fleming's right-hand rule",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the company that was established by the founder of the Leverhulme Trust?",
        "response": "Lever Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "How long is the road course for the 24 hour sports car endurance race which Chuck Parsons participated in Daytona Beach, Florida?",
        "response": "3.56 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the transgender singer who performed the pop and R&B album Infinity?",
        "response": "Filipino",
        "source": "hotpot_qa"
    },
    {
        "query": "When was  Italian industrialist who was  Umberto Agnelli father born ",
        "response": "2 January 1892",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the animated television series that has \"The Death of Eric Cartman\" as the sixth episode? ",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeremy Dawson was a film producer who was nominatd for an Academy Award for what 2014 comedy film?",
        "response": "The Grand Budapest Hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean singer born in 1986 appeares as a guest to the Seoul Concert?",
        "response": "Lee Sung-min",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hyomin and Bobby Gillespie both members of a band?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Lynda\" is a song written by Bill LaBounty and Pat McLaughlin, and recorded by American country music artist Steve Wariner, technically inspired by which American actress, singer, songwriter, model, and beauty pageant titleholder, who was crowned Miss World America 1972?",
        "response": "Lynda Carter",
        "source": "hotpot_qa"
    },
    {
        "query": "James Stuart became a specialist of a rhythmic pattern charecterised by what?",
        "response": "characterised by a moderately fast to very fast tempo",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Magda Behrend Rietschel's second husband born?",
        "response": "1897",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Cincinnati, Ohio festival founded that had the American rock band with Christopher Bear as a member perform?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is an English singer-songwriter from Leicester, England, Dirty Three or Jersey Budd ?",
        "response": "Jersey Budd",
        "source": "hotpot_qa"
    },
    {
        "query": "What station does the former Michigan Governor that Howard Edelson served as campaign manager for work at today?",
        "response": "CNN",
        "source": "hotpot_qa"
    },
    {
        "query": "How many times was the subject of Sal Paolantonio's best known work for ESPN selected for the Pro Bowl",
        "response": "six-time",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the starting city of the concert tour for Taylor Swift's studio album that followed her album \"Speak Now\"?",
        "response": "Omaha, Nebraska",
        "source": "hotpot_qa"
    },
    {
        "query": "A band formed in 2005 by Jamie Laurie had what hit song that peaked at #3 on the Billboard Modern Rock Tracks?",
        "response": "Handlebars",
        "source": "hotpot_qa"
    },
    {
        "query": "An indigenous peoples of Australia, the Peramangk, warned who that the area of Hoffnungsthal, South Australia was prone to flood, but were ignored?",
        "response": "settlers",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the former name of the landlocked country bordered by Zambia to the northwest, Tanzania to the northeast, and Mozambique on the east, south and west in which a species of moth from the family Adelidae is known?",
        "response": "Nyasaland",
        "source": "hotpot_qa"
    },
    {
        "query": "Minister of Interior in the cabinet appointed by the Interim Iraq Governing Council in September 2003, served in the government of the fifth President of where?",
        "response": "Iraq",
        "source": "hotpot_qa"
    },
    {
        "query": "How many shares of stock were owned by promoters and promoter group prior to the 2016 Indian Banks data breach?",
        "response": "30.81% shares",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate 135's southern terminus is with a highway that is how many miles long?",
        "response": "235",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 comedy-drama sports film directed by Jonathan Dayton and Valerie Farris has a plot loosely based on Billie Jean King and Booby Riggs?",
        "response": "Battle of the Sexes",
        "source": "hotpot_qa"
    },
    {
        "query": "The woman Serena Williams defeated at the 2014 US Open – Women's Singles was born in what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the artist who recorded \"Where Did We Go?\" with Andrew Allen, place third on \"Canadian Idol\"?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What is is one of the oldest magazines in the country and the first Belgian women's magazine, Femmes d’Aujourd’hui or Better Homes and Gardens?",
        "response": "Femmes d’Aujourd’hui",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this resort area located in Austria, where Schloss Ort is the gate to it?",
        "response": "The Salzkammergut",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film did the hostess of \"Wheel of Fortune\" star in, that premiered November 20, 1988? ",
        "response": "Goddess of Love",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does The Hard Goodbye and Sin City have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was from farther West, Timothy Leary or Jaroslav Seifert?",
        "response": "Timothy Francis Leary",
        "source": "hotpot_qa"
    },
    {
        "query": "Who recorded \"Before the Next Teardrop Falls\" and \"Wasted Days and Wasted Nights?\"",
        "response": "Freddy Fender",
        "source": "hotpot_qa"
    },
    {
        "query": "Steve Brodie was an American stage, film and television actor from El Dorado in Butler County, who starred in the war film Home of the Brave from what year?",
        "response": "1949",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of a medication used to within a chemotherapy regimen?",
        "response": "Cisplatin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the sport event promotions company that devises the non-ranking snooker tournament Championship League?",
        "response": "Barry Hearn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band was formed first, TISM or A Perfect Circle?",
        "response": "TISM",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Ron Dundas play a football position for the offense or defense? ",
        "response": "offense",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university has more campuses, Dalhousie University or California State Polytechnic University, Pomona?",
        "response": "Dalhousie University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the character in \"The Closer\" in which the actor also played in the movie \"Mannequin\"?",
        "response": "James Duff",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the husband of the screenwriter for the 2009 science fiction thriller directed by Alex Proyas and starring Nicholas Cage?",
        "response": "Stiles White",
        "source": "hotpot_qa"
    },
    {
        "query": "Who caught a last second touchdown pass for the Michigan Wolverines thrown by a quarterback who played for the Jacksonville Jaguars?",
        "response": "Mario Manningham",
        "source": "hotpot_qa"
    },
    {
        "query": "Eric Rignot is the Professor of Earth system science in what country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the band that song \"No Smokes\" was used in an episode of the TV series \"Clangers\"?",
        "response": "Jaygars",
        "source": "hotpot_qa"
    },
    {
        "query": "What river is close to the Adome Bridge?",
        "response": "the Volta River",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle took place during the American Civil War, Battle of Gettysburg or Battle of Tarawa?",
        "response": "Battle of Gettysburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the Tundra Mine and Negus Mine located in the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Dave Ragone played football for a university team currently coached by whom?",
        "response": "Bobby Petrino",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Kelly Preston star in a fantasy film with her husband?",
        "response": "2000",
        "source": "hotpot_qa"
    },
    {
        "query": "The Independent featured a cameo by which actress and comedian?",
        "response": "Anne Meara",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the debut solo album of the singer who voiced Gloria in Happy Feet Two?",
        "response": "Can't Take Me Home",
        "source": "hotpot_qa"
    },
    {
        "query": "To which taxonomic category do both Itea and Alocasia belong?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the Gainsborough station group and the Gainsborough Central railway station located?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of group does Social Distortion 2001 Tour and Mike Ness have in common?",
        "response": "band",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 Lars von Triers film that won awards for Best Danish Film, Best Actor, and Best Actress was filmed in which two countries?",
        "response": "Germany and Sweden",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the head coach of the 2015–16 Manhattan Jaspers born?",
        "response": "September 2, 1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Harald Sunde played for the Norwegian football club from which city?",
        "response": "Trondheim",
        "source": "hotpot_qa"
    },
    {
        "query": "In what amusement park, that is located 60 miles north of Albany, is the the Canyon Blaster located?",
        "response": "Great Escape",
        "source": "hotpot_qa"
    },
    {
        "query": "Don L. Harper is a composer credited on which 2004 adventure heist film?",
        "response": "National Treasure",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the person who is known for playing bass for the lead singer of the Smiths?",
        "response": "British",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the film on which the 2016 film Pete's Dragon is based. In what year was it released?",
        "response": "1977",
        "source": "hotpot_qa"
    },
    {
        "query": "Fuat Bulca was friends with which founder of the Republic of Turkey?",
        "response": "Mustafa Kemal Atatürk",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1904 Selma Feldbach graduated in medicine from a comprehensive university founded in what year?",
        "response": "1834",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrestler has a brother (also a wrestler) who performed with Tammy Sytch acting as his valet?",
        "response": "John \"Johnny\" Candito",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a former science teacher that was fired for branding a student with a Christian cross?",
        "response": "John Freshwater",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the team that Brandon Siler played for after the Chargers?",
        "response": "Lamar Hunt",
        "source": "hotpot_qa"
    },
    {
        "query": "What edition of tennis' US Open was the 2017 US Open when Petra Kvitova was a quarterfinalist?",
        "response": "137th",
        "source": "hotpot_qa"
    },
    {
        "query": "What company developed the game engine that Brother in Arms uses as its technology base?",
        "response": "Epic Games",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was released the song on which David Guetta and Rihanna collaborated before ''Phresh Out the Runway''?",
        "response": "2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Who oversees operations at a hotel and casino situated on the southern end of the Las Vegas Strip?",
        "response": "Corey Sanders",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Breitner is a former German footballer, he was known for his partnerships with which German former professional footballer and manager?",
        "response": "Franz Anton Beckenbauer",
        "source": "hotpot_qa"
    },
    {
        "query": "The River Bollin that runs through Styal is a major tributary of the River Mersey in what country?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the sister company of Lynx Aviation that operated out of Denver, Colorado?",
        "response": "Frontier Airlines",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the astronaut that inspired the nickname of \"Spacetown\" for Derry, New Hampshire?",
        "response": "Derry is the birthplace of Alan Shepard",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the historical name of the acid that dissolves phenazine?",
        "response": "oil of vitriol",
        "source": "hotpot_qa"
    },
    {
        "query": "What American real estate developer owns the Encore hotel and casino in Las Vegas?",
        "response": "Steve Wynn",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress of Julie Mora Cooper Hovath played which role in the sitom One Day at a Time?",
        "response": "a divorced mother",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, The Living Desert or Angels in the Outfield?",
        "response": "The Living Desert",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"The Hundred and One Dalmatians\" author also wrote a comedy that premiered in London in 1938?",
        "response": "Dodie Smith",
        "source": "hotpot_qa"
    },
    {
        "query": "Roman Grill is now a player agent whose clients include a former captain of his national team, which he led to what?",
        "response": "2014 FIFA World Cup",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the group that owns the record label which released Jordan Fisher's self-titled EP?",
        "response": "Disney Music Group",
        "source": "hotpot_qa"
    },
    {
        "query": "What American actor is known for his role as spock in 2013 American science fiction action film Star Trek Into Darkness?",
        "response": "Zachary Quinto",
        "source": "hotpot_qa"
    },
    {
        "query": "What hockey team is Wesley Walz the former assistant coach and has one Stanley Cup championship?",
        "response": "Tampa Bay Lightning",
        "source": "hotpot_qa"
    },
    {
        "query": "Black and Tans and Guerrilla Days in Ireland are both associated with which nationality?",
        "response": "Irish",
        "source": "hotpot_qa"
    },
    {
        "query": "Spider One and Aleksi Sihvonen, have which similar occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Thunbergia and Teucrium part of the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of the county that includes Pinesdale, Montana?",
        "response": "40,212",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was produced first, Muppet Treasure Island or Honey, I Shrunk the Kids?",
        "response": "Honey, I Shrunk the Kids",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Constant Conversations\" was written and produced by a musician born in which year ?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "On the morning of April 17, 2009 Cyclone Bijli made landfall just south of a seaport city located on the banks of what river?",
        "response": "Karnaphuli River",
        "source": "hotpot_qa"
    },
    {
        "query": "Bump and run coverage is a strategy often used by defensive backs in American football in which a defensive player lines up directly in front of a wide receiver and tries to impede him, which formercornerback, five-time Pro Bowler and a 1989 Pro Football Hall of Fame inductee of the Pittsburgh Steelers, specialized in this coverage to such a point as to cause a rule change?",
        "response": "Melvin Cornell Blount",
        "source": "hotpot_qa"
    },
    {
        "query": "The word qalat (kalata) is Persian and qal'at (qal‘a) is Arabic for 'fortified place', Qalats can range from castles like which location, to Adobe, a building material made from earth and often organic material?",
        "response": "Rumkale",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress played both Drake's mischevious younger sister in the television show \"Drake & Josh\" and starred on the NBC sitcom \"Crowded?\"",
        "response": "Miranda Cosgrove",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the brother of Jorge Santana who first became famous in the late 1960s and early 1970s with his band, Santana?",
        "response": "Carlos Santana",
        "source": "hotpot_qa"
    },
    {
        "query": "Sponge Cola and Rapeman, are which genre of band?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plant life is more palm like, Pandanus or Eriogonum? ",
        "response": "Pandanus is a genus of monocots with some 750 accepted species.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor in Oranges and Sunshine was born in 1965?",
        "response": "David Wenham",
        "source": "hotpot_qa"
    },
    {
        "query": "Who commanded the American forces at the conflicts that took place from January 18–23, 1813 during the War of 1812?",
        "response": "James Winchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band formed in England, Of Montreal or Vib Gyor?",
        "response": "Vib Gyor was a band that was formed in Leeds, England.",
        "source": "hotpot_qa"
    },
    {
        "query": "Luis Gianneo was teacher to what composer who died February 18, 2010?",
        "response": "Ariel Ramírez",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rail service serving the Blue Mountains region of New South Wales, Australia  has the Blacktown railway station? ",
        "response": "Blue Mountains Line",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the common ingredient in a Matador and Glowtini?",
        "response": "pineapple juice",
        "source": "hotpot_qa"
    },
    {
        "query": "are both, University of British Columbia and American University of Sharjah,universities in the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the showrunner for a show based on David Haller that is produced by a company owned by Rupert Murdoch?",
        "response": "Noah Hawley",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American physician co found Charles Horace Mayo",
        "response": "Augustus W. Stinchfield",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fantastic Miss Piggy Show stars what character also performed by Bob Zmuda?",
        "response": "Tony Clifton",
        "source": "hotpot_qa"
    },
    {
        "query": "Division of Adelaide includes which one of Adelaide's most affluent suburbs?",
        "response": "Walkerville",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the area known in Europe where the pirates were based in against whom Admiral of the Fleet Edward Russell has a operation as a captain in the Mediterranean?",
        "response": "Barbary Coast",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the novel writen by Lucia St. Clair Robson that includes the second wife of General Benedict Arnold in the story?",
        "response": "Shadow Patriots",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Falling Away from Me\" is a song by American band Korn, was released as the first single from their fourth album \"Issues\", debuting in an episode of Comedy Central's animated series \"South Park\", entitled \"Korn's Groovy Pirate Ghost Mystery\", it was the which number episode of the third season, and the 41st overall?",
        "response": "tenth",
        "source": "hotpot_qa"
    },
    {
        "query": "The US state in which Elijah Cutler Behunin Cabin was built is bordered by which state to the east?",
        "response": "Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "What name did Patrick Keeler's The Racounteurs use in Australia?",
        "response": "The Saboteurs",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both documentaries The Big One and the Ring of Fire documentaries about natural disasters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the Gulf War begin that required the force of the 101st Airborne Division Artillery?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "The Muscogee language was spoken by which native people of Florida?",
        "response": "Seminole",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle lasted longer, the Battle of Guam, or the Battle of Saipan?",
        "response": "The Battle of Saipan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Quarto and Strange Synergy both types of games?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the occupation of both  Nelson DeMille and Imre Kertész?",
        "response": "author",
        "source": "hotpot_qa"
    },
    {
        "query": "Which television personality from The Real Housewives of New Jersey won second partnership with Mike Malinon on the Famous Food series? ",
        "response": "Danielle Staub",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the composer Howard Ashman worked with on his musical released in 1982? ",
        "response": "Alan Menken",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state did both Joe Sestak and Pat Toomey serve in politics?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "What category of publication can, the American food bimonthly Bon Appétit and the official periodical of the Church of Jesus Christ of Latter-day Saints, called Ensign, be described as?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American business executive and the eighth Secretary of Defense, who surrounded himself with the group of experts called Whiz Kids?",
        "response": "Robert McNamara",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the band Luscious Jackson formed before Too Much Joy?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What arms firm develops a promotional calendar using models often featured bare-breasted in other newspapers?",
        "response": "Edgar Brothers",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the lodge that William Irving Turner  was credited with constructing built?",
        "response": "1936 to 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Pure Imagination\" was a cover version sung by Fiano Apple which was oroginally performed by Gene Wilder as Willy Wonka from the adaptation of the children's novel which came out in what year?",
        "response": "1964",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who wrote the lyrics for \"Insan Jaag Utha\" is noted for his association with what filmmaker?",
        "response": "Raj Kapoor",
        "source": "hotpot_qa"
    },
    {
        "query": "Although he mostly provided backing vocals as part of this group, Mark Owen's first single \"Four Minute Warning\" released on 4 August 2003, was once part of this English pop music group.",
        "response": "Take That",
        "source": "hotpot_qa"
    },
    {
        "query": "In which season was Carmelo Anthony, an American professional basketball player traded to the New York Knicks?",
        "response": "2010–11 Denver Nuggets season",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the genuses Fraxinus and Thymophylla belong to the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hyacinthella and Dirca both types of flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the building located at 200 West Street taller than the one at 888 7th Avenue?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the basketball team that trained under assistant coach, Steven Michael Henson at the University of Oklahoma ?",
        "response": "Oklahoma Sooners men's basketball",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Harley Brinsfield do that paved the way for Subway?",
        "response": "became one of the first and largest local fast food franchises",
        "source": "hotpot_qa"
    },
    {
        "query": "Though usually directing films, who recently starred in the film Swades?",
        "response": "Lekh Tandon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of Kowloon City, an area in Kowloon, Hong Kong, by 1990?",
        "response": "50,000 residents",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Guy Ritchie and Todd Field.both filmmakers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Holliday Grainger starred in what film distributed by Lionsgate?",
        "response": "Great Expectations",
        "source": "hotpot_qa"
    },
    {
        "query": "What city is the agency that provides access to The Patti Page Show based?",
        "response": "San Francisco",
        "source": "hotpot_qa"
    },
    {
        "query": "Which building, loacted in the capital and largest city of Barbados, was involved in a projects to restore Barbados-China relations?",
        "response": "Cheapside Market building",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, John Carpenter or Gordon Wiles?",
        "response": "Gordon Wiles",
        "source": "hotpot_qa"
    },
    {
        "query": "OK Calculator alludes to the album of what English rock band from Abingdon formed in 1985",
        "response": "Radiohead",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffrey Ettinger serves as independent director of a company founded in 1923 that is headquartered in what city and state?",
        "response": "St. Paul, Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has also written two novels set in the English Civil War,  Gillian Bradshaw or Arthur Hailey?",
        "response": "Gillian Marucha Bradshaw",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a monthly women's interest magazine launched by Time Inc. in 2000, Real Simple or Gospel Advocate?",
        "response": "Real Simple",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the manufacturer of the plane that shot down Jameel Sayhood?",
        "response": "McDonnell Douglas",
        "source": "hotpot_qa"
    },
    {
        "query": "John Huggins was the leader of an organization orginally called what?",
        "response": "Black Panther Party for Self-Defense",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Big Country and IAMX both dance bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in \"The Godfather\" was once up for a part in the remake of Ben-Hur?",
        "response": "Marlon Brando",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was the production run of the car that the Volkswagen Passat NMS replaced?",
        "response": "2005 to 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who voiced Shaggy in the \"Scooby-Doo\" franchise also appeared as a radio personality on what radio network?",
        "response": "Clear Channel Radio",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the university founded where the PeroxiBase database was created?",
        "response": "1559",
        "source": "hotpot_qa"
    },
    {
        "query": "What song written by American songwriter Johnny Marks, made popular by Burl Ives, is one of the Top 25 most performed holiday songs written by ASCAP members?",
        "response": "A Holly Jolly Christmas",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was the man who wrote the 1991 British fantasy comedy-drama television film Bernarn and the Genie born?",
        "response": "New Zealand",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to his role as Francis Gary Powers in Bridges of Spies, Austin Stowell also played in which movie in 2014?",
        "response": "\"Whiplash\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport is Pablo Aimar famous for playing?",
        "response": "footballer",
        "source": "hotpot_qa"
    },
    {
        "query": "Ex parte Milligan and Loving v. Virginia, are cases regarding which organization?",
        "response": "United States Supreme Court",
        "source": "hotpot_qa"
    },
    {
        "query": "De Beneficiis and the series regarding \"the happy life\" translate to what Greek concept?",
        "response": "eudaimonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Young Frankenstein included the actress and comedian who has won how many Primetime Emmy Awards over her 7-decade career?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the movie, for which James W. Sullivan was nominated for an Academy Award in the category Best Art Direction, produced by?",
        "response": "Michael Todd Company",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the artist who released the song \"Es De Verdad\" on her re-release album \"Utopía²\" born?",
        "response": "1989",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the maiden name of the designer of the sign requested by Ted Rogich?",
        "response": "Whitehead",
        "source": "hotpot_qa"
    },
    {
        "query": "What city in Pinellas County contains at least 145 historic buildings?",
        "response": "Tarpon Springs, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the  shipbuilding company which  MS Marina was constructed at based in ",
        "response": "Trieste, Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "\"The Abbess of Crewe\" is considered an allegory for the scandal during which what headquarters were broken into?",
        "response": "Democratic National Committee (DNC)",
        "source": "hotpot_qa"
    },
    {
        "query": "What rebellion, which culminated with the Second Battle of Vinegar Hill, was the largest convict uprising until the 1830 Bathurst rebellion?",
        "response": "Castle Hill convict rebellion",
        "source": "hotpot_qa"
    },
    {
        "query": "Men at Work: The Craft of Baseball was written by what American conservative political commentator who writes regular columns for The Washington Post?",
        "response": "George Frederick Will",
        "source": "hotpot_qa"
    },
    {
        "query": " \"Breathing Your Love\" is a song by the Swedish singer Darin featuring vocals by singer Kat DeLuna, in October 2009 which Swedish ESA astronaut, and physicist, took 2 copies of the single into space with him?",
        "response": "Christer Fuglesang",
        "source": "hotpot_qa"
    },
    {
        "query": "In which prominent Pixar Animation Studios film did James Albert Varney Jr. provide voice acting?",
        "response": "Toy Story",
        "source": "hotpot_qa"
    },
    {
        "query": "Are George Marshall and Kenji Mizoguchiboth American screenwriters?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a colleague of physicist Abraham Pais in Princeton, New Jersey?",
        "response": "Albert Einstein",
        "source": "hotpot_qa"
    },
    {
        "query": "Get on the Bus is a 1996 film about the gathering of African American men known as what?",
        "response": "Million Man March",
        "source": "hotpot_qa"
    },
    {
        "query": "Iron Man 3, is a 2013 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, Shane Black directed a screenplay he co-wrote with Drew Pearce, which uses concepts from the \"Extremis\" story arc by Warren Ellis, Black, is an American screenwriter, director, producer and actor, as an actor, Black is best known for his role as Hawkins in \"Predator\", in what year?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "How many original games are there in the tactical role-playing video game franchise developed by the same Japanese company who developed the \"Wars\" series of games?",
        "response": "twelve",
        "source": "hotpot_qa"
    },
    {
        "query": "Jonathan Kaye studied linguistics at Columbia University under Uriel Weinreich and Robert Austelitz, earning his Ph.D. in 1970, Uriel Weinreich (Yiddish: אוריאל ווײַנרײַך‎ \"Uriel Vaynraykh\", ] ; 23 May 1926 – 30 March 1967) was a Polish-American of which occupation.?",
        "response": "linguist",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Epidendrum and Convolvulus,which one has more than 1,500 species?",
        "response": "Epidendrum",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of musician does Arnold Schoenberg and Léo Delibes have in common?",
        "response": "composer",
        "source": "hotpot_qa"
    },
    {
        "query": "What name is called by his admirers  who is the music composer and created the music for the Hindi movie Musafir ?",
        "response": "Salilda",
        "source": "hotpot_qa"
    },
    {
        "query": "Don R. Berlin designed what American ground-attack aircraft that first flew in 1938?",
        "response": "The Curtiss P-40 Warhawk",
        "source": "hotpot_qa"
    },
    {
        "query": "Bassist of the band who released Voivod was originally in a band based where? ",
        "response": "San Rafael, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Which jazz singer has a 2003 album entitled The Boy Next Door? ",
        "response": "Stacey Kent",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-wrote a memoir with an American retired airline captain celebrated for the January 15, 2009 water landing of US Airways Flight 1549?",
        "response": "Jeffrey Zaslow",
        "source": "hotpot_qa"
    },
    {
        "query": "What city was formerly home to \"Maggie\", who's best remembered for exhorting the crew in Lifeboat No. 6 to return to the debris field of the 1912 sinking of RMS \"Titanic\" to look for survivors?",
        "response": "1340 Pennsylvania Street in Denver, Colorado, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The Inbetweeners 2 is a 2014 British comedy film and sequel to \"The Inbetweeners Movie\" (2011), a British coming-of-age comedy film based on the E4 sitcom \"The Inbetweeners\", written by series creators Damon Beesley and Iain Morris, and directed by who?",
        "response": "Ben Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Danish Viking, who ruled over parts of Friesland between 841 and 873 was the uncle of a Viking leader who raided the British Isles, West Francia, Frisia, and Lotharingia in the 860s and 870?",
        "response": "Roricus, Rorichus",
        "source": "hotpot_qa"
    },
    {
        "query": "Basselinia and Vancouveria, are commonly called what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "What musical Featuette had the american singer who won a Grammy for \"Best Music Video – Short Form\" for \"Opposites Attract\"?",
        "response": "Junior High School",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of producer of the compilation album DJ Set 1 ?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Fat Mike and Shim Eun-jin collaborated on music previously?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a judge on Strictly Come Dancing?",
        "response": "Craig Revel Horwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Chagnoald, was a bishop of Laon during the 7th century, from which collection of Germanic peoples that originated in the lands between the Lower and Middle Rhine in the 3rd century AD and eventually formed a large empire dominating much of western and central Europe during the Middle Ages?",
        "response": "Franks",
        "source": "hotpot_qa"
    },
    {
        "query": "Do the University of Florida and University of Texas System combine to have both a 2000 acre campus and over 216,000 students?",
        "response": "yes",
        "source": "hotpot_qa"
    }
]