[
    {
        "query": "What is the name of the bacterium that causes the smell of the cheese, of which churul is said to resemble in taste?",
        "response": "\"Brevibacterium linens\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Football Under Cover and 10 MPH are both what type of films?",
        "response": "documentary film",
        "source": "hotpot_qa"
    },
    {
        "query": "What does Barbra Streisand's son do for a living?",
        "response": "actor, director, producer, writer and singer",
        "source": "hotpot_qa"
    },
    {
        "query": "What former 1985 Scottish League Cup Final player managed Machester United from 1986 to 2013?",
        "response": "Alex Ferguson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which project is older the Woolworth Building or 80 Flatbush?",
        "response": "Woolworth Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucjan Żeligowski, was a Polish general, politician, military commander and veteran of World War I, the Polish-Soviet War and World War II, he's mostly remembered for his role in Żeligowski's Mutiny, a Polish military operation led by General Lucjan Żeligowski in October 1920, which resulted in the creation of which titled puppet state?",
        "response": "Republic of Central Lithuania",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both punk rock musicians, Spike Slawson and Greig Nori, from Canada? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Flower Alley was bred by the trainer who was killed at what Fayette County, Kentucky airport?",
        "response": "Blue Grass Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "In which 1987 film did this American actor of film and television and a client of Meyer Mishkin appear?",
        "response": "Lethal Weapon",
        "source": "hotpot_qa"
    },
    {
        "query": "The smallest of Hawaii's eight main volcanic islands which is home to the rare flowering plant, Euphorbia skottsvergii, get's how many cm of rainfall on average annually?",
        "response": "65",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Gerhart Hauptmann and Rex Stout have an occupation in common? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiong Bahru Plaza is located in the city that is at the southern tip of what landform?",
        "response": "Malay Peninsula",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the photographer associated with the New York School of Photography whose used his camera as a tool for social reform.",
        "response": "Lewis Hine",
        "source": "hotpot_qa"
    },
    {
        "query": "Buck Wolf is a former fashion editor from what weekly celebrity magazine?",
        "response": "Us Weekly",
        "source": "hotpot_qa"
    },
    {
        "query": "What university is in Muncie, Indiana and is near York Prairie Creek?",
        "response": "Ball State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American director inspired a video game based his 1984 movie \"Dune\"?",
        "response": "David Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 population of a city that contains a worker community built in 1917?",
        "response": "29,698",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the main industry of the town that has a ruined L-plan keep in an ancient Scottish village?",
        "response": "fishing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film company has connections with both A Tiger Walks and Finding Dory?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the 1999 short stories collection, \"Trist som faen,\" and was also given two pieces of furniture by Liv Mildrid Gjernes to as a wedding gift from the Norwegian government?",
        "response": "Ari Behn",
        "source": "hotpot_qa"
    },
    {
        "query": "What occupation did Maxim Kontsevich and Andrey Kolmogorov both share?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "Where else are popular films like Muddu Meena available outside of India?",
        "response": "Greater Middle East, Southeast Asia, Eastern Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the the Battle of Stones River occur before the Battle of Saipan?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Bloodbrothers starred which opera singer and cast member of Law and Order?",
        "response": "Paul Anthony Sorvino",
        "source": "hotpot_qa"
    },
    {
        "query": "What island is home to the Southwest Harbor Public Library?",
        "response": "Mount Desert Island",
        "source": "hotpot_qa"
    },
    {
        "query": "Before the Ganghwa massacre, 140 people were executed in Ganghwa in what is known as which war crime against communists and suspected sympathizers that occured in the summer of 1950?",
        "response": "Bodo League massacre",
        "source": "hotpot_qa"
    },
    {
        "query": "Holy Moly was an entertainment website that published gossip items relating to celebrities, including the great-granddaughter of Conrad Hilton, who is the the founder of what hotel chain?",
        "response": "Hilton Hotels",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a fictional character in Nickelodeon's animated television series \"\" and \"The Legend of Korra\", greatly aided the previous avatar, Aang, in his efforts to save the Earth Kingdom from destruction?",
        "response": "Toph Beifong",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the song, whose tune was originally composed for the 2006 comedy movie Jatra?",
        "response": "Chikni Chameli",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Scott Derrickson and Victor Hanbury both directors and producers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Chartres Cathedral and Blue Mountains mountain ranges in Jamaica?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "She attended college in the United States at Hampshire College, and held a role in an epic space opera. Who wrote and directed this film?",
        "response": "Rian Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was published first, Vice Versa or Woman's Day?",
        "response": "Woman's Day",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera has more acts Il tabarro or Orlando ?",
        "response": "Orlando",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Cranium and Auf Achse, which game had more people involved in creating?",
        "response": "Cranium",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Urban Meyer do?",
        "response": "coach",
        "source": "hotpot_qa"
    },
    {
        "query": "Guadarrama National Park and Teide National Park, are both national parks, in which country?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "Who composed the original off-Broadway score for a film where Marcus Clarke was a puppetteer?",
        "response": "Alan Menken",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Beardstown and Sangamon Canal, and Alexandria Canal both located in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of game is the game which Hon'inbō Genjō plays professionally?",
        "response": "abstract strategy board game",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city has more counties bordering it, Dezhou or Wugang, Hunan? ",
        "response": "Wugang",
        "source": "hotpot_qa"
    },
    {
        "query": "which British technology news and opinion website didMike Magee departed from? ",
        "response": "The Register",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American comedy film released which was written by Herschel Alan Weingrod with  Murray Salem?",
        "response": "December 21, 1990",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does the goalkeeper play for which Ahmad Khormali's tracksuit bottoms resemble?",
        "response": "Szombathelyi Haladás",
        "source": "hotpot_qa"
    },
    {
        "query": "What former city, now the fourth-largest Russian city, was the Belarusian State Technological University evacuated to in 1941?",
        "response": "Sverdlovsk",
        "source": "hotpot_qa"
    },
    {
        "query": "The Johann Strauss Orchestra was founded by André Rieu in 1987, it has performed regularly with guest musicians and singers such as which Brazilian operatic soprano?",
        "response": "Carmen Monarcha",
        "source": "hotpot_qa"
    },
    {
        "query": "Was McDull, Kung Fu Kindergarten or Pettson and Findus created first?",
        "response": "Pettson and Findus",
        "source": "hotpot_qa"
    },
    {
        "query": "Heart and Greed stars what former Chinese canadian newscaster?",
        "response": "Louise Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Nigerian actor and director was born in the capital city of Enugu State in Nigeria?",
        "response": "Sam Loco Efe",
        "source": "hotpot_qa"
    },
    {
        "query": " Billy Preston is an American college basketball player for a team that competes in what?",
        "response": "the Big 12 Conference",
        "source": "hotpot_qa"
    },
    {
        "query": "In what county would one find the benefactor of Benjamin Thompson's Warner Farm legacy?",
        "response": "Strafford County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who made the term popularised that is the nationalism of Suhaldev? ",
        "response": "Vinayak Damodar Savarkar",
        "source": "hotpot_qa"
    },
    {
        "query": "God Is Not Great is by a journalist which due to his actions made him what?",
        "response": "both a lauded intellectual and a controversial public figure",
        "source": "hotpot_qa"
    },
    {
        "query": "Sindhi women wear this type of dress, a traditional outfit that consists of baggy trousers and what?",
        "response": "long shirt",
        "source": "hotpot_qa"
    },
    {
        "query": "Who designed the car which succeeded the The Mercedes-Benz W25?",
        "response": "Rudolf Uhlenhaut",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Barry Ricardo Forde test positive for a substance used to treat hypogonadism and certain types of breast cancer?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had movies made in both English and French, Nicholas Hytner or Costa-Gavras?",
        "response": "Costa-Gavras",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the Mercury Seven became a Senator?",
        "response": "John Glenn",
        "source": "hotpot_qa"
    },
    {
        "query": "What debut studio album by American rapper ASAP Rocky released on January 15, 2013, that had a third single peaked at #80 on the Billboard Hot 100?",
        "response": "LONG.LIVE.A$AP",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the subject of a Swedish film in 1967 and learned tight rope dancing with Gisela Brož?",
        "response": "Elvira Madigan",
        "source": "hotpot_qa"
    },
    {
        "query": "Adam Dunkels is the author of which operating system useful for memory-constrained systems?",
        "response": "Contiki",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the year of birth of the songwriter who wrote the leading single on \"rhymes and reasons\"",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "Jang Hoon, directed which 2008 South Korean action crime film?",
        "response": "Rough Cut",
        "source": "hotpot_qa"
    },
    {
        "query": "The Griffin Auto Company Building is named after the company that is in what region of the US?",
        "response": "southeastern",
        "source": "hotpot_qa"
    },
    {
        "query": "Alvaro Mexia had a diplomatic mission with which tribe of indigenous people?",
        "response": "Apalachees",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population, according to the 2016 census, of the suburb of Melbourne where Hume City Bulldogs Rugby League Club is based ?",
        "response": "50,347",
        "source": "hotpot_qa"
    },
    {
        "query": "Brazilian Dogo and Cirneco dell'Etna are both what?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, U2 or The LaFontaines?",
        "response": "The LaFontaines",
        "source": "hotpot_qa"
    },
    {
        "query": "Great Palace Mosaic Museum and Hirami Ahmet Pasha Mosque, have which city in common?",
        "response": "Constantinople",
        "source": "hotpot_qa"
    },
    {
        "query": "Karl Ernst Haushofer was a German general, geographer and politician, through which of his student's, that was a prominent politician in Nazi Germany, his ideas influenced the development of Adolf Hitler's expansionist strategies?",
        "response": "Rudolf Walter Richard Hess",
        "source": "hotpot_qa"
    },
    {
        "query": "Have both Benjamin Spock and Yaşar Kemal been nominated for the Nobel Prize in Literature? ",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film director is older, Gareth Evans or Hans Weingartner? ",
        "response": "Hans Weingartner",
        "source": "hotpot_qa"
    },
    {
        "query": "The film To Hell and Back stars a combat solider that received the Medal of Honor at what age?",
        "response": "19",
        "source": "hotpot_qa"
    },
    {
        "query": "The Blackburn Rovers F.C. striker from Bayern Munich is a Paraguayan footballer and the the sixth Paraguay national team player to reach what?",
        "response": "100 appearances",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine, In These Times or Goldmine, is politcally driven?",
        "response": "In These Times",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Jars of Clay or The Killers from further west?",
        "response": "The Killers",
        "source": "hotpot_qa"
    },
    {
        "query": "Whip It was released by a film distribution company that specializes in the distribution of independent and British films as well as what kind of films?",
        "response": "dramedy and horror",
        "source": "hotpot_qa"
    },
    {
        "query": "Which state is home of the Lindner Family Tennis Center and the 7th most populous state in the United States?",
        "response": "Ohio",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city are the performers who released the song Be Mine based ?",
        "response": "Paris",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the mass media company based in that owns Velocity?",
        "response": "Silver Spring, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Murdered by My Boyfriend is a Award-winning of which organization, one-off fact-based drama first aired on BBC Three in 2014, It stars Georgina Campbell as Ashley Jones, a young victim of domestic abuse at the hands of her controlling boyfriend, Campbell is an English actress, best known for her television roles in \"One Night\" and \"Murdered by My Boyfriend\"?",
        "response": "BAFTA",
        "source": "hotpot_qa"
    },
    {
        "query": "Which studio produced the movie which had a 21-minute Halloween television special based on it that premiered on Wednesday, October 16, 2013?",
        "response": "Pixar Animation Studios",
        "source": "hotpot_qa"
    },
    {
        "query": "What Golden Globe nominated American actor from Juilliard School played a role in the 1986 romantic drama film, Children of a Lesser God, directed by Randa Haines?",
        "response": "William Hurt",
        "source": "hotpot_qa"
    },
    {
        "query": "Philip Carlo authored the biography of which American contract killer and serial killer?",
        "response": "Richard Kuklinski",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country did the footballer, who played striker for the Atlético Madrid, play for the national team?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "The Royal Bank of Scotland £10 note, also known as a tenner, is a banknote of the pound sterling, the current cotton note, first issued in 1987 bears an image of Lord Ilay, one of the founders of the bank, on the obverse and a vignette of which location, situated beside the village of Glamis in Angus, Scotland, on the reverse?",
        "response": "Glamis Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Xinzhou and Binzhou have in common?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital city of the country, bordred by the Atlantic ocean and Zambia, and where the Phyllogomphus selysi species of dragonfly can be found?",
        "response": "Luanda",
        "source": "hotpot_qa"
    },
    {
        "query": "What band is Mahalia Barnes's father a part of?",
        "response": "Cold Chisel",
        "source": "hotpot_qa"
    },
    {
        "query": "Jo Sung-hee (born February 3, 1979) is a South Korean film director, he directed which box office hit, a 2012 South Korean fantasy romance film in which a beautiful teenage girl (Park Bo-young) is sent to a country house for her health, where she befriends and attempts to civilize a feral boy she discovers on the grounds ?",
        "response": "A Werewolf Boy",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Hot Stuff (Let's Dance)\" is a song by British singer Craig David, it was released in November 2007 as the second single from his fourth album \"Trust Me\", following the single \"This Is the Girl\" with which English rapper and actor from East Ham, London, better know as?",
        "response": "Kano",
        "source": "hotpot_qa"
    },
    {
        "query": "The film starring Oscar Martinez was selected for which award at the 73rd Venice International Film Festival?",
        "response": "Golden Lion",
        "source": "hotpot_qa"
    },
    {
        "query": "The artist behind the \"You Don't Love Me (No, No, No)\" album had a career during which era?",
        "response": "rocksteady",
        "source": "hotpot_qa"
    },
    {
        "query": "636: Commander Cantrell in the West Indies is a novel in the 1632 series written by Eric Flint and Charles E. Gannon, and published on which date?",
        "response": "June 3, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Guantanamera has been recorded by the Puerto Rican guitarist known for what Christmas single?",
        "response": "Feliz Navidad",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the first person to describe Relational Quantum mechanics and has worked in Italy, the United States, and France?",
        "response": "Carlo Rovelli",
        "source": "hotpot_qa"
    },
    {
        "query": "The Order of the Lithuanian Grand Duke Gediminas features one of the earliest symbols of Lithuania, which is one of its historical what?",
        "response": "historical coats of arms",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry R. Williams is the father of four-time Academy Award nominee actress that made her feature film debut in what movie?",
        "response": "\"Lassie\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 1968 suspense and espionage film that starred a certain actor known for his gruff yet calm voice, pronounced eyebrows, and mischievous grin?",
        "response": "Ice Station Zebra",
        "source": "hotpot_qa"
    },
    {
        "query": "Garry West, Australian politician, held several ministerial positions in the Government of what Australian businessman and former politician?",
        "response": "Nick Greiner",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the man whom Dr. Diarmuid Whelan wrote his doctoral thesis on?",
        "response": "an Irish politician",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Need You\" is a 1967 single by Sonny James, James Hugh Loden, known professionally as Sonny James, was an American country music singer and songwriter best known for his hit, \"Young Love\", released in which year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "Joyce Carman Barkhouse, was a children's writer, of which nationality, best known for writing historical fiction, and is the aunt of Margaret Atwood, a Canadian poet, novelist, literary critic, essayist, inventor, and environmental activist?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Kanako Momota and Timo Kotipelto share a nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the sitting capacity of the stadium in which the 2016 NCAA Division II Men's Lacrosse Championship would be played on May 29, 2016? ",
        "response": "69,176",
        "source": "hotpot_qa"
    },
    {
        "query": "Ryan Murphy cowrote a movie based on which book of the same name that appeared on \"The New York Times\" Best Seller list for 187 weeks?",
        "response": "Eat Pray Love",
        "source": "hotpot_qa"
    },
    {
        "query": "Simone Simeri plays for the Italian team from what state?",
        "response": "Piedmont",
        "source": "hotpot_qa"
    },
    {
        "query": "In which category did this American actor, comedian, and singer who appeared in \"Borderland\" win the Saturn Award in 1997?",
        "response": "Best Supporting Actor",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Republican senator held the Nevada seat from 2001 to 2011, succeeding Richard Bryan?",
        "response": "John Ensign",
        "source": "hotpot_qa"
    },
    {
        "query": "How many seasons did the host of Inside the Vault play for the National Football League?",
        "response": "eight seasons",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Triple 9 film star made her debut in a suicide drama in 2006?",
        "response": "Teresa Palmer",
        "source": "hotpot_qa"
    },
    {
        "query": "Back Home is a children's historical novel adapted into a TV drama starring what English actress born in 1946?",
        "response": "Hayley Catherine Rose Vivien Mills",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Cão de Castro Laboreiro and Brazilian Dogo both dogs?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the band in which the member, who is known as the \"Five Foot Assassin\" and is featured on the song \"La Schmoove,\" is part of?",
        "response": "A Tribe Called Quest",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the company that owned the St. Louis Cardinals headquartered?",
        "response": "Leuven, Belgium",
        "source": "hotpot_qa"
    },
    {
        "query": "Herbert Sausgruber was born close to which Central European freshwater lake?",
        "response": "Lake Constance",
        "source": "hotpot_qa"
    },
    {
        "query": "Which alliance was formed in January 2016 in which the Value Alliance is second to when we talk of  low-cost carriers",
        "response": "U-FLY Alliance",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the name of the playwright featured in the 2004 film in which Nellie Bellflower was nominated for an Academy Award as Producer for Best Picture?",
        "response": "J. M. Barrie",
        "source": "hotpot_qa"
    },
    {
        "query": "Sid Haig and Mark Hoplamazian, have which mutual nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What multilingual singer is known for her work in pre-recorded songs for use in Indian films? ",
        "response": "Sangeetha Rajeev",
        "source": "hotpot_qa"
    },
    {
        "query": "Everybody's Crazy was produced by Michael Bolton, what genre of music does Everybody's Crazy fit into?",
        "response": "melodic hard rock",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was Gilles Tetreault's intended murderer from?",
        "response": "Canadian",
        "source": "hotpot_qa"
    },
    {
        "query": "The documentary featuring the Flight director that guided the crew of Apollo 13 was produced what year?",
        "response": "2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The Old \"New York Evening Post\" Building is the former office and printing plant of the \"New York Evening Post\" newspaper, located in which city?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Modest Mouse and The Wolfhounds, which band has released the latest album?",
        "response": "The Wolfhounds",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the old Irish meaning of the name of the county where Hugh Hamilton was born?",
        "response": "Land of Eoghan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is XXXX Bitter brewed?",
        "response": "Milton, Brisbane",
        "source": "hotpot_qa"
    },
    {
        "query": "On what island is the airport where Marilyn Jordan Taylor designed the SkyCity?",
        "response": "Chek Lap Kok",
        "source": "hotpot_qa"
    },
    {
        "query": "Which company associated with Guaraná is the biggest brewery in Latin America?",
        "response": "AmBev",
        "source": "hotpot_qa"
    },
    {
        "query": "How densely populated is this state, where one of the last actions, Battle of Point Judith, took place, compared to other U.S. states?",
        "response": "second most densely populated",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1999 Louisville Cardinals football team were led by the college coach who now leads what team?",
        "response": "Kentucky State University",
        "source": "hotpot_qa"
    },
    {
        "query": "what country is located in the island of Hispaniola and has Dypsis lutescens?",
        "response": "Dominican Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "The Yenko Super Camaro was a modified Chevrolet Camaro prepared by Yenko Chevrolet, under the personal supervision of Don Yenko, this put the Camaro at a serious disadvantage to the Dodge Dart, is an automobile originally built by Dodge from 1960 to what year, in North America?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "What band composed the song Steppin' in a Slide Zone?",
        "response": "The Moody Blues",
        "source": "hotpot_qa"
    },
    {
        "query": "The State Fair Classic occurs before what game commonly called the Red River Rivalry?",
        "response": "Red River Showdown",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state was both Rex Gene Foods and Foodtown located in?",
        "response": "New Jersey",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bowling for Columbine and Incident at Oglala both documentaries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What other notable role did the star actor from Jeremy perform? ",
        "response": "the voice of The Beast",
        "source": "hotpot_qa"
    },
    {
        "query": "What season of Gilmore Girls featured an actress as a maid of honor who had also played the role of Winnie Foster?",
        "response": "thirteenth",
        "source": "hotpot_qa"
    },
    {
        "query": "In what web television series was Mustafa Shakir cast as Bushemaster, a character in the Marvel Cinematic Universe?",
        "response": "Luke Cage",
        "source": "hotpot_qa"
    },
    {
        "query": "How many students are in the school in which Henry Alex Rubin studied film?  ",
        "response": "1,150",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the magazine Wallace Hester work for run?",
        "response": "1868 to 1914",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Multinational Monitor and Martha Stewart Living also television programs?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What position did General Musa Khan Akbarzada formerly hold the Pakistani capital of Peshawar?",
        "response": "consulate general",
        "source": "hotpot_qa"
    },
    {
        "query": "Role Models was a comedy film that was co-written by the American actor who studied at what American university?",
        "response": "University of Kansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Darren Criss wrote music an lyrics for a \"Harry Potter\" based parody, for what Chicago based musical theater company?",
        "response": "StarKid Productions",
        "source": "hotpot_qa"
    },
    {
        "query": "who was a character in A midsummer's night dream as well as the name of Carl Maria von Weber's opera?",
        "response": "Oberon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of this English scientist, whose laboratory burner design was later perfected by Peter Desaga into the Bunsen burner?",
        "response": "22 September 1791",
        "source": "hotpot_qa"
    },
    {
        "query": "What engine designed to power medium duty trucks and heavy cars was also used in Chevy's intermediate and pony car?",
        "response": "The Chevrolet \"Big Block\"",
        "source": "hotpot_qa"
    },
    {
        "query": "The Global Food Security Act of 2016, is a law introduced on March 24, 2015 in the 114th Congress by which Senator of Pennsylvania, who is an American attorney and politician, currently the senior United States Senator from Pennsylvania?",
        "response": "Robert Patrick \"Bob\" Casey Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the 1992 head coach of the Denver Nuggets go to college?",
        "response": "University of Kentucky,",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team, known along with Linfield as one of Belfast's \"Big Two,\" did Walter McMillen play for?",
        "response": "Glentoran Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Bob Marley and Timo Kotipelto have in common?",
        "response": "singer-songwriter",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born 29 August 1959 and is the former International Space Station Commander Colonel?",
        "response": "Chris Hadfield",
        "source": "hotpot_qa"
    },
    {
        "query": "Legao is the second solo album from a pop duo from which country ?",
        "response": "Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "Nic Nolan worked at which radio station that is 50% owned by NOVA Entertainment?",
        "response": "5AA",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the Scottish Gaelic word for the city in which the Craigentinny Traction Maintenance Depot is located?",
        "response": "Dùn Èideann",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor stars in both Spanisb drama 'Morrowbone' and American tv show 'Stranger Things'?",
        "response": "Charlie Heaton",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band is older, Archers of Loaf or Chumbawamba?",
        "response": "Chumbawamba",
        "source": "hotpot_qa"
    },
    {
        "query": "What tributary of the Neman River forms the bank of Vilijampolė?",
        "response": "Neris",
        "source": "hotpot_qa"
    },
    {
        "query": "Which has the campus with the greater area, St. Mary's University, Texas or the University of West Florida?",
        "response": "University of West Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was drafted ninth overall in the 66th NFL draft?",
        "response": "Koren Lynard Robinson",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel by Jack London is set during the Klondike Gold Rush?",
        "response": "The Call of the Wild",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress that portrayed a barmaid at the Rovers Return Inn on the program \"Coronation Street\" born?",
        "response": "1942",
        "source": "hotpot_qa"
    },
    {
        "query": "During the Harlan County War, a series of coal mining-related skirmishes, Florence Reece wrote what acclaimed folksong?",
        "response": "\"Which Side Are You On?\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are, A Village Romeo and Juliet and Einstein on the Beach both operas ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which countries has the host of the BBC Two comedy panel show, Dara Ó Briain, had pieces published in national papers?",
        "response": "Britain and Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "What country were both The Housemartins and Blood Red Shoes from?",
        "response": "England",
        "source": "hotpot_qa"
    },
    {
        "query": "What Business conglomerate incorporated in Bermuda is closely associated with Matheson & Company?",
        "response": "Jardine Matheson",
        "source": "hotpot_qa"
    },
    {
        "query": "Ross Pople worked with which English composer known for his opera \"The Midsummer Marriage\"?",
        "response": "Michael Tippett",
        "source": "hotpot_qa"
    },
    {
        "query": "Name an organization to which Gene Autry's collaborator on \"Here Comes Santa Clause\" belongs. ",
        "response": "ASCAP",
        "source": "hotpot_qa"
    },
    {
        "query": "American singer Steve Earle has released how many studio albums, including a collaboration with bluegrass artist Del McCoury, Delano Floyd McCoury was born in Bakersville, North Carolina in 1939, but the family relocated to York County, Pennsylvania while he was still a child, is an American bluegrass musician?",
        "response": "sixteen",
        "source": "hotpot_qa"
    },
    {
        "query": "Who completed Prokofiev's Cello Concertino with a Russian composer born in 1904?",
        "response": "Mstislav Rostropovich",
        "source": "hotpot_qa"
    },
    {
        "query": "How many MLB players were named in the Mitchell report who are alleged to have used performance enhancing drugs,  which is considered unethical and therefore prohibited by most international shorts organizations? ",
        "response": "89 MLB players",
        "source": "hotpot_qa"
    },
    {
        "query": "What Lebanese and English singer had a song covered a cappella in a 2015 film?",
        "response": "Michael Holbrook Penniman, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "What Epcot attraction used the same theme song as an attraction replaced in Disneyland by America Sings in 1974?",
        "response": "Horizons",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Tommy Lee Jones and Todd Haynes actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which commuter airline with its head office in the Isle of Man Airport was sometimes operated by Links Air?",
        "response": "Manx2",
        "source": "hotpot_qa"
    },
    {
        "query": "Bustle and The Australian Women's Weekly are both what?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Robert Gregson and Mauritz Stiller both American film directors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are André Berthomieu and Larisa Shepitko both from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Milan Kundera or Daniil Kharms?",
        "response": "Daniil Kharms",
        "source": "hotpot_qa"
    },
    {
        "query": "Haunted was originally sung by which Nigerian-born musician?",
        "response": "Caitlín \"Cait\" O'Riordan",
        "source": "hotpot_qa"
    },
    {
        "query": "Cantabrian mythology was likely diluted by what Iron Age mythology?",
        "response": "Celtic mythology",
        "source": "hotpot_qa"
    },
    {
        "query": "What author of several best-selling books also wrote The Scarlet Slippers?",
        "response": "Philip Pullman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was founded earlier, The Week or New Scientist?",
        "response": "New Scientist",
        "source": "hotpot_qa"
    },
    {
        "query": "What producer who died in 1978 developed American television detective show Mannix?",
        "response": "Bruce Geller",
        "source": "hotpot_qa"
    },
    {
        "query": "Horrorween starred which actor and stuntman?",
        "response": "Thomas Vincent Savini",
        "source": "hotpot_qa"
    },
    {
        "query": "Aside from the Apple Remote, what other device can control the program Apple Remote was originally designed to interact with?",
        "response": "keyboard function keys",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Spanish footballer who plays as a right back for the team that was founded in 1919 and plays home matches at Estadio Nueva Condomina born?",
        "response": "born 18 January 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city did Ken Takakuwa win a gold medal for the 200m IM event at the Asian Games?",
        "response": "Guangzhou, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Some Things I Know is the second album from a singer born in what year?",
        "response": "1966",
        "source": "hotpot_qa"
    },
    {
        "query": "What Nick Cave and the Bad Seeds music video features a cameo from Paula Yates daughter?",
        "response": "More News from Nowhere",
        "source": "hotpot_qa"
    },
    {
        "query": "Joy Malbon was a journalist who covered the verdict regarding which taxi driver?",
        "response": "Rodney Glen King",
        "source": "hotpot_qa"
    },
    {
        "query": "Was the date that the album on which \"There's No Home for You Here\" appeared was released?",
        "response": "April 1, 2003",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016 Pittsburg State Gorillas football team led by their head coach, Tim Beck, played their home games on which field?",
        "response": "Brandenburg Field",
        "source": "hotpot_qa"
    },
    {
        "query": "Catherine Cox is an American actress, and was a regular on the Broadway stage in the 1980s, Cox's credits include the original Ethel McCormack in the production of \"Footloose\", a musical, released in which year, based on the 1984 film of the same name?",
        "response": "1998",
        "source": "hotpot_qa"
    },
    {
        "query": "Who passed away first, Manfred von Richthofen or Cedric Popkin ?",
        "response": "Manfred von Richthofen",
        "source": "hotpot_qa"
    },
    {
        "query": "Antoni Patek created Patek Philippe & Co. in what year?",
        "response": "1851",
        "source": "hotpot_qa"
    },
    {
        "query": "Justin Vincent, is a former American football running back for the Pittsburgh Steelers, he was the MVP of the 2004 BCS National Championship game, the 2004 Nokia Sugar Bowl, the BCS title game for the 2003 college football season, was played on which date?",
        "response": "January 4, 2004",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 1982 novel, the subject of which is credited with saving the lives of 1,200 Jews during the Holocaust, including the life of Moshe Taubé?",
        "response": "\"Schindler's Ark\"",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was LiquidSky initially announced in 2017?",
        "response": "Las Vegas, Nevada, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the law firm that a woman who formerly worked with the winner of the 2000 United States Senate election of New York?   ",
        "response": "Boies, Schiller & Flexner",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 7 foot tall, 325 lb basketball player missed the first 22 games of the 1995–96 NBA season?",
        "response": "Shaquille Rashaun O'Neal",
        "source": "hotpot_qa"
    },
    {
        "query": "In which mountain range is the the Fitzroy ?",
        "response": "the Andes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Franco-Siamese War was a conflict that included the system of government adopted in France in what year?",
        "response": "1870",
        "source": "hotpot_qa"
    },
    {
        "query": "What hip hop artist recorded a studio album that won a Guild of Music Supervisors Award in 2016?",
        "response": "Dr. Dre",
        "source": "hotpot_qa"
    },
    {
        "query": "A Charming Garden is located in what area in the Yau Tsim Mong District?",
        "response": "Mong Kok",
        "source": "hotpot_qa"
    },
    {
        "query": "Stan Zimmerman produced the show \"Rita Rocks\" whose lead actress also appeared in the TV shows Martin and what ABC sitcom?",
        "response": "My Wife and Kids",
        "source": "hotpot_qa"
    },
    {
        "query": "We Own the Night is the debut EP by the hip hop artist who was an original member of what group?",
        "response": "The Diplomats",
        "source": "hotpot_qa"
    },
    {
        "query": "Comet is a wooden roller coaster at Hersheypark built by a company that was established in what year?",
        "response": "1904",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Bumbo or Ti' Punch have more cinnamon in it?",
        "response": "Cinnamon is sometimes substituted for or added to the nutmeg.",
        "source": "hotpot_qa"
    },
    {
        "query": "While Tâb is a board game, what type of game is Time's Up!?",
        "response": "charades-based party game",
        "source": "hotpot_qa"
    },
    {
        "query": "Rimo I and Passu Sar are both part of which mountain range?",
        "response": "Karakoram mountain range",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mysterious Mr. Wong is a tongue-in-cheek 1934 mystery film starring Bela Lugosi as a powerful type of which fictional character introduced in a series of novels by British author Sax Rohmer during the first half of the twentieth century?",
        "response": "Fu Manchu",
        "source": "hotpot_qa"
    },
    {
        "query": "Etienne Henri \"Hans\" Larive escaped from a prisoner of war camp that is between the towns of Hartha and what?",
        "response": "Grimma",
        "source": "hotpot_qa"
    },
    {
        "query": "For which war was the 71 calibre tank gun developed by a prominent 400 year old German dynasty?",
        "response": "Second World War",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the groups The Exies and Portugal. The Man from the same country?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Hana Mandlíková and Johan Kriek, who won more Grand Slam singles at the French Open?",
        "response": "Hana Mandlíková",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the coached the Idaho Vandals born?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Behrendt and Scott Sanders, have which mutual occupations?",
        "response": "screenwriter and film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Bangalore Naatkal starred which actor and photographer?",
        "response": "Ramanaidu Daggubati",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1985 novel was set in medieval England and featured four distinct royal houses?",
        "response": "Here Be Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of ride do by a family-owned waterpark resort and Legoland Discovery Center Kansas City have in common?",
        "response": "Verruckt waterslide",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Haslag is the Chair in Economics at the university whose post is named after the businessman who was CEO of what company?",
        "response": "Enron Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "The country music artist who released Radio Lover was given what nickname based o the shape of his nose?",
        "response": "\"The Possum.\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Norma and Idomeneo both operas by Bellini?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Magnificent Bodyguards is a Hong Kong martial arts action film, released in which year, starring Jackie Chan, a Hong Kong martial artist, actor, film director, producer, stuntman, and singer?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Owen Davidson and Horia Tecău play the same sport?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "This boxer trained by Naazim Richardson won a gold medal in what event in 2007?",
        "response": "Pan Am Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Which system is most likely to have impacted current computer technology, Atari or Comx-35?",
        "response": "Atari",
        "source": "hotpot_qa"
    },
    {
        "query": "Sonam Kapoor (] ; born 9 June 1985) is an Indian actress who appears in Bollywood films and starring in \"I Hate Luv Stories\" an Indian romantic comedy appeared in what magazine based on her income and popularity?",
        "response": "\"Forbes India\"'s Celebrity 100",
        "source": "hotpot_qa"
    },
    {
        "query": "In what category did the composer of \"Elliot, a Soldier's Fugue\" win a Tony Award in 2008?",
        "response": "for Best Musical",
        "source": "hotpot_qa"
    },
    {
        "query": "What role in their respective bands links Brent Smith and Mike Score?",
        "response": "lead vocalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Sallie Wilson was associated with what classical ballet company in New York City that has an annual eight-week season at the Metropolitan Opera House?",
        "response": "American Ballet Theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote \"House of Cards\" and Never Surrender?",
        "response": "Michael Dobbs",
        "source": "hotpot_qa"
    },
    {
        "query": "Which prehistoric period of Mesopotamia were the majority of the remains from found in Tell al-Ubaid?",
        "response": "Ubaid period",
        "source": "hotpot_qa"
    },
    {
        "query": "The 15th annual 2011 Webby Awards were held on June 13, 2011 in New York City, the Webby for lifetime achievement was awarded to which former American Motorola executive, and engineer?",
        "response": "Martin Cooper",
        "source": "hotpot_qa"
    },
    {
        "query": "Riann Stelle appeared in what Royal Shakespeare Company production that portrays the events surrounding a former queen of the Amazons?",
        "response": "A Midsummer Night's Dream",
        "source": "hotpot_qa"
    },
    {
        "query": "Maurice Bénichou is a French actor, one of his best known roles, includes a collaborations with director Michael Haneke, in which 2005 French psychological thriller written and directed  by Haneke?",
        "response": "Caché",
        "source": "hotpot_qa"
    },
    {
        "query": "Terrible Beauty was a novel by the politician who serves what district in New York?",
        "response": "2 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "Mark Duckens first attended which third-largest university in Kansas?",
        "response": "Wichita State University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Academy Award was won by Stephan Dupuis for a film starring Jeff Goldblum, Geena Davis and John Getz?",
        "response": "Best Makeup",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was published founded most recently, InStyle or Godey's Lady's Book?",
        "response": "InStyle",
        "source": "hotpot_qa"
    },
    {
        "query": "Aunt Bam's Place is a 2011 American musical play created, written, produced, and directed by Tyler Perry, an American actor, comedian, filmmaker, writer, and songwriter, specializing in which genre?",
        "response": "gospel",
        "source": "hotpot_qa"
    },
    {
        "query": "Styal Cottage Homes had foundations laid in 1896 by the politician who was from what party?",
        "response": "Conservative",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was released earlier, The Lizzie McGuire Movie or A Tale of Two Critters?",
        "response": "A Tale of Two Critters",
        "source": "hotpot_qa"
    },
    {
        "query": "What lyricist penned the English lyrics to Maître Pierre?",
        "response": "Mitchell Parish",
        "source": "hotpot_qa"
    },
    {
        "query": "Big Brother is what?",
        "response": "a skateboarding magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "What American multinational corporation offers online services as well as physical NIKEiD studios in different countries around the world?",
        "response": "Nike, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Lexie Dean Robertson's work was featured in a magazine owned by who?",
        "response": "Hearst Corporation",
        "source": "hotpot_qa"
    },
    {
        "query": "\"You Could Be Mine\" is a song featured on their 1991 fourth studio album, by American rock band Guns N' Roses , often abbreviated as GNR, is an American hard rock band from Los Angeles and formed in what year?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of the man who headed the Rhodesian Front?",
        "response": "Douglas",
        "source": "hotpot_qa"
    },
    {
        "query": "The town of Seward, New York is named after a US secretary of state born on which day ?",
        "response": "May 16, 1801",
        "source": "hotpot_qa"
    },
    {
        "query": "Kisiljevo (Serbian Cyrillic: Кисиљево, formerly Kisilova) is a village in north-east Serbia (Braničevo District), located at municipality Veliko Gradište, the town was once famous for its story about who, a Serbian peasant who was believed to have become a vampire after his death and to have killed nine of his fellow villagers?",
        "response": "Petar Blagojevich",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Carlos Diegues or Peter Watkins have more international experience behind their films?",
        "response": "Peter Watkins",
        "source": "hotpot_qa"
    },
    {
        "query": "Whitechapel is a series that depicted a killer who was copying the actions of which unidentified serial killer?",
        "response": "Jack the Ripper",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Benjamin Christensen and Len Wiseman directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the film release that introduced the titular extraterrestrial race that duels with Batman in the comic book crossover \"Batman Versus Predator\"?",
        "response": "1987",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city did both, the New York World Building and Time Warner Center exist?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Which coastal region boasts a duke named Unno who speaks Frisian?",
        "response": "Frisia",
        "source": "hotpot_qa"
    },
    {
        "query": "The current wide receivers coach for Bowling Green, Seth Doege, was the 4th of 4 West Texas natives to quarterback for Texas Tech during the Mike Leach era.  The player who was 2nd of the 4 played during which season?",
        "response": "2005 season",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Mopreme Shakur's hip hop group release their only album?",
        "response": "1994",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Slowness\" is a novel whose author was born in what year?",
        "response": "1929",
        "source": "hotpot_qa"
    },
    {
        "query": "Janelle Monae released a song on July 30, 2014, featuring which backup dancer from Destiny's Child?",
        "response": "Solange Piaget Knowles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Umar Israilov or Ramzan Kadyrov?",
        "response": "Ramzan Kadyrov",
        "source": "hotpot_qa"
    },
    {
        "query": "What play written by William Shakespeare was also made into notable theatrical releases in 1936, 1968, and 1996? ",
        "response": "Romeo and Juliet",
        "source": "hotpot_qa"
    },
    {
        "query": "Revolution will star which singer who is a member of Super Junior?",
        "response": "Choi Si-won",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2010, what was the population of the county that was named after the 13th Speaker of the House of Representatives?",
        "response": "16,825",
        "source": "hotpot_qa"
    },
    {
        "query": "The group known as Various Production has remixed what artist who graduated from BRIT school for Performing Arts and Technology and released the album \"19\"?",
        "response": "Adele",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the script for a 2002 film directed by Steven Spielberg starring Tom Hanks?",
        "response": "Jeff Nathanson",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did the current manager of Milan replace as caretaker during the 2010–11 A.S. Roma season?",
        "response": "Claudio Ranieri",
        "source": "hotpot_qa"
    },
    {
        "query": "From when the Center for the Arts is operating in which the Hudson Museum is located?",
        "response": "1986",
        "source": "hotpot_qa"
    },
    {
        "query": "What burial method requires digging up skeletal remains and was the subject of a 2007 documentary?",
        "response": "An ossuary",
        "source": "hotpot_qa"
    },
    {
        "query": "The classic presenter of the paradox of value is a philosopher that died in this year?",
        "response": "1790",
        "source": "hotpot_qa"
    },
    {
        "query": "Sarah Josepha Buell Hale (October 24, 1788 – April 30, 1879) was an American writer and an influential editor, she's the author of the nursery rhyme \"Mary Had a Little Lamb\", the English language nursery rhyme of nineteenth-century of which nationality origin?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of the South Korean television series known as The Inheritors was born on October 19, 1992?",
        "response": "Kim Ji-won",
        "source": "hotpot_qa"
    },
    {
        "query": "Rachid Belkacem a Dutch national, was a friend of Mohammed Bouyeri, a Moroccan-Dutch Islamic terrorist and convicted murderer who is serving a life sentence without parole for the assassination of what Dutch film director?",
        "response": "Theo van Gogh",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ratio of flow velocity past a boundary to the local speed of sound for a Saab JAS 39 Gripen?",
        "response": "2",
        "source": "hotpot_qa"
    },
    {
        "query": "Which aria provides the only set-piece is the most popular one in the Gianni Schicchi opera?",
        "response": "O mio babbino caro",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the David Bowie album with the song \"Little Wonder\" released ?",
        "response": "February 1997",
        "source": "hotpot_qa"
    },
    {
        "query": "Alicia Boscatto won silver at the multi-sport event from 1987 held in what US city?",
        "response": "Indianapolis",
        "source": "hotpot_qa"
    },
    {
        "query": "Sara Jane Moore, is an American citizen best known for attempting to assassinate US President Gerald Ford, in which year?",
        "response": "1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more career changes, Charles A. Agemian or Arshile Gorky?",
        "response": "Charles A. Agemian",
        "source": "hotpot_qa"
    },
    {
        "query": "The tap dancing soloist in My Feet Keep Dancing also starred in what 1935 MGM musical?",
        "response": "\"An All-Colored Vaudeville Show\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian province did the famous computer scientist John Tsotsos serve as the Director of the Centre for Vision Research at a famous research university?",
        "response": "Ontario",
        "source": "hotpot_qa"
    },
    {
        "query": "Which municipality of Gunnison County, Colorado is now called \"the last great Colorado ski town\" and is located near the Lucky Jack mine?",
        "response": "Crested Butte, Colorado",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of industry does Hall Bartlett and Catherine Breillat have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Through the Looking-Glass is an 1871 work of children's literature by Lewis Carroll, the sequel to \"Alice's Adventures in Wonderland\", released in which year?",
        "response": "1865",
        "source": "hotpot_qa"
    },
    {
        "query": "Directed by Damien O'Donnell, what 1999 movie was written by one of the titular characters of \"Sammy and Rosie Get Laid\"?",
        "response": "East Is East",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English Football player who was born in 1936 began his career in the Manchester United youth teams playing alongsude Tony Hawksworth?",
        "response": "Duncan Edwards",
        "source": "hotpot_qa"
    },
    {
        "query": "The Transcaucasian Commissariat decided to strengthen the Georgian-Armenian-Azerbaijani union by general assembly known as what?",
        "response": "A convocation (from the Latin \"convocare\" meaning \"to call/come together\",",
        "source": "hotpot_qa"
    },
    {
        "query": "The Clausius–Clapeyron relation was named after a German physicist and mathematician who is considered one of the central founders of what area of science?",
        "response": "the science of thermodynamics",
        "source": "hotpot_qa"
    },
    {
        "query": "John Aston was a follower of which English philosopher?",
        "response": "John Wycliffe",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the harpist who came out with the album \"White Winds\"?",
        "response": "Swiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Den Tagayasu lived in the town that was bombed on which dates?",
        "response": "9–10 March 1945",
        "source": "hotpot_qa"
    },
    {
        "query": "Johnny Hornby is a British entrepreneur, he is the founder of WPP plc, (Wire and Plastic Products), a British multinational advertising and public relations company with its main management office in London, England, and its executive office in Dublin, in which country?",
        "response": "Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus is found in open or mountainous habitats, Solenopsis or Origanum?",
        "response": "Origanum",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that featured Nagoor Babu and the last appearance of Taruni Sachdev?",
        "response": "Rudhran",
        "source": "hotpot_qa"
    },
    {
        "query": "David J. Pecker is the publisher of what supermarket tabloid?",
        "response": "Globe",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer who made The Legend of Bonnie & Clyde was born in what year?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game allows more players to play, Forbidden Island or Australia?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Basil Bunting and Jack Kerouac both writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both Live It Up and 360?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "The College of Engineering at the University of Illinois at Urbana–Champaign was first established in 1868,  Engineering at Illinois consistently ranks amongst the top five such engineering colleges in the United States by which American media company that publishes news, opinion, consumer advice, rankings, and analysis, founded as a newsweekly magazine in 1933?",
        "response": "U.S. News & World Report",
        "source": "hotpot_qa"
    },
    {
        "query": "Kings Domain is an area of parklands in Melbourne, Victoria, Australia, it surrounds Govern House Reserve, the home of the Governors of Victoria, and which outdoor performance venue in Melbourne, Victoria, Australia, located in the lawns and gardens of Kings Domain?",
        "response": "Sidney Myer Music Bowl",
        "source": "hotpot_qa"
    },
    {
        "query": "What ukulele player has Sheldon Gomberg worked with?",
        "response": "Zooey Deschanel",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Steve Hogarth or Donnie Munro?",
        "response": "Donnie Munro",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has received more academy award nominations, John Boorman or Rick Rosenthal?",
        "response": "John Boorman",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of \"The Master Cleanse\" was born on April 30, 1975?",
        "response": "Johnny Galecki",
        "source": "hotpot_qa"
    },
    {
        "query": " Jung Yong-hwa and Chrissie Hynde are both musicians in what musical genre?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the person for whom Tubman University was named serve as President of his country?",
        "response": "1944 until his death in 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "What singer-songwriter, born 30 October 1989, was in the British-Irish girl group The Saturdays which formed during the summer of 2007?",
        "response": "Vanessa White",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the last movie that Barry Kooser worked as a background artist for?",
        "response": "Brother Bear",
        "source": "hotpot_qa"
    },
    {
        "query": "The building at the end of Pennsylvania Route 3 was built in what year?",
        "response": "1901",
        "source": "hotpot_qa"
    },
    {
        "query": "MHEG-5 is a set of standards set by the experts group in which nonlinear medium of information?",
        "response": "Hypermedia",
        "source": "hotpot_qa"
    },
    {
        "query": "The Really Nasty Horse Racing Game and Inkan aarre, is which specific form of entertainment, and genre?",
        "response": "board game",
        "source": "hotpot_qa"
    },
    {
        "query": "When does the leader of  McCoys of Kentucky died under who's leadrship The Hatfield–McCoy feud occured?",
        "response": "March 28, 1914)",
        "source": "hotpot_qa"
    },
    {
        "query": "This historical theatrical venue showed the first performance of what would eventually be the US national anthem",
        "response": "Holliday Street Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Byung-hun worked on the 2005 gangster film written and directed by whom?",
        "response": "Kim Jee-woon",
        "source": "hotpot_qa"
    },
    {
        "query": "Siegfried and Idomeneo are both what type of performances?",
        "response": "music",
        "source": "hotpot_qa"
    },
    {
        "query": "The Hunger Games: Catching Fire is the sequel to the science fiction film directed by whom?",
        "response": "Gary Ross",
        "source": "hotpot_qa"
    },
    {
        "query": " The Painted Veil is the original soundtrack of a 2006 film based on a novel by what author?",
        "response": "W. Somerset Maugham",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South Korean professional footballer was awarded 2015 Best Footballer in Asia?",
        "response": "Son Heung-min",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Lawson or American Music Club?",
        "response": "Lawson",
        "source": "hotpot_qa"
    },
    {
        "query": "What types of individuals connect the warrior and invictus games ?",
        "response": "injured or sick armed services personnel",
        "source": "hotpot_qa"
    },
    {
        "query": "I'm a Loser was considered for release as a single until a track was written that featured the first uses of what in populer music?",
        "response": "guitar feedback",
        "source": "hotpot_qa"
    },
    {
        "query": "What director's 2012 comedy did Noah Lomax appear in?",
        "response": "Gabriele Muccino",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: Cemu is a Wii U video game console emulator for Microsoft Windows-based personal computers, typically, the emulator updates once every two to four weeks, with supporters of which membership platform that provides business tools for creators to run a subscription content service, as well as ways for artists to build relationships and provide exclusive experiences to their subscribers, or \"patrons\", were receiving updates a week earlier than the public release?",
        "response": "Patreon",
        "source": "hotpot_qa"
    },
    {
        "query": "How much area does the Lutheran church located in Ulm, Germany covers?",
        "response": "185,000 to 190,000 m³",
        "source": "hotpot_qa"
    },
    {
        "query": " Liz Rose co-wrote the Taylor Swift song that was produced by whom?",
        "response": "Nathan Chapman",
        "source": "hotpot_qa"
    },
    {
        "query": "Both the movie Pippi on the Run and the character Pippi Longstocking , are based on books by what author?",
        "response": "Astrid Lindgren",
        "source": "hotpot_qa"
    },
    {
        "query": "Conkey's Tavern is where Daniel Shays met with followers and plotted what rebellion?",
        "response": "Shays' Rebellion",
        "source": "hotpot_qa"
    },
    {
        "query": "Texas Private Investigator worked on a case involving a New York millionaire primarily known for what?",
        "response": "being suspected of foul play against three individuals in different states",
        "source": "hotpot_qa"
    },
    {
        "query": "Which NHL right winger endorsed a failed player equipment line by hockey equipment maker Koho?",
        "response": "Jaromír Jágr",
        "source": "hotpot_qa"
    },
    {
        "query": "The SEAT Córdoba and the SEAT Ibiza are both named after Spanish cities, but what was the first naming model called?",
        "response": "SEAT Ronda",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the man who, as the Archbishop of Canterbury's envoy, was kidnapped in Lebanon in 1987 ?",
        "response": "Hardy",
        "source": "hotpot_qa"
    },
    {
        "query": "The person who wrote the biography of Bertha of Bingen was born in what year?",
        "response": "1098",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Harrier and King Shepherd both hybrids?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the bands Surrounded and The National formed in the same county?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Rettbach (Rot) is a river of Thuringia, a federal state in the central of which country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Blood Bowl and Afrikan tähti both games?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which city was the Symphony for Classical Orchestra in B-flat major completed by Harold Shapero who undoubtedly derived a fair amount from the American composer, teacher and writer known as the 'Dean of American Composers'?",
        "response": "Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the German state whose capital is known for a bombing raid during the second world war where 3,900 tons of high-explosive bombs and incendiary devices were dropped with the help of Sir Arthur Harris Air Officer Commanding-in-Chief?",
        "response": "Saxony",
        "source": "hotpot_qa"
    },
    {
        "query": "What other roles is the director of the American romantic comedy written by Peter Chiarelli and released in 2009 known for?",
        "response": "dancer, actress, choreographer",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the first principle of Kwabena Okyere Darko-Mensah's secondary school?",
        "response": "James Picot",
        "source": "hotpot_qa"
    },
    {
        "query": "Jack is a 2015 Austrian thriller film about serial killer Jack Unterweger, was an Austrian serial killer who murdered prostitutes in several countries, and first convicted of a murder, in which year?",
        "response": "1974",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the principal activity of the company  which holds that which  Robert Melville previously worked with",
        "response": "design, development, manufacture",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population in 2010 of the community situated at exit 70 on Interstate 495 ? ",
        "response": "14,314",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first George Washington or John Baker ?",
        "response": "George Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "The ethnic group of which Rev. Charles Bluejacket  was once chief spoke what language?",
        "response": "Algonquian-speaking",
        "source": "hotpot_qa"
    },
    {
        "query": "Which summer deaflympics did Virender Singh get a bronze metal?",
        "response": "21st Summer Deaflympics",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do both Jim Grabb and Michael Chang play?",
        "response": "tennis",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie was directed by Song Hae-sung and stars an actor who appeared in the television drama \"April Kiss\"?",
        "response": "A Better Tomorrow",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the original name of the city served by the Hackensack Water Company?",
        "response": "New Barbadoes Township",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Danish heavy metal band from Copenhagen released a compilation album of rare demo tracks?",
        "response": "Mercyful Fate",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are OMD singer Andy McCluskey and Suptertamp co-frontman Roger Hodgson?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the 16th-century mosque demolished which occurred a couple of months after \"Ram ke Naam\" was released?",
        "response": "6 December 1992",
        "source": "hotpot_qa"
    },
    {
        "query": "Which man, Henry Winkler or Hugh Schulze, won the Best Feature/Comedy Award at the International Family Film Festival in 2010?",
        "response": "Hugh Schulze",
        "source": "hotpot_qa"
    },
    {
        "query": "Cody Burger played Cousin Rocky Johnson ina film directed by who?",
        "response": "Jeremiah S. Chechik",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the palace built near the River Arno in Florence, Italy by the son of Buonaccorso Pitti?",
        "response": "Palazzo Pitti",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1948–49 New York Knicks season was the third season for the team in the Basketball Association of America (BAA), which later became the National Basketball Association (NBA),New York qualified for the playoffs, and defeated which American Basketball League (1944–47) team, and later, a Basketball Association of America (1947–49), and (beginning in 1949, following the BAA's absorption of the National Basketball League) a National Basketball Association team based in Baltimore?  ",
        "response": "Baltimore Bullets",
        "source": "hotpot_qa"
    },
    {
        "query": "Die Hard special effects were done by Boss Game Studios, who else was involved with the movie?",
        "response": "John McTiernan",
        "source": "hotpot_qa"
    },
    {
        "query": "Carry On Cabby is the seventh in the series of \"Carry On\" films to be made, a regular is which South African-born British character actor and comedy actor?",
        "response": "Sid James",
        "source": "hotpot_qa"
    },
    {
        "query": "Which website contributes to the Slashdot effect and allows registered users to up or down vote submissions?",
        "response": "Reddit",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote \"Old Grey Whistle Theft\"?",
        "response": "Arthur Mathews and Graham Linehan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Ixiolirion and Aster both flowering plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this association football award that recognises the best Premier League player each month of the season, which is announced with the Premier League Manager of the Month, currently called?",
        "response": "EA SPORTS Player",
        "source": "hotpot_qa"
    },
    {
        "query": "What novel by the author of \"The Great Simoleon Caper\" covers topics such as history, linguistics, anthropology, archaeology, religion, and more?",
        "response": "Snow Crash",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the earliest published D-I-Y \"home movies\" of New York punk's birth filmed by Amos Poe and Ivan Kral, Koyaanisqatsi or The Blank Generation?",
        "response": "The Blank Generation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first out of Maurice Elvey and Chester Erskine?",
        "response": "Maurice Elvey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary came first, 10 Questions for the Dalai Lama or Bougainville – Our Island Our Fight?",
        "response": "Bougainville – Our Island Our Fight",
        "source": "hotpot_qa"
    },
    {
        "query": "Thakur Srinath Singh (1901-1996) was a renowned Indian poet, known for his poems for who, such as Nani Ka Sndook, Makkhi Ki Nigah, memoirs of his early life is given in \"Aatamkatha ank\" of Hans (magazine) published by Premchand, better known as Munshi Premchand, Munshi being an honorary prefix, was an Indian writer famous for his modern Hindi-Urdu literature?",
        "response": "children",
        "source": "hotpot_qa"
    },
    {
        "query": "Hey Ya is a song performed on The Ed Sullivan Show on CBS by which hip hop artist in 2003?",
        "response": "is a song written and produced by André 3000",
        "source": "hotpot_qa"
    },
    {
        "query": "From which country originate both the flavoured soft drink Nehi and the soft drinks company Faygo Beverages?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Are  Vanessa Petruo and  Greek Fire from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In between Scotch Collie and Burgos Pointer which one is a breed of dog native to Spain?",
        "response": "Burgos Pointer",
        "source": "hotpot_qa"
    },
    {
        "query": "This song covered by Dr. John in 1972 was originally sung by which group?",
        "response": "The Dixie Cups",
        "source": "hotpot_qa"
    },
    {
        "query": "Grigori Aleksandrov and Maheen Zia, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has written more novels, Zora Neale Hurston or Katherine Kurtz?",
        "response": "Katherine Irene Kurtz",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Portishead's third album relaased in the UK in 2008?",
        "response": "Third",
        "source": "hotpot_qa"
    },
    {
        "query": "Which country is home to both S. G. Vasudev and the largest artists' commune? ",
        "response": "India",
        "source": "hotpot_qa"
    },
    {
        "query": "Richard Kim worked on the car that was part of what BMW project?",
        "response": "Project i",
        "source": "hotpot_qa"
    },
    {
        "query": "Q: The event that led to the Spanish taking control of copper production began in what year?  ",
        "response": "1519",
        "source": "hotpot_qa"
    },
    {
        "query": "James Clark McReynolds (February 3, 1862 – August 24, 1946) was an American lawyer and judge who served as United States Attorney General under President Woodrow Wilson and as an Associate Justice of the United States Supreme Court, he served on the Court, during the presidency of which 30th President of the United States (1923–29)?",
        "response": "John Calvin Coolidge Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "In which animated film all characters are beans, Killer Bean Forever or Mai Mai Miracle?",
        "response": "Killer Bean Forever",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters of the magazine of which Stephanie Stahl is the Editor-in-Chief?",
        "response": "San Francisco, California",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2010 Pro Bowl and the Super Bowl XLIV both took place where?",
        "response": "Miami Gardens, Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Buck Barrow is married to what fringe member of Bonnie and Clyde's gang born in 1911",
        "response": "Blanche Barrow",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this episode of \"The Simpsons\" of which the episode \"Days of Future Future\" is a follow-up aired on the Fox network?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Sunny Day Real Estate and Bikini Kill were bands originating from what state?",
        "response": "Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Chris Buck and Mack V. Wright have in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which mountain peak is flanked by Manaslu towards the north, Momhil Sar or Ngadi Chuli?",
        "response": "Ngadi Chuli",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist has been a member of fewer musical groups, Curtis Wright or Paul Di'Anno?",
        "response": "Paul Di'Anno",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the actress that played in \"Descendants\"-(2015 American fantasy TV film) as well as played dual roles as both title characters on Disney Channel's \"Liv & Maddie\" ?",
        "response": "Dove Cameron",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the former chief executive officer of J. C. Penney born who joined after Myron E. \"Mike\" Ullman III?",
        "response": "October 15, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the hotel which  Gideon Putnam built it's city located ",
        "response": "Broadway",
        "source": "hotpot_qa"
    },
    {
        "query": "At which university did the notable psychoanalyst associated with the University of Chicago serve most of his career as a professor of psychiatry?",
        "response": "University of New York Upstate",
        "source": "hotpot_qa"
    },
    {
        "query": "Which restaurant chain's headquarters is further north, Pizza Inn or Papa Gino's?",
        "response": "Papa Gino's",
        "source": "hotpot_qa"
    },
    {
        "query": "What generic medication is a non-selective betablocker used to treat congestive heart failure?  ",
        "response": "Carvedilol",
        "source": "hotpot_qa"
    },
    {
        "query": "Who does the co-writer of Clerks who was born in 1970 do a podcast with?",
        "response": "Jason Mewes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Trappist Abbey of Achel produces and sells what as an \"Authentic Trappist Product\"?",
        "response": "Trappist beer",
        "source": "hotpot_qa"
    },
    {
        "query": "Focus is an American music producer who produced tracks for an American rapper, record producer, and actor, who was born in October of what year?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "What aeronautical engineer, USAF test pilot and chief of the U.S. Air Force's Flight Test Engineering Laboratory starred in \"The Right Stuff\"?",
        "response": "Jack Ridley",
        "source": "hotpot_qa"
    },
    {
        "query": "How long was Gustav Heinemann officially the President of the Federal Republic of Germany?",
        "response": "from 1969 to 1974.",
        "source": "hotpot_qa"
    },
    {
        "query": "What show did Chuck Woolery host 1 year before hosting the game show \"Think like a Cat\"?",
        "response": "\"Lingo\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Scottish football player and Manchester United's manager, and described the title-winners of the 73rd season of the Football League as \"...one of the First Division's most attractive sides...\"?",
        "response": "Matt Busby",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the botanical name of the fruit called nar in Serbian ?",
        "response": "Punica granatum,",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus was described first, Ixiolirion or Allosyncarpia?",
        "response": "Ixiolirion",
        "source": "hotpot_qa"
    },
    {
        "query": "What Italian-American Mafia gangster was a cousin of Willie Moretti?",
        "response": "Frank Costello",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the city in 2010 where Chelsea Pub & Inn is located?",
        "response": "39,558",
        "source": "hotpot_qa"
    },
    {
        "query": "Which convicted car thief was murdered one week before Lewis Moran?",
        "response": "Andrew Veniamin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary film came out first The Last Lions or Prophet's Prey ?",
        "response": "The Last Lions",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is American writer and translator Peter Christopher Sebastian's older brother who is a novelist and poet and wrote \"Darconville's Cat\"?",
        "response": "Alexander Theroux",
        "source": "hotpot_qa"
    },
    {
        "query": "Under what title did the film Lieutenant Kijé based on the novella by Yury Nikolaevich Tynyanov release under in the US?",
        "response": "The Czar Wants to Sleep",
        "source": "hotpot_qa"
    },
    {
        "query": "Who received more Academy Award nominations, Randall Wallace or André Cayatte?",
        "response": "Randall Wallace",
        "source": "hotpot_qa"
    }
]