[
    {
        "query": "In 2014, Parrish participated in the 19th season of a show that premiered on which day ?",
        "response": "September 15, 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English military advisor on the \"Mayflower\" had a fort named after him on Lovell's Island, Massachusetts?",
        "response": "Myles Standish",
        "source": "hotpot_qa"
    },
    {
        "query": "When was Rupert von Trapp father born? ",
        "response": "4 April 1880",
        "source": "hotpot_qa"
    },
    {
        "query": "The Cullasaja River is a short river that flows from Lake Sequoyah which is fed by Mirror Lake and other creeks and streams originating on the western side of the demarcation of two watersheds of what?",
        "response": "the Atlantic Ocean",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed is native to France, the Basset Bleu de Gascogne or the Carolina Dog?",
        "response": "Basset Bleu de Gascogne",
        "source": "hotpot_qa"
    },
    {
        "query": "LaIsha and Gloria are what type of publications?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the current president of the umbrella organization to which all journalists in Ghana belong and to which Gifty Afenyi-Dadzie was the longest serving president?",
        "response": "Mr Affail Monney",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the actress that starred alongside Sady Rebbot in the 1962 film \"Vivre sa vie\" born?",
        "response": "1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Saguaro and Schinus both tree-like plants?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist produced the graphics in Big Numbers graphic novel and Marvel Comics, \"The New Mutants\"?",
        "response": "Bill Sienkiewicz",
        "source": "hotpot_qa"
    },
    {
        "query": "Graveraet River is a tributary of a lake that is shared between which US states ?",
        "response": "Minnesota to the west, and Wisconsin and the Upper Peninsula of Michigan to the south",
        "source": "hotpot_qa"
    },
    {
        "query": "Which creative outlet was enjoyed by both Mary Doria Russell and T. E. Lawrence?",
        "response": "writing",
        "source": "hotpot_qa"
    },
    {
        "query": "What track by an American progressive bluegrass group from Colorado showed the influence of Deliverance?",
        "response": "\"Comin' Round\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Karta GPS pairs open-source map data from OpenStreetMap with curated content from Yelp and which other local search-and-discovery service app?",
        "response": "Foursquare",
        "source": "hotpot_qa"
    },
    {
        "query": "What does \"Angel\" and \"Fifth Harmony\" have in common?",
        "response": "album",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the husband of Nina Petrovna Khrushcheva die?",
        "response": "11 September 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Daviesia and Rehmannia native to the same countries?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town the boy from Boneland lives in ?",
        "response": "4,638",
        "source": "hotpot_qa"
    },
    {
        "query": "We all die young is a song performed by  a lead character  in the movie Rock star. Who is the actor born june 5 1971 who played Chris Izzy Cole ?",
        "response": "Mark Wahlberg",
        "source": "hotpot_qa"
    },
    {
        "query": "What British Singer Songwriter wrote a song called Save Me Save Me?",
        "response": "Andy Gibb",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the Milwaukee School of Engineering and Wichita State University located in the same state?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The  2008 Football League Championship play-off Final was won by Hull City through a 38th-minute goal by a player born in what year?",
        "response": "1969",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the President who owned both James Heming and Sarah \"Sally\" Hemings?",
        "response": "President Thomas Jefferson",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the singer of Ever Ever After born?",
        "response": "1983",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the architect who designed the building whose grounds Hancock Manor would now stand on?",
        "response": "Charles Bulfinch",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the ninth Typhoon that effected Japan in the Month of August during the unusually late Pacific typhoon season of 2016?",
        "response": "Typhoon Mindulle",
        "source": "hotpot_qa"
    },
    {
        "query": "Lee Gi-kwang and Lukas Rossi were both what?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Chesapeake and Ohio Canal and Lake Worth Lagoon both located in Florida?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Naj and Verve are both women's magazines, which one is from India?",
        "response": "Verve",
        "source": "hotpot_qa"
    },
    {
        "query": "What German composer wrote Happy End? ",
        "response": "Kurt Weill",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had a higher world ranking, Robert Seguso or Venus Williams?",
        "response": "Robert Arthur Seguso",
        "source": "hotpot_qa"
    },
    {
        "query": "What company did a man who hired Sioux Falls architect Wallace L. Dow to build a home in Worthing, Minnesota found?",
        "response": "Dayton's department store",
        "source": "hotpot_qa"
    },
    {
        "query": "Where were the last Summer Olympics Games held that included athletes from Singapore?",
        "response": "Rio de Janeiro, Brazil",
        "source": "hotpot_qa"
    },
    {
        "query": "What is a store chain headquartered in Matthews, North Carolina which has been analyzed by Kurt Jetta?",
        "response": "Family Dollar",
        "source": "hotpot_qa"
    },
    {
        "query": "Daniel Mann and Maurice Pialat, have which mutual occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the bombing event that was marked in a special program of The Late Late Tribute Shows six months later occur?",
        "response": "15 August 1998",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1953 Taça de Portugal Final was won by a team from which Portuguese city ?",
        "response": "Lisbon",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the ranking, on 2016 Fortune 500 list,  of the insurance company which has Seymour G. Sternberg as its chairman ? ",
        "response": "#61",
        "source": "hotpot_qa"
    },
    {
        "query": "Which capitol city is also the second largest city in the United States by area?",
        "response": "Juneau",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Herbert Ross and Denis Villeneuve from different countries?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What other occupation is shared by English writer and visual artist Clive Barker and English comedian, actor and author Will Hay?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Canadian independent alternative rock, ska, and reggae rock band from Burlington, Ontario toured with Parachute after the release of Overnight?",
        "response": "Walk off the Earth",
        "source": "hotpot_qa"
    },
    {
        "query": "Which U.S. Army specialist convicted in the Abu Ghraib scandal was born in 1968?",
        "response": "Manadel al-Jamadi",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Xiasi Dog and Old Croatian Sighthound from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Iowa State University wrestling coach beat Elmadi Zhabrailov at the Olympics?",
        "response": "Kevin Jackson",
        "source": "hotpot_qa"
    },
    {
        "query": "What hotel did the influential National Crime Syndicate member found with David Berman?",
        "response": "Flamingo Hotel",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did this The Butterfly Effect star begin her career as a fashion model?",
        "response": "Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "HispanicTV is a Latin American cable television channel that broadcasts Hispanic music videos, its format includes Merengue, a type of music and dance originating in which country, which has become a very popular genre throughout Latin America, and also in several major cities in the United States which have Hispanic communities?",
        "response": "Dominican Republic",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did the canal along the northern border of Appleton open?",
        "response": "1761",
        "source": "hotpot_qa"
    },
    {
        "query": "The Simpsons episode \"Moaning Lisa\" and \"The Simpsons Sing the Blues\" were both released what year?",
        "response": "1990",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of music do Suede and I Mother Earth play?",
        "response": "alternative rock",
        "source": "hotpot_qa"
    },
    {
        "query": "In what northern country was the Battle of Champions fought between Ackergill Tower and Girnigoe Castle?",
        "response": "Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "What Russian novel is regarded a central work of world literature and revolves around the story of a man banished to Siberia? ",
        "response": "War and Peace",
        "source": "hotpot_qa"
    },
    {
        "query": "The case of Loving v. Virginia in 1967 was a landmark civil rights decision of the US Supreme Court which invalidated what prohibition that was historically taboo in the United States and outlawed in South Africa?",
        "response": "Interracial marriage",
        "source": "hotpot_qa"
    },
    {
        "query": "As of 2010, what was the population where the Village of Westbury is located?",
        "response": "226,322",
        "source": "hotpot_qa"
    },
    {
        "query": "Yuri Linnik and Mark Naimark, are Soviet's from which occupation?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "How many breweries are in the country where The Musée schaerbeekois de la bière is located?",
        "response": "180",
        "source": "hotpot_qa"
    },
    {
        "query": "John Hansen was a Danish footballer who played which position nearest to the opposing team's goal, and are therefore most responsible for scoring goals?",
        "response": "forward",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress from the movie Teen Patti is the ambassador of the Indian cosmetics brand Lakmé? ",
        "response": "Shraddha Kapoor",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 1990 American science fiction psychological horror film directed by Joel Schumacher and including actors such as Benjamin Mouton?",
        "response": "Flatliners",
        "source": "hotpot_qa"
    },
    {
        "query": "How many German scientists, engineers, and technicians, were recruited in post-Nazi Germany as a result of the clandestine operation where Arthur Rudolph became one of the main developers of the U.S. ?space program",
        "response": "more than 1,600",
        "source": "hotpot_qa"
    },
    {
        "query": "Prey is a television series that starred an American actor best known as Benny in L.A. Law and the voice of Pops in what show?",
        "response": "Johnny Bravo",
        "source": "hotpot_qa"
    },
    {
        "query": "In Old Trafford, Manchester, the Ball of the Century included a cricketer by what name who is also known as a professional poker player?",
        "response": "Shane Warne",
        "source": "hotpot_qa"
    },
    {
        "query": "What plane developed for the United States Air Force crashed in 2010 at Elmendorf Air Force Base in Alaska?",
        "response": "Boeing C-17 Globemaster III",
        "source": "hotpot_qa"
    },
    {
        "query": "What model and charity fundraiser also released a single that stayed on the UK Singles Chart for 10 weeks?",
        "response": "Adam Peter Rickitt",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016 UCF Knights football team represented the University of Central Florida in the 2016 NCAA Division I FBS football season, they were led by first-year head coach, and former player, Scott Andrew Frost, he was previously the offensive coordinator at which organization?",
        "response": "University of Oregon",
        "source": "hotpot_qa"
    },
    {
        "query": "U. S. Grant Sharp Jr. is related to a general and president who fought in what war?",
        "response": "Civil War",
        "source": "hotpot_qa"
    },
    {
        "query": "How many students did the school, from which Corey Snide would graduate, have in 2005 ?",
        "response": "2225",
        "source": "hotpot_qa"
    },
    {
        "query": "What year did Rene Russo star in the American thriller film Nightcrawler?",
        "response": "2014",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 242-acre waterfront casino resort in Louisiana will be the home of a fourth Vic & Anthony's steakhouse in late 2014?",
        "response": "Golden Nugget Lake Charles",
        "source": "hotpot_qa"
    },
    {
        "query": "Baccio Baldini, was an Italian goldsmith and engraver of the Renaissance, active in his native Florence, the capital city of which Italian region?",
        "response": "Tuscany",
        "source": "hotpot_qa"
    },
    {
        "query": "Once Upon a Time in Shanghai is a 2014 Hong Kong-Chinese martial arts film directed by Wong Ching-po, and stars include Philip Ng, a Hong Kong-born American actor, martial artist and action choreographer, currently based in which location?",
        "response": "Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both movies Nerdcore Rising and What Would Jesus Buy? focused on similar topics?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the ferry service for which Corporation Pier station served as a ticket office and waiting room stop operating?",
        "response": "1981",
        "source": "hotpot_qa"
    },
    {
        "query": "What landfill located in the town of Johnston in Providence County, Rhode Island, United States is owned by Rhode Island Resource Recovery Corporation?",
        "response": "Central Landfill",
        "source": "hotpot_qa"
    },
    {
        "query": "Luigi Gervasi was nominated for an Academy Award in the category Best Art Direction for a film that came out in which year ?",
        "response": "1967",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012 South Korean comedy-drama film \"Papa\" stars which South Korean actress and model who also appeared in \"Reply 1994\" (2013) ?",
        "response": "Go Ara",
        "source": "hotpot_qa"
    },
    {
        "query": "In which album was American rapper Kendrick Lamar's first number-one single on the US \"Billboard\" Hot 100 included?",
        "response": "\"1989\" (2014)",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the sport in which the purpose is to accumulate the highest score for a \"game\", consists of eight or ten ends, and whose Swedish team consisted of Major Delaval Graham L'Eastrange Astley?",
        "response": "Curling",
        "source": "hotpot_qa"
    },
    {
        "query": "What was name of  the children's animated series that aired from 1992 to 1995 that Stacey Jefferson voiced two characters?",
        "response": "The Animals of Farthing Wood",
        "source": "hotpot_qa"
    },
    {
        "query": "What appeared first, Gunnin' for That No. 1 Spot or Baghdad ER?",
        "response": "Baghdad ER",
        "source": "hotpot_qa"
    },
    {
        "query": "Hibiscus waimeae, is a species of flowering plant in the okra family, Malvaceae, that is endemic to the island of Kauaʻ i in Hawaii, H. arnottianus\" of Oʻ ahu and Molokaʻ i and \"H. waimeae\", have white flowers, and are the only of how many species of hibiscus, regarded as native to Hawaii?",
        "response": "seven",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did \"the king of cool\" play in with Bud Ekins as his stunt double?",
        "response": "\"The Great Escape\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What school district is the high school Christie Ambrosi attended part of?",
        "response": "Blue Valley Unified School District",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Bob Stoops coached team beat the 2016 Auburn Tigers football team?",
        "response": "2016 Oklahoma Sooners football team",
        "source": "hotpot_qa"
    },
    {
        "query": "The UK single \"Anyone Can Fall in Love\" was written by an actress who gained early exposure on what TV sitcom?",
        "response": "Up the Elephant and Round the Castle",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1999 movie is the person who palys a young lady in My First Wedding known for?",
        "response": "She's All That",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Roman emperor was regarded as the third of the Five Good Emperors but is know for killing Saint Thamel?",
        "response": "Hadrian",
        "source": "hotpot_qa"
    },
    {
        "query": "The first university that football caoch Josepth Dalry \"Swede\" Alexander coached at would later become accreddited by the American Bar Association. What is the name of this university?",
        "response": "Lincoln Memorial University",
        "source": "hotpot_qa"
    },
    {
        "query": "Fernando Francisco González Ciuffardi played his only major final in 2007 losing to a Swiss professional tennis player who has won 19 what?",
        "response": "Grand Slam singles titles",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2017 movie did Darren Aronofsky and Matthew Libatique work together to film?",
        "response": "Mother!",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Simon Turner\" is the debut album of the singer and later film soundtrack composer Simon Fisher Turner, at the time Turner was being widely promoted in the UK pop press as a homegrown alternative to David Cassidy, he is known for his role as who?",
        "response": "Keith Partridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Which King of Norway, born in 1903 officially opened Frigg Gas Field?",
        "response": "Olav V of Norway",
        "source": "hotpot_qa"
    },
    {
        "query": "Claughton is a residential district in Birkenhead that includes part of Birkenhead Park, which was designed by who?",
        "response": "Joseph Paxton",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the population of the town as of 2000 where the historic tugboat Catawissa is located?",
        "response": "8,515",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Clive Cussler or Anita Diamant ?",
        "response": "Anita Diamant",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed 73 films between 1927--53, Ray Enright or Harun Farocki?",
        "response": "Ray Enright",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the 120 ft high waterfall in the land of the federally recognized native American tribe \"Tsalagiyi Detsadanilvgi\"?",
        "response": "Mingo Falls",
        "source": "hotpot_qa"
    },
    {
        "query": " Cat Run 2 is a 2014 direct-to-video American comedy action film starring an American professional what?",
        "response": "poker player",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Tennis and PC Gamer the same kind of publication?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What video collection by Ian Levine was filmed on Central Drive in the seaside town of Blackpool, Lancashire in Northern England and featured American Rhythm and Blues singer Rose Batiste?",
        "response": "The Strange World of Northern Soul",
        "source": "hotpot_qa"
    },
    {
        "query": "Konni was a female black Labrador Retriever belonging to a Russian president born in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is a Bulgarian operatic soprano that had their career launched by The World Opera Competition? ",
        "response": "Sonya Yoncheva",
        "source": "hotpot_qa"
    },
    {
        "query": "What do FPT University in Vietnam and University of Delaware have in common?",
        "response": "privately governed",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Hippeastrum and Desmodium both genus of plants ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The trainer for the #7 UFC bantamweight is also a police officer for which department?",
        "response": "Albuquerque Police Department Gang Unit",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Austrian architect known for designing the historic building complex in Austria known as The Belvedere?",
        "response": "Johann Lukas von Hildebrandt",
        "source": "hotpot_qa"
    },
    {
        "query": "What film starring Vladimir Korenov features cameras by Eduard Rozovsky?",
        "response": "Amphibian Man",
        "source": "hotpot_qa"
    },
    {
        "query": "Which boxer, who is ranked by BoxRec as the best British light-welterweight of all time, knocked out boxer Michael Stewart?",
        "response": "Ricky Hatton",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American actor who appeared in The Bushido Blade born  ",
        "response": "January 17, 1931",
        "source": "hotpot_qa"
    },
    {
        "query": "Dorothy Quincy's husband helped lead the rush for independence against the British monarchy in which exceptionally famous war?",
        "response": "American Revolution",
        "source": "hotpot_qa"
    },
    {
        "query": "Aiko, Princess Toshi is the only child of Crown Prince Naruhito and what princess who was born on December 9, 1963, and is a member of the Imperial house of Japan through marriage?",
        "response": "Masako, Crown Princess of Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is known for having worked as chief designer at Givenchy from 1996 to 2001 and for founding his own Alexander McQueen label, who's work was worn by Icelandic musician Björk? ",
        "response": "Lee Alexander McQueen",
        "source": "hotpot_qa"
    },
    {
        "query": "Praise 102.7 directs it's signal mainly toward the north and east to avoid interfering with W4 Country's transmitter located at it's studios off of what road?",
        "response": "South Wagner Road",
        "source": "hotpot_qa"
    },
    {
        "query": "Did the Beaulieu Mine or the McIntyre Mines yield gold and copper?",
        "response": "The McIntyre also yielded a considerable amount of copper",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Orangina and Mountain Dew both carbonated?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film is compared to Koyaanisqatsi, Baraka or Burma VJ?",
        "response": "Baraka",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Mary Collins and Joseph Losey have different professions?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has also been a producer and an actor, Hou Hsiao-hsien or Ivan Passer?",
        "response": "Hou Hsiao-hsien",
        "source": "hotpot_qa"
    },
    {
        "query": " Cliburn railway station was a station situated on This railway that  ran between Clifton Junction near Penrith and Kirkby Stephen via what?",
        "response": "Appleby-in-Westmorland",
        "source": "hotpot_qa"
    },
    {
        "query": "St. Zacharie Border Crossing has a road that was built by which company?",
        "response": "Great Northern Paper Company",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Born Rich and Death Faces both mockumentaries?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What country was the merger Irish Distillers formed?",
        "response": "Ireland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American country singer  recorded \"15 Minutes of Shame\"",
        "response": "Kristy Lee Cook",
        "source": "hotpot_qa"
    },
    {
        "query": "Which goalie played for Manchester CIty against Birmingham City in 1955-1956 FA Cup with a broken neck?",
        "response": "goalkeeper Bert Trautmann playing the last 25 minutes",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach of the 2007-08 Feyenoord season was born in what year?",
        "response": "1952",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Irish actor stars in Untogether, an upcoming American drama film?",
        "response": "Jamie Dornan",
        "source": "hotpot_qa"
    },
    {
        "query": "The starring actress of the film \"Clandestine Childhood\", was included in what list by \"Esquire\" magazine?",
        "response": "The Sexiest Woman Alive Atlas",
        "source": "hotpot_qa"
    },
    {
        "query": "What character did this actor, who also played a supporting role in Sleepy Hollow, play in the final six Harry Potter films?",
        "response": "Professor Albus Dumbledore",
        "source": "hotpot_qa"
    },
    {
        "query": "Which lyricist and composer created the music for the 2013 Bengali film Holud Pakhir Dana?",
        "response": "Surojit Chatterjee",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2001 who on the Oakland Raiders forced a fumble against 5 time Super Bowl champ Tom Brady?",
        "response": "Charles Woodson",
        "source": "hotpot_qa"
    },
    {
        "query": "Flash Gordon was co-written by the scriptwriter who had worked on a remake of the 1976 monster film directed by whom?",
        "response": "John Guillermin",
        "source": "hotpot_qa"
    },
    {
        "query": "At what nightclub did Romeo Gigli meet the founder and chair of the Bianca Jagger Human Rights Foundation?",
        "response": "Studio 54",
        "source": "hotpot_qa"
    },
    {
        "query": "What is is a United States federal statute enacted by the 111th United States Congress and signed into law by President Barack Obama, who at the time the Deputy White House Chief of Staff for Implementation for U.S. President Barack Obama made this one of her major projects?",
        "response": "The Patient Protection and Affordable Care Act",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the name of the Munsee sachem who led the most populous and widespread North American native language groups?",
        "response": "Katonah",
        "source": "hotpot_qa"
    },
    {
        "query": "Serial Mom is a 1994 American crime film written and directed by John Waters, which American comedian, actress, writer, producer, and television host, made a cameo appearance in the film?",
        "response": "Joan Rivers",
        "source": "hotpot_qa"
    },
    {
        "query": "Basil Hume was a monk and priest who was awarded which gift from the British Sovereign?",
        "response": "Order of Merit",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport is closer to Mexico, Lake Charles Regional Airport or George Bush Intercontinental Airport?",
        "response": "George Bush Intercontinental Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American character actor who starred on the television series \"Stargate SG-1\" (1997–2007) and appeared in \"Episode 8\" of \"Twin Peaks\" as a guest star?",
        "response": "Don S. Davis",
        "source": "hotpot_qa"
    },
    {
        "query": "Which person, William Blake Herron or John Carpenter, held more diverse roles in the movie industry?",
        "response": "musician, editor and composer.",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Kirkpatrick was a founding member of which famous American boy band?",
        "response": "NSYNC",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Luchino Visconti and the Brothers Quay of the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Anthony Kimmins and Cesar Montano in the same industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In which political party is the senator of the district of the New York Senate that contains a village which had a population of 3,103 at the time of the 2010 Census?",
        "response": "He is a Republican.",
        "source": "hotpot_qa"
    },
    {
        "query": "Love in a Wood is a 1915 British silent comedy film directed by Maurice Elvey, the film is a contemporary-set version of the play \"As You Like It\", a pastoral comedy by who?",
        "response": "William Shakespeare",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the primary position that Giovanni Drenthe's older brother player?",
        "response": "left winger",
        "source": "hotpot_qa"
    },
    {
        "query": "Gemma Christina Arterton, is an English actress, she plays the lead role in which 2016 British war comedy-drama film directed by Lone Scherfig and written by Gaby Chiappe, based on the 2009 novel \"Their Finest Hour and a Half\" by Lissa Evans?",
        "response": "Their Finest",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Chinese city is a county-level city Zigong or Lanxi, Zhejiang?",
        "response": "Lanchi",
        "source": "hotpot_qa"
    },
    {
        "query": "Benjamin Mouton plays Mr. Manus in a 1990 film shot on what campus?",
        "response": "Loyola University",
        "source": "hotpot_qa"
    },
    {
        "query": "Which terrorist deliberately crashed the plane into the World Trade Center, the photo of which was taken by the freelance photographer Thomas Dallal and named Impending Death?",
        "response": "Mohamed Atta",
        "source": "hotpot_qa"
    },
    {
        "query": "Lay It Down is the sixth studio album, by which Canadian alternative country band?",
        "response": "Cowboy Junkies",
        "source": "hotpot_qa"
    },
    {
        "query": "Nenad Bach performed with this American actor, director, and producer that has appeared in more than 70 films and was born in what year?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "YouPorn was surpassed, in 2013, by competitor sites xHamster, Pornhub, LiveJasmin, and this website that is registered to the Polish company WGCZ Holding? ",
        "response": "XVideos",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Xanthoceras or Ehretia?",
        "response": "Ehretia",
        "source": "hotpot_qa"
    },
    {
        "query": "Barnstable County Hospital was the location of the autopsy of the son of President John F. Kennedy and Jacqueline Kennedy, and the younger brother of who?",
        "response": "Caroline Kennedy",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the composer who wrote Mes amis, écoutez l'histoire from the opera Le postillon de Lonjumeau?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the parent company of the electric supply to Yuoga?",
        "response": "Volta River Authority",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of accent does David Tennant use in \"DuckTales\"?",
        "response": "Scottish accent",
        "source": "hotpot_qa"
    },
    {
        "query": "Capitol Technology University and Walla Walla University, are located in the United States?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is younger, Theo van Gogh or Raj Kapoor?",
        "response": "Theodoor \"Theo\" van Gogh",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Cloudy with a Chance of Meatballs and Lascars animated films?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What medival stone bridge is a short distance from the Palazzo Pitti?",
        "response": "Ponte Vecchio",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1998 sports comedy that stars the Book of Mormon co-writer and co-director?",
        "response": "David Zucker",
        "source": "hotpot_qa"
    },
    {
        "query": "Considering the Porsche 928 and Porsche Cayenne.  Which of the two vehicles was exclusively manufactured before the 21st century?",
        "response": "since 1995, when the Porsche 928 was discontinued.",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Rubert Holmes write Escape?",
        "response": "hit singles",
        "source": "hotpot_qa"
    },
    {
        "query": "What football player left the Superliga side OB when he won Goalkeeper of the Year award in Denmark and Norway in 2010?",
        "response": "Anders Lindegaard",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the Harrah's Cherokee operator, Caesars Entertianment Corporation, based?",
        "response": "Paradise, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "Let My Babies Go! A Passover Story was a novelization of the Rugrats episode aired on what date?",
        "response": "April 13, 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Stephen Hawking: Master of the Universe is a documentary television series produced by the television broadcaster Channel 4, the series includes interviews with which American theoretical physicist working in particle physics and cosmology, and is a Professor of Science on the physics faculty of Harvard University?",
        "response": "Lisa Randall",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Pacify Her\" is a song by a singer that was raised in which city ?",
        "response": "Baldwin, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What notorious feature was on Puff Daddy's debut single album?",
        "response": "The Notorious B.I.G and Mase",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who played Sherlock Holmes in the television film Sherlock Holmes and the Case of the Silk Stocking received his first Golden Globe Award nomination for his role in what movie?",
        "response": "My Best Friend's Wedding",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of category does Echium and Oxydendrum have in common?",
        "response": "genus",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2014 Oklahoma Sooners football team represented the University of Oklahoma in the 2014 NCAA Division I FBS football season, the team was led by two-time Walter Camp Coach of the Year Award winner, Bob Stoops, a former American college football coach, and is the former head football coach at which university?",
        "response": "University of Oklahoma",
        "source": "hotpot_qa"
    },
    {
        "query": "What team do Andre Russell and Carlos Brathwaite both play for?",
        "response": "West Indies",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the attracted which will be replaced by DreamWorks Theatre  is a 4D film at various theme parks around the world?",
        "response": "Shrek 4-D",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the coach of the 1986 Super Bowl champions born?",
        "response": "1941",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the destination country that can be reached by a bridge that half-operated by Transdev and originates in Sweden?",
        "response": "Denmark",
        "source": "hotpot_qa"
    },
    {
        "query": "What agency of the United States was the Bureau that Josephine Sophia White Griffing did much of her work through?",
        "response": "Department of War",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birth date of this leading member of the Nazi party of Germany, who imposed a measure for every memeber of the SS to carry the Sippenbuch?",
        "response": "7 October 1900",
        "source": "hotpot_qa"
    },
    {
        "query": "U.S. Route 27 (US 27) in Kentucky runs how many miles from the Tennessee border to the Ohio border at Cincinnati, Ohio, it crosses into the state in the Lake Cumberland area, Lake Cumberland, is a reservoir in Clinton, Laurel, McCreary, Pulaski, Russell, and Wayne counties in Kentucky?",
        "response": "190.785",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does spanish footballer Pere Milla Peña's team play it's home games?",
        "response": "Nuevo Estadio Los Pajaritos",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the actor who voiced the robot barber in short film Modern Inventions ?",
        "response": "Avon",
        "source": "hotpot_qa"
    },
    {
        "query": "Disneytown is a shopping, dining, and entertainment complex at Shanghai Disney, that is the equivalent of Ikspiari at what theme park resort located in Urayasu, Chiba, Japan?",
        "response": "Tokyo Disney Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Family Health founded in the same country that the phrase Horn OK Please is commonly found in?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film which inspired the EP Los Angeles by Graf Orlock ?",
        "response": "Michael Mann",
        "source": "hotpot_qa"
    },
    {
        "query": "Which biennial multi-sport event held among the athletes from South Asia has Syed Maratab Ali Shah gold medaled in twice?",
        "response": "The South Asian Games",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the club formed that contested the 1984 WAFL Grand Final against East Fremantle ?",
        "response": "1932",
        "source": "hotpot_qa"
    },
    {
        "query": "In the 2016 NHL Entry Draft, the second overall pick was selected by which team?",
        "response": "Winnipeg Jets",
        "source": "hotpot_qa"
    },
    {
        "query": "Who co-wrote the song \"Picture to Burn\"  by American singer-songwriter Taylor Swift?",
        "response": "Liz Rose",
        "source": "hotpot_qa"
    },
    {
        "query": "Which social and political activist's daughter wrote \"The Lost Daughter: A Memoir\"?",
        "response": "Tom Hayden",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor who plays Little John on the show \" Big John, Little John\" is known for playing which character in \"The Brady Bunch\" ?",
        "response": "Cousin Oliver",
        "source": "hotpot_qa"
    },
    {
        "query": "What did Keegan-Michael Key star in first, \"Key & Peele\" or Let's Be Cops?",
        "response": "\"Key & Peele\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a case regarding the protections offered by the Speech or Debate Clause of the United States Constitution, Rasul v. Bush or Gravel v. United States?",
        "response": "Gravel v. United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What member of the Celtic nation began publish poetry in the late 1960's in the New Irish Writing Page of The Irish Press?",
        "response": "Gerard Smyth",
        "source": "hotpot_qa"
    },
    {
        "query": "Ugo Falena wrote the libretto for the opera \"L'ultimo Lord which is by an Italian composer and pianist who is known for having completed Puccini's opera Turandot in what year?",
        "response": "1926",
        "source": "hotpot_qa"
    },
    {
        "query": "Ram Kumar Sharma won the election in which how many people were eligible to vote?",
        "response": "814.5 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the American screenwriter for 2008 American comedy film directed by Tom Vaughan and starring Cameron Diaz and Ashton Kutcher?",
        "response": "Dana Fox",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer whose stage name references a New York City subway station debuted her first album at number two on the Billboard 200 chart?",
        "response": "Halsey",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Michael Haneke film did Margaret Ménégoz work on that focused on retired music teachers?",
        "response": "Amour",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the University of Nevada, Reno and the University of Moratuwa in the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "La traviata, is an opera in three acts by Giuseppe Verdi set to an Italian libretto by Francesco Maria Piave, it was first performed on which date at Teatro La Fenice, an opera house in Venice, Italy?",
        "response": "6 March 1853",
        "source": "hotpot_qa"
    },
    {
        "query": "What school is located in the southernmost atoll of the archipelago of the Maldives?",
        "response": "Maradhoo Feydhoo School",
        "source": "hotpot_qa"
    },
    {
        "query": "Who are the members of the duo that released the album \"Way Back Home: Live from New York City\"?",
        "response": "Michelle Branch and Jessica Harp",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Dave Meniketti and Leo both had blues-oriented solo efforts?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Bagalwad is a village in an Indian state formed the passage of the States Reorganisation Act on what date?",
        "response": "1 November 1956",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following, Boris Pasternak or John Williams, was a Soviet Russian poet, novelist, and literary translator?",
        "response": "Boris Leonidovich Pasternak",
        "source": "hotpot_qa"
    },
    {
        "query": "Ira Gruber is known as a military historian for a colonial revolt that took place between what years?",
        "response": "1765 and 1783",
        "source": "hotpot_qa"
    },
    {
        "query": "What film used a song sung by Debbie Harry as its theme?",
        "response": "American Gigolo",
        "source": "hotpot_qa"
    },
    {
        "query": "Patrick Tam and Padmarajan, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Matt and Kim and Jem Welsh musicians?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Did Yasuzo Masumura and Pitof hail from the same country and professional career?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Always True to You in My Fashion was written for what musical written by Samuel and Bella Spewack?",
        "response": "Kiss Me, Kate",
        "source": "hotpot_qa"
    },
    {
        "query": "How Far I'll Go is from the soundtrack that was released on what date?",
        "response": "November 19, 2016",
        "source": "hotpot_qa"
    },
    {
        "query": "In addition to writing, what was the author of the text to Lord of All Being, Throned Afar formally trained in?",
        "response": "law",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city, Yixing or Shangqiu, has a larger population?",
        "response": "Yixing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which suburb of the Twin Cities is part of District 50B in Minnesota?",
        "response": "New Brighton",
        "source": "hotpot_qa"
    },
    {
        "query": "Ben Grosse produced an album for what band formed in 2004 in Orlando, Florida?",
        "response": "Alter Bridge",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeux d’eau is a piece for solo piano by a composer born in what year?",
        "response": "1875",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1992 Pacific hurricane season had a most notable storm of the system that formed on what date?",
        "response": "September 5",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathryn Merteuil's rold as Kathryn serves as the primary antagonist in a film released in what year?",
        "response": "1999",
        "source": "hotpot_qa"
    },
    {
        "query": "Among Bursera and Berkheya, which can be found in South Africa?",
        "response": "Berkheya",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarter of the American multinational chemical corporation who's part is Dow AgroSciences?",
        "response": "Midland, Michigan, United States",
        "source": "hotpot_qa"
    },
    {
        "query": "What documentary was released earlier, I.O.U.S.A. or Super Size Me?",
        "response": "Super Size Me",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of forum did a former Soviet statesman initiate?",
        "response": "Organizations could come together to address global issues",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the editorial stance of the newspaper that featured Paul Rimstead as a page 5 columnist?",
        "response": "populist conservative",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was Felicity de Jager Cunningham's husband inducted into the College Football Hall of Fame?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the author of who is best known for his children's book series that was first published in 1963 and helped establish Scholastic as a premier publishing company?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brother of Jordan Subban was born on May 13, 1989?",
        "response": "P. K. Subban",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of transportation is involved in the paragraphs above?",
        "response": "Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Navy facility was next to NAS Quonset Point and is now listedd on the National Register of Historic Places?",
        "response": "Camp Endicott",
        "source": "hotpot_qa"
    },
    {
        "query": "Credits of Elizabeth Moore include \"Star Wars\" and \"A Clockwork Orange\", a 1971 dystopian crime film based on what author's 1962 novel of the same name?",
        "response": "Anthony Burgess",
        "source": "hotpot_qa"
    },
    {
        "query": "When the View-Master was the official film of Disneyland in the 1970s, an actor whose career spanned how many decades was its spokesman?",
        "response": "five",
        "source": "hotpot_qa"
    },
    {
        "query": "Who released an album on August 15, 2017 and is from Ronkonkoma, New York?",
        "response": "Lil Peep",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the actors starred in The Next Karate Kid died on November 24, 2005?",
        "response": "Pat Morita",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does the first movie that Garry Elmendorf worked on take place in?",
        "response": "Clairton, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the elder son of Sylvester Stallone that also helped co find Grindhouse Releasing?",
        "response": "Sage Stallone",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Carl Sandburg or Lawrence Durrell?",
        "response": "Lawrence George Durrell",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Beth Gibbons and Ian Curtis the same nationality?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which professional American basketball player left the University of Kentucky after one season and was drafted 5th, after teammate John Wall but before teammate Patrick Patterson?",
        "response": "DeMarcus Cousins",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie is part of the Indian Bengali language franchise and is produced by SVF Entertainment?",
        "response": "Amazon Obhijaan",
        "source": "hotpot_qa"
    },
    {
        "query": "What place has both hosted Rocky Mountain Conservatory Theatre and part of an international network?",
        "response": "Mizner Park",
        "source": "hotpot_qa"
    },
    {
        "query": "who publish the  monthly magazine  which John Curran was its editor ",
        "response": "Bloomberg L.P.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which female photo journalist and war reporter appeared in a 2010 episode of the TV comedy 30 Rock?",
        "response": "Ann Curry",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Edward F. Cline and Syed Ali Raza Usama both directors? ",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The tv series \"Our Zoo\" is about the creation of a zoo opened in what year?",
        "response": "1931",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the relation between Cethlenn (Old Irish) and the king of named Fomorians who is a interpreted as a god?",
        "response": "wife",
        "source": "hotpot_qa"
    },
    {
        "query": "What is another name for the Okahoma Memorial Stadium?",
        "response": "Gaylord Family - Oklahoma Memorial Stadium, also known as Owen Field or The Palace on the Prairie",
        "source": "hotpot_qa"
    },
    {
        "query": "Play with Me Sesame, is a children's television series, spin off from Sesame Street, the series was produced by Sesame Workshop, and which American animation studio?",
        "response": "Nick Digital",
        "source": "hotpot_qa"
    },
    {
        "query": "Actor Peter Lockyer recently returned to his native Connecticut to play in a five-character memory play by what famous American playwright?",
        "response": "Tennessee Williams",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose death during the 1973 Dutch Grand Prix at Zandvoort Circuit in the Netherlands is the subject of a book by David Tremayne?",
        "response": "Roger Williamson",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Corona and Pepsi Max both made by PepsiCo?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more scope of profession, Edward Dmytryk or Otto Preminger?",
        "response": "Otto Ludwig Preminger",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the sweet liquid similar to what is contained in Huckabuck is a brand of flavored drink mix owned by Kraft Foods?",
        "response": "Kool-Aid",
        "source": "hotpot_qa"
    },
    {
        "query": "Value Alliance is an airline alliance formed in May 2016, it comprises seven Asia-Pacific airlines, including which Australian low-cost airline, that commenced services in the Australian domestic airline market on which date?",
        "response": "23 November 2007",
        "source": "hotpot_qa"
    },
    {
        "query": " The Julington-Durbin Preserve is in the county that has a 2010 population of what?",
        "response": "864,263",
        "source": "hotpot_qa"
    },
    {
        "query": "The Type 93 and Type 100 Flamethrowers were flamethrowers used during which War?",
        "response": "Second Sino-Japanese War",
        "source": "hotpot_qa"
    },
    {
        "query": "The Butte is a census-designated place (CDP) in Matanuska-Susitna Borough, Alaska, it is part of the Anchorage, Alaska Metropolitan Statistical Area, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "The county where Benjamin Van Keuren House Ruin is located named after what?",
        "response": "the Irish province of Ulster",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the music for the theme song for a dark ride at Disneyland, the Magic Kingdom, Tokyo Disneyland, and Disneyland Park in Paris?",
        "response": "George Bruns",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the release date of this 2005 American science fiction-thriller film that featured Mitzi Martin?",
        "response": "July 22, 2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Alfrederick \"Al\" Joyner, is an American former athlete and now coach,he was also the husband of Olympic gold medalist, and record holder Florence Griffith Joyner, also known as Flo-Jo, was an American track and field athlete, she's considered the fastest woman of all time, based on the fact that the world records she set, in what year?",
        "response": "1988",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the campaign of political  repression that Mikhail Demichev was arrested during occur?",
        "response": "from 1936 to 1938",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1994 Monaco Grand Prix was a Formula One motor race held on 15 May 1994, at the Circuit de Monaco, Monte Carlo, it was the fourth race of the 1994 Formula One season, and the first, following the deaths of Ayrton Senna and Roland Ratzenberger, an Austrian racing driver who raced in sports prototype, at which location, two weeks previously?",
        "response": "San Marino Grand Prix",
        "source": "hotpot_qa"
    },
    {
        "query": "Hell on Earth is a series by the author of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the seating capacity of the football stadium located in Bill Kinsley birthplace?",
        "response": "54,074",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more notable job titles mentioned, Jean-Philippe Rameau or Giovanni Battista Pergolesi?",
        "response": "Jean-Philippe Rameau",
        "source": "hotpot_qa"
    },
    {
        "query": "For which team does the professional footballer Alexander Hleb, whose country gained independence in 1991 and whose most popular sport is football closely followed by ice hockey, currently play?",
        "response": "BATE Borisov",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did a mid-sized auditorium, owned and operated by Caesars Entertainment Corporation first host Justin Timberlake's annual concert to benefit the Shriners Hospitals for Children?",
        "response": "2007",
        "source": "hotpot_qa"
    },
    {
        "query": "Nature's Symphony in 432 is an album by a group that performs in what genre?",
        "response": "country and bluegrass gospel",
        "source": "hotpot_qa"
    },
    {
        "query": "How long did the founder of Stratton Oakmont spend in prison ?",
        "response": "22 months",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthday of the actor who starred in movies like Flyboys, Milk, Pineapple Express and Rise of the Planet of the Apes?",
        "response": "April 19, 1978",
        "source": "hotpot_qa"
    },
    {
        "query": "Who worked on the origins of Mickey Mouse and created Oswald the Lucky Rabbit?",
        "response": "Ub Iwerks",
        "source": "hotpot_qa"
    },
    {
        "query": "Who composed the tune most closely associated to the \"Infernal Galop\" as part of the \"Orpheus in the Underworld\" opera?",
        "response": "Jacques Offenbach",
        "source": "hotpot_qa"
    },
    {
        "query": "What American pop and jazz singer recorded \"Changing Partners\" the same year as Dinah Shore and Bing Crosby?",
        "response": "Kay Starr",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Joplin Regional Airport and Antonio Rivera Rodríguez Airport both located on the US mainland?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The place where Flores Athletic Club was an Argentine sports club from was considered a rural area of the Province of Buenos Aires until what year?",
        "response": "1888",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Snyder was a cameraman on a show called Hell's Angels produced by who?",
        "response": "Howard Hughes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the physicist who introduced the 't Hooft operator born?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Michael Winner and Guy Hamilton both English film directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which song from Badfinger's third album is featured in the series finale of AMC's \"Breaking Bad\"?",
        "response": "Baby Blue",
        "source": "hotpot_qa"
    },
    {
        "query": "Larry is the official resident cat of whom?",
        "response": "Prime Minister of the United Kingdom",
        "source": "hotpot_qa"
    },
    {
        "query": "In which record label did the debut studio album of a drummer who replaced Brian Schofield was released?",
        "response": "Geffen",
        "source": "hotpot_qa"
    },
    {
        "query": "What game was was first brought to the UK by Jack Barr Sr in 1982, Guess Who? or History of the World?",
        "response": "Guess Who?",
        "source": "hotpot_qa"
    },
    {
        "query": "The Australian cricket team toured Sri Lanka from 6 August to 20 September 2011, four uncapped players had been named in the Australian Test squad, including Shaun Edward Marsh, an Australian cricketer who plays for the Western Warriors in Australian domestic cricket and has represented Australia at Test, One Day International and Twenty20 International levels, and nicknamed SOS, an acronym of what ?",
        "response": "Son of Swampy",
        "source": "hotpot_qa"
    },
    {
        "query": "what is the english name of Émile Verdets editorial?",
        "response": "Annals of Chemistry and of Physics",
        "source": "hotpot_qa"
    },
    {
        "query": "Grover Norquist launched the K Street Project, which political party do they represent?",
        "response": "Republican",
        "source": "hotpot_qa"
    },
    {
        "query": "What bowl game featured a team coached by Mike Leach in 2012?",
        "response": "Meineke Car Care Bowl of Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Jones is a competitor in sport where motorcycle riders attempt to impress judges with what?",
        "response": "jumps and stunts",
        "source": "hotpot_qa"
    },
    {
        "query": "Who claimed the regions of Araucania and eastern Patagonia while also being accused of being a self-proclaimed king?",
        "response": "Orélie-Antoine de Tounens",
        "source": "hotpot_qa"
    },
    {
        "query": "Roberta Flack had a #1 single with the song composed by Charles Fox with lyrics by whom?",
        "response": "Norman Gimbel",
        "source": "hotpot_qa"
    },
    {
        "query": "Operation Plowshare occurred in what US state?",
        "response": "Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the guest wrestling coach for person that many consider to be the greatest mixed martial artists of all time win a silver medal a the Summer Olympics?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "How many Major League Baseball teams usually attend the meeting where the John H. Johnson President's Award is awarded?",
        "response": "30 Major League Baseball teams",
        "source": "hotpot_qa"
    },
    {
        "query": "Write the Future and Wayne Mark Rooney are both known for what sport?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Rakaposhi and Yukshin Gardan Sar located in the same country?",
        "response": "Karakoram mountain range in Pakistan",
        "source": "hotpot_qa"
    },
    {
        "query": "What radio station features personalities like Larry the Duck and is based in Ronkonkoma?",
        "response": "WPTY",
        "source": "hotpot_qa"
    },
    {
        "query": "Xiaogan and Mingguang, are located in which country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Longhaired Redneck\" is a song co-written and recorded by American country music artist David Allan Coe, an American songwriter, outlaw country music singer, and guitarist who achieved popularity in the 1970s and 1980s, born on which date?",
        "response": "September 6, 1939",
        "source": "hotpot_qa"
    },
    {
        "query": "Which executive prodicer of Mishima: A Life in Four Chapters was a central figure in the New Hollywood wave of filmmaking ?",
        "response": "Francis Ford Coppola",
        "source": "hotpot_qa"
    },
    {
        "query": "Which exhiled Russian businessman acquired a Russian owned oil and gas company based in Moscow, Russia?",
        "response": "Mikhail Borisovich Khodorkovsky",
        "source": "hotpot_qa"
    },
    {
        "query": "What industry do Jon Jost and Arline Burks Gant work in?",
        "response": "filmmaker",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Waste Land and Shikashika both types of drinks?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Rob Zombie and David Howard are both what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What family are the genus' Sinofranchetia and Stauntonia from?",
        "response": "a genus of flowering plant in the Lardizabalaceae family",
        "source": "hotpot_qa"
    },
    {
        "query": "What music genre does Shoot Low Sheriff and Red Steagall both play?",
        "response": "American Western and country",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nickname of the public figure who's attorney used a Chewbacca defense in his murder trial?",
        "response": "The Juice",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2007 Rand Hummel  was named Director of THE WILDS of New England located in what county?",
        "response": "Hillsborough County",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the son of Henry James, Sr. and the brother of renowned philosopher and psychologist William James and diarist Alice James, Henry James, or Mary Higgins Clark?",
        "response": "Henry James",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city, located about 12 miles north of Detroit city limits, was the location of the Olympian Motors Company? ",
        "response": "Pontiac, Michigan",
        "source": "hotpot_qa"
    },
    {
        "query": " Bardufoss Airportis a primary airport situated at Bardufoss in Målselv, Norway, Norwegian Air Shuttle operates three daily flights with Boeing 737s to where?",
        "response": "Oslo",
        "source": "hotpot_qa"
    },
    {
        "query": "The film \"Serena\" stars Bradley Cooper and Jennifer Lawrence is based on the 2008 novel by the same name by which author?",
        "response": "Ron Rash",
        "source": "hotpot_qa"
    },
    {
        "query": "Harold Robert Isaacs, was an American journalist and political scientist, Isaacs went to China in 1930 and became involved with left wing politics in Shanghai and wrote \"The Tragedy of the Chinese Revolution\", about the Chinese Revolution of 1925-27, first published with a preface by which now deceased, Marxist revolutionary, theorist, and Soviet politician?",
        "response": "Leon Trotsky",
        "source": "hotpot_qa"
    },
    {
        "query": "What defensive midfielder/center back was contracted by the same man who contracted Carlos Tevez?",
        "response": "Javier Mascherano",
        "source": "hotpot_qa"
    },
    {
        "query": "What town holds a celebration the name of which literally means \"apple slices\"?",
        "response": "Tyler",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brother of the player traded from the Washington Bullets to the Portland Trail Blazers after the 1993 NBA season?",
        "response": "Horace Grant",
        "source": "hotpot_qa"
    },
    {
        "query": "1970–71 Cincinnati Royals season, after trading Oscar Robertson, the Royals became a quick, young team, which Royals coach assisted the opposing teams racked up an average of 119.2 points per game, an American retired professional basketball player, and played point guard with the Boston Celtics from 1950 to 1963?",
        "response": "Robert Joseph Cousy",
        "source": "hotpot_qa"
    },
    {
        "query": "Aleksandr Yurievich Domogarov is a singer in a musical genre whose songs are bsed on themes of the ubran underclass and what?",
        "response": "criminal underworld",
        "source": "hotpot_qa"
    },
    {
        "query": "Greenlight Capital is a hedge fund founded in 1996 by which American investor, hedge fund manager, and philanthropist, born on November 20, 1968?",
        "response": "David M. Einhorn",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rapper who was raised in Fayetteville, North Carolina has worked with Illmind?",
        "response": "J. Cole",
        "source": "hotpot_qa"
    },
    {
        "query": "Igor Lemos Cajuhy was from which capital of Bahia?",
        "response": "Salvador",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the 46th season of Bundesliga in wich the club has finished 10th ?",
        "response": "The 2008–09 Bundesliga",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the cities of Yiwu and Jiaohe, Jilin both located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of bands are The Golden Seals and Galaxie 500?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose team was promoted to the second division of professional German football in the 2005-06 season?",
        "response": "Ali Bilgin",
        "source": "hotpot_qa"
    },
    {
        "query": "What CBS-affiliated station serves Pontotoc County, Oklahoma?",
        "response": "KXII",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the highest ice hockey league in Austria in which Orli Znojmo participate in?",
        "response": "Austrian Hockey League",
        "source": "hotpot_qa"
    },
    {
        "query": "Abhishek Bachchan, is an Indian film actor, producer and playback singer known for his works in Bollywood and Bengali cinema, and part of which Indian family, headed by Amitabh Bachchan?",
        "response": "Bachchan family",
        "source": "hotpot_qa"
    },
    {
        "query": "In which country was Mykolas Dluskis a priest in 1788?",
        "response": "Lithuania",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Valley International Airport and Westerly State Airport airports?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2016–17 Santa Clara Broncos men's basketball team represented what university that was founded in 1851",
        "response": "Santa Clara University",
        "source": "hotpot_qa"
    },
    {
        "query": "Chicagoland Sports Hall of Fame was founded by the company located in what Washington town, near the state capital?",
        "response": "Tumwater, Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "Bleda was the brother of which more famous Hun, in the 5th Century?",
        "response": "Attila",
        "source": "hotpot_qa"
    },
    {
        "query": "The coach for whom Orlando Brown played in college was born in what year?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of facility was Roger Batzel best known for as director?  ",
        "response": "federal research",
        "source": "hotpot_qa"
    },
    {
        "query": "Carole Mallory, is an American author, actress, former model, teacher and critic who appeared in The Stepford Wives, a 1972 satirical thriller novel by who?",
        "response": "Ira Levin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more known species, Cissus or Digitalis?",
        "response": "Cissus",
        "source": "hotpot_qa"
    },
    {
        "query": "What statistical area is the suburban city that houses the Charles Hosmer Morse Museum of American Art?",
        "response": "Orlando–Kissimmee–Sanford",
        "source": "hotpot_qa"
    },
    {
        "query": "What opera starring Mary LeSawyer had its premiere in Philadelphia in 1946?",
        "response": "Street Scene",
        "source": "hotpot_qa"
    },
    {
        "query": "Some have compared Aimee Walker Pond to another disabled person, whose teacher was who?",
        "response": "Anne Sullivan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the son of the chemist who received the highest Hirsch index rating of all living chemists in 2011?",
        "response": "Ben Whitesides",
        "source": "hotpot_qa"
    },
    {
        "query": "In many Nike-related situations, \"Just Do It\" appears alongside the Nike logo, known as the what, the logo of Nike?",
        "response": "Swoosh",
        "source": "hotpot_qa"
    },
    {
        "query": "Sweet Girl is the sixth mini-album released by which organization, under WM Entertainment, the  title song of the album, \"Sweet Girl\", along with the other songs, was produced by leader   professionally known as Jinyoung, is a South Korean singer, songwriter, record producer, and actor, given name is Jung Jin-young?",
        "response": "B1A4",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Swedish professional footballer who is considered a talisman for AIK leading the defense at left-back resulting in a loss of only 28 goals during the 2007 season? ",
        "response": "Nils-Eric Johansson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which European based oil giant bought the commodities trading arm of J.P. Morgan in 2014?",
        "response": "Mercuria Energy Group Ltd",
        "source": "hotpot_qa"
    },
    {
        "query": "Nexus and Girlfriends are both what?",
        "response": "magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created the character in \"Days of Wine and D'oh'ses\" that was upset about his friend giving up alcohol?",
        "response": "Matt Groening",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, 102 Dalmatians or Freaky Friday?",
        "response": "Freaky Friday",
        "source": "hotpot_qa"
    },
    {
        "query": "What show did this Swedish singer and songwriter, who sampled \"Dat Sexy Body\" in her song I Would Like,\" first appear where she gained national fame?",
        "response": "Talang",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the artist of the two studio albums \"Some Time in New York City\" and \"Mind Games\"? John Lennon",
        "response": "John Lennon",
        "source": "hotpot_qa"
    },
    {
        "query": "Max Rée, was a Danish costume designer, and art director, he won an Academy Award for Best Art Direction, for which 1931 Pre-Code Western film? ",
        "response": "Cimarron",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of animal does Pont-Audemer Spaniel and Jämthund have in common?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pathogenic fungus did Annie Gravatt study?",
        "response": "Chestnut blight",
        "source": "hotpot_qa"
    },
    {
        "query": "Tulips and Bergenia are native to what part of the world?",
        "response": "Central Asia",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the man who was partners with the electrical engineer that was awarded the Nobel Prize in Physics in December 2000?",
        "response": "Robert Noyce",
        "source": "hotpot_qa"
    },
    {
        "query": "Which breed of dog is extinct, the Bracco Italiano or the St. John's water dog?",
        "response": "St. John's water dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Nangpai Gosum and Noshaq in the same mountain range?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which dog breed originated further east, the Cão Fila de São Miguel or the Saluki?",
        "response": "Saluki",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game is mathematical, Acronymble or Rithmomachy?",
        "response": "Rithmomachy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the first woman to serve as the Speaker of thr Oregon House of Representatives as well as thr Portland Oregon mayor in 2000?",
        "response": "Vera Katz",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Tekno Team 2000 member was also known for his \"Cowboy\" gimmick in his wrestling career? ",
        "response": "Bill Watts",
        "source": "hotpot_qa"
    },
    {
        "query": "What Johnny Gruelle created character made an appearance in the The Enchanted Square cartoon in 1947?",
        "response": "Raggedy Ann",
        "source": "hotpot_qa"
    },
    {
        "query": "What label released Julio José Iglesias de la Cueva's 2003 album?",
        "response": "Columbia Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directs the upcoming monster film that a man known for his role as Richard Hendricks in the HBO series \"Silicon Valley\" star in?",
        "response": "Michael Dougherty",
        "source": "hotpot_qa"
    },
    {
        "query": "What English Professional ballroom dancer is a judge on Dancing with the Stars?",
        "response": "Leonard Gordon Goodman",
        "source": "hotpot_qa"
    },
    {
        "query": "The Oberoi family is part of a hotel company that has a head office in what city?",
        "response": "Delhi",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the microbiologist who first developed the MMR vaccine born?",
        "response": "1919",
        "source": "hotpot_qa"
    },
    {
        "query": " Muir Site is located in this region of Kentucky which makes up what part of the state?",
        "response": "northern",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Some Hearts\" singer collaborated with Keith Urban on Ripcord?",
        "response": "Carrie Underwood",
        "source": "hotpot_qa"
    },
    {
        "query": "Which rock band, Flow or Dada,  is made up of Michael Gurley (guitar/co-lead vocals), Joie Calio (bass/co-lead vocals) and Phil Leavitt (drums)?",
        "response": "Dada",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lacnunga ('Remedies') is a collection of miscellaneous Anglo-Saxon medical texts and prayers, written mainly in Old English and Latin, it is found, following other medical texts, in London, British Library Manuscript Harley of which year , many of its herbal remedies are also found, in variant form, in \"Bald's Leechbook\", an Old English medical text probably compiled in the ninth-century, possibly under the influence of Alfred the Great's educational reforms?",
        "response": "585",
        "source": "hotpot_qa"
    },
    {
        "query": "How many studio albums does the English band White Lies have?",
        "response": "four studio albums",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 1938 book of observations from the Spanish Civil War was written by the author who fought in it with the British Independent Labour Party?",
        "response": "Homage to Catalonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Burn Gorman had a role in the 2015 gothic romance film directed by whom?",
        "response": "Guillermo del Toro",
        "source": "hotpot_qa"
    },
    {
        "query": "The Moscow Philharmonic Orchestra is an orchestra based in Moscow, Russia, most associated with longtime conductor Kiril Kondrashin under whom it premiered which Russian composer and pianist, Fourth and Thirteenth symphonies as well as other works?",
        "response": "Dmitri Dmitriyevich Shostakovich",
        "source": "hotpot_qa"
    },
    {
        "query": "The Riot Club is a 2014 British drama film directed by Lone Scherfig and written by Laura Wade, the Riot Club was often described as a thinly veiled version of which exclusive but unofficial all-male students' dining club based in Oxford, called?",
        "response": "Bullingdon Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Who sang Speed of Light?",
        "response": "Bruce Dickinson",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress known by the media as the \"love goddess\" had a small uncredited role in what 1935 American comedy film?",
        "response": "Piernas de seda",
        "source": "hotpot_qa"
    },
    {
        "query": "What village of population 27,253 is located in the 4th District of New York?",
        "response": "Lindenhurst",
        "source": "hotpot_qa"
    },
    {
        "query": "What election did he win before defeating Bob Hawke in 1990?",
        "response": "1984",
        "source": "hotpot_qa"
    },
    {
        "query": "Which series of advertisements did Dave Bickler go on to provide the vocals in advertisement",
        "response": "Real Men of Genius",
        "source": "hotpot_qa"
    },
    {
        "query": "The Bush Beast was a roller coaster at the amusement park in what part of Sydney?",
        "response": "Eastern Creek",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first flagship sedan of the class of Mercedes-Benz which preceded the Mercedes-Benz CL-Class?",
        "response": "Mercedes-Benz W220",
        "source": "hotpot_qa"
    },
    {
        "query": "Who starred in a Japanese mystery horror novel by Yukito Ayatsuji in 2009?",
        "response": "Atsushi Abe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which book by Michael Lewis is Jeremy Van Brown  known for his place in",
        "response": "Moneyball",
        "source": "hotpot_qa"
    },
    {
        "query": "which town in Rensselaer County, New York, United States did  Valley Falls, New York village lies on the boundary",
        "response": "Schaghticoke",
        "source": "hotpot_qa"
    },
    {
        "query": "Which city in China,  Qingzhen or Guang'an, is the more specific location in terms of the hierarchy of Chinese infrastructure?",
        "response": "Qingzhen",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2010 Disney Channel Original Movie Co-starred Danielle Campbell  and an actor best known for playing the roles as Alex in \"17 Again\" ?",
        "response": "Starstruck",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the retired professional basketball player and businessman who came out of his retirement and returned to play for the Blazers ",
        "response": "Arvydas Romas Sabonis",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does one of the co-writers of \"Dirty Water\" live?",
        "response": "Nashville, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "What country music duo's song \"Country Line\" earned gold certification?",
        "response": "the single was certified Gold by Music Canada",
        "source": "hotpot_qa"
    },
    {
        "query": "Who's life is captured in the 1999 British film about the collapse of Baring's Bank, the United Kingdom's oldest merchest bank, due to fraudulent, speculative trading?",
        "response": "Nick Leeson",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Heartbreak Hurricane\" was recorded by which country artist, that also goes by the name Ricky Skaggs?",
        "response": "Rickie Lee Skaggs",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the former French football striker whose 24 goal record was tied during the 2001-02 Piacenza Calcio season?",
        "response": "David Sergio Trezeguet",
        "source": "hotpot_qa"
    },
    {
        "query": "The political issue that was the center of the Obergefell v. Hodges case was made legal in New Hampshire by signature of what governor?",
        "response": "John Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "Of the two artists, Threes Anna and Willard Huyck, whose country of residence is closest to Germany?",
        "response": "Threes Anna",
        "source": "hotpot_qa"
    },
    {
        "query": "who wrote the screenplay which  Jacqueline Obradors appeared in ",
        "response": "Michael Browning",
        "source": "hotpot_qa"
    },
    {
        "query": "Stone Sour's sixth album Hydrograd, which was also the first album to feature Christian Martucci and Johny Chow, was released worldwide on June 30, 2017 from which record label?",
        "response": "Roadrunner Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Cheick Oumar Sissoko and Marc Webb, have which occupation in common?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "How many acres is the state park located closest to Oak Beach Inn?",
        "response": "340",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Gaobeidian and Longhai City are located within what country?",
        "response": "People's Republic of China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which quarterly academic journal was owned by a leading global financial services firm from 2004 to 2013?",
        "response": "Journal of Applied Corporate Finance",
        "source": "hotpot_qa"
    },
    {
        "query": "What song did Cevin Fisher write that the singer who sang \"Hit and Run\" do the vocals for?",
        "response": "\"(You Got Me) Burning Up,\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the Hershey Company's founder build a historical landmark?",
        "response": "Derry Township, Dauphin County, Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital of the Wassa Amenfi West District?",
        "response": "Asankragua",
        "source": "hotpot_qa"
    },
    {
        "query": "In what War did the father of Princess Christina Margarethe of Hesse die?",
        "response": "World War II",
        "source": "hotpot_qa"
    },
    {
        "query": "What opera written by Henry Purcell starred Ludmila Vernerova?",
        "response": "Dido and Aeneas",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the english translation of the name of the city that held the 1987 All-Africa Games?",
        "response": "\"cool water\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When will Flicker, created by a member of One Direction, be released?",
        "response": "October 20, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "The Harrington River empties into Harrington Bay in a town that is an old seafaring and shipbuilding village, and had a population of what in the 2010 census?",
        "response": "1,004",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus contains more species, Pachystachys or Mazus?",
        "response": "Mazus",
        "source": "hotpot_qa"
    },
    {
        "query": "The ep The Summer was recorded by a band that started in what city?",
        "response": "Joplin, Missouri",
        "source": "hotpot_qa"
    },
    {
        "query": "Nikolai Chebotaryov and Eugene Dynkin, were Soviets, that had which occupation?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the singer who cofounded United Musicians with Aimee Mann and Michael Hausman?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Glen Benton and Thomas Erak both musicians?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Phil Power was most recently a manager of a team that plays in which league ?",
        "response": "National League North",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Reinhold Ewald or Jean-Jacques Favier?",
        "response": "Jean-Jacques Favier",
        "source": "hotpot_qa"
    }
]