[
    {
        "query": "What year was the book published that Best Laid Plans was loosely based on?",
        "response": "1937",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays more instruments, Brian E Roberts form The Hollow Men or Charlie Simpson?",
        "response": "Simpson is a multi-instrumentalist",
        "source": "hotpot_qa"
    },
    {
        "query": "Are The Postal Service and At the Drive-In both punk rock bands?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "She's a Woman was credited to the songwriting partnership that published approximately how many songs between 1962 and 1969?",
        "response": "180",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the younger sister of the leader of the Rogues?",
        "response": "Golden Glider",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of this South Korean musician, singer-songwriter, record producer and actor in the rock band CNBLUE, who wrote the song You, My Star?",
        "response": "Jung Yong-hwa",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the South Korean boy band Super Junior will appear in the television series Revolution?",
        "response": "Choi Si-won",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the university where S.A.P.L. Cloetingh works founded?",
        "response": "1636",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founder of the company that Harry Crook had worked as a sales representative for?",
        "response": "Alfred Fuller",
        "source": "hotpot_qa"
    },
    {
        "query": "The former Zimbabwean cricketer was born in the capital city with the population of how many?",
        "response": "1,606,000",
        "source": "hotpot_qa"
    },
    {
        "query": "On which continent are Heterotheca and Lupinus plants found?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "In which Maine county is Fort Pownall located?",
        "response": "Waldo County, Maine",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2002 album by the Canadian artist born on June 1, 1974?",
        "response": "Under Rug Swept",
        "source": "hotpot_qa"
    },
    {
        "query": "Sugar alcohol is an organic compound, typically derived from sugars, that comprise a class of polyols, which is the most popular, due to its similarity to sucrose in visual appearance and sweetness?",
        "response": "Xylitol",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was released first, Treasure of Matecumbe or The Wild Country?",
        "response": "The Wild Country",
        "source": "hotpot_qa"
    },
    {
        "query": "The song \"Lesson in Magic #1\" is by a band that was formed in what city?",
        "response": "Sion, Switzerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Where are the headquarters of the company who owns Black River Plantation House?",
        "response": "Memphis, Tennessee",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the magazine that Wallace Hester illustrate for end publication?",
        "response": "1914",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus contains more species, Philadelphus or Sarracenia?",
        "response": "Philadelphus",
        "source": "hotpot_qa"
    },
    {
        "query": "Meghan Markle portrayed which character on the legal drama series Suits?",
        "response": "Rachel Zane",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Fibigia and Tanakaea a flowering plant?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Was Olve Eikemo or Shagrath born first?",
        "response": "Stian Thoresen (born 18 November 1970)",
        "source": "hotpot_qa"
    },
    {
        "query": "Of what relation is Irina Mikhailovna Raievskya to the great-great grandson and historic heir of Wilhelm II?",
        "response": "great-grandmother",
        "source": "hotpot_qa"
    },
    {
        "query": "Krzysztof Penderecki who is Poland's greatest living composer and the composer of Utrenia is from which country?",
        "response": "Poland",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the first book in the series based on a stealth video game series developed by the Danish company IO Interactive?",
        "response": "Hitman: Enemy Within",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show was Andrew \"Andy\" Spade's brother in n the 1990s?",
        "response": "\"Saturday Night Live\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What company was established in 1845 and was headed by Julian Roberts until October 2015?",
        "response": "Old Mutual",
        "source": "hotpot_qa"
    },
    {
        "query": "The Border Surrender and The Wombats, both are what type of English music group?",
        "response": "rock band",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2009, what Bowl did the University that calls their home football field Memorial Stadium play in?",
        "response": "Texas Bowl",
        "source": "hotpot_qa"
    },
    {
        "query": "Abeliophyllum and Brillantaisia, are types of what?",
        "response": "plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Gary Jones was the costume designer for a 2013 fantasy adventure film directed by Sam Raimi that tells the story of what magician?",
        "response": "Oscar Diggs",
        "source": "hotpot_qa"
    },
    {
        "query": "What was a cartridge developed for the Browning .50 caliber machine gun in the late 1910, was banned in California which led to the adoption of a French rifle cartridge developed by Eric Danis? ",
        "response": ".50 Browning Machine Gun",
        "source": "hotpot_qa"
    },
    {
        "query": "Kō Nishimura had a supporting role in this film by Akira Kurosawa that came out in what year?",
        "response": "1960",
        "source": "hotpot_qa"
    },
    {
        "query": "What girl group writes and composes their own music and also debuted a single and music video on the same day?",
        "response": "Pristin",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American professional basketball player for the Minnesota Timberwolves of the National Basketball Association (NBA), that previously was traded by the Chicago Bulls to the New York Knicks?",
        "response": "Jamal Crawford",
        "source": "hotpot_qa"
    },
    {
        "query": " Chairmen of the Bored is an album that references a joke made by a cast member of what series?",
        "response": "Saturday Night Live",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the operator of the Outerbridge Crossing established?",
        "response": "1921",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the girl group Miss A under JYP Entertainment also stars in the South Korean television drama While You Were Sleeping?",
        "response": "Bae Suzy",
        "source": "hotpot_qa"
    },
    {
        "query": "Who has more awards for their films, Hal Hartley or Alexander Payne?",
        "response": "Alexander Payne",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre does Telemark and Quickstep have in common?",
        "response": "ballroom dance",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Swiss-German artist died who's lecture is \"Writings on Form and Design Theory\" and who's design had been compared with abstract Kaitag designs?",
        "response": "29 June 1940",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Austrian and later American chess master who was also a highly influential writer and chess theoretician competed for the first contest  that was defined \"in advance\" as being for the world championship?",
        "response": "Steinitz",
        "source": "hotpot_qa"
    },
    {
        "query": "How far is the city that the Texas Legends are in from Dallas/ Fort Worth International Airport?",
        "response": "approximately 25 mi",
        "source": "hotpot_qa"
    },
    {
        "query": "Louise Wiker is a Swedish long-distance runner, she competed in the marathon event at the fifteenth edition of the IAAF World Championships, was held 22–30 August 2015 in Beijing, China, event title?",
        "response": "2015 World Championships in Athletics",
        "source": "hotpot_qa"
    },
    {
        "query": "The quarterback successors to Cody Hodges include a 2011 undrafted free agent to the St. Louis Rams and what other person?",
        "response": "Seth Doege",
        "source": "hotpot_qa"
    },
    {
        "query": "Interstate H-201 (H-201) passes Red Hill, Fort Shafter and a facility whose massive coal pink structure can be see from where?",
        "response": "any point in the Honolulu District",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year was this American drama film starring Donna Reed and American actor and film and television producer of \"Shane\" (1953) and \"This Gun for Hire\" (1942) released?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the novel which the terms Tom show and Uncle Tom are derived from?",
        "response": "Harriet Beecher Stowe",
        "source": "hotpot_qa"
    },
    {
        "query": "Which animation programming block did the series American Dad premier inn?",
        "response": "Animation Domination",
        "source": "hotpot_qa"
    },
    {
        "query": "Actor David Lee Stenstrom played the character Waldo the inventor in a TV show that ran on Nickelodeon during what yeras?",
        "response": "1984 to 1985",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the daughter of Barbara Kolanka died who became the Queen consort of Poland?",
        "response": "8 May 1551",
        "source": "hotpot_qa"
    },
    {
        "query": "Which suitcase manufacturer is named after a Peruvian artifact and has a store in an urban shopping mall in Time Warner Center in Manhattan?",
        "response": "Tumi Holdings, Inc.",
        "source": "hotpot_qa"
    },
    {
        "query": "Anne Rose Brooks was born in what hamlet and census-designated place, that is located near the North Shore of Long Island in the town of Oyster Bay, in Nassau County, New York? ",
        "response": "Plainview",
        "source": "hotpot_qa"
    },
    {
        "query": "Which stories is the musical, in which Stephen Flaherty was nominated eight Tony Awards for, based on?",
        "response": "Dr. Seuss",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 2010 census population of the town in which Richard Falley Jr. is from?",
        "response": "2,591",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did the Senator run for president, that Mary Alice Mapes reported as having an unacknowledged biracial daughter ?",
        "response": "1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Airport is popular among tourists to the Carribean, Fort Lauderdale–Hollywood International Airport or Fairbanks International Airport?",
        "response": "Fort Lauderdale–Hollywood International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "How did The President of Uganda from 1971 to 1979, who was known as strongman, die?",
        "response": "a helicopter crash",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker focused on a more eastern global region, Tomás Gutiérrez Alea or Fruit Chan?",
        "response": "Fruit Chan",
        "source": "hotpot_qa"
    },
    {
        "query": "This French comedy directed by Philippe de Chauveron starred actress Julia Piaton. ",
        "response": "Serial",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the town in which the Centre Congregational Church is located?",
        "response": "3,777",
        "source": "hotpot_qa"
    },
    {
        "query": "Who did Ron Richardson play in a musical with a book by William Hauptman and lyrics by Roger Miller?",
        "response": "Jim",
        "source": "hotpot_qa"
    },
    {
        "query": "Jessica Lee, former MP for Erewash, served as Parliamentary Private Secretary to the experienced representative for Beaconsfield, when he held which office?",
        "response": "Attorney General",
        "source": "hotpot_qa"
    },
    {
        "query": "Taylor Momsen and Craig Mabbitt from Escape the Fate have what in common?",
        "response": "lead singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Out of the two directors, Andrzej Bartkowiak and Hugh Schulze, who is also a cinematographer",
        "response": "Andrzej Bartkowiak",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1983, who was best known for producing A Christmas Story?",
        "response": "Bob Clark",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress performed in Upright Citizens Brigade and starred in the comedy series \"Parks and Recreation\"?",
        "response": "Amy Poehler",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American Oregon Army National Guardsman specialist, along with Spencer Stone and Anthony Sadle stopped a gunman on a Paris-bound train travelling from Amsterdam via Brussels in August 2015?",
        "response": "Aleksander Reed \"Alek\" Skarlatos",
        "source": "hotpot_qa"
    },
    {
        "query": "What \"Despicable Me\" spin-off was written by Brian Lynch?",
        "response": "Minions",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the wide-body twin-engine jet airliner that use the design of Richard Clarkson in its development?",
        "response": "Airbus A300",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Brandon Flowers or Jack Evans?",
        "response": "Jack Evans",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plant is named after a person, Amesiella or Cucurbita?",
        "response": "Amesiella",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following stars Jeff Bridges as a computer programmer: Tron or The Million Dollar Duck?",
        "response": "Tron",
        "source": "hotpot_qa"
    },
    {
        "query": "I Am Legend was a horror novel that was the inspiration behind which George A. Romero film?",
        "response": "Night of the Living Dead",
        "source": "hotpot_qa"
    },
    {
        "query": "Who established the British musical theatre project that revived a lesser-known work of award-winning lyricist Alan Jay Lerner?",
        "response": "Ian Marshall Fisher",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rote Jager was assembled by what World War II fighter ace who served on both the Eastern and Western fronts?",
        "response": "Hermann Graf",
        "source": "hotpot_qa"
    },
    {
        "query": "Princess Sophie of Bavaria's eldest son died in which year ?",
        "response": "1916",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus has more species, Platycodon or Juncus?",
        "response": "Juncus",
        "source": "hotpot_qa"
    },
    {
        "query": "How was Ada Lovelace, the first computer programmer, related to Lord Byron in Childe Byron?",
        "response": "his daughter",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the top speed of the faster roller coaster, when comparing Green Lantern and The Riddler's Revenge?",
        "response": "65 mph",
        "source": "hotpot_qa"
    },
    {
        "query": "Who played college football for Oklahoma that was selected by the Buccaneers in the 2012 NFL Draft?",
        "response": "Gerald McCoy",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the headquarters where Hebert O. Fisher was an aviation executive? ",
        "response": "4 World Trade Center",
        "source": "hotpot_qa"
    },
    {
        "query": "The Salado river flows through the provinces of Santiago and Santa Fe in the north of which country?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "What pursuit did both Gevork Minaskanian and George Stambolian have in common?",
        "response": "American educator, writer,",
        "source": "hotpot_qa"
    },
    {
        "query": "Zircon known for what soundtrack?",
        "response": "PIU",
        "source": "hotpot_qa"
    },
    {
        "query": "The sponsor of the 2007 NRL season is Australia's largest what?",
        "response": "telecommunications company",
        "source": "hotpot_qa"
    },
    {
        "query": "Situational analysis was advanced by Karl Popper in his book released in what year?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "Auranticarpa and Huernia are both plant genus?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both John Korty and Charley Chase known for comedies?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Between the Sabal and the Liatris, which genus of plant produces a fruit called drupe?",
        "response": "Sabal",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the creator and writer of the sitcom that features a character named Cassandra Trotter?",
        "response": "John Sullivan",
        "source": "hotpot_qa"
    },
    {
        "query": "Geoffrey Wilder is the father of which Runaways supervillain?",
        "response": "Alex Wilder",
        "source": "hotpot_qa"
    },
    {
        "query": "Shether was a song by which American rapper who topped the Billboard charts?",
        "response": "Remy Ma",
        "source": "hotpot_qa"
    },
    {
        "query": "Ohio's 1st congressional district is represented by which Republican American politician and businessman who has been an United States Representative?",
        "response": "Steven Joseph Chabot",
        "source": "hotpot_qa"
    },
    {
        "query": "Which founder of Alcatraz East was born on March 31, 1956?",
        "response": "John Morgan",
        "source": "hotpot_qa"
    },
    {
        "query": "The actress who appeared in the 2002 film Love in the Time of Money and made her film debut in a 1995 teen drama was born in what year?",
        "response": "1979",
        "source": "hotpot_qa"
    },
    {
        "query": "What is type of philosophies is The Structure of Liberty about?",
        "response": "political",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Kamāl al-Dīn al-Fārisī and Avicenna considered scientists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the composer of music for the animated series based on \"Duck Dodgers in the 24½th Century\" born?",
        "response": "Medindie, South Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Slipknot frontman Corey Taylor released Bother as solo artist before it was released on what band's self-titled debut album?",
        "response": "Stone Sour",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the bands \"+44\" and \"The Dead Milkmen\" formed in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first Alfred Aloysius \"Trader\" Horn or Cecil John Rhodes PC",
        "response": "Cecil John Rhodes PC",
        "source": "hotpot_qa"
    },
    {
        "query": "\"You Are Everything\" was one of a run of 12 consecutive top ten hits in the early 1970s for which Philadelphia R&B group?",
        "response": "The Stylistics",
        "source": "hotpot_qa"
    },
    {
        "query": "What city are both W New York Downtown Hotel and Residences and 111 Murray Street in?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "Who voiced the character Barney Gumble in \"The Simpsons Christmas Special?\"",
        "response": "Dan Castellaneta",
        "source": "hotpot_qa"
    },
    {
        "query": "Council Rock was a meeting ground for New York Native Americans, who sometimes had this term used for them incorrectly?",
        "response": "Metoac",
        "source": "hotpot_qa"
    },
    {
        "query": "The Portland Winterhawks have produced alumni which include the Swiss hockey player for the Minnesota Wild nicknamed what?",
        "response": "El Niño",
        "source": "hotpot_qa"
    },
    {
        "query": "What station does the show that the actress born on August 31, 1989 air on?",
        "response": "KBS2",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the artist who recorded the song \"Give it 2 U in which rapper Kendrick Lamar makes a guest appearance?",
        "response": "Robin Thicke",
        "source": "hotpot_qa"
    },
    {
        "query": "Sands Macao is a hotel that is operated by which company based in Paradise, Nevada?",
        "response": "Las Vegas Sands",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the South Korean film for which Choo Ja-hyun was best known? ",
        "response": "Jeon Yun-su",
        "source": "hotpot_qa"
    },
    {
        "query": "Crossing the Line was directed by Peter Jackson, and had an additional director who was what South African film director who is best known for District 9?",
        "response": "Neill Blomkamp",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the American English name for the Polka Marina merry-go-round in the Netherlands?",
        "response": "A carousel (American English: from French \"carrousel\" and Italian \"carosello\"), roundabout (British English), or merry-go-round, is an amusement ride consisting of a rotating circular platform with seats for riders.",
        "source": "hotpot_qa"
    },
    {
        "query": "Carl Daniel Ekman (March 17, 1845 – November 3, 1904) was a Swedish chemical engineer who invented the form of the sulfite process of wood pulp manufacturing which was first established on a firm commercial basis, helping to replace rags as the main raw material of paper with wood pulp, he opened the Ekman Pulp and Paper Company mill in Northfleet, Kent near the mouth of the Thames River in 1886, Kent is a county in South East England and is how many of the home counties?",
        "response": "one",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Henry James and Charlotte Perkins Gilman both american writers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What Bulgarian Airline took over Hemus Air?",
        "response": "Bulgaria Air",
        "source": "hotpot_qa"
    },
    {
        "query": "Which economic system based on private ownership of the means of production and their operation for profit was employed during the reign of Emporer Meiji?",
        "response": "Capitalism",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the  eyeglass maker buried?",
        "response": "29 September 1619",
        "source": "hotpot_qa"
    },
    {
        "query": "Matilde Camus and Sara Teasdale, have which occupation in common?",
        "response": "poet",
        "source": "hotpot_qa"
    },
    {
        "query": "Killer Pad is a 2008 comedy/horror film directed by Robert Englund, best known for playing the infamous serial killer Freddy Krueger in what film series?",
        "response": "\"Nightmare on Elm Street\"",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the production company of Digby Dragon founded?",
        "response": "Founded in 2000",
        "source": "hotpot_qa"
    },
    {
        "query": "WHere was one of the actors from Cry of the Innocent born?",
        "response": "Australian-born",
        "source": "hotpot_qa"
    },
    {
        "query": "The daughter of poet Kaifi Azmi plays a supporting role in a 2016 Indian biographical thriller that stars what actor as the title character?",
        "response": "Sonam Kapoor",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the railway, in which the FM H-12-44TS was manufactured specifically, chartered?",
        "response": "1859",
        "source": "hotpot_qa"
    },
    {
        "query": "Rainy Day Records produced records for what drummer of the alternative rock band Garbage?",
        "response": "Butch Vig",
        "source": "hotpot_qa"
    },
    {
        "query": "The singer of \"Thank God and Greyhound\" is best known for hosting what nationally televised country variety show?",
        "response": "\"Hee Haw\",",
        "source": "hotpot_qa"
    },
    {
        "query": "The Miracle at Michigan included a pass that was caught by the player at what position?",
        "response": "wide receiver",
        "source": "hotpot_qa"
    },
    {
        "query": "Who formed first, The Get Up Kids or Moonbabies?",
        "response": "The Get Up Kids",
        "source": "hotpot_qa"
    },
    {
        "query": "What wrestling team is Mathew Thomas Rehwoldt a part of?",
        "response": "The Vaudevillains",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ganslernhang (or Ganslern for short) is a ski piste in Kitzbühel in Austria, on which the slalom events of the Hahnenkamm Races take place, located next to the final straight of the Streif downhill course, he Hahnenkamm is a mountain in Europe, directly southwest of Kitzbühel in the Kitzbühel Alps of which country?",
        "response": "Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city is the football club that Robin Himmelmann is a goalkeeper for based?",
        "response": "Hamburg",
        "source": "hotpot_qa"
    },
    {
        "query": "What genre is Jang Hoon's fourth film?",
        "response": "historical action drama",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor that starred the Comedy Central sketch series Key and Peele also appeared in Fargo as FBI agent Pepper?",
        "response": "Keegan-Michael Key",
        "source": "hotpot_qa"
    },
    {
        "query": "what was the birth year of the fifth governor of a British colony in north America that existed from 1632 to 1776?",
        "response": "1626",
        "source": "hotpot_qa"
    },
    {
        "query": "Extraction is a 2015 American action-thriller film starring an american professional poker player whose middle name is what?",
        "response": "Brandon",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city as of the 2010 Census where the band Quincy Mumford & The Reason Why is based?",
        "response": "16,116",
        "source": "hotpot_qa"
    },
    {
        "query": "From what countries are Gauhar Ali and Iftikhar Ahmed from?",
        "response": "Pakistan",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Paul Baloff and Nick Hexum American?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which senior pastor, working at many churches, works with lead pastor Adam Johnson?",
        "response": "Andy Stanley",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the widow of Lee Harvey Oswald who used to live with Ruth Paine at the time of the JFK assassination? ",
        "response": "Marina Nikolayevna Oswald Porter",
        "source": "hotpot_qa"
    },
    {
        "query": "The Quisling regime was led by a military officer born in which year ?",
        "response": "1887",
        "source": "hotpot_qa"
    },
    {
        "query": "What American film director born on Nov 30, 1943 also wrote \"Pocket Money\"?",
        "response": "Terrence Malick",
        "source": "hotpot_qa"
    },
    {
        "query": "What  is one of the five ranger districts of the Chattahoochee National Forest that has a mountain located in the Chattahoochee National Forest on the border of Fannin and Gilmer counties in the district, along with a portion of the Toccoa River? ",
        "response": "Toccoa Ranger District",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the NBA player who visited Tlacote el Bajo win during his rookie season?",
        "response": "a championship and an NBA Finals Most Valuable Player Award",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the actor born October 10,1947 who starred in the producers?",
        "response": "Gary Beach",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was a solo artist, Faye or Benjamin Burnley?",
        "response": "Faye",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many years did Denmark–Norway held colonial possessions in India including the Bungalow on the Beach?",
        "response": "200 years",
        "source": "hotpot_qa"
    },
    {
        "query": "The first recording of the Mahler Symphony No. 8 was conducted by which Jewish-Polish-Irish bandleader?",
        "response": "Leopold Anthony Stokowski",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is both the author of \"A Treatise on the Fundamental Principles of Violin Playing\" as well as the father of Wolfgang Amadeus Mozart?",
        "response": "Leopold Mozart",
        "source": "hotpot_qa"
    },
    {
        "query": "Do Frank Coraci and Roger Donaldson have the same profession?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Cathy Inglese is the former head coach of the women's basketball team at a university whose main campus is located in the village of Kingston in southern Rhode Island, and which also includes the Feinstein Campus in what city?",
        "response": "Providence",
        "source": "hotpot_qa"
    },
    {
        "query": "The Jaguar C-XF, was a concept car that was designed to showcase the preliminary styling cues of which yet to be announced executive/mid-size luxury car, and estate produced by which British car?",
        "response": "Jaguar XF",
        "source": "hotpot_qa"
    },
    {
        "query": "Rod Strickland is the godfather of an NBA player who won an NBA championship with the cavaliers in which year ?",
        "response": "2016",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Princess Yolanda of Savoy and Elena of Montenegro related?",
        "response": "Italy",
        "source": "hotpot_qa"
    },
    {
        "query": "Both Brian Warren and Jake Shields are considered what?",
        "response": "mixed martial arts fighter",
        "source": "hotpot_qa"
    },
    {
        "query": "Baz Luhrmann created the 2008 film starring which actress?",
        "response": "Nicole Kidman",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area code of the British Overseas Territory in the Caribbean?",
        "response": "284",
        "source": "hotpot_qa"
    },
    {
        "query": "Ramón del Valle-Inclán and Michel Leiris, are in which shared industry?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality is the footballer who along withOlić, Ribéry, and Schweinsteiger scored when Hayden thrashed Bremen 4-0 in the  2010 DFB-Pokal Final ? ",
        "response": "Dutch",
        "source": "hotpot_qa"
    },
    {
        "query": "A former Independent-Republican United States Senator from Minnesota defeated who in the 1984 election?",
        "response": "Joan Growe",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the director of Child of God born?",
        "response": "1978",
        "source": "hotpot_qa"
    },
    {
        "query": "what filmmakers last picture stared Amy Rose Locane-Bovenizer?",
        "response": "Tony Richardson",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band, Matthew Good Band or Switchfoot is still together?",
        "response": "Switchfoot",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Belinda Carlisle and Dez Fafara in the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 1988 romantic comedy-drama starring Joan Cusack?",
        "response": "Mike Nichols",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Barrow is the road bridge connecting to an electral ward in Cumbria, England?",
        "response": "Central Barrow",
        "source": "hotpot_qa"
    },
    {
        "query": "Edward Frederick Lindley Wood death in 1959 led to the first Oxford Chancellor election to be contested since what year?",
        "response": "1925",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a United States Representative from New York, who was born in a hamlet in the town of New Scotland on the southeast corner of the town ?",
        "response": "John I. Slingerland",
        "source": "hotpot_qa"
    },
    {
        "query": "Which team that participated in the 1922 SAFL Grand Final has the home base located in an inner-western suburb of Adelaide?",
        "response": "West Adelaide Football Club",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Mircea Eliade and B. Traven who had a more diverse career?",
        "response": "Mircea Eliade",
        "source": "hotpot_qa"
    },
    {
        "query": " Imran Ali played one List-A level match at  which stadium, renovated for the 1996 Cricket World Cup?",
        "response": "Gaddafi Stadium",
        "source": "hotpot_qa"
    },
    {
        "query": "Kathleen Baker is the current world-record holder in the 4x100 metre medley relay along with an American compedition swimmer who qualified for what in 2016?",
        "response": "Rio Olympics",
        "source": "hotpot_qa"
    },
    {
        "query": "In which German federal state was did Walter Schlesinger born?",
        "response": "Hesse",
        "source": "hotpot_qa"
    },
    {
        "query": "Theme Park Inc is a video game that created what sequel in North America in 1999?",
        "response": "Sim Theme Park",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Erskine Caldwell and Richard Ford both American novelists?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "DJ Maphorisa has worked with the singer-songwriter and producer of what nationality?",
        "response": "Nigerian",
        "source": "hotpot_qa"
    },
    {
        "query": "Mexican Federal Highway 45D has tolled segments between Chihuahua City and which largest city in the Mexican state of Chihuahua?",
        "response": "Ciudad Juárez",
        "source": "hotpot_qa"
    },
    {
        "query": "João Guimarães Rosa and Robert Creeley have what in job in common?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the laboratory where Joseph Hendrie served as chairman of the Department of Applied Science?",
        "response": "Upton, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "What does the Grain company manufacture using Northern White Cedar and Western Red Cedar wood?",
        "response": "surfboards",
        "source": "hotpot_qa"
    },
    {
        "query": "Michael Pollock was a gunnery officer on the Norfolk when it fought which German capital ship?",
        "response": "Scharnhorst",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucas Danial Till appeared in what 2013 British-American psychological thriller-drama film written by Wentworth Miller?",
        "response": "Stoker",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both S. Sylvan Simon and Jörg Buttgereit directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What organization hosted the event that had Dave Debol as a US representative in 1977, 1978 and 1981?",
        "response": "International Ice Hockey Federation",
        "source": "hotpot_qa"
    },
    {
        "query": "Who had more pseudonyms, Robert Ludlum or Clement Greenberg?",
        "response": "Robert Ludlum",
        "source": "hotpot_qa"
    },
    {
        "query": "Battle of the Giants!  is the first special Christmas episode of a comedy series written by what two people?",
        "response": "Jimmy Perry and David Croft",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession does Andrew Murray and Ike Quartey have in common?",
        "response": "boxer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American film, television and stage actress that starred in The Naughty Flirt born?",
        "response": "August 2, 1905",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays more instruments, Feist or The Brothers Creeggan?",
        "response": "The Brothers Creeggan",
        "source": "hotpot_qa"
    },
    {
        "query": "Which goes by the common name of Plumbago: Dillenia or Ceratostigma?",
        "response": "Ceratostigma",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the nationality of the person who researched \"Underground\"?",
        "response": "Australian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which South African born singer featured the musical revue \"Sigh No More\"?",
        "response": "Graham Payn",
        "source": "hotpot_qa"
    },
    {
        "query": "Panthera youngi is known from Choukoutien, northeastern China and Japan, and lived about 350,000 years ago in the Pleistocene epoch, Harington, 1969 suggested that the American lion, the Eurasian cave lion and the large Chinese \"Panthera youngi\" are conspecific, The American lion (\"Panthera leo atrox\" or \"P. atrox\" ) – also known as the North American lion, Naegele’s giant jaguar or American cave lion – is an extinct lion of the family Felidae, endemic to which location during the Pleistocene epoch?",
        "response": "North America",
        "source": "hotpot_qa"
    },
    {
        "query": "Which high school did the second overall pick of the Charlotte Bobcats in 2004 attend before the NBA?",
        "response": "Bellaire High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Which documentary was released first, Best Friend Forgotten or The Panama Deception?",
        "response": "The Panama Deception",
        "source": "hotpot_qa"
    },
    {
        "query": "What U.S. Highway runs from Mexico to New York, while going through Glencoe, Arkansa?",
        "response": "U.S. Route 62",
        "source": "hotpot_qa"
    },
    {
        "query": "Rockstar was produced by Louis Bell, who co-produced a song by Post Malone that was released on November 4, 2016 by what record company?",
        "response": "Republic Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Fukuzawa Yukichi, was a Japanese author, writer, teacher, translator, entrepreneur and journalist who founded Keio University, a Japanese private university located in Minato, in which city? ",
        "response": "Tokyo",
        "source": "hotpot_qa"
    },
    {
        "query": " Which species, Cardwellia or Ochagavia, is native to South America?",
        "response": "Ochagavia",
        "source": "hotpot_qa"
    },
    {
        "query": "Maggie was a series that starred the actress who had a minor role in what 1996 comedy?",
        "response": "Multiplicity",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Laizhou and Suixi County, Anhui located in China?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which University was founded firsts Kasetsart University or Polytechnic University of the Philippines?",
        "response": "Polytechnic University of the Philippines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the card or tile games Twilight Struggle and Tantrix has a Cold War theme?",
        "response": "Twilight Struggle",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist started recording/performing earlier David Donato or Moya Brennan?",
        "response": "Moya Brennan",
        "source": "hotpot_qa"
    },
    {
        "query": "After her husband died, what woman is known for her contribution to the completion of a bridge that connects the boroughs of Manhattan and Brooklyn?",
        "response": "Emily Warren Roebling",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Flax and Calamus in the same family?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was id Tech 5 first used in a video game?",
        "response": "2011",
        "source": "hotpot_qa"
    },
    {
        "query": "Doug Edwards played basketball for the Hawks and another team established in what year? ",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Anne Archer is an American actress, includes a film appearance in which 1992 American spy thriller film, directed by Phillip Noyce, and based on which of Tom Clancy's novel of the same name?",
        "response": "Patriot Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Egbert B. Gebstadter is a fictional author who appears in the indexes of books written by an American professor who was born in what year?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": " In a Metal Mood: No More Mr. Nice Guy is a 1997 album by an American who had how many top-40 hits?",
        "response": "38",
        "source": "hotpot_qa"
    },
    {
        "query": "About Time is a  British romantic comedy-drama film that stars an Irish actor and writer who recieved a Bachelor of Arts from where?",
        "response": "Dublin Institute of Technology",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game was created first Lost Cities or Concept?",
        "response": "Lost Cities",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie did Don L. Harper compose that is about the US Coast Guard?",
        "response": "The Guardian",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the comedian born who hosted a show showcasing advertisements and weird video footage that lasted from 1999 to 2001?",
        "response": "16 November 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What movie features the actor who played the title character based on Ken Bruen's novels as Jarrod Slade?",
        "response": "Cleverman",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of magazine is Hakusensha's magazine?",
        "response": "\"shōjo\" manga magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Charlie Dominici and Andy Yorke both nationals of the same country ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Intelligent Thought is a book co written by this famous American theorectical physicist?",
        "response": "Lee Smolin",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the band that starred Belinda Carlisle and released the album, Germicide in 1977?",
        "response": "The Go-Go's",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Major League Baseball team did Rutherford Rennie write for during the time Lou Gehrig played for them?",
        "response": "the New York Yankees",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Aggers\" or \"Spiro\" interviewed for his role in  takeover of the governance of cricket by ICC's 'Big Three', was titled a what?",
        "response": "takeover architects",
        "source": "hotpot_qa"
    },
    {
        "query": "Which pizza company is located farther south in California, Pizza My Heart or Zpizza?",
        "response": "zpizza (originally called z pizza and commonly known as z) is a pizza franchise based in Newport Beach, California",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the university at which Donald N. Langenberg  served on the Board of Trustees at the located? ",
        "response": "Washington, D.C.",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Kathy Jordan and Martin Damm both former tennis players ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What building has an Art Deco style and was appraised by Robert Von Ancken?",
        "response": "Chrysler Building",
        "source": "hotpot_qa"
    },
    {
        "query": "Besides Iggy Pop, which other singer who was known for her partnership with Serge Gainsbourg, contributed to the \"We are the Lillies\" project?",
        "response": "Jane Mallory Birkin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which artist worked alongside the South African record producer to assist with production?",
        "response": "Wizkid",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was Temple's selection to the All-Championship team in the 2000 Atlantic 10 Men's Basketball Tournament born?",
        "response": "Argentina",
        "source": "hotpot_qa"
    },
    {
        "query": "Which international airport serving Greater St. Louis, Missouri is supported by the St. Louis Lambert Airport Police?",
        "response": "St. Louis Lambert International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which MacArthur Fellow released an album on the Red Giant record label?",
        "response": "Vijay Iyer",
        "source": "hotpot_qa"
    },
    {
        "query": " Christopher Newport University and Washington State University are both what?",
        "response": "public",
        "source": "hotpot_qa"
    },
    {
        "query": "Are the American based Apple Inc. and Vertex Pharmaceuticals companies headquartered in the same city?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy J. Sloan was the CEO of Wells Fargo who succeeded the CEO who took the job in what month?",
        "response": "June 2007",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress was born in 1967, has won two Primetime Emmy Awards and was replaced in the role of Grave Mulligan in the drama film Manderlay?",
        "response": "Nicole Kidman",
        "source": "hotpot_qa"
    },
    {
        "query": "The Story of Us is from the album on what label?",
        "response": "Big Machine Records",
        "source": "hotpot_qa"
    },
    {
        "query": "Pray to God is a song by Calvin Harris, that features vocals from what American pop rock band from Los Angeles, that consists of three sisters?",
        "response": "Haim",
        "source": "hotpot_qa"
    },
    {
        "query": "Rick Lewis is the founder of what bimonthly philosophy magazine?",
        "response": "Philosophy Now",
        "source": "hotpot_qa"
    },
    {
        "query": "Between \"This Changes Everything\" and \"My Architect\", which documentary is about Louis Kahn?",
        "response": "My Architect",
        "source": "hotpot_qa"
    },
    {
        "query": "Lindsay Frimodt is an American model whos advertisements include an American sportswear fashion designer who was the first women’s ready-to-wear designer for who?",
        "response": "the French house Celine",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the young U.S. FBI trainee who appears in the novel \"Hannibal\" by Thomas Harris?",
        "response": "Clarice Starling",
        "source": "hotpot_qa"
    },
    {
        "query": "Which opera premiered first, Die Entführung aus dem Serail or Lohengrin?",
        "response": "Die Entführung aus dem Serail",
        "source": "hotpot_qa"
    },
    {
        "query": "Euxoamorpha eschata is a moth found in a city situated on the southern shores of what?",
        "response": "Nahuel Huapi Lake",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker is not German, David Gordon Green or Detlev Buck?",
        "response": "David Gordon Green",
        "source": "hotpot_qa"
    },
    {
        "query": "Who died at a younger age, Carl Maria von Weber or Giuseppe Verdi?",
        "response": "Carl Maria Friedrich Ernst von Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "Alejandro \"Alec\" Mapa, is an American actor, comedian and writer, and got his first professional break when he was cast to replace B.D. Wong for the role of who in the Broadway production of \"M. Butterfly\"?",
        "response": "Song Liling",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Chinese city is the capital of the Jiangsu province, Nanjing or Pu'er City",
        "response": "Nanjing",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was released first, One Magic Christmas or King of the Grizzlies?",
        "response": "King of the Grizzlies",
        "source": "hotpot_qa"
    },
    {
        "query": "American actor Blair Redford was succeeded in the role of Scotty Grainger on \"The Young and the Restless\" by what actor?",
        "response": "Daniel Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "In what MTV comedy series did Julia Fletcher's second son work on?",
        "response": "Faking It",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Broughtonia and Laeliocattleya both orchids?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What country did Frederic Thesiger, 1st Viscount Chelmsford serve in from 1909 to 1913?",
        "response": "Australia",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the 2012 romantic-comedy film Jeom Deok-su starred in?",
        "response": "Daniel Hsia",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Celastrus and Thunbergia native to the Americas?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Phil Joanou or Tod Browning?",
        "response": "Tod Browning",
        "source": "hotpot_qa"
    },
    {
        "query": "Whose films have featured music from the creator of the album Always Got Tonight?",
        "response": "David Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "What Indian actor/actress born in 1981 had a lead role in Lakshyam?",
        "response": "Anushka Shetty",
        "source": "hotpot_qa"
    },
    {
        "query": "When does an Anabaptist leader born who led the schism in Switzerland within a group of Swiss and Alsatian Anabaptists? ",
        "response": "12 February 1644",
        "source": "hotpot_qa"
    },
    {
        "query": "What people are considered to be Odawa that are culturally related indigenous peoples in Canada and the United States, other than the Anishinaabe or the Anishinaabeg?",
        "response": "They are one of the Anishinaabeg, related to but distinct from the Ojibwe and Potawatomi peoples.",
        "source": "hotpot_qa"
    },
    {
        "query": "what city will host the event in which marie gisele eleme asse won twoo medals in 2017",
        "response": "Abidjan",
        "source": "hotpot_qa"
    },
    {
        "query": "A Culă is a type of building originally made to be able to fortify the ruling class against invasions during which wars?",
        "response": "Ottoman–Habsburg wars",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the birth year of the skier who returned from her 1976 sabbatical for the 1977 Alpine Skiing World Cup?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Love to Hate You\" is a song by Erasure, an English synthpop duo, consisting of singer and songwriter Andy Bell and songwriter and which keyboardist?",
        "response": "Vince Clarke",
        "source": "hotpot_qa"
    },
    {
        "query": "Arisarum and Erysimum are both genuses of what?",
        "response": "flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American rapper born who's album is Stoney?",
        "response": "July 4, 1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Both David Parks and Troy Aikman are former American football players, who played for the Dallas cowboys?",
        "response": "Troy Aikman",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Scared and Running\" is the 31st episode of what television show that starts Peter Sarsgaard as Seward?",
        "response": "\"The Killing\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Chris Crawford on Game Design contains a response about a life simulation game developed by who?",
        "response": "EA Maxis",
        "source": "hotpot_qa"
    },
    {
        "query": "What artist that specializes in a hip hop music subgenre that encompasses any artists or music that originate in the West Coast region of the United States recorded Mac &Devin Go to High School with Wiz Khalifa?",
        "response": "Snoop Dogg",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American professional soccer team based in Florida plays their home games at Central Broward Regional Park and Stadium?",
        "response": "Fort Lauderdale Strikers",
        "source": "hotpot_qa"
    },
    {
        "query": "David Robert Mitchell is the director of the project slated to star the British-American actor born in what city?",
        "response": "Los Angeles",
        "source": "hotpot_qa"
    },
    {
        "query": "Which tennis player won more Grand Slam titles, Henri Leconte or Jonathan Stark?",
        "response": "Jonathan Stark",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Baltasar Kormákur and John G. Avildsen both film producers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Country Music Hall of Fame artist known for his song \"Crazy Arms\" also found success with what female artist on their recording titled \"Release Me\"?",
        "response": "Patti Page",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Bangor International Airport or Dayton International Airport contained respectivel in Maine and Ohio?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "In what country can both Oplismenus and Aerangis.be found to be growing?",
        "response": "Africa",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Mike Figgis and Patrick Rea directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle, that resulted in the death of Selyf Sarffgadau and Cadwal Crysban, did the Synod of Chester contribute to starting?",
        "response": "Battle of Chester",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the lead actor of Bollywood Queen make his acting debut?",
        "response": "1995",
        "source": "hotpot_qa"
    },
    {
        "query": "Possum Trot Church was built around 1850 in Rome, Georgia, United States, and was appropriated by Martha Berry as a Sunday school in 1900. the school grew to become which private, four-year liberal arts college with a Christian emphasis located in Mount Berry, Floyd County, Georgia, United States, just north of Rome?",
        "response": "Berry College",
        "source": "hotpot_qa"
    },
    {
        "query": "Jacques-Louis was a founding member of the geological society before returning to France after what period of French history that followed the fall of Napoleon in 1814 until the July revolution of what year?",
        "response": "1830",
        "source": "hotpot_qa"
    },
    {
        "query": "The co-founder, lead singer, and keyboardist of the band Steely Dan, as well as composer of the song \"Show Biz Kids\" was born when?",
        "response": "January 10, 1948",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ugandan political leader was responsible for the murder of Erinayo Wilson Oryema?",
        "response": "Idi Amin Dada",
        "source": "hotpot_qa"
    },
    {
        "query": "Lepidium arbuscula is a rare species of flowering plant in the mustard family known by the common names `anaunau and Waianae Range pepperwort, it is endemic to Hawaii, where it is known only from the Waianae Mountains on the island of Oahu, Hawaii (  Hawaiian ) is the 50th and most recent state to have joined the United States of America, having received statehood on which date?",
        "response": "August 21, 1959",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first name of the person who recorded the size of the Brigantia territory in the 2nd century AD?",
        "response": "Claudius",
        "source": "hotpot_qa"
    },
    {
        "query": "Were the films \"Those Calloways\" and \"Around the World in 80 Days\" released in the same year?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What example of a venue with strippers to provide adult entertainment could be found in what neighborhood in New York City?",
        "response": "Chelsea neighborhood",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Egyptian deity did Sumerian Records American deathcore band reference in their album title?",
        "response": "Osiris",
        "source": "hotpot_qa"
    },
    {
        "query": "What American country music singer-songwriter, born in May of 1942, sang a duet with her ex-husband the same year that he released the song \"The Battle?\"",
        "response": "Tammy Wynette",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Amir\" entered English in 1593 as one of the titles or names of the founder of Islam who is viewed as what?",
        "response": "the final prophet of God",
        "source": "hotpot_qa"
    },
    {
        "query": "Does Lüliang or Fuxin have a larger population?",
        "response": "Lüliang",
        "source": "hotpot_qa"
    },
    {
        "query": "Have Guy Maddin and Mel Brooks both been directors?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Superbowl featured Jack Maitland and was the first to be played on artificial turf?",
        "response": "Super Bowl V",
        "source": "hotpot_qa"
    },
    {
        "query": "Which track from All Shall Perish's third studio album \"Awaken the Dreamers\" contains lyrics that reference songs by the American heavy metal band from Huntington Park, California, formed in 1981 by guitarists Kerry King and Jeff Hanneman? ",
        "response": "\"Songs for the Damned\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is this controversial Canadian-born American whose frank memoirs helped usher in the confessional style of autobiographical writing and whose disciple became a topic of James G. Kiernan's writing?",
        "response": "Mary MacLane",
        "source": "hotpot_qa"
    },
    {
        "query": "Lucifer Box was created by which English actor?",
        "response": "Mark Gatiss",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the starting quarterback for Penn State Nittany Lions football team who resulted in Terrelle Pryor being benched?",
        "response": "Matt McGloin",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of sport does Heisman curse and Jason White have in common?",
        "response": "football",
        "source": "hotpot_qa"
    },
    {
        "query": "The vocalist/bassist from an American punk rock band, formed in Los Angeles in 1977, among the first wave of American punk performed in a show with an American rock trio, formed in 1993,in what user did the latter band contribute a cover version of the Psychedelic Furs 'Pretty in Pink'?",
        "response": "1996",
        "source": "hotpot_qa"
    },
    {
        "query": "What series does the American character actor best-known for playing General Hammond star in the first episode?",
        "response": "Twin Peaks",
        "source": "hotpot_qa"
    },
    {
        "query": "What British musical act had a number one hit in 1997 in the UK and recorded all the tracks on their debut album on an 8-track recorder?",
        "response": "White Town",
        "source": "hotpot_qa"
    },
    {
        "query": "What Wiccan teaching coven is based out of a local government area (LGA) located on the southern fringe of Adelaide, South Australia?",
        "response": "The Circle of Oak and Mistletoe",
        "source": "hotpot_qa"
    },
    {
        "query": "An icelandic professional strongman plays a character nicknamed \"The Mountain\" in what series of novels?",
        "response": "A Song of Ice and Fire",
        "source": "hotpot_qa"
    },
    {
        "query": "For which state did this American politician serve as senator whose logo morphing from the apple logo was featured in \"Hillary 1984?\"",
        "response": "Illinois",
        "source": "hotpot_qa"
    },
    {
        "query": "In what type of magazines was one of the victims of Charles Manson and his \"Family\" (the other being LaBianca) featured?",
        "response": "fashion magazines",
        "source": "hotpot_qa"
    },
    {
        "query": "Which show is is directed by the same people who were presenters for the Holy Trinity?",
        "response": "W. Chump and Sons",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Jongsong Peak and Broad Peak, which mountain is higher?",
        "response": "Broad Peak",
        "source": "hotpot_qa"
    },
    {
        "query": "This actress stars in the 2015 series The Menu Who was the second runner-up in 1990 in what?",
        "response": "Miss Hong Kong",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the HMS Dreadnought?",
        "response": "battleship",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university offers more majors, University of South Florida or Ural Federal University?",
        "response": "Ural Federal University",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the record label that both Rihanna's albums from 2006 and 2008 were released under?",
        "response": "Def Jam Recordings",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the founding lead guitarist in the band whose single was used with \"Bridge over Troubled Water\" to create the charity single \"A Bridge over You\"?",
        "response": "Jonny Buckland",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie starring Lucy Hale and American film and television actress, best known for her role as Jesse Quick in The CW's \"The Flash\"?",
        "response": "Jeff Wadlow",
        "source": "hotpot_qa"
    },
    {
        "query": "The Deer Isle Bridge encountered wind stability problems that were similar to a bridge found in which U.S. state?",
        "response": "Washington",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the father of Elizabeth Capell, Countess of Essex born?",
        "response": "1602",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the title of the initial novella in Clive Barker's horror franchise that feautures a character named 'Butterball'?",
        "response": "\"The Hellbound Heart\"",
        "source": "hotpot_qa"
    },
    {
        "query": "How many games did Mel Tucker replace Jack Del Rio for?",
        "response": "five games",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Danny Elfman and Darius Rucker both members of Hootie & the Blowfish?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "The battle in which Giuseppe Arimondi lost his life secured what for Ethiopia?",
        "response": "sovereignty",
        "source": "hotpot_qa"
    },
    {
        "query": "The Battle of Bardia included explosive charges that are placed in what kind of connected housings?",
        "response": "tubes",
        "source": "hotpot_qa"
    },
    {
        "query": "In \"The Simpsons\" fourteenth episode of season nine, what 1954 novel did they have an extended parody on? ",
        "response": "Lord of the Flies",
        "source": "hotpot_qa"
    },
    {
        "query": "Bad Meets Evil was a duo that formed because of a mutual friend from what city?",
        "response": "Detroit",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Proud Twins is a singer, songwriter, actor and entrepreneur?",
        "response": "Nicholas Tse",
        "source": "hotpot_qa"
    },
    {
        "query": "What convenient store impemented by a Norwegian and Danish gas station chain was known as Tote'm Stores until renamed in 1946?",
        "response": "7-Eleven",
        "source": "hotpot_qa"
    },
    {
        "query": "Which English actor and director who was involved with the 1997 film The Winter Guest also appeared in \"Die Hard\"?",
        "response": "Alan Rickman",
        "source": "hotpot_qa"
    },
    {
        "query": "Who plays the drums on the band that released \"Barrel of Batteries\" in 2008?",
        "response": "Charlie Hall",
        "source": "hotpot_qa"
    },
    {
        "query": "Worker: What are Marsh v. Chambers and Planned Parenthood v. Casey known for being?",
        "response": "Supreme Court case",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is more than just a film director, Gene Kelly or Yannis Smaragdis?",
        "response": "Eugene Curran Kelly (August 23, 1912 – February 2, 1996) was an American dancer, actor of film, stage and television, singer, film director, producer, and choreographer.",
        "source": "hotpot_qa"
    },
    {
        "query": "How many people of staff does the college where Craig D. Heyer played have?",
        "response": "2900",
        "source": "hotpot_qa"
    },
    {
        "query": "The Lottery is a 1989 American short film starring Bette Midler, which was shown at the then Disney-MGM Studios in line for the first versions of the Studio Backlot Tour was a theme park attraction at Disney's Hollywood Studios theme park at the Walt Disney World Resort in Lake Buena Vista, in which state? ",
        "response": "Florida",
        "source": "hotpot_qa"
    },
    {
        "query": "Which airport's code is CMH, John Glenn Columbus International Airport or University Park Airport?",
        "response": "John Glenn Columbus International Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did the battle that Merzifonlu Kara Mustafa Pasha participated in take place?",
        "response": "Kahlenberg Mountain",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the ranking among pharmacy schools in 2015 for the college to which Pharmaceutical Research Institute is associated?",
        "response": "58th-ranked",
        "source": "hotpot_qa"
    },
    {
        "query": "In which state's mountain region lay the famous peak that inspired the bestselling novel \"Cold Mountain?\"",
        "response": "North Carolina",
        "source": "hotpot_qa"
    },
    {
        "query": "Sehnsucht Tour is the second concert tour by a German Industrial Metal band that formed in which city ?",
        "response": "Berlin",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the studio analyst win the Southwest Conference with the Texas A&M football team?",
        "response": "1985",
        "source": "hotpot_qa"
    },
    {
        "query": "Jamael Orondé \"Rondé\" Barber (born April 7, 1975) is a former American football cornerback and safety who spent his entire 16-year career playing for the Tampa Bay Buccaneers of the NFL, the twin brother of which former American football running back who played for the New York Giants, for ten seasons?",
        "response": "Atiib Kiambu Hakeem-Ah \"Tiki\" Barber",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Lieutenant Governor of California issued proclamations for \"Exotic Erotic Ball Day\" in San Francisco? ",
        "response": "Gavin Newsom",
        "source": "hotpot_qa"
    },
    {
        "query": "Death of a Gentleman is a 2015 documentary about the takeover of the governance of cricket by ICC's 'Big Three', features interviews with which English cricket broadcaster and a former professional cricketer?",
        "response": "Jonathan Agnew",
        "source": "hotpot_qa"
    },
    {
        "query": "Which commander of the Republic of Texas is played by Laurence Harvey in The Alamo?",
        "response": "William B. Travis",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the 19th century foundry which was located in a village directly across the Hudson River from Westpoint in Putnam County, New York?",
        "response": "West Point Iron and Cannon Foundry",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the coach of the opposing team which beat the German football club, based out of Leipzig, in the 1986-87 European Cup Winners' Cup?",
        "response": "Johan Cruyff",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor in Holding the Fort is also known for being a television presenter for shows \"Game for a Laugh\", \"You Bet!\" and \"Stars in Their Eyes\"?",
        "response": "Matthew Kelly",
        "source": "hotpot_qa"
    },
    {
        "query": "Which takes place farther east, The Mosuo Sisters or The Silent Historian?",
        "response": "The Mosuo Sisters",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote one of Jaume Collet-Serra's action-thrillers?",
        "response": "Byron Willinger and Philip",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of home entertainment media are Tonka and Meet the Robinsons?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Xi'an International Studies University (XISU), is a public Chinese university, located in the northwestern city of Xi'an, China's ancient capital well known for the Terracotta Warriors, the Terracotta Army, is a collection of terracotta sculptures, depicting the armies of Qin Shi Huang, the first Emperor of which country?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine had a greater number of founders, Honey or Girlfriends?",
        "response": "Girlfriends",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actress was named the seventh-greatest female screen legend by the American Film Institute and said \"art lives on forever\" at an AIDS benefit?",
        "response": "Elizabeth Taylor",
        "source": "hotpot_qa"
    },
    {
        "query": " Alvord Wolff was an American football player who played for a private Jesuit university founded in what year?",
        "response": "1851",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Tim Kaine and Aneesh Chopra have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "What Michigan city was the band that released \"Live at Bell's\" founded in?",
        "response": "Kalamazoo",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the fourth son of the lord of the Seventeen Provinces of the Netherlands in 1555?",
        "response": "Diego Félix of Austria",
        "source": "hotpot_qa"
    },
    {
        "query": "Which station airs The Shareef Show Mubarak Ho hosted by Umer Shareef?",
        "response": "Geo TV",
        "source": "hotpot_qa"
    },
    {
        "query": "Chas Early is best known for portraying a comedian born in what year?",
        "response": "1961",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does The Santa Clause 3: The Escape Clause and The Castaway Cowboy have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the animated Disney film, released in 1959, that underperformed at the box office and stared a voice actress who also performed in an earlier animated Disney film in the same decade?",
        "response": "Sleeping Beauty",
        "source": "hotpot_qa"
    },
    {
        "query": "What Maeken Trance Project song rendition is sung in Romanian?",
        "response": "Dragostea Din Tei.",
        "source": "hotpot_qa"
    },
    {
        "query": " Marine Day was established by what law?",
        "response": "Public Holiday Law",
        "source": "hotpot_qa"
    },
    {
        "query": "The first railway in British North America, the Champlain and St. Lawrence Railroad, was built when to track gauge, However the promoters of St. Lawrence and Atlantic Railroad, (intended to connect Montreal to the ice-free port at Portland, Maine) decided to use , setting a precedent for the colony for several decades, The St. Lawrence and Atlantic Railroad (reporting mark SLR) , known as St-Laurent et Atlantique Quebec (reporting mark SLQ) in Canada, is a short line railway operating between Portland, Maine, on the Atlantic Ocean and Montreal, Quebec, on the St. Lawrence River?",
        "response": "mid-1830s",
        "source": "hotpot_qa"
    },
    {
        "query": "The Central Coast including the suburb of Palmdale is located on what sea's coast?",
        "response": "Tasman Sea",
        "source": "hotpot_qa"
    },
    {
        "query": "The president of the Alabama Christian Movement for Human Rights from 1956 to 1969 helped who during the Civil Rights movement?",
        "response": "Martin Luther King Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Rapper Max B. had a falling out with the founder of ByrdGang Records, who also directed music videos under what pseudonym?",
        "response": "CAPO",
        "source": "hotpot_qa"
    },
    {
        "query": " Who was born first Ryan Murphy or Lois Weber?",
        "response": "Lois Weber",
        "source": "hotpot_qa"
    },
    {
        "query": "What rapper featured in Hot 100 song on the album released by Beyonce during the Destiny's Child hiatus?",
        "response": "Jay-Z",
        "source": "hotpot_qa"
    },
    {
        "query": "What year was the mvoie Three Violent People made?",
        "response": "1957",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Hairspray and Zac Efron have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1983 film did the director of Baby Geniuses write the script for?",
        "response": "A Christmas Story",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Hocus Pocus and Ten Who Dared have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "The female heptathlon competitor who medaled at the 2004 Commonwealth Youth Games is also the 2010 world indoor champion in what event?",
        "response": "pentathlon",
        "source": "hotpot_qa"
    },
    {
        "query": "Nubuke Foundation is an art foundation in East Legon, a town in the Accra Metropolitan district, a district of the Greater Accra Region of which country?",
        "response": "Ghana",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Gerry Kissell Or Dale Dye?",
        "response": "Dale Dye",
        "source": "hotpot_qa"
    },
    {
        "query": "Which computer was released first, the Orao or the Mattel Aquarius?",
        "response": "Aquarius",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film in which James Durham had a minor part ?",
        "response": "Jonas Elmer",
        "source": "hotpot_qa"
    },
    {
        "query": "How many words was the short story for which Forerunner was best known? ",
        "response": "6,000-word",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of animal served under Sir Edward Richard George Heath to catch mice?",
        "response": "cat",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1993–94 NBA season was the 6th season for the Charlotte Hornets in which organization, the team would soon struggle as Larry Johnson injured his back?",
        "response": "National Basketball Association",
        "source": "hotpot_qa"
    },
    {
        "query": "Which battle took place first, the Battle of Stones River or the Battle of the Bulge?",
        "response": "Battle of Stones River",
        "source": "hotpot_qa"
    },
    {
        "query": "For what NBC sketch comedy is the creator of 30 Rock best known?",
        "response": "\"Saturday Night Live\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which single seater auto-racing formula did 1977 Can-Am season series used",
        "response": "Formula 5000",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer is from the US, Paul Meany or Floor Jansen?",
        "response": "Paul Meany",
        "source": "hotpot_qa"
    },
    {
        "query": "Pietà or Revolution by Night is a painting by an artist that died in what year?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "What pop standard written by Bobby Scott and Ric Marlow is on an album by American pop singer Johnny Mathis?",
        "response": "A Taste of Honey",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality was the man who finished second in the 1985 British Grand Prix?",
        "response": "Italian",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American football tight end for the New England Patriots was featured on Madden NFL 18?",
        "response": "Rob Gronkowski",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the boxing promotion company which Floyd Mayweather, Jr exercising a provision in his contract",
        "response": "Muhammad and Bob Arum",
        "source": "hotpot_qa"
    },
    {
        "query": "Ho Iat Seng  is a member of a legislative assembly that has how many members ?",
        "response": "33-member",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Seattle-based rock band only has one remaining member and released the song Fell on Black Days in 1997?",
        "response": "Soundgarden",
        "source": "hotpot_qa"
    },
    {
        "query": "Zongo Comics was founded by the cartoonist and writer of what nationality?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the movie in which Amr Waked played Pierre Del Rio?",
        "response": "Virginie Besson-Silla",
        "source": "hotpot_qa"
    },
    {
        "query": "What were the years of operation of the mine that a novel group of acidophilic archaea found at?",
        "response": "1860s until 1963",
        "source": "hotpot_qa"
    },
    {
        "query": "Cypress and Baumea, are types of a woody perennial plant?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the chief executive officer (CEO) of GlaxoSmithKline born to whom  Deirdre Connelly reported to?",
        "response": "22 August 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "What posthumous collection of essays by William Gaddis was published at the same time as Gaddis's last novel ublished posthumously in 2002 by Viking?",
        "response": "The Rush for Second Place",
        "source": "hotpot_qa"
    },
    {
        "query": "Are tennis players Corina Morariu and Mats Wilander from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Packaging Corporation of America and Hologic both involved in development of medical imaging systems?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the full name of the Magic Mike XXL star that had a recurring role in the NBC television series \"Chuck\"?",
        "response": "Matthew Staton Bomer",
        "source": "hotpot_qa"
    },
    {
        "query": "Which fil directed by Brian Percival is about a young girl living with her adoptive German family dua?ing the Nazi err",
        "response": "The Book Thief",
        "source": "hotpot_qa"
    },
    {
        "query": "Battle of Logiebride took place among the Bain family that inhabited the castle in what Scottish town?",
        "response": "Dingwall",
        "source": "hotpot_qa"
    },
    {
        "query": "How many books are in the Stephen King series of which Roland Deschain of Gilead is the protagonist?",
        "response": "eight",
        "source": "hotpot_qa"
    },
    {
        "query": "David Hawker is a member of the Australian House of Representatives from the major party founded in what year?",
        "response": "1945",
        "source": "hotpot_qa"
    },
    {
        "query": " The El Hadj Hassan Gouled Aptidon Stadium is located in a country with a total area of how many square miles ?",
        "response": "8958 sqmi",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jeff Martin and Charlie Dominici both considered singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the brewery that owns the 2009 Grand National's sponsorship?",
        "response": "John Smith's Brewery",
        "source": "hotpot_qa"
    },
    {
        "query": "What kind of Dog is a hunting dog breed developed in Bosnia, Bosnian Coarse-haired Hound or Bouvier des Flandres?",
        "response": "Bosnian Coarse-haired Hound",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the director of the film where Hailee Steinfeld starred as Zooey Renner?",
        "response": "McG",
        "source": "hotpot_qa"
    },
    {
        "query": "When did Cassius Marcellus Clay fight against Elmo Henderson?",
        "response": "1972",
        "source": "hotpot_qa"
    },
    {
        "query": "Seoul Train and Making North America are both films in what style of cinema or film making genre?",
        "response": "documentary",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Jonas Mekas and Marcel Duchamp both filmmakers?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a composer of an opera that Anton van Rooy appeared in?",
        "response": "Richard Wagner",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was Audrey Williams pregnant with during the recording of \"Dear Brother\"?",
        "response": "Hank Williams, Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is from farther east,  Brett Hestla or Tim Wheeler?",
        "response": "Tim Wheeler",
        "source": "hotpot_qa"
    },
    {
        "query": "Do John Carl Buechler and Mikhail Romm share the same nationality?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Hellhammer was a Swiss extreme metal band from Nurensdorf, active during 1981–1984, in June 1984, Hellhammer disbanded and founded another highly influential band, which Swiss heavy metal band, from Zürich?",
        "response": "Celtic Frost",
        "source": "hotpot_qa"
    },
    {
        "query": "What series did the author of Teenage Mutant Ninja Turtles co-create with Jim Lawson?",
        "response": "Planet Racers",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the American explorer which was accompanied by Lake Sacajawea during their exploration of the American West born?",
        "response": "August 18, 1774",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1952 comedy-drama film did American cinematographer Karl Struss work on?",
        "response": "Limelight",
        "source": "hotpot_qa"
    }
]