[
    {
        "query": "What city features an exhibit on Laurence Madin's work on salps?",
        "response": "Boston, Massachusetts",
        "source": "hotpot_qa"
    },
    {
        "query": " Which game, Löwenherz or Sentinels of the Multiverse, was created first?",
        "response": "Löwenherz",
        "source": "hotpot_qa"
    },
    {
        "query": "Kerry Ellis Sings the Great British Songbook was the first set of solo concerts by English stage actress and singer Kerry Ellis, it included an encore with which English musician, singer, songwriter and astrophysicist, best known as the lead guitarist of the rock band Queen?",
        "response": "Brian Harold May",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Ghanaian footballer who graduated from the SC Bastia Reserves and Academy born?",
        "response": "1982",
        "source": "hotpot_qa"
    },
    {
        "query": "Chadwick Lee \"Chad\" Bradford a former MLB pitcher, was in which Michael Lewis book?",
        "response": "Moneyball",
        "source": "hotpot_qa"
    },
    {
        "query": "Fawad Siddiqui was in a George Clooney film alongside a Scottish actor born in what year?",
        "response": "1971",
        "source": "hotpot_qa"
    },
    {
        "query": "Jigoku-Retsuden was a CD released by the album that included the musician who was the former lead-guitarist for what other band?",
        "response": "Black 'n Blue",
        "source": "hotpot_qa"
    },
    {
        "query": "What local government area was Nick Bromley born in?",
        "response": "Central Coast Council",
        "source": "hotpot_qa"
    },
    {
        "query": "Randy Jackson has been inducted into both the Louisiana Music Hall of Fame and Long Island Music Hall of Fame. Where is the Long Island Music Hall of Fame located?",
        "response": "Melville, New York",
        "source": "hotpot_qa"
    },
    {
        "query": "Thomas DeCarlo Callaway was on a song with Ludacris and Trick daddy, Produced by who?",
        "response": "Mike Caren",
        "source": "hotpot_qa"
    },
    {
        "query": "Which famous comic book movie universe features the voice of an Irish-American actor who previously did work on \"Agents of S.H.I.E.L.D\"?",
        "response": "DC",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Choisya and Oenothera endemic to the Americas ?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "Czechoslovakian Wolfdog and Kromfohrländer, are which type of animal?",
        "response": "dog",
        "source": "hotpot_qa"
    },
    {
        "query": "Who will direct the upcoming adaptation of the first of four novels in Philip Reeve's quartet of novels?",
        "response": "Christian Rivers",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was native to a country farther west, Ricardo Costa or Franco Rossi?",
        "response": "Ricardo Costa",
        "source": "hotpot_qa"
    },
    {
        "query": "The 48th annual Berlin International Film Festival was held from February 11 to 22, 1998, the festival opened with the Irish film \"The Boxer\" by who?",
        "response": "Jim Sheridan",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2012–13 FC Sion season saw the signing of which now-manager of AC Milan Primavera?",
        "response": "Gennaro Ivan \"Rino\" Gattuso",
        "source": "hotpot_qa"
    },
    {
        "query": "Günter Reich interpreted the works of Schoenberg with which French composer?",
        "response": "Pierre Louis Joseph Boulez CBE",
        "source": "hotpot_qa"
    },
    {
        "query": " Adrienne Maloof is an American businesswoman whose family name is of what descent?",
        "response": "Lebanese",
        "source": "hotpot_qa"
    },
    {
        "query": "Which actor played the physically abusive teacher in a 2001 highest grossing film?",
        "response": "Kim Kwang-kyu",
        "source": "hotpot_qa"
    },
    {
        "query": "James Watt was a Northern Irish loyalist for which paramilitary group?",
        "response": "The Ulster Volunteer Force",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Akim Tamiroff and Robert Nalbandyan both Armenian?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the profession of the daughter of the founder of Tesco",
        "response": "politician",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Dee Dee Ramone and Steve Augeri both singers?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "The Blind Side is an American biographical sports drama film, released in which year, the storyline features Michael Oher, an American football offensive tackle who is currently a free agent?",
        "response": "2009",
        "source": "hotpot_qa"
    },
    {
        "query": "Were both Martin Adams and Sid Haig American actors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "An analog board was used in which third model of the Macintosh line?",
        "response": "Macintosh Plus",
        "source": "hotpot_qa"
    },
    {
        "query": "Stuart Smalley is a fictional character invented and performed by comedian and satirist (and later United States Senator from Minnesota) who is this American writer, comedian, and politician? ",
        "response": "Alan Stuart \"Al\" Franken",
        "source": "hotpot_qa"
    },
    {
        "query": "The DUX-53 and DUX-59 were submachine guns designed at the Oviedo Arsenal in which country, a large number of these weapons were produced for the West German Border Guard, and was later licensed to be produced by Anschütz and Mauser, a German arms manufacturer?",
        "response": "Spain",
        "source": "hotpot_qa"
    },
    {
        "query": "Erika Rosenberg is an author, interpreter and journalist, who wrote a biography about a Sudeten German-born woman who helped to save the lives of how many Jews during World War II?",
        "response": "1,200 to 1,700",
        "source": "hotpot_qa"
    },
    {
        "query": "What 2009 Chinese-Korean film resulted in a 2013 prequel called My Lucky Star which featured many of the same actors/actresses?",
        "response": "Sophie's Revenge",
        "source": "hotpot_qa"
    },
    {
        "query": "What sovereign country is home to Imi Mqourn?",
        "response": "Morocco",
        "source": "hotpot_qa"
    },
    {
        "query": "OTWGBEATS is better known for his work with the American rapper from what city?",
        "response": "Chicago",
        "source": "hotpot_qa"
    },
    {
        "query": "Mapes Hotel is next to what river that flows northeasterly and is 121 mi long",
        "response": "Truckee River",
        "source": "hotpot_qa"
    },
    {
        "query": "The actor that played Kevin McCallister in \"Home Alone\" was a member of what New York City rock band?",
        "response": "The Pizza Underground",
        "source": "hotpot_qa"
    },
    {
        "query": "Fever Pitch was the final film for the director who shot the film based on the non-fiction novel by whom?",
        "response": "Truman Capote",
        "source": "hotpot_qa"
    },
    {
        "query": "Grand Duke George Mikhailovich of Russia is the heir apparent to a Duchess born in which city ?",
        "response": "Madrid",
        "source": "hotpot_qa"
    },
    {
        "query": "Lasse Hallström  is a director, but Michael Pressman is a director and what?",
        "response": "producer",
        "source": "hotpot_qa"
    },
    {
        "query": "Did both H. Bruce Humberstone and Michael Haneke work on the 1997 film \"Funny Games?\"",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Girl in the Headlines, is a 1963 British detective film directed by Michael Truman, and includes Jeremy Brett, he was an English actor, probably best known for playing fictional detective Sherlock Holmes in four Granada TV series from 1984 to 1994 in all of which number episodes?",
        "response": "41",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was released first, Saint Petersburg or Figure It Out?",
        "response": "Figure It Out",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was a Canadian producer, Melville Shavelson or Armand Schaefer?",
        "response": "Armand Schaefer",
        "source": "hotpot_qa"
    },
    {
        "query": "ISO 3166-1 alpha-2 is a widely used country code system, along with what three-letter system?",
        "response": "ISO 3166-1 alpha-3",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rocketeer and Toby Tyler, are made by which mutual, affiliated organization?",
        "response": "Walt Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "How many impromptu locations did Paul McCartney go to promote his fourteenth solo album?",
        "response": "six",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Lysiloma and Peltophorum large tree species?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which university was founded earlier, Lehigh University or University of Iowa?",
        "response": "University of Iowa",
        "source": "hotpot_qa"
    },
    {
        "query": "The novel, \"The Paris Wife\" is the fictional account a marriage that occured in what year?",
        "response": "1921",
        "source": "hotpot_qa"
    },
    {
        "query": "when was the right which  Marvin Worth purchased published ",
        "response": "1965,",
        "source": "hotpot_qa"
    },
    {
        "query": "Who founded the network on whhich Top Model po-russki aired?",
        "response": "Sergey Lisovskiy",
        "source": "hotpot_qa"
    },
    {
        "query": "Marie Kremer is in the 2005 French thriller directed by whom?",
        "response": "Michael Haneke",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media do Janusz Nasfeter and Zack Snyder both work with?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following is related to the east Asian Chaenomeles: Wulfenia or Pseudocydonia?",
        "response": "Pseudocydonia",
        "source": "hotpot_qa"
    },
    {
        "query": "Of which nationality is the guide book that has awarded chef Christian Le Squer with three stars?",
        "response": "French",
        "source": "hotpot_qa"
    },
    {
        "query": "In 2008, the fourth Malaysian player to achieve the #1 ranking also won a silver medal at the 2008 Olympics in which respective sport?",
        "response": "badminton",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the best known novel by the author whose work was the basis for the French film Thomas the Impostor? ",
        "response": "Les Enfants Terribles",
        "source": "hotpot_qa"
    },
    {
        "query": "Many a carnival sideshow and Penny arcade contained what type of amusement?",
        "response": "Fortune teller machine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which board game was introduced first, Aladdin's Dragons or CirKis?",
        "response": "Aladdin's Dragons",
        "source": "hotpot_qa"
    },
    {
        "query": "The Mississipi River borders what state that suffered $500-700 million in damages during the 1979 Easter Flood?",
        "response": "Mississippi",
        "source": "hotpot_qa"
    },
    {
        "query": "What Good-bye Cruel World star was born January 2, 1954?",
        "response": "Cynthia Lee Sikes",
        "source": "hotpot_qa"
    },
    {
        "query": "What city did Yasmin Giger compete in at the 2017 World Championships?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was created by an Australian, Man with a Movie Camera or Black Chicks Talking?",
        "response": "Black Chicks Talking",
        "source": "hotpot_qa"
    },
    {
        "query": "From which country hails the film director, who co-wrote 'Welcome to Dongmakgol' the 2005 critical and commercial hit?",
        "response": "South Korea",
        "source": "hotpot_qa"
    },
    {
        "query": "In which American reality television series airing on the History channel  Koker and his staff follows as they restore and modify classic automobiles and motorcycles?",
        "response": "American Restoration",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Presbyterian University College and Baylor University have in common",
        "response": "partially private & public university",
        "source": "hotpot_qa"
    },
    {
        "query": "Which film was filmed first, Mysterious Castles of Clay or London Can Take It!?",
        "response": "London Can Take It!",
        "source": "hotpot_qa"
    },
    {
        "query": "Kevin John Ufuoma Akpoguma played as a centre back for a football team that is based in what German municipality?",
        "response": "Sinsheim municipality",
        "source": "hotpot_qa"
    },
    {
        "query": "What nationality are both William C. deMille and Andrew Stanton?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In which Olympics is the American long-distance runner, Harry Smith, and father of Canadian Hart wrestling family matriarch Helen Hart, a family with a significant history in professional wrestling, noted for?",
        "response": "1912 Olympics in Stockholm",
        "source": "hotpot_qa"
    },
    {
        "query": "The secret agent in \"High Time to Kill\" was created in what year?",
        "response": "1953",
        "source": "hotpot_qa"
    },
    {
        "query": "Andrews Outlier is an Ancestral Puebloan archeological site south of a park containing the most sweeping collection of ancient ruins north of where?",
        "response": "Mexico",
        "source": "hotpot_qa"
    },
    {
        "query": "which Indian state-owned International banking and financial services company has  Central Bank of India has a  joint venture with",
        "response": "Bank of Baroda",
        "source": "hotpot_qa"
    },
    {
        "query": "Where was the actor who played the role of the Creeper in a 1946 American horror thriller film born?",
        "response": "Hagerstown, Maryland",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Roddy Woomble and Tom Fletcher, who had more diverse job experiences?",
        "response": "Thomas \"Tom\" Michael Fletcher",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Xavier Malisse and Jana Novotná from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the stadium at which 1964 Georgia Tech Yellow Jackets football team played their home game located? ",
        "response": "North Avenue at Techwood Drive",
        "source": "hotpot_qa"
    },
    {
        "query": "Who most notably played the spokeswoman for the brand that makes Fruit by the Foot?",
        "response": "Adelaide Hawley Cumming",
        "source": "hotpot_qa"
    },
    {
        "query": "Name the King of Wessex from 839 to 858 whose father, King Egbert, defeated Beornwulf of Mercia and who himself led the Battle of Aclea between the West Saxons and the Danish Vikings?",
        "response": "Æthelwulf",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was American professional basketball player Jason Paul Collins drafted onto the Houston Rockets?",
        "response": "Houston",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the birthdate of this Indian nationalist whose defiant patriotism made him a hero in India and for which Netaju Bhawan was maintained as a memorial to him?",
        "response": "23 January 1897",
        "source": "hotpot_qa"
    },
    {
        "query": "Michalakis Zambellas is the General Manager of a multinational professional services network headquartered in what city?",
        "response": "London",
        "source": "hotpot_qa"
    },
    {
        "query": "A jazztronica band from Manchester features bass player Sneaky and what visual artist?",
        "response": "Chris Cavetroll Drury",
        "source": "hotpot_qa"
    },
    {
        "query": "One of the natives of Reggiolo was last manager of what German football club?",
        "response": "Bayern Munich",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed Stanley Weiser's Wall Street in 1987?",
        "response": "Oliver Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Hearst Television subsidiary of the Hearst Corporation owns an NBC-affiliated television station located near which supplier of ore?",
        "response": "Sloss Mines",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the head coach of the 2012–13 Kentucky Wildcats men's basketball team born?",
        "response": "1959",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Velvetpark or Shape magazine written more for a lesbian and queer-identified female readership?",
        "response": "Velvetpark",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the headquarters of one of the video game publishers who has had Rebecca Ann Heineman affiliated with it?",
        "response": "Rennes, France",
        "source": "hotpot_qa"
    },
    {
        "query": "What 1993 movie featured the actor of Imperial Japanese Army Major Yamauchi?",
        "response": "Son of the Pink Panther",
        "source": "hotpot_qa"
    },
    {
        "query": "Felice Trojani collaborated with Umberto Nobile on which aircraft that was the first to reach the North Pole?",
        "response": "Norge",
        "source": "hotpot_qa"
    },
    {
        "query": "The album that had \"One\" by Irish rock band U2 was released in which year?",
        "response": "1991",
        "source": "hotpot_qa"
    },
    {
        "query": "This arcade, located near Stockland Glasshouse, was one of the first Victorian buildings in Sydney?",
        "response": "The Strand Arcade",
        "source": "hotpot_qa"
    },
    {
        "query": "1200 Micrograms (also known as 1200 Mics, or 1300 Mics) is a psychedelic trance act from Ibiza, one of the members is which Australian-born musician, and the owner of the United Kingdom record label Tip World?",
        "response": "Raja Ram",
        "source": "hotpot_qa"
    },
    {
        "query": "Electoral district of Bragg currently includes which suburb in the city of Burnside, Adelaide?",
        "response": "Dulwich",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Something There\" is a song written by lyricist Howard Ashman and composer Alan Menken for Walt Disney Pictures 30th animated feature film \"Beauty and the Beast\" (1991), it features which American actor and singer, described at the time of his death as \"one of the last\" bona fide\" leading men of the Broadway musical and global celebrity on television\" and a \"versatile stage and film actor\"?",
        "response": "Jerome Bernard \"Jerry\" Orbach",
        "source": "hotpot_qa"
    },
    {
        "query": "The American Writers Association (AWA) was an organization formed in 1946 in opposition to an attempt to introduce a form of trade unionism for authors, its members included writers such as who, she was an American author and journalist, and only had one novel published during her lifetime, the American Civil War-era novel, \"Gone with the Wind\", for which she won the National Book Award for Most Distinguished Novel of 1936?",
        "response": "Margaret Mitchell",
        "source": "hotpot_qa"
    },
    {
        "query": "Which band has more members, Fine Young Cannibals or Kent?",
        "response": "Kent",
        "source": "hotpot_qa"
    },
    {
        "query": "At which institute did the head coach of the 2012 Wayne State Warriors football team play?",
        "response": "University of Akron",
        "source": "hotpot_qa"
    },
    {
        "query": "Nicole Gordon won a silver medal with Sara Petersen int he women's doubles at a competition held in what city?",
        "response": "Manchester",
        "source": "hotpot_qa"
    },
    {
        "query": "Which author, Claude Simon or Paul Auster, has written books that have been translated into more than forty languages?",
        "response": "Paul Benjamin Auster",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the movie that Olympia Dukakis won an Academy Award for?",
        "response": "Norman Jewison",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of physical activity does Red, White & Crüe and Mike Tyson have in common?",
        "response": "fight",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the indoor arena partly above Manchester Victoria station air rights space where the World Wrestling Federation's No Mercy pay-per-view event took place on May 16, 1999?",
        "response": "Manchester Arena",
        "source": "hotpot_qa"
    },
    {
        "query": "Blue Rhythm features the voice of which animator and voice actor as Mickey Mouse?",
        "response": "Walter Elias Disney",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fearsome Foursome is a fictional supervillain group, appearing in American comic books, it included which  fictional character, a supervillain appearing in American comic books published by Marvel Comics? ",
        "response": "Klaw (Ulysses Klaue)",
        "source": "hotpot_qa"
    },
    {
        "query": "Which genus of plant contains more species, Coronilla or Fascicularia?",
        "response": "Coronilla contains about 20 species of flowering plants",
        "source": "hotpot_qa"
    },
    {
        "query": "Which co-creator of spider-man was born in December of 1922?",
        "response": "Stan Lee",
        "source": "hotpot_qa"
    },
    {
        "query": "Xokonoschtletl Gómora pushed for hte return of what artifact taken during hte Spanish Conquest of the Aztecs?",
        "response": "Montezuma's headdress",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed a 1987 horror film starring an actor known for films such as The Breakfast Club and Trading Places?",
        "response": "Roland Emmerich",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the TV series which showed the episode Nepotism start on NBC ? ",
        "response": "March 24, 2005,",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the second book by the author that won the Booker Prize in 1997?",
        "response": "The Ministry of Utmost Happiness",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine is published more frequently, Donna Moderna or Kotiliesi?",
        "response": "Donna Moderna",
        "source": "hotpot_qa"
    },
    {
        "query": "The South Korean tv series \"Witch's Court\" stars Jung Ryeo-won and an actor that played for what baseball team in 2005?",
        "response": "Hanwha Eagles",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the horror film that stars the same actors as the comedy That One Night?",
        "response": "James Wong",
        "source": "hotpot_qa"
    },
    {
        "query": "What is in Ohio?",
        "response": "plant",
        "source": "hotpot_qa"
    },
    {
        "query": "Which filmmaker would be more likely to produce work with drawings rather than real actors, Jan Švankmajer or Lambert Hillyer",
        "response": "Jan Švankmajer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Naguib Mahfouz or Ilya Ehrenburg?",
        "response": "Ilya Grigoryevich Ehrenburg",
        "source": "hotpot_qa"
    },
    {
        "query": "Elizabeth Cecil, 16th Baroness de Ros Was the granddaughter of who?",
        "response": "Henry Manners",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the name of the debut album of the Hertfordshire-based rock band was signed to record label Infectious Music?",
        "response": "Young for Eternity",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the school that Buck Hunt was the head coach of founded?",
        "response": "1912",
        "source": "hotpot_qa"
    },
    {
        "query": "Who coached the team that defeated the 2011 team led by Everett Withers to end their season?",
        "response": "Gary Pinkel",
        "source": "hotpot_qa"
    },
    {
        "query": "Henri van Gooven's most successful work was the novel Tropenwee, which was similar to a novella by Joseph Conrad, about a voyage up what river?",
        "response": "Congo River",
        "source": "hotpot_qa"
    },
    {
        "query": "What is this description of a pattern of group behaviour towards individuals within Nordic countries that Sharmi Albrechtsen explored in her book A Piece of Danish Happiness?",
        "response": "Law of Jante",
        "source": "hotpot_qa"
    },
    {
        "query": "Which singer produced The Downward Spiral?",
        "response": "Trent Reznor",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of one of the Pendle witches?",
        "response": "Elizabeth Southerns",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Oxford University graduate did Midge Mackenzie interview in \"Women Talking\"?",
        "response": "Kate Millett",
        "source": "hotpot_qa"
    },
    {
        "query": "Partybaby is an American indie rock band from Los Angeles, California, the group was formed by former The Man, guitarist Noah Gersh, Portugal. The Man, is an American rock band from Wasilla, in which U.S. state?",
        "response": "Alaska",
        "source": "hotpot_qa"
    },
    {
        "query": "Which cocktail has apricot brandy as an ingredient, Earthquake or Angel Face?",
        "response": "Angel Face",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Idexx Laboratories and Harris Corporation defense contractors?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Joshua T. Mendell and Victor A. McKusick are both experts in what field of medicine?",
        "response": "genetics",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Gerhart Hauptmann and Piers Anthony both German?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Emily Vance Gordon is best known for her role in what American comedy directed by Michael Showalter?",
        "response": "The Big Sick",
        "source": "hotpot_qa"
    },
    {
        "query": "Stand By Me, famously starring River Phoenix, was a film adapted from a short story called The Body, by which famous author?",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "How many local government districts are there where the London Hockey League is based?",
        "response": "33",
        "source": "hotpot_qa"
    },
    {
        "query": "Highway 64 in the U.S. State of Montana is a route running easterly from the Mountain Village area of which ski resort located in southwestern Montana in Madison County, an hour south of Bozeman via U.S. Highway 191 in Big Sky, Montana?",
        "response": "Big Sky Resort",
        "source": "hotpot_qa"
    },
    {
        "query": "The Strictly the BBC television show featuring the Australian Jason Gilkison is based on what professional partner sport?",
        "response": "ballroom dance",
        "source": "hotpot_qa"
    },
    {
        "query": "Tommy Swerdlow co-wrote the screenplay of what film directed by Jon Turteltaub?",
        "response": "Cool Runnings",
        "source": "hotpot_qa"
    },
    {
        "query": "In what Nickelodeon shown did Todd Talbot star as the role of Matt Walker?",
        "response": "Hillside",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Lance King and Han Seung-yeon both heavy metal vocalists?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the older sister of the Indian actress that starred with Sharan, Vimala Raman and P. Ravi Shankar in the film \"Raja Rajendra\"?",
        "response": "Tanushree Dutta",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the maker of Polaris RMK based?",
        "response": "Roseau, Minnesota, USA",
        "source": "hotpot_qa"
    },
    {
        "query": "The Parish of Bong Bong is a parish of the County of Camden in the Southern Highlands region of New South Wales, which city is located just to the north-west, what's a historic village in the Southern Highlands of New South Wales, Australia, in Wingecarribee Shire?",
        "response": "Berrima",
        "source": "hotpot_qa"
    },
    {
        "query": "What caused the church council to accept funding plans from Mr. Burns in The Simpson's episode in which Lisa converted to Buddhism?",
        "response": "a model rocket",
        "source": "hotpot_qa"
    },
    {
        "query": "Alongside Bob Geldof, who co-wrote the 1984 song written in reaction to television reports of the 1983–85 famine in Ethiopia, which was re-released in 2014 with re-tweaked lyrics to reflect the Ebola virus epidemic in West Africa?",
        "response": "Midge Ure",
        "source": "hotpot_qa"
    },
    {
        "query": "Do both people of Armenian descent, Richard Hagopian and Albert Kapikian, have occupations of the similar nature?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "William Blake Crump directed a movie which was a remake of what?",
        "response": "\"Fährmann Maria\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Which province does this Australian Senator and media personality represent, with whom Alyson Best appeared in a famous photo in \"Playboy?\"",
        "response": "Victoria",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of the cast of The Jungle Captive was born in Maryland?",
        "response": "Rondo Hatton",
        "source": "hotpot_qa"
    },
    {
        "query": "H.R. and Phil Mogg, these people have which common occupation?",
        "response": "lead singer",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Yannis Philippakis or Joel Pott?",
        "response": "Joel Laslett Pott",
        "source": "hotpot_qa"
    },
    {
        "query": "Timothy W. Lake is a news anchor for a television station owned by what media group?",
        "response": "Nexstar Media Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Pakistani cricket umpire who won 3 consecutive ICC umpire of the year awards in 2009, 2010, and 2011 will be in the ICC World Twenty20?",
        "response": "Aleem Sarwar Dar",
        "source": "hotpot_qa"
    },
    {
        "query": "The title of the Ghosts film is a reference to what Cantonese slang term that is used in Cantonese to refer to Westerners, and applies to European ethnicities in its unmodified form.",
        "response": "Gweilo",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the middle name of the star of the upcoming comedy film Night School ?",
        "response": "Darnell",
        "source": "hotpot_qa"
    },
    {
        "query": "Kris Zimmerman Salter, is an American voice and casting director in the animation and video game industry, her major works include which action-adventure stealth video game produced by Konami Computer Entertainment Japan and released for the PlayStation in 1998?",
        "response": "Metal Gear Solid",
        "source": "hotpot_qa"
    },
    {
        "query": "What character from the Simpson's vandalized a school, and who's voice is played by Dan Castellaneta",
        "response": "Barnard \"Barney\" Gumble",
        "source": "hotpot_qa"
    },
    {
        "query": "During the 1990-91 NBA season, one of the injured Spurs was a player who played college basketball for which university?",
        "response": "DePaul University",
        "source": "hotpot_qa"
    },
    {
        "query": "In which six Western European territories have Celtic languages or cultural traits survived?",
        "response": "Brittany, Cornwall, Ireland, Isle of Man, Scotland and Wales.",
        "source": "hotpot_qa"
    },
    {
        "query": "What European production and distribution animation company co-produced Gormiti Nature Unleashed?",
        "response": "Mondo TV",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1991–92 NBA season was the Hawks' 43rd season in the National Basketball Association, and 24th season in Atlanta, with a 22–20 record in late January, which American retired professional basketball player who primarily played for the Atlanta Hawks, ruptured his achilles tendon and was out for the remainder of the season?",
        "response": "Jacques Dominique Wilkins",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the capital city of the country of origin of the famous actor Omar Sharif?",
        "response": "Beirut",
        "source": "hotpot_qa"
    },
    {
        "query": "100 People Who Are Screwing Up America ( Alan Stuart \"Al\" Franken the American writer, comedian, and politician is #37), is a non-fiction book by Bernard Goldberg that was published in which year?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "The double Irish arrangement is a tax strategy, that some multinational corporations used to lower their corporate tax liability, it relies on the fact that Irish tax law does not include transfer pricing rules as does the United States and those of many other jurisdictions, the standard rate of corporation tax is among the lowest in the world at 12.5%, in Ireland there is an income tax, a value added tax (VAT), and various other taxes, is called?",
        "response": "Irish tax law",
        "source": "hotpot_qa"
    },
    {
        "query": "What country of origin does Emma Roberts and Blow have in common?",
        "response": "American",
        "source": "hotpot_qa"
    },
    {
        "query": "In what state is the manufacturer of Honey Nut Clusters headquartered?",
        "response": "Minnesota",
        "source": "hotpot_qa"
    },
    {
        "query": "Bret Stafford played what position on a team that competed in the NCAA Division 1 Football Bowl Subdivision?",
        "response": "quarterback",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Canadian actress and singer, who starred in Life Under Water, born?",
        "response": "June 2, 1950",
        "source": "hotpot_qa"
    },
    {
        "query": "Of Thee I Sing: A Letter to My Daughters is a children's book by former United States President Barack Obama, the stories of thirteen Americans are told in the book, including Jackie Robinson, who was an American professional baseball second baseman who became the first African American, to play in which organization?",
        "response": "Major League Baseball (MLB)",
        "source": "hotpot_qa"
    },
    {
        "query": "Who manages the Spanish team that competes in the biennial UEFA European Under-21 Championship?",
        "response": "Albert Celades López",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Montana county has a county seat with a population of 1,893 at the 2010 census?",
        "response": "Stillwater County, Montana",
        "source": "hotpot_qa"
    },
    {
        "query": "Delhi School of Management was under which university that was formerly known as Delhi College of Engineering?",
        "response": "Delhi Technological University",
        "source": "hotpot_qa"
    },
    {
        "query": "Who created a sculpture two miles from Horse Thief Lake?",
        "response": "Gutzon Borglum",
        "source": "hotpot_qa"
    },
    {
        "query": "This british television film was directed by whom",
        "response": "James Strong",
        "source": "hotpot_qa"
    },
    {
        "query": "Which print magazine company did Terry Richardson work for while he was in Montreal?",
        "response": "Vice Media",
        "source": "hotpot_qa"
    },
    {
        "query": "How large is the Sabden village, which is located in the Ribble Valley, within the non-metropolitan county of Lancashire, England?",
        "response": "The parish is 2,451 acres",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the director of the movie that starred Johnny Depp as constable Ichabod Crane born?",
        "response": "1958",
        "source": "hotpot_qa"
    },
    {
        "query": "Live, is a song and music video composed by Igor Matvienko, how many artists participated in the music video, among them Grigory Leps, a Russian singer-songwriter of Georgian origin?",
        "response": "28",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did Carlos Irwin Estevez appear in The Big Bounce?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "Which brand belongs to the elder brother of the owners of Adidas ?",
        "response": "Puma",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the main training base and college for the land based Irish Army?",
        "response": "The Curragh Camp",
        "source": "hotpot_qa"
    },
    {
        "query": "Berthold Viertel and Tony Scott, share which occupation?",
        "response": "film director",
        "source": "hotpot_qa"
    },
    {
        "query": "When was English singer and songwriter was born who wrote the song Fly on the Wall and was he became the third lead singer of AC/DC?",
        "response": "5 October 1947",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the producer of the original song that was later remade in French into \"Cette année-là\"? ",
        "response": "Bob Gaudio",
        "source": "hotpot_qa"
    },
    {
        "query": "1997 UEFA Champions League Final was held in what country?",
        "response": "Germany",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of David Hayman's mobster role?",
        "response": "Gabriel",
        "source": "hotpot_qa"
    },
    {
        "query": " RuneQuest is a fantasy role-playing game created by a game designer born in what year ?",
        "response": "1946",
        "source": "hotpot_qa"
    },
    {
        "query": "Where in the northernmost and largest freguesia can we find the Communications Museum?",
        "response": "Macau, China",
        "source": "hotpot_qa"
    },
    {
        "query": "Dallas Love Field and William P. Hobby Airport are both located in which state?",
        "response": "Texas",
        "source": "hotpot_qa"
    },
    {
        "query": "To Tulsa and Back is by an artist who is considered one of the originators of what genre?",
        "response": "The Tulsa Sound",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the concert venue which hosted the first US performance of \"Libuše\" located?",
        "response": "Midtown Manhattan in New York City,",
        "source": "hotpot_qa"
    },
    {
        "query": "What did the woman win before her work with the owns ,who gained national fame by appearing on the nationally broadcast CBS/syndicated television series \"Hee Haw\", and also featured the first festival  in Rhinelander, in Oneida County, Wisconsin, United States?",
        "response": "Ladies' Division National Fiddling Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "What actress, who starred the leading role, alongside Lizan Mitchell in Unbreakable Jimmy Schmidt?",
        "response": "Ellie Kemper",
        "source": "hotpot_qa"
    },
    {
        "query": "Who contributes the sole guest verse on Jay-Z's album that includes the song \"Song Cry\"?",
        "response": "Eminem",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the Canadian actress, who starred with Gene Hackman, Jennifer Warren, Melanie Griffith and James Woods in the film \"Night Moves\" born?",
        "response": "1943",
        "source": "hotpot_qa"
    },
    {
        "query": "International Animal Rescue, also known as IAR, is an animal welfare non-profit organization based in the United Kingdom, it specializes in comprehensive sterilization and vaccination programs, and which is the removal of an animal's reproductive organ, either all of it or a considerably large part, for stray dogs and cats, particularly in developing countries?",
        "response": "Neutering",
        "source": "hotpot_qa"
    },
    {
        "query": "Club Paradise Tour followed the release of an album that was released by which record labels ?",
        "response": "Young Money Entertainment, Cash Money Records and Republic Records",
        "source": "hotpot_qa"
    },
    {
        "query": "In which year did Jack Pickersgill serve as Cabinet member for Lester B. Pearson?",
        "response": "1963",
        "source": "hotpot_qa"
    },
    {
        "query": "What album features Clarence Coffee Jr. and has the song \"Dancing in the Dark\" in it?",
        "response": "Home",
        "source": "hotpot_qa"
    },
    {
        "query": "For how many years did a player, who woke up on March 28, 1996 without vision in his right eye, play for the Minnesota Twins?",
        "response": "12",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the area of the country for which Facinet Keita was the flag bearer for the 2012 Summer Olympics?",
        "response": "245,860 km2",
        "source": "hotpot_qa"
    },
    {
        "query": "Little Leaper and the world's oldest rollercoaster are attractions at Lakemont Park in which U.S. state?",
        "response": "Pennsylvania",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Blag Dahlia and Roger Waters English?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Sammy Winward plays Lisa Murdoch in a series first broadcast on what date?",
        "response": "28 April 2014",
        "source": "hotpot_qa"
    },
    {
        "query": "During the war Harry Smith worked at what pharmacy chain located in the United Kingdom, Ireland, Norway, Thailand and other territories?",
        "response": "Boots UK",
        "source": "hotpot_qa"
    },
    {
        "query": "Por Baazar contains a cameo by an Indian film director, screenwriter, producer, actor, playback singer, and television host, who was born to Javed Akhtar and who?",
        "response": "Honey Irani",
        "source": "hotpot_qa"
    },
    {
        "query": "Andre Melendez was a member of a club along with his murderer, what was the name of the club?",
        "response": "Club Kids",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the two writers focus more on religion, Kenneth Grahame or Mircea Eliade?",
        "response": "Mircea Eliade",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the Dutch-British transnational consumer goods company founded in 1886 by William Hesketh Lever along with his brother James?",
        "response": "Unilever",
        "source": "hotpot_qa"
    },
    {
        "query": "Solar Crisis is a 1990 Japanese-American science fiction film, the cast featured which American actor, as Arnold Teague?",
        "response": "Peter Lawrence Boyle",
        "source": "hotpot_qa"
    },
    {
        "query": "Roddy Woomble and Kelli Ali, have which mutual occupation?",
        "response": "singer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the producer of the album \"The Bends\" born? ",
        "response": "28 February 1971",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1992 New Hampshire gubernatorial election was held for what seat?",
        "response": "77th Governor of New Hampshire",
        "source": "hotpot_qa"
    },
    {
        "query": "The Chicago Statement on Biblical Inerrancy a stement on Biblical Imerracy was formulated with an American who was best known for eastblishing what community in Switzerland?",
        "response": "L'Abri community",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Game of Thrones actor also appears in McCanick, a 2013 American Crime-Drama Mystery film?",
        "response": "Ciarán Hinds",
        "source": "hotpot_qa"
    },
    {
        "query": "Who bought a family-owned brewing company that is owned by an Asian brewery company founded as Malayan Breweries Limited?",
        "response": "DB Breweries",
        "source": "hotpot_qa"
    },
    {
        "query": "What sport do Shane Dowrich and Marlon Samuels both play?",
        "response": "cricket",
        "source": "hotpot_qa"
    },
    {
        "query": "Sterling Archer is the titular character and main protagonist of the American animated comedy series \"Archer\", Archer was created by Adam Reed, who began working on the character shortly after the conclusion of which American animated cartoon series created by Adam Reed and Matt Thompson for Adult Swim?",
        "response": "Frisky Dingo",
        "source": "hotpot_qa"
    },
    {
        "query": "What phone series serves as the successor to phones officially unveiled at the \"Samsung Unpacked 2015\" event?",
        "response": "The S7 series",
        "source": "hotpot_qa"
    },
    {
        "query": "James William Keenan was a Major League Baseball catcher who played for a team that joined the National League in what year?",
        "response": "1890",
        "source": "hotpot_qa"
    },
    {
        "query": "Which star of The Secret Garden is an Irish actor and novelist?",
        "response": "John Lynch",
        "source": "hotpot_qa"
    },
    {
        "query": "the episode aired on May 3, 2006",
        "response": "on May 3, 2006",
        "source": "hotpot_qa"
    },
    {
        "query": "The 2009 Montana Grizzlies were coached by what current special teams coach for San Diego State?",
        "response": "Robert Lawrence Hauck",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both American Scientist and The Caribbean Pioneer Science magazines?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Wavves and Jimmy Eat World, are American bands of what type music?",
        "response": "rock",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the Master of Ceremonies, Bert Newton or Michael Joseph Farrell, Jr?",
        "response": "Bert Newton",
        "source": "hotpot_qa"
    },
    {
        "query": "What character was portrayed by Yang Xuwen in a television series adapted from a Novel by Louis Cha and directed by Jeffrey Chiang?",
        "response": "Guo Jing",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the architect who designed the Lincoln Memorial dedicated in 1922?",
        "response": "Henry Bacon",
        "source": "hotpot_qa"
    },
    {
        "query": "Consider the cemetary in which the body of Marshall King is interred. In what year was it established?",
        "response": "1848",
        "source": "hotpot_qa"
    },
    {
        "query": "Between 1929 and which year, he was Vicar of \"St Chrysostom\", Everton and then until 1937 he was Chaplain to the Mercers' Company, A vicar is a representative, deputy or substitute; anyone acting \"in the person of\" or agent for a superior ?",
        "response": "1933",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both The Darling Buds and Shinedown from the same country?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which river runs through the Shenandoah National Park and is a tributary of the Potomac River?",
        "response": "Shenandoah River",
        "source": "hotpot_qa"
    },
    {
        "query": "What job do both Milan Kundera and Alan Furst have in common?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the indirect tax at which Navin Kumar served as the first chairman introduced in India? ",
        "response": "1 July 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "The 1st Alabama Siege Artillery Unit were massacred by Confederate troops under whose command?",
        "response": "Major General Nathan Bedford Forrest",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is was the 50th governor of Indiana and is founder of the Great America Committee?",
        "response": "Mike Pence",
        "source": "hotpot_qa"
    },
    {
        "query": "Adventuredome is located at the casino and RV park located in what city?",
        "response": "Winchester, Nevada",
        "source": "hotpot_qa"
    },
    {
        "query": "VR-62 was originally stationed at which former Navy blimp base?",
        "response": "Naval Air Station South Weymouth",
        "source": "hotpot_qa"
    },
    {
        "query": "In the band ac/dc, which vocalist replaced Bon Scott?",
        "response": "Brian Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "Searpion of Egypt joined the Coptic Orthodox Church which is based where?",
        "response": "Egypt, Northeast Africa and the Middle East",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the middle name of the head coach of the 1976-77 Phoenix Suns team?",
        "response": "Matthew",
        "source": "hotpot_qa"
    },
    {
        "query": "What part of William Shakespeare's career did he write the story that is similar to the story in \"Kuch Tum Kaho Kuch Hum Kahein\"?",
        "response": "early in his career",
        "source": "hotpot_qa"
    },
    {
        "query": "Annie Douglas Richards is a fictional character on a soap opera created by an American film and television producer whose successes included what TV program that ran from 1990-2000?",
        "response": "Beverly Hills, 90210",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Letting Go (Dutty Love)\" is a song by Sean Kingston that samples an electro-Latin song from what album?",
        "response": "Rated R",
        "source": "hotpot_qa"
    },
    {
        "query": "What actor is related to the former CEO of the Nine Network and starred in the 1987 film With Love to the Person Next to Me?",
        "response": "Kym Gyngell",
        "source": "hotpot_qa"
    },
    {
        "query": "Dana White, a former driver for Moy Racing, is now the current president of what mixed martial arts organization?",
        "response": "Ultimate Fighting Championship",
        "source": "hotpot_qa"
    },
    {
        "query": " The concept of imagined geographies originated from an author who defined them as the West's patronizing representations of what?",
        "response": "The East",
        "source": "hotpot_qa"
    },
    {
        "query": "When did the team that won the Frauen DFB-Pokal cup competition in 1995 disband?",
        "response": "2006",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the 1978 BBC musical drama serial that Rosemary Martin acted in?",
        "response": "Pennies From Heaven",
        "source": "hotpot_qa"
    },
    {
        "query": "Shams-uddin Muhammad was the second malik of the Kurt dynasty, he ruled from 1245 until his death in which year?",
        "response": "1278",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the Italian pianist and composer with which Canzoniere Grecanico Salentino performed born? ",
        "response": "23 November 1955",
        "source": "hotpot_qa"
    },
    {
        "query": "Baknaffek samples a song by the impresario who was of what nationality?",
        "response": "English",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American lobbyist, lawyer and politician was once defeated by Bel Edwards?",
        "response": "David Vitter",
        "source": "hotpot_qa"
    },
    {
        "query": "Tiny Moore and James Robert Wills played together in what band?",
        "response": "Texas Playboys",
        "source": "hotpot_qa"
    },
    {
        "query": "Who cared for the castle with which was the caput of Lord of Liddesdale?",
        "response": "Historic Scotland",
        "source": "hotpot_qa"
    },
    {
        "query": "François Ignace Schaal, born and baptized on 5 December 1747 in Colmar (Alsace) and died on 30 August 1833 at Sélestat (Bas-Rhin), was a French general and statesman of which titled series of sweeping military conflicts, lasting from 1792 until 1802, resulting from the French Revolution?",
        "response": "French Revolutionary Wars",
        "source": "hotpot_qa"
    },
    {
        "query": "Island in the Sun is a song on which band's quickest-selling album?",
        "response": "Weezer",
        "source": "hotpot_qa"
    },
    {
        "query": "The regiment that the 6th Battalion, Ulster Defence Regiment grouped into had who as their oldest predecessor?",
        "response": "the 27th Regiment of Foot",
        "source": "hotpot_qa"
    },
    {
        "query": "The Ghanaian footballer nicknamed \"The Bison\" graduated from an academy located in the suburbs of what city?",
        "response": "Bastia",
        "source": "hotpot_qa"
    },
    {
        "query": "Which county in Washington is VAQ-130 located in?",
        "response": "Island County",
        "source": "hotpot_qa"
    },
    {
        "query": "Off Camera is an American interview-based television series, magazine and podcast created and hosted by photographer/director Sam Jones, interviewees featured on \"Off Camera\" have included which American stand-up comedian, actress, producer, and writer?",
        "response": "Sarah Kate Silverman",
        "source": "hotpot_qa"
    },
    {
        "query": "2017–18 Everton F.C. and the 2017–18 Premier League both compete in what sport?",
        "response": "English football",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the unofficial name of the event that caused the man who defeated the great John L. Sullivan to rescind his retirement after hearing of the outcome?",
        "response": "1896 World Heavyweight Championship",
        "source": "hotpot_qa"
    },
    {
        "query": "How many room did the hotel near  The Fremont Street Experience  have when it opened in 1975?",
        "response": "325",
        "source": "hotpot_qa"
    },
    {
        "query": "Which King of Sweden and Norway had a mistress named Jacquette Löwenhielm?",
        "response": "Oscar I of Sweden",
        "source": "hotpot_qa"
    },
    {
        "query": "In 1996 Westbrook College merged with a univeristy that has a campus in what Morocco city",
        "response": "Tangier",
        "source": "hotpot_qa"
    },
    {
        "query": "In which county is this former estate of the heir to a U.S. Steel fortune located where George A. Crawley constructed a house?",
        "response": "Nassau County",
        "source": "hotpot_qa"
    },
    {
        "query": "What stadium is used as the home ground of Levante UD?",
        "response": "Estadi Ciutat de València",
        "source": "hotpot_qa"
    },
    {
        "query": "What U Workin' With was a song from the film based on the dolls created by whom?",
        "response": "Thomas Dam",
        "source": "hotpot_qa"
    },
    {
        "query": "The team which Fabio González Estupiñán played for is in the autonomous community of where?",
        "response": "Canary Islands",
        "source": "hotpot_qa"
    },
    {
        "query": "An article titled \"The Color Line\" was published in the \"North American Review\" in 1881, by Frederick Douglass, who became a national leader of what movement in Massachusetts and New York?",
        "response": "the abolitionist movement",
        "source": "hotpot_qa"
    },
    {
        "query": "Leader II is a 1991 studio album by a glam rock singer who sold over how many records?",
        "response": "20 million",
        "source": "hotpot_qa"
    },
    {
        "query": "Bob Hegman attended the public university founded in what year?",
        "response": "1869",
        "source": "hotpot_qa"
    },
    {
        "query": "Malcolm Subban is a Canadian ice hockey goaltender, and the younger brother of and professional ice hockey defenceman for what team in the National Hockey League (NHL)?",
        "response": "Nashville Predators",
        "source": "hotpot_qa"
    },
    {
        "query": "What city that was a leading member of the Hanseatic League is an independent city in North Rhine-Westphalia?",
        "response": "Dortmund",
        "source": "hotpot_qa"
    },
    {
        "query": "At least how many countries does the company that bought Oil Can Henry's operate in?",
        "response": "100 countries",
        "source": "hotpot_qa"
    },
    {
        "query": "Where does Tiko's Spanish football club hold home games at?",
        "response": "Estadio de López Cortázar",
        "source": "hotpot_qa"
    },
    {
        "query": "The Sisters stars a Canadian-American actor who is known for his role as Will Truman in what sitcom?",
        "response": "Will & Grace",
        "source": "hotpot_qa"
    },
    {
        "query": "My Sentimental Friend was performed by which English beat rock band?",
        "response": "Herman's Hermits",
        "source": "hotpot_qa"
    },
    {
        "query": "Who produced the 2004 Hong Kong action film which Maggie Lau starred in ",
        "response": "Benny Chan",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year did the cricketer, for whom Fanny Rush is best known for her portrait of, retire from all formats of cricket?",
        "response": "2013",
        "source": "hotpot_qa"
    },
    {
        "query": "What's the common ingredient to a Gimlet and Pink Gin?",
        "response": "Plymouth Gin",
        "source": "hotpot_qa"
    },
    {
        "query": "Which was created first, Jenůfa or Dafne?",
        "response": "Dafne",
        "source": "hotpot_qa"
    },
    {
        "query": "Mick Jones and Johnny Van Zant, have which mutual occupation?",
        "response": "musician",
        "source": "hotpot_qa"
    },
    {
        "query": "Noble is a 2014 film written and directed by Stephen Bradley about the true life story of Christina Noble, a children's rights campaigner, charity worker and writer, it stars Sarah Greene, an Irish actress and singer, best known for portraying Helen McCormick in the West End and Broadway productions of what?",
        "response": "The Cripple of Inishmaan",
        "source": "hotpot_qa"
    },
    {
        "query": "In which century was this colonial province established where Anthony Colve served as Dutch naval captain and the Director-General?",
        "response": "17th-century",
        "source": "hotpot_qa"
    },
    {
        "query": "In what year was the sculpture completed that the Galleria dell'Accademia di Firenze is best known as the home for?",
        "response": "1504",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these two musicians, Lee Ranaldo or Ozzy Osbourne, has had a longer music career?",
        "response": "John Michael \"Ozzy\" Osbourne (born 3 December 1948) is an English singer, songwriter, and actor. He rose to prominence in the early 1970s as the lead vocalist of the heavy metal band Black Sabbath.",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is an evergreen, Sciadopitys or Tetrapanax?",
        "response": "Tetrapanax",
        "source": "hotpot_qa"
    },
    {
        "query": "A three hour music festival at the 2017 Teen Choice Awards was hosted by an actor who rose to fame on what video application?",
        "response": "Vine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was the grandfather of the man confined to the American coastal pentagonal bastion fort known for its role in the War of 1812?",
        "response": "Francis Scott Key",
        "source": "hotpot_qa"
    },
    {
        "query": "Who directed the film that was shot in or around Leland, North Carolina in 1986",
        "response": "Stephen King",
        "source": "hotpot_qa"
    },
    {
        "query": "Where did Auguste von Müller play Dalila in 1877?",
        "response": "Grossherzogliches (Grand Ducal) Theater",
        "source": "hotpot_qa"
    },
    {
        "query": "Who passed away first Nina Lawson or Joan Sutherland ?",
        "response": "Nina Lawson",
        "source": "hotpot_qa"
    },
    {
        "query": "Joseph Morgan is best known for his roll in what CW show that eventually spun off into \"The Originals\"?",
        "response": "The Vampire Diaries",
        "source": "hotpot_qa"
    },
    {
        "query": "Which 2008 French film was the third of a four-film adaptation?",
        "response": "Asterix at the Olympic Games",
        "source": "hotpot_qa"
    },
    {
        "query": "Ode to Billy Joe is a 1976 film with a screenplay by Herman Raucher, inspired by the 1967 hit song by Bobbie Gentry, which 1967 song written and recorded by Bobbie Gentry, a singer-songwriter from Chickasaw County, Mississippi?",
        "response": "Ode to Billie Joe",
        "source": "hotpot_qa"
    },
    {
        "query": "Chocolate Starfish Tour was a tour by the band Limp Bizkit to support which of their albums?",
        "response": "Chocolate Starfish and the Hot Dog Flavored Water",
        "source": "hotpot_qa"
    },
    {
        "query": "What was the first official single on Chris Brown's album that is scheduled to release on October 31, 2017?",
        "response": "Party",
        "source": "hotpot_qa"
    },
    {
        "query": "What day was the season finale broadcast live that announced Park Woo-jin was one of the final 11 members?",
        "response": "June 16, 2017",
        "source": "hotpot_qa"
    },
    {
        "query": "A Spanish model that has been the face of Jimmy Choo, and an Italian luxury fashion house that was founded in 1983, is known for what facial feature?",
        "response": "her eyes",
        "source": "hotpot_qa"
    },
    {
        "query": "What professional boxer has a father who's also a boxer and a former circus performer?",
        "response": "Azriel Páez",
        "source": "hotpot_qa"
    },
    {
        "query": "The Monster by Eminem was a top-selling single globally in 2013-14 including New Zealand, and featured which guest singer?",
        "response": "Rihanna",
        "source": "hotpot_qa"
    },
    {
        "query": "Moominpappa at Sea is a loose reference to a novel written by what American author?",
        "response": "Ernest Hemingway",
        "source": "hotpot_qa"
    },
    {
        "query": "The Democratic Majority Leader of the Congressional Friends of Denmark was from what congressional district?",
        "response": "Maryland 's 5 congressional district",
        "source": "hotpot_qa"
    },
    {
        "query": "Were Katie White and Donnie Munro in the same band?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is older, Fred Schepisi or Kanchi Wichmann?",
        "response": "\"Fred\" Schepisi",
        "source": "hotpot_qa"
    },
    {
        "query": "\"Kenny Dies\" is the 13th episode of an animated series created by what two people?",
        "response": "Trey Parker and Matt Stone",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Labour politician was born first Kenneth Younger or Clement Attlee?",
        "response": "Clement Richard Attlee",
        "source": "hotpot_qa"
    },
    {
        "query": "Learjet was founded by which inventor and businessman?",
        "response": "William Powell \"Bill\" Lear",
        "source": "hotpot_qa"
    },
    {
        "query": "The album on which \"If You See Her, Say Hello\" is a song on was released on what date?",
        "response": "January 20, 1975",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Orlando Sanford International Airport or East Texas Regional Airport further West?",
        "response": "East Texas Regional Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which member of Celtic Woman appeared in stage productions of Grease and Legally Blonde the Musical?",
        "response": "Susan McFadden",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the Rocky statue in Zitiste modeled after that also modeled his boxing style after Rocky Marciano?",
        "response": "Rocky Balboa",
        "source": "hotpot_qa"
    },
    {
        "query": "Like the Baltoro Kangri, K12 is present in what range of mountains?",
        "response": "Karakoram mountain range",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the final book in the series that depicts a society that has eliminated emotion and color to attempt to achieve equality?",
        "response": "Son",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of these two restaurant chains is based in Oakhurst, California, Pizza Factory or Pagliacci Pizza?",
        "response": "Pizza Factory",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the movie with the actor Simon Baker released?",
        "response": "2005",
        "source": "hotpot_qa"
    },
    {
        "query": "Kabhi Kabhie (Hindi: कभी कभी, English: \"Sometimes\") is a Indian Hindi romantic drama film, produced and directed by Yash Chopra, film lyricist Sahir Ludhianvi won the Best Lyricist Award for \"Kabhi Kabhie Mere Dil Mein,\" the song which also got singer Mukesh, the Best Male Playback Singer award, is a song from which year Bollywood movie \"Kabhi Kabhie\" ?",
        "response": "1976",
        "source": "hotpot_qa"
    },
    {
        "query": "On what day was the first appearance of a three-time British Soap Award for Best Comedy Performance winner on the British soap opera \"Coronation Street\"?",
        "response": "26 November 2008",
        "source": "hotpot_qa"
    },
    {
        "query": "What programming block are the two shows that Kim Seung-hyun has appeared on?",
        "response": "Sunday Night",
        "source": "hotpot_qa"
    },
    {
        "query": "Park Bo-ram made her debut with release digital single \"Beautiful\" featuring the leader of what boy group?",
        "response": "Block B",
        "source": "hotpot_qa"
    },
    {
        "query": "Which village is just north of the A-road in Lincolnshire which runs between Wragby and Maltby le Marsh (approximately 26 mi)?",
        "response": "Strubby",
        "source": "hotpot_qa"
    },
    {
        "query": "Satellite High school was founded in what year and what is on the end of a scorpions tail",
        "response": "1962",
        "source": "hotpot_qa"
    },
    {
        "query": "Which game did the author of the e-book \"How to Win at the Sport of Business\" play for charity at Intel Extreme Masters Season X – San Jose?",
        "response": "League of Legends",
        "source": "hotpot_qa"
    },
    {
        "query": "What geographical area of England is Leavesden, Hertfordshire located?",
        "response": "southern",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the French businessman who serves as the chief executive office for the French multinational mass media conglomerate headquartered in Paris and formerly Vivendi Universal SA  born?",
        "response": "26 April 1964",
        "source": "hotpot_qa"
    },
    {
        "query": "Seminary Hill School was located in this community that hosts what airport?",
        "response": "Lebanon Municipal Airport",
        "source": "hotpot_qa"
    },
    {
        "query": "Which magazine was created first, Chatelaine or Arthur's Magazine?",
        "response": "Arthur's Magazine",
        "source": "hotpot_qa"
    },
    {
        "query": "which musical opera or drama, Singspiel or Fedora, is a most notable work from Giordano?",
        "response": "Fedora",
        "source": "hotpot_qa"
    },
    {
        "query": "Are both Copella juice products and Tizer made purely from fresh fruits?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "What are the occupations of both Amos Oz and Isabel Allende?",
        "response": "writer",
        "source": "hotpot_qa"
    },
    {
        "query": "What band that Mike Peters worked with was formed in Dunfermline, Fife, in 1981?",
        "response": "Big Country",
        "source": "hotpot_qa"
    },
    {
        "query": "What even aired on TBS in Japan and HDNet in North America with the official commentator being previously known simply as Nozomi during her fashion modeling career?",
        "response": "Dynamite!! 2010",
        "source": "hotpot_qa"
    },
    {
        "query": "Which philosophical movement that developed in the late 1820s and 1830s is Frederic Henry Hedge part of ",
        "response": "Transcendentalism",
        "source": "hotpot_qa"
    },
    {
        "query": "Where is the terrorist group that has been attributed to the 2014 Jos bombings based?",
        "response": "northeastern Nigeria",
        "source": "hotpot_qa"
    },
    {
        "query": "In which film did Shirley Henderson appear with Tilda Swinton",
        "response": "Okja",
        "source": "hotpot_qa"
    },
    {
        "query": "Chinese pickles is usually done using high-fiber vegetables and fruits, such as which Chinese leaf vegetables often used in Chinese cuisine?",
        "response": "Chinese cabbage",
        "source": "hotpot_qa"
    },
    {
        "query": "What high school is located in the town in which most television stations in the Louisvillve market have their transmitter facilities located? ",
        "response": "Floyd Central High School",
        "source": "hotpot_qa"
    },
    {
        "query": "Kate Mailer starred in Jean-Luc Godard's adaptation of which play featuring the character Lear, Cordelia and Edgar?",
        "response": "William Shakespeare play \"King Lear\"",
        "source": "hotpot_qa"
    },
    {
        "query": "What profession has both Ivan Fesenko and Mark Krein held?",
        "response": "mathematician",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the scientific name for the type of bird Scrappy Moc is?",
        "response": "Mimus polyglottos",
        "source": "hotpot_qa"
    },
    {
        "query": "In what city was the draft where Calvin Andre \"C.J.\" Miles Jr. was drafted by the Utah Jazz held?",
        "response": "New York City",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Sanshui District and Rushan, Shandong connected?",
        "response": "China",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born first, Javier Frana or Sherwood Stewart?",
        "response": "Sherwood Stewart",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was born earlier, Isabel Colegate or Alfred Bester?",
        "response": "Alfred Bester",
        "source": "hotpot_qa"
    },
    {
        "query": "What black comedy crime film was awarded the Palme d'Or at the 47th Cannes Film Festival in 1994?",
        "response": "Pulp Fiction",
        "source": "hotpot_qa"
    },
    {
        "query": "ZZ Ward was a guest appearing in the release of what artist's hip hop recording?",
        "response": "Asher Roth",
        "source": "hotpot_qa"
    },
    {
        "query": "A British officer of the Royal Navy best known for his 1791-95 expedition first charted what in 1793?",
        "response": "Cascade Inlet",
        "source": "hotpot_qa"
    },
    {
        "query": "How many years in office did the councillors elected from a town 20 km south of Dublin City serve?",
        "response": "five-year",
        "source": "hotpot_qa"
    },
    {
        "query": "When was the actor born who starred in Sugarfoot?",
        "response": "January 23, 1898",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote and directed the film that Samuel Pack Elliott played The Caretaker in?",
        "response": "Mark Steven Johnson",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of art started as a flip book in early times but has been used to make films such as \"Life is Cool\" in 2008?",
        "response": "Korean animation",
        "source": "hotpot_qa"
    },
    {
        "query": "Absolute Anthology 1965 to 1969 is a compilation album by the first rock and roll act from Australia to score what?",
        "response": "an international pop hit",
        "source": "hotpot_qa"
    },
    {
        "query": "How many National Film Awards did the main actor in Awaargi win?",
        "response": "two National Film Awards",
        "source": "hotpot_qa"
    },
    {
        "query": "Who wrote the song \"When I'm Sixty-Four?",
        "response": "Paul McCartney",
        "source": "hotpot_qa"
    },
    {
        "query": "Which of the following documents the issues of the LGBT community: Pride Divide or The Big Melt?",
        "response": "Pride Divide",
        "source": "hotpot_qa"
    },
    {
        "query": "During World War II the Chairman of the Red Cross Aid to Russia Fund was a Baroness and wife of who?",
        "response": "Sir Winston Churchill",
        "source": "hotpot_qa"
    },
    {
        "query": "William Shakespeare's As You Like It, was later written for film in which Bryce D. Howard played which protagonist character? ",
        "response": "Rosalind",
        "source": "hotpot_qa"
    },
    {
        "query": "How tall is this luxury hotel and casino resort in Macau where the winners of 14th IIFA Awards were announced?",
        "response": "39-story",
        "source": "hotpot_qa"
    },
    {
        "query": "Saving Grace starred what American actor who played William Adama in Battlestar Galactica?",
        "response": "Edward James Olmos",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American singer and songwriter has a mezzo-soprano vocal range, Tim Armstrong or Tori Amos?",
        "response": "Tori Amos",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the population of the city where the Palatka Water Works is located",
        "response": "10,558",
        "source": "hotpot_qa"
    },
    {
        "query": "Which American distance runner who died in an automobile accident in Oregon had a trail named after him?",
        "response": "Steve Prefontaine",
        "source": "hotpot_qa"
    },
    {
        "query": "Which school allows students to cross-register at Brandeis University, Rutgers University or Wellesley College?",
        "response": "Wellesley College",
        "source": "hotpot_qa"
    },
    {
        "query": "are Peter Segal and Henry Winkler both authors ?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Which Ology track features Lil' Fizz's cousin?",
        "response": "Skipping Stones",
        "source": "hotpot_qa"
    },
    {
        "query": "What company did the husband of Brynne Edelsten found?",
        "response": "Allied Medical Group",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the publisher of the World's Mightiest Immortal , a fictional character, who is a villain to a fictional superhero appearing in American comic books published by DC Comics also known as Shazam ?",
        "response": "Fawcett Comics",
        "source": "hotpot_qa"
    },
    {
        "query": "Judy Clarke defended an American domestic terrorist convicted for a series of anti-abortion and anti-gay-motivated bombings across the southern United States know as what?",
        "response": "the Olympic Park Bomber",
        "source": "hotpot_qa"
    },
    {
        "query": "In which U.S. city did Kyle Richardson begin his college football career?",
        "response": "Jonesboro, Arkansas",
        "source": "hotpot_qa"
    },
    {
        "query": "Thorvald Eiriksson, was the son of Erik the Red and brother of who?",
        "response": "Leif Erikson",
        "source": "hotpot_qa"
    },
    {
        "query": "Bellini and Vesper, are which type of drink?",
        "response": "cocktail",
        "source": "hotpot_qa"
    },
    {
        "query": "In & Out is a 1997 American romantic comedy film directed by Frank Oz and starring Kevin Delaney Kline, an American film and stage actor and singer, he's won how many Tony Awards, among other various awards?",
        "response": "three",
        "source": "hotpot_qa"
    },
    {
        "query": "Polar Golfer is a PC based video game released by WildTangent in which year, it is sometimes bundled with Dell computers, a multinational computer technology company based in Round Rock, Texas?",
        "response": "2004",
        "source": "hotpot_qa"
    },
    {
        "query": "how is Lewisia and Heliconia connected?",
        "response": "plant",
        "source": "hotpot_qa"
    },
    {
        "query": "Noall Wooton was the lead prosecutor of which person who demanded the death penalty for his own trial and was the first person to be executed in 1976?",
        "response": "Gary Gilmore",
        "source": "hotpot_qa"
    },
    {
        "query": "What type of media does Agnieszka Holland and Chris Carter have in common?",
        "response": "film",
        "source": "hotpot_qa"
    },
    {
        "query": "What television thriller anthology did the winner of one Golden Globe, two tony Awards and six Primetime Emmy Awards appear on?",
        "response": "Darkroom",
        "source": "hotpot_qa"
    },
    {
        "query": "Kindada Jones' is the daughter of composer Quincy Jones and what 1970 Golden Globe Winner for Best Actress in a Television Drama? ",
        "response": "Peggy Lipton",
        "source": "hotpot_qa"
    },
    {
        "query": "What award did Ladies vs Ricky Bahl actress, Parineeti Chopra win?",
        "response": "Filmfare and National Film Award",
        "source": "hotpot_qa"
    },
    {
        "query": "The Fur Act 1337 was passed during the reign of which king who took over after the death of Edward II?",
        "response": "Edward III",
        "source": "hotpot_qa"
    },
    {
        "query": "Hans Multhopp worked at the Focke-Wulf Flugzeugbau AG with a designer born in which year ?",
        "response": "1898",
        "source": "hotpot_qa"
    },
    {
        "query": "What company developed a new simulation strategy video game depicting theme park management similar to \"RollerCoster Tycoon\" in 2006?",
        "response": "Frontier Developments",
        "source": "hotpot_qa"
    },
    {
        "query": "Between Vinca and Dieffenbachia, which genus has range that extends further north?",
        "response": "Vinca",
        "source": "hotpot_qa"
    },
    {
        "query": "Is the film Lascars or the film McDull, Kung Fu Kindergarten from Hong Kong?",
        "response": "McDull, Kung Fu Kindergarten",
        "source": "hotpot_qa"
    },
    {
        "query": "In what sub-provincial city is the Affiliated High School of Sichuan University located?",
        "response": "Chengdu",
        "source": "hotpot_qa"
    },
    {
        "query": "Joe Cornish made his directorial debut in the comedy film that starred whom?",
        "response": "John Boyega, Nick Frost, Jodie Whittaker and Luke Treadaway",
        "source": "hotpot_qa"
    },
    {
        "query": "Sand Mountainis part of the southern tip of a mountain chain in which part of North America ?",
        "response": "eastern North America",
        "source": "hotpot_qa"
    },
    {
        "query": "American duo Daryl Hall & John Oates' song peaked at number 2 on the \"Billboard\" Hot 100 behind which song from Paul McCartney's album, \"Pipes of Peace\"?",
        "response": "\"Say Say Say\"",
        "source": "hotpot_qa"
    },
    {
        "query": "How many languages does the Dutch Caribbean-born professional baseball player speak who is noted for having hit a home run in the Major Leagues?",
        "response": "five languages",
        "source": "hotpot_qa"
    },
    {
        "query": "Puma evoPOWER was marketed by what Spanish professional footballer?",
        "response": "Francesc \"Cesc\" Fàbregas Soler",
        "source": "hotpot_qa"
    },
    {
        "query": "John Elwood Schweitz, is a retired American basketball player in the National Basketball Association (NBA), he played in two NBA seasons, for which American professional basketball team based in Seattle, Washington? ",
        "response": "Seattle SuperSonics",
        "source": "hotpot_qa"
    },
    {
        "query": "In \"The Simpsons\"' episode \"I Married Marge,\" Marge thinks she may be pregnant and visits which doctor whose voice is provided by Harry Shearer?",
        "response": "Dr. Hibbert",
        "source": "hotpot_qa"
    },
    {
        "query": "Which is a type of vine, Maytenus or Dactylorhiza?",
        "response": "Maytenus",
        "source": "hotpot_qa"
    },
    {
        "query": "The Wonderful Thing About Tiggers was a song that led to a Grammy by the ventriloquist whose career flourished in what decades?",
        "response": "1950s and 1960s",
        "source": "hotpot_qa"
    },
    {
        "query": "which Italian actress featured in  Hardbodies 2",
        "response": "Fabiana Udenio",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the American sportscaster who hosted Dazzling Dunks and Basketball Bloopers in1989?",
        "response": "Marv Albert",
        "source": "hotpot_qa"
    },
    {
        "query": "Jeffrey Lau and Uwe Boll, are both from the film industry?",
        "response": "yes",
        "source": "hotpot_qa"
    },
    {
        "query": "\"These Are the Vistas\" was released on a label owned by what company?",
        "response": "Sony Music Entertainment",
        "source": "hotpot_qa"
    },
    {
        "query": "Who is the director of a film which featured the winner of FX's inaugural MMA competition?",
        "response": "James Z. Feng",
        "source": "hotpot_qa"
    },
    {
        "query": "Racists Anonymous had a first meeting after the murder perpetrated by which white supremacist?",
        "response": "Dylann Storm Roof",
        "source": "hotpot_qa"
    },
    {
        "query": "Is Beizhen in the same province as Ruzhou?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Paul Migliazzo was drafted to which NFL team in 1987 under coach Mike Ditka?",
        "response": "Chicago Bears",
        "source": "hotpot_qa"
    },
    {
        "query": "During the winter of 1776-1777, Simonds' Regiment of Militia was at a fort located in which US state ?",
        "response": "New York",
        "source": "hotpot_qa"
    },
    {
        "query": "The Rydal Water sits along side this village known as a tourist destination.",
        "response": "Grasmere",
        "source": "hotpot_qa"
    },
    {
        "query": "Which ITV2 documentary series did the band made up of Lee Brennan, Jimmy Constable and Simon Dawbarn reform for in 2012?",
        "response": "\"The Big Reunion\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Who leads the editorial team for the New York Observer, one of whom is an American film critic and co-host of the television show 'At the Movies'?",
        "response": "Ken Kurson",
        "source": "hotpot_qa"
    },
    {
        "query": "The largest mixed martial arts organization in the world held and event in what Japanese city on April 14, 2000?",
        "response": "Tokyo, Japan",
        "source": "hotpot_qa"
    },
    {
        "query": "What is the name of the person who created  a cartoon animation in 1977 based on a 1937 book by J.R.R Tolkein? ",
        "response": "Arthur Gardner Rankin Jr.",
        "source": "hotpot_qa"
    },
    {
        "query": "What do Hedley Mascot Mine and Ruth Mine have in common?",
        "response": "gold mine",
        "source": "hotpot_qa"
    },
    {
        "query": "Who was with the cosmonaut who commanded the historic Voskhod 2 mission which saw the first man walk in space in 1965 ?",
        "response": "Alexey Leonov",
        "source": "hotpot_qa"
    },
    {
        "query": "Cleopatra Mathis, is an American poet who since 1982 has been the Frederick Sessions Beebe Professor in the English department at Dartmouth College, and is a faculty member at The Frost Place, a museum and nonprofit educational center for poetry located at Robert Frost's former home in Franconia, New Hampshire, in which country?",
        "response": "United States",
        "source": "hotpot_qa"
    },
    {
        "query": "Did William Studeman or Robert James Woolsey Junior serve in the Central Intelligence Agency under George Bush and Bill Clinton?",
        "response": "William Oliver \"Bill\" Studeman",
        "source": "hotpot_qa"
    },
    {
        "query": "Are Carnegie Mellon University and Pokhara University both located in the United States?",
        "response": "no",
        "source": "hotpot_qa"
    },
    {
        "query": "Assassins is a 1995 American action thriller film directed by Richard Donner. [2] The screenplay was by Andy and Larry Wachowski, American film directors, screenwriters, and producers, made their directing debut in 1996 with what film?",
        "response": "\"Bound\"",
        "source": "hotpot_qa"
    },
    {
        "query": "Vera Lynn 100 is a compilation album that features collaborations with a an English tenor and actor, notably performing in what?",
        "response": "musical theatre",
        "source": "hotpot_qa"
    },
    {
        "query": "Which National Park contains the summit for the Blue Ridge Mountains and is part of the National Wilderness Preservation System?",
        "response": "Shenandoah National Park",
        "source": "hotpot_qa"
    }
]